[
    [
        {
            "content": "\"It was inevitable!\" - Oda Nobunaga.\r\nNobunaga The Fool is a pleasant surprise of this season, a very curious yet enjoyable mix of many genres : Mecha, Sengoku Period, Sci-Fi, Fantasy & Romance, which may raise many brows given the unique sense of history of this anime, but that flamboyant extravagance has many charms, just like the main protagonist, Oda Nobunaga, a foolish and persistant man who aims to conquer heavens and earth as he is said to be the Savior-King by his allies, Jeanne d'Arc and Da Vinci. His resolve and potential steadily draws other characters to him, allies and enemies alike. Gaius Julius Caesar,King Arthur and many other notable historical figures make their entrance, while the internal strife of the Oda clan is at its peak. Nobunaga The Fool shows us foolishness, determination, betrayal, sacrifices, hope, and love. It appeals to our emotions and keeps the suspens till the very end. The well executed overall presentation manages to catch our attention with an impredictable conquest, a rich cast of voice actors, a beautifully handled animation and a very memorable soundtrack. The fast paced story, the intense interactions between the characters, the epic battle scenes, and the subsequent plot twists make it an anime you look forward to where it would take you.",
            "date": "2014-04-14T05:42:00+00:00",
            "helpful_count": 89,
            "mal_id": 139891,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3427427.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miwars",
                "username": "miwars"
            },
            "url": "https://myanimelist.net/reviews.php?id=139891"
        },
        {
            "content": "Nobunaga the Fool is a jack of all genres, master of none.\r\nIt has an awesome premise—a reconstruction of Oda Nobunaga’s rise to power within a mecha-filled, pseudo-historical setting. Anachronism definitely has the potential to produce beautiful things (e.g. Gintama or Samurai Champloo), and going into this show, I was excited to see how its producers would handle a historical/mecha fusion. Now that I’ve completed it, I’m disappointed to say that it felt more like a disjointed mishmash of genres than a smooth blend.\r\nWhen I say that NtF was a mishmash of genres, I don’t just mean historical and mecha. It was often fantasy, occasionally supernatural,sometimes shounen, sporadically romance, and towards the end, sci-fi as well. Hence the comparison to a jack of all trades, master of none. NtF essentially gave itself too much to do. It had too many themes to neatly put together and ended up spending time focusing on different subjects without really combining them. There were magical evil imp children, melodramatic love triangles, power-ups with spirit dragons and cyborg limbs (I'm not even kidding), and so on. In the end, it was hard to tell what exactly the series was supposed to be about. \\n\\n\r\nMy score is 5.9/10. Read below for the full review + rating breakdown.\\n\\n\r\n- - -\\n\r\nStory = 5/10\\n\\n\r\nLayout:\\n\r\nIf you want to enjoy NtF, be ready to suspend your disbelief. The show is a war story takes place on two stars, east and west. The east star is dominated by Japanese warlords from the Sengoku period. The west star is dominated by random famous Europeans plus Chandra Gupta. (If you're a stickler for historical accuracy, you probably won't like this anime.) As you might guess, the allusions and references are all over the place. Here’s a small sample of the references made in NtF: Schrodinger’s cat, Excalibur, and Hercules—and that’s only in one episode.\\n\\n\r\nThe topic for each episode is set by tarot cards. At some point in each ep, a new card is revealed (like Hanged Man or Empress), and the card signifies a character or event during that episode. It's generally predictable, but it does make the anime more entertaining. The idea is admittedly clever.\\n\\n\r\nCharacters spend a lot of time fighting over regalia, which are mystical pendants that grant physics-defying upgrades to giant war armors (NtF's mechas). When activated, they draw from the power of ley lines and cause extra weapons to immediately materialize. Yeah...just roll with it.\\n\\n\r\nPlot:\\n\r\nThere's a prophecy that two kings will be born—a Savior King and a Destroyer King whose destinies are to save and destroy the world, respectively. The higher-ups on the west star believe that Arthur, an enigmatic and seemingly faceless man, is the Savior King. After Jeanne Kaguya d'Arc has premonitions of an east star warrior named Oda Nobunaga, she and Leonardo da Vinci defect to the east star to see if he's the actual Savior King. They join the Oda clan, and Jeanne goes into disguise as a page named Ranmaru. Nobunaga and co. then continue their efforts to unite heaven and earth. Or conquer the world. Whichever sounds better.\\n\\n\r\nThe plot isn't too hard to follow, but it's still unnecessarily contrived. Things get especially confusing during the last few episodes.\\n\r\n- - -\\n\r\nCharacterization = 3/10\\n\\n\r\nWarning: characters' personalities don't necessarily reflect those of their historical counterparts. (Don't expect Jeanne to be a badass warrior. You will be disappointed.) The names are just there for the sake of making characters look cooler. The east star warlords at least bear some resemblance to the figures on whom they're based, but the west star knights of the round table (which include members like Hannibal Barca and Alexander the Great, and are not to be confused with King Arthur’s other knights of the round table) show little to no evidence of historical context. Caesar says “veni, vidi, vici.” Cool. Hannibal and Charlemagne speak to each other in French. Nifty. That's all you really get, in terms of historical influence. You won't be getting any Fate/Zero sort of background info on the characters, either.\\n\\n\r\nHistorical inaccuracy aside (Jeanne Kaguya d'Arc...really? I know she's supposed to be a pseudo-Mori Ranmaru and have ties to the east star, but come on), the characters at least have interesting, distinct personalities. The reason why I'm giving a 3 instead of a 1 or 2 is because the character types aren't any less than what you'd get from your average action anime. A lot of the supporting chars may be one-dimensional, but they're rarely boring.\\n\\n\r\nMoving on, the biggest qualm I have regarding characterization is that the main characters have these little tics and habits, and the show abuses the heck out of them. Mitsuhide flips his hair. Hideyoshi rubs his nose. Nobunaga adjusts his shirt sleeves. I've seen each of these happen at least once per episode. Why do I say they're abused? Habits are supposed to reflect a character's personality, not define it. The habits shown in NtF are extremely overstated and, for the most part, not special. Among other things, the issue with the habits highlights how static the characters are. Their most obvious traits are literally tiny habits.\\n\\n\r\nQuick note about development: the main characters do go through changes in their ambitions and temperaments, but the changes are often sudden and not sufficiently explained.\\n\r\n- - -\\n\r\nArt = 8/10\\n\\n\r\nYou can tell a LOT of the animation budget went into the giant war armors, which are the only things that are CG. They look gorgeous, and fight scenes look amazing. Unfortunately, although the art is very good overall, the discrepancy between quality for giant war armors and everything else is pretty noticeable. The CG animation = 10, the rest = 7.\\n\\n\r\nInteresting thing I noticed: in the Owari setting, you see the same looped animation of this dude ringing a bell for every invasion scene. The only explanation is that the guy is secretly immortal and never rests, eats, or gets hurt even when his city is being attacked by laser beams.\\n\r\n- - -\\n\r\nVoice Acting = 9/10\\n\\n\r\nThe voice acting is great overall, though a little over-the-top at times. (The “over-the-top” part applies mostly to Hideyoshi. As much as I love Kaji Yuki, I think I've heard him make enough monkey noises to last a lifetime.)\\n\\n\r\nAdditional props to Miyano Mamoru, Sugita Tomokazu, and Nakamura Yuichi for pulling off Nobunaga, da Vinci, and Caesar so well.\\n\r\n- - -\\n\r\nMusic 6/10\\n\\n\r\nThe BGM is a mix of traditional and orchestral music. It fits the series well, but isn't exceptionally good. The most memorable tracks are the ones played during the more intense scenes; they're one of the things I like most about NtF.\\n\r\n- - -\\n\\n\r\nStory (25%) = 50\\n\r\nCharacterization (25%) = 30\\n\r\nArt (20%) = 80\\n\r\nVoice Acting (15%) = 90\\n\r\nMusic (15%) = 60\\n\\n\r\nTotal = 59/100 = 5.9/10 —> 6\\n\\n\r\nThanks for reading!",
            "date": "2014-06-25T02:18:00+00:00",
            "helpful_count": 76,
            "mal_id": 148471,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1409919.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mechato",
                "username": "mechato"
            },
            "url": "https://myanimelist.net/reviews.php?id=148471"
        },
        {
            "content": "*Spoiler free*\r\nThere are generally two kinds of anime that are difficult to follow. The first is the likes of classics such as Texhnolyze or Serial experiments Lain, where the show was intentionally made convoluted by the authors in order to leave interpretation up to the viewer. These are shows that are purposefully made with the assumption that the viewer must decipher the plot for a philosophical reason.\r\nThe second type are shows that are convoluted not in order to convey anything special, but because the writers of the show have absolutely no idea what they are doing and couldn't write a good story to save theirpathetic behinds.\\n\\n\r\nThis anime is unfortunately the second type. It's actually kinda sad, because when watching it you can really see that the POTENTIAL for a good show is there, but it just isn't well written enough in any respect to be enjoyable. I found myself watching it to the end, hoping it would eventually get its act together, but it just never did. \\n\\n\r\nThe problem here is this anime tried tossing far too many concepts into the story without paying attention to the quality of any of them. There is a hint of romance, but it is never well done enough to be interesting. There are many characters that seem engaging at first, but are never fleshed out enough or developed to grab your attention. More than half the characters motives for their involvement in the overall story are never even explained. The plot itself is a mess, going through far too many changes with never enough details for any of them to matter. There is no sense of wonder or suspense whatsoever. It throws in historical references, but all of them turned out to be excuses for poor writing and few of them were accurate. The action scenes are decent, but because it's hard to care about the overarching plot behind them they aren't interesting either.\\n\\n\r\nNobunaga the Fool is like the Action-52 of anime. Tons of genres, tons of ideas, but none of them well done. \\n\\n",
            "date": "2014-12-08T10:38:00+00:00",
            "helpful_count": 36,
            "mal_id": 171441,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4307191.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HolyMushroom",
                "username": "HolyMushroom"
            },
            "url": "https://myanimelist.net/reviews.php?id=171441"
        },
        {
            "content": "A show like Nobunaga the Fool will make you look like a fool at first glance. The premise sounds absurd, not to mention foolish and the first episode stops nothing at all to make viewers ask themselves what is going on. What it offers is a mixture of historical figures ranging from Joan of Arc, Leonardo da Vinci, Da Vinci, King Author, among others. It doesn’t stop there however. Rather, it steps up one more stage and decides to make usage of mecha warfare in a world of the unknown. Nobunaga the Fool is the type of show where you’ll be watching it trying toescape a labyrinth.\\n\\n\r\nTo venture into a show like Nobunaga the Fool will take an imaginative and open mind. While it seems absurd at first glance, one should acknowledge the creativity of the show. For instance, take a closer look at the setting. It’s divided into two halves, the West and East Star. Upon a closer glance, there’s conflicts in their world involving warfare. And as even a fool can guess, the show trifles by the idea of war as result of ideologies. But let’s go back to the basics. The show fuses together legendary historical figures, tosses in the mechanics of mecha, and empowers them in this bizarre setting.\\n\\n\r\nFor what’s worth, we get fusion of a steampunk/historical setting. The characters involved in the show may seem to be related to their legendary ancestors. Yet, their similarities only seems to scratch its historical domain. Starting off, there’s a blur of reality as Jeanne Kaguya d’Arc (based off of the character ‘Joan of Arc’), is burned at a stake in a typical witch hunt endgame style. Then flash forward and we find out that she has a powerful object that can potentially influence the world. Not only that but she also has visions relating to the one individual that will save the world, also known as the Fool, Oda Nobunaga. Here’s where the fun comes in. Oda Nobunaga is exactly as his name states. Not only is he the titular character but he is literally portrayed as a fool with his brash personality. His actions and behavior will get people talking despite it being harmless, on occasions anyways. But looking carefully, Nobunaga is a man that’s difficult to understand. It’s not an understatement either since his character is a representation of The Fool card based off of the tarot legend. The tarot cards bring about a purpose that serves as a fortitude of each episode. But behind those cards lies a meaning that unlocks each episodes’ morality through imagery, perhaps relating to the true visage of our titular character.\\n\\n\r\nNobunaga the Fool isn’t just about making a prophecy come true.  Throughout the series, we see different sides of Nobunaga and Jeanne. Nobunaga for instance is portrayed as a hotheaded man that he seems to wear like a mask. Yet, we do see a different side of him when he is with those closer with others, such as his family like his sister Ichihime. Later on, Nobunaga’s relationship/partnership with Jeanne grows closer. It reaches to a point where he strives to protect her no matter what. At the apex, he puts his own life on the line to save hers. And as seemingly incompatible as the duo is at first, Jeanne herself also develops feelings throughout their journey. Originally, she questions herself whether it’s worthwhile to accompany Nobunaga. Later, there’s a 180 degree turn where she strives to help him no matter what. To point it in easier perspective, the duo becomes more than just partners in crime. There’s even instance of Jeanne seemingly question what she is to him. Unfortunately, the romance angle of the show is vague, with only sparkles towards the end. It fails to communicate that part of the message without a meaningful purpose in the first place.\\n\\n\r\nFigures and legends that historians have been studying for ages. Nobunaga the Fool is a collection of noticeable characters from various backgrounds. One character of notoriety is Leonardo da Vinci. In contrast to Nobunaga, he is a man of intelligence known for his inventions from the West. His role as a journeyman is to seek out truth. Rather than power, he strives for knowledge and acts as a guide. With Nobunaga are also two other companions known as Akechi Mitsuhide and Toyotomi Hideyoshi. They serves as his arms and legs during his travels and yes, they are based off of historical figures from Feudal Japan. And finally, we can’t forget about someone that longs for Nobunaga’s attention. Serving as a love interest, Himiko (the queen of Yamato) makes offers to Nobunaga in exchange for one simple thing: his love. But a show like this only demonstrates love with a cliche way. It’s more like a niche, a badly executed one if it tries to construct a Romeo & Juliet story. The lack of chemistry is apparently present and their only closeness seems to be their common interests. On other hand, Nobunaga’s chemistry with his family makes up much more of his character. In one later episode, it truly brings out Nobunaga’s visage behind the mask he is wearing as he shows his sincerity, rage, and regret.\\n\\n\r\nIt’s hard to describe the style of Nobunaga the Fool. Absurd would be one of them for its package of colorful characters. Yet, the story itself does make sense later on when dangerous antagonists are thrown in and plot holes are formulated in Nobunaga and Jeanne’s quest. What stands between them is more than ideologies, but also weapons that can wipe them off the planet. The world this show takes place in has adapted the usage of mecha. Now, this comes with an odd mix because their world obviously has historical themes such as the shrines and temples. Nonetheless, mecha exist and stands for a testimony for being a superpower as a destructive ways of combat. The mecha are described as ‘sacred treasures’. Nobunaga pilots one of them which he nicknames “The Fool”. This doesn’t occur until after it’s unlocked by Jeanne with a little device known as the ‘regalia’. At that point, the show starts venturing off into a more sci-fi zone. Not only that but other characters also get their own mecha. It becomes absurd to a point of deconstruction where characters fight for affairs using these mecha devices despite having little to no experience prior. And here, I thought the taste of anachronism was weird.\\n\\n\r\nArtwork comes together clustered but that’s because the fusion of historical and science backgrounds added together in a mix. When you have that, it comes out as zany. Yet, most of the designs are solid in particular with the world class backgrounds. It’s creative and invites attention to questions for viewers behind its origins. This can also apply to the mecha with their innovative designs that gives them a menacing appearance. The action they demonstrate will draw in eyes for attention with rapid movements thanks to its artillery. The characters themselves also have a good balance of mixture with their designs. Nobunaga looks like a badass, he behaves like a badass, and technically, he is a badass. Other characters such as Da Vinci, Ichime, and Hideyoshi stays true to their consistent character designs to match the right persona. On the other hand, Jeanne is hard to take seriously. Despite being portrayed as a stunning beauty with her long blonde hair, curves, and figure, her character doesn’t match at all with the historical counterpart. It’s just too damn silly.\\n\\n\r\nJudgment of its soundtrack goes towards mostly for our characters’ voice mannerism since the show focuses a great deal to portray them individually. Of all the main characters, Nobunaga stands out the most with his commanding tone, intimidating nature, but also the same time a man heart of gold. However, others such as Himiko and Jeanne can come off as forceful with their voice mannerisms in particular during climatic scenes. On the other hand, background music has a decent degree of variances. It feels natural despite all the absurdity going on on occasions. The OP and ED songs also provide support for its moderate coordination with the OST.\\n\\n\r\nIt’s easy to say that Nobunaga the Fool isn’t for everyone. Even if you’re a historian, this show will at times dance around with its gimmicks to a point of deconstruction. But looking closely, the show have some merits to its themes and style. It’ll take time to get used to it but some patience may pay off. On the other hand, be ready for some cliché and gags that can be hard to praise with everything thrown together. The story itself is also clustered with weak writing and uninteresting characterization when it comes to development. All in all, this show isn’t like reading a history book to get its message. Rather, it’s like a foolish textbook of literature taught by a professor of the coming ages.\\n",
            "date": "2014-08-06T22:52:00+00:00",
            "helpful_count": 29,
            "mal_id": 155599,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=155599"
        },
        {
            "content": "Nobunaga the Fool is essentially an anachronism stew of notable historical figures of eastern and western lore from different time periods living on two separate planets with war slowly erupting between them as the western planet has their own heinous desires with the eastern planet unveiled throughout the course of the series. The series very loosely adapts elements to the historical personas of each character in the series with some of the major characters (particularly Jeanne and Nobunaga) gaining aspects of the historical character they are based off of while many of the Westerners don't get much to them beyond being archetypal evil characters perJapan's usual penchant of demonizing other countries in their works. Mecha, magic and elements of steampunk are also tossed into the mix as mecha serve as the main means of combat for the military in this series with powerful gems called Regalia that serve to amplify the abilities of a mecha and Leonardo Da Vinci milking use of fortunetelling to foretell upcoming events within the series.\\n\\n\r\nThe first half of the series sets up Nobunaga's rise to becoming the ruler of his clan and exploring the world of his planet as he gets into conflict with other clans, claims Regalia and hints are dropped over the lurking threat of the Western Planet's influence. This point of the series was solid in that it helped establish the backgrounds and problems facing the major characters of the series and the world of the Eastern Planet.\\n\\n\r\nUnfortunately, the second half is where things start becoming a mess with the title's plot as many of the major Western Planet characters lack the depth and personality of the Eastern Planet ones and makes an attempt at trying to be an epic clash between the Western and Eastern sides yet comes across as more predictable thanks to its milking of action and mecha anime cliches. It also tries establishing an unconvincing love triangle with Nobunaga, Jeanne and Himiko that doesn't get much focus thanks to the plot's greater focus on the conflict between the Western and Eastern planets. Also, the ending of the series is rather awkward as details on aspects of character motives and prophecies are suddenly tossed into the series finale without any hints to their coming or earlier exploration of them.\\n\\n\r\nVisually, the series is one of the better-quality titles I've seen for the year thus far with vivid scenery and a good amount of detail with scenery and character designs. The mecha used in the series are rendered in CG animation and move fluidly in action during heated battle scenes, though they stick out quite prominently compared to the regular animation.\\n\\n\r\nOverall, I found Nobunaga the Fool to be a case of an anime that started off well for its first half, yet crashes and burns for its second half. What started off as solid character focus and plot buildup devolved into fairly typical territory that action/ mecha titles delve into and a subpar attempt at trying to be grandiose with later plot developments. Kind of regret having to go through the second half of this title.",
            "date": "2014-06-22T17:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 148091,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=148091"
        },
        {
            "content": "First of all, this show is something else and never really knows when to stop, and if you are expecting this to be a pseudo realistic or historically accurate anime, it isn't. Also, if you don't like mecha anime, this show probably won't change your mind about it. So with that out of the way:\r\nStory:  5/10\r\nThe story of Nobunaga the Fool is a mixed bag. For the most part it's fine (the first 15 or so episodes), but occasionally there will be a moment that just makes you wonder if you missed some key bit of information in that half second you weren't payingattention. Unfortunately, it just didn't explain what happened very clearly, and never really does. It starts off strong, showcasing the really unique world NtF takes place in, but by the end it turns into an incredible amount of plot holes. There was definitely unused potential.\\n\\n\r\nArt:  9/10\\n\\n\r\nThere really isn't a whole lot to say about the art to be honest. There was only one moment in particular where I felt it was lacking, and the part only lasted for about 20 seconds. Everything else was very beautiful, and while it wasn't anything new, it fit the show well. The CG for the Giant War Armors was done well, and the fights felt like they had weight to them. Not exactly something you can say about every show. \\n\\n\r\nSound:  9/10\\n\\n\r\nTo be perfectly honest, I rarely have the option of listening to shows, and as such, I usually watch them without ever really hearing the sound. Luckily, I was able to listen to NtF as I was watching it, and I was not disappointed. No song really stuck out to me (I'm not really a huge fan of music), but I I was able to appreciate both of the openings and endings. The voice acting was where the sound really shown in my opinion, all of the voice actors and actresses except for Minori Chihara(Ichihime (something just felt off whenever she was speaking, but not enough to detract from my enjoyment)) really felt like they fit the roles they were given.\\n\\n\r\nCharacters:  7/10\\n\\n\r\nMost of the characters were fun and likeable, but lacked depth. The only characters that genuinely grow throughout the series are Nobunaga and Mitsuhide; the rest just sort of stay static or blandly follow the growth of Nobu and Mitsu to create the illusion of growth. Another thing is that the characters shown in this series in almost no way represent their historical and mythical counterparts, which isn't necessarily a bad thing. Overall, I think the characters were a positive, but like the story, could have definitely been done better.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nWhat can I say? I'm a sucker for these historical spin-off-esque(?) series', add in some mechas, amazing fighting scenes, and a wacky setting that I would have never even dreamt of, and I'm all in.\\n\\n\r\nOverall:  8/10\\n\\n\r\nIn conclusion, Nobunaga the Fool is probably one of the weirdest, most ridiculous, and downright insane shows I have ever seen, anime or not, and I loved every second of it. My experience with this show will not be one I will easily forget.",
            "date": "2014-11-29T04:50:00+00:00",
            "helpful_count": 17,
            "mal_id": 170303,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316779.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BladedCiaran",
                "username": "BladedCiaran"
            },
            "url": "https://myanimelist.net/reviews.php?id=170303"
        },
        {
            "content": "Nobunaga the Fool, while it appears to be an empty mech-action anime, is actually pretty cool and thoroughly impressed me. \r\n-Overall\r\nI like this anime, but the show has some premise flaws in that there are huge robots, but no cars, TVs, nothing. The technology in the show is that of Feudal Japan and the Feudal West, except that there are huge robots. That's pretty ludicrous, but it didn't bother me too much. Other than that, the show is obviously well crafted and well thought out (but I can't explain why because that would be spoilers) and the show isn't afraid to kill, like so manyaction anime are. The show is vastly entertaining, especially to people who know their basic Sengoku history, and if you don't, you'll still get something out of the fantastically crafted ending and the well choreographed fighting.\\n\r\nStory: 7.15\\n\r\nArt: 8\\n\r\nSound: 8\\n\r\nCharacter: 9.1\\n\r\nEnjoyment: 8.25\\n\r\nOverall: 8.1. It's very good.\\n\r\nMore details down below.\\n\\n\r\n-Story\\n\r\nNobunaga the Fool's plot can be compared to the historical Sengoku Period in that the big events of the period (the rise of the Oda clan, the Incident at Honnouji, etc.) are repeated in the show. However, the events are repeated in unique ways. The show provides foreshadowing each episode about halfway through in which a character pulls a card from a deck and Da-Vinci (yes we all know that historically Da Vinci didn't live in this time period) explains the card. These explanations provide foreshadowing, but very metaphorically. That leads to the viewer to say \"Oooohh... that's what he meant\" at the end of each episode. Besides that, the plot is pretty unique and paced alright, so the Story gets a 7.\\n\\n\r\n-Art\\n\r\nNobunaga the Fool's art seems more shiny and detailed than contemporary works, and often times the visual beauty is astounding.\\n\\n\r\n-Sound\\n\r\nThe voices are good, as voices usually are in subbed anime. The music, which isn't bad or outstanding, is often timed to fit the scenes well, which gets me to award the sound with a score of 8.\\n\\n\r\n-Characters\\n\r\nMost of the main characters are well developed, and they all provide interesting dialogue reflecting their personality. Something that bothered me, however, was that all of the people on the Star of the East have counterparts from the Sengoku period, and the entire star is just Japan. All. Japan. The characters on the Star of the West are from the Classical/Dark-Age and Chandragupta was from India, how is the India West. Why? But this shouldn't bother many people, just me. Despite that, the depth of the main characters have me awarding the Characters with a score of 9.\\n\\n\r\n-Enjoyment\\n\r\nI liked it. 8.",
            "date": "2014-06-22T17:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 148093,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3834193.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ToastytheBaker",
                "username": "ToastytheBaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=148093"
        },
        {
            "content": "Nobunaga the Fool is one of those shows that attracted my attention immediately. It seemed to be a cross between Star Driver and Sengoku Basara. So, a vaguely historical drama with giant robots that battle it out for reasons only vaguely explored. With lots, and lots, and LOTS of ham-fisted flash and dazzle, of the kind that makes Gurren Lagann look like a couple of kids waving sparklers about. Not the most intellectually stimulating thing I can think of, but good for a laugh. \r\nHowever, once the initial, introductory dazzle has simmered down and the show starts getting down to business, it becomes quite clearthat the show can’t quite decide WHAT the business at hand actually is. The show seems to hop between fictitious historical drama, science-fiction, fantasy, mecha, occasional romance, a little bit of shounen, and a whole host of other genres scattered about here and there. \\n\\n\r\nThe problem with Nobunaga the Fool is that it wants to do EVERYTHING. It not only wants to have its cake and eat it too, it wants the cake of the five or six people sitting next to it as well. You can only eat so much cake before the inevitable, and what the Fool vomits over the course of its tedious twenty-four episode run is about as pleasant to sit through as the metaphor implies. \\n\\n\r\nBut don’t get me wrong here, the first few episodes of the show are actually rather well-written, and promise great things to come. The political strife and backstabbing that occurs during Nobunaga’s rise to power is well thought-out and gives clear insight into character motivations. Here, the trio of Nobunaga, Mitsuhide and Hideyoshi truly shine, as whilst the three are united by a common goal, what they are willing to do to achieve that goal varies, and the actions certain individuals take towards that goal promise some serious ramifications down the road. Of the three, Hideyoshi is the only one not given any real character, being assigned the role of “comic relief” (I suppose SOMEONE has to do it) but as actions speak louder than words in this show, character becomes of secondary importance, as battles are fought, people are killed, and talk is cheap. \\n\\n\r\n…and then the West gets involved, and all hell breaks loose, as talk becomes central and battles are downplayed in favour of what goes on behind the scenes…which actually isn’t as interesting as it was initially, as Nobunaga has secured his power by this point and as the West is governed with an iron fist by King Arthur, there is little room for intrigue. \\n\\n\r\nCharacterization for the Fool from that point forward is, for the most part, poor, as characters fail to really develop beyond their initial roles. Outside of their relationships to one another – and not even that in most cases – there is little to associate these characters with the historical figures they represent; in fact, if these characters had any other names, the show would likely be all the better for it, as then the contrast would not be quite so jarring. Some, like Jeanne Kaguya (yes, really) D’Arc have been butchered entirely, abandoning their historical depiction in all but name only to adopt a guise (in her case, it would be large-breasted damsel-in-distress with the secondary functions of apocalyptic prophet and love interest) that serves to drive the ill-conceived mess of a plot along. There are a few moments where Mitsuhide in particular breaks out of his stereotypical servant’s angst for some moments of genuine, heartfelt emotional turmoil, and it’s difficult NOT to feel something concerning the love triangle involving him, Ichihime and Caesar at times, but for the most part the show is focused on how misunderstood and smart the reputedly foolish Nobunaga is, and how much of a big deal the grand East vs. West war is. \\n\\n\r\nThe terms “Saviour King” and “Destroyer King” get thrown about a lot, and the result at the end is surprising, but lacks the gravity it should, as the overarching plot is never given sufficient explanation or detail for it to have any sort of impact beyond a raised eyebrow. The story for the Fool is both predictable in how its going to end, and unpredictable for what is going to happen from moment to moment. This makes it both entertaining and tedious to watch, as events become isolated, rather than sequential. Each episode could be taken as standalone and, whilst this is not necessarily a bad approach, it is bad in the sense that nothing really ties events together. Things just happen; reasons and reactions are disguised, downplayed, or often just outright ignored, leaving the viewer wondering exactly WHY they should even give a damn about all this. \\n\\n\r\nStructure is given to the show by the tarot-card theme, which, like everything else, seems to have been thrown in there for convenience’s sake, and because hey, tarot cards are cool, right? It worked for Persona 4! Ironically, in defining the character’s actions by forcing them to fit to tarot cards, each episode feels  limited by the card description, and the sense of two worlds colliding is replaced by a very soap-opera feeling as the shallow, stereotypical characters lament on their personal (and often entirely uninteresting) dramas. Whose actions are represented by the card this episode?! This shallow, one-dimensional approach would have been so much better if explanation were not provided at the end of each episode, instead being left to the viewer to decide. The result is that episodes become focused on a single character, and everything else that happens in the episode is dismissed. When people are dying, betraying one another and fighting epic battles (or what SHOULD be epic battles) in giant robots, it gives a profound sense of mistaken priorities, and some missed opportunities for character development. \\n\\n\r\nBattles in the Fool fail to live up to expectation, being standard clashes between two characters who probably aren’t even sure WHY they’re fighting (Alexander the Great, at the very least, seems quite bored with the whole thing) a lot of the time, with little in the way of special moves or inventive combat styles, despite the fact the Regalia they use to pilot the suits are elementally-attuned (surprise!) and individual suits are all quite different in design, so should have fighting styles that differ from just “swing your weapon of choice to win”. There is no Gundam-style creativity here, unfortunately, and little in the way to recommend it. Star Driver had an awful plot, but fantastic fight scenes, which mitigated the offense somewhat. Nobunaga the Fool’s fight scenes are about on-par with its plot in terms of excitement. \\n\\n\r\nA typical East vs. West conflict with mostly out-of-context historical figures (Jeanne KAGUYA D’Arc, I ask you!) and stereotypical religious undertones in the guise of tarot-card titled episodes for good measure, Nobunaga the Fool is a grand exercise in stupidity that can’t even decide WHAT type of stupidity it wants to be. Stealing piecemeal ideas from almost every genre conceivable and then stripping the of anything even remotely resembling depth, what starts as a vaguely interesting and promising show quickly turns into a dull, convoluted mess that would make even the most inexperienced of fanfiction writers cringe in embarrassment. Avoid if you would prefer to keep your brain cells healthy and fully functional. Watch if you haven’t had quite enough bollocks in your life recently and are in the mood to completely and utterly waste your time – you’d be hard-pressed to find an anime that will waste it much more than this will.\\n",
            "date": "2014-08-07T02:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 155615,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shatterheartiel",
                "username": "Shatterheartiel"
            },
            "url": "https://myanimelist.net/reviews.php?id=155615"
        },
        {
            "content": "This is very frustrating.\r\nNobunaga the fool is an anime of big contrast and conflict. The best way to describe my feelings after watching it is love hate relationship...\r\nOn the one hand, every topic of the visual arts are masterpieces! No matter what: mecha design, character design, background, animation. Simply beautiful and perfect. Further there are plenty of new ideas and new concept in the story. The way they separated the western and the eastern world into two planets or tries to combine so many genres into unity are refreshing! \r\nOn the other hand: how comes that a story with that big potential becomes kind.. boring?There are just little of character development (except Caesar), no success of going deep into character's psyche, most of the important characters appear facile, dialogues mostly are not interesting.\\n\\n\r\nThe story could become much more complicated, very emotional and incredibly dramatic, but the most part of them turned out too simple too understand.  \\n\\n\r\nAt least: Caesar truly knows how to steal people's heart! Omg by making that sinful chocolate cake ;)",
            "date": "2015-01-26T11:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 179014,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4168435.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kagehanatu",
                "username": "kagehanatu"
            },
            "url": "https://myanimelist.net/reviews.php?id=179014"
        },
        {
            "content": "After investing a my time from launch of the 1st episode to the end episode #24 I found it very unsatisfying and as if I was cheated of my time and investment to the series. To give an example of how I felt Imagine it's Christmas morning and your parents told you  that they were getting you  a brand new skateboard, you race down stairs to see it in all of it's glory. Heart pounding, emotions at an all time high you see the shape of a rectangular gift wrapped up in beautiful wrapping paper with a delicate bow on top.  Youhold it in your hands, the perfect gift, and take it all in. Soon it will be yours. With careful hands you remove the tape oh so carefully, doing your best to saviour the moment. Then you give in and begin to shred the paper and all that gets in your way. They it is in front of you, your brand new skateboard. You take some deep breaths to calm down, only to find in front of you not the skateboard you wanted, instead you find a cheap piece of plastic with shoddy wheels and a clown decal on the underside... That, that is what Nobunaga The Fool was too me. It is my anime clown skateboard on Christmas morning,at the beginning it was really good, only to have it fall apart at the end.",
            "date": "2014-06-23T23:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 148317,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/patheticuser",
                "username": "patheticuser"
            },
            "url": "https://myanimelist.net/reviews.php?id=148317"
        },
        {
            "content": "I don't always do reviews for anime series, but for Nobunaga the Fool, I just had to do one. I'll try not to spoil the series and do my best to convey my thoughts and opinions about the series.\r\nStory: 10\r\nThe story was amazing. With the end each episode, I was always excited to see what would happen next. The story took many twist and turns that had me surprised. One moment, I'd think that one thing was going to happen, but then something happens that I was never expecting. This series isn't your run of the mill mecha anime. Niether is it your run ofthe mill Oda Nobunaga series. It's a fusion of Sengoku period and futuristic times, taking popular figures from long ago and throwing in giant robots. It's sure to please anyone who likes these two types of series.\\n\\n\r\nArt: 10\\n\\n\r\nWhen it comes to anime, I love when the art is appealing. This anime meets AND exceeds my expectations. The character designs are eye catching, the setting is beautiful, and the the mechas look amazing. CG is very cool and this anime does it just right. \\n\\n\r\nSound: 10\\n\\n\r\nOh man.. Let me tell you about this anime's soundtrack. I find myself humming the OST all the time. Even when I'm not watching the anime. It's just that catchy. The vocal tracks are awesome as well. There was an insert song by Jam Project which kicked so much butt! The openings and endings are also great. I listen to them all the time when I'm on my jog. \\n\\n\r\nCharacter: 9\\n\\n\r\nThe only reason why this gets a 9 and not a 10 is because there are a couple of characters that I did not like. Mainly because of some of the things they did in the series. However, the majority of the main cast are really cool. Nobunaga is a take charge guy who isn't afraid to fight back. This is the kind of protagonist I like. One who knows what he wants and does as he pleases. That's what makes him great.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nThere is never a dull moment when watching Nobunaga The Fool. Not once have I ever felt bored or disliked an episode. Each played an important part to the story and always had something cool in it to keep me entertained, whether it be a fight or character development.\\n\\n\r\nOverall: 10\\n\\n\r\nIn conclusion, Nobunaga The Fool has to be one of the best anime of 2014. Others may not agree, but that's what I believe. It's a series that makes you wanting more. It has a set plot that never gets too confusing, but isn't too predictable either. It also makes you think one thing, but will throw a curve ball and change it up so that it leaves you with a dropped jaw. You'll cry, you'll laugh, you'll cheer. This anime will fill you with a variety of emotions while watching it. It has enough drama to make feel for the characters and enough action to keep you on the edge of your feet. Give Nobunaga The Fool a watch. I'm sure you'll love it just as much I have.",
            "date": "2014-06-22T19:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 148105,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328298.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Arashi92",
                "username": "Arashi92"
            },
            "url": "https://myanimelist.net/reviews.php?id=148105"
        },
        {
            "content": "This is my first review(in general) so I apologize if the review looks really weird.\r\nSTORY: 6\r\nHere's a concept: Oda Nobunaga with mechs and Nobunaga himself is not a girl and it's not related to high school! It may not sound interesting considering the fact that there are other historical figures in the series like Leonardo da Vinci. The story overall isn't too terrible nor is it fantastic. The story in a way is original but it's just that the writers occasionally didn't know what they were doing so they placed some random plot elements and it fully doesn't make any sense whatsoever. The ending howeverisn't that amazing but it does close off the story pretty well (something that many anime don't seem to have). \\n\\n\r\nAlthough the story doesn't fully take it itself seriously and the story doesn't follow what it's supposed to be.\\n\\n\r\nThe story overall isn't too terrible nor is it fantastic. The story in a way is original but it's just that the writers occasionally didn't know what they were doing so they placed some random plot elements and it fully doesn't make any sense whatsoever.\\n\\n\r\nArt: 8\\n\\n\r\nThe animation isn't that special but I do like the character designs.  They weren't too realistic nor were they moe-ish. The art isn't too memorable but it's decent enough for the story.\\n\\n\r\nThe animation isn't that impressive but good enough for the series. I'm not fully expecting much for the animation, considering that is done by Satelight, compared to something like \\n\r\nAquarion EVOL (which has flashy animation) but the action scenes were brought out compared to something like Aquarion EVOL.\\n\\n\r\nThe backgrounds help fit the setting but that's all it does. Overall the animation is decent, but not the greatest out there.\\n\\n\r\nSound: 6\\n\\n\r\nI am not sure how to judge the voice acting as I'm not fluent in Japanese but I'm trying to learn the language but I'll do my best! The performances were well enough for the characters they are voicing although (in my opinion) best performance goes to Mamoru Miyano voicing Nobunaga when it comes to the way the voice sounds, which is something the seiyuu normally does so no surprise there (right?)\\n\\n\r\nMy favorite opening of the series is the second opening (not just because it's done by JAM Project). Both ending themes I really like (both in animation-wise, which isn't much but well done in its own right)\\n\\n\r\nThe OST itself felt a little transparent although one track comes to mind in comes to be memorable but I forgot what the track is called nor what it's used for but it sounds the most memorable to me (I'll edit this review when I find it).\\n\\n\r\nCharacters: 7\\n\\n\r\nIt's kinda hard to explain everything in the section, since I'm not supposed to spoil anything. I'll give out a brief summary, the cast is average, personality and character development wise.\\n\\n\r\nEnjoyment 8:\\n\\n\r\nIt doesn't get a 10 because there are times where it feels out of place kinda affects my enjoyment. Same with the characters (favorite character is Nobunaga, just saying).\\n\\n\r\nOverall: 6\\n\\n\r\nI like the anime despite the flaws (which are a bunch of them). It is all right for what it is. It was good enough to make it worth watching it to the end. If you aren't a fan of mecha anime, this anime isn't for you. If you are a fan of mecha, I would honestly give this anime a try.",
            "date": "2015-02-10T16:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 180104,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3884179.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Meganecraz",
                "username": "Meganecraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=180104"
        },
        {
            "content": "I almost didnt give this one a chance due to the low scores it had and the random mix of genres, but after reading some reviews i decided to give it a chance - which im really glad for. I exctually did enjoy it quite alot. I recommend that you watch this show with an open mind, like a colourful circus or like a roller coaster in the funny house. So I will now get down to why I enjoyed \"Nobunaga the Fool\" (who in all means lives up to his name).\r\nStory: 6/10\r\nBy all means the shows weakest part, but its actually not that badat all. There are a lot of plot holes and alot of things are never explained so they can never be really understood. As the page tells you, its a quite unique mixture of action, historical, mecha and sci-fi. And it aslo magic, super power, fantasy and romance in that mix. A mix at least I never seen before in anime. As expexted it gets messy sometimes, but shore not lets you down in the entertainment aera. This is a story of two worlds (east star and west star) thats are connected by forces that are never really explained, but you can clearly see a influence of western historia (west star) and eastern historia (east star). On the west star we have Europen historical personas as Jeanne d´Arc, Di Vinci, King Arthur and Julius Ceasar to mention some. On the eastern star you can also clearly see historical Japanese influences, with samurai clans, tea cermonices and traditional clothing. But there the historical part ends. Because in both world wars are held with giant mecha suits, and the most powerful worries carries a\"secret treasure\" which amplifies their power in some elemental way (wind, fire, earth etc.). The basic storyline is that Jeanne d´Arc tries to find out if Nobunaga is the \"Savior King\" or not, and a power struggle first internally on the east star, and then later between the eatsern star and the western star. A red thread in the story is that in each episode Di Vinci lets someone (often Jeanne) to draw a tarotcard, and he explains the diffirent meanings of that card. The card is always directed to some of the characters (which is where you come in to guess whom its diredted to), and the character in question will for fill that during the epsiode. Without spoiling anything I can say that the end of the show suprised me alot and I did not see that coming, which was refreshing and made me like the show more. \\n\\n\r\nArt: 9/10\\n\r\nIf the story is \"Nobunagas the fools\" weakest part, the art and animation is it strongest part. As expected of studio Satelight, the animation and art is great. As usual it has its flaws, but character designs, colours and backgrounds are beautiful and colourful. Motions are fluid and smooth, and the CG mecha fights are pretty good as well. \\n\\n\r\nSound: 7/10\\n\r\nThe music and sound are by no means outstanding, but its absolutly above average. The music is mostly intrumental towards the classical, which suits the mood and diffirent settings in the show good. I liked the first opening song quite a bit, but the second one never really got to me. I watched the dubbed version and the voice actors were not magical but they did there job well, and had manage to capture the nature of the characters good as well. \\n\\n\r\nCharacters: 7/10\\n\r\nOverall there where no major character developments, but at least you got to know the main and supporting cast well enough to give the story life and actions motivated. \\n\\n\r\nFirst out we have one of our MC´s Nobunaga. He is the heir to the Oda clan, and is in no way espacially eager to take up on the responsabilites that comes with it. He can many times come out as a jerk but at least he is honest. Nobunaga is a very stong willed person, who always do things his way - no matter what. He can seem pretty care free and foolish, but do have deeper feelings and if his close ones needs him he will cross worlds to save them. As expected from a MC he has some character development, there he gets to terms with who he is and what his purpose is. \\n\\n\r\nJeanne d´Arc/Ramarou - Had more potentail then was exicuted in the show, but by no means a bad or boring character. She has visions of future events, ever since she was a child. In classical historical anda she was seen as demon who only brought unfurtiune to others. That made her to not trust herself, which she has deal with under many occasions during the show. Her strongest belives are that Nobunaga is the \"Savior King\", who will save both world from distruction - but even those belives are put to question.\\n\\n\r\nDi Vinci -  Can be seen as your guide in this malstream of generes and events. He is the observer - following the events with a kind of distached facination. He is the one with the tarotcards, with his actions and words pulling the story forward without being directly in the actual events. \\n\\n\r\nAnd definitely worth mentioning is Himiko, Ichihime, Ceasar and Mitsuhide, who all are contributing to the story. They all have their own peronalities, wills and diseres that will contribute to that the plot is moving forward, sometimes in very drastic ways.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI actually really enjoyed myself watching this show. You never really know what next episode would go, which made it intresting to watch for me. Yes, sometimes I was pretty confused, and asked myself - what the hell did just happened and why? But it was never boring and managed to entertain me alot.\\n\\n\r\nOverall: 7/10\\n\r\nIt was most definitley worth my time. Yes, the plot wasnt that outstanding and sometime confusing (which normally goes against my standards of a good anime), but it never failed to entertain me. The great animation and art was clearly a huge plus. I would definitley recommend \"Nobunaga the fool\" to you who want to see something totally different and dont mind unique mixture of geners.\\n",
            "date": "2016-10-21T04:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 232232,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=232232"
        },
        {
            "content": "I was really surprised by this anime. So much so I made an account just to reviews it. \r\nI would say the first two episodes you kinda have to force yourself to keep going. Your mind is telling you this is quite dull....and very confusing. But by the third episode I was forcing my husband to sit and watch it with me cause I knew it was gonna be epic. \r\nThe story is extremely detailed and if your don't pay close attention you may miss something. It is a very tightly packed story so much so they actually so skip scenes where characters narrate whathas happened. So be prepared for the skip scenes....I was kinda confused at first...makes you think you missed an episode somewhere. \\n\\n\r\nThe art is good. Not the best art I've seen but no where near the worst. It seemed to be the style changed maybe 15-20 episodes in. The characters seemed more life like...maybes it's just me. \\n\\n\r\nThe opening and ending song for the first half of the anime is freaking awesome. Please just fast forward through the opening on the second half. It was major let down. The ending isn't terrible but not my favorite. \\n\\n\r\nOver all I will own this anime as soon as I can get my grubby little hands on it. And it will have a spot on my shelf of the like 10 anime I deem important enough to own. I just can't tell you why...you have to watch it to find out.",
            "date": "2014-06-22T21:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 148123,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FallenAngel1129",
                "username": "FallenAngel1129"
            },
            "url": "https://myanimelist.net/reviews.php?id=148123"
        },
        {
            "content": "Nobunaga The Fool is  shining gem of a series I'm so glad I got to experience. Combining historical characters, history, fantasy, mecha and magic, this series delivers an ambitious and creative narrative and stands as a unique offering in a sea of \"been-there-done-that\". My spoiler free review:\r\nStory: 7.\r\nNobuanaga The Fool's story is ambitious, it combines elements of Japan's history, famous figures from world history and magic and creates this incredibly juicy story that at it's core is about destiny. The way the show uses the cards - pulled once per episode by characters to fortell an event to come - is so incredibly uniqueand intriguing. The cards meaning often unfolds in a way you don't expect but guessing the meaning along the way - with the characters - as the story unfolds both per episode and as a whole creates a very unique experience. The story was heavy on detail and does require you to really pay attention as it unfolds but it also delivers a great deal of action and suspense as well. The story was well-paced, unique, and kept you guessing till the very end. \\n\\n\r\nArt: 7. Nobunaga The Fool has an appealing art style - it boasted great character designs, beautiful backgrounds and scenery and a great use of colour. Present - as with most mecha's these days - are the clunkier CGI mechas I am NOT fond of and I found their design did detract from my appreciation of the art. I am not fond of clunky, CGI mecha's and I never will be.\\n\\n\r\nSound: 9. Nobunaga The Fool had a great soundtrack. A nice wide range of pieces that really enhanced each and every scene when used. I was very fond of the two battle theme's, in particular, Destruction-King and it's use within the series. The 1st set of openings and endings was very good - I really enjoyed both songs, especially the ending theme, though the second cours themes weren't quite as special.\\n\\n\r\nCharacters: 7. Nobunaga had such a WIDE range of characters. Nobunaga Oda, Julius Caesar, Jeanne d'Arc, Leonardo Da Vinci, Alexander, Cesare Borgia,  Hideyoshi, King Arthur, etc. The cast of characters - and their very unique use in this series - was very enjoyable. I have a deep love of history and I appreciate nothing more when history is used to inspire something creative and thought provoking and these characters were used so uniquely within this series and really delivered that for me. The characters as a whole were well developed - there were times when I questioned Nobunaga's development but I soon found my questions answered and was very happy with his journey. A few could have been focused on and developed a bit more, but overall, the series did a good job in that department. Each character had an important journey, lessons to be learned, truths to be realized and destiny's to both fight and accept - and their journey's were well handled and developed and ultimately, very very enjoyable for me.  \\n\\n\r\nEnjoyment: 9. I deeply enjoyed this incredibly creative series. It's use of magic and history - my two favorite things in the world - to deliver this unique story with this odd, yet incredible cast of historical heroes was so refreshing. Nobunaga delivered on so many levels with it's great OST, interesting and unique story that is far from predictable with it's twists and turns (and before watching this, I felt starved for something truly unique!), high action and great use of magic. Fans of history, mecha, magic and high action will really enjoy this wonderful series which is sadly, very underrated. It wasn't perfect but it was a unique, highly enjoyable gem of a series. \\n\\n\r\nOverall: 8.\\n\\n\\n",
            "date": "2015-04-07T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 185079,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4165105.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inori101",
                "username": "Inori101"
            },
            "url": "https://myanimelist.net/reviews.php?id=185079"
        },
        {
            "content": "NO SPOILERS C: \r\nI started watching this show 4 years ago and dropped it after 4 episodes, and it's just now that I decided to give it a second chance. Difference being that at that time, I didn't know any of japanese historical characters. Knowing few facts about the real warlords changed the way I see the characters, and made it more interesting too follow.\r\nStory fair to good enough but had greater potentiel.\r\nCharacters developements Ok to good. \r\nSeiyus' acting was great as always and musics ok.\r\nThe Art good as well.\r\nOverall 7,5/10\r\nIt wasn't the anime of the year, but even if the first episodes were abit a torture to watch at last I enjoyed the show And I don't regret giving it a second chance!",
            "date": "2018-03-18T06:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 274179,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3373005.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LelouchOkami",
                "username": "LelouchOkami"
            },
            "url": "https://myanimelist.net/reviews.php?id=274179"
        },
        {
            "content": "I just finished the last episode in hope of anything making sense...\r\nbut of course nothing did.\r\nThis all anime seems to have tried to mix everything; Mechas, samourais, spaceships, magic, legends, love, fighting, politics... they only left the hentai out  -_-\r\nYou never get surprised; the anime tries to please everyone, but doesn't make any sense. It's not even spectacular since everything is so predictable.\r\nReally disappointed in this show. You can see they put money in it yet...\r\nSuch a shame.",
            "date": "2014-06-23T11:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 148231,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3537361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Philou255",
                "username": "Philou255"
            },
            "url": "https://myanimelist.net/reviews.php?id=148231"
        },
        {
            "content": "Summary: This is a mech anime that isn't really a mech anime. It is more an epic story about the unification of 2 kingdoms with tons of historic figures reprising various roles and lots of awesome battles and story arcs. The anime jumps the shark a few times and there are definitely a few things to be desired but I thoroughly enjoyed this for all it's flaws. In lieu of a long review I will sum up the positives and negatives:\r\nPositives:\r\nAn epic story that develops from something pretty simple and straight forward to downright epic. The story involves tons of epic historic figures from Alexanderthe Great to Julius Caesar to King Arthur. Seeing how each character evolves and the role they play is a pleasure.\\n\r\nThe art is gorgeous and well done. This is a GREAT looking anime.\\n\r\nThe music is nice and well put together. The fighting sound track is also excellent and the voice actors do a fantastic job.\\n\r\nI enjoyed the story from beginning to end. Regardless of it jumping the shark and being a bit confusing it wasn't afraid to cover all sorts of angles and go to dark places unapologeticly. It is also A COMPLETE STORY. You don't need to read a LN or Manga... this is the total package from beginning to end. Boy isn't that nice!\\n\\n\r\nNegatives:\\n\r\nThere are some confusing points to the story. I swear there is an episode missing with Mitsuhide and Caesar that confused me endlessly. The ending is definitely meg and I have a hard time imagining anyone being satisfied with it.\\n\r\nHappy ending... not so much. Lots of characters will die... and I mean LOTS. Do NOT watch this if that kind of thing is too dark for you.\\n\r\nThe ending is a bit flashy and too convenient. A little to much of \"boy that wrapped up neatly\" though I won't fault it too much because it was not afraid to go in an unexpected direction.\\n\\n\r\nFinal Summary: If you like excellent story driven narratives this is for you. It has good fight scenes but is mostly story/character drives. Prepare for an emotional roller-coaster. It is a good experience, it starts a little slow but it is a great adventure. Enjoy!",
            "date": "2016-05-19T22:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 218930,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=218930"
        },
        {
            "content": "A short Review for everyone who is still not sure if to watch it because of the 'bad rate' :\r\nNobunaga the fool was one of my favourite Anime - at least for the first 15-18 episodes. Before that turning point it's a very good anime with a good story, awesome story developement, much comedy and a nice and cute Lovestory. I really enjoyed it! But after episode 15-18 the whole mood changes to a depressing, not very comedical, tragic story with an aweful ending that doesn't make any sense.\r\nStill I would recommend watching it - if not for the end of the story it wouldbe a clear all in all 9 ...but like this...\\n\\n\r\nNevertheless - watch it an enjoy it! I also rewatched the series a few times (till the episodes 15-18) and I'm still planning on doing so again :)",
            "date": "2016-04-11T10:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 216122,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5015175.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Siarame",
                "username": "Siarame"
            },
            "url": "https://myanimelist.net/reviews.php?id=216122"
        },
        {
            "content": "Mmmm... I think my review will be like all others here.\r\nStory - 6 (fair)\r\nWhy I'm giving this story a six?, well... because plot wasn't so bad, the execution is the problem here... It was a good premise, but this anime was trying to grab so much stuff and ends saying nothing.\r\nArt - 8 (very good)\r\nThis was the good part of the show, battles in mecha armors are very well done by the art crew. And characters in general are well animated, not at the same level of mecha armors, but are well done anyways.\r\nSound - 6 (fair)\r\nI didn't like openings and endings, but I likedthe OSTs fair enough to give them a 6, is not memorable, but something is happening inside my bones when I listen epic music. \\n\\n\r\nCharacter - 2 (dreadful)\\n\\n\r\nOh, my... This is the reason of my poor enjoyment of the show... CHARACTERS ARE CRAP. I mean... Joan of Arc should be a badass woman and this version of her is an insult, I even like a bit more Himiko than her, at least she did something in the whole series. Oda Nobunaga is a bit better, but why is so one-dimensional character?, I didn't like how they wrote his personality. And well... the rest of the cast, except the ninja girls, the lady in charge of mechas maintance and Ichihime... are so annoying or entirely different to they real counterpart. And WTH... King Arthur ressembles more a dark sorcerer than a king... He was acting more like Betelgeuse from Re:Zero or Gilles de Rais (Caster) from Fate/Zero, really disgusting.\\n\\n\r\nEnjoyment - 4 (decent)\\n\\n\r\nIt wasn't SO bad. I could, actually, finish the anime, but it was a bit painful because lack of personallities and weird and uncomfortable plot holes sometimes.\\n\\n\r\nOverall - 5.2 (~6, fair)\\n\\n\r\nI wouldn't recommend this show to anyone, but it WASN'T SO BAD. I just don't want to watch this again '-'...",
            "date": "2018-04-12T21:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 277909,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LinHashimoto",
                "username": "LinHashimoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=277909"
        }
    ],
    [
        {
            "content": "\"It was inevitable!\" - Oda Nobunaga.\r\nNobunaga The Fool is a pleasant surprise of this season, a very curious yet enjoyable mix of many genres : Mecha, Sengoku Period, Sci-Fi, Fantasy & Romance, which may raise many brows given the unique sense of history of this anime, but that flamboyant extravagance has many charms, just like the main protagonist, Oda Nobunaga, a foolish and persistant man who aims to conquer heavens and earth as he is said to be the Savior-King by his allies, Jeanne d'Arc and Da Vinci. His resolve and potential steadily draws other characters to him, allies and enemies alike. Gaius Julius Caesar,King Arthur and many other notable historical figures make their entrance, while the internal strife of the Oda clan is at its peak. Nobunaga The Fool shows us foolishness, determination, betrayal, sacrifices, hope, and love. It appeals to our emotions and keeps the suspens till the very end. The well executed overall presentation manages to catch our attention with an impredictable conquest, a rich cast of voice actors, a beautifully handled animation and a very memorable soundtrack. The fast paced story, the intense interactions between the characters, the epic battle scenes, and the subsequent plot twists make it an anime you look forward to where it would take you.",
            "date": "2014-04-14T05:42:00+00:00",
            "helpful_count": 89,
            "mal_id": 139891,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3427427.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miwars",
                "username": "miwars"
            },
            "url": "https://myanimelist.net/reviews.php?id=139891"
        },
        {
            "content": "Nobunaga the Fool is a jack of all genres, master of none.\r\nIt has an awesome premise—a reconstruction of Oda Nobunaga’s rise to power within a mecha-filled, pseudo-historical setting. Anachronism definitely has the potential to produce beautiful things (e.g. Gintama or Samurai Champloo), and going into this show, I was excited to see how its producers would handle a historical/mecha fusion. Now that I’ve completed it, I’m disappointed to say that it felt more like a disjointed mishmash of genres than a smooth blend.\r\nWhen I say that NtF was a mishmash of genres, I don’t just mean historical and mecha. It was often fantasy, occasionally supernatural,sometimes shounen, sporadically romance, and towards the end, sci-fi as well. Hence the comparison to a jack of all trades, master of none. NtF essentially gave itself too much to do. It had too many themes to neatly put together and ended up spending time focusing on different subjects without really combining them. There were magical evil imp children, melodramatic love triangles, power-ups with spirit dragons and cyborg limbs (I'm not even kidding), and so on. In the end, it was hard to tell what exactly the series was supposed to be about. \\n\\n\r\nMy score is 5.9/10. Read below for the full review + rating breakdown.\\n\\n\r\n- - -\\n\r\nStory = 5/10\\n\\n\r\nLayout:\\n\r\nIf you want to enjoy NtF, be ready to suspend your disbelief. The show is a war story takes place on two stars, east and west. The east star is dominated by Japanese warlords from the Sengoku period. The west star is dominated by random famous Europeans plus Chandra Gupta. (If you're a stickler for historical accuracy, you probably won't like this anime.) As you might guess, the allusions and references are all over the place. Here’s a small sample of the references made in NtF: Schrodinger’s cat, Excalibur, and Hercules—and that’s only in one episode.\\n\\n\r\nThe topic for each episode is set by tarot cards. At some point in each ep, a new card is revealed (like Hanged Man or Empress), and the card signifies a character or event during that episode. It's generally predictable, but it does make the anime more entertaining. The idea is admittedly clever.\\n\\n\r\nCharacters spend a lot of time fighting over regalia, which are mystical pendants that grant physics-defying upgrades to giant war armors (NtF's mechas). When activated, they draw from the power of ley lines and cause extra weapons to immediately materialize. Yeah...just roll with it.\\n\\n\r\nPlot:\\n\r\nThere's a prophecy that two kings will be born—a Savior King and a Destroyer King whose destinies are to save and destroy the world, respectively. The higher-ups on the west star believe that Arthur, an enigmatic and seemingly faceless man, is the Savior King. After Jeanne Kaguya d'Arc has premonitions of an east star warrior named Oda Nobunaga, she and Leonardo da Vinci defect to the east star to see if he's the actual Savior King. They join the Oda clan, and Jeanne goes into disguise as a page named Ranmaru. Nobunaga and co. then continue their efforts to unite heaven and earth. Or conquer the world. Whichever sounds better.\\n\\n\r\nThe plot isn't too hard to follow, but it's still unnecessarily contrived. Things get especially confusing during the last few episodes.\\n\r\n- - -\\n\r\nCharacterization = 3/10\\n\\n\r\nWarning: characters' personalities don't necessarily reflect those of their historical counterparts. (Don't expect Jeanne to be a badass warrior. You will be disappointed.) The names are just there for the sake of making characters look cooler. The east star warlords at least bear some resemblance to the figures on whom they're based, but the west star knights of the round table (which include members like Hannibal Barca and Alexander the Great, and are not to be confused with King Arthur’s other knights of the round table) show little to no evidence of historical context. Caesar says “veni, vidi, vici.” Cool. Hannibal and Charlemagne speak to each other in French. Nifty. That's all you really get, in terms of historical influence. You won't be getting any Fate/Zero sort of background info on the characters, either.\\n\\n\r\nHistorical inaccuracy aside (Jeanne Kaguya d'Arc...really? I know she's supposed to be a pseudo-Mori Ranmaru and have ties to the east star, but come on), the characters at least have interesting, distinct personalities. The reason why I'm giving a 3 instead of a 1 or 2 is because the character types aren't any less than what you'd get from your average action anime. A lot of the supporting chars may be one-dimensional, but they're rarely boring.\\n\\n\r\nMoving on, the biggest qualm I have regarding characterization is that the main characters have these little tics and habits, and the show abuses the heck out of them. Mitsuhide flips his hair. Hideyoshi rubs his nose. Nobunaga adjusts his shirt sleeves. I've seen each of these happen at least once per episode. Why do I say they're abused? Habits are supposed to reflect a character's personality, not define it. The habits shown in NtF are extremely overstated and, for the most part, not special. Among other things, the issue with the habits highlights how static the characters are. Their most obvious traits are literally tiny habits.\\n\\n\r\nQuick note about development: the main characters do go through changes in their ambitions and temperaments, but the changes are often sudden and not sufficiently explained.\\n\r\n- - -\\n\r\nArt = 8/10\\n\\n\r\nYou can tell a LOT of the animation budget went into the giant war armors, which are the only things that are CG. They look gorgeous, and fight scenes look amazing. Unfortunately, although the art is very good overall, the discrepancy between quality for giant war armors and everything else is pretty noticeable. The CG animation = 10, the rest = 7.\\n\\n\r\nInteresting thing I noticed: in the Owari setting, you see the same looped animation of this dude ringing a bell for every invasion scene. The only explanation is that the guy is secretly immortal and never rests, eats, or gets hurt even when his city is being attacked by laser beams.\\n\r\n- - -\\n\r\nVoice Acting = 9/10\\n\\n\r\nThe voice acting is great overall, though a little over-the-top at times. (The “over-the-top” part applies mostly to Hideyoshi. As much as I love Kaji Yuki, I think I've heard him make enough monkey noises to last a lifetime.)\\n\\n\r\nAdditional props to Miyano Mamoru, Sugita Tomokazu, and Nakamura Yuichi for pulling off Nobunaga, da Vinci, and Caesar so well.\\n\r\n- - -\\n\r\nMusic 6/10\\n\\n\r\nThe BGM is a mix of traditional and orchestral music. It fits the series well, but isn't exceptionally good. The most memorable tracks are the ones played during the more intense scenes; they're one of the things I like most about NtF.\\n\r\n- - -\\n\\n\r\nStory (25%) = 50\\n\r\nCharacterization (25%) = 30\\n\r\nArt (20%) = 80\\n\r\nVoice Acting (15%) = 90\\n\r\nMusic (15%) = 60\\n\\n\r\nTotal = 59/100 = 5.9/10 —> 6\\n\\n\r\nThanks for reading!",
            "date": "2014-06-25T02:18:00+00:00",
            "helpful_count": 76,
            "mal_id": 148471,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1409919.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mechato",
                "username": "mechato"
            },
            "url": "https://myanimelist.net/reviews.php?id=148471"
        },
        {
            "content": "*Spoiler free*\r\nThere are generally two kinds of anime that are difficult to follow. The first is the likes of classics such as Texhnolyze or Serial experiments Lain, where the show was intentionally made convoluted by the authors in order to leave interpretation up to the viewer. These are shows that are purposefully made with the assumption that the viewer must decipher the plot for a philosophical reason.\r\nThe second type are shows that are convoluted not in order to convey anything special, but because the writers of the show have absolutely no idea what they are doing and couldn't write a good story to save theirpathetic behinds.\\n\\n\r\nThis anime is unfortunately the second type. It's actually kinda sad, because when watching it you can really see that the POTENTIAL for a good show is there, but it just isn't well written enough in any respect to be enjoyable. I found myself watching it to the end, hoping it would eventually get its act together, but it just never did. \\n\\n\r\nThe problem here is this anime tried tossing far too many concepts into the story without paying attention to the quality of any of them. There is a hint of romance, but it is never well done enough to be interesting. There are many characters that seem engaging at first, but are never fleshed out enough or developed to grab your attention. More than half the characters motives for their involvement in the overall story are never even explained. The plot itself is a mess, going through far too many changes with never enough details for any of them to matter. There is no sense of wonder or suspense whatsoever. It throws in historical references, but all of them turned out to be excuses for poor writing and few of them were accurate. The action scenes are decent, but because it's hard to care about the overarching plot behind them they aren't interesting either.\\n\\n\r\nNobunaga the Fool is like the Action-52 of anime. Tons of genres, tons of ideas, but none of them well done. \\n\\n",
            "date": "2014-12-08T10:38:00+00:00",
            "helpful_count": 36,
            "mal_id": 171441,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4307191.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HolyMushroom",
                "username": "HolyMushroom"
            },
            "url": "https://myanimelist.net/reviews.php?id=171441"
        },
        {
            "content": "A show like Nobunaga the Fool will make you look like a fool at first glance. The premise sounds absurd, not to mention foolish and the first episode stops nothing at all to make viewers ask themselves what is going on. What it offers is a mixture of historical figures ranging from Joan of Arc, Leonardo da Vinci, Da Vinci, King Author, among others. It doesn’t stop there however. Rather, it steps up one more stage and decides to make usage of mecha warfare in a world of the unknown. Nobunaga the Fool is the type of show where you’ll be watching it trying toescape a labyrinth.\\n\\n\r\nTo venture into a show like Nobunaga the Fool will take an imaginative and open mind. While it seems absurd at first glance, one should acknowledge the creativity of the show. For instance, take a closer look at the setting. It’s divided into two halves, the West and East Star. Upon a closer glance, there’s conflicts in their world involving warfare. And as even a fool can guess, the show trifles by the idea of war as result of ideologies. But let’s go back to the basics. The show fuses together legendary historical figures, tosses in the mechanics of mecha, and empowers them in this bizarre setting.\\n\\n\r\nFor what’s worth, we get fusion of a steampunk/historical setting. The characters involved in the show may seem to be related to their legendary ancestors. Yet, their similarities only seems to scratch its historical domain. Starting off, there’s a blur of reality as Jeanne Kaguya d’Arc (based off of the character ‘Joan of Arc’), is burned at a stake in a typical witch hunt endgame style. Then flash forward and we find out that she has a powerful object that can potentially influence the world. Not only that but she also has visions relating to the one individual that will save the world, also known as the Fool, Oda Nobunaga. Here’s where the fun comes in. Oda Nobunaga is exactly as his name states. Not only is he the titular character but he is literally portrayed as a fool with his brash personality. His actions and behavior will get people talking despite it being harmless, on occasions anyways. But looking carefully, Nobunaga is a man that’s difficult to understand. It’s not an understatement either since his character is a representation of The Fool card based off of the tarot legend. The tarot cards bring about a purpose that serves as a fortitude of each episode. But behind those cards lies a meaning that unlocks each episodes’ morality through imagery, perhaps relating to the true visage of our titular character.\\n\\n\r\nNobunaga the Fool isn’t just about making a prophecy come true.  Throughout the series, we see different sides of Nobunaga and Jeanne. Nobunaga for instance is portrayed as a hotheaded man that he seems to wear like a mask. Yet, we do see a different side of him when he is with those closer with others, such as his family like his sister Ichihime. Later on, Nobunaga’s relationship/partnership with Jeanne grows closer. It reaches to a point where he strives to protect her no matter what. At the apex, he puts his own life on the line to save hers. And as seemingly incompatible as the duo is at first, Jeanne herself also develops feelings throughout their journey. Originally, she questions herself whether it’s worthwhile to accompany Nobunaga. Later, there’s a 180 degree turn where she strives to help him no matter what. To point it in easier perspective, the duo becomes more than just partners in crime. There’s even instance of Jeanne seemingly question what she is to him. Unfortunately, the romance angle of the show is vague, with only sparkles towards the end. It fails to communicate that part of the message without a meaningful purpose in the first place.\\n\\n\r\nFigures and legends that historians have been studying for ages. Nobunaga the Fool is a collection of noticeable characters from various backgrounds. One character of notoriety is Leonardo da Vinci. In contrast to Nobunaga, he is a man of intelligence known for his inventions from the West. His role as a journeyman is to seek out truth. Rather than power, he strives for knowledge and acts as a guide. With Nobunaga are also two other companions known as Akechi Mitsuhide and Toyotomi Hideyoshi. They serves as his arms and legs during his travels and yes, they are based off of historical figures from Feudal Japan. And finally, we can’t forget about someone that longs for Nobunaga’s attention. Serving as a love interest, Himiko (the queen of Yamato) makes offers to Nobunaga in exchange for one simple thing: his love. But a show like this only demonstrates love with a cliche way. It’s more like a niche, a badly executed one if it tries to construct a Romeo & Juliet story. The lack of chemistry is apparently present and their only closeness seems to be their common interests. On other hand, Nobunaga’s chemistry with his family makes up much more of his character. In one later episode, it truly brings out Nobunaga’s visage behind the mask he is wearing as he shows his sincerity, rage, and regret.\\n\\n\r\nIt’s hard to describe the style of Nobunaga the Fool. Absurd would be one of them for its package of colorful characters. Yet, the story itself does make sense later on when dangerous antagonists are thrown in and plot holes are formulated in Nobunaga and Jeanne’s quest. What stands between them is more than ideologies, but also weapons that can wipe them off the planet. The world this show takes place in has adapted the usage of mecha. Now, this comes with an odd mix because their world obviously has historical themes such as the shrines and temples. Nonetheless, mecha exist and stands for a testimony for being a superpower as a destructive ways of combat. The mecha are described as ‘sacred treasures’. Nobunaga pilots one of them which he nicknames “The Fool”. This doesn’t occur until after it’s unlocked by Jeanne with a little device known as the ‘regalia’. At that point, the show starts venturing off into a more sci-fi zone. Not only that but other characters also get their own mecha. It becomes absurd to a point of deconstruction where characters fight for affairs using these mecha devices despite having little to no experience prior. And here, I thought the taste of anachronism was weird.\\n\\n\r\nArtwork comes together clustered but that’s because the fusion of historical and science backgrounds added together in a mix. When you have that, it comes out as zany. Yet, most of the designs are solid in particular with the world class backgrounds. It’s creative and invites attention to questions for viewers behind its origins. This can also apply to the mecha with their innovative designs that gives them a menacing appearance. The action they demonstrate will draw in eyes for attention with rapid movements thanks to its artillery. The characters themselves also have a good balance of mixture with their designs. Nobunaga looks like a badass, he behaves like a badass, and technically, he is a badass. Other characters such as Da Vinci, Ichime, and Hideyoshi stays true to their consistent character designs to match the right persona. On the other hand, Jeanne is hard to take seriously. Despite being portrayed as a stunning beauty with her long blonde hair, curves, and figure, her character doesn’t match at all with the historical counterpart. It’s just too damn silly.\\n\\n\r\nJudgment of its soundtrack goes towards mostly for our characters’ voice mannerism since the show focuses a great deal to portray them individually. Of all the main characters, Nobunaga stands out the most with his commanding tone, intimidating nature, but also the same time a man heart of gold. However, others such as Himiko and Jeanne can come off as forceful with their voice mannerisms in particular during climatic scenes. On the other hand, background music has a decent degree of variances. It feels natural despite all the absurdity going on on occasions. The OP and ED songs also provide support for its moderate coordination with the OST.\\n\\n\r\nIt’s easy to say that Nobunaga the Fool isn’t for everyone. Even if you’re a historian, this show will at times dance around with its gimmicks to a point of deconstruction. But looking closely, the show have some merits to its themes and style. It’ll take time to get used to it but some patience may pay off. On the other hand, be ready for some cliché and gags that can be hard to praise with everything thrown together. The story itself is also clustered with weak writing and uninteresting characterization when it comes to development. All in all, this show isn’t like reading a history book to get its message. Rather, it’s like a foolish textbook of literature taught by a professor of the coming ages.\\n",
            "date": "2014-08-06T22:52:00+00:00",
            "helpful_count": 29,
            "mal_id": 155599,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=155599"
        },
        {
            "content": "Nobunaga the Fool is essentially an anachronism stew of notable historical figures of eastern and western lore from different time periods living on two separate planets with war slowly erupting between them as the western planet has their own heinous desires with the eastern planet unveiled throughout the course of the series. The series very loosely adapts elements to the historical personas of each character in the series with some of the major characters (particularly Jeanne and Nobunaga) gaining aspects of the historical character they are based off of while many of the Westerners don't get much to them beyond being archetypal evil characters perJapan's usual penchant of demonizing other countries in their works. Mecha, magic and elements of steampunk are also tossed into the mix as mecha serve as the main means of combat for the military in this series with powerful gems called Regalia that serve to amplify the abilities of a mecha and Leonardo Da Vinci milking use of fortunetelling to foretell upcoming events within the series.\\n\\n\r\nThe first half of the series sets up Nobunaga's rise to becoming the ruler of his clan and exploring the world of his planet as he gets into conflict with other clans, claims Regalia and hints are dropped over the lurking threat of the Western Planet's influence. This point of the series was solid in that it helped establish the backgrounds and problems facing the major characters of the series and the world of the Eastern Planet.\\n\\n\r\nUnfortunately, the second half is where things start becoming a mess with the title's plot as many of the major Western Planet characters lack the depth and personality of the Eastern Planet ones and makes an attempt at trying to be an epic clash between the Western and Eastern sides yet comes across as more predictable thanks to its milking of action and mecha anime cliches. It also tries establishing an unconvincing love triangle with Nobunaga, Jeanne and Himiko that doesn't get much focus thanks to the plot's greater focus on the conflict between the Western and Eastern planets. Also, the ending of the series is rather awkward as details on aspects of character motives and prophecies are suddenly tossed into the series finale without any hints to their coming or earlier exploration of them.\\n\\n\r\nVisually, the series is one of the better-quality titles I've seen for the year thus far with vivid scenery and a good amount of detail with scenery and character designs. The mecha used in the series are rendered in CG animation and move fluidly in action during heated battle scenes, though they stick out quite prominently compared to the regular animation.\\n\\n\r\nOverall, I found Nobunaga the Fool to be a case of an anime that started off well for its first half, yet crashes and burns for its second half. What started off as solid character focus and plot buildup devolved into fairly typical territory that action/ mecha titles delve into and a subpar attempt at trying to be grandiose with later plot developments. Kind of regret having to go through the second half of this title.",
            "date": "2014-06-22T17:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 148091,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=148091"
        },
        {
            "content": "First of all, this show is something else and never really knows when to stop, and if you are expecting this to be a pseudo realistic or historically accurate anime, it isn't. Also, if you don't like mecha anime, this show probably won't change your mind about it. So with that out of the way:\r\nStory:  5/10\r\nThe story of Nobunaga the Fool is a mixed bag. For the most part it's fine (the first 15 or so episodes), but occasionally there will be a moment that just makes you wonder if you missed some key bit of information in that half second you weren't payingattention. Unfortunately, it just didn't explain what happened very clearly, and never really does. It starts off strong, showcasing the really unique world NtF takes place in, but by the end it turns into an incredible amount of plot holes. There was definitely unused potential.\\n\\n\r\nArt:  9/10\\n\\n\r\nThere really isn't a whole lot to say about the art to be honest. There was only one moment in particular where I felt it was lacking, and the part only lasted for about 20 seconds. Everything else was very beautiful, and while it wasn't anything new, it fit the show well. The CG for the Giant War Armors was done well, and the fights felt like they had weight to them. Not exactly something you can say about every show. \\n\\n\r\nSound:  9/10\\n\\n\r\nTo be perfectly honest, I rarely have the option of listening to shows, and as such, I usually watch them without ever really hearing the sound. Luckily, I was able to listen to NtF as I was watching it, and I was not disappointed. No song really stuck out to me (I'm not really a huge fan of music), but I I was able to appreciate both of the openings and endings. The voice acting was where the sound really shown in my opinion, all of the voice actors and actresses except for Minori Chihara(Ichihime (something just felt off whenever she was speaking, but not enough to detract from my enjoyment)) really felt like they fit the roles they were given.\\n\\n\r\nCharacters:  7/10\\n\\n\r\nMost of the characters were fun and likeable, but lacked depth. The only characters that genuinely grow throughout the series are Nobunaga and Mitsuhide; the rest just sort of stay static or blandly follow the growth of Nobu and Mitsu to create the illusion of growth. Another thing is that the characters shown in this series in almost no way represent their historical and mythical counterparts, which isn't necessarily a bad thing. Overall, I think the characters were a positive, but like the story, could have definitely been done better.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nWhat can I say? I'm a sucker for these historical spin-off-esque(?) series', add in some mechas, amazing fighting scenes, and a wacky setting that I would have never even dreamt of, and I'm all in.\\n\\n\r\nOverall:  8/10\\n\\n\r\nIn conclusion, Nobunaga the Fool is probably one of the weirdest, most ridiculous, and downright insane shows I have ever seen, anime or not, and I loved every second of it. My experience with this show will not be one I will easily forget.",
            "date": "2014-11-29T04:50:00+00:00",
            "helpful_count": 17,
            "mal_id": 170303,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316779.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BladedCiaran",
                "username": "BladedCiaran"
            },
            "url": "https://myanimelist.net/reviews.php?id=170303"
        },
        {
            "content": "Nobunaga the Fool, while it appears to be an empty mech-action anime, is actually pretty cool and thoroughly impressed me. \r\n-Overall\r\nI like this anime, but the show has some premise flaws in that there are huge robots, but no cars, TVs, nothing. The technology in the show is that of Feudal Japan and the Feudal West, except that there are huge robots. That's pretty ludicrous, but it didn't bother me too much. Other than that, the show is obviously well crafted and well thought out (but I can't explain why because that would be spoilers) and the show isn't afraid to kill, like so manyaction anime are. The show is vastly entertaining, especially to people who know their basic Sengoku history, and if you don't, you'll still get something out of the fantastically crafted ending and the well choreographed fighting.\\n\r\nStory: 7.15\\n\r\nArt: 8\\n\r\nSound: 8\\n\r\nCharacter: 9.1\\n\r\nEnjoyment: 8.25\\n\r\nOverall: 8.1. It's very good.\\n\r\nMore details down below.\\n\\n\r\n-Story\\n\r\nNobunaga the Fool's plot can be compared to the historical Sengoku Period in that the big events of the period (the rise of the Oda clan, the Incident at Honnouji, etc.) are repeated in the show. However, the events are repeated in unique ways. The show provides foreshadowing each episode about halfway through in which a character pulls a card from a deck and Da-Vinci (yes we all know that historically Da Vinci didn't live in this time period) explains the card. These explanations provide foreshadowing, but very metaphorically. That leads to the viewer to say \"Oooohh... that's what he meant\" at the end of each episode. Besides that, the plot is pretty unique and paced alright, so the Story gets a 7.\\n\\n\r\n-Art\\n\r\nNobunaga the Fool's art seems more shiny and detailed than contemporary works, and often times the visual beauty is astounding.\\n\\n\r\n-Sound\\n\r\nThe voices are good, as voices usually are in subbed anime. The music, which isn't bad or outstanding, is often timed to fit the scenes well, which gets me to award the sound with a score of 8.\\n\\n\r\n-Characters\\n\r\nMost of the main characters are well developed, and they all provide interesting dialogue reflecting their personality. Something that bothered me, however, was that all of the people on the Star of the East have counterparts from the Sengoku period, and the entire star is just Japan. All. Japan. The characters on the Star of the West are from the Classical/Dark-Age and Chandragupta was from India, how is the India West. Why? But this shouldn't bother many people, just me. Despite that, the depth of the main characters have me awarding the Characters with a score of 9.\\n\\n\r\n-Enjoyment\\n\r\nI liked it. 8.",
            "date": "2014-06-22T17:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 148093,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3834193.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ToastytheBaker",
                "username": "ToastytheBaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=148093"
        },
        {
            "content": "Nobunaga the Fool is one of those shows that attracted my attention immediately. It seemed to be a cross between Star Driver and Sengoku Basara. So, a vaguely historical drama with giant robots that battle it out for reasons only vaguely explored. With lots, and lots, and LOTS of ham-fisted flash and dazzle, of the kind that makes Gurren Lagann look like a couple of kids waving sparklers about. Not the most intellectually stimulating thing I can think of, but good for a laugh. \r\nHowever, once the initial, introductory dazzle has simmered down and the show starts getting down to business, it becomes quite clearthat the show can’t quite decide WHAT the business at hand actually is. The show seems to hop between fictitious historical drama, science-fiction, fantasy, mecha, occasional romance, a little bit of shounen, and a whole host of other genres scattered about here and there. \\n\\n\r\nThe problem with Nobunaga the Fool is that it wants to do EVERYTHING. It not only wants to have its cake and eat it too, it wants the cake of the five or six people sitting next to it as well. You can only eat so much cake before the inevitable, and what the Fool vomits over the course of its tedious twenty-four episode run is about as pleasant to sit through as the metaphor implies. \\n\\n\r\nBut don’t get me wrong here, the first few episodes of the show are actually rather well-written, and promise great things to come. The political strife and backstabbing that occurs during Nobunaga’s rise to power is well thought-out and gives clear insight into character motivations. Here, the trio of Nobunaga, Mitsuhide and Hideyoshi truly shine, as whilst the three are united by a common goal, what they are willing to do to achieve that goal varies, and the actions certain individuals take towards that goal promise some serious ramifications down the road. Of the three, Hideyoshi is the only one not given any real character, being assigned the role of “comic relief” (I suppose SOMEONE has to do it) but as actions speak louder than words in this show, character becomes of secondary importance, as battles are fought, people are killed, and talk is cheap. \\n\\n\r\n…and then the West gets involved, and all hell breaks loose, as talk becomes central and battles are downplayed in favour of what goes on behind the scenes…which actually isn’t as interesting as it was initially, as Nobunaga has secured his power by this point and as the West is governed with an iron fist by King Arthur, there is little room for intrigue. \\n\\n\r\nCharacterization for the Fool from that point forward is, for the most part, poor, as characters fail to really develop beyond their initial roles. Outside of their relationships to one another – and not even that in most cases – there is little to associate these characters with the historical figures they represent; in fact, if these characters had any other names, the show would likely be all the better for it, as then the contrast would not be quite so jarring. Some, like Jeanne Kaguya (yes, really) D’Arc have been butchered entirely, abandoning their historical depiction in all but name only to adopt a guise (in her case, it would be large-breasted damsel-in-distress with the secondary functions of apocalyptic prophet and love interest) that serves to drive the ill-conceived mess of a plot along. There are a few moments where Mitsuhide in particular breaks out of his stereotypical servant’s angst for some moments of genuine, heartfelt emotional turmoil, and it’s difficult NOT to feel something concerning the love triangle involving him, Ichihime and Caesar at times, but for the most part the show is focused on how misunderstood and smart the reputedly foolish Nobunaga is, and how much of a big deal the grand East vs. West war is. \\n\\n\r\nThe terms “Saviour King” and “Destroyer King” get thrown about a lot, and the result at the end is surprising, but lacks the gravity it should, as the overarching plot is never given sufficient explanation or detail for it to have any sort of impact beyond a raised eyebrow. The story for the Fool is both predictable in how its going to end, and unpredictable for what is going to happen from moment to moment. This makes it both entertaining and tedious to watch, as events become isolated, rather than sequential. Each episode could be taken as standalone and, whilst this is not necessarily a bad approach, it is bad in the sense that nothing really ties events together. Things just happen; reasons and reactions are disguised, downplayed, or often just outright ignored, leaving the viewer wondering exactly WHY they should even give a damn about all this. \\n\\n\r\nStructure is given to the show by the tarot-card theme, which, like everything else, seems to have been thrown in there for convenience’s sake, and because hey, tarot cards are cool, right? It worked for Persona 4! Ironically, in defining the character’s actions by forcing them to fit to tarot cards, each episode feels  limited by the card description, and the sense of two worlds colliding is replaced by a very soap-opera feeling as the shallow, stereotypical characters lament on their personal (and often entirely uninteresting) dramas. Whose actions are represented by the card this episode?! This shallow, one-dimensional approach would have been so much better if explanation were not provided at the end of each episode, instead being left to the viewer to decide. The result is that episodes become focused on a single character, and everything else that happens in the episode is dismissed. When people are dying, betraying one another and fighting epic battles (or what SHOULD be epic battles) in giant robots, it gives a profound sense of mistaken priorities, and some missed opportunities for character development. \\n\\n\r\nBattles in the Fool fail to live up to expectation, being standard clashes between two characters who probably aren’t even sure WHY they’re fighting (Alexander the Great, at the very least, seems quite bored with the whole thing) a lot of the time, with little in the way of special moves or inventive combat styles, despite the fact the Regalia they use to pilot the suits are elementally-attuned (surprise!) and individual suits are all quite different in design, so should have fighting styles that differ from just “swing your weapon of choice to win”. There is no Gundam-style creativity here, unfortunately, and little in the way to recommend it. Star Driver had an awful plot, but fantastic fight scenes, which mitigated the offense somewhat. Nobunaga the Fool’s fight scenes are about on-par with its plot in terms of excitement. \\n\\n\r\nA typical East vs. West conflict with mostly out-of-context historical figures (Jeanne KAGUYA D’Arc, I ask you!) and stereotypical religious undertones in the guise of tarot-card titled episodes for good measure, Nobunaga the Fool is a grand exercise in stupidity that can’t even decide WHAT type of stupidity it wants to be. Stealing piecemeal ideas from almost every genre conceivable and then stripping the of anything even remotely resembling depth, what starts as a vaguely interesting and promising show quickly turns into a dull, convoluted mess that would make even the most inexperienced of fanfiction writers cringe in embarrassment. Avoid if you would prefer to keep your brain cells healthy and fully functional. Watch if you haven’t had quite enough bollocks in your life recently and are in the mood to completely and utterly waste your time – you’d be hard-pressed to find an anime that will waste it much more than this will.\\n",
            "date": "2014-08-07T02:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 155615,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shatterheartiel",
                "username": "Shatterheartiel"
            },
            "url": "https://myanimelist.net/reviews.php?id=155615"
        },
        {
            "content": "This is very frustrating.\r\nNobunaga the fool is an anime of big contrast and conflict. The best way to describe my feelings after watching it is love hate relationship...\r\nOn the one hand, every topic of the visual arts are masterpieces! No matter what: mecha design, character design, background, animation. Simply beautiful and perfect. Further there are plenty of new ideas and new concept in the story. The way they separated the western and the eastern world into two planets or tries to combine so many genres into unity are refreshing! \r\nOn the other hand: how comes that a story with that big potential becomes kind.. boring?There are just little of character development (except Caesar), no success of going deep into character's psyche, most of the important characters appear facile, dialogues mostly are not interesting.\\n\\n\r\nThe story could become much more complicated, very emotional and incredibly dramatic, but the most part of them turned out too simple too understand.  \\n\\n\r\nAt least: Caesar truly knows how to steal people's heart! Omg by making that sinful chocolate cake ;)",
            "date": "2015-01-26T11:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 179014,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4168435.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kagehanatu",
                "username": "kagehanatu"
            },
            "url": "https://myanimelist.net/reviews.php?id=179014"
        },
        {
            "content": "After investing a my time from launch of the 1st episode to the end episode #24 I found it very unsatisfying and as if I was cheated of my time and investment to the series. To give an example of how I felt Imagine it's Christmas morning and your parents told you  that they were getting you  a brand new skateboard, you race down stairs to see it in all of it's glory. Heart pounding, emotions at an all time high you see the shape of a rectangular gift wrapped up in beautiful wrapping paper with a delicate bow on top.  Youhold it in your hands, the perfect gift, and take it all in. Soon it will be yours. With careful hands you remove the tape oh so carefully, doing your best to saviour the moment. Then you give in and begin to shred the paper and all that gets in your way. They it is in front of you, your brand new skateboard. You take some deep breaths to calm down, only to find in front of you not the skateboard you wanted, instead you find a cheap piece of plastic with shoddy wheels and a clown decal on the underside... That, that is what Nobunaga The Fool was too me. It is my anime clown skateboard on Christmas morning,at the beginning it was really good, only to have it fall apart at the end.",
            "date": "2014-06-23T23:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 148317,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/patheticuser",
                "username": "patheticuser"
            },
            "url": "https://myanimelist.net/reviews.php?id=148317"
        },
        {
            "content": "I don't always do reviews for anime series, but for Nobunaga the Fool, I just had to do one. I'll try not to spoil the series and do my best to convey my thoughts and opinions about the series.\r\nStory: 10\r\nThe story was amazing. With the end each episode, I was always excited to see what would happen next. The story took many twist and turns that had me surprised. One moment, I'd think that one thing was going to happen, but then something happens that I was never expecting. This series isn't your run of the mill mecha anime. Niether is it your run ofthe mill Oda Nobunaga series. It's a fusion of Sengoku period and futuristic times, taking popular figures from long ago and throwing in giant robots. It's sure to please anyone who likes these two types of series.\\n\\n\r\nArt: 10\\n\\n\r\nWhen it comes to anime, I love when the art is appealing. This anime meets AND exceeds my expectations. The character designs are eye catching, the setting is beautiful, and the the mechas look amazing. CG is very cool and this anime does it just right. \\n\\n\r\nSound: 10\\n\\n\r\nOh man.. Let me tell you about this anime's soundtrack. I find myself humming the OST all the time. Even when I'm not watching the anime. It's just that catchy. The vocal tracks are awesome as well. There was an insert song by Jam Project which kicked so much butt! The openings and endings are also great. I listen to them all the time when I'm on my jog. \\n\\n\r\nCharacter: 9\\n\\n\r\nThe only reason why this gets a 9 and not a 10 is because there are a couple of characters that I did not like. Mainly because of some of the things they did in the series. However, the majority of the main cast are really cool. Nobunaga is a take charge guy who isn't afraid to fight back. This is the kind of protagonist I like. One who knows what he wants and does as he pleases. That's what makes him great.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nThere is never a dull moment when watching Nobunaga The Fool. Not once have I ever felt bored or disliked an episode. Each played an important part to the story and always had something cool in it to keep me entertained, whether it be a fight or character development.\\n\\n\r\nOverall: 10\\n\\n\r\nIn conclusion, Nobunaga The Fool has to be one of the best anime of 2014. Others may not agree, but that's what I believe. It's a series that makes you wanting more. It has a set plot that never gets too confusing, but isn't too predictable either. It also makes you think one thing, but will throw a curve ball and change it up so that it leaves you with a dropped jaw. You'll cry, you'll laugh, you'll cheer. This anime will fill you with a variety of emotions while watching it. It has enough drama to make feel for the characters and enough action to keep you on the edge of your feet. Give Nobunaga The Fool a watch. I'm sure you'll love it just as much I have.",
            "date": "2014-06-22T19:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 148105,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328298.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Arashi92",
                "username": "Arashi92"
            },
            "url": "https://myanimelist.net/reviews.php?id=148105"
        },
        {
            "content": "This is my first review(in general) so I apologize if the review looks really weird.\r\nSTORY: 6\r\nHere's a concept: Oda Nobunaga with mechs and Nobunaga himself is not a girl and it's not related to high school! It may not sound interesting considering the fact that there are other historical figures in the series like Leonardo da Vinci. The story overall isn't too terrible nor is it fantastic. The story in a way is original but it's just that the writers occasionally didn't know what they were doing so they placed some random plot elements and it fully doesn't make any sense whatsoever. The ending howeverisn't that amazing but it does close off the story pretty well (something that many anime don't seem to have). \\n\\n\r\nAlthough the story doesn't fully take it itself seriously and the story doesn't follow what it's supposed to be.\\n\\n\r\nThe story overall isn't too terrible nor is it fantastic. The story in a way is original but it's just that the writers occasionally didn't know what they were doing so they placed some random plot elements and it fully doesn't make any sense whatsoever.\\n\\n\r\nArt: 8\\n\\n\r\nThe animation isn't that special but I do like the character designs.  They weren't too realistic nor were they moe-ish. The art isn't too memorable but it's decent enough for the story.\\n\\n\r\nThe animation isn't that impressive but good enough for the series. I'm not fully expecting much for the animation, considering that is done by Satelight, compared to something like \\n\r\nAquarion EVOL (which has flashy animation) but the action scenes were brought out compared to something like Aquarion EVOL.\\n\\n\r\nThe backgrounds help fit the setting but that's all it does. Overall the animation is decent, but not the greatest out there.\\n\\n\r\nSound: 6\\n\\n\r\nI am not sure how to judge the voice acting as I'm not fluent in Japanese but I'm trying to learn the language but I'll do my best! The performances were well enough for the characters they are voicing although (in my opinion) best performance goes to Mamoru Miyano voicing Nobunaga when it comes to the way the voice sounds, which is something the seiyuu normally does so no surprise there (right?)\\n\\n\r\nMy favorite opening of the series is the second opening (not just because it's done by JAM Project). Both ending themes I really like (both in animation-wise, which isn't much but well done in its own right)\\n\\n\r\nThe OST itself felt a little transparent although one track comes to mind in comes to be memorable but I forgot what the track is called nor what it's used for but it sounds the most memorable to me (I'll edit this review when I find it).\\n\\n\r\nCharacters: 7\\n\\n\r\nIt's kinda hard to explain everything in the section, since I'm not supposed to spoil anything. I'll give out a brief summary, the cast is average, personality and character development wise.\\n\\n\r\nEnjoyment 8:\\n\\n\r\nIt doesn't get a 10 because there are times where it feels out of place kinda affects my enjoyment. Same with the characters (favorite character is Nobunaga, just saying).\\n\\n\r\nOverall: 6\\n\\n\r\nI like the anime despite the flaws (which are a bunch of them). It is all right for what it is. It was good enough to make it worth watching it to the end. If you aren't a fan of mecha anime, this anime isn't for you. If you are a fan of mecha, I would honestly give this anime a try.",
            "date": "2015-02-10T16:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 180104,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3884179.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Meganecraz",
                "username": "Meganecraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=180104"
        },
        {
            "content": "I almost didnt give this one a chance due to the low scores it had and the random mix of genres, but after reading some reviews i decided to give it a chance - which im really glad for. I exctually did enjoy it quite alot. I recommend that you watch this show with an open mind, like a colourful circus or like a roller coaster in the funny house. So I will now get down to why I enjoyed \"Nobunaga the Fool\" (who in all means lives up to his name).\r\nStory: 6/10\r\nBy all means the shows weakest part, but its actually not that badat all. There are a lot of plot holes and alot of things are never explained so they can never be really understood. As the page tells you, its a quite unique mixture of action, historical, mecha and sci-fi. And it aslo magic, super power, fantasy and romance in that mix. A mix at least I never seen before in anime. As expexted it gets messy sometimes, but shore not lets you down in the entertainment aera. This is a story of two worlds (east star and west star) thats are connected by forces that are never really explained, but you can clearly see a influence of western historia (west star) and eastern historia (east star). On the west star we have Europen historical personas as Jeanne d´Arc, Di Vinci, King Arthur and Julius Ceasar to mention some. On the eastern star you can also clearly see historical Japanese influences, with samurai clans, tea cermonices and traditional clothing. But there the historical part ends. Because in both world wars are held with giant mecha suits, and the most powerful worries carries a\"secret treasure\" which amplifies their power in some elemental way (wind, fire, earth etc.). The basic storyline is that Jeanne d´Arc tries to find out if Nobunaga is the \"Savior King\" or not, and a power struggle first internally on the east star, and then later between the eatsern star and the western star. A red thread in the story is that in each episode Di Vinci lets someone (often Jeanne) to draw a tarotcard, and he explains the diffirent meanings of that card. The card is always directed to some of the characters (which is where you come in to guess whom its diredted to), and the character in question will for fill that during the epsiode. Without spoiling anything I can say that the end of the show suprised me alot and I did not see that coming, which was refreshing and made me like the show more. \\n\\n\r\nArt: 9/10\\n\r\nIf the story is \"Nobunagas the fools\" weakest part, the art and animation is it strongest part. As expected of studio Satelight, the animation and art is great. As usual it has its flaws, but character designs, colours and backgrounds are beautiful and colourful. Motions are fluid and smooth, and the CG mecha fights are pretty good as well. \\n\\n\r\nSound: 7/10\\n\r\nThe music and sound are by no means outstanding, but its absolutly above average. The music is mostly intrumental towards the classical, which suits the mood and diffirent settings in the show good. I liked the first opening song quite a bit, but the second one never really got to me. I watched the dubbed version and the voice actors were not magical but they did there job well, and had manage to capture the nature of the characters good as well. \\n\\n\r\nCharacters: 7/10\\n\r\nOverall there where no major character developments, but at least you got to know the main and supporting cast well enough to give the story life and actions motivated. \\n\\n\r\nFirst out we have one of our MC´s Nobunaga. He is the heir to the Oda clan, and is in no way espacially eager to take up on the responsabilites that comes with it. He can many times come out as a jerk but at least he is honest. Nobunaga is a very stong willed person, who always do things his way - no matter what. He can seem pretty care free and foolish, but do have deeper feelings and if his close ones needs him he will cross worlds to save them. As expected from a MC he has some character development, there he gets to terms with who he is and what his purpose is. \\n\\n\r\nJeanne d´Arc/Ramarou - Had more potentail then was exicuted in the show, but by no means a bad or boring character. She has visions of future events, ever since she was a child. In classical historical anda she was seen as demon who only brought unfurtiune to others. That made her to not trust herself, which she has deal with under many occasions during the show. Her strongest belives are that Nobunaga is the \"Savior King\", who will save both world from distruction - but even those belives are put to question.\\n\\n\r\nDi Vinci -  Can be seen as your guide in this malstream of generes and events. He is the observer - following the events with a kind of distached facination. He is the one with the tarotcards, with his actions and words pulling the story forward without being directly in the actual events. \\n\\n\r\nAnd definitely worth mentioning is Himiko, Ichihime, Ceasar and Mitsuhide, who all are contributing to the story. They all have their own peronalities, wills and diseres that will contribute to that the plot is moving forward, sometimes in very drastic ways.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI actually really enjoyed myself watching this show. You never really know what next episode would go, which made it intresting to watch for me. Yes, sometimes I was pretty confused, and asked myself - what the hell did just happened and why? But it was never boring and managed to entertain me alot.\\n\\n\r\nOverall: 7/10\\n\r\nIt was most definitley worth my time. Yes, the plot wasnt that outstanding and sometime confusing (which normally goes against my standards of a good anime), but it never failed to entertain me. The great animation and art was clearly a huge plus. I would definitley recommend \"Nobunaga the fool\" to you who want to see something totally different and dont mind unique mixture of geners.\\n",
            "date": "2016-10-21T04:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 232232,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=232232"
        },
        {
            "content": "I was really surprised by this anime. So much so I made an account just to reviews it. \r\nI would say the first two episodes you kinda have to force yourself to keep going. Your mind is telling you this is quite dull....and very confusing. But by the third episode I was forcing my husband to sit and watch it with me cause I knew it was gonna be epic. \r\nThe story is extremely detailed and if your don't pay close attention you may miss something. It is a very tightly packed story so much so they actually so skip scenes where characters narrate whathas happened. So be prepared for the skip scenes....I was kinda confused at first...makes you think you missed an episode somewhere. \\n\\n\r\nThe art is good. Not the best art I've seen but no where near the worst. It seemed to be the style changed maybe 15-20 episodes in. The characters seemed more life like...maybes it's just me. \\n\\n\r\nThe opening and ending song for the first half of the anime is freaking awesome. Please just fast forward through the opening on the second half. It was major let down. The ending isn't terrible but not my favorite. \\n\\n\r\nOver all I will own this anime as soon as I can get my grubby little hands on it. And it will have a spot on my shelf of the like 10 anime I deem important enough to own. I just can't tell you why...you have to watch it to find out.",
            "date": "2014-06-22T21:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 148123,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FallenAngel1129",
                "username": "FallenAngel1129"
            },
            "url": "https://myanimelist.net/reviews.php?id=148123"
        },
        {
            "content": "Nobunaga The Fool is  shining gem of a series I'm so glad I got to experience. Combining historical characters, history, fantasy, mecha and magic, this series delivers an ambitious and creative narrative and stands as a unique offering in a sea of \"been-there-done-that\". My spoiler free review:\r\nStory: 7.\r\nNobuanaga The Fool's story is ambitious, it combines elements of Japan's history, famous figures from world history and magic and creates this incredibly juicy story that at it's core is about destiny. The way the show uses the cards - pulled once per episode by characters to fortell an event to come - is so incredibly uniqueand intriguing. The cards meaning often unfolds in a way you don't expect but guessing the meaning along the way - with the characters - as the story unfolds both per episode and as a whole creates a very unique experience. The story was heavy on detail and does require you to really pay attention as it unfolds but it also delivers a great deal of action and suspense as well. The story was well-paced, unique, and kept you guessing till the very end. \\n\\n\r\nArt: 7. Nobunaga The Fool has an appealing art style - it boasted great character designs, beautiful backgrounds and scenery and a great use of colour. Present - as with most mecha's these days - are the clunkier CGI mechas I am NOT fond of and I found their design did detract from my appreciation of the art. I am not fond of clunky, CGI mecha's and I never will be.\\n\\n\r\nSound: 9. Nobunaga The Fool had a great soundtrack. A nice wide range of pieces that really enhanced each and every scene when used. I was very fond of the two battle theme's, in particular, Destruction-King and it's use within the series. The 1st set of openings and endings was very good - I really enjoyed both songs, especially the ending theme, though the second cours themes weren't quite as special.\\n\\n\r\nCharacters: 7. Nobunaga had such a WIDE range of characters. Nobunaga Oda, Julius Caesar, Jeanne d'Arc, Leonardo Da Vinci, Alexander, Cesare Borgia,  Hideyoshi, King Arthur, etc. The cast of characters - and their very unique use in this series - was very enjoyable. I have a deep love of history and I appreciate nothing more when history is used to inspire something creative and thought provoking and these characters were used so uniquely within this series and really delivered that for me. The characters as a whole were well developed - there were times when I questioned Nobunaga's development but I soon found my questions answered and was very happy with his journey. A few could have been focused on and developed a bit more, but overall, the series did a good job in that department. Each character had an important journey, lessons to be learned, truths to be realized and destiny's to both fight and accept - and their journey's were well handled and developed and ultimately, very very enjoyable for me.  \\n\\n\r\nEnjoyment: 9. I deeply enjoyed this incredibly creative series. It's use of magic and history - my two favorite things in the world - to deliver this unique story with this odd, yet incredible cast of historical heroes was so refreshing. Nobunaga delivered on so many levels with it's great OST, interesting and unique story that is far from predictable with it's twists and turns (and before watching this, I felt starved for something truly unique!), high action and great use of magic. Fans of history, mecha, magic and high action will really enjoy this wonderful series which is sadly, very underrated. It wasn't perfect but it was a unique, highly enjoyable gem of a series. \\n\\n\r\nOverall: 8.\\n\\n\\n",
            "date": "2015-04-07T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 185079,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4165105.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inori101",
                "username": "Inori101"
            },
            "url": "https://myanimelist.net/reviews.php?id=185079"
        },
        {
            "content": "NO SPOILERS C: \r\nI started watching this show 4 years ago and dropped it after 4 episodes, and it's just now that I decided to give it a second chance. Difference being that at that time, I didn't know any of japanese historical characters. Knowing few facts about the real warlords changed the way I see the characters, and made it more interesting too follow.\r\nStory fair to good enough but had greater potentiel.\r\nCharacters developements Ok to good. \r\nSeiyus' acting was great as always and musics ok.\r\nThe Art good as well.\r\nOverall 7,5/10\r\nIt wasn't the anime of the year, but even if the first episodes were abit a torture to watch at last I enjoyed the show And I don't regret giving it a second chance!",
            "date": "2018-03-18T06:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 274179,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3373005.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LelouchOkami",
                "username": "LelouchOkami"
            },
            "url": "https://myanimelist.net/reviews.php?id=274179"
        },
        {
            "content": "I just finished the last episode in hope of anything making sense...\r\nbut of course nothing did.\r\nThis all anime seems to have tried to mix everything; Mechas, samourais, spaceships, magic, legends, love, fighting, politics... they only left the hentai out  -_-\r\nYou never get surprised; the anime tries to please everyone, but doesn't make any sense. It's not even spectacular since everything is so predictable.\r\nReally disappointed in this show. You can see they put money in it yet...\r\nSuch a shame.",
            "date": "2014-06-23T11:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 148231,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3537361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Philou255",
                "username": "Philou255"
            },
            "url": "https://myanimelist.net/reviews.php?id=148231"
        },
        {
            "content": "Summary: This is a mech anime that isn't really a mech anime. It is more an epic story about the unification of 2 kingdoms with tons of historic figures reprising various roles and lots of awesome battles and story arcs. The anime jumps the shark a few times and there are definitely a few things to be desired but I thoroughly enjoyed this for all it's flaws. In lieu of a long review I will sum up the positives and negatives:\r\nPositives:\r\nAn epic story that develops from something pretty simple and straight forward to downright epic. The story involves tons of epic historic figures from Alexanderthe Great to Julius Caesar to King Arthur. Seeing how each character evolves and the role they play is a pleasure.\\n\r\nThe art is gorgeous and well done. This is a GREAT looking anime.\\n\r\nThe music is nice and well put together. The fighting sound track is also excellent and the voice actors do a fantastic job.\\n\r\nI enjoyed the story from beginning to end. Regardless of it jumping the shark and being a bit confusing it wasn't afraid to cover all sorts of angles and go to dark places unapologeticly. It is also A COMPLETE STORY. You don't need to read a LN or Manga... this is the total package from beginning to end. Boy isn't that nice!\\n\\n\r\nNegatives:\\n\r\nThere are some confusing points to the story. I swear there is an episode missing with Mitsuhide and Caesar that confused me endlessly. The ending is definitely meg and I have a hard time imagining anyone being satisfied with it.\\n\r\nHappy ending... not so much. Lots of characters will die... and I mean LOTS. Do NOT watch this if that kind of thing is too dark for you.\\n\r\nThe ending is a bit flashy and too convenient. A little to much of \"boy that wrapped up neatly\" though I won't fault it too much because it was not afraid to go in an unexpected direction.\\n\\n\r\nFinal Summary: If you like excellent story driven narratives this is for you. It has good fight scenes but is mostly story/character drives. Prepare for an emotional roller-coaster. It is a good experience, it starts a little slow but it is a great adventure. Enjoy!",
            "date": "2016-05-19T22:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 218930,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=218930"
        },
        {
            "content": "A short Review for everyone who is still not sure if to watch it because of the 'bad rate' :\r\nNobunaga the fool was one of my favourite Anime - at least for the first 15-18 episodes. Before that turning point it's a very good anime with a good story, awesome story developement, much comedy and a nice and cute Lovestory. I really enjoyed it! But after episode 15-18 the whole mood changes to a depressing, not very comedical, tragic story with an aweful ending that doesn't make any sense.\r\nStill I would recommend watching it - if not for the end of the story it wouldbe a clear all in all 9 ...but like this...\\n\\n\r\nNevertheless - watch it an enjoy it! I also rewatched the series a few times (till the episodes 15-18) and I'm still planning on doing so again :)",
            "date": "2016-04-11T10:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 216122,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5015175.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Siarame",
                "username": "Siarame"
            },
            "url": "https://myanimelist.net/reviews.php?id=216122"
        },
        {
            "content": "Mmmm... I think my review will be like all others here.\r\nStory - 6 (fair)\r\nWhy I'm giving this story a six?, well... because plot wasn't so bad, the execution is the problem here... It was a good premise, but this anime was trying to grab so much stuff and ends saying nothing.\r\nArt - 8 (very good)\r\nThis was the good part of the show, battles in mecha armors are very well done by the art crew. And characters in general are well animated, not at the same level of mecha armors, but are well done anyways.\r\nSound - 6 (fair)\r\nI didn't like openings and endings, but I likedthe OSTs fair enough to give them a 6, is not memorable, but something is happening inside my bones when I listen epic music. \\n\\n\r\nCharacter - 2 (dreadful)\\n\\n\r\nOh, my... This is the reason of my poor enjoyment of the show... CHARACTERS ARE CRAP. I mean... Joan of Arc should be a badass woman and this version of her is an insult, I even like a bit more Himiko than her, at least she did something in the whole series. Oda Nobunaga is a bit better, but why is so one-dimensional character?, I didn't like how they wrote his personality. And well... the rest of the cast, except the ninja girls, the lady in charge of mechas maintance and Ichihime... are so annoying or entirely different to they real counterpart. And WTH... King Arthur ressembles more a dark sorcerer than a king... He was acting more like Betelgeuse from Re:Zero or Gilles de Rais (Caster) from Fate/Zero, really disgusting.\\n\\n\r\nEnjoyment - 4 (decent)\\n\\n\r\nIt wasn't SO bad. I could, actually, finish the anime, but it was a bit painful because lack of personallities and weird and uncomfortable plot holes sometimes.\\n\\n\r\nOverall - 5.2 (~6, fair)\\n\\n\r\nI wouldn't recommend this show to anyone, but it WASN'T SO BAD. I just don't want to watch this again '-'...",
            "date": "2018-04-12T21:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 277909,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LinHashimoto",
                "username": "LinHashimoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=277909"
        }
    ],
    [
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nGotta \"review\" it before I forget what it was all about, this clusterhell of an Anime.\r\n✦Story\r\nYou know... reason I kept watching was because I couldn't figure out whenever this was a masterpiece or an absolute bollocks. Thankfully last episodes helped me to decide that this was an horrid Anime. Aside synopsis I must say story was somewhat \"good\" because of it actually tried to have story, lot of sides of the story and the depth. But instead it felt as everything was tossed in, giving lot ofnarration and dialogues, which fell apart on it's own weight. Point being, story was attempted too serious for its thematic and also had an failed presentation. In another words story/world was quite inconsistent, pacing all over the place, even if story links made sense, they didn't feel any good. And way characters were tossed left and right plus that finale, made it even more  moronic than it should have been. Point being,  \"story\" was horrid, inconsistent and too much was attempted to throw in.\\n\\n\r\n✦Art & Sound\\n\r\nAnother aspect of mixed feelings regarding this Anime. Art and animation for the most part felt okay, while at some times (especially some character close-ups) it felt as I was watching at some paint image. Meaning it felt very basic and plain art at times.\\n\\n\r\nAs for OST, to be honest, I cannot remember any. Which means either they were as bad/mediocre or didn't have enough presence. Did youtube few tracks afterwards, but opinion remains.\\n\\n\r\n✦Character\\n\r\nProbably part I liked the most, lot of stereotypes and moronic \"depth\" characters that tried to do/be something too hard and that simply felt stupid in the end. (hate overall people/characters with typical facade/lies characteristics..etc.).\\n\\n\r\nGoing to mention only main trio, few side-kicks and character I liked in a most simplistic way.\\n\r\nWe have main guy, a loud meathead. We have a main girl, beautiful oppai moral compass and a squad gatherer the Da Vinci, who is some odd theatrical guy.\\n\\n\r\nAs for sidekicks. Aggressive monkey, Silent killer/tactician and bunch of others.\\n\\n\r\nAnd the character who I loved the most was \"Himiko\", she was adorable.\\n\\n\r\n✦Enjoyment & Overall\\n\r\nAs mentioned, it's a clusterhell of an Anime, with too much attempted to throw in, too many moronic story aspects, and annoying characters and all over the place consistency. Too serious/heavy for it's own good. It crushed with it's own attempted weight. Point being, from the first look it looked intriguing Anime, but by the end of it I understood how bad it actually was.\\n\\n\r\nOr in another words, I did not like it at all.",
            "date": "2017-12-26T03:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 266429,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=266429"
        },
        {
            "content": "Nobunaga the Fool is a perfect example of how a show can have everything and still be dreadfully boring if it screws up the most important element of storytelling: the characters. \r\nThroughout the interesting setting, the great plot outline, the fantastic battles, and everything in between, you find yourself often wondering why you can't seem to care about any of it. Everything on paper says this anime should at the very least be enjoyable as a minimal amount of mindless entertainment, but it is not. Everything that happens in this anime simply precludes a yawn and a ho-hum. \r\nSo why is this show bad? It'snot a complex reason at all really. Because at any point in time the entire cast could have been replaced by a new cast and it would have probably been for the better. Nobunaga the Fool tries so hard to jam pack itself with tons of different story elements it completely neglects the crucially important art of making sure your characters aren't horribly one dimensional. What was Nobunagas main motivation throughout the show? I can't even remember, because the writers and director never made it a big deal. Why do the female characters find him attractive? What are they even like? Do they even have a personality? None of that seemed to matter to the creators of this anime. \\n\\n\r\nIn order for a story to be interesting, the characters must be at least relatable. If a story doesn't tell you anything about any of the characters at all, then what you have is an outline with the potential to be a story - not an actual story. That's what Nobunaga feels like: a potential story that could have been good if the writers focused more on what matters and less on trying to be an epic about the universe. \\n\\n",
            "date": "2017-09-15T17:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 257616,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1315147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/The_Walker",
                "username": "The_Walker"
            },
            "url": "https://myanimelist.net/reviews.php?id=257616"
        },
        {
            "content": "Nobunaga the Fool was both good and bad. I do not like the story it was to depressing and it made me doubt myself and i do not realy like that. The art of this anime was great almost the best i have ever seen. Sound was great to i do not like the characters because the way the presents Jeanne D'Arc is not the image of Jeanne D'Arc i have. Jeanne D'Arc was brave and tough, she was not this weeping little girl this anime presents. It was two things this anime hade correct about Jeanne D'Arc. The first is that she was beautifuland the second is that she got premonitions from god. There image of Julius Caesar was real weird it was both right and wrong with the image i have. It was some of the things i did not like with this anime. I like that they created the anime with such big names though. I love the battles to it was exciting.",
            "date": "2017-04-25T05:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 246278,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Habbe90",
                "username": "Habbe90"
            },
            "url": "https://myanimelist.net/reviews.php?id=246278"
        },
        {
            "content": "God this anime could have been awesome but it managed to ruin everything. Before I start be warned that this review might contain minor spoilers.\r\nThe summary of the story sounds awesome to the ears. Especially for a big fun of Fate/zero this anime would be the next best thing. But unfortunately it isn't like that. In contrast with Fate/zero which is a clearly battle anime with some philosophical aspects , ''Nobunaga the fool'' tries to mix all kinds of genres and the results is a huge disaster. From the first episode the anime was shouting from the distance that it was going to be boring.And unfortunately it was. Well, at least for the first 14 episodes. After that it became better but I don't thing that anyone is so patient to bare watching until then. It wasn't that the anime had problems with the pacing. In fact it is a very violent anime with a huge body count up its sleeve. What makes this anime boring are it's really uninteresting characters and the failed try to mix almost every genre in 24 episodes leaving this way a lot of plot holes and things that didn't make any sense. For example in the first episodes Nobunaga looses some very dear persons of his but we don't  see their deaths to have any effect on him until the very end, making us to forget them really easily. The worst part of this anime though were the characters. Nobunaga is clearly a Kamina rip-off with the only difference that he was boring as hell.  Same goes with almost all of the characters and that's really bad because this anime especially at the end becomes really character-driven, but with the characters to have almost none character development it didn't end up nowhere. Only exception was maybe Caesar's character but he was also ruined near the end   The  only thing I liked about the story was that the world was really well introduced to us. Especially the huge anachronisms made it somehow fun although it couldn't save a lot of things. After that comes the animation which was good but not for a production of 2014. The mechas were animated solely by CGI which I didn't like really much but I let it slide. About the sound I didn't like neither the first opening, nor the first ending but the second OP/ED  were really good and catchy. But  the voice acting had some flaws. With Mamory Miyano as the protagonist and some other huge names for the secondary characters (like Takahiro Sakurai, Yuki Kaji, Tomokazu Sugita and my personal favorite Kazuya Nakai) you expect some big performances but the results are rather disappointing. Having experienced all those big names in some very amazing roles in other anime and knowing their potentials I have to say that in this anime they were somehow off especially Miyano but I believe this was mostly because of the badly written characters.\\n\\n\r\nSo as you probably understand I didn't like this anime. It had a really good main story but it ruined it with a lot of nonsensical things that made the plot really boring. Of course this is only my opinion. If you don't agree with me I will gladly listen to your arguments in a  peaceful way. I hope I helped you somehow and sorry for my bad English.",
            "date": "2015-03-15T09:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 182391,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4161079.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/femto999",
                "username": "femto999"
            },
            "url": "https://myanimelist.net/reviews.php?id=182391"
        }
    ]
]