[
    [
        {
            "content": "Initially, I started watching because I liked the sleek and colorful aesthetic, and the idea of parkour races sounded cool. I like the first few episodes and thought the races were exciting and nice to look at, with a killer soundtrack. Upon watching the next episodes up the the sixth that has aired I've lost interest, with a super melodramatic plot that makes zero sense, backed up with paper thin characters.\r\nThe sport itself does not even take the least amount of effort to make any sense. It is a race based on speed, but people waste time doing flashy parkour moves. Would it not havemade sense to give credit for style points if it is an integral part of the sport? They could have added in a number of explanations for the sport to make it a little more plausible, but there was none. \\n\\n\r\nSpeaking of implausibility, there is the plot. It's full of melodrama with the characters over reacting to everything like their life depends on it in stand anime fare. The backstory of the stride club and the reasons surrounding people's reluctance to join is completely laughable. It is the standard annoying anime logic sort of thing where the good guys get bad press in the eyes of the public, but really they didn't do anything wrong. Such bad press could be avoided by reasonably explaining the situation, but common sense does not exist here. All this serves as set up for the scenes with cheesy inspirational music, inspiring speeches and some nonsense about \"connecting emotions\" as the stride club works to redeem itself.\\n\\n\r\nThe characters are all one note which makes the dramatic plot points even more lame. It is fine when all they are doing is racing and having fun, but they do not go together with a plot that asks me to sympathize with them. They are also all pretty boys making some of them look downright goofy because of how out of place they are on the stride courses instead of posing for magazines. There is some of that as well; a boy band concert, photo shoots and such show up to appease the fujoshits. \\n\\n\r\nVisuals: The reason I started watching this in the first place. Unfortunately, you do not get to see as much running as bobbing torso. Not that much of the running gets animated. It was most apparent to me when a big, surprising parkour move was performed, and we don't get to see any of it. It is all conveyed by implication. \\n\\n\r\nOne aspect I did enjoy was the soundtrack. It got me pumped up for the races and fit well with the artstyle. I'll be looking forward to the ost release. \\n",
            "date": "2016-02-10T17:29:00+00:00",
            "helpful_count": 110,
            "mal_id": 210623,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4530434.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Indari",
                "username": "Indari"
            },
            "url": "https://myanimelist.net/reviews.php?id=210623"
        },
        {
            "content": "There's no real explanation to it, so let's just assume that \"alternative\" in the title of Prince of Stride implies that you should watch an alternative show.\r\nSo, anyone willing to tolerate sports anime thought this would be pretty cool. Running with some parkour elements? Shit, parkour’s awesome, this oughta be good. But instead, we’ve been given a thoughtless, soulless, utterly boring show with no point in watching to completion unless you really, really like sports or writing yaoi fanfics.\r\nFortunately, Stride conveniently makes all of its fuck-ups clear within the first episode, so this doesn’t require a lot of work. Every major character (with the exceptionof a couple that won’t be introduced until later because reasons) gets introduced within the first ten minutes. It’s too much too quickly, like going to your parents’ favorite hangout and having to suffer through all the introductions to their stupid friends who only talk to you to ask about how school is going. But, don’t think about it too hard, look alive because the plot’s coming through!\\n\\n\r\nA school with a famous stride club (whatever that is) is now close to disbanding because they don’t have enough members for official matches because no one likes stride. Wait, what? I thought this was famous? Where did everyone go? That doesn’t matter now, because Riku (whose name I only remember thanks to my fifteen years of playing Kingdom Hearts) joins the club and fills the deficit, and now the almighty Honan Stride Club is ready to go. The whole school sets up a course for the club because they’re all so excited to see stride return that they didn’t even remember the club existed five minutes ago, because no sports anime would be accurate without a bunch of bandwagoners! Go Royals!\\n\\n\r\nWait, aren’t we forgetting something…………? Oh yeah! WHAT THE FUCK IS STRIDE?\\n\\n\r\nStride, the sport, is introduced to us after giving an incredibly vague explanation of just a few things about it. You know, it’s not really the audience’s job to put more thought into your own work. We’re expected to figure the rules of the sport out for ourselves because the authors were too lazy to do it themselves. But after a couple episodes, you can see that stride is just some relay racing with parkour with a coordinator from the sidelines, with some specific details that won’t be necessary. See how easy that was?\\n\\n\r\nBut some questions still remain. Why do we need the gimmicks? What’s the point in the end? One guy did a run while completely skipping the obstacles and nothing really happened, he still had a great run. If they’re there just to make the runs look flashy, it’d be good if you could actually implement flair into the rules of the sport, even making it part of some score. It’d be even better if the parkour was naturally part of the course and not just some shit they threw in the middle of the road. People racing over rooftops and over fences would be pretty badass. They could at least put more shit in the road. But my point is that I’d like it if the parkour had a bigger focus and speed wouldn’t be the only thing necessary.\\n\\n\r\nThen you have the relationers, who coordinate the runners from the sidelines via headset. One team told their relationer to fuck off and one of the runners did all the work while the actual relationer was there as a formality. If the runners can control things themselves, what’s the point of the relationer in the first place? Shouldn’t this be illegal, at least? Why isn’t anyone even watching this race, like a referee? Does ANYONE care about what’s going on??? WHY AM I ASKING SO MANY QUESTIONS?\\n\\n\r\nIgnoring the dumb sloppiness of the sport itself, we have the actual story. Yes, I care about a story in a sports anime, at least to an extent. It’s a sports anime so you can only expect so much, but as long as you write better than a 10-year-old then I can accept it. But when Stride tries to incorporate some human drama, it just gets idiotic.\\n\\n\r\nPrince of Stride being about some high school sporting event just won’t cut it, so we need some DEEP and COMPLICATED backgrounds or something. The reason why Honan’s stride club was low on members in the beginning is because of an incident that caused most of the team to quit. This incident is one of the most bafflingly brain-dead events ever conceived. To not spoil it specifically, the old relationer got rekt by the other team’s, and that caused the runners to crash and lose the race. The relationer and another member then act like complete fucking idiots and escalate the situation way beyond reason, and the knight in shining armor, the only person with a brain, the one who breaks it up, is then blamed for it without anyone trying to communicate like human beings. I am laughing so hard while writing these very words right now.\\n\\n\r\nThe other sort of incident involves the main character not knowing how to get gud and then quitting stride for a while. That’s it, that’s his backstory.\\n\\n\r\nHaving some human drama is nice, definitely. I’ll admit that at least the last few episodes had some sort of weight and tension, but all of this is just so stupid, man. But I could at least respect the nerdy guy, he had some actual problems and characterization that wasn’t dumb. Maybe as a token of my appreciation I’ll go look up his name on the database when I’m done.\\n\\n\r\nBeyond that small number of characters and their dumb stories, the rest of the cast is incredibly flat, boring, uninteresting, generic, and other synonyms, no matter how many memes they try to force. Their only chances of being likable come with how many of their stupid, annoying LOLSORANDOMXD jabs they throw at you. Nice try, Dr. Meme. Oh, whoops, that’s a SIGNATURE PHRASE!!!!!!!!!!!!1111111!!1/1?11/1\\n\\n\r\nShoving away that nonsense, the characters include Leg-lover, who’s the only yaoi bait you’re gonna get, unless you got a kick out of that one guy who had to dress up like a girl. I felt like kicking myself in the nuts just for putting up with this. No one else has anything worth mentioning (except nerdy guy who eventually drops out of relevance anyway) except the girl because she’s a girl and she’s voiced by Hanakanamanahawamawallama, which really isn’t a compliment because she doesn’t have a personality either. The only thing she’s good at is being really worked up over what the other relationer is doing. DO YOUR JOB, IDIOT.\\n\\n\r\nThe woman who directed No Game No Life was told she couldn’t make everything purple in this, so instead she used normal colors and brightened them up about a thousand times. Okay, it’s not unbearably bright, but it really isn’t pleasant to look at, even deep into the anime where you’re expected to be used to it by now. The animation itself isn’t that big of a deal, either. In fact, it’s pretty lackluster, especially given that Madhouse used the same budget as One Punch Man. Maybe they spent it all on memes to try and recreate the magic. I dunno. Anyway, doing cool parkour shit is okay. I guess. But the running is often poorly framed--I don’t give a shit about people moving their arms around really really quickly, you run with your L E G S. LEGS, MAN! Some clever angles would’ve made this pretty interesting to watch, but I guess no one cared as usual.\\n\\n\r\nHey, remember Overlord? That one anime about Mr. Skeltal trying to take over the world? That opening song was incredible, right? Well, the same guys came back to do Stride’s, except not nearly as loud, exciting, cinematic, catchy, or even enjoyable. Which still makes it a decent song because Clattonia was just pure awesome, but the song doesn’t have a lot of punchiness or flair, and it’s marred by some pretty goofy lyrics. The art accompanying it has some style, at least, even if the runs presented look confusing. The rest of the soundtrack has a number of insert songs, which are pretty intelligible when used amongst the action, but I thought the non-inserts were surprisingly good. Not crazy good, but they have a smooth style and presence and are just exciting enough to make you keep your ear out for them without distracting you from what’s on screen. Not a bad ED either. I only listened to it like twice, though, because I wanted to move on as quickly as possible.\\n\\n\r\nThe last thing I wanna talk about are the guys, because this show is supposed to be yaoi-bait and I need to make this clear. These fuckboys don’t even look that good. Thanks for reading, everybody, have a great day!\\n\\n\r\nStory - 2/10\\n\r\nArt - 4/10\\n\r\nSound - 7/10\\n\r\nCharacters - 3/10\\n\r\nEnjoyment - 3/10\\n\r\nYaoi - tryharder/10\\n\r\nOverall - 3/10\\n\r\nFavorite character - Ayumu\\n\r\nFavorite episode - 11\\n\r\nRecommendation level - Very Low",
            "date": "2016-03-22T08:38:00+00:00",
            "helpful_count": 89,
            "mal_id": 213598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4673091.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MozillaFennekin",
                "username": "MozillaFennekin"
            },
            "url": "https://myanimelist.net/reviews.php?id=213598"
        },
        {
            "content": "Prince of Stride: Alternative was one of the first new Winter show to be announced just as the new year arrived. It was also among the first ones to be aired in the season, much to the build-up that was added to it. With one of the masters in the industry working behind it, i.e. Studio Madhouse, Prince of Stride: Alternative was well worth the hype it had accumulated thus far, but as the season progressed, it quickly started to fade away. Why? Let's look into it in detail.\r\nThe show brings no creativity at all to begin with. It has been done countless time insport anime's before. Famous high school club now in ruins and desperate for new members. Atleast try to be a little more creative. The game of Stride does bring a sense of freshness to the show. Basically its a sport where you run all the while competing with the another 'Strider' within your block. It consists of five different members running from start to finish as all the five team members play a part in the whole sequence and give a touch for the next teammate to continue running. One of the problems with the show is that twelve episodes were always not enough to begin with. There are have been countless other similar shows being successful solely based on the fact that they run for a longer time. Time was an important asset to them and they had plenty to utilize it with the execution. This is something Prince of Stride: Alternative lacked big time. On a side note, I cannot understand why there's a 'Alternative' in the title. I've come to light that the source material was a visual game and the show can be taken as a spin-off of that.\\n\\n\r\nThe characters on the show do it no good, with all honesty. All of them are like a basic stereotype with nothing to set them apart from any other generic characters. The MC is a light-hearted and silly guy with a dim-wit personality who just likes to run and is aiming to be on as many of the high school clubs as possible. There's the very cold looking teammate who acts as a direct rival for our MC and who doesn't talk much, and of course, does not get together early with our MC. Then there's the only girl in the show who's in fact the very first characters to be showcased and is another main character in focus in every sense who is inspired by the Stride club's achievements in the past and is aiming to be in the team as a manager. She eventually acts as a Relationer in the team who serves as a guide to the running teammates offering guidance with a speaker directly to the Striders. Then there's always a trap in the group along with a nerd who isn't interested being with the club to begin with. Two more senior characters are there in show, one's a cool, handsome looking guy who seems to be a senior worth relying on, and the other, literally having nothing worthy of praising, in my opinion. The manager however, was an interesting characteristic with his regular inspirational proverbs with a traditional discipline to them. Sad that he didn't get called a \"King\" when someone who only afterwards in the show arrived got to be called one.\\n\\n\r\nThe art totally makes the show cool, and the aesthetics are on the positive aspect of this show. The OP/ED sequences with the music, too, do justice for the show but no OST's or background musics or other character songs worthy to be talking about. But all in all they're on the better side of the show. The frequent use of English in the show, as for the club names and the outfits, really make them appealing to the western audience too.\\n\\n\r\nPrince of Stride: Alternative also suffers from the problem of not being able to convey the story properly in my opinion. It could've have become a good show even with the distinguishable flaws it had, if it had put more effort in giving the concept of Stride a little more spotlight. The sport is cool by all means, but for me it fails to properly deliver some important stuff to the viewer. For example, the tournaments the Stride Races take part in are a little difficult to understand. They do time-trials at times but nothing on the opposing team is showcased (And trust me there are some) on how they got so far. This is where as I said the time limit plays a huge part in. Stride races also offers a lot of cool moves and spectacular jumps, if they had put on something like additional points for that, then I think the games would've become a lot more enjoyable.\\n\\n\r\nPrince of Stride: Alternative was never a profound show to begin with, as is the case with most of the sport shows. But what make them great is the reality aspect and the execution for it, that's where Prince of Stride: Alternative won and lost 50-50 for me. With the pacing and time limit the show had been given, I could see the ending being like that from a mile away, still Prince of Stride: Alternative has the little charm that's the beauty of every sport show, even if it was a short anime with just twelve episodes. \\n",
            "date": "2016-03-22T11:28:00+00:00",
            "helpful_count": 50,
            "mal_id": 213607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=213607"
        },
        {
            "content": "Prince of Stride, a show based off of an otome game with a bit of sports and competition added in. Advertised as a sports series, yet it’s obvious that the show appeals to the female audience with its cast of pretty boys. What is striding? It’s basically a fictional extreme sport of running similar to that of parkour but with unique obstacles. \r\nProduced by Madhouse studio, the show runs pretty fast on its feet, literally. The first episodes introduces the main characters in standard fashion. Nana Sakurai, the main heroine transfers to Honen Academy and quickly becomes the manager of the Stride club, a clubdedicated to striding. The members of the group consists of a variety range of characters and personalities ranging from the cheerful Riku Yagami to the cool Takeru Fujiwara. Each member of the club also possesses individual skills and characteristics that makes them unique on the team. While this is all good and dandy, the show doesn’t capitalize on their traits but instead follows a generic route of competition. Yes, there’s risks and strategy that is adapted into each race. However, the ending result usually is predictable. And that’s honestly something that isn’t so admirable.\\n\\n\r\nThe story structure is designed as more carefree although striding is the main course of the plot. Other times, the show feels like it’s taking a breather such as fashion shoots, hot springs, and even the infamous beach episode. In general, the story turns into a mixed affair of comedy and competitiveness. If that makes any sense, the series also takes every advantage of the boys to make them stand out as bishounens. There’s nothing wrong with that except the show focuses perhaps a bit too much on it for the first half of the series. It takes the serious nature of the striding when the boys are presented more as fan service rather than athletes. On the other hand, the show does take its game mechanics seriously. Every relay race is designed aesthetically and never the same. In addition, the show adds commentary to explore the physical aspects of the obstacles, short-cuts, and potential strategies runners can use to their advantage.\\n\\n\r\nHowever, the story isn’t the main problem with the show. The main problem lies with the characters. It’s hard to feel attached to any of them. Takeru is like a Free clone of Haru but hardly has a strong relationship that can be relatable. Riku adds a bit more of casual atmosphere that people can get used to quickly but it’s hard to accept his character. He’s just too damn carefree. Heath Hasekura, the half-man, half-model is probably Mr. Fan service and there’s little depth about his character at all.  Finally, Hozumi Kohinata exposes almost all the weakness of the show with his non-existent characterization, girly face, and weakly timed jokes. Luckily, there’s some characterization and background storytelling through mid-story but the overall execution lacks steam. Don’t expect Honan Academy’s rivals to be memorable either. They have cliché written all over them with easily forgettable characteristics. \\n\\n\r\nIf you’re interested in some fun excitement, then Prince of Stride might be a show for you. While the storytelling and characters are easily forgettable, the relay races themselves lives up to the hype on most occasions. Stride is apparently a fictional sport so the rules and risks are a refreshment to any sports fan. It invites speculations on what strategies can work and what may fail. The risk is also realistic as well that includes near fatal injuries. Furthermore, the show does a clever job highlighting the body movements of the athletes. Each episode is choreographed consistently whether it’s jumping across shortcuts, bypassing obstacles, or just running against the wind.\\n\\n\r\nThe artwork is like colored rainbows. Bright and flashy are just few of many words that can describe the background visuals.  It also has a sense of flamboyant feel as each relay race has a different style unique to each competition. And of course, who can forget about the boys? They are the main stars not just for being athletes but an eye candy for the female audience to see.\\n\\n\r\nSoundtrack is surprising attractive with a good amount of psychology mixed in. There’s good timing during crucial points of each relay race to capture the thrill of competition. It’s also creative enough to be legitmently entertaining to the ears. Character voice mannerism is moderate although I personally find them lacking with the exception of Riku. Meanwhile, the OP and ED theme songs are rather mediocre in respect.\\n\r\nIn essence, Prince of Stride is more of a show that seems to appeal to a certain demographic and advertised for the audience to play the game. It isn’t an entirely awful show despite the lackluster story or mild characterization. Rather, it doesn’t deliver with the premise and each episode seems to lack more and more steam as time drags on. I find it hard to also get attached to many of the characters and in the end didn’t really find liking any of them. Blurring the lines of fictional sport and modern man service, this is a show that easily feels like an advertisement.\\n",
            "date": "2016-03-22T07:58:00+00:00",
            "helpful_count": 38,
            "mal_id": 213596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=213596"
        },
        {
            "content": "Introducing Stride: an extreme high-thrilled sport where parkour and endurance running collide together! \r\nThe rules of Stride are really simple: you form a team of six people and you compete against one other team. Five of you run across the race course as a relay, avoiding obstacles, and staying on track. The fastest team who crosses the finish line first wins. \r\nIt’s definitely a very interesting concept straight from the get-go. So why can’t I rank this show any higher?\r\nWell, for one, whenever you introduce a sport, it is imperative to consider your audience: they have no clue what the sport is about or nevereven heard of anything like it before. Furthermore, sports often incorporate a lot of new terminology that can lose the audience quickly. As a result, the screenwriters must absolutely take the time to explain these terms well.\\n\\n\r\nThis is where Prince of Stride begins to crack. In the first few episodes, terms such as “relationer” will be thrown at you and leave you second-guessing until you actually see it in action. Techniques associated with parkour or the relationing process itself, too, are never properly explained. And, most importantly, the rules of Stride are very open, and this is a recipe for disaster. For instance, shortcuts – what exactly constitutes an acceptable shortcut? Couldn’t you technically just “shortcut” an entire leg? Since this rule and others like it are never thoroughly explained, viewers who are making an attempt to understand what is happening are more than often left hanging and utterly confused. And mind you that this is just one rule  – there are plenty of others that don't make any sense either.\\n\\n\r\nThe other issue is the characters themselves. As you probably know, Prince of Stride centers on the members of the Honan Stride team. The characters on this team had serious potential but were never given ample time on the show to have enough depth. Some characters were given no time at all and honestly were not a significant factor in the show (e.g. Hozumi). They could have been left out from the story and the plot of the entire show would not have changed much (minus the fact that you would have an incomplete team, oops). Others are what I like to call half-baked: some characterization but somewhat forced. A good example of this is Nana. Nana’s true colors begin to show when her father shows up back in Japan, but since her father was never mentioned up to this point, it seems as if his entire purpose was to elicit some emotional response from her. Thus, her actions and thoughts come off as a little unbelievable. I would argue that the only decent characterization was of Riku (see episode 11), since we later learn that he uses Stride as a way to dissociate his own identity from his more talented brother’s.\\n\\n\r\nAs for the plot, there isn’t really anything remarkable about it. As with all other sports anime, Prince of Stride: Alternative tries to balance Honan’s training and the tournaments that they participate in. In the first half of the show, there is more training and other trivial things that they do (e.g. obtain a sponsor) than there are actual tournaments, and some of these training sessions do not produce anything fruitful other than heightened, excited emotions. Towards the end of the show, however, the plot finally gets somewhere when the Honan team comes face-to-face against two of their toughest, most challenging rival teams during the End of Summer semi-finals and finals.\\n\\n\r\nFor the art, let’s just say it’s different. The color palette that Madhouse chose to use in this show often comes off as overly bright or pale. It’s not oversaturated as in the colors of No Game No Life but will take some time to adjust to. Despite this, the animation and artwork is very consistent. Sound and voice acting are also of high quality, albeit none of it really stood out.\\n\\n\r\nSo, just to summarize, I wouldn’t say that this is one of the better sports anime out there. Its premise had a lot of potential but unfortunately the plot does not build off from it at all. If you’re looking for a more balanced story or characters with more depth, you won’t find them here. I felt like too often this show came off as a little dry since nothing is really explored well, and it’s likely that you will think this way too.\\n\\n\r\nOverall rating: C\\n\\n\r\nAuthor's Disclaimer: Please remember, this is my own personal opinion. I critique anime primarily on how the story is executed and how well-rounded the characters are. This review is not meant to target any other review but was intended to provide a more holistic analysis. \\n\\n\r\nIt should also be noted that this is a full-fledged review of the entire season.\\n",
            "date": "2016-03-22T09:45:00+00:00",
            "helpful_count": 30,
            "mal_id": 213602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=213602"
        },
        {
            "content": "I see a lot of different reviews for this anime these couple of days, so I thought it would be a nice chance to write my first review on an anime I finished just yesterday. \r\nPrince of Stride is a sports anime based on an otome game, which I can pretty much sum up with just one word: Mediocre.\r\nStory: 4/10\r\nThe first couple of episodes are quite interesting, as they introduce us to the characters and the sport, ''Stride'', which can be described as a running race with parkour between two teams,  each with five runners and a relationer. That's all, nothing else is everexplained, there is not as mush emphasis on techniques as there should be in a sports anime, no descriptions during the matches, nothing. Instead, they decide to emphasize on how they put their souls into Stride and how they are giving and receiving each other's feelings through theirs relations on every episode. Ok, it was cute at first, but it ended up tiring and without any real depth. Apart from the striding moments, we can also see just a few of the backstories of the characters, most of them being pathetic (example: the Kuga incident), with only Riku's being just quite decent.\\n\\n\r\nCharacters: 3/10\\n\r\nThis is, in my opinion, the worst part of the show: the characters. So many uninteresting, cliché characters without depth to choose from, all of them being mostly useful only as fanservice material. As hard as I tried, I couldn't get attached to any of the characters, that's why all this ''convey our feelings through Stride'' thing didn't even move me a bit. We didn't get to see many interactions between them, they were mostly just running or goofing around, that's why all those feelings of theirs seem paper thin. The only character they bothered to give a little character development to and show us more of his thoughts is Riku, but what happened was pretty predictable and not very interesting. \\n\r\nAs for their opponents, they only manage to be forgetable fanservice.\\n\\n\r\nArt: 7/10\\n\r\nThis is what made me watch this show and the only thing about Prince of Stirde that I believe to be above average.  The animation is pretty good, especially when it comes to a Stride match. \\n\\n\r\nSound: 5/10\\n\r\nNot much to say here, mediocre OP and ED, and the background music for the Stride matches becomes tiring and boring without any impact after a while.\\n\\n\r\nEnjoyment: 4/10\\n\r\nApart from the not really good story and characters, I actually found this show a little enjoyable during the races, where I can say there was at least a little tension. It was easy to watch, despite its flaws.\\n\\n\r\nOverall: 4/10\\n\r\nAs a conclusion, what Prince of Stride had to offer was pretty boys running around and a little bit of bad drama. This could have been a good anime, if they added more depth to the characters and had more sports elements, but they probably decided to make it like this, which makes it just an advertising material for the game and nothing more. You might still enjoy this anime if you like sports or just pretty boys.",
            "date": "2016-03-23T05:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 213686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=213686"
        },
        {
            "content": "Prince of Stride is by no means a masterpiece. It is a light-hearted sports series centred around the world of Stride, a fictional parkour/relay race. While Stride is somewhat different to those common sports seen within the genre, it still fits the mould expected. So what does PoS have to offer?\r\nThe story centers around the Honan Academy Stride team, a once elite stride team, which has dwindled after an incident two years prior. Two first years join the team, expecting to find a thriving Stride team, however they are shocked to find the club only has three members. The basis of the story isn't groundbreakingor revolutionary, but it is a solid, well-crafted plot which is really enhanced by the sport of Stride. What Stride does well however, is create realistic connections between the main cast. Stride definitely isn't a character driven show, hell, most of the side characters aren't memorable, but it's these relationships within the main cast which makes the drive of these characters powerful. \\n\\n\r\nThe art of this show is beautiful and it is really one of the highlights. The world of stride, especially in competition, is bright and colourful, which really fits the atmosphere of the show.  The character designs, even for one-off rivals, is unique for every character. The action sequences are high quality and one of the best things of Stride. Watching the characters play Stride is nail biting and entertaining, but predictable. \\n\\n\r\nMy biggest gripe with this show is the ending (no spoilers ahead). It's abrupt and sudden, which bothers me. It doesn't tie up any loose ends or provide any closure. It's an ending that makes sense, but it could have been so much better. \\n\\n\r\nCharacter development is there, but not significantly. There isn't enough time to fully explore all of the main cast within the twelve episodes given. It is based off a Otome Game, which I have heard does explore the main cast and even the side characters thoroughly. However it's impossible to condense 60+ hours of gameplay into twelve 20 minute episodes. \\n\\n\r\nJust to reinstate, Prince of Stride is no means a masterpiece, nor is it a revolutionary series. But, it IS a fun series. I binge watched it all in a day. It had me so hooked I couldn't stop watching it. It follows all the same tropes you would expect out of a sports anime, but it follows them well. If you enjoy sports series in general, you will enjoy Prince of Stride.",
            "date": "2016-12-11T17:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 235289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113699.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/simsimsucks",
                "username": "simsimsucks"
            },
            "url": "https://myanimelist.net/reviews.php?id=235289"
        },
        {
            "content": "Prince of Stride builds upon the fundamentals of sports anime and brings a more dramatic and innovative approach to the genre. Prince of Stride is revolutionary in a lot of ways and I feel it can convert many who don't watch sports anime to give it a try. SPOILER \"FREE!\" (it's a free anime joke)\r\nStory:10\r\nThis show goes above and beyond what it would have to do to deserve a great rating for its story. Everyone has a unique story that is connected to at least three other people in the main group of the stride runners. There's not really any backpedaling with flashbacks so it'svery fluid. All the main stories are pretty interesting however a lot of them don't gain momentum until towards the end of the show so hold out if you feel a lack of story in the beginning. While it doesn't come off as one originally, Prince of Stride has great comedic elements that made me KEK so KEKING hard that I KEK'd until my sides hurt.\\n\\n\\n\\n\r\nArt:10\\n\r\nIf you've seen any clips from the show or maybe the PV's you'll know what I mean when I say this show is vibrant and beautiful. The color scheme is very pleasant and the animations are smooth throughout the entire show. Not much else to say in this area.\\n\\n\\n\\n\r\nSound:10\\n\r\nI'm not an expert on what makes a soundtrack great but the songs were catchy and did a great job of expressing the themes that weren't visible.\\n\\n\\n\\n\r\nCharacter: \\n\r\nAll of the characters are pretty interesting in their own ways. The show doesn't feel like it has a lot of forced emotions and the characters stay true to themselves throughout. There's a lot to say but it would spoil the show and I want to make sure this remains spoiler free.\\n\\n\\n\r\nPros and cons:\\n\r\nPros\\n\r\n-No fanservice\\n\r\n-Great OSTs\\n\r\n-The fucking KEKs\\n\\n\r\nCons\\n\r\n-No second season\\n\\n\\n\\n",
            "date": "2016-05-06T21:00:00+00:00",
            "helpful_count": 10,
            "mal_id": 218054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5306495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BGdealer",
                "username": "BGdealer"
            },
            "url": "https://myanimelist.net/reviews.php?id=218054"
        },
        {
            "content": "In one paragraph: It was interesting, had some really golden jokes and even the minor characters had personalities. However, there are a lot of plot holes, they skip a lot of the parts that would be interesting to see and the problems they face have a tendency to be really stupid. They don't really get to any solutions, and there was only one time when we actually saw how they trained. All in all, it's not bad. Continue reading for more details.\r\nStory (6): The story begins, like many other sports related anime, with a character introducing themself and explaining that they went to this particularschool because of their team in a certain sport. Turns out that this team has been facing difficulties, and they would have to find more members to get the club working again. The first episodes are really slow and steady, you get the information you need, though probably not all the information you want. Later, the time skips start, so you go from one Stride match to another with a small training segment in between (the training is usually along the lines of running a little and jumping over some stuff and suddenly improving a lot). There are always a lot of details lacking, which I guess can't be helped when every second episode is an actual match, and there are still episodes that seem to serve no purpose to develop the plot at all. When it actually gets down to it, the scenes that are included are really good, and considering the fact that it's from a game, you can't really expect too much thought into backstory and such, since it's literally based on just the running part. The sport itself is really interesting, basically a baton style race one a track with lots of obstacles, bringing in acrobatics as a theme. \\n\\n\r\nArt (7): The art is actually very nice, it's a clean style with no obvious flaws. All the characters look very distinct, with individual eye shapes, noses and body types. It's very detailed in that sense. The way the clothes are drawn on the characters sometimes looks slightly off, though. The backgrounds are slightly over the top sometimes. It catches the feel of the situation, but the colors have a tendency to be extremely bright. Most backgrounds are repetitive, with some exceptions. There are also a lot of sceneries in this show that look absolutely stunning.\\n\\n\r\nSound (7): The opening and ending themes really fit the show, it's particularly cool that they use the idol group from the show to create a theme. The soundtracks in the show are really good, I don't know what their names are so I'll describe them like the sound, the light sparkly tone is really... Light and sparkly, which makes it perfect for those tensionless middle scenes. The \"end of summer\" track is really upbeat and tells you something is about to go down... That is, if the scene on the screen wasn't enough.\\n\\n\r\nCharacters (8): The characters are all very individual, they all have their own respective facial traits and body types. All the characters also have their own personalities, and rather than the standard \"everyone is super friends with everyone\" kind of style, there is a very realistic parting in who gets best along with who. The characters also have roles in the story that makes them important, which isn't seen way too often. Of course, it doesn't get a perfect score, mostly because all the characters seem to suffer from being way too emotional about things, to the point where it doesn't make sense. The comic relief characters also get annoying after a while.\\n\\n\r\nEnjoyment (7): It's a really light watch, since it doesn't dig into the past of the characters and the story behind what is happening a lot. It focuses solely on the sport itself, and you won't see any of the problems outside of it. Except for one single character in the main characters' class, there is not a single person not related to Stride that we see more than once. This is probably a great \"middle ground\" anime, a perfect next step after finishing something that leaves you empty, wondering what you'll do with your life from now.\\n\\n\r\nOverall (7): I personally really like this anime, since it does have a line going through the scenes, even though there are some huge time skips here and there. It definitely kept me from not being bored, so it served it's purpose. The best way to explain it is \"interesting enough.\"",
            "date": "2016-03-23T10:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 213698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/703535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SnowSketch",
                "username": "SnowSketch"
            },
            "url": "https://myanimelist.net/reviews.php?id=213698"
        },
        {
            "content": "*Review may contain minor spoilers*\r\nStory 4/10\r\nA young prodigy joins the Stride school club to re-obtain its old glory.\r\nFrom here on out they will do training and a few ''matches''\r\nArt 7/10\r\nThe art is a little bit on the ''smoother'' style, it is not my cup of tea but it isn't bad either. it stayed consistent throughout the whole anime. There was nothing out of the ordinary or ''unique'' hence only a 7.\r\nSound 5/10\r\nthe voice actors weren't to bad, but they definitely could have done a better job throughout the races and duels they did, I didn't get that exiting feel at the star of a raceetc.\\n\\n\r\nCharacter 3/10\\n\r\nall the characters do have a small story line around them, but you definitely can't feel the bond they are trying to give them together.\\n\\n\r\nEnjoyment 2/10\\n\r\nAs a fan of sport anime, it hurts me to watch this, you do not feel the bond between the team mates, the concept of stride is quite cool, but poorly animated, it doesn't feel as epic as it should feel.\\n\\n\r\nOverall 4/10\\n\r\nI would say give a pass on this one.",
            "date": "2017-09-23T00:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 258340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PvMDream",
                "username": "PvMDream"
            },
            "url": "https://myanimelist.net/reviews.php?id=258340"
        },
        {
            "content": "ALERT! Look up the rules of Stride (the fictional sport in this anime) before you watch this because, otherwise, you're gonna be confused for like the first two episodes.\r\nWell, this is yet another sports anime to add to my list. Can you name a few sports anime? Haikyuu!!, Free!, Kuroko no Basket? Well, have I got good news for you! Nearly ALL of the seiyuus in Prince of Stride: Alternative have been in at least one of those aforementioned sport anime staples.\r\nAlso, the ONLY reason that this anime isn't ranked as a 10 is because the storytelling was bit shoddy and the art made everythinglook super washed out. The story itself was fantastic. I love the elements that were a part of it, such as: Riku and Takeru's backstory, Riku's issues with his brother, and the history of the Honan Stride Club. However, the anime didn't give these plot elements enough time to grow. Had the season been 25 episodes long instead of 12, it would've been nice because those things could've been elaborated on more. As it stands, you kind of get told something through a couple lines of dialogue without dwelling on it. So, the story kind of expects you to fill in the blanks of your emotions when it should be giving you those emotions. Make sense?\\n\\n\r\nThat being said, I actually did get a little teary eyed at the end. This brings me into the characters. I absolutely loved them. Not only do I love the familiarity of the seiyuus, but I love the relationships the characters have with each other. Again, I wish they could've been dwelled on a bit more because there were some really beautiful moments in this anime. It would've been heightened had the anime taken the time to develop the individual characters and their relationships to everyone before trying to shove in a meaningful scene. I did still cry though. So, it wasn't a total failure on their part. Just putting that out there.\\n\\n\r\nThe music was simultaneously emotional and badass. The music that plays when the characters are running is either something that's jammin' and that gets me hyped, or it's this one song that conveys all of this emotion that these characters are feeling. Both are really good, so I'm very happy with the music in this anime. I don't usually talk about music in anime, so that tells you something. \\n\\n\r\nThis anime doesn't deserve the flak it gets at all. Like, yeah, it should've been stretched out and the story and characters should've developed more smoothly instead of like \"BAM, take this thing we didn't explain properly before this!\" But at the same time, I had such a good time watching Prince of Stride: Alternative. If I'd trusted some of the more negative reviews on here, I would've missed out on a really good time. If you're super picky about a streamlined story, then don't bother, but if you just want to kick back with some funny characters and have a bit of a cry, then this anime is amazing! As far as pure enjoyment goes, this gets a 10/10, hands down. \\n\\n\r\nI actually really wish that this anime finds itself in another season. If they slow down the story pacing, I think these characters and this world has a lot of potential. Give this anime a go because it's honestly really awesome.",
            "date": "2018-12-18T22:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 296122,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=296122"
        },
        {
            "content": "Story/Plot:\r\n7/10\r\nThe story is nothing special at all. Typical sports anime. It kept my attention for the most part, so I'll give it credit for that. I felt that it was kind of messy. It was just a little all over the place. Watch it and you'll know what I mean. It was cute. I LOVED the parkour/freerunning moves. That's what made the anime so enjoyable for me. \r\nArt/Sound:\r\n4/10\r\nOne of the worst things. The art was beautiful, but I hated how they made the hair translucent. It annoyed the living crap out of me. I HATED how they played the same damn song throughout all theraces. After they clapped their teammates hand, they played that annoying ass song. Over and over. Dub voices are awesome and so are the sub.\\n\\n\r\nCharacters:\\n\r\n5/10\\n\r\nNothing special about them. Your typical characters. I hated Nana. Annoying female character per-usual. She was so....fucking....useless. She had no personality whatsoever. She kept doubting herself constantly. Just.....ugh. The characters weren't all bad. There no development.  \\n\\n\r\nOverall:\\n\r\n7/10\\n\r\nI think it's a nice watch. If you're bored. Only reason why it's getting a 7 is because of the awesome parkour which is super original. For a 12 episode anime, it's not too shabby.",
            "date": "2016-04-02T19:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 215266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5041143.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nalexie_",
                "username": "Nalexie_"
            },
            "url": "https://myanimelist.net/reviews.php?id=215266"
        },
        {
            "content": "Nana Sakurai is a first-year student at Honan Academy. She decides to attend the school in hopes of managing the Stride Club. Stride is an extreme sport involving running and navigating obstacles on an uneven course. Nana meets two boys named Takeru Fujiwara and Riku Yagami and convinces them to join the club in efforts to compete in the \"End of Summer\" tournament. Together, they learn that Stride is about so much more than just running; it's about connecting with each other. \r\n...Or so Madhouse would have me believe! \r\nAs someone who has willingly jumped into [and stayed in] sports anime hell over the pastyear or so, I'd like to think I'm fairly experienced in critiquing sports anime. I've seen all kinds of tropes, some good and some bad, but through it all, I believe the there are a few things all sports anime try to achieve. Whether a sports anime's characters have hyperbolic, unrealistic personalities or are more well-rounded, whether the sports skills resemble stunts you'd see at Hogwarts or actually seem humanly possible, all sports anime have two common goals in my opinion. The first is to teach viewers about the particular sport in question. And the second is to show how the sport in question changes its characters, typically for the better. \\n\\n\r\nPrince of Stride fails to achieve either of these goals.\\n\\n\r\nStride is never really explained well. We get it, there's running. But why all the tricks and acrobatics? Can you get extra points for jumping all over the place, or are those tricks simply to get fans screaming? And if the latter is true, then why don't acrobatic tricks affect a team's final score? Because they should! In addition, the main characters are never shown to really improve. Aside from Yagami changing his posture, none of the characters evolve in their sport. \\n\\n\r\nNearly all of the main characters are flat; they embody one-dimensional stereotypes. Yagami is the angsty teenager going through an emo phase. Takeru is the Furuya of PoS; he's good at everything just because, and he doesn't know how to communicate. Sakurai is in the anime simply as a formality, since the anime was adapted from a video game. Kominato and Kadowaki are the comic relief, Heath is the reliable senpai hunk, and Kuga is the strong, silent weirdo who likes to stare at the sky and won't shut the fuck up about the wind. None of these characters have depth, aside from maybe Yagami, if you're willing to qualify his struggles as \"depth.\" \\n\\n\r\nMultiple episodes repeatedly emphasize Yagami's inferiority complex, but each episode \"resolves\" his issues by the end with no believable sequence of events. Prince of Stride attempts to convince us that Yagami truly loves running deep down, but despite it TELLING us that, it SHOWS us a very different message. Yagami seems to hate Stride. He hates his brother, he hates running, and he hates Takeru. But somehow, every episode ends up with him smiling into the sunset, only for him to repeat the same angsty routine in the next episode. \\n\\n\r\nSo here's the problem: Without dynamic, developing characters, and without even a proper education on Stride, what's left in this anime? All that's left are ridiculous amounts of drama, cheap tricks, filler episodes, training montages, the same stupid insert song, and characters on the sidelines yelling \"HASHIRE!!!\" at the top of their lungs. And oh, so much drama. All of which lead up to a finale that frankly, these characters didn't earn. Unfortunately, none of those things is enough to make an anime compelling. There are many scenes that attempt to hype up the audience, and they do succeed at first. However, those scenes get old without any connection to the characters, and the anime very quickly becomes stale. \\n\\n\r\nThe art of Prince of Stride is a little jarring, mostly because of the weird color scheme. The shading and coloring of the anime definitely didn't help promote a \"real\" feeling to the show. It could have been a strong point, had the plot and characters been up to par. Similarly, the music for this anime was pretty good, but it didn't have nearly the impact it could have because of the plot and characters. What's more, many victory scenes used the same annoying insert song until, again, the effect was lost and the song became an annoyance. \\n\\n\r\nI have always thought very highly of Madhouse, but they kind of missed the mark with this anime. Between the bad character development, misplaced music, and lack of proper exposition, a lot went wrong. I love to joke about being stuck in sports anime hell, but watching this anime was actual hell.",
            "date": "2016-03-22T14:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 213633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969759.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/psychoalchemist",
                "username": "psychoalchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=213633"
        },
        {
            "content": "I watched this anime series because of Madhouse animating it and that it is based on an otome game, a genre I'm obsessed. But rather I got a lackluster character art, mediocre OP and ED, and did not see romance between the female lead and the other guys.\r\nIt should be stated that being based on a BL (Boy's Love) game is more appropriate for this anime since the only romantic development in this anime where between the guys. The touching of hands were rather dramatic since it is the theme of the show.\r\nStory:\r\nIf you watched Yowamushi Pedal, the story is like that, wherein the clubcompete on tournaments and beat schools. It is very straightforward. There's also the issue of a backstory between the main leads that came out of nowhere.\\n\\n\r\nCharacter:\\n\\n\r\nThough I did like the comedy of the show and the antics. The characters are flat though and their opponents beside Gal-Stan and Kakyoin are so flat since they weren't explored properly.\\n\\n\r\nMusic:\\n\\n\r\nThe OP was upbeat but it wasn't my type. I really couldn't remember the ED.\\n\\n\r\nArt:\\n\\n\r\nI had high expectations since watching Death Note and Chihayafuru that I will get atleast a artistic anime, but what I got were characters who put too much powder in their faces. The character art was so poor but the background and how they executed the stride animations were spectacular though.\\n\\n\r\nOverall, I did enjoy the anime because it was fun and I like sports anime.",
            "date": "2016-03-24T00:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 213770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3825147.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NoonebutMark",
                "username": "NoonebutMark"
            },
            "url": "https://myanimelist.net/reviews.php?id=213770"
        },
        {
            "content": "What is stride ? Stride is a running sports with parkour. yea... they are running while doing some parkour stuff. tbh, personally, i like the concept of the sports, and even running is one of my fav sports. that is the reason why i got interested in this anime. \r\nFor the first episode, first impression, to me, it was a really cool, awsome episode. i really really like the way they start the series. looks awsome and cool to me, and i thought it would become a great series, but......a little bit dissapointment to me. \r\nA story about a guy who in the past hasquit playing stride because of his brother, but now, in highschool, a girl and a boy invite him or more like force him to join a certain stride club without knowing the fact that he has already quit playing stride. \\n\r\nAnd that where everything began. but it was a little bit dissapoint me. \\n\\n\r\nWhy? \\n\\n\r\nbecause this show is focused more on the character problems and development more than the action on the sports. and the result; they didn't put much action in the final episode, final race, and that one kinda dissapoint me because i was looking foward to the action. i didn't mean to say the character development and the problems is bad, i like some of them, and some of them i think it was okay to me, but i don't like the fact that they focused more on the character rather than the action. it wasn't balincing in my opinion. AND! the race was too predictable to quess who will win. in sports, that supprosed to be the main problem, the author musn't let any viewer predict or know who will win. because that will the climax. it is pointless if the viewer already know who will win. it's not like i don't like it, it's just okay to me. i just want to say it's a shame, a great looking sports like that is too obvious to see who will win. Basically it lacks of impact. \\n\\n\r\nFrom the character, they really did a good job in my opinion. they really put their effort to executed the development, problem and conclusion even tho i found their relationship a little bit weird. to me, it wasn't really bother my enjoyment. to me the pacing was okay. i don't see anything wrong nor even bother my enjoyment. just the fact that this show is lack of action is dissapoint me. \\n\\n\r\nThe soundtrack was pretty good overall, especially the OP. really like the op. but the ED..... i wish i will never heard it again. well this anime is originally for girls, so obvious some of the song will be something like that. i can't blame the director but still for me, i don't like the ED song at all. \\n\\n\r\nOn the other side, good animation for a sports anime. really fit well, especially the soundtrack they used for the action, really good imo. but there is one thing that really pissed me off. some of the character design almost look like a girl and that really pissed me off for some reason. why ? because i almost turn into a gay for a second. it was really a shame, a beautifull character design, the truth is, he is a guy. i really hate that tbh. like i wish that guy is a girl so i can put her in my fav list XD but well, whatever. i don't give a fuck with it anymore XD \\n\\n\r\nOverall, not really enjoy it that much but i still enjoy it. i mean i enjoy it but not really 100% enjoy it. well, like i said, i didn't enjoy it because lack of action. i don't really like the fact that they focused more on the relationship rather than the action. dissapoint me a little bit. so i'm gonna give it a 7/10. probably never watch it again, BUT! i wouldn't mind a second season. at least more action. \\n\\n\r\nI don't know if what your taste is, but if you like sports, try 1 or 2 episode of this series, the sports is really great imo, but it just didn't have that many action, and it was kinda predictable. \\n\\n\r\nSorry for bad english.\\n\r\nHope my review can be helpful to you all. \\n\r\nThanks. Have a nice day \\n",
            "date": "2016-03-24T05:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 213790,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=213790"
        },
        {
            "content": "ummmm lets start with a talk about this sport called S-T-R-I-D-E\r\nSo basically its relay running with parkour, the name is pretty dank tbh, like striding sounds so fuken badass and real I thought it was a real sport and i think it fits really well\r\nThis sport all about the pace,parkour skills and most important of all \"connecting emotions\", pretty funny concept gotta say, but why nut? connect emotions = good at stride\r\nlets continue with the norms\r\nStory 7/10: Win this summer tournament called \"end of summer(EOS)\", simple story, not much to say\r\nArt 8/10: Coooooooool,siiiiiiiiiiiiiiiick, badddddassssssss, Madhouse(the studio), their overall art are always to the coolside ofthings, colours are to the brighter side of things, when madhouse generally has colours to the dark side of things\\n\\n\r\nSound 8/10: OP- dank, OST-feels, ED-it was ok(somehow made it into top10 ed for anime trending) VA wise, they all fit their character, Kuga-senpais voice is badass, Riku's brothers voice is gay asf, pretty sure he is gay aswell\\n\\n\r\nCharacter 8/10: I will comment on  a few characters because there are so many characters, you could say all of them are MC's\\n\\n\r\nFujiwara Takeru(Honan Runner)-Loves the legs, loves his protein, probably the most funniest character in the whole series, he is the most serious person about stride, but he is like dense and does somereally funny stuff\\n\\n\r\nYagami Riku(Honan Runner)-pretty badass,dyed his hair blonde,he is probably the major MC, towards the end of the anime, its all about how he overcomes his feelings towards his older brother\\n\\n\r\nSakurai Nana(Honan Relationer)-gotta say pretty impressed how she can connect emotions through a mic, probably the most normal character, nothing special about her\\n\\n\r\nKuga Kyousuke(Honan Runner)-the man, my favourite character, manly voice, and talks about the \"wind\" all the time, so cooooool\\n\\n\r\nDan(coach)-has some sick one liners(idk what they called, quotes maybe? like a few words, but has a deeper/bigger meaning to it), very funny character aswell\\n\\n\r\nSuwa reiji(saisei captain)-hes pretty gay, the typical very feminine guy character that is really nice to everyone\\n\\n\r\nShizuma Mayuzumi-(saisei relationer)- Reiji's waifu, if not 11/10 waifu material, definitely most feminine character, long pink hair, cooks, cleans etc\\n\\n\r\nEveryone above is a male excpet Sakurai Nana\\n\\n\r\nwhen i say \"gay\" i mean it literally\\n\\n\r\nEnjoyment 8/10: watching people connect emotion is SOOOOOOO fun (being sarcastic here), I guess its like watching sport, I spend 8 hours a day watching cricket so watching 20 min of striding is pretty good\\n\\n\r\noverall 8/10: Everything is done pretty well, just the normal sports anime, the anime is pretty predictable towards the end, its probably because its a adaption from a visual novel, if you like sports anime, then its definitely good for you, if not, go watch boku dake ga inai machi, you definitely  wont hate it :)",
            "date": "2016-04-01T19:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 215108,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5034187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mejo369",
                "username": "mejo369"
            },
            "url": "https://myanimelist.net/reviews.php?id=215108"
        },
        {
            "content": "I got baited. Hard.\r\nWith the sports anime craze that others and I were in from Haiykuu and Kuroko, I was pretty damn excited to learn of one that focused on parkour/free-running.\r\nThen I had my hopes dashed as I watched on.\r\nThis is a shitty version of Free, plus I'm not the target audience for this show.\r\nI could see the intended appeals of the show, but Free does it way better.\r\nWhat I could not see was the free-running or parkour, which was the sport!\r\nWe had shots of shadows running in the background, or unimpressive vaults that I've done on the regular. Being someone into free-running, you'd thinkthey would try and appeal to that audience.\\n\\n\r\nI could understand the reason of the episode where they needed sponsors for their team, but that meant watching them play cross-dressing dress-up for it.\\n\\n\r\nGo watch Free for the appeal, or watch Kuroko/Haiykuu for the sport.",
            "date": "2016-07-03T21:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 223038,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5091665.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ChoocoboYao",
                "username": "ChoocoboYao"
            },
            "url": "https://myanimelist.net/reviews.php?id=223038"
        },
        {
            "content": "There was not enough story development in my opinion and I feel like the creators of this anime had so much potential to work with but they either had too little funding or were too lazy and tried to make it as short as possible. Sports anime are not meant to have only 12 episodes and you can clearly see why, since the creators did not allow us enough time to warm up and get to know the characters and the story. I feel like the creators rushed the story line because they were like shoving plot after plot up our throats and not evenletting us digest it. Overall I think this was the worse sports anime I've ever seen.",
            "date": "2016-06-26T11:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 222049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5405335.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yukinokitsune123",
                "username": "yukinokitsune123"
            },
            "url": "https://myanimelist.net/reviews.php?id=222049"
        },
        {
            "content": "This review contains minor spoilers.\r\nAfter watching \"Haikyuu!!\" I became so hyped up about sports series that I decided to try \"Prince of Stride: Alternative\". I can't say I'm disappointed, but compared to aforementioned \"Haikyuu!!\", \"Prince of Stride: Alternative\" looks bland and, on the whole - average.\r\nThe story is as generic as it could get. It revolves around the new extreme sport called \"Stride\" which is similiar to parkour. \"Stride\", however, is not new, neither it is extreme. Sadly, the runners just run, sometimes they jump over some obstacles and somehow, this attracts large crowds and makes runs a big city event.\r\nAs with all school clubsin anime there is a girl, and a boy and another boy who have always dreamt of running in \"Stride\". They join the \"Stride\" schoolclub which, obviously, is running out of members and our protagonists miraculously save the club. Then, all of them are training and running. Also, in each episode there's someone talking about how \"Stride\" connects people with a mandatory, super-cringeworthy shot of high-five of the runners in the background. And that's pretty much the story, or what supposed to be the story. Very predictable and unoriginal.\\n\\n\r\nThe art is mediocre. It has its ups and downs but there's nothing particular in it. The characters' faces seem really weird as they look like they have different shapes in different shots, but overall the characters are nicely drawn. Run sequences are fairly well animated, although there is too little running and too much thinking-while-running shots.\\n\\n\r\nThere's also nothing particular in sound. During the run sequences there's always some music but in my opinion it is there only because it would be awkward to listen to the boys' gasps for a few minutes.\\n\\n\r\nWhen it comes to characters, there's absolutely nothing original in them. There's the female protagonist, who is there only to be a narrator and has no personality whatsoever, then there's the overly enthusiastic guy, the manly guy, Haru from \"Free!\" and even Sephiroth from FF7 - pretty much the characters we've all already seen elsewhere. Each character is pretty much one dimensonial and is involved in some backstory which is absolutely forgettable and is meant to add depth to the characters but unfortunately fails to do so. On the other hand, some of them are sometimes funny.\\n\\n\r\nHaving completed the whole series, I can say I generally enjoyed it despite its flaws. There definitely are better sports series, but also there are definitely worse sports series. \"Prince of Stride: Alternative\" is by no means a masterpiece, but it's not a bad show either. This anime just doesn't shine in any way. If you have some free time, give it a go. Don't expect too much, though.\\n\\n\r\n(This is my first review and I'm not native English speaker so there probably are lots of mistakes, so sorry for that.)\\n",
            "date": "2016-03-25T05:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 214014,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3382885.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/kopczix",
                "username": "kopczix"
            },
            "url": "https://myanimelist.net/reviews.php?id=214014"
        },
        {
            "content": "Now the story is nothing special. It’s basically Yagami Riku and his fellow classmates re-establish the school's \"Stride\" team and compete in Stride competitions. I got really hyped especially when reaching the end of each race. I would've liked the series more if they did more with Nana Sakurai because I felt she was one of the best character, also I think they should've done a little more with Yujiro because he didn't really do much in the series  Overall, it is definitely a fun watch if you are really into sports theme animes. It has lovable characters and has awesome action moments. Butif you’re looking for an anime that has an in-depth story, this is not the anime for you. \\n\\n\r\nThere is also a video Review on my channel if you wish to check out on The Georges \\n\r\nhttps://www.youtube.com/watch?v=qtdYLd1pSXM\\n",
            "date": "2016-03-28T13:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 214569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1455365.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Phantomturtle",
                "username": "Phantomturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=214569"
        }
    ],
    [
        {
            "content": "Initially, I started watching because I liked the sleek and colorful aesthetic, and the idea of parkour races sounded cool. I like the first few episodes and thought the races were exciting and nice to look at, with a killer soundtrack. Upon watching the next episodes up the the sixth that has aired I've lost interest, with a super melodramatic plot that makes zero sense, backed up with paper thin characters.\r\nThe sport itself does not even take the least amount of effort to make any sense. It is a race based on speed, but people waste time doing flashy parkour moves. Would it not havemade sense to give credit for style points if it is an integral part of the sport? They could have added in a number of explanations for the sport to make it a little more plausible, but there was none. \\n\\n\r\nSpeaking of implausibility, there is the plot. It's full of melodrama with the characters over reacting to everything like their life depends on it in stand anime fare. The backstory of the stride club and the reasons surrounding people's reluctance to join is completely laughable. It is the standard annoying anime logic sort of thing where the good guys get bad press in the eyes of the public, but really they didn't do anything wrong. Such bad press could be avoided by reasonably explaining the situation, but common sense does not exist here. All this serves as set up for the scenes with cheesy inspirational music, inspiring speeches and some nonsense about \"connecting emotions\" as the stride club works to redeem itself.\\n\\n\r\nThe characters are all one note which makes the dramatic plot points even more lame. It is fine when all they are doing is racing and having fun, but they do not go together with a plot that asks me to sympathize with them. They are also all pretty boys making some of them look downright goofy because of how out of place they are on the stride courses instead of posing for magazines. There is some of that as well; a boy band concert, photo shoots and such show up to appease the fujoshits. \\n\\n\r\nVisuals: The reason I started watching this in the first place. Unfortunately, you do not get to see as much running as bobbing torso. Not that much of the running gets animated. It was most apparent to me when a big, surprising parkour move was performed, and we don't get to see any of it. It is all conveyed by implication. \\n\\n\r\nOne aspect I did enjoy was the soundtrack. It got me pumped up for the races and fit well with the artstyle. I'll be looking forward to the ost release. \\n",
            "date": "2016-02-10T17:29:00+00:00",
            "helpful_count": 110,
            "mal_id": 210623,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4530434.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Indari",
                "username": "Indari"
            },
            "url": "https://myanimelist.net/reviews.php?id=210623"
        },
        {
            "content": "There's no real explanation to it, so let's just assume that \"alternative\" in the title of Prince of Stride implies that you should watch an alternative show.\r\nSo, anyone willing to tolerate sports anime thought this would be pretty cool. Running with some parkour elements? Shit, parkour’s awesome, this oughta be good. But instead, we’ve been given a thoughtless, soulless, utterly boring show with no point in watching to completion unless you really, really like sports or writing yaoi fanfics.\r\nFortunately, Stride conveniently makes all of its fuck-ups clear within the first episode, so this doesn’t require a lot of work. Every major character (with the exceptionof a couple that won’t be introduced until later because reasons) gets introduced within the first ten minutes. It’s too much too quickly, like going to your parents’ favorite hangout and having to suffer through all the introductions to their stupid friends who only talk to you to ask about how school is going. But, don’t think about it too hard, look alive because the plot’s coming through!\\n\\n\r\nA school with a famous stride club (whatever that is) is now close to disbanding because they don’t have enough members for official matches because no one likes stride. Wait, what? I thought this was famous? Where did everyone go? That doesn’t matter now, because Riku (whose name I only remember thanks to my fifteen years of playing Kingdom Hearts) joins the club and fills the deficit, and now the almighty Honan Stride Club is ready to go. The whole school sets up a course for the club because they’re all so excited to see stride return that they didn’t even remember the club existed five minutes ago, because no sports anime would be accurate without a bunch of bandwagoners! Go Royals!\\n\\n\r\nWait, aren’t we forgetting something…………? Oh yeah! WHAT THE FUCK IS STRIDE?\\n\\n\r\nStride, the sport, is introduced to us after giving an incredibly vague explanation of just a few things about it. You know, it’s not really the audience’s job to put more thought into your own work. We’re expected to figure the rules of the sport out for ourselves because the authors were too lazy to do it themselves. But after a couple episodes, you can see that stride is just some relay racing with parkour with a coordinator from the sidelines, with some specific details that won’t be necessary. See how easy that was?\\n\\n\r\nBut some questions still remain. Why do we need the gimmicks? What’s the point in the end? One guy did a run while completely skipping the obstacles and nothing really happened, he still had a great run. If they’re there just to make the runs look flashy, it’d be good if you could actually implement flair into the rules of the sport, even making it part of some score. It’d be even better if the parkour was naturally part of the course and not just some shit they threw in the middle of the road. People racing over rooftops and over fences would be pretty badass. They could at least put more shit in the road. But my point is that I’d like it if the parkour had a bigger focus and speed wouldn’t be the only thing necessary.\\n\\n\r\nThen you have the relationers, who coordinate the runners from the sidelines via headset. One team told their relationer to fuck off and one of the runners did all the work while the actual relationer was there as a formality. If the runners can control things themselves, what’s the point of the relationer in the first place? Shouldn’t this be illegal, at least? Why isn’t anyone even watching this race, like a referee? Does ANYONE care about what’s going on??? WHY AM I ASKING SO MANY QUESTIONS?\\n\\n\r\nIgnoring the dumb sloppiness of the sport itself, we have the actual story. Yes, I care about a story in a sports anime, at least to an extent. It’s a sports anime so you can only expect so much, but as long as you write better than a 10-year-old then I can accept it. But when Stride tries to incorporate some human drama, it just gets idiotic.\\n\\n\r\nPrince of Stride being about some high school sporting event just won’t cut it, so we need some DEEP and COMPLICATED backgrounds or something. The reason why Honan’s stride club was low on members in the beginning is because of an incident that caused most of the team to quit. This incident is one of the most bafflingly brain-dead events ever conceived. To not spoil it specifically, the old relationer got rekt by the other team’s, and that caused the runners to crash and lose the race. The relationer and another member then act like complete fucking idiots and escalate the situation way beyond reason, and the knight in shining armor, the only person with a brain, the one who breaks it up, is then blamed for it without anyone trying to communicate like human beings. I am laughing so hard while writing these very words right now.\\n\\n\r\nThe other sort of incident involves the main character not knowing how to get gud and then quitting stride for a while. That’s it, that’s his backstory.\\n\\n\r\nHaving some human drama is nice, definitely. I’ll admit that at least the last few episodes had some sort of weight and tension, but all of this is just so stupid, man. But I could at least respect the nerdy guy, he had some actual problems and characterization that wasn’t dumb. Maybe as a token of my appreciation I’ll go look up his name on the database when I’m done.\\n\\n\r\nBeyond that small number of characters and their dumb stories, the rest of the cast is incredibly flat, boring, uninteresting, generic, and other synonyms, no matter how many memes they try to force. Their only chances of being likable come with how many of their stupid, annoying LOLSORANDOMXD jabs they throw at you. Nice try, Dr. Meme. Oh, whoops, that’s a SIGNATURE PHRASE!!!!!!!!!!!!1111111!!1/1?11/1\\n\\n\r\nShoving away that nonsense, the characters include Leg-lover, who’s the only yaoi bait you’re gonna get, unless you got a kick out of that one guy who had to dress up like a girl. I felt like kicking myself in the nuts just for putting up with this. No one else has anything worth mentioning (except nerdy guy who eventually drops out of relevance anyway) except the girl because she’s a girl and she’s voiced by Hanakanamanahawamawallama, which really isn’t a compliment because she doesn’t have a personality either. The only thing she’s good at is being really worked up over what the other relationer is doing. DO YOUR JOB, IDIOT.\\n\\n\r\nThe woman who directed No Game No Life was told she couldn’t make everything purple in this, so instead she used normal colors and brightened them up about a thousand times. Okay, it’s not unbearably bright, but it really isn’t pleasant to look at, even deep into the anime where you’re expected to be used to it by now. The animation itself isn’t that big of a deal, either. In fact, it’s pretty lackluster, especially given that Madhouse used the same budget as One Punch Man. Maybe they spent it all on memes to try and recreate the magic. I dunno. Anyway, doing cool parkour shit is okay. I guess. But the running is often poorly framed--I don’t give a shit about people moving their arms around really really quickly, you run with your L E G S. LEGS, MAN! Some clever angles would’ve made this pretty interesting to watch, but I guess no one cared as usual.\\n\\n\r\nHey, remember Overlord? That one anime about Mr. Skeltal trying to take over the world? That opening song was incredible, right? Well, the same guys came back to do Stride’s, except not nearly as loud, exciting, cinematic, catchy, or even enjoyable. Which still makes it a decent song because Clattonia was just pure awesome, but the song doesn’t have a lot of punchiness or flair, and it’s marred by some pretty goofy lyrics. The art accompanying it has some style, at least, even if the runs presented look confusing. The rest of the soundtrack has a number of insert songs, which are pretty intelligible when used amongst the action, but I thought the non-inserts were surprisingly good. Not crazy good, but they have a smooth style and presence and are just exciting enough to make you keep your ear out for them without distracting you from what’s on screen. Not a bad ED either. I only listened to it like twice, though, because I wanted to move on as quickly as possible.\\n\\n\r\nThe last thing I wanna talk about are the guys, because this show is supposed to be yaoi-bait and I need to make this clear. These fuckboys don’t even look that good. Thanks for reading, everybody, have a great day!\\n\\n\r\nStory - 2/10\\n\r\nArt - 4/10\\n\r\nSound - 7/10\\n\r\nCharacters - 3/10\\n\r\nEnjoyment - 3/10\\n\r\nYaoi - tryharder/10\\n\r\nOverall - 3/10\\n\r\nFavorite character - Ayumu\\n\r\nFavorite episode - 11\\n\r\nRecommendation level - Very Low",
            "date": "2016-03-22T08:38:00+00:00",
            "helpful_count": 89,
            "mal_id": 213598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4673091.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MozillaFennekin",
                "username": "MozillaFennekin"
            },
            "url": "https://myanimelist.net/reviews.php?id=213598"
        },
        {
            "content": "Prince of Stride: Alternative was one of the first new Winter show to be announced just as the new year arrived. It was also among the first ones to be aired in the season, much to the build-up that was added to it. With one of the masters in the industry working behind it, i.e. Studio Madhouse, Prince of Stride: Alternative was well worth the hype it had accumulated thus far, but as the season progressed, it quickly started to fade away. Why? Let's look into it in detail.\r\nThe show brings no creativity at all to begin with. It has been done countless time insport anime's before. Famous high school club now in ruins and desperate for new members. Atleast try to be a little more creative. The game of Stride does bring a sense of freshness to the show. Basically its a sport where you run all the while competing with the another 'Strider' within your block. It consists of five different members running from start to finish as all the five team members play a part in the whole sequence and give a touch for the next teammate to continue running. One of the problems with the show is that twelve episodes were always not enough to begin with. There are have been countless other similar shows being successful solely based on the fact that they run for a longer time. Time was an important asset to them and they had plenty to utilize it with the execution. This is something Prince of Stride: Alternative lacked big time. On a side note, I cannot understand why there's a 'Alternative' in the title. I've come to light that the source material was a visual game and the show can be taken as a spin-off of that.\\n\\n\r\nThe characters on the show do it no good, with all honesty. All of them are like a basic stereotype with nothing to set them apart from any other generic characters. The MC is a light-hearted and silly guy with a dim-wit personality who just likes to run and is aiming to be on as many of the high school clubs as possible. There's the very cold looking teammate who acts as a direct rival for our MC and who doesn't talk much, and of course, does not get together early with our MC. Then there's the only girl in the show who's in fact the very first characters to be showcased and is another main character in focus in every sense who is inspired by the Stride club's achievements in the past and is aiming to be in the team as a manager. She eventually acts as a Relationer in the team who serves as a guide to the running teammates offering guidance with a speaker directly to the Striders. Then there's always a trap in the group along with a nerd who isn't interested being with the club to begin with. Two more senior characters are there in show, one's a cool, handsome looking guy who seems to be a senior worth relying on, and the other, literally having nothing worthy of praising, in my opinion. The manager however, was an interesting characteristic with his regular inspirational proverbs with a traditional discipline to them. Sad that he didn't get called a \"King\" when someone who only afterwards in the show arrived got to be called one.\\n\\n\r\nThe art totally makes the show cool, and the aesthetics are on the positive aspect of this show. The OP/ED sequences with the music, too, do justice for the show but no OST's or background musics or other character songs worthy to be talking about. But all in all they're on the better side of the show. The frequent use of English in the show, as for the club names and the outfits, really make them appealing to the western audience too.\\n\\n\r\nPrince of Stride: Alternative also suffers from the problem of not being able to convey the story properly in my opinion. It could've have become a good show even with the distinguishable flaws it had, if it had put more effort in giving the concept of Stride a little more spotlight. The sport is cool by all means, but for me it fails to properly deliver some important stuff to the viewer. For example, the tournaments the Stride Races take part in are a little difficult to understand. They do time-trials at times but nothing on the opposing team is showcased (And trust me there are some) on how they got so far. This is where as I said the time limit plays a huge part in. Stride races also offers a lot of cool moves and spectacular jumps, if they had put on something like additional points for that, then I think the games would've become a lot more enjoyable.\\n\\n\r\nPrince of Stride: Alternative was never a profound show to begin with, as is the case with most of the sport shows. But what make them great is the reality aspect and the execution for it, that's where Prince of Stride: Alternative won and lost 50-50 for me. With the pacing and time limit the show had been given, I could see the ending being like that from a mile away, still Prince of Stride: Alternative has the little charm that's the beauty of every sport show, even if it was a short anime with just twelve episodes. \\n",
            "date": "2016-03-22T11:28:00+00:00",
            "helpful_count": 50,
            "mal_id": 213607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=213607"
        },
        {
            "content": "Prince of Stride, a show based off of an otome game with a bit of sports and competition added in. Advertised as a sports series, yet it’s obvious that the show appeals to the female audience with its cast of pretty boys. What is striding? It’s basically a fictional extreme sport of running similar to that of parkour but with unique obstacles. \r\nProduced by Madhouse studio, the show runs pretty fast on its feet, literally. The first episodes introduces the main characters in standard fashion. Nana Sakurai, the main heroine transfers to Honen Academy and quickly becomes the manager of the Stride club, a clubdedicated to striding. The members of the group consists of a variety range of characters and personalities ranging from the cheerful Riku Yagami to the cool Takeru Fujiwara. Each member of the club also possesses individual skills and characteristics that makes them unique on the team. While this is all good and dandy, the show doesn’t capitalize on their traits but instead follows a generic route of competition. Yes, there’s risks and strategy that is adapted into each race. However, the ending result usually is predictable. And that’s honestly something that isn’t so admirable.\\n\\n\r\nThe story structure is designed as more carefree although striding is the main course of the plot. Other times, the show feels like it’s taking a breather such as fashion shoots, hot springs, and even the infamous beach episode. In general, the story turns into a mixed affair of comedy and competitiveness. If that makes any sense, the series also takes every advantage of the boys to make them stand out as bishounens. There’s nothing wrong with that except the show focuses perhaps a bit too much on it for the first half of the series. It takes the serious nature of the striding when the boys are presented more as fan service rather than athletes. On the other hand, the show does take its game mechanics seriously. Every relay race is designed aesthetically and never the same. In addition, the show adds commentary to explore the physical aspects of the obstacles, short-cuts, and potential strategies runners can use to their advantage.\\n\\n\r\nHowever, the story isn’t the main problem with the show. The main problem lies with the characters. It’s hard to feel attached to any of them. Takeru is like a Free clone of Haru but hardly has a strong relationship that can be relatable. Riku adds a bit more of casual atmosphere that people can get used to quickly but it’s hard to accept his character. He’s just too damn carefree. Heath Hasekura, the half-man, half-model is probably Mr. Fan service and there’s little depth about his character at all.  Finally, Hozumi Kohinata exposes almost all the weakness of the show with his non-existent characterization, girly face, and weakly timed jokes. Luckily, there’s some characterization and background storytelling through mid-story but the overall execution lacks steam. Don’t expect Honan Academy’s rivals to be memorable either. They have cliché written all over them with easily forgettable characteristics. \\n\\n\r\nIf you’re interested in some fun excitement, then Prince of Stride might be a show for you. While the storytelling and characters are easily forgettable, the relay races themselves lives up to the hype on most occasions. Stride is apparently a fictional sport so the rules and risks are a refreshment to any sports fan. It invites speculations on what strategies can work and what may fail. The risk is also realistic as well that includes near fatal injuries. Furthermore, the show does a clever job highlighting the body movements of the athletes. Each episode is choreographed consistently whether it’s jumping across shortcuts, bypassing obstacles, or just running against the wind.\\n\\n\r\nThe artwork is like colored rainbows. Bright and flashy are just few of many words that can describe the background visuals.  It also has a sense of flamboyant feel as each relay race has a different style unique to each competition. And of course, who can forget about the boys? They are the main stars not just for being athletes but an eye candy for the female audience to see.\\n\\n\r\nSoundtrack is surprising attractive with a good amount of psychology mixed in. There’s good timing during crucial points of each relay race to capture the thrill of competition. It’s also creative enough to be legitmently entertaining to the ears. Character voice mannerism is moderate although I personally find them lacking with the exception of Riku. Meanwhile, the OP and ED theme songs are rather mediocre in respect.\\n\r\nIn essence, Prince of Stride is more of a show that seems to appeal to a certain demographic and advertised for the audience to play the game. It isn’t an entirely awful show despite the lackluster story or mild characterization. Rather, it doesn’t deliver with the premise and each episode seems to lack more and more steam as time drags on. I find it hard to also get attached to many of the characters and in the end didn’t really find liking any of them. Blurring the lines of fictional sport and modern man service, this is a show that easily feels like an advertisement.\\n",
            "date": "2016-03-22T07:58:00+00:00",
            "helpful_count": 38,
            "mal_id": 213596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=213596"
        },
        {
            "content": "Introducing Stride: an extreme high-thrilled sport where parkour and endurance running collide together! \r\nThe rules of Stride are really simple: you form a team of six people and you compete against one other team. Five of you run across the race course as a relay, avoiding obstacles, and staying on track. The fastest team who crosses the finish line first wins. \r\nIt’s definitely a very interesting concept straight from the get-go. So why can’t I rank this show any higher?\r\nWell, for one, whenever you introduce a sport, it is imperative to consider your audience: they have no clue what the sport is about or nevereven heard of anything like it before. Furthermore, sports often incorporate a lot of new terminology that can lose the audience quickly. As a result, the screenwriters must absolutely take the time to explain these terms well.\\n\\n\r\nThis is where Prince of Stride begins to crack. In the first few episodes, terms such as “relationer” will be thrown at you and leave you second-guessing until you actually see it in action. Techniques associated with parkour or the relationing process itself, too, are never properly explained. And, most importantly, the rules of Stride are very open, and this is a recipe for disaster. For instance, shortcuts – what exactly constitutes an acceptable shortcut? Couldn’t you technically just “shortcut” an entire leg? Since this rule and others like it are never thoroughly explained, viewers who are making an attempt to understand what is happening are more than often left hanging and utterly confused. And mind you that this is just one rule  – there are plenty of others that don't make any sense either.\\n\\n\r\nThe other issue is the characters themselves. As you probably know, Prince of Stride centers on the members of the Honan Stride team. The characters on this team had serious potential but were never given ample time on the show to have enough depth. Some characters were given no time at all and honestly were not a significant factor in the show (e.g. Hozumi). They could have been left out from the story and the plot of the entire show would not have changed much (minus the fact that you would have an incomplete team, oops). Others are what I like to call half-baked: some characterization but somewhat forced. A good example of this is Nana. Nana’s true colors begin to show when her father shows up back in Japan, but since her father was never mentioned up to this point, it seems as if his entire purpose was to elicit some emotional response from her. Thus, her actions and thoughts come off as a little unbelievable. I would argue that the only decent characterization was of Riku (see episode 11), since we later learn that he uses Stride as a way to dissociate his own identity from his more talented brother’s.\\n\\n\r\nAs for the plot, there isn’t really anything remarkable about it. As with all other sports anime, Prince of Stride: Alternative tries to balance Honan’s training and the tournaments that they participate in. In the first half of the show, there is more training and other trivial things that they do (e.g. obtain a sponsor) than there are actual tournaments, and some of these training sessions do not produce anything fruitful other than heightened, excited emotions. Towards the end of the show, however, the plot finally gets somewhere when the Honan team comes face-to-face against two of their toughest, most challenging rival teams during the End of Summer semi-finals and finals.\\n\\n\r\nFor the art, let’s just say it’s different. The color palette that Madhouse chose to use in this show often comes off as overly bright or pale. It’s not oversaturated as in the colors of No Game No Life but will take some time to adjust to. Despite this, the animation and artwork is very consistent. Sound and voice acting are also of high quality, albeit none of it really stood out.\\n\\n\r\nSo, just to summarize, I wouldn’t say that this is one of the better sports anime out there. Its premise had a lot of potential but unfortunately the plot does not build off from it at all. If you’re looking for a more balanced story or characters with more depth, you won’t find them here. I felt like too often this show came off as a little dry since nothing is really explored well, and it’s likely that you will think this way too.\\n\\n\r\nOverall rating: C\\n\\n\r\nAuthor's Disclaimer: Please remember, this is my own personal opinion. I critique anime primarily on how the story is executed and how well-rounded the characters are. This review is not meant to target any other review but was intended to provide a more holistic analysis. \\n\\n\r\nIt should also be noted that this is a full-fledged review of the entire season.\\n",
            "date": "2016-03-22T09:45:00+00:00",
            "helpful_count": 30,
            "mal_id": 213602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=213602"
        },
        {
            "content": "I see a lot of different reviews for this anime these couple of days, so I thought it would be a nice chance to write my first review on an anime I finished just yesterday. \r\nPrince of Stride is a sports anime based on an otome game, which I can pretty much sum up with just one word: Mediocre.\r\nStory: 4/10\r\nThe first couple of episodes are quite interesting, as they introduce us to the characters and the sport, ''Stride'', which can be described as a running race with parkour between two teams,  each with five runners and a relationer. That's all, nothing else is everexplained, there is not as mush emphasis on techniques as there should be in a sports anime, no descriptions during the matches, nothing. Instead, they decide to emphasize on how they put their souls into Stride and how they are giving and receiving each other's feelings through theirs relations on every episode. Ok, it was cute at first, but it ended up tiring and without any real depth. Apart from the striding moments, we can also see just a few of the backstories of the characters, most of them being pathetic (example: the Kuga incident), with only Riku's being just quite decent.\\n\\n\r\nCharacters: 3/10\\n\r\nThis is, in my opinion, the worst part of the show: the characters. So many uninteresting, cliché characters without depth to choose from, all of them being mostly useful only as fanservice material. As hard as I tried, I couldn't get attached to any of the characters, that's why all this ''convey our feelings through Stride'' thing didn't even move me a bit. We didn't get to see many interactions between them, they were mostly just running or goofing around, that's why all those feelings of theirs seem paper thin. The only character they bothered to give a little character development to and show us more of his thoughts is Riku, but what happened was pretty predictable and not very interesting. \\n\r\nAs for their opponents, they only manage to be forgetable fanservice.\\n\\n\r\nArt: 7/10\\n\r\nThis is what made me watch this show and the only thing about Prince of Stirde that I believe to be above average.  The animation is pretty good, especially when it comes to a Stride match. \\n\\n\r\nSound: 5/10\\n\r\nNot much to say here, mediocre OP and ED, and the background music for the Stride matches becomes tiring and boring without any impact after a while.\\n\\n\r\nEnjoyment: 4/10\\n\r\nApart from the not really good story and characters, I actually found this show a little enjoyable during the races, where I can say there was at least a little tension. It was easy to watch, despite its flaws.\\n\\n\r\nOverall: 4/10\\n\r\nAs a conclusion, what Prince of Stride had to offer was pretty boys running around and a little bit of bad drama. This could have been a good anime, if they added more depth to the characters and had more sports elements, but they probably decided to make it like this, which makes it just an advertising material for the game and nothing more. You might still enjoy this anime if you like sports or just pretty boys.",
            "date": "2016-03-23T05:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 213686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=213686"
        },
        {
            "content": "Prince of Stride is by no means a masterpiece. It is a light-hearted sports series centred around the world of Stride, a fictional parkour/relay race. While Stride is somewhat different to those common sports seen within the genre, it still fits the mould expected. So what does PoS have to offer?\r\nThe story centers around the Honan Academy Stride team, a once elite stride team, which has dwindled after an incident two years prior. Two first years join the team, expecting to find a thriving Stride team, however they are shocked to find the club only has three members. The basis of the story isn't groundbreakingor revolutionary, but it is a solid, well-crafted plot which is really enhanced by the sport of Stride. What Stride does well however, is create realistic connections between the main cast. Stride definitely isn't a character driven show, hell, most of the side characters aren't memorable, but it's these relationships within the main cast which makes the drive of these characters powerful. \\n\\n\r\nThe art of this show is beautiful and it is really one of the highlights. The world of stride, especially in competition, is bright and colourful, which really fits the atmosphere of the show.  The character designs, even for one-off rivals, is unique for every character. The action sequences are high quality and one of the best things of Stride. Watching the characters play Stride is nail biting and entertaining, but predictable. \\n\\n\r\nMy biggest gripe with this show is the ending (no spoilers ahead). It's abrupt and sudden, which bothers me. It doesn't tie up any loose ends or provide any closure. It's an ending that makes sense, but it could have been so much better. \\n\\n\r\nCharacter development is there, but not significantly. There isn't enough time to fully explore all of the main cast within the twelve episodes given. It is based off a Otome Game, which I have heard does explore the main cast and even the side characters thoroughly. However it's impossible to condense 60+ hours of gameplay into twelve 20 minute episodes. \\n\\n\r\nJust to reinstate, Prince of Stride is no means a masterpiece, nor is it a revolutionary series. But, it IS a fun series. I binge watched it all in a day. It had me so hooked I couldn't stop watching it. It follows all the same tropes you would expect out of a sports anime, but it follows them well. If you enjoy sports series in general, you will enjoy Prince of Stride.",
            "date": "2016-12-11T17:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 235289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113699.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/simsimsucks",
                "username": "simsimsucks"
            },
            "url": "https://myanimelist.net/reviews.php?id=235289"
        },
        {
            "content": "Prince of Stride builds upon the fundamentals of sports anime and brings a more dramatic and innovative approach to the genre. Prince of Stride is revolutionary in a lot of ways and I feel it can convert many who don't watch sports anime to give it a try. SPOILER \"FREE!\" (it's a free anime joke)\r\nStory:10\r\nThis show goes above and beyond what it would have to do to deserve a great rating for its story. Everyone has a unique story that is connected to at least three other people in the main group of the stride runners. There's not really any backpedaling with flashbacks so it'svery fluid. All the main stories are pretty interesting however a lot of them don't gain momentum until towards the end of the show so hold out if you feel a lack of story in the beginning. While it doesn't come off as one originally, Prince of Stride has great comedic elements that made me KEK so KEKING hard that I KEK'd until my sides hurt.\\n\\n\\n\\n\r\nArt:10\\n\r\nIf you've seen any clips from the show or maybe the PV's you'll know what I mean when I say this show is vibrant and beautiful. The color scheme is very pleasant and the animations are smooth throughout the entire show. Not much else to say in this area.\\n\\n\\n\\n\r\nSound:10\\n\r\nI'm not an expert on what makes a soundtrack great but the songs were catchy and did a great job of expressing the themes that weren't visible.\\n\\n\\n\\n\r\nCharacter: \\n\r\nAll of the characters are pretty interesting in their own ways. The show doesn't feel like it has a lot of forced emotions and the characters stay true to themselves throughout. There's a lot to say but it would spoil the show and I want to make sure this remains spoiler free.\\n\\n\\n\r\nPros and cons:\\n\r\nPros\\n\r\n-No fanservice\\n\r\n-Great OSTs\\n\r\n-The fucking KEKs\\n\\n\r\nCons\\n\r\n-No second season\\n\\n\\n\\n",
            "date": "2016-05-06T21:00:00+00:00",
            "helpful_count": 10,
            "mal_id": 218054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5306495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BGdealer",
                "username": "BGdealer"
            },
            "url": "https://myanimelist.net/reviews.php?id=218054"
        },
        {
            "content": "In one paragraph: It was interesting, had some really golden jokes and even the minor characters had personalities. However, there are a lot of plot holes, they skip a lot of the parts that would be interesting to see and the problems they face have a tendency to be really stupid. They don't really get to any solutions, and there was only one time when we actually saw how they trained. All in all, it's not bad. Continue reading for more details.\r\nStory (6): The story begins, like many other sports related anime, with a character introducing themself and explaining that they went to this particularschool because of their team in a certain sport. Turns out that this team has been facing difficulties, and they would have to find more members to get the club working again. The first episodes are really slow and steady, you get the information you need, though probably not all the information you want. Later, the time skips start, so you go from one Stride match to another with a small training segment in between (the training is usually along the lines of running a little and jumping over some stuff and suddenly improving a lot). There are always a lot of details lacking, which I guess can't be helped when every second episode is an actual match, and there are still episodes that seem to serve no purpose to develop the plot at all. When it actually gets down to it, the scenes that are included are really good, and considering the fact that it's from a game, you can't really expect too much thought into backstory and such, since it's literally based on just the running part. The sport itself is really interesting, basically a baton style race one a track with lots of obstacles, bringing in acrobatics as a theme. \\n\\n\r\nArt (7): The art is actually very nice, it's a clean style with no obvious flaws. All the characters look very distinct, with individual eye shapes, noses and body types. It's very detailed in that sense. The way the clothes are drawn on the characters sometimes looks slightly off, though. The backgrounds are slightly over the top sometimes. It catches the feel of the situation, but the colors have a tendency to be extremely bright. Most backgrounds are repetitive, with some exceptions. There are also a lot of sceneries in this show that look absolutely stunning.\\n\\n\r\nSound (7): The opening and ending themes really fit the show, it's particularly cool that they use the idol group from the show to create a theme. The soundtracks in the show are really good, I don't know what their names are so I'll describe them like the sound, the light sparkly tone is really... Light and sparkly, which makes it perfect for those tensionless middle scenes. The \"end of summer\" track is really upbeat and tells you something is about to go down... That is, if the scene on the screen wasn't enough.\\n\\n\r\nCharacters (8): The characters are all very individual, they all have their own respective facial traits and body types. All the characters also have their own personalities, and rather than the standard \"everyone is super friends with everyone\" kind of style, there is a very realistic parting in who gets best along with who. The characters also have roles in the story that makes them important, which isn't seen way too often. Of course, it doesn't get a perfect score, mostly because all the characters seem to suffer from being way too emotional about things, to the point where it doesn't make sense. The comic relief characters also get annoying after a while.\\n\\n\r\nEnjoyment (7): It's a really light watch, since it doesn't dig into the past of the characters and the story behind what is happening a lot. It focuses solely on the sport itself, and you won't see any of the problems outside of it. Except for one single character in the main characters' class, there is not a single person not related to Stride that we see more than once. This is probably a great \"middle ground\" anime, a perfect next step after finishing something that leaves you empty, wondering what you'll do with your life from now.\\n\\n\r\nOverall (7): I personally really like this anime, since it does have a line going through the scenes, even though there are some huge time skips here and there. It definitely kept me from not being bored, so it served it's purpose. The best way to explain it is \"interesting enough.\"",
            "date": "2016-03-23T10:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 213698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/703535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SnowSketch",
                "username": "SnowSketch"
            },
            "url": "https://myanimelist.net/reviews.php?id=213698"
        },
        {
            "content": "*Review may contain minor spoilers*\r\nStory 4/10\r\nA young prodigy joins the Stride school club to re-obtain its old glory.\r\nFrom here on out they will do training and a few ''matches''\r\nArt 7/10\r\nThe art is a little bit on the ''smoother'' style, it is not my cup of tea but it isn't bad either. it stayed consistent throughout the whole anime. There was nothing out of the ordinary or ''unique'' hence only a 7.\r\nSound 5/10\r\nthe voice actors weren't to bad, but they definitely could have done a better job throughout the races and duels they did, I didn't get that exiting feel at the star of a raceetc.\\n\\n\r\nCharacter 3/10\\n\r\nall the characters do have a small story line around them, but you definitely can't feel the bond they are trying to give them together.\\n\\n\r\nEnjoyment 2/10\\n\r\nAs a fan of sport anime, it hurts me to watch this, you do not feel the bond between the team mates, the concept of stride is quite cool, but poorly animated, it doesn't feel as epic as it should feel.\\n\\n\r\nOverall 4/10\\n\r\nI would say give a pass on this one.",
            "date": "2017-09-23T00:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 258340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PvMDream",
                "username": "PvMDream"
            },
            "url": "https://myanimelist.net/reviews.php?id=258340"
        },
        {
            "content": "ALERT! Look up the rules of Stride (the fictional sport in this anime) before you watch this because, otherwise, you're gonna be confused for like the first two episodes.\r\nWell, this is yet another sports anime to add to my list. Can you name a few sports anime? Haikyuu!!, Free!, Kuroko no Basket? Well, have I got good news for you! Nearly ALL of the seiyuus in Prince of Stride: Alternative have been in at least one of those aforementioned sport anime staples.\r\nAlso, the ONLY reason that this anime isn't ranked as a 10 is because the storytelling was bit shoddy and the art made everythinglook super washed out. The story itself was fantastic. I love the elements that were a part of it, such as: Riku and Takeru's backstory, Riku's issues with his brother, and the history of the Honan Stride Club. However, the anime didn't give these plot elements enough time to grow. Had the season been 25 episodes long instead of 12, it would've been nice because those things could've been elaborated on more. As it stands, you kind of get told something through a couple lines of dialogue without dwelling on it. So, the story kind of expects you to fill in the blanks of your emotions when it should be giving you those emotions. Make sense?\\n\\n\r\nThat being said, I actually did get a little teary eyed at the end. This brings me into the characters. I absolutely loved them. Not only do I love the familiarity of the seiyuus, but I love the relationships the characters have with each other. Again, I wish they could've been dwelled on a bit more because there were some really beautiful moments in this anime. It would've been heightened had the anime taken the time to develop the individual characters and their relationships to everyone before trying to shove in a meaningful scene. I did still cry though. So, it wasn't a total failure on their part. Just putting that out there.\\n\\n\r\nThe music was simultaneously emotional and badass. The music that plays when the characters are running is either something that's jammin' and that gets me hyped, or it's this one song that conveys all of this emotion that these characters are feeling. Both are really good, so I'm very happy with the music in this anime. I don't usually talk about music in anime, so that tells you something. \\n\\n\r\nThis anime doesn't deserve the flak it gets at all. Like, yeah, it should've been stretched out and the story and characters should've developed more smoothly instead of like \"BAM, take this thing we didn't explain properly before this!\" But at the same time, I had such a good time watching Prince of Stride: Alternative. If I'd trusted some of the more negative reviews on here, I would've missed out on a really good time. If you're super picky about a streamlined story, then don't bother, but if you just want to kick back with some funny characters and have a bit of a cry, then this anime is amazing! As far as pure enjoyment goes, this gets a 10/10, hands down. \\n\\n\r\nI actually really wish that this anime finds itself in another season. If they slow down the story pacing, I think these characters and this world has a lot of potential. Give this anime a go because it's honestly really awesome.",
            "date": "2018-12-18T22:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 296122,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=296122"
        },
        {
            "content": "Story/Plot:\r\n7/10\r\nThe story is nothing special at all. Typical sports anime. It kept my attention for the most part, so I'll give it credit for that. I felt that it was kind of messy. It was just a little all over the place. Watch it and you'll know what I mean. It was cute. I LOVED the parkour/freerunning moves. That's what made the anime so enjoyable for me. \r\nArt/Sound:\r\n4/10\r\nOne of the worst things. The art was beautiful, but I hated how they made the hair translucent. It annoyed the living crap out of me. I HATED how they played the same damn song throughout all theraces. After they clapped their teammates hand, they played that annoying ass song. Over and over. Dub voices are awesome and so are the sub.\\n\\n\r\nCharacters:\\n\r\n5/10\\n\r\nNothing special about them. Your typical characters. I hated Nana. Annoying female character per-usual. She was so....fucking....useless. She had no personality whatsoever. She kept doubting herself constantly. Just.....ugh. The characters weren't all bad. There no development.  \\n\\n\r\nOverall:\\n\r\n7/10\\n\r\nI think it's a nice watch. If you're bored. Only reason why it's getting a 7 is because of the awesome parkour which is super original. For a 12 episode anime, it's not too shabby.",
            "date": "2016-04-02T19:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 215266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5041143.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nalexie_",
                "username": "Nalexie_"
            },
            "url": "https://myanimelist.net/reviews.php?id=215266"
        },
        {
            "content": "Nana Sakurai is a first-year student at Honan Academy. She decides to attend the school in hopes of managing the Stride Club. Stride is an extreme sport involving running and navigating obstacles on an uneven course. Nana meets two boys named Takeru Fujiwara and Riku Yagami and convinces them to join the club in efforts to compete in the \"End of Summer\" tournament. Together, they learn that Stride is about so much more than just running; it's about connecting with each other. \r\n...Or so Madhouse would have me believe! \r\nAs someone who has willingly jumped into [and stayed in] sports anime hell over the pastyear or so, I'd like to think I'm fairly experienced in critiquing sports anime. I've seen all kinds of tropes, some good and some bad, but through it all, I believe the there are a few things all sports anime try to achieve. Whether a sports anime's characters have hyperbolic, unrealistic personalities or are more well-rounded, whether the sports skills resemble stunts you'd see at Hogwarts or actually seem humanly possible, all sports anime have two common goals in my opinion. The first is to teach viewers about the particular sport in question. And the second is to show how the sport in question changes its characters, typically for the better. \\n\\n\r\nPrince of Stride fails to achieve either of these goals.\\n\\n\r\nStride is never really explained well. We get it, there's running. But why all the tricks and acrobatics? Can you get extra points for jumping all over the place, or are those tricks simply to get fans screaming? And if the latter is true, then why don't acrobatic tricks affect a team's final score? Because they should! In addition, the main characters are never shown to really improve. Aside from Yagami changing his posture, none of the characters evolve in their sport. \\n\\n\r\nNearly all of the main characters are flat; they embody one-dimensional stereotypes. Yagami is the angsty teenager going through an emo phase. Takeru is the Furuya of PoS; he's good at everything just because, and he doesn't know how to communicate. Sakurai is in the anime simply as a formality, since the anime was adapted from a video game. Kominato and Kadowaki are the comic relief, Heath is the reliable senpai hunk, and Kuga is the strong, silent weirdo who likes to stare at the sky and won't shut the fuck up about the wind. None of these characters have depth, aside from maybe Yagami, if you're willing to qualify his struggles as \"depth.\" \\n\\n\r\nMultiple episodes repeatedly emphasize Yagami's inferiority complex, but each episode \"resolves\" his issues by the end with no believable sequence of events. Prince of Stride attempts to convince us that Yagami truly loves running deep down, but despite it TELLING us that, it SHOWS us a very different message. Yagami seems to hate Stride. He hates his brother, he hates running, and he hates Takeru. But somehow, every episode ends up with him smiling into the sunset, only for him to repeat the same angsty routine in the next episode. \\n\\n\r\nSo here's the problem: Without dynamic, developing characters, and without even a proper education on Stride, what's left in this anime? All that's left are ridiculous amounts of drama, cheap tricks, filler episodes, training montages, the same stupid insert song, and characters on the sidelines yelling \"HASHIRE!!!\" at the top of their lungs. And oh, so much drama. All of which lead up to a finale that frankly, these characters didn't earn. Unfortunately, none of those things is enough to make an anime compelling. There are many scenes that attempt to hype up the audience, and they do succeed at first. However, those scenes get old without any connection to the characters, and the anime very quickly becomes stale. \\n\\n\r\nThe art of Prince of Stride is a little jarring, mostly because of the weird color scheme. The shading and coloring of the anime definitely didn't help promote a \"real\" feeling to the show. It could have been a strong point, had the plot and characters been up to par. Similarly, the music for this anime was pretty good, but it didn't have nearly the impact it could have because of the plot and characters. What's more, many victory scenes used the same annoying insert song until, again, the effect was lost and the song became an annoyance. \\n\\n\r\nI have always thought very highly of Madhouse, but they kind of missed the mark with this anime. Between the bad character development, misplaced music, and lack of proper exposition, a lot went wrong. I love to joke about being stuck in sports anime hell, but watching this anime was actual hell.",
            "date": "2016-03-22T14:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 213633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969759.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/psychoalchemist",
                "username": "psychoalchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=213633"
        },
        {
            "content": "I watched this anime series because of Madhouse animating it and that it is based on an otome game, a genre I'm obsessed. But rather I got a lackluster character art, mediocre OP and ED, and did not see romance between the female lead and the other guys.\r\nIt should be stated that being based on a BL (Boy's Love) game is more appropriate for this anime since the only romantic development in this anime where between the guys. The touching of hands were rather dramatic since it is the theme of the show.\r\nStory:\r\nIf you watched Yowamushi Pedal, the story is like that, wherein the clubcompete on tournaments and beat schools. It is very straightforward. There's also the issue of a backstory between the main leads that came out of nowhere.\\n\\n\r\nCharacter:\\n\\n\r\nThough I did like the comedy of the show and the antics. The characters are flat though and their opponents beside Gal-Stan and Kakyoin are so flat since they weren't explored properly.\\n\\n\r\nMusic:\\n\\n\r\nThe OP was upbeat but it wasn't my type. I really couldn't remember the ED.\\n\\n\r\nArt:\\n\\n\r\nI had high expectations since watching Death Note and Chihayafuru that I will get atleast a artistic anime, but what I got were characters who put too much powder in their faces. The character art was so poor but the background and how they executed the stride animations were spectacular though.\\n\\n\r\nOverall, I did enjoy the anime because it was fun and I like sports anime.",
            "date": "2016-03-24T00:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 213770,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3825147.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NoonebutMark",
                "username": "NoonebutMark"
            },
            "url": "https://myanimelist.net/reviews.php?id=213770"
        },
        {
            "content": "What is stride ? Stride is a running sports with parkour. yea... they are running while doing some parkour stuff. tbh, personally, i like the concept of the sports, and even running is one of my fav sports. that is the reason why i got interested in this anime. \r\nFor the first episode, first impression, to me, it was a really cool, awsome episode. i really really like the way they start the series. looks awsome and cool to me, and i thought it would become a great series, but......a little bit dissapointment to me. \r\nA story about a guy who in the past hasquit playing stride because of his brother, but now, in highschool, a girl and a boy invite him or more like force him to join a certain stride club without knowing the fact that he has already quit playing stride. \\n\r\nAnd that where everything began. but it was a little bit dissapoint me. \\n\\n\r\nWhy? \\n\\n\r\nbecause this show is focused more on the character problems and development more than the action on the sports. and the result; they didn't put much action in the final episode, final race, and that one kinda dissapoint me because i was looking foward to the action. i didn't mean to say the character development and the problems is bad, i like some of them, and some of them i think it was okay to me, but i don't like the fact that they focused more on the character rather than the action. it wasn't balincing in my opinion. AND! the race was too predictable to quess who will win. in sports, that supprosed to be the main problem, the author musn't let any viewer predict or know who will win. because that will the climax. it is pointless if the viewer already know who will win. it's not like i don't like it, it's just okay to me. i just want to say it's a shame, a great looking sports like that is too obvious to see who will win. Basically it lacks of impact. \\n\\n\r\nFrom the character, they really did a good job in my opinion. they really put their effort to executed the development, problem and conclusion even tho i found their relationship a little bit weird. to me, it wasn't really bother my enjoyment. to me the pacing was okay. i don't see anything wrong nor even bother my enjoyment. just the fact that this show is lack of action is dissapoint me. \\n\\n\r\nThe soundtrack was pretty good overall, especially the OP. really like the op. but the ED..... i wish i will never heard it again. well this anime is originally for girls, so obvious some of the song will be something like that. i can't blame the director but still for me, i don't like the ED song at all. \\n\\n\r\nOn the other side, good animation for a sports anime. really fit well, especially the soundtrack they used for the action, really good imo. but there is one thing that really pissed me off. some of the character design almost look like a girl and that really pissed me off for some reason. why ? because i almost turn into a gay for a second. it was really a shame, a beautifull character design, the truth is, he is a guy. i really hate that tbh. like i wish that guy is a girl so i can put her in my fav list XD but well, whatever. i don't give a fuck with it anymore XD \\n\\n\r\nOverall, not really enjoy it that much but i still enjoy it. i mean i enjoy it but not really 100% enjoy it. well, like i said, i didn't enjoy it because lack of action. i don't really like the fact that they focused more on the relationship rather than the action. dissapoint me a little bit. so i'm gonna give it a 7/10. probably never watch it again, BUT! i wouldn't mind a second season. at least more action. \\n\\n\r\nI don't know if what your taste is, but if you like sports, try 1 or 2 episode of this series, the sports is really great imo, but it just didn't have that many action, and it was kinda predictable. \\n\\n\r\nSorry for bad english.\\n\r\nHope my review can be helpful to you all. \\n\r\nThanks. Have a nice day \\n",
            "date": "2016-03-24T05:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 213790,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=213790"
        },
        {
            "content": "ummmm lets start with a talk about this sport called S-T-R-I-D-E\r\nSo basically its relay running with parkour, the name is pretty dank tbh, like striding sounds so fuken badass and real I thought it was a real sport and i think it fits really well\r\nThis sport all about the pace,parkour skills and most important of all \"connecting emotions\", pretty funny concept gotta say, but why nut? connect emotions = good at stride\r\nlets continue with the norms\r\nStory 7/10: Win this summer tournament called \"end of summer(EOS)\", simple story, not much to say\r\nArt 8/10: Coooooooool,siiiiiiiiiiiiiiiick, badddddassssssss, Madhouse(the studio), their overall art are always to the coolside ofthings, colours are to the brighter side of things, when madhouse generally has colours to the dark side of things\\n\\n\r\nSound 8/10: OP- dank, OST-feels, ED-it was ok(somehow made it into top10 ed for anime trending) VA wise, they all fit their character, Kuga-senpais voice is badass, Riku's brothers voice is gay asf, pretty sure he is gay aswell\\n\\n\r\nCharacter 8/10: I will comment on  a few characters because there are so many characters, you could say all of them are MC's\\n\\n\r\nFujiwara Takeru(Honan Runner)-Loves the legs, loves his protein, probably the most funniest character in the whole series, he is the most serious person about stride, but he is like dense and does somereally funny stuff\\n\\n\r\nYagami Riku(Honan Runner)-pretty badass,dyed his hair blonde,he is probably the major MC, towards the end of the anime, its all about how he overcomes his feelings towards his older brother\\n\\n\r\nSakurai Nana(Honan Relationer)-gotta say pretty impressed how she can connect emotions through a mic, probably the most normal character, nothing special about her\\n\\n\r\nKuga Kyousuke(Honan Runner)-the man, my favourite character, manly voice, and talks about the \"wind\" all the time, so cooooool\\n\\n\r\nDan(coach)-has some sick one liners(idk what they called, quotes maybe? like a few words, but has a deeper/bigger meaning to it), very funny character aswell\\n\\n\r\nSuwa reiji(saisei captain)-hes pretty gay, the typical very feminine guy character that is really nice to everyone\\n\\n\r\nShizuma Mayuzumi-(saisei relationer)- Reiji's waifu, if not 11/10 waifu material, definitely most feminine character, long pink hair, cooks, cleans etc\\n\\n\r\nEveryone above is a male excpet Sakurai Nana\\n\\n\r\nwhen i say \"gay\" i mean it literally\\n\\n\r\nEnjoyment 8/10: watching people connect emotion is SOOOOOOO fun (being sarcastic here), I guess its like watching sport, I spend 8 hours a day watching cricket so watching 20 min of striding is pretty good\\n\\n\r\noverall 8/10: Everything is done pretty well, just the normal sports anime, the anime is pretty predictable towards the end, its probably because its a adaption from a visual novel, if you like sports anime, then its definitely good for you, if not, go watch boku dake ga inai machi, you definitely  wont hate it :)",
            "date": "2016-04-01T19:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 215108,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5034187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mejo369",
                "username": "mejo369"
            },
            "url": "https://myanimelist.net/reviews.php?id=215108"
        },
        {
            "content": "I got baited. Hard.\r\nWith the sports anime craze that others and I were in from Haiykuu and Kuroko, I was pretty damn excited to learn of one that focused on parkour/free-running.\r\nThen I had my hopes dashed as I watched on.\r\nThis is a shitty version of Free, plus I'm not the target audience for this show.\r\nI could see the intended appeals of the show, but Free does it way better.\r\nWhat I could not see was the free-running or parkour, which was the sport!\r\nWe had shots of shadows running in the background, or unimpressive vaults that I've done on the regular. Being someone into free-running, you'd thinkthey would try and appeal to that audience.\\n\\n\r\nI could understand the reason of the episode where they needed sponsors for their team, but that meant watching them play cross-dressing dress-up for it.\\n\\n\r\nGo watch Free for the appeal, or watch Kuroko/Haiykuu for the sport.",
            "date": "2016-07-03T21:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 223038,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5091665.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ChoocoboYao",
                "username": "ChoocoboYao"
            },
            "url": "https://myanimelist.net/reviews.php?id=223038"
        },
        {
            "content": "There was not enough story development in my opinion and I feel like the creators of this anime had so much potential to work with but they either had too little funding or were too lazy and tried to make it as short as possible. Sports anime are not meant to have only 12 episodes and you can clearly see why, since the creators did not allow us enough time to warm up and get to know the characters and the story. I feel like the creators rushed the story line because they were like shoving plot after plot up our throats and not evenletting us digest it. Overall I think this was the worse sports anime I've ever seen.",
            "date": "2016-06-26T11:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 222049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5405335.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yukinokitsune123",
                "username": "yukinokitsune123"
            },
            "url": "https://myanimelist.net/reviews.php?id=222049"
        },
        {
            "content": "This review contains minor spoilers.\r\nAfter watching \"Haikyuu!!\" I became so hyped up about sports series that I decided to try \"Prince of Stride: Alternative\". I can't say I'm disappointed, but compared to aforementioned \"Haikyuu!!\", \"Prince of Stride: Alternative\" looks bland and, on the whole - average.\r\nThe story is as generic as it could get. It revolves around the new extreme sport called \"Stride\" which is similiar to parkour. \"Stride\", however, is not new, neither it is extreme. Sadly, the runners just run, sometimes they jump over some obstacles and somehow, this attracts large crowds and makes runs a big city event.\r\nAs with all school clubsin anime there is a girl, and a boy and another boy who have always dreamt of running in \"Stride\". They join the \"Stride\" schoolclub which, obviously, is running out of members and our protagonists miraculously save the club. Then, all of them are training and running. Also, in each episode there's someone talking about how \"Stride\" connects people with a mandatory, super-cringeworthy shot of high-five of the runners in the background. And that's pretty much the story, or what supposed to be the story. Very predictable and unoriginal.\\n\\n\r\nThe art is mediocre. It has its ups and downs but there's nothing particular in it. The characters' faces seem really weird as they look like they have different shapes in different shots, but overall the characters are nicely drawn. Run sequences are fairly well animated, although there is too little running and too much thinking-while-running shots.\\n\\n\r\nThere's also nothing particular in sound. During the run sequences there's always some music but in my opinion it is there only because it would be awkward to listen to the boys' gasps for a few minutes.\\n\\n\r\nWhen it comes to characters, there's absolutely nothing original in them. There's the female protagonist, who is there only to be a narrator and has no personality whatsoever, then there's the overly enthusiastic guy, the manly guy, Haru from \"Free!\" and even Sephiroth from FF7 - pretty much the characters we've all already seen elsewhere. Each character is pretty much one dimensonial and is involved in some backstory which is absolutely forgettable and is meant to add depth to the characters but unfortunately fails to do so. On the other hand, some of them are sometimes funny.\\n\\n\r\nHaving completed the whole series, I can say I generally enjoyed it despite its flaws. There definitely are better sports series, but also there are definitely worse sports series. \"Prince of Stride: Alternative\" is by no means a masterpiece, but it's not a bad show either. This anime just doesn't shine in any way. If you have some free time, give it a go. Don't expect too much, though.\\n\\n\r\n(This is my first review and I'm not native English speaker so there probably are lots of mistakes, so sorry for that.)\\n",
            "date": "2016-03-25T05:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 214014,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3382885.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/kopczix",
                "username": "kopczix"
            },
            "url": "https://myanimelist.net/reviews.php?id=214014"
        },
        {
            "content": "Now the story is nothing special. It’s basically Yagami Riku and his fellow classmates re-establish the school's \"Stride\" team and compete in Stride competitions. I got really hyped especially when reaching the end of each race. I would've liked the series more if they did more with Nana Sakurai because I felt she was one of the best character, also I think they should've done a little more with Yujiro because he didn't really do much in the series  Overall, it is definitely a fun watch if you are really into sports theme animes. It has lovable characters and has awesome action moments. Butif you’re looking for an anime that has an in-depth story, this is not the anime for you. \\n\\n\r\nThere is also a video Review on my channel if you wish to check out on The Georges \\n\r\nhttps://www.youtube.com/watch?v=qtdYLd1pSXM\\n",
            "date": "2016-03-28T13:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 214569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1455365.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Phantomturtle",
                "username": "Phantomturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=214569"
        }
    ],
    [
        {
            "content": "The whole show is a dull inside joke, it acts like one of the main characters in it, Yagami, starts strong but can't finish the run strong and just ends up screwing everyone in the process.\r\nArt and Animation: 6\r\nThe Animation like many other things about this show starts decent but by episode 6 the funding got cut of something and the whole thing became a cheap Chinese knock-off hentai, no its not really that bad but its not something we should expect in 2016.\r\nAnd the art refreshing and colorful at first but then you realize that just putting bright colors doesn't make something look good,It doesn't bring anything new to the table and instead tries to bore you to death by using marker colors as an excuse. \\n\r\nThat said, its passable.\\n\\n\r\nSound: 5\\n\r\nI can't really criticize the acting of the voice actors but I can still say nothing blew my mind (engrish lel :zree-tu-vaan) but I can criticize the tracks they used throughout the show,\\n\r\nagain going with the theme of cheap and knockoff they decided that the show needed to be hip so they got a few 3rd rate EDM tracks one of the guys made in a lunch break and went to snort some in the bathroom or something.\\n\\n\r\nCharacters: 1\\n\r\nIt doesn't get any more  one dimensional than this, the writer of this show either really didn't care and wanted to make a quick buck or bet that he could write a show where nobody gets nowhere, they go from point A to point A ,even harems meant to cater to horny 14 year old have a lead on this show in terms of development.\\n\\n\r\nStory: 1\\n\r\nHow did they screw something so basic so hard? its such a simple premise and a formula that has been done so many times before it has 16 children at this point in its lifetime, its very dull and so predictable you know the ending from episode 6, and everything that is supposed to be enjoyable about a show of this type is thrown out for gay undertones and \"emotions\" which consist of just more gay undertones.\\n\r\nThe ending is pathetic ,its cut so quick the climax has less impact than the one in Tokyo Ghoul and the whole results of the climax are shown in a newspaper on a table as the finishing shot, Are you fucking with me? I had to sit through a show that about running that stands still just to see 2 characters running into the distance (without a god damned background even)? just to see this abysmal excuse of an ending?!\\n\r\nThis whole show is comparable to premature ejaculation of a man with a tiny penis, its not good and also ends abruptly.\\n\\n\r\nEnjoyment: 2\\n\r\nThe first race was actually interesting  but it lost its charm so quick.\\n\r\nThis show is a grind, it grinds your mind, your sanity, You have to give it infinite chances to try and redeem itself even if you know it is horrid and will never do it.\\n\\n\r\nOverall: 2\\n\r\nThis show is quite honestly garbage, and has more gay undertones than boku no pico (which actually has none, they're not undertones.) its a big cheap implied \"Fuck You\" to anyone that watches it.\\n\r\nThe only reason it doesn't get a 1 is because it didn't insult me directly.",
            "date": "2016-03-23T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 213716,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4549100.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/FoxFix",
                "username": "FoxFix"
            },
            "url": "https://myanimelist.net/reviews.php?id=213716"
        },
        {
            "content": "Prince of Stride: Alternative may be labeled as a sport anime, but it is more than that really. For half of the time, it is about the main characters competing in a sport named “Stride”. The other half of the time is used to show interactions between the main characters and relationship with one another. At time, it does both of those work well enough. However, for most of the time, the two parts of this anime do feel lacking. The anime used a fair share or sports clichés to get the job done. Still, Prince of Stride manages to be an okay anime despiteits flaws. \\n\\n\r\n~{Story}~\\n\r\nIn Prince of Stride, the main premise is about a group of students who form a club/team that competes with other teams in a sport called “Stride” (which really is just relay with parkour). However, this is just the backbone of the anime as the main focus is really the relationship between the characters. The whole Stride aspect is used to keep the content fresh. At times, the whole slice-of-life moments can feel like a drag, so the Stride moments do keep your interest. The plot isn’t anything special, due to the fact that this is a by-the-books sports anime. It’s just like any other sports anime you’ve seen; main characters are practicing to get better at a sport, wins some, loses some, practices to get better, flashbacks are given to the characters to give “depth”, gets better and proves to be the best. The plot has a fair share of clichés and they end up pulling down this anime. \\n\r\nStory: 4/10\\n\\n\r\n~{Presentation}~\\n\r\nFor the most part, Prince of Stride takes a slice-of-life approach. Most times, the main characters are either fooling around or training to get better. The tone-shifting at times can be pretty noticeable. At times, you’ll get some serious competition, next, you’ll be seeing the main characters chug a bucket of shaved ice… yeah! It starts to get irritating when you get something that seems very filler-y when you should be receiving a tension. However, when they’re consistent with the tone, the lighthearted parts do work, but the more suspenseful moments (such as the Stride races) are even more entertaining. The buildup is okay and the way they incorporate flashback during more intense situations work well enough, except in the last episode. Also, this anime feels like a combination of shounen (getting better at something, the power of friendship) and shoujo (strong bromances, slight shounen ai vibes) tropes. The direction in the end episode felt lacking as there was absolutely no tension at all and it felt very melodramatic. \\n\r\nPresentation: 5/10\\n\\n\r\n~{Character}~\\n\r\nFor an anime that primarily focuses on the main characters and their interactions with each other, it is important to have good characters. Prince of Stride is mixed bag in this. The main protagonist of Prince of Stride is Sakurai Nana, who is the relationer (someone who signals the racers on their team when to start running, in order for two racers to make contact with each other) of the team. She ends up being one of the blander characters of the anime as she doesn’t have any traits that makes her stand out much. Next is Yagami Riku, who follows most of the clichés of an energetic, carefree character. However he stands out in the cast of characters well due to his more energetic personality. Next is Fujiwara Takeru, who is one of the more organized and quiet ones on the team. Then you have other characters like Hasekura, Kadowaki, Kohinata and Kuga, which don’t play that big of a role except for doing their best during stride races. Most of these characters, if not all, follow a fair share of clichés as mentioned before. And their character relationships are the cliché “nakama powers” for most of the time. At the end, the characters are enjoyable at times, but they are very, very cliché. \\n\r\nCharacter: 4/10\\n\\n\r\n~{Art}~, \\n\r\nThe art is pretty good for most of the times in Prince of Stride. Character designs (though you’ve seen designs like these before) end up being decent. The backgrounds do feel a little lacking at times, and the architectures (though for style) looks very simplistic. Many objects are just given a plain color texture and it’s a little disappoint, especially when Madhouse is behind this. However, the art style is great. It has this sort of vividness to it, but at the same time, the art looks bleached out. The color palette is purposely limited to those bleach out colors. This unique art style adds to the effect and works really well during Stride races. Although, the art style may not be the ideal one during its slice-of-life-y moments.\\n\r\nArt: 6/10\\n\\n\r\n~{Animation}~\\n\r\nProbably one of the better aspects of Prince of Stride, the animations for the most time is great. During the laidback scenes, the animations quality is just as good as your average school anime. However, when the Stride scenes happen, the animation quality boosts up. Even though in these scenes, for the most time you just see the racer’s torso moving around, but it done really well. The character movements are really well depicted and it really does feel they’re running their fastest. And when they do their parkour movements, it’s really fun to watch being the animations are top notch. The fluidity between character and object movement is very good. However, the animations in the final episode felt a little weak, since it took the easy way out. \\n\r\nAnimation: 7/10\\n\\n\r\n~{Voice Acting}~\\n\r\nThe cast they got for this anime is really impressive, as it’s filled with A-list seiyuu. Hanazawa Kana does Sakurai well. Her character isn’t very special, but she manages to do a good job with was she has. Then you have other well-known seiyuu, like Okamoto Nobuhiko, Ono Daisuke, Shimono Hiro, Ono Kensho, Suwabe Junichi, and Kimura Ryouhei, which all do a fine job at what they need to do, even if their characters are clichés. The seiyuu make the characters better than what they originally would be. Even the supporting cast is filled with well-known as really loved seiyuu, such as Sakurai Takahiro, Miyano Mamoru, Suzuki Tatsuhisa, Matsuoka Yoshitsugu, Hanae Natsuki, Okiayu Ryotaro, Eguchi Takuya and Ishikawa Kaito and they all do a good job… obviously! In the end, the great cast manages to do a good job with their characters, even though they could have done something great. \\n\r\nVoice Acting: 6/10\\n\\n\r\n~{Music}~\\n\r\nThe music is probably the strongest point in Prince of Stride. The OP, “Strider's High”, is fantastic. It’s super upbeat and catchy. It really sets the mood for the anime. It ends up being one of the best OP of the season. If you’re not going to watch the anime, at least listen to the OP. The ED, “Be My Steady”, really good as it’s really funky and catchy. Who doesn’t want to hear popular seiyuu sing together? The background music used is really good, especially the one used during the Stride races. The music used during those races are catchy, upbeat, and set up a tension and excitement for those scenes. Also the placement of those background music is great. Even the more slower music used for the “emotional” scenes are good too. \\n\r\nMusic: 6/10\\n\\n\r\n~{Enjoyment}~\\n\r\nAt times I really do enjoy Prince of Stride, but only at times. The Stride races are pretty enjoyable at times, because who doesn’t want to see a parkour version of relay? However, the final Stride race was very lackluster. The more slice-of-life moments, with the main characters interacting with each other is at times entertaining and at times frustrating, because in the end, all you’re seeing is clichés interacting with more clichés. The music and animations helped a lot, but they couldn’t cover the content much. The melodramatic scenes didn’t work well either, as it was hard to care about these characters. \\n\r\nEnjoyment: 5/10\\n\\n\r\nPrince of Stride is something that you’ll like depending on your preferences. Prince of Stride is cliché heavy, and isn’t very unique. It does stuff you’ve already seen many, many times from this genre. The characters have overused traits, filled with so many tropes. The art and animations stand out and the Stride scenes are pretty fun for most of the time. The music and voice acting is also really good. However, the ending is very lackluster due to poor direction. The epilogue hit too early and the final Stride scene couldn’t be more pathetic. And the melodramatic scene didn’t help either. In the end, Prince of Stride is all style and no substance. \\n\\n\r\n+ Good art and animations and most of the Stride scenes are really interesting \\n\r\n+ OP and ED are catchy and the background music is energetic and well-placed \\n\r\n+ Good voice acting due to a large A-list cast of seiyuu\\n\r\n- The story isn’t anything new and is cliché heavy\\n\r\n- The characters are filled with common tropes and are uninteresting\\n\r\n- Ending felt lackluster due to poor direction\\n\\n\r\nOverall: 5.4/10",
            "date": "2016-07-02T04:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 222756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586872.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/GoldenDevilGamer",
                "username": "GoldenDevilGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=222756"
        },
        {
            "content": "Likes:\r\nThe art was fantastic. It was my favorite part of the show. With bright colors and more realistic looking characters, you could really see the story in HD. I can't watch animes with odd styles (it distracts me from the story and characters), so this was tailor made for me. I really loved the character design for Riku. On the other hand, Hozumi looked too much like Armin from 'Attack on Titan', and Takeru was practically Haru from 'Free!' If you're trying to prove the likeness to 'Free!', you've got it.\r\nKuga and Heath's story was intriguing. They had a lot of backstory. And I lovedit. Their friendship and determination. The connection between the two. If anything, these two were 'connecting emotions', not anybody else. Throw in Hozumi's distrust and there's a hot pot of backstory.\\n\r\nI described 'Prince of Stride: Alternative' as parkour on crack. Though, it's more like free running. Free running follows a more artistic approach compared to parkour. Parkour's goal is to get around as fast as you can. That's why they have wall climbs and whatnots. It's easier than walking around the wall. This anime has all the basics of parkour or free running with double the running. It's an obstacle course really. The first episode really caught my attention with the jumps and flips the runners did. It was exhilarating. Live vicariously, you know?\\n\r\nDislikes:\\n\\n\r\nTakeru, Nana, and Riku all knew each other. And all have connections to Stride. But act like they don't. When Nana and Riku meet in episode one, they acted like strangers, but they knew each other. I felt like the creators just threw in the promise at the end to make you feel more for the trio, but all it did was annoy me. It was a subplot that no one cared to expand on. The quick shots of fireworks on the beach meant nothing. If you're adding this in, at least give it some depth.\\n\r\nThe plot revolves around the End of Summer games. If you look closely, there is a lot of time between each round. A few days would be fine, but a week or more is insane. You're giving the revived Honan Stride Club too much credit. If they were that good, they'd have practiced before. Anyways, didn't the show start at the beginning of the school year? They had more than enough time to get ready for the End of Summer games. They didn't need all the between EOS games training. I get the emotional block for Riku, but everyone else was in tip-top shape. Or did we skip the training between the beginning of the school year and EOS?\\n\r\nNana kept saying that Stride is all about 'connecting feelings'. Can I just say that's a bunch of baloney? Stride is about stamina and skill and balance and timing and about everything but connecting feelings. I didn't know why they needed a Relationer anyways. They could have handed off batons or even just high fives each other. Why did they need the Relationer, and by default, Nana? I thought that the creators wanted a female (because all the runners are seemingly male) who didn't run because that would take away the need for Kuga or someone. So the Relationer job was born. Nana was highly useless and didn't even need to be in the anime for the show to go smoothly. If you're trying to add in a girl, do it successfully or not at all.\\n\r\nAnd if we're talking about useless characters, take a good, long look at Ayumu. The cheerleader. He started out as a runner, but he ended up being a cheerleader and Hozumi's bae. (And that's another parallel to Free! Gay characters. Or, at least, fanon gay characters.) He had no use. I was getting tired of seeing him. Just take him out. Geez, is that so hard?",
            "date": "2016-06-20T07:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 221285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3573547.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wrenflyingaway",
                "username": "wrenflyingaway"
            },
            "url": "https://myanimelist.net/reviews.php?id=221285"
        },
        {
            "content": "prince of stride doesn't really stand out to me that much. it's plot follows that of a standard sports anime, and although there are a few differences, the plot can be deemed kind of boring. the art is okay as well, and the sounds aren't that bad. the opening and ending is one of my favourites.\r\noverall, i would rate it a 7, if not for one thing: the characters.\r\nthe characters are actually not bad, other than the fact that there is very little character development, other than the main protagonists becoming better and stronger. another thing that pulled down the score for it is theamount of characters implemented.\\n\\n\r\nin those short twelve episodes, too many teams were put into the anime. that was the part about it that made me really confused. i mean, yes, they are opponents of the main team, but the matches happened too fast and it seemed quite rushed. \\n\\n\r\nalthough prince of stride does not stand out to me that much, there is plenty of fanservice, and like i said before, the storyline is okay, so overall i rate it a 6/10.",
            "date": "2016-06-06T03:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 220104,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5449881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/soorumi",
                "username": "soorumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=220104"
        },
        {
            "content": "Quick Points\r\n-Great OP and ED\r\n-Solid art design and use of color\r\n-Lack of tension in races, due to a predictable story.\r\n-Unable to distance itself from otome game source material\r\nReview\r\nBefore I began to watch Prince of Stride I was cautious in my expectations, both positive and negative. Positive because the director of the series Atsuko Ishizuka, did such a great job with No Game No Life. Which stood out last year for its art design and color palate. However, Stride’s source material originated from an otome game (romance games targeted at women). This fact had me worried that the show would become a clone of a certainswimming show involving men from a commercial.\\n\\n\r\nThe art and style of this show is on point. The styling of the races and OP are reminiscent of Air Gear and Persona, using different textures to create a vibrant background involving all of the characters that filled the screen. Anticipation for each race is a result of how clean and polished the environment was. Everything from the obstacles, to the design of the large scaled font on the sides of buildings created some wonderful scenes. Making me yearn for more action in each race.\\n\\n\r\nBut that excitement was doused upon by Strides inability to present a race coherently. In early episodes, it was hard to understand the scale of the objects the runners were maneuvering around. Mainly due to the editing and the abundance of tight shots on the runners clearing the objects, the distortion that it created was frustrating. In later episodes this issue is less frequent, but the secondary annoyance is the decision to not provide the audience a layout or map or distance or anything really, to convey basic information about the area where the teams are running. There are quick cuts to a top down map on a screen, but the issue is unresolved because the shot follows the runners instead of pulling out to show them in relation to the map as a whole. The best that Stride can muster is the time difference between each leg of the race as members prepare to relay with their partners, but that information is slightly useless due to the fact that the audience is rarely given overall times or even the average time of each member.\\n\\n\r\nAll of that should make it obvious what the show is concerned with. _Stride _is a show that puts the relationships first and the competition second. There is nothing wrong with that focus in a sports themed show. One of the common tropes in sports anime is the childhood promise to win a big tournament, stating that you compete for your friends and not yourself, and the clash of two rookies who end up working well together. Stride hits all of those beats and more, but the balance of the show feels distorted.\\n\\n\r\nIt is hard to justify viewing Stride as sports show about running. While there is a framework for that is in place the running and training is just a device used to enable the students to participate in various antics, whether the students are modeling for a sponsor or going on a trip to their rivals -Galaxy Standard- training facility and throwing a beach party. Even though Stride doesn’t seem to fully embrace its otome game origins, it does not shy away from the potential male/male romantic pairings that are occasionally implied. Making the show awkward at times to sit through.\\n\\n\r\nStride in general is plagued with an attempt of trying to please a wider audience, but wounded itself in the process. There is the generic sports show about running, along with the romance (or “bromance”) created from the winking subtext of the relationships between members of the team. In simpler terms, it’s hard to enjoy the show as a whole if one of these aspects doesn’t appeal to you. Potentially leaving certain members of the audience disheartened when the show is unable to earnestly present enough of a race, or move away from the dreamlike world of male teenage bonding.\\n\\n\r\nIt is just fine if you enjoyed the show, I know there will be some individuals out there who did. But the if you are considering whether or not to watch Stride just be ready to come face to face with a lesser version of Free!.",
            "date": "2016-05-08T19:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 218192,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5374162.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/warptoon",
                "username": "warptoon"
            },
            "url": "https://myanimelist.net/reviews.php?id=218192"
        },
        {
            "content": "Story: 4/10\r\nTo be honest for being a sports anime is quite poor. At the beginning you think the girl is gonna be the main character and she ends up being a secondary one. The story revolves around the two main boys and their drama. Mostly the blonde one (I can't even remember his name) and his inferiority complex with his brother. They participate in this competition of stride, which is some kind of parkour sport, and after they solve the inner turmoil of the blond one, we are surprised to find both guys and the girl were childhood friends and they had made the promiseof winning that competition. Not cliche at all.\\n\\n\r\nSo, to sum it up, the whole story is one giant cliche after another. The sport looks interesting but the story is more focused on the boy and his brother.\\n\\n\r\nArt: 3/10\\n\\n\r\nI'm actually confused with the animation of this series. At some points the characters look nice, and others you just want to take your eyes out because they're completely out of proportion and in general terribly drawn. And after 12 episodes the scenes with poor animation are way more present than the good ones.\\n\\n\r\nSound: 8/10\\n\\n\r\nSurprisingly I found myself enjoying the music. I personally liked the ending song the best.\\n\\n\r\nCharacter: 4/10\\n\\n\r\nLittle to no development of most of the characters, apart from the main one. \\n\\n\r\nEnjoyment: 4/10\\n\\n\r\nAt the beginning seems nice but with each chapter it becomes more and more predictable and more and more boring.\\n\\n\r\nOverall: 4/10\\n\\n\r\nThis series was a whole disappointment. It can't even compare to other sports animes. The characters are extremely plain and no developed, the story is one cliche after another and the animation is terrible.",
            "date": "2016-03-26T16:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 214267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3754249.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Liliubel",
                "username": "Liliubel"
            },
            "url": "https://myanimelist.net/reviews.php?id=214267"
        },
        {
            "content": "Prince of stride: Alternative is a sweet, funny show with the right amount of emotions that perfectly balances the series. Its was one of the most anticipated show of Winter for me.\r\nPrince of Stride : Alternative falls in the same tradition as any other sports anime such as Haikyu, Diamond no Ace, Free, Prince of tennis and the list goes on. Its a series that will leave you completely restless with its beautifully animated hot characters ( a sports anime is basically incomplete without it ). Prince of Stride is about an imaginary sports, stride. The show has created its own sports that is perfectfor a sports anime.\\n\r\nIts animation is light and appealing. The art style is something worth appreciating. It is a sincerely funny show with a painful back story that makes the show even more interesting. I really loved the humor and comedy that was mostly character based.\\n\r\nThe show doesn't seems to be dragged much as I was seriously hoping to see long tournaments and a lengthy and climactic stride between the teams. The series seems to be piled up as much quickly as possible. And the series focuses more in the relationship between the characters than the sports itself but I really don't mind that. TBH I love serious sports anime more. \\n\r\nI loved the music specially the songs that were played during the the races. Its an important element for making the viewers to get deeper in the moment. The ending song has already become my Favorite\\n\r\nPrince of stride is an overall good series that i think had the capacity to become an overrated show but didn't reach that level of popularity mainly due to its lack of episodes. The show could have been made better in many ways",
            "date": "2016-03-23T06:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 213691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5281819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sinsoshi",
                "username": "sinsoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=213691"
        },
        {
            "content": "First of all, if I had to describe this anime to a friend in a really succinct way, I would describe it as being a \"shittier version of Free! since it has more cardboard for characters and less of a plot.\"\r\nI enjoy sports animes immensely and it's definitely one of the genres which I enjoy watching more/give higher ratings to. So when I heard that Mad House was making a sports anime, I was hyped. That coupled with the amazing voice actor cast this anime has, and I honestly had no doubts that I would at least enjoy it even if it turned out tonot quite meet my standards.\\n\\n\r\nI was wrong and I'm saying this as someone who did low-key enjoy Free! as a guilty pleasure.\\n\\n\r\nThe first half of this anime feels incredibly tedious. I was bored whilst watching and didn't find any of the comedy stuff funny at all. The first half focuses quite heavily on characters since there are quite a few character introductions. Usually I wouldn't have a problem with this but when your characters are pretty much cardboard, it's just a waste of screen time. I think it was around episode 8 for me when I realised that I was so apathetic towards all the characters that I actually didn't know any of their names. Obviously this is a major problem for any anime, but especially a sports one. An aspect which makes a sports anime so enjoyable to watch, is that you want to root for the characters/teams because they're likeable and you want to see them achieve their goal of victory. An especially good sports anime in my opinion will also have the side characters developed so you don't know who to quite root for... but in both regards, (of having both the main and side characters developed), this anime completely failed. After just finishing the anime, I can only recall the names of 4 characters max and that's probably me stretching it to be honest. I didn't root for anyone and I didn't care about anyone. The characters are quite literally just their character designs - 'pretty boys' so fujoshis can ship them together and probably write fanfiction about them.\\n\\n\r\nAlso, I'm not someone to question 'anime logic' but the realism of some the stunts displayed is practically non-existent. Don't get me wrong, I'm quite the fan of Prince of Tennis and KnB and both of those can be pretty ridiculous at times, but the ridiculous things which happen in those series can sort of be accepted because of how they are set up. In those series, the special moves which some of the characters do are sort of justified by, (all be it - complete bs), stretched physics logic/explanations. There is none of that here. A dude jumps from what looks like some cliff edge and lands on both his feet without breaking anything and continues to run without any sort of explanation? Oh he also swings around a flag pole a couple of times even though he's seemingly only ever been in the track club his entire life, not gymnastics or whatever. Sure anime sure. (Me nitpicking but it's something which personally bothered me.)\\n\\n\r\nThere were also some emotional conflicts some of the characters went through and some pointless backstory sort of crudely thrown in half way through which I felt didn't really add anything at all except maybe help some of the ships sail. Didn't care for these plot points at all and again, I was bored whilst watching these parts.\\n\\n\r\nThat being said, towards the end of the anime, I was getting some sort of enjoyment out of it. The races in the last few episodes I found myself actually getting a little hyped and I was actually looking forward to the final race... but then they ruined that too. How you think it's justified to NOT show half of the final race in favour of some shitty monologue is absolutely beyond me. Honestly I was appalled with how that final race was showcased and how the anime ended. When the entire goal of the characters, (and thus the anime), is to complete the End of Summer race and you don't even show HOW the race ended just the end result in a magazine? Absolutely dreadful.\\n\\n\r\nOkay so on to some of the few positives of this anime - nothing wrong with the voice acting. Just look at the seiyuu cast and that's not really a surprise. The OST was fine too and the track played during the races did it's job in getting me hyped. Not really a fan of the OP or ED but I don't think they're particularly bad, just not to my taste.\\n\\n\r\nIt's mad house so the animation is fine. Honestly, the blues and greens in this anime look absolutely beautiful to me. I'm not really a big fan of the sort of 'white-wash' look they have going on with the character's skin tones though... but again that's personal preference and possibly me just being nitpicky. Character designs are fine. Nothing too special about them but they're clearly suited for the demographic this anime is obviously aimed at - fujoshis.\\n\\n\r\nMy personal ratings for this anime:\\n\r\n- Story: 3\\n\r\n- Art: 7\\n\r\n- Sound: 8\\n\r\n- Characters: 2\\n\r\n- Enjoyment: 3\\n\\n\r\nSo overall I would give this anime a 4.",
            "date": "2016-03-22T14:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 213638,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1338789.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MissLovegood",
                "username": "MissLovegood"
            },
            "url": "https://myanimelist.net/reviews.php?id=213638"
        },
        {
            "content": "Prince of Stride: Alternative was a fun show to watch. It's not the best (it's pretty generic, actually) but it's a funny and exciting anime that you can watch mindlessly just to pass time. In other words, it's a sports anime.\r\nLike most sports anime, the story was not this anime's forte. A bunch of guys start a sports club in high school, participate in a tournament, fight and bond over some backstory drama and eventually win the tournament. This was just a summary of the entire plot of the series and anyone could have predicted this much based on the first episode alone, because thisplotline has been done to death. But in cases like this, the execution of the show is what makes all the difference, and the show had that part down. Running always makes things feel intense, so stride really fits the concept of this anime well. This kind of stories tends to be a safe bet, since there isn't much to mess up, so the story was predictable but good and well executed overall.\\n\\n\r\nThis anime is a visual novel adaptation, so I expected the characters to be just tropes, with the main heroine having almost no characteristics and being used as a blank space for the viewers to insert themselves into. This wasn't exactly the case. The characters did fall into certain archetypes (sometimes to the extreme) but they had a little more depth to them and most characters could not be described in one sentence (at least not without using the word \"but\"). But even though the characters still weren't great on their own, the interaction between them made the show a lot more fun to watch. The lighthearted shenanigans the characters did together were some of the funniest moments of the show and seeing them hang out with their rivals when they weren't racing was very refreshing. There was no actual villain in this show and it was really nice to see a truly friendly rivalry in an anime for a change. Also, the lack of romance actually benefited the show. It made the main heroine stand out a bit more as her own character and prevented the anime from becoming too cliched. There wasn't much character development in this anime, but when it comes to anime like this one, I'm satisfied with what we got.\\n\\n\r\nThe animation in this show was pretty average most of the time. It was very free-flowing during the races, which looked amazing and very intense. On the other hand, some frames were just plain bad sometimes. I did like the strong bright colors, the bold designs and the strong black outlines and shadows that made it look like the frames were inked by hand, but the animation wasn't a big standout overall.\\n\\n\r\nThe soundtrack was very good, actually. It supported the show well while not standing out too much, which is what I expect of an anime soundtrack. It was very fitting for the show and gave off the right vibe. The opening and ending songs were very upbeat and catchy. The random english words in the opening were really out of place, but the song was still fun to listen to and I didn't skip it once. The ending theme is sung by the rival team (who are also idols, for some reason), I thought it was quite nice.\\n\r\nThe voice actors did a very good job portraying their characters and it sounded like they were having fun. The biggest standout, in my opinion, was Kana Hanazawa as Nana Sakurai. Her portray of Nana was so realistic and it sounded like she meant each and every line. This further contributed to making Nana stand out as her own character.\\n\\n\r\nTo sum up: this anime might not have the best or the most original story, but the characters and the animation are decent. The ending was a bit anticlimactic, but still very satisfying. It was a very entertaining show to watch overall and if you're looking for an anime to watch mindlessly when you're bored, I recommend checking it out if you have the time.",
            "date": "2016-03-22T11:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 213605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/amystic",
                "username": "amystic"
            },
            "url": "https://myanimelist.net/reviews.php?id=213605"
        },
        {
            "content": "Okay. Here we go.\r\nStory - 3\r\nSo to start with the story. If you're a sports anime fan, you're probably used to all the cliches and have seen them a million times in all sorts of different sports anime, well let me tell you, Prince of Stride: Alternative was no different. It uses almost every cliche in the book. Not in an oh-this-is-kinda-refreshing way but in a haven't-I-see-this-a-million-times-? sort of way. Honestly. However, the title doesn't lie when it says 'alternative'. Prince of Stride is an anime centered around a COMPLETELY FICTIONAL and MADE UP sport, throwing any chance of being compared with an anime aboutthe same sport out of the window. Now that's novelty. I personally had high hopes in - only - this aspect of the anime; after all, how often do you get an anime that invents a sport completely for itself? The execution of the races themselves were actually acceptable (I'll go into detail in the enjoyment section) but I think the producers missed a teeny-tiny detail: If you're going to invent a sport, how the hell do you expect the viewers to know what it is?! I just binged all 12 episodes of the anime and I quite frankly still don't know the rules or point system of the sport. Heck, I didn't even know if there was a point system (A character mentioned 'extra points' but I didn't even know there was a point system in the first place! and it was never even mentioned again. Unless they meant it metaphorically but reeeaaallly now). Okay, like I said before, the idea of a completely new sport was what made me watch Stride and I believe that with more time to elaborate (I would suggest between doubling the number of episodes or even doing that and making another season on top of it by splitting the content in the first season up), it could have been a masterpiece and could maybe even have made it all the way up to Kuroko no Basuke and Haikyuu. But unfortunately, that's what they lacked: elaboration. One more new-ish feature in the anime is that it dives straight in to the thick of the plot and you can tell they didn't mean to do it when the timeline was planned out. It starts with the typical fallen club looking for members - the show decided to give less than an episode's worth of screen time to this but that was okay. What I mean is that there's practically no training. Well at least at the start, it plunges straight into the plot because what the hell's practice anyway and instead, puts it's practice into the second half of the plot, instantly killing the albeit forced momentum gathered by the dive at the start. I felt like the halfway point actually killed my excitement for the show. But that's enough of my ranting about the story.\\n\\n\r\nArt - 4\\n\\n\r\nSo the art. Nothing special. Looked like a cheap reverse harem anime (sorry!), to be perfectly honest. The style was bland and the characters lacked the realism that sometimes carries appeal (refer to any sports anime where everyone doesn't have idol-group hair). The background art was as plain as can be, especially when they should've had a lot of freedom in developing the settings because of the nature of the sport used in the show. In quite a few ways, the style for the characters reminded me painfully of an extremely washed out version of Free (refer to characters section). To be perfectly honest, I can only say that it didn't stand out as anything special like Doukyuusei, it didn't have amazingly drawn and choreographed action scenes like Haikyuu and it wasn't plain but enjoyable like Kuroko no Basuke. In short: It's bland. Probably like what it feels like to eat a tissue (don't question it). The best part of Stride's art is its action scenes, and even those sometimes don't really hit the spot.\\n\\n\r\nSound - 4\\n\\n\r\nThe voice actors were actually decent although they didn't really strike me as anything special. The soundtrack, like the background art, is just kinda bland. The opening was actually catchy and I quite liked it and the song, along with some of the other soundtracks, fulfilled their purpose of getting the viewer pumped up (I guess). The sound was not at all memorable (I can't remember any of the songs, including the opening) and they don't leave an impression, and there are even parts where I felt that a good OST would have boosted the scene by miles but it just wasn't really like... I don't know... Just kinda mediocre I guess? As a sports anime fan, I love soundtracks that really get your blood pumping as you watch your team score that point; or kick that goal; or shoot that hoop. But this just... I don't know... I was pumped sometimes but I don't give credit to the soundtrack or voices for that.\\n\\n\r\nCharacters - 2\\n\r\nOkay. I feel mean but at the same time I just couldn't being myself to rate this section any higher. I, however, don't blame it on the character designs (although I didn't like those too much) but on the lack of time instead. There just simply isn't enough time in the space of 12 measly episodes to make viewers become attached to characters. Of course, this anime just used the usual cliches: the forced crossdresser, the reluctant one, the emotionless genius and the emotionally unstable in the character you'd \"least expect\" but I was sooo annoyed at some of the characters plainly because I felt like they could've been better. I didn't understand the logic more than half the time and sometimes I even caught myself thinking: \"What could possibly possess a person to (insert whatever this rant is about)?!\" A bunch of family members do pretty confusing things and the character's reactions sometimes JUST DON'T MAKE SENSE. There's a lot of forced bonding and friendships that only feel that way because they didn't get sufficient time to develop. None of the characters got a satisfactory backstory so in the end, instead of having one or two likable and developed characters, we end up with about 25 odd bland, shallow, uninteresting and unrelatable characters. Now onto character designs in terms of art: they all had weird hair was my first thought. Second thought: Wait... Didn't I just see this character?? But anyways, to be honest, I felt like they ran out of character design ideas because of all the replicas I seemed to see where ever I looked. Actually... Wait a sec... Maybe everyone was a twin... Dun, dun, dun! Oh wait a sec... There was a pair of ACTUAL TWINS. But anyways, like I said, the art was bland and this didn't exactly affect the characters in a good way. In many ways, the characters were quite obviously made in a feeble attempt to appeal to the female audience, with the cute neko boy, the long haired stoic one, the emo kid, the glasses dude. Just generic. for those that enjoy shipping, there really isn't much inspiration and there are technically ships but they feel forced. But yes: lacking develop and design creativity. Any humour also falls so flat I don't even know. I hardly even smiled throughout the whole duration of the series, the jokes weren't bad they were just kinda like: Oh, that was a joke? Okay..?\\n\\n\r\nEnjoyment - 7\\n\\n\r\nOkay, to tell the truth, despite all the technical and story faults in this anime, I did legitimately enjoy it at some point; maybe I wasn't exactly in paradise most of the time, but there were still times when I had liked the show when watching it. This is where I say: I reckon this section of my review would be biased. So basically, I'm in high school and I run in competitive track events - 100 m, 200 m, relay and 3000 m. Do we get it? The thing is, there's a high possibility that my enjoyment of the show stems from having some sports background to connect with the characters. To tell the truth, the reason I enjoyed the show as much as I did were the races. It certainly wasn't a mistake to invent this sport because I was sweating when they were running and I was trembling as well as I heard the 'go' being said. For me, this really reminded me of all the 'ready, set, BAM's I've heard during my own races and I was SO PUMPED UP after watching the races. The show is a majority of tournaments so if that's what you feel like - a show where you don't really pay attention to the characters but it would get your blood pumping like in a real race, then this wouldn't be a bad choice as most sports anime focus on the characters more so that you grow attached to them and because of the characters, it gets you pumping. Other thing with Stride: I didn't have any worries about who would win. I usually always have a team/s but this time, I didn't feel frustrated no matter which team won because I just loved the races themselves (and because I could hardly remember the names of everyone because of the lack of character development). But a warning, the first races will probably be adrenaline full but the novelty of watching a fictional sport soon wears out when they put the training and stuff in the second half. This actually really ruined my enjoyment of the show because the second half was all about fitting in training that they didn't seem to need at the start of the show and character development that couldn't have been more forced, pointless, or fallen more flat. But my enjoyment of the races was still there and I wouldn't say no to re-watching the anime if a friend wants to watch it with me, just so I could feel that rush as I watch the races.\\n\\n\r\nOverall - 4\\n\\n\r\nThis anime was... Okay? I guess the characters sucked, the art was mediocre, the soundtrack was anything but outstanding and the story was poor. In the end, I gave this show a 'decent' overall score because of the novelty of the sport and because of my enjoyment of the races.\\n\\n\r\nRecommendation rate - 3\\n\\n\r\nIt really depends on who it is. I would love to recommend it to people who have a track background and like sports anime, but I wouldn't recommend it to anyone who doesn't have a prior connection to elements in Stride. I wouldn't recommend it to modern sports anime fans where the characters really take the main focus of the viewer's attention. So... If you're wanting to watch something 'alternative' and sporty, I guess it wouldn't kill anyone to watch this if you are desperate for a sports anime, but, take it from me, this is no masterpiece. But I definitely recommend watching some clips of the races beforehand (don't watch spoilers!) so you can get an idea of how much you like them (I had previously dropped this anime after not even finishing episode one, which means I didn't get to see a race, but then I watched an AMV and I thought, this looks really good, so I gave it a second try), if you thought, this is really cool! Then watch the anime. If you watched some of the races and thought: meh, this is fine. Then don't watch it. Because again, the races are really the redeeming feature of this show, the characters and the story aren't gonna boost it but actually drag it down so... Yeah.\\n\\n\r\nIf you're gonna watch it, have fun! If you decided it's not your thing, well good luck in your pursuit of another good sports anime! Thanks for reading my review ;)",
            "date": "2018-09-30T18:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 290560,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yuki-Nezu-Grimms",
                "username": "Yuki-Nezu-Grimms"
            },
            "url": "https://myanimelist.net/reviews.php?id=290560"
        },
        {
            "content": "Prince of Stride Alternative. I truly loved this anime. With fantastic themes of friendship, connecting emotions, and never giving up, it's truly wonderful. \r\nI've seen that a lot of the reviews for this anime are pretty bad, and I really don't understand why. No, it's not the best anime ever, not even out of sports anime's, but even if it's not flawless, that doesn't make it any less enjoyable. \r\nThe story is your basic sports anime story line, a team of high-schoolers getting together to become a team and set their sites on victory. \r\nThe art is very pretty, the Opening theme is great, andthe characters are adorable, and all very different. You really come to love each and every one of them.\\n\\n\r\nOverall, I think this anime is really good, and I think everyone should give it a try. I'm definitely glad I did. (And I really wish there was a season 2)",
            "date": "2018-07-03T11:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 282882,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399089.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kcitkat",
                "username": "Kcitkat"
            },
            "url": "https://myanimelist.net/reviews.php?id=282882"
        },
        {
            "content": "This anime is good and fun to watch. I feel a bit boring at the 1st episode since it just showing a very unclear backstory. But it got a lot better afterwards. I watched without referring any reviews nor playing their game. It has a good plot. If you like sweet friendship, bromance and sport, this is suitable for you. Forget all about bad reviews or harem game, just enjoy the show without looking at both factors.\r\nAdditional: Other characters are fine, but the only girl in this anime is really boring. I know they couldn't be dropped out this girl from anime since it basedon otome game (main girl), but she has no big role at all and boring boring and boring. That's why people are shipping man to man because there is no interesting in this anime. LOL. KnB, Haikyuu, DAYS have reliable girls on it (manager, coach etc).\\n\r\nDo I recommend this? YES (to people who love sport, bromance, friendship).",
            "date": "2018-03-06T23:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 273252,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6742126.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/arch_senpai",
                "username": "arch_senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=273252"
        },
        {
            "content": "I will admit, even though I don't watch a lot of sport-related animes, I'm extremely glad I decided to sit down for a bit and watch Prince of Stride and I'll share why I enjoyed it so much. Just a warning, some minor spoilers may exist below, but nothing that will ruin the anime for you or give away any major plot points.  \r\nTo start, one of the weakest parts of Prince of Stride is the story. While I'm not saying that its bad, it leaves a lot to be desired and is overall somewhat predictable when comparing it to other animes, regardless ofgenre. The Honan Stride club, the main group in the story, is a struggling team with dreams of becoming the best stride team, but of course, they lack members and talent. As the series progresses, they gain more members and each character has their own set of problems that \"prevent\" the team from truly coming together and conquering the other teams, which all gradually get resolved throughout the story. As said, it is rather predictable, but it is rather rewarding to see the team eventually come together to race together. \\n\\n\r\nSpeaking of the characters, one of the best parts of the anime is the characters, specifically the main group, which all receive their own satisfying development, something that was rather surprising for me as I went in fully expecting each character to be rather shallow cutouts of a specific anime trope. On the contrary, each one manages to showcase rounded personalities, especially Hozumi Kohinata, Ayumu Kadowaki, and Riku Yagami, who are able to carry the anime on their narratives alone. The only real exception to this is Takeru Fujiwara, who stays rather the same throughout but is still enjoyable to watch.\\n\\n\r\nIt was also interesting how each character's struggles felt relatable. Feeling like you're inferior, living in someone's shadow, showing jealousy, being vengeful, conquering your own fears, and defying expectations are just a few of the problems that these characters encounter. It becomes enthralling to see how these problems persist throughout the anime and how the characters are able to take their own struggles and turn them into strengths.\\n\\n\r\nAs for the music, this anime has both beautiful and intense music mixed together for an all around great listening experience. I'm gonna be honest and say that the music in the background during the races actually made my heart pump, as I was in suspense waiting to find out who was going to end up winning. The opening and ending are also great and fit the tone of the show perfectly. \\n\\n\r\nThe art flows well, and while there are some repeated frames during the races, nothing sticks out badly and everything seems to fit in perfectly. The art is also crisp, and nothing is stiff or looks badly, especially with the vibrant world around them. \\n\\n\r\nThe only real complaint I have about the anime is the second half of episodes compared to the first. The first few episodes have this intense atmosphere about them that really seems to die down near the second half of the series, especially the ending, but no spoilers here. \\n\\n\r\nOverall though, the anime was thorougly enjoyable and if you want a consistent story with relatable characters, especially if you're a fan of sport-related animes, then you should definitely give Prince of Stride: Alternative a watch. \\n\\n",
            "date": "2016-08-08T15:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 226259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5600921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PeruraitoAkoya",
                "username": "PeruraitoAkoya"
            },
            "url": "https://myanimelist.net/reviews.php?id=226259"
        },
        {
            "content": "Prince of Stride talks about a very original sport to the anime world, different from the common volleyball/basket/baseball, but let's give it a look to each of its parts: \r\nPlot [5]\r\nWell, when we talk about plot in a spokon we don't really have to think to something too complicated since it usually follows the standard of a team competing in a tournament and this show doesn't make an exception, so why have i considered this plot a bad one? \r\nThere were some episodes which could have been deleted and none would have noticed that, or better, they could have payed less attention to some eventsand more to some others.\\n\r\nAlso, the final was something unwatchable but i won't spoil it.\\n\\n\r\nCharacters [2]\\n\r\nCharacters were the thing i hated the most about this series, they were flat as hell and never changed their behaviour throughout the series, Sakurai Nana is the biggest example of this problem but also the main character was the same.\\n\r\nOne of the few, if not the only one, thing i liked about characters is that supporter characters weren't forgotten, any character will play an important role in almost every episode but..yes, since they were so badly developed i didn't consider this as a remarkable thing.\\n\r\nI blame this point to Prince of Stride because i think in a spokon characters are always the most important thing to make well and this anime failed overall in this.\\n\\n\r\nArt [7]\\n\r\nMadhouse did a nice job with Prince of Stride, the competitions were well represented by the direction. The thing i didn't like much was the chara design.\\n\\n\r\nSound [7]\\n\r\nAlso here we have a good technical equipment with a very energic opening and some very good OSTs which were one of the thing that made me enjoy this anime a bit more, the bad side is that we miss good ones for the common events but competitions won't miss them at all.\\n\\n\r\nEnjoyment [6]\\n\r\nI won't say Prince of Stride was horrible, i followed it without any problems but, as i said above, characters are the thing i care the most in sports animes and because of the poor development i couldn't relate to any of them nor make any of them like to me so i felt like they were acting just because they had too, for that reason i didn't enjoy it very much.\\n\\n\r\nOverall [5]\\n\r\nAs a conclusion, this anime is something you can skip without any problem but if you really like spokons then try to take a look at it since it also talks about a very uncommon sport that is new to the anime world, just don't expect any kind of deep plot/characters because you won't find them here",
            "date": "2016-08-07T17:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 226173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4612356.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FanteHS",
                "username": "FanteHS"
            },
            "url": "https://myanimelist.net/reviews.php?id=226173"
        },
        {
            "content": "Stride. A trail created by relaying trust and connecting emotions. Or, more specifically, a relay race involving five people, combined with parkour and obsactles through various enviroments. \r\nStory;3\r\nStrides story is a simple one, three people meet on the first day of high school. Two, with the intention of joining the renowned Honan High Stride club, and one who was forced into joining. These three are our stories main characters, and throughout the 12 episodes of this series, we see them grow as athletes, as people, and as friends. EXTRA emphasis on the friend bit. Advancing this group's friendship is a massive part of the story.as they work to their goal of winning the renown \"End Of Summer\" tournament. On their journey the race many times, getting just a little bit better every run. now if I made it sound better than I rated it, here's why. Strides story is ONLY what I said, there's not much to it. Race, get rivals, get better, repeat. And every god damn episode they spend half the time talking either about Yagami's (the character who was forced into it) brother who is the king of high school stride, friendship, or running. While all of these plot points are what drive the characters, it gets a bit too repetitive.\\n\\n\r\nArt:7\\n\r\nit looks decent usually, which is 75% of the show. But, when stride kicks in the art gets quite good, not amazing stuff but it took time and effort to make all of those complicated race courses, tracking shots, and a seemingly 3D environment. You can tell that plenty of time was spent animating this show, and none of it spared by CG characters. The character design is, well its good but its very cliche. however, it does fit the character types they set out, and everything looks pretty good so no real complaints here.\\n\\n\r\nSound:4\\n\r\nThe opening was... well it was pretty good and got the tone set for the show well, but the use of English was. Interesting to say the least, and i found it kinda broke the mood of what's actually a pretty good op. Background tracks, none of them really stood out to me, I didn't actually notice them there to be honest, which is a good thing! They blend in well and didn't break immersion. Actions scene tracks, there was one particular one that when listened to actually brings back the emotions of the show with it. which I consider to be a success in a musical sense. The ending track, it had a good groovy feel to it and showcased everyone's favorite rivals, Saisei High. The track had stylish animation to boot, and I would listen to it again.\\n\\n\r\nCharacters:3\\n\r\nLike I said previously the characters a VERY cliche. You've got your upbeat comedy relief duo who are more emotional than they show of nerd in glasses and a girly boy. A manly captain who cares more for his team than he lets on. Your long haired mysterious cool guy alumni that talks about the wind constantly. Your overly cheerful girl who always says Ganbare! And tries her best to \"keep up.\" Then your have your two main characters, the competitive rivals that get better because of each other. All very cliche and not much in the unique department is shown here.\\n\\n\r\nEnjoyment:6\\n\r\nNow while I wasn't a fan of most of the stuff this series did, and admittedly, I texted through half of it. But when everyone was running at their best, I'll admit I couldn't take my eyes off the screen. While the concept is unique, everything that was stride was just blah. But if you're into shows that showcase nice animation and rivalries, I actually think its worth a try. \\n\\n\r\nOverall:5\\n\r\nI kinda already did an overall in my enjoyment sections. But I think that I liked this show, even though I hate super cliche shows like this it wasn't THAT bad. give it a shot, but be warned, the show gives off some pretty god damn gay vibes. be careful.\\n\\n\r\nWith that i end my review, i hope i helped in some way on whether or not you decide to watch Stride. Thanks for reading if you got down this far and sorry for it being so long!\\n\\n",
            "date": "2016-07-05T12:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 223211,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3720517.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/extrananners",
                "username": "extrananners"
            },
            "url": "https://myanimelist.net/reviews.php?id=223211"
        },
        {
            "content": "The first time I saw this anime was in a thumbnail on youtube. The art style looked amazing, but I didn't have time to watch it back then (I think it was around the time when it just aired). Then my friend asked me if I saw it yet, the answer was obvious.\r\nI finally got around to watch it yesterday. The art style didn't dissapoint me at all, went past my imagination even. The characters seemed so lovable and relatable to me. I know that Riku's struggle with his self esteem was a widely discussed theme her, but I can see why. He was againstjoining their club the second he found out what club it was. I sure would have complained if the reason wasn't explained. His low self-esteem is also justifiable. As the younger sibling, I can relate, the non-stopping strive(or stride if somebody wants to insert a pun here) to be better or at least as good as your older sibling. It is very hard to best your older sibling at anything, beacause they have more experience, especially in something they enjoy doing. Besides, that is usually called character development that thankfully happened in this anime.\\n\r\nI also have to say that it was well paced. There were no boring parts as well as not those that went by too fast.\\n\\n\r\nI am content saying that I watched this anime in two days with a break for sleep. In my eyes, it really deserves recognition, because I have the tendency to drop the anime I am watching midway (or just after a watching session), then come back to it a few months later or forget about it. This anime made me want to watch each episode, not in the style of \"I want to just finish this\", but \"I really want to see it\". My rating for this anime is 10/10.",
            "date": "2016-06-18T03:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 221051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5394754.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SaberChasm",
                "username": "SaberChasm"
            },
            "url": "https://myanimelist.net/reviews.php?id=221051"
        },
        {
            "content": "First off I will say, that this anime was WAYYYY better than I expected. My friend suggested this to me, and it even exceeded his expectations. I refused to watch it at first, one because I thought it was yaoi, two because sports anime is specifically the one genre I haven't watched. That should tell you how good it was. I didn't refuse to watch it at first because of the trivial reason other people did, the people who gave it low ratings are just being oppositional. The music was was upbeat, it made me feel the determination of the characters. The opening was goodas well. The art was good, only complaint is how thin the characters were. I felt a connection with each individual characters, I rooted for all of them in overcoming their struggles throughout the anime. \\n\\n\r\nI think the opposite of all the haters of this anime on another thing too. They said the first few episodes were good, then they gave up because it became boring. That means they didn't even watch it all the way through, and gave up when a boring part appeared. I thought the reverse, the first few were slow and from about ep 6 on were perfect. After episode 6 I binged it, planning on changing to another anime by ep 8. \\n\\n\r\nI loved this anime, I am glad it was my first sports anime. This might be the thing that leads me to watch Haikyuu, and Free! I mean, I don't know about Free! Looks too yoai for me.",
            "date": "2017-11-01T19:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 262302,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6420498.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JayDeeThree",
                "username": "JayDeeThree"
            },
            "url": "https://myanimelist.net/reviews.php?id=262302"
        },
        {
            "content": "Hi guys, this is my first time writing a review and i feel kind of sad that it's about this anime, but the reviews at the bottom don't really give it justice with a 3 and a 4 out of 10 (but the guy below me's review is fucking hilarious) \r\nSo I am watching this anime with my boyfriend, so I'll do my best to give it from a girl's perspective and guy's perspective.\r\nGirl: It is like yaoi. I can see lots of fanservice. It's like Free! (which i didn't like very much) and the Uta no Prince Sama (which I did like). The racingis very exciting to watch. \\n\\n\r\nGuy: It's yaoi. I'm cringing half the time because of all of this gay shit but the race is still fun.\\n\\n\r\nHonestly, the concept of stride isn't that hard to understand. It's just relay race + parkour. I guess that there's parkour as obstacles to enable runners to use them to their advantage. For example, one might run in front of someone to block an obstacle from an opponent's view, or use an obstacle to jump past someone. You don't have to use obstacles to get a decent score, but again, it is just a prop to 1. make the anime look cool 2. make yourself look cool 3. to use to your advantage (or disadvantage if done wrong). There are only one or two characters that I like and the rest of them have their idiotic back stories and whatnot to make them seem like they're troubled and depressed and need some Stride in their life to make them happy again. It's a circle jerk and sausage fest to be honest, but it's not THAT bad. The addition of music to the race is really good (and their choice of music) but the opening song's lyrics are kinda dumb. Regardless, it's quite a chill anime to watch if you want to get hyped over a bunch of guys running. \\n\\n\r\nAlso. The girl sucks. Really. \\n\r\nGarbage. Hate the girl. \\n\r\n0/10 \\n\\n\r\nAnd you'll know which girl because there are literally no girls in the anime. \\n\\n\r\nStory\t: 6\\n\r\nAnimation: 6\\n\r\nSound: 5\\n\r\nCharacter:\t6\\n\r\nEnjoyment: 7",
            "date": "2016-05-23T20:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 219200,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tiffyleungg",
                "username": "tiffyleungg"
            },
            "url": "https://myanimelist.net/reviews.php?id=219200"
        },
        {
            "content": "Prince of Stride may be the most appealing anime this 2016 and I actually fell bait for it. Initially I didn't want to watch it but I was kind of forced to and actually enjoyed the first episode but as I was going along with it, then, well, the every hole starts to pop out.\r\nStory (6): Fair enough the story of Stride is pretty decent. It's your typical friendship through sports sort of show. Unfortunately, it's trying to show some sort of fanservice, with beautiful men and amazing legs. I dunno. The saving grace of the story would have to be its random bursts ofcomedy and recurring gags. The friendships were cute too but it didn't make me burst to tears or wipe away any snot from my nose. Sports anime should be riveting through its story. This didn't make it happen.\\n\\n\r\nArt (8): The art is definitely the reason why this show makes quite the impact.  It's beautiful, colorful with hints of cool tones and how can you not like beautiful bishie boys. The stride animations, the running and the tricks were pretty solid and I think that they pushed to make it at least work in order for it to be appealing to sports fans. \\n\\n\r\nSound (6): If we're talking voice actors, this show is peppered with all of my favorite seiyuus... Well, I LOOOOVE ALL OF THEM! But it was the only thing that was memorable. I don't remember the background music. SFX didn't seem to be a huge deal and I'd skip the OP and ED, though the OP is kind of nice.\\n\\n\r\nCharacter (7): The characters of this show are weird. Dedicated to their sport though and bloody entertaining, Ayumu and Kohinata. You know what? The reason I even finished this show was because of these two adorable cuties. If it weren't for them, I wouldn't have survived it. It's either I'll drop it or give it a really low score. But yeah. Like I said, there's so many seiyuus in this and so there are tooooons of characters because teams. you know. but they don't necessarily leave a mark. I'd be screaming when I hear a character speak because their seiyuus are my fave but other than that, I'd be disappointed by how little they actually got to do. They couldn't leave a proper impact.\\n\\n\r\nEnjoyment (6): There were moments were I would enjoy the show and then skip to certain parts. It's such a waste of time to be honest, so just skip some of the parts. I only enjoyed the running parts and the Ayumu x Kohinata duo but more than that, I'd say, it's a pretty shallow show.\\n\\n\r\nOverall (6): I think I've rated this pretty fairly. It was okay. Maybe you'd still like it. Personally, I didn't like it as a whole but there are bits and pieces that worked for me so I survived.",
            "date": "2016-04-01T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 215015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5288471.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jayvwrites27",
                "username": "jayvwrites27"
            },
            "url": "https://myanimelist.net/reviews.php?id=215015"
        },
        {
            "content": "First of all I'd like to mention that this is my first review , and since I'm not a native English speaker , I dont know how good I'll be able to review this anime.\r\nMAY CONTAIN MINOR SPOILERS\r\nSo... lets start...\r\nWhy do u watch anime? \r\nI watch it to spend my time and enjoy doing it , What I want in anime is to be interesting enough to keep me going , to be hyped or atleast thrilled about the next episode , Prince of Stride does this job quite well ( Because madhouse always does their job) , If that is your purpose in anime, better start watching! \\n\\n\\n\r\nStory - 7 \\n\\n\r\nIts isnt hard to understand what \" stride \" is , I'll leave it to you , the viewers to watch the anime , and understand what it is.\\n\r\nThe story of stride is a generic story used in some other sport animes although it starts differently it comes up to one of the MC's ( since Its a sport anime there are quite a few) having an event in the past that changed their view of the sport , later on they overcome it and  lead their team to victory or atleast try doing it , at first the anime seems passive but as u watch you notice tension between protagonists or , other characters...\\n\r\nI'll keep it short , Its a sports anime afterall , overall the story is a solid 7 it keeps u entertained throughout the anime.\\n\\n\r\nArt - 9\\n\\n\r\nAs expected of madhouse , in this department the anime beats most of the other sports anime I've seen. ( some of them are madhouse too so cant compare)\\n\r\nThe competition scenes are very fun to watch and I think that they couldnt be any better.\\n\\n\r\nSound - 10 \\n\\n\r\naside from a certain anime *cough cough* K * cough cough* this anime has the best soundtrack ... ever , The background music makes the anime enjoyable and fun to watch especially in competitions and races\\n\\n\r\nCharacter - 7\\n\\n\r\nSports anime will stay sports anime  , There is character development in this anime , although its kinda' like a 180 but I would'nt give it less than a 7 because its a sport anime, Two of the MC's will experience a big change since the start of the anime , and one of the MC's will stay dull but assist in changing the others , I would'nt have it any other way doe , This anime needs character to be like that , It just has to :)\\n\\n\r\nEnjoyment - 8\\n\\n\r\nAs I said at the very beginning whats important is that u enjoy the anime , Show interest in it , I feel that Its worth to watch and you wont be wasting your time , but rather spending it in joy.\\n\\n\r\nThank you for reading my review , \\n\r\nHope you enjoyed it and you will watch the anime!\\n",
            "date": "2016-04-22T11:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 216889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4178965.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Asylumtraums",
                "username": "Asylumtraums"
            },
            "url": "https://myanimelist.net/reviews.php?id=216889"
        }
    ],
    [
        {
            "content": "When it comes to sports anime there is something that all of them have in common, In fact that common thing is what in essence makes most of them such a pleasure to watch. Haikyuu, Hajime no Ippo, Kuroko no Basket, Diamond no Ace and pretty much every other Sports anime out there has it. Of course what I'm referring to is 'Passion', 'Energy' and 'Excitement'. By Energy I refer to the energetic nature of Sports anime, Any good Sports anime will make you feel energetic, lively and perhaps even make you perform a little exercise or so. This inherent quality that every sports animeso definitely possesses is what Stride misses out on. Now I don’t mean to say the whole ‘passion’ part is completely missing from Stride, The problem is that these factors are essentially downplayed and replaced by something different. This is and as the show likes to call it “Connecting Emotions”, This in essence is the main theme of Stride. The focus on this theme is what precludes Stride from showcasing the core themes of Sports anime and is the main downfall of the series as a Sport genre anime.\\n\\n\\n\r\nStride-The Sport\\n\\n\\n\r\nStride in essence is a hybrid of Parkour and Relay, Each team consists of 5 runner and 1 relationer (A person who gives commands to the current and next runner). Teams run on a specifically designated course that may range from simple free lanes to acrobatic courses where the runners perform flashy stunts. However unlike Relay where the next runner stands on the track itself, The subsequent runners in Stride start from outside the course and once the current runner begins to close in they run into the course and an on the fly exchange is performed (This is where ‘Connecting Emotions’ comes from). The duty of the Relationer primarily is to time the start of the next runner so he can meet up exactly when the current runner crosses the exchange area so they can perform the exchange.\\n\r\nIn my opinion Stride is All Style, Little substance, there is no real depth to the sport. I guess the whole ‘Connecting Emotions’ theme is used as an attempt to create some depth into the sport.\\n\\n\\n\r\nStory- Typical\\n\\n\\n\r\nStride is your typical Sports story, A team is formed and they aim to win a major sporting event of their sport. Nothing new to see here.\\n\\n\\n\\n\r\nCharacters, Interaction and Development – Fun but Melodramatic\\n\\n\\n\r\nNow for your information Stride is based on an Otome game so if you were wondering why there were so many BiShounen characters then you have your answer.\\n\r\nCharacter interactions are generally fun with your typical funny retorts with a fair amount of male fan service thrown in multiple places. However, it’s in these interaction that the main theme of the show becomes a problem, The whole idea of ‘Connecting Emotions’ is not used as an element to enkindle team spirit but as a catalyst for Melodrama. The characters often go full emo/angst mode over issues, Especially true for a certain character with an inferiority complex. Add a misunderstood backstory or something and you have more forced melodrama. Sometimes even simple conversations to stress certain points are made overly dramatic. \\n\r\nThe melodrama does eventually develop the characters to an extent and help them overcome their emo states but to be honest the development could have been handled in a much better way without the melodramatic overtone.\\n\\n\\n\r\nAnimation/Soundtrack – Vivid, Colorful and Good\\n\\n\\n\r\nThe animation is bright with a vivid color palette and works really well with the stylish flashy nature of the sport.\\n\r\nThe soundtrack didn’t stand out as exceptional to me but was pretty good, The OP is really catchy though.\\n\\n\\n\r\nEnjoyment -6\\n\\n\\n\r\nEvery Stride match is really flashy and can be pretty fun to watch, Some of the exchanges are really cool. When it comes to Style I feel Stride has nailed it but there is no personal touch to the sport or connection to the team and characters. The characters do claim that they like Stride with a passion but it often seems superficial and to just get a point across. This leads to the main pitfall in my enjoyment, I don’t feel excited, pumped, tensed, hyped or energized when watching Stride. Most of the time it’s just “That was cool”. There are no heroic, epic or sportive moments that just make you grin or shout like a madman, and that’s something most Sports anime are capable of making me do and Stride was incapable of. \\n\r\nAnother small issue with Stride is that a lot of the running takes place off screen and the main coverage is only for the exchanges and some stunts. As a Sports Anime I feel there is no real focus on the sport itself and that really brought down my enjoyment of the matches as well. The Slice of Life elements of the show however are well done.\\n\\n\\n\r\nShould you watch Stride?\\n\\n\\n\r\nStride is by no means a horrible show, It's definitely watchable but it's just average. \\n\\n\r\nAvoid Stride if you're looking for\\n\r\n[1] A Passionate Sports tale of our Main character(s) coming up in the world of their sport.\\n\r\n[2] Real focus and depth on the sport played.\\n\r\n[3] Exciting, Tense, Hyped and Energetic matches that make you wanna cheer out loud.\\n\r\n[4] Proper Coverage of the Sport played\\n\\n\r\nWatch Stride if you\\n\r\n[1] Don't mind melodrama and angsty situations.\\n\r\n[2] Wanna watch a light Sports themed anime without an in-depth focus of the Sport.\\n\r\n[3] Want Male fan service.\\n\r\n[4] Don't mind asspull/friendship victories.\\n\r\n[5] Wanna watch something Stylish and Flashy.\\n\\n\\n\r\nOverall - 6\\n\\n\\n\r\nStride's glossy nature is overwhelmed by it's melodrama and inability to provide and in-depth focus into the sport and uphold key sports anime elements. All this doesn't make Stride a bad show but it doesn't make it a good one either. \\n\r\nIf sports anime is what you have come looking for then there are vastly superior Sports anime out there and you should look one of them up, If that isn't what you want then try your luck with Stride, You might enjoy it.",
            "date": "2016-03-22T11:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 213606,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4360351.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lelouch0202",
                "username": "Lelouch0202"
            },
            "url": "https://myanimelist.net/reviews.php?id=213606"
        },
        {
            "content": "Prince of Stride: Alternative is an anime produced by Madhouse and was released in Winter of 2016 with 12 episodes. The premise is about Takeru Fujiwara voiced by ''Nobuhiko Okamoto'' and Nana Sakurai voiced by ''Kana Hanazawa'' trying to recruit members to their Stride Club of Honan Academy. What is Stride?, it's an extreme form of running and parkour involving 6 runners running relays throughout the town. Takeru and Nana request help from Riku Yagami voiced by ''Ryouhei Kimura'' to compete in the \"End of Summer\", thee top school competition for Stride in Japan. This anime adaptation is based off an otome visual novel andit shows!.\\n\\n\r\nNow LA will note immediately that LA isn't much of an anime sports fan, LA goes with some of the more \"irregular\" ones such as ''Saki'' or ''Walkure Romanze'' though LA watched ''Free!'' and it's second season. What a person who doesn't look at sports anime looking at Prince of Stride?, well there was one element that LA gotten into to watch the entire series but that will be for later. \\n\\n\r\nThe plot by all means is a typical \"underdog\" team with the goal to win a huge competition, from the asshole teams to the friendly rival teams they meet in one or two episodes to bringing us the team dynamic of the main cast from some of the team member's past and backstories to their own \"character development\" episodes are there, how they USE it however is actually an entirely different matter. LA says this as although it is focused and ''dramatized'' when it NEEDS to, the story does tend to fluff around during the middle of it and resolves ''some'' obstacles as quickly as the episode ends sometimes leaving no room for development. Ohh sure the entire main cast of Honan Academy gets focused and developed hugely both as a team and individually but by the near ending (for LA) you tend forget even some of the main characters NAMES and why they are there besides \"winning the competition\" as \"they are in the team so of course they have to participate\", but LA gets it, it's about the team...and three of your main characters, but the team nonetheless. \\n\\n\r\nWell LA is rambling on, let's actually move to the characters. The characters are by in large feels like an otome visual novel characters just mixed in with the typical characters you usually see in a sports anime. LA won't fault this anime for trying something like this and for the characters who get the most development get to be the most memorable thus Nana, Takeru and Riku are seriously the only characters LA remembered by the end of the anime as for the rival school characters?, besides the one or two that really matter to drive the plot forward, you'll forgot about most of them due to either the huge cast of characters as a whole for this series or the lack of ANY development outside their likes and quirks.\\n\\n\r\nWell you want to know why LA wanted to watch this anime all the way through?, the animation and to be more precise the animation when it goes into a match, that is the main reason why LA watched it, typical of Madhouse to make even running both fluid and exhilarating at the same time and LA loved watching it merely for that, on speaking of the animation, the character designs do look slick and fits into consistency when it needs to although some of it's animation do get slightly lower quality at times. \\n\\n\r\nThe ending actually felt lackluster and again LA will say that word again \"typical\" and what's worse is that considering that the match in question is built up so much, the ending result although heartwarming didn't leave the same as when LA first started getting into the Stride matches, what's the word \"rushed?\" is best. This anime does have some pacing (drum beat) issues from handling the drama when it occurred to just having filler episodes here and there, sure at least the comedy is the typical running gags from the main cast, but LA got bored from all the development, drama and filler shove into the anime and just wanted what the anime's focus was...the god damn Stride matches. \\n\\n\r\nOverall, this sports anime DID still entertain LA, it has it's faults and some faults were actually a GOOD thing (heck we all need character development and drama for the characters and plot no?) but La will say this about ''Prince of Stride'', if ya want to see an otome-ished typical sports anime involving running and parkour with Madhouse's animation, then this anime is something to run for, if not...best to walk this one out.",
            "date": "2016-03-22T15:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 213639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=213639"
        },
        {
            "content": "Prince of Stride is your typical sports anime, nothing all too special. It fits right in with all the others like it, but that's not a bad thing.\r\nWhile the story is like any other sports series where we focus on the team practicing and getting into drama amongst each other, the concept of the sport is unique. If anyone realized already, \"Stride\" is a fictional sport (a mixture of relay and parkour). One of the more positive things I can say about the show is the execution of the sport, which is also its strong point.\r\nOther than that, the backstory and drama has been donebefore, but it still fits in this case. Though, I will say some of these recycled plot elements felt like they are added there only to get emotion from the viewers. One in particular (which I will refrain from mentioning), brought onto us during the last few episodes, gave me that notion. Also, the series suffered from a rushed ending that had not much of an impact that it could have had.\\n\\n\r\nFor characters, I could only vouch for the Honan team (our main set of characters), because they are the ones we focus on the most. We also get their backstories, why they are on the team, as well as their personalities. Their opponents, not so much, save for one that appears more than the others.\\n\\n\r\nThe animation, at best, is adequate. It might come as a shock to many when they see that this is a Madhouse production. Still, I will not point fingers for not making the greatest animation (there's at least one with every studio). However, much like how the races are the strong point of the story, it is the same in regards to the animation.\\n\\n\r\nIn the end, like I said before, the series doesn't really stand out, even amongst all the other sports anime out there. Again, this doesn't make it a bad series, nor does it make it a good one. Despite that, I would still recommend this to people who are into sports anime. But, for me, it wasn't anything all that special.",
            "date": "2016-03-22T18:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 213657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=213657"
        },
        {
            "content": "Story (5/10)\r\nIt could be better but the ending creep the story. Madhouse rushed the ending. Well, atleast i scored the story 5 because this is otome games. Madhouse do a good job not making this as a romance. But the friendship is thingy is still creep me out.\r\nArt (6/10)\r\nTheir budget go to the music and seiyuu so don't expect the good animation so much.\r\nSound (9/10)\r\nSome reason why i complete the anime, because the good ost especially the end because of Mamo-chan (okay fangirling).\r\nCharacter (6/10)\r\nOkay until episode 11, they have a good character development. They do a good job to make me emotional on watching this.\r\nEnjoyment(8/10)\\n\r\nThere are so many fujo-bait that refresh my eyes. Aside from that, They have a good comedy. Also the seiyuu is make me enjoy watch this. A good material for fangirl. \\n\\n\r\nOverall (7/10)\\n\r\nSomething that make me stuck to watch this is only the seiyuu how can't you resist Mamoru Miyano Idol voice and Nobuhiko Okamoto stoic voice. I recommended to watch this if you search for material not a plot. Well, not the best sport anime for me but's it's still enjoyable\\n",
            "date": "2016-03-23T05:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 213685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4792516.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Deramora",
                "username": "Deramora"
            },
            "url": "https://myanimelist.net/reviews.php?id=213685"
        },
        {
            "content": "Let's start with a small summary of the anime : The anime is based around of stride, which is a combination of parkour and free-running, it's following the story of a club named Hônan stride and their goal is to win the EOS, simple right? However, the plot itself is weak and makes no sense.\r\nThe first couple of episodes were okay, it actually looked like this is gonna be a good sports anime, but it turned out to be otherwise after the 6th or so episode because you realise this anime has stupid plot which makes no sense. \r\nAll the characters have their own problem/backgroundbut the problem here is that it's not bad or something, it's rushed, the whole anime is rushed and you will notice it very well throughout the anime by half-animated races, rushed introductions and background story which makes the characters very lame to watch.\\n\\n\r\nThe art was not very flashy (as in outstanding/something new and not the light because it was certainly blinding) or something but they did mix it good with the running, so no complains here.\\n\\n\r\nA positive point about the anime are their soundtracks, i did enjoy their soundtracks and they were well made, if only the anime itself was a little better.\\n\\n\r\nOverall it's an mediocre anime, their biggest problem is that they rushed through things too much and tried to focus on the runs/background story which they also rushed through..\\n\\n",
            "date": "2016-03-23T12:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 213708,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1433931.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fantassy",
                "username": "Fantassy"
            },
            "url": "https://myanimelist.net/reviews.php?id=213708"
        },
        {
            "content": "Prince of Stride has such a kickass sport. The sport is running in the streets like a quasi-stunt person in a relay style, with perfectly timed “passing of the baton” communicated by a Relationer.\r\nThe art style:\r\nIt’s borderline blinding but makes the sport itself cooler by a factor of 100. As edgy as it may look, it puts the show into a “this is ridiculous and can’t be taken seriously” territory.\r\nThe characters:\r\nI guess a huge plus is that none of the characters seem to have annoying tendencies, but these characters can be summed up fairly easily too: they seem nice. With the rushed backstory and introductions,it can’t be helped that they feel one dimensional.\\n\\n\r\nThe story:\\n\\n\r\nWe have teams that run in a relay fashion with a Relationer that ultimately connects each of them. However the basics and techniques of the sport are never explained. I appreciate that the show tried to add some soul into running, but then it’s weak writing from there. For example, when we learn the reason why Kyosuke lost the right to be a member of the Stride club and his dark past- the reason was lame. This was made worse when it took like five minutes of the episode for Heath to man up, to give a supposedly deep speech, and for Kyosuke to join the club again. Zero tension built. I didn't even have time to be sad, haha.\\n\\n\r\nThe runs:\\n\\n\r\nOnly the two main characters have characteristic running styles, but everyone else? They. just. run.\\n\\n\r\nThe music:\\n\\n\r\nThe music score is comparable to elevator music- without it there would probably be some very awkward silences and even drier conversations.\\n\\n\r\nOverall:\\n\\n\r\nDespite all I’ve said, I realize this was adapted from a game so expectations must be low. Is it totally watchable? Yes, yes it is. I can see this as something for guilty pleasure. I mean if the guys and nice/easy music are what you like- then whatever makes your fries crisp! That’s probably enough of a reason to watch, cause why not!",
            "date": "2016-03-26T23:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 214312,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5150805.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Qissy",
                "username": "Qissy"
            },
            "url": "https://myanimelist.net/reviews.php?id=214312"
        },
        {
            "content": "After getting many recommendations for this anime I decided to watch it and I was pretty surprised to see so many bad reviews for it. Personally I thought it was a good anime. So normally sports anime over exaggerate the sport and how people feel about it and this one was no exception. They made the high five seem like the biggest deal ever like it was all about connecting feelings which it was just it was a little too dramatic. The characters in this story were nice. I love how they didn't make a fussy little female mc like they normally are. She wasalways trying to improve herself for the team, but it wasn't to the point where you would want to slap her in the face. \\n\\n\r\nArt- It was pretty good. It was colorful and bright and it set the mood of the anime really well.\\n\\n\r\nStory- I think they kept Riku's whole internal struggle going on too long. It was like they were using it as an excuse every time they got into a fight which was a little annoying. \\n\\n\r\nSound- It wasn't that noteworthy, not really good but not really bad either it was just kinda average. \\n\\n\r\nCharacter- It had nice character development in the end anyways. They really grow up and finally Riku accepts all the hard facts and everyone has a nice ending/ \\n\\n\r\nOverall- I loved the ending since they tied it up. All the popular anime try to keep you hooked by saying 'oh no we lost lets have another chance in the second season *wink wink* you should watch it and see if they win' this one they were just like ok this is this. It's the end. I read online too that this anime was actually a dating sim and normally anime based off of dating sims are super annoying since the mc is obnoxious af, but this one was focused more on the actual team, the players, and the sport and less about them all dying for her attention which was good for me anyways. So basically this anime had good humor, good characters, nice pacing, and decent art. If you like sports anime that they don't forcibly drag out and you can deal with the losses and internal struggles you'll probably like it. \\n\r\nThat's all thanks for reading ^~^",
            "date": "2016-03-27T11:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 214386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5292091.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kittycats468",
                "username": "kittycats468"
            },
            "url": "https://myanimelist.net/reviews.php?id=214386"
        },
        {
            "content": "I've been looking for an sports anime, but not an usual one about soccer or baseball. In the end I collided with \"Prince of Stride: Alternative\" and gave it a shot. As far as I know stride is a fictional sport, mostly comparable to a mix of relay and parcour.\r\nAll protagonists have their own little background stories, which result in the slice_of_life part of this anime. Not extremely deep but still good enough to create likeable figures. And let's be honest: With a basis of only twelve episodes it would have been almost impossible to draw out more of the main characters.\r\nSame case concerning thestory: not worldshaking but still interesting by revealing a few twists towards the end. Moreover the story doesn't appear rushed and fills the little amount of episodes perfectly. Watching the stride-races was undoubtedly exciting and enjoyable.\\n\\n\r\nThe lovely animations and character designs are the main strength of this anime. Very smooth and dynamic movements plus unusual strong, sometimes cartoonlike colors express an unique charm.\\n\r\nBy using powerful music the overall atmosphere of the anime is mirrored pretty good. While I liked the opening best because it set me in the right mood for the episode following, the ending rather appeared to be average and didn't really stand out.\\n\\n\r\nThe main topics of \"Prince of Stride: Alternative\" are quite similar to most of sports anime, since it's all about team spirit and faith and I think those topics are quite well implented. Another important part of the plot is \"running\" and \"running away\", which should be considered on different levels.\\n\\n\r\nWhat we deal with here in the end is an overall solid anime that is able to tell its story within only a few episodes. Nevertheless it has potential which could habe been used better if there were more than just twelve episodes. After all most of sports anime usually need more room for character development due to numerous characters.\\n\r\nI recommend this series, which I believe to be slightly underrated considering its good overall quality, to every sports anime fan.",
            "date": "2017-03-20T16:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 243055,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6078801.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Plinfa-Fan123",
                "username": "Plinfa-Fan123"
            },
            "url": "https://myanimelist.net/reviews.php?id=243055"
        },
        {
            "content": "Before you go on watching this anime, be warned, this is a very typical sports anime to say the least.\r\nI have just wrapped up the series today, and overall... I'm pretty pleased with it. \r\nStory: For those of you who have not looked into this anime at all, it is basically a story centered around a group of guys involved in a made-up sport called Stride, which from simple assumptions after watching the show, is basically a sport where a team of 5 runners race against another team relay-style, and are coordinated by another person called a Relationer. A lot of people have complained thatthe anime does not really go into detail about what Stride REALLY is and the technical details regarding it, and I can understand why that is a bit frustrating, but it being only 12 episodes and based off of a game, I wouldn't worry too much about it. \\n\\n\r\nAside from that, the story is just a mediocre sport anime story: A once great team for said sport, somehow loses all their reputation from an incident among the players, and the spunky freshman characters are the ones who bring everyone together in the pursuit of rebuilding the team. Overall, nothing bad, but nothing good either. I mostly just watched it for the racing. \\n\\n\r\nSide note: I have heard people complain about the fact that the actual races do not have much running shown in them, and more jumping and flipping over obstacles. You CAN say that they only do that for the racing scenes to look cool and actiony, but I think it's the fact that Stride isn't supposed to be your regular track&field type race. I think Stride was intended to be a sport that fused traditional relay racing and free-running/parkour.  If you have seen free-runners, the way they run is pretty close to how they run in the show. High steps and very powerful arm movement, and of course, running through obstacles. This isn't really something too important, but I just thought I'd mention it before anyone might criticize that aspect of the show. \\n\\n\r\nArt: The art I thought was very good! The colors are very bright and vibrant, and it can even be a little overwhelming, but the characters were drawn pretty and the animations of the running were also very well made. \\n\\n\r\nSound: Like the art, the sound also caught my attention. I really liked the opening of this anime. It had a very \"get pumped\" kind of feeling when listening to it, very similar to openings like from Haikyuu or Hajime no Ippo. Sports animes tend to do a pretty good job with that. Overall sound effects and BGMs were good. Nothing to complain about. They did a good job simulating the sounds of the runners. \\n\\n\r\nCharacters: Much like Free, the characters seemed kind of one dimensional so to speak, but were good looking! Each of them held their own personalities, following classic tropes (i.e. the Strong type, silent type, cute/loli type, etc.). I don't want to give too much away, but the characters do have very brief backstories and drama that adds a little bit more substance, but there wasn't too much depth to the characters. They're likable. Nothing too special. \\n\\n\r\nEnjoyment: Honestly, I really enjoyed watching this anime every week. As mediocre as it may be, I'm a sucker for awesome action/sports scenes, and I thought the idea of free-running relay races was really cool too!\\n\\n\r\nOverall: I would recommend this to someone who is just looking for an anime where they can enjoy more so the action than the story. There isn't all that much character development, but it does have great art and sound. Like I said before, I mainly just watched it for the racing. I'm very basic when it comes to enjoying anime, but if you're looking for something exciting, it wouldn't hurt to give this a try!",
            "date": "2016-03-22T21:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 213670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3180567.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LinguineZoo",
                "username": "LinguineZoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=213670"
        },
        {
            "content": "***THIS IS A SPOILER FREE REVIEW***\r\nPrince of Stride is a show that seemed to have shown so much promise in the early episodes but soon driveled out into a bromance, low intensity “battles” anime. I was waiting for that super intense, heart pounding race to occur; maybe in the second season?\r\nStory: 5/10\r\nSo the main thing you need to know about the show is this; highschoolers get together to run in “Stride” races against other highschools. The main characters Nana, Riku, and Takeru form the main core for the show to present itself with. The supporting cast is there and does a decent job butit's obvious that the show is appealing to a demographic that I'm not a part of. The bromance aspect of the anime is almost suffocating which would not be a huge issue IF it did not impede on the story of the anime. Literally after every race there is a plethora amount of bromance crap that clutters the closing minutes of every episode. Also the whole “We have to get better” aspect of the show was in my opinion not done very well. It seems like the Honan (main school) team just gets unbelievably awesome in the last 2 or 3 episodes out of nowhere. \\n\\n\r\nI wanted to like the show because the other elements seemed so great but all I was left with was an uninteresting friendship story that had lots of running in it.\\n\\n\r\nAnimation: 6.5/10\\n\\n\r\nI feel that I have to rate this harder than normal because it is MADHOUSE we are talking about. The studio that has brought us No Game No Life, One-Punch Man, Chihayafuru, and so many other breathtakingly beautiful anime have come up pretty short in the animation department. The scenes are fluid which is important in an action orientated anime but the art quality seems pretty disappointing. Character models and scenery seemed pretty lackluster especially when comparing it to No Game No Life (which I just finished re-watching). MADHOUSE can do so much better than this.\\n\\n\\n\r\nSound: 8/10\\n\\n\r\nThe music, soundeffects, and voice actors are pretty good in this show. Music seemed to hit the mood right on the tee, voice actors did a pretty good job expressing their characters, and the sound effects were very impressive. The element of wind, running on different surfaces, and landing on platforms/rails was spot on.\\n\\n\r\nCharacters: 6/10\\n\\n\r\nThe characters melded well with each other but unfortunately I just could not get myself to give any s***s for them at all. It's not that they were generic it's just the whole package of the anime just didn't hold my attention.\\n\\n\r\nOverall: 6.4/10\\n\\n\r\nIt's an average anime to be honest. It has a very predictable outcome, average character development, and sadly average action scenes. I was hoping that the ending would blow me away but the final race is quite the disappointment. If you are expecting something great like with other MadHouse anime then I would skip out on this one.\\n\\n\r\nEnjoyment: 4.5/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-16T00:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 247813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247813"
        },
        {
            "content": "I know that some people might not have enjoyed it, but to me, this anime struck me personally. \r\nStory:\r\nEnjoyable, although i do with it was on a longer scale and had more episodes with the competition being more spaced out.\r\nArt:\r\nLove the art style, nothing to complain.\r\nSound: \r\nNot my area, so I honestly can't say anything about it.\r\nCharacter:\r\nAlthough I'm not completely finished yet, I can tell that there's a good amount of character development and they were quite nicely thought out.\r\nEnjoyment:\r\nI could relate a lot to Riku, with having talent but always giving up. This anime made me feel, and that's why I enjoyed it somuch. It was one of the few animes that made me almost cry. And because I'm simple-minded in a way all the guys were hot so that's just a bonus for me.\\n\\n\r\nOverall, I can say that even if you don't like sports anime, this is for sure something that should be watched. Underrated anime in my opinion.",
            "date": "2018-03-31T19:22:00+00:00",
            "helpful_count": 0,
            "mal_id": 276086,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Emcakes",
                "username": "Emcakes"
            },
            "url": "https://myanimelist.net/reviews.php?id=276086"
        },
        {
            "content": "If you're looking for something to pass the time, look no further. Although it may seem that the characters may be a bit flat, and that this sort of sport anime has already been done, it is good to enjoy nonetheless. The combination of track and parkour is actually very interesting. I didn't expect a sport like that to be created! Additionally, the characters are lovable in their own way, even if they are just stereotypes/tv tropes. What gives them their uniqueness is how they treat their sport and running styles. Although the animation is not top quality, the art is very bright and colorful.I would definitely see this as a TV show being aired somewhere, and if you're not nitpicky on what to watch, stick with an episode or three and see how you like it.",
            "date": "2016-10-10T20:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 231554,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4986584.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tansyheart",
                "username": "tansyheart"
            },
            "url": "https://myanimelist.net/reviews.php?id=231554"
        }
    ]
]