[
    [
        {
            "content": "This review is meant to be relatively unbiased and contains no spoilers. This is also my first review and I hope it helps.\r\nSo here it is, the highly anticipated and rather unsurprising second season of The World God Only Knows. If you've watched the first season and enjoyed it then your opinion of the series shouldn't change very much if at all since the underlying aspects haven't been altered in any way. Readers of the manga will be pleased at how well the second season adheres to original story while offering only some small differences in context and doing well to maintain the design andexpression of each character. \\n\\n\r\nBrief Summary (no spoilers):  9/10\\n\\n\r\nOn a brief overlook of the story, we see that Keima and Elsie are still searching for and capturing loose souls that are manifesting themselves within the negative emotions of beautiful, distraught young women all around them. Keima still has to put on the charm and swoon these ladies to his favor in order to release these ghastly geists from their hosts so that Elsie can seal them away in a special jar and return them back to New Hell. The plot of the second season continues where the first one left off with only a few minor differences as each episode progresses. \\n\\n\r\nMy Thoughts:\\n\\n\r\nThis series is particularly interesting for a multitude of reasons. In some sense, it can be put into the category of being, at a glance, your typical harem-romance-comedy series with some supernatural twist... But it's not. If anything, this series drifts away from much of the standardized content floating around by keeping the characters relatively static throughout the story and emphasizing its thematic tones as the overall message rather than the plot itself. By this I mean that even though the romance factor is still an intrinsic part of the show itself, it's the understanding behind the ideology of each relationship which keeps the story unique and interesting to watch.This is prominently demonstrated by the girls who Keima conquers losing their memories immediately after some moral revelation has been achieved. \\n\\n\r\nKeima's philosophy regarding relationships and life itself is undoubtedly what makes this series so appealing to its fans. The way his beliefs revolve around the principles of dating sims is symbolic of how he ultimately desires a world without change and social convention where life follows a linear, logical path at all times. His rejection of reality and surroundings is not necessarily due to hatred for the world by personal animosity, but rather by distaste for the human condition as a whole and manages to remain impartial to it throughout his daily life. None of this affects him negatively aside from the social aspect, however. His application of sheer rationality to relationships with other people is something that is  demonstrated in a very creative manner by the author and is very enjoyable to watch. \\n\\n\r\nAnimation/Art:  9/10  \\n\\n\r\nThe animation quality is best described as being sharp and well-polished with few details being overlooked.The use of colors in each scene notably matches the mood of the characters or the situation which adds for a nice overall effect. Character design is one of the most crucial aspects for this series, particularly facial expression, and the producers did an impressive job on getting it as close to the manga as they could. There's a couple of situations where the fluidity of a character's motions are slightly \"off\" from one another, but it's often easily overlooked by either comedic relief or simply being too brief to even notice or care about. You can tell that a lot of money and hard work went into making the show look the way it does, and it's quite effective.\\n\\n\r\nSound:  8/10\\n\\n\r\nThe sound is above average in quality and serves the general purpose of adding to a comedic sequence or aiding in establishing the proper atmosphere and tone of a scene. The OP is sung by Oratorio this time around, and it's much to the same style as the first season although has more of a pop element to it. The voice acting is good for the most part\\n\\n\r\nOverall: 9/10\\n\\n\r\nThe second season of The World God Only Knows is a step-up in quality from the first season with all of the same characters and great dialogue techniques as before. The game references are still in abundance, as are Keima's priceless methods of getting the ladies to fall in love with him. If you enjoyed the first season, there's no reason why you wouldn't enjoy this sequel. If you're new to the series, it's obviously suggested to watch the prequel for further understanding of the overall plot. For now we'll just have to wait and see where the anime is going next. If it follows the storyline of the manga, things are going to get interesting. Can you see the ending?\\n\\n",
            "date": "2011-05-15T02:11:00+00:00",
            "helpful_count": 108,
            "mal_id": 37004,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473733.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Theraphosa",
                "username": "Theraphosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=37004"
        },
        {
            "content": "I can already see the ending... It's going to be AMAZING!\r\nThe second season has the same look and feel of the first season as our \"Capture God\" Keima continue hunting for lost souls with Elsea. The duo goes after 3 girls this season: A tsundere sporty, a cooldere classmate, and finally a student teacher! This season certainly poses bigger challenge for our heroes.\r\nThen, there is the second girl demon. With exposition not needed this season, two whole episodes and a filler dedicated to introduce her.\r\nOnce again, Keima's game logic is put to test in real life. The absurdity of his value is still funny asever, and the animation and sound do not disappoint in delivering the comedy.\\n\\n\r\nVisually, it has not changed much from last season. The art in this series is generic style drawn to perfection, and characters are as visually pleasing as they could possibly be. The level of detail, especially the eyes and lighting, may even have improved. Camera movements are dynamic in action scenes, and there is not a moment of boredom.\\n\\n\r\nOP song this season has lost the epic sense of the first season, but still accompanied by jaw-dropping overproduced opening animation that's nothing short of amazing. Voicing once again is right on, and perfect sound mixing with appropriate BGM playing on every scene.\\n\\n\r\nThe second season got off to a slow start with Kusunoki, the lone member and captain of girl's karate club. Her arc turned out to be very corny, but the 'Dragon Quest' recap in the first episode was absolutely magnificent. I would say it was a sign that the production staff has plenty of creativity left in store.\\n\\n\r\nNext up is Haqua, Elsea's former classmate. Instead of going after a set target, Keima helps her track down a loose soul she failed to capture. Haqua's character was rather dull, generic clumsy type, but this arc goes on to explain the consequence of letting loose soul grow, and further emphasizes the importance of what the main characters have been doing.\\n\\n\r\nChihiro arc is similar to Shiori arc from the last season, with slow, bittersweet youth drama. The direction in this arc was by far the best this season, and once again, they went with a different pattern. Instead of straightforward \"conquering\" her, Keima helps her conquer another guy. The ending was obvious, but I liked how they changed things up so this series doesn't feel as repetitive as it could've been.\\n\\n\r\nFinally, Jun's arc was the conquering of a teacher in training. The teacher is a stereotype teacher in popular TV dorama like '3-B Kinpachi-sensei'  or 'Gokusen', with high ideals about tough-love and trust, but things doesn't go like dorama for her. This arc had the best character development and a positive message.\\n\\n\r\nThe second season is not quite as good as the first, but it shows Keima and Elsea tackling the problems using different approaches. After two seasons, this series still feels fresh. A sequel is not announced in the finale this time, but I'll definitely see it to the end if it ever happens.",
            "date": "2011-04-12T00:11:00+00:00",
            "helpful_count": 82,
            "mal_id": 35961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35961"
        },
        {
            "content": "The World God Only Knows tells of the wacky adventures of Keima Katsurai, a kid who literally does almost nothing with his free time but play dating sims. Because he's so good as dating sims, he refers to himself as the “Capture God,” claiming that he can beat any gal game imaginable. Elsea, a demon from hell, mistakenly thinks that the specialty of the Capture God is to seduce real women, and enlists his help to retrieve lost souls; demons that hide in the hearts of women, and can only be retrieved by filling the emptiness in the woman's heart. Keima never actually *wants* tohelp retrieve the lost souls, but is forced to due to a contract that he has signed; if does not oblige to the contract, he dies.\\n\\n\r\n\tThis all gives an interesting twist to the “Monster of the Week” dynamic, in that instead of having the main character fight monsters every week, the series has him seduce women.\\n\\n\r\n\tThere's a nice mix of drama and comedy; most of the drama and serious aspects come from the emotional issues that the love interests face–whereas most of the comedy comes from the wacky personalities of Keima and Elsee. The transitions from dramatic to comedic scenes can be abrupt, but most of the time it doesn't feel too forced.\\n\\n\r\n\tDuring a comedic scene, the characters (particularly Keima and Elsee) often switch to a much more cartoony art style, which helps to add comedic affect. There's also a lot of shout outs to various media, which will probably warrant a chuckle or two if you manage to understand any of the references.\\n\\n\r\n\tThe two protoganists of Keima and Elsee, although actually quite likable, come off as a bit one-dimensional. Keima is a genius boy wonder who considers reality “a shitty game,” and Elsee is an adorable demon who screws-up at everything…and there's not really much else to these characters, as there is barely any character development throughout the series. This is justifiable in that the anime only covers the first 40 chapters of the manga, which as of this writing is an ongoing series with 174 chapters released. So when watching this 24 episode series, think of it as the beginning of a larger story than it's own standalone thing.\\n\\n\r\n\tThe level of enjoyment watching this sort of depends on how willing you are to suspend disbelief to the fact that Keima uses his knowledge to win the heart of a woman not once, but multiple times. The fact alone that Keima uses his knowledge of dating sims to win the heart of women will probably come as a little implausible. Nonetheless, it's interesting to see how Keima strategize, and to see *how* he uses his knowledge of gal games.\\n\\n\r\n\tWith each story-arc by itself, each of the heroine's love for Keima doesn't really feel forced or unnatural–especially when you consider that these are women who have their emotional weaknesses amplified by an infesting demon. Each love interest is quite likable, and goes through a fair amount of character development; its somewhat remarkable considering that none of these characters get more than three episodes of screen time.\\n\\n\\n\r\n\tOverall The World God Only Knows is a fun and enjoyable series, albeit one that might challenge your suspension of disbelief depending on how you look at it (although only a little.) It has a nice blend of drama and comedy, and manages to make good use of its premise. If you like romance-centered cartoons, you'll probably like this.",
            "date": "2012-01-27T21:35:00+00:00",
            "helpful_count": 57,
            "mal_id": 52693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/696003.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SNchan",
                "username": "SNchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=52693"
        },
        {
            "content": "And here we continue on with the second season of the anime that is really, more than just a mindless, harem, dating sim based, romantic comedy - it is also poignant in ways, surprising, delightful at times, and perhaps rewarding towards the end. The World God Only Knows - is the world that Keima is living in reality, or simply virtual, or perhaps a bit of both? Or is virtual reality just as real as the reality Keima is living in?\r\nTL;DR\r\nStory: 4/10\r\nArt: 8/10\r\nSound: 6/10\r\nCharacter: 7/10\r\nEnjoyment: 7/10\r\nOverall: 6/10 (rounded down from 6.25)\r\nGood points:\r\n+ Very funny and has good humour\r\n+ Good ED Theme\r\n+ One slight plot twistin the Chihiro arc\\n\r\n+ Very good character design with many variations\\n\r\n+ Strong male main lead\\n\r\n+ Good character growth\\n\r\n+ Some touching and emotional / romantic scenes\\n\\n\r\nBad points:\\n\r\n- Lack of overarching / engaging plot\\n\r\n- Lack of some coherence in the Nagase / Kusunoki arc\\n\r\n- Lousy OP Theme\\n\r\n- Lack of some important character development, especially in main characters\\n\r\n- Can be a bit boring towards the middle\\n\r\n- 2 filler episodes out of 12 of them\\n\\n\r\nStory: 4/10\\n\\n\r\nThere are 4 main plot arcs to the story, 1 of them being an encounter with Haqua and a gigantic loose soul, and 3 of them being the regular \"capturing\" of loose souls by making girls fall in love with Keima - Kusunoki, Chihiro and Nagase. Once again, there is a lack of an overall plot line, though Haqua does shed a bit of light on the extent of this \"loose soul\" capturing contract - 60,000 more - but this adds nothing to the plot whatsoever, neither does it actually give us an indication about whether the end is coming.\\n\\n\r\nThe first arc, Keima encounters Kusunoki - a martial arts / karate tough girl who is basically struggling to reconcile her feminine liking for kawaii things (like cats and clothing), with her masculine fighter training and background. Nothing very ingenious here, sadly. Keima himself didn't do much except take her out for a fun date which was honestly more for comic laughter than to drive to plot. In the end, Kusunoki resolved it on her own by \"fighting\" with her feminine side, eventually leading to an awkward compromise that, to me, didn't really solve the main problem. Perhaps this anime was created too long ago and the writers were still stuck in their own gender stereotypes - but yeah, this plot arc didn't shine too much. Also, Kusunoki randomly being \"forced\" awkwardly to kiss Keima at the end was very unconvincing.\\n\\n\r\nIn the second arc, Haqua comes in, and this is where things start getting interesting. She happens to drop by after failing to catch a loose soul, then gets Elsie's help to capture the loose soul - after quite a lot of cooperation and hard work. Keima doesn't really do much in this particular arc, which is actually quite good in my opinion, since it shows that the actual \"demons\" do have some ability to capture loose souls on their own - as long as the soul has not possessed anyone. There is also talk about how loose souls can possess even demons, and there is greater clarity about the difference between the civilized demons and the more \"wild / loose\" ones who wreck havoc on the earth - so that's some much needed plot development right there. (+1 to interest, +1 to depth)\\n\\n\r\nIn the third arc, we get another interesting girl - this time by the name of Chihiro. Everything about her is uninteresting - she's basically a wallflower / background character with no exceptional skills and nothing (basically, this character is someone the audience can empathize with the most). The plot for this one, however, gets a slight twist, which I thought was good, though it was kind of expected. Keima starts off trying to fill up Chihiro's heart by helping her to make her crush fall in love with her - but it turns out that Chihiro turns back at the last moment, and Keima is forced to make her fall in love with him instead. I also think that out of all the girls so far, Chihiro is by far the most \"realistic\" capture of them all. As an ordinary girl with no particularly special powers bestowed on her, she reacts convincingly to everything that Keima throws at her. (+1 for depth, +1 for coherence)\\n\\n\r\nIn the fourth arc, the final one, we have student teacher Nagase, who used to be on the school's basketball team captain - but disbanded the team after the members left the squad because Nagase was \"too passionate\" about basketball. I really didn't like how this arc played out because it really didn't make much sense. Nagase, as a teacher, tries to help Keima to get off his gaming during class - but she is convinced that this is because Keima is \"lonely\". Clearly, Nagase has not seen the interaction between Keima and Elsie and how they are always inseparable.\\n\\n\r\nAfter many awkward encounters with Nagase during lunch, in class playing games, Keima ends up going to watch a pro-wrestling match with Nagase - and he does so by stealing her seat, then making her share seats with him. First of all, you can't possibly fit two people there without disturbing the rest of the people watching, and second of all, how the heck did Keima even know that Nagase was going to some pro-wrestling match? I know Elsie has information on Nagase, but this is only limited to background info, interest, hobbies, and doesn't actually reflect what is going on in Nagase's calendar / notifications / planner right?\\n\\n\r\nAfter that match, Nagase does one last passionate thing in class before breaking down and heading to the basketball locker room, only to find Keima hiding inside her old locker - which is not only creepy, but almost impossible under any case. I'm not talking about whether Keima could actually fit inside, but if you check the time that Nagase had to reach the locker room and Keima, you would clearly see that Nagase had a headstart of around 30 seconds. Assuming both of them went directly to the basketball locker room - Nagase would have reached first, and there was no way that Keima could have squeezed himself into that locker in time, unnoticed, without leaving any traces such as an open door, a locker, or anything else whatsoever. Although to confirm this, we must have more information about how the \"dummy swap\" spell by Elsie actually works.\\n\\n\r\nIn any case, after Nagase was cheered up by her students, at the end, she probably had no reason whatsoever to go back and kiss Keima. This probably wasn't even part of the plan. Keima had no intention of kissing her or romantically proposing to her - and somehow he was just there at the right time so that the loose soul could be captured? It was very forced toward the end of this arc, I felt. \\n\\n\r\nWe're not even very sure if they went for the marathon in the end, because remember that Nagase signed all of them up without their permission? Firstly, is it really possible to sign an entire class up for a marathon without sufficient details like shirt sizes / NOK details / even making payment? Even if Nagase just used the school's database of students - she would have to fork out close to $1000 just to register the entire class. The anime also never explicitly said anything about Nagase cancelling the marathon or the class going for the marathon in the end - they really glossed over this plot point, didn't they?\\n\\n\r\nAs a whole, the story lacks quite a bit of depth, coherence, and only 1 of the plot arcs was actually very interesting. The rest were \"ordinary\" and were not very special compared to the previous captures.\\n\\n\r\nArt: 8/10\\n\\n\r\nQuality art.\\n\\n\r\nAnimation: 2/3 - The animations were spot-on, striking and very colourful\\n\r\nAesthetics: 3/3 - I really loved the cute theme\\n\r\nOP Sequence: 2/2 - Very well choreographed intro scenes\\n\r\nED Sequence: 1/2 - Nice, but could have been more interesting\\n\\n\r\nSound: 6/10\\n\\n\r\nOP Theme: 0/2 - Really bad. Stop it with those horrible English intros please.\\n\r\nED Theme: 2/2 - Really good, upbeat and catchy. Why isn't this the opening theme??\\n\r\nBackground Music: 2/2 - These were mostly classical, and were used in all the romantic portions of the anime. They suit the mood really well.\\n\r\nAdditional Themes: 2/4 - The comic / upbeat theme that plays at every start of an episode, the light hearted one, is really comfortable to listen to.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nOnce again, we will look at the main characters, Keima and Elsie, first.\\n\\n\r\nSince the first season, Keima has gotten slightly more used to all this catching real-life girls stuff that it's already second nature, and he's already accepted his fate that he pretty much has to embark on a new mission every time the detector goes off \"Doro doro doro...\" As a character though, he has grown slightly, as by the end of the anime, he starts to accept reality more - and says that there might be an \"ideal\" path along the very sad real world that he must find. Keima himself however, still doesn't have much of a backstory, and we don't find out much about any other sides / back stories to his character - as not much of his life other than gaming is shown, or perhaps his entire life is just games. Keima as character remains interesting though, especially in the way that he strategizes his captures, though most of it this time, may have just been due to dumb luck. (+1 to interest, +1 to growth)\\n\\n\r\nElsie, too, has not changed much. She's still her usual hyper-active useless self, and we honestly don't know much about her past either - save for the fact that she was a classmate of Haqua - but it doesn't tell us anything about Elsie.\\n\\n\r\nHaqua, a new character in this series, is also another \"tsundere\" type, but maybe less so. She does come with some backstory - a demon who aces all the theory tests back in school, through sheer hard work and determination, but when it comes to the real world, she falls flat and can't seem to replicate all the successes she had in the past - so that's good, and it really helps to explain her frustrations / dissatisfaction with her current situation. She isn't that interesting of a character though, and she also doesn't exhibit much growth. (+1 to depth)\\n\\n\r\nMoving on to the 3 main heroines, Kusunoki is another \"tsundere\", but this time, it's one that can really kick ass. Definitely one of my favourite character archetypes - the fighter girl - made famous by FFVII's Tifa, that shows that pretty girls can pack a punch that will send you flying across the room. Kusunoki show's some growth after doing girly stuff on a date with Keima, and also after \"embracing\" and \"accepting\" her feminine side. Kusunoki, in this manner has two sides to her, and makes her more multi-faceted than most other girls. (+1 for growth, +1 for uniqueness)\\n\\n\r\nChihiro, is the other less likeable character, that nobody likes and nobody dislikes either. She's just the stereotypically normal girl with stereotypically normal interests and dreams - but since she is this way, you can really empathize with this girl - how she always feels inferior to everyone else who can do things better than she can, how she loses to someone in every department, singing, sports, studying, looks, you name it. But she eventually grows out of this depressing state and moves on to decide to start a band, despite knowing that she sucks at singing, just because she wants to follow her heart. (+1 for growth)\\n\\n\r\nFinally, we have Nagase, the character that I'm not convinced would do so many crazy stuff just because she's passionate about trying to get others to agree with her / follow along with her or trying to \"help others\" in ways that are usually over-the-top and hence uncomfortable for many people. Her personality is actually very linear - sure she has an interesting back story, but it only goes to prove one point - that Nagase suffers from \"overdose of passion\" syndrome and can't understand that you can't impose ideals on other people.(+1 for depth)\\n\\n\r\nNagase isn't that interesting of a character either - and I thought that what Keima did with her was not anywhere near romantic enough to warrant that kiss at the end. All he really did was talk to her in a basketball court and told her to stop imposing her ideals on people, yet continue living out her own ideals for herself, and then it was straight cut to a scene where all her students came over to apologize and encourage her. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nI definitely enjoyed this comedy, once again, with so many laughs here and there and all the funny cutscenes with Keima explaining things to Elsie who always has that clueless cute look on her face :3 The humour is really very good and is one of the few things that this anime executes perfectly. (3 points for good humour)\\n\\n\r\nIn terms of romance, I would say that there were some touching scenes - especially the scene on the boat with Keima and Chihiro. That was probably the one that I felt the most emotions for. The other two kisses by Kusunoki and Nagase were too forced, so I can't give the romance bit too high this time around. Kusunoki going on a date with Keima was -slightly- romantic though, and it definitely was enjoyable to watch Kusunoki's reactions to cute stuff (2 points for romance)\\n\\n\r\nHowever, I have to say that there were honestly some parts of the show where I felt bored - mainly in the Chihiro arc where it seemed very circular in nature - like they were going nowhere, and the background music was so slow that it was making me fall asleep. Luckily, this was only for one of the arcs. (2 points for pacing)\\n\\n\r\nUnfortunately there were some filler episodes - namely episode 8 and 12, so I can't give it any bonus points.\\n\\n\r\nOverall: 6.25/10\\n\\n\r\nKami Nomi 2 seemed interesting, but as a whole, it was inferior to the first season. But I guess it's still necessary to watch because of the characters who will be become main characters again in Kami Nomi 3 - so it's worth watching if you intend to continue the series to season 3, which I believe will be the best out of the three.",
            "date": "2014-11-02T10:03:00+00:00",
            "helpful_count": 30,
            "mal_id": 167171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=167171"
        },
        {
            "content": "*Before you read this you should check out reviews on Kami nomi zo Shiru Sekai if you haven't seen the first season yet.\r\nI Love the Story, great story in my opinion, Love the Devil & Human Cooperation. Its an original story that i respect very greatly, this time around its even better, introducing a new devil to the anime. Haqua FTW :)\r\n9/10\r\nThe Art for this anime is spectacular, after watching a few more episodes of the series i changed my opinion on it. The animation is awesome in each and every episode i saw (excluding the first part of episode 1 but that was justfor laughs) Each and every episode has something new to bring to it. The backgrounds aren't 100% original but what can you do about it? Its hard for anime directors to make an original piece of artwork these days and i feel that Kami Nomi zo Shiru Sekai II does an amazing job at that.\\n\r\n9/10\\n\\n\r\nThe Sound was also okay, the Openings & Endings could've been better. I liked the first season's much better, but i can't complain. The soundtrack is the same as the first season with a few alterations.\\n\r\n9/10\\n\\n\r\nCharacters in this season, oh gosh its gonna be an amazing line up, starting up with Kusunoki Kasuga, followed by  Chihiro Kosaka, then Jun Nagase, and lastly my favourite of the season Haqua du Lot Herminium! =D The only reason why this category didn't recieve a 10/10 was because of Chihiro Kosaka, in my opinion she is the worst character arc in the series... wayy to bland of a character, not cutee, bad attitude and doesn't stand out at all.\\n\r\nvery enjoyable character excluding Chihiro Kosaka. \\n\r\n9/10\\n\\n\r\nEnjoyment - Very much enjoyable. You'd love this squeal to the first season. I guarantee that. It brings in a sort of refreshing aspect to the series introducing more problems, more information, better animation, better plot, and even more background. This time around, I'd say that this season is much more enjoyable than the first.\\n\r\n10/10 \\n\\n\r\nOverall I believe this anime series has carved itself into a category of its own, by portraying originality through the genres  Comedy, Romance, Shounen, Harem, Supernatural. Lots of laughs,  funny romance settings, and a story that i'd say is 100% in its own aspect.  If you've already seen the first season you'd know what i mean. The manga is absolutely amazing, Wakaki Tamiki has astonishing creativity and imagination with his work, if you love the anime, you should check out the manga as well.\\n\r\n10/10 Overall\\n\\n\r\nMuch more to look forward to since its just begun, I hope that this anime will become much more popular than it is today, and continue to entertain its viewers, as much as it does to me.\\n\\n",
            "date": "2011-04-11T19:08:00+00:00",
            "helpful_count": 21,
            "mal_id": 35943,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/467505.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aya-Brea",
                "username": "Aya-Brea"
            },
            "url": "https://myanimelist.net/reviews.php?id=35943"
        },
        {
            "content": "Alright guys I tend to keep my reviews short n sweet and spoiler free so without any a due lets jump on the wagon as I review Kami nomi zo Shiru sekai II, ( The World Only God Knows II).  Those who haven't seen the 1st season even thou this reviews spoiler free go watch it anyway cause its cool haha.  Lets unwarp this bad boy.\r\nStory: 9\r\n  Our hard core gamer Katsuragi Keima and our cute little worker demon Elucia are back to bring us some more GIRLS!!, opp,s, I mean season 2 yeah.  The story premise hasn't changed that much,we still follow the adventures of Keima-kun and Elucia as they try to capture demons, ( bad demons lol), that lurk in the hearts of pretty women.  The story pacing is great and well told over 12 episodes.  The comedy and romance is still there and its as charming as ever.  The funny chemistry between our two main characters keeps you itching to watch the next episode.  \\n\\n\r\nWord Rating: Yep I'm still a hopeless romantic\\n\\n\r\nArt: 9\\n\\n\r\nJust like my previous review I thought the anime artwork was brilliant basking in colour and had crisp clear character design.  Again I highly recommend watching in 720p or 1080p for immersive experience.\\n\\n\r\nWord Rating: Yep lets look at the Mona Lisa next  \\n\\n\r\nMusic: 9\\n\\n\r\nI got the soundtrack what more is there to say.  Hayato Matsuo's work makes an epic return here in the second season with some newer renditions of previous tracks and the older ones too.  The music really sets the tone of the anime and the sublime orchestral work always leaves me standing in awe.  \\n\\n\r\nWord Rating: Yep chuck on your Beats by Dre\\n\\n\r\nOverall: 9\\n\\n\r\nReally enjoyed Kami nomi zo Shiru Sekai II and had a great time watching every episode.  An anime exploding with fun, laughter, romance, magic, and will bring out the little kid in you.  To those who aren't accustomed to this sort of anime genre, just give it a go you might like what you see,  I know I did.\\n\\n\r\nPeace out ZEUS!        \\n\\n",
            "date": "2013-09-10T09:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 112499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3131511.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XiiLE_ZEUS",
                "username": "XiiLE_ZEUS"
            },
            "url": "https://myanimelist.net/reviews.php?id=112499"
        },
        {
            "content": "Yes you are right! Katsuragi Keima, the God of Conquest is back and is ready to track down and capture more loose souls or should I say more girls instead? It is just like the first season however the producers did a greater job on this one.\r\nHow is it better? First of all is the story. Things got more explained here. Another thing is that the animation is improved, as a proof, if you watched the first season, you can notice a big difference with Chihiro's appearance. Yes, the humor and the cuteness is still there. Plus, the harem is a bit better than theprevious season part which is another demon like Elci. \\n\\n\r\nSo in conclusion, if you are into the romantic comedy plus harem type then you would definitely like this anime. It is definitely a must watch.\\n\\n\r\nP.S. Season 3 is already green lit so better hurry so you wouldn't miss out the fun.",
            "date": "2013-02-14T17:13:00+00:00",
            "helpful_count": 10,
            "mal_id": 86801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1861758.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KandaSorata",
                "username": "KandaSorata"
            },
            "url": "https://myanimelist.net/reviews.php?id=86801"
        },
        {
            "content": "WATCH THIS ANIME YOU WONT REGRET IT EVER........................\r\ni wrote a review for the first season and all i explaind in that review was who exactly is KEIMA and how awesome he was and how he do things and how we can relate to him in many ways.I JUST WANT TO TELL  KONATA-CHAN WAS THE BEST FEMALE OTAKU(who is a well rounded geek who is awesome and has a solid personality and not afraid to say she is an otaku but actually very proud to be one and i love her because i love her)AND NOW I HAVE FOUND THE BEST MALE OTAKU yeah.....mywork is done ;3\\n\r\nSTORY-its the continuation where we left off from the first season and the moment its starts it brings a smile to your face that you cant stop no matter what.this anime has the most well planed plot line i have ever seen in a slice of life anime the rezone is- it has drama and comedy mixed together well in the correct moments so it bullied the suspense and anticipation for wanting more episodes also it has hilarious plot twists that you feel after watching the episode  \"i just have to re watch it again\"and i speaks from experience,for me comedy have to be comedy with a great solid plot with pure entertainment and this anime gave me what i want and i love keima!\\n\r\nART-it was very well detailed to the last school mate in their class and it was so cute and beautiful.every character looked so different thank god...when you see the characters they used some high tech stuff to make them look different from other anime and make them unique to this anime so its not dull at all you will wish ahaa..i wish i get painted like that it was that great.the background was so natural and was quality stuff.they weren't afraid to use colours and they made it worked so 10/10.\\n\r\nSOUND-I LOVED IT.....I LOVED THE FACT THAT THEY USED FULL ENGLISH SONGS FOR THE BOTH OP IN THE TWO SEASONS IT WAS VERY CATCHY AND DIDN'T LOOSE IT PURE HEART AS BEING JAPANESE  IT HAD SO MUCH MEANING AND A GOOD MASSAGE TO EVERY ONE WHO WATCHED IT.the sounds used it the anime was both funny and smooth also showed bit sadness at times IF I SAY IT SHORT IT HIT THE SPOT WHEN THE RIGHT MOMENT CAME.\\n\r\nCHARACTERS-for me i need a very good solid plot which have to be explain very well and have to be understandable also need to have common or not i don't care i need good characters they don't have to be unusual they just have to be delivering entertainment for any anime that i have watched AND THIS ANIME NAILED IT WHOOO HOO...i don't care if its horror,shounen,mystery i watch them all and i love them if they have a solid plot and awesome characters im a all rounded viewer and i never dislike any anime an this anime RENEWED MY LOVE FOR ANIME WATCH IT ITS ONE OF KIND MASTERPIECE also HOPING 3RD SEASON COMES SOON :3",
            "date": "2012-11-30T21:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 78766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1045865.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lakshika",
                "username": "lakshika"
            },
            "url": "https://myanimelist.net/reviews.php?id=78766"
        },
        {
            "content": "Review for Kami Tomi 2\r\n=============================================\r\nI have already posted a review for the first season and if you are reading this you are probably wondering if you want to continue this series or not.\r\n=============================================\r\nSummary of the Extended Review down below :\r\nStory : Similar to the first season, I personally enjoyed the first season more, \r\nArt : Same as the first season, Well done, No unique style though this is not a problem\r\nSound : Voices are done well (Japanese Dub) Sound Effects great\r\nCharacter: We get to learn more about our main character, We get introduced to more sub characters\r\nEnjoyment : Lack of Ecchi Scenes (Family Friendly) Funny,Connection to the characters. I personally preferred the first season.\\n\\n\r\n=============================================\\n\\n\r\nStory : Similar to the first season introducing more characters for our main protagonists to conquer, A new season full of new challenges. I personally would say I have enjoyed the execution of the first season more then this season, I personally enjoyed the range of different personalities that has been introduced in this season. 7/10 sad to say not as great as the first season (in my opinion). This great though. \\n\\n\r\nArt : Same Art style as the first season, like I said in my review of the first season, Similar to the art styles of many different animes, a Standard Quality as to say, Nothing unique, But like I said before \"If it's not broken,Don't fix it\".\\n\r\nAnimation is nice, clean and easy to understand. 8/10 is my standard score for generally well done animation. 10/10 are usually for the anime's that have their own unique art styles that work, (it gives the studio that sort of recognizable style)\\n\\n\r\nSound :(Original Japanese Dub) Good work done by the voice actors, the characters sound like they should,(as in the voice fits the look of the character).\\n\r\nThe sound effects are nothing special but they work. 10/10 \\n\r\n(May skim through the series again in the English Dub to rate it) \\n\\n\r\nCharacter : In my review of the first season I have said that the main character was mildly developed compared to the subs and I as a viewer felt more connected to the Sub characters. Though in Season 2, they have managed to develop our main character a lot more though not in the plain way of telling us more about him instead we are able to connect with the our main protagonist by watching his facial expressions and actions in reaction to the situations that occur. I personally like the way the developing was done, The sub characters are still as great as the first season, 9/10 \\n\\n\r\nEnjoyment : After watching the first season I was really looking forward to this one and it did not disappoint, Though I may say it may have been a little messy in some areas where some things are left unexplained, I have enjoyed it anyway. 8/10 scored the same as the first season, \\n\\n\r\nOverall : Story was executed similarly to the first one, The main characters have been developed a little bit more then how much was done in the first season, 8/10 as an Overall Score,",
            "date": "2015-03-26T03:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 183435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4478941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DjKagamine",
                "username": "DjKagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=183435"
        },
        {
            "content": "I was not planning on reviewing any anime, especially so soon after joining MAL, however I feel the need to share an opinion that I have not seen mentioned. Therefore, I submit a simple review with only one main point.\r\nKami nomi zo Shiru Sekai II is very much like its predecessor. Since so many others already have, I will not spend any time describing the premise. The art is strong and the music just as well done as the last season. Each arc follows the same pattern as the one before it, though each has a unique twist that makes it well worth watching. However,it is important to take into account the continuation of the plot as a whole. \\n\\n\r\nThe story of the \"God of Conquest\" began with a protagonist that was nothing more than a (highly-competent) dating-sim otaku. While each arc is a fun parody that sets up the delivery of an (arguably cliche, arguably touching) Aesop, it also acts as a building block for Keima's own character development. The first season established Keima's outlook on life. In the second season, however, we begin to see a change in character. As Keima helps each individual 'conquest' to face reality in their own way, he himself begins to perceive reality differently. \\n\\n\r\nNow, I feel that I would give away the most appealing aspect of the story if I were to describe all of Keima's development, so I'll leave it at this. Each arc in Kami nomi zo Shiru Sekai II follows the same basic pattern because they serve to illuminate underlying theme to the series: every person must eventually face reality; each in their own unique way. This series is extremely fun to watch, but the reason I recommend it is because I feel that it will eventually culminate with a more profound and touching message than any of its individual parts.",
            "date": "2011-12-19T18:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 49603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1061875.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Denoue",
                "username": "Denoue"
            },
            "url": "https://myanimelist.net/reviews.php?id=49603"
        },
        {
            "content": "Finally i've finished watching this second season.\r\ni hope this review is helping the new viewer. :D\r\nIn my humble review, this anime awesomeness is similar to the first season.\r\nthe good backsound and smooth artwork are this anime excess.\r\nbut I think, it would be better if this second  has a few \"element of surprise\" like new plot, or extraordinary methods to capture the 'loose soul\" and so on. So, i think the viewers would like these surprise.\r\nand I hope the next season (if there any) would be more fabulous and surprising.\r\nOverall this anime still one of the best anime that worth your time to watch it.\r\nplentyof it! :D\\n",
            "date": "2011-07-05T07:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 38700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/440771.jpg",
                "scores": {
                    "animation": 9,
                    "character": 0,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hvzfree",
                "username": "hvzfree"
            },
            "url": "https://myanimelist.net/reviews.php?id=38700"
        },
        {
            "content": "This is One of a Kind Series. Definitely worth watching! Don't matter what you prefer! I believe all will like this!\r\n(Based of first 2 episodes)\r\nStory: 9\r\nFor you that have seen Season 1, It's basically just a continuation. But don't stop here lemme explain why this Repetitive Story Pattern, doesn't matter and just makes it all awesome.\r\nStory\r\nKatsuragi Keima is stuck with a demon girl called Elsea. By a contract with Mr.Satan basically. They most cooperate to catch Loose Souls whom have hidden within Girls to fill their emptiness sides. To get the Loose Soul out of the Girls body, Keima must win their heart.\r\nKeima is aGaming freak and his favourite and area of expertise are Dating-Sim Games. He uses his knowledge from this games to win the girls hearts and when he succeeds, Elsea capture the soul.\\n\\n\r\nDid I forget to mention his collar stuck around his neck will kill him if he does not catch these souls?\\n\\n\r\nStory is awesome and super funny, every new girl is a new challenge, and in some episodes you just see Keimas weird absurd sides that will make everyone laugh.\\n\\n\r\nLast Season not much more happened. We need a little Drama to make this a 10. Something more! Which I BET we will see in S2!\\n\\n\r\nArt: 10\\n\r\nAs last season. Just outstanding. It's speechless, no flaws, backgrounds are very detailed and beautiful. School suits are awesome, even sub characters are well made. And main char are just superb. There is nothing at fault here.\\n\\n\r\nSound: 8\\n\r\n8?! WTF!? you think..\\n\r\nWell voice acting is definitely 10. The Opening Theme, lost it's epic touch.\\n\r\nIt's just more damp, it misses the energy and absurdity Keima gives us. Which is why this is an 8. Background music is epic and well done and will not disappoint you.\\n\\n\r\nCharacter: 10\\n\r\nDo I even haft to start?\\n\r\nEvery new girl in this series are at least as good as some Female Protagonist from regular series. Keima is a personality new to the Anime World and is nothing like it. His absurd gaming habit, his quick and well thinking, the conflicts he makes and get involved in is probably what makes us laugh the most and the comedy drama.\\n\r\nElsea is a demon with a cute and kind hearted attitude that wants the best for his master. Keima. With special abilities that helps him out or blows his mind.\\n\\n\r\nEnjoyment: 10\\n\r\nI CANT GET ENOUGH!\\n\r\nThis is epic. I'm just beggin for another episode. Even tho I want to watch them all in a row, since thats gives me more enjoyment. But I cant since it's so awesome. Basically!\\n\\n\r\nLast season. You saw a pattern. New girl, Lots of Fun stuff, Captured. And this repeated 4 times till the season ended.\\n\r\nEven tho its repetitive, it works since each new girl is like a new story in the main story. And the story is of the Highest Quality. It does not bore you even tho it sounds boring just of the word \"repetitive\".\\n\\n\r\nOverall: 10\\n\r\nThis is one epic anime and if you haven't watched this. Watch Season 1 first! Then continue right here with season 2. I seriously DONT want anyone to watch S2 before S1.\\n\r\nThe story amazes me and blows my mind as some other series how the writer even thought of this. it's at the level of Naruto, Bleach, One Piece and so on.\\n\\n",
            "date": "2011-04-21T13:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 36300,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400203.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cornholio77",
                "username": "Cornholio77"
            },
            "url": "https://myanimelist.net/reviews.php?id=36300"
        },
        {
            "content": "I simply must write this review. It doesn't matter to me if it's \"helpful.\"\r\nThis anime is just amazing (yet still only my 15th favorite!). A strait 10 star show.I'll be honest, it's not so fantastic of a 10 star anime compared to others, but it's 10 stars never the less.\r\nthe reason being...\r\nThe ending of the first season gave me goose-bumps. It was amazing, and I expected as much for the ending of the second. It was even better. While the end episode for th first season was of a better design, the final moment in the second season's end episode completely topped the first's.\r\njust... Wow!I really enjoy anime about otakuism and the like. This is the best one of that genre I've ever seen. And you can look at my list... I've seen a lot of anime. Sure opinions are different, but if I give it a 10 star rank, I guarantee there's no way it's not worth at least checking out.\\n\\n",
            "date": "2011-06-27T17:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 38392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/404440.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jety_Lefr",
                "username": "Jety_Lefr"
            },
            "url": "https://myanimelist.net/reviews.php?id=38392"
        },
        {
            "content": "Kaminomi Season 2\r\nStory:\r\nThe Second Season of Kaminomi is still on the same arc as it started on however is not as popular as the first, many say that the binding glue for Kaminomi was Kanon and as she is not featured as much it was not enjoyed as much, not to say that I didn’t enjoy it, it follows the manga fairly well and doesn’t diverge, the second season is still important as more is revealed as well as the long awaited new demon Haqua, we see a similar amount of girls as the first season and stays pretty similar to the settings of thefirst, this does cause some repetitiveness however the first arc is most likely one of the longest so it is understandable, all in all this is an ok anime, maybe not as good as the first but good if you want to continue the series and read the manga. \\n\\n\\n\\n\r\nAnimation\\n\\n\\n\r\nThe Animation in this season does not differ from the first is quite interesting because it shows certain types, firstly the eyes, there are two kinds of eyes in this anime the hawk eyes which are used mainly for boys and some girls who are either have tough or cold personalities. The other eyes are the moe eyes with are large and round and seen with most girls who have soft, cute, shy or moe personalities. The hair is also another key part, like most anime’s of its time it has little detail in the hair using mainly different shades rather than drawing detail into each strand the actual anime is quite good it use small amount of features and a large amount of digital shading which is clever although when the chibi’s are made it doesn’t work as well, otherwise this is very nice animation and the style although similar to other is still quite unique. \\n\r\n‘P.S I wrote what I wrote in the season 1 (on animation) review because there is not difference’\\n\\n\\n\\n\r\nSound:\\n\r\nThe sound and music is still a favourite for me in this anime as the characters still sing the ED’s which I find really cool and clever, Kanon doesn’t have much of a role in this season however she is still referred to at different points and her music is still in some of the episodes, other than this there is not much change in sound.\\n\\n\r\nMain Characters\\n\r\nThe second season is relatively like the first we are introduced to a new main character Haqua and she is the studious type who fails as life an obvious anime personality so this is nothing new, we have some new heroine all with a theme, karate, teacher and real world girl although Keima seems to have struggled with them all, we are also (as I said before) shown the backstories of some of the main characters, including Elsie and some of Haqua, Elsie backstory cleverly talks about the failure and how she was looked down upon in her society, whereas Haqua’s backstory talks about how hard she worked only to turn out as a failure so it is cleverly pointed out that Elsie was bad at school but good at ‘soul-catching’  and how Haqua was good at school but bad at ‘soul-catching’, I will now focus more on Haqua’s personality, I’m saying this now because she technically is not a heroine even though she had a loose soul in her which was removed by Elsie’s friendship. Haqua is a very proud demon, she works hard and tries to do her best in everything, some may find her slightly repulsive because of her proud and disbelieving personality however as the season continues she starts to come down to earth so to speak and even congratulates Elise. Not much else is talked about her other than that, now some changes have occurred in Keima, firstly he has come to terms with his job, he may not be happy with it but he has seemingly adapted to the situation (by playing more games in class) at the end of the this season Keima finally falls in love with a character from his game nicknamed Yokkyun, he sees he as the perfect gaming girl and begins to wonder that is such bad looking game can have such a nice heroine weather the real world can have a perfect route in which to take, However going back to the main part of TWGOK we look at the humour which is put in this as always they find a way to interconnect the humour so that it blends in with the theme of the episode and as always Keima gives his riddles of dating sims which of are many.\\n",
            "date": "2013-06-09T08:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 100439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2678357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animeno",
                "username": "animeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=100439"
        },
        {
            "content": "The World God Only Knows has continued to impress me over its two seasons, mainly due to its consistency. With its short story arc formula, I don’t think this anime will ever hit god-like status, but for me, week in and week out I had more fun watching this, than any other show this season.\r\nFirst let me say I had a great time watching this last episode. Like the first season’s finale, season two’s ending deals with Keima and his actual playing of games. \r\nSo, my thoughts on the season as a whole are as follows. Like I said, the show was consistently good. Iwould also add that the show, sort of surprisingly from its description, was pretty well-rounded, more so even in its sophomore season. There are romantic and supernatural elements of the show, but most importantly it seems to balance the comedic and dramatic parts pretty well.\\n\\n\r\nHowever, don’t add dramatic + romantic and assume the show will = deep. Besides some overtones of escapist behavior from the show’s lead, Keima Katsuragi, the show’s plot never becomes too heavy. While making it easy to watch the non-deepness is another reason the show will probably never crack my favorites list.\\n\\n\r\nSo, here are some more things I thought season two did well. For one it was paced really well. The last episode felt a little crammed, but the entire season prior had a nice flow to it. The second season, while having a similar pace as the first, seemed way less formulaic, to which I would attribute the introduction of Haqua.\\n\\n\r\nNo only was her story arc possibly the best, it really, really helped break up the season. If they would have never introduced her and instead, substituted a different generic-lonely girl, the show would, in my opinion, have gotten stale.  Along with Haqua were flashbacks of her and Elsie’s past in hell, which were one of the highlights of the season for me. Besides all the hot romantic kissing of course.\\n\\n\r\nThe production of the show is also very consistent. The show always looks great, from the character designs to the switch between normal and super-deformed, I always enjoyed looking at it. While not as beautiful as some of the new shows seen this season, the animation always seems to fit the story. Even Yokkyun, lol. The other production elements also seemed fine to me.\\n\\n\r\nI’m not a huge fan of opening/ending songs, but just the like the first season, the entire opening sequence is incredible (2D purists may disagree). One of my favorite openings of all time was from .hack//Sign where the characters sort of get digitalized into the game world and the opening this season had a similar feel.\\n\\n\r\nSo, I felt the pacing and production were very good. The characters themselves however, were just ok. We get much of the same from Keima and Elsie as in the first season, where to be honest, some growth could have really benefited the series. We also get much of the same from season two’s group of possessed girls, unless you count Haqua, who was more developed (story wise, not cup size). Based on completely shallow merits, I enjoyed the Jun Nagase arc more than the others, as she was an older woman (making it slightly dangerous) and ridiculously cute with her fist pumps.\\n\\n\r\nI will say in closing, adding to my thought on Keima and Elsie, I really wish they would have done more with them. A reader once asked if I was reading the manga, to which I replied I wasn’t. So my indictment about the lack of character development may have to be directed towards the source material. Several times throughout the season it seemed like Keima would have to face reality only to have plot take him somewhere else.\\n\\n\r\nElsie is one of my favorites, but she really got the shaft this season. Any plot or development regarding Elsie was pretty much brought on by Haqua and her own story. While she continues to be incredibly adorable, it would have been nice If Elsie had gotten her own episode or maybe a new magical/demon power to show off. \\n\\n\r\nSo, I enjoyed the season and after a short break, I’ll be ready for a season three. For a couple of its faults there’s nothing entirely similar to The World God Only Knows. I can easily recommend this to someone who enjoys some light romance with their comedy, to the occasional bishoujo fan (like myself), or to anyone who likes well-rounded, but not overly deep series.\\n\\n\r\n[Additional thoughts about final episode removed due to spoilerish tendencies: go to http://moemonster.com/2011/06/24/a-channel-episode-12-finale/ for full unedited review with Pics]",
            "date": "2011-07-06T12:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 38766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/495271.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KidKonseptual",
                "username": "KidKonseptual"
            },
            "url": "https://myanimelist.net/reviews.php?id=38766"
        },
        {
            "content": "I loved the first season of this anime, and I didn't have much expectations to the second season once a saw the cast of characters.\r\nThe second season starts a little slow, The first capture wasn't all that interesting in my eye's, althought the humor was all solid as ever and none of Kasuga's personlity or charm was interesting enough satisfy me. But once Haqua's arc began this season only got better and better, and it was finally Elisie's time to show her worth and that she isn't all the useless in a capture.\r\nChihiro's arc was the arc I was looking least forward to. But Ihave to admit it was the best capture until now and the far more interesting.\\n\r\nIn Jun's arc Katsuragi really had to use all of his date sim skills and brain power to capture her! And he never stop's impressing me with his timing and his use of words.\\n\\n\r\nSomething that did disappoint me a little is that Elisie didn't get more attention, something I was hoping for this season.\\n\r\nThat was the only thing that really disappointed me this season.\\n\\n\r\nAnd I was happy to watch that it wasn't really some boring filler episode's this season as in the previous one. And it was good watching Katsuragi's silliness and Elsie's clueless once again. And I'll be looking forward to season 3",
            "date": "2011-06-30T11:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 38509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441723.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Pera",
                "username": "Pera"
            },
            "url": "https://myanimelist.net/reviews.php?id=38509"
        },
        {
            "content": "This is my first review so sorry if im bad at this...anywho lets get stated.\r\nStory (9)\r\nI found this story to be quite enjoyable and it was definitely unique, or atleast to me. It was a fine comedy but the romantic part was a bit shaky at first. When i first saw this series, it was different kind of romance, but it was a great way to keep me into it.\r\nArt (8)\r\nA lot of anime series have similar art style, well according to me, and let they always are different from one another, but it is a minor change that doesn't really bother me. Art isn'treally a big thing to talk about, but it is no reason to not watch the series.\\n\\n\r\nCharacter (9)\\n\r\nI found the character to be quite enjoyable and changing a lot. Changing character isn't a bad thing because it shows that the characters might react different to certain situations then they may have earlier in the series. The characters in this series were something. We got a nice, annoying demon from hell, that catches other demons, that are evil. Then we got the main character who is person that is always caught up in his dating sims, but hate reality.\\n\\n\r\nOverall (9)\\n\r\nOverall i gave this series a 9. It wasn't one of the best series i have seen, but the series did grow on me about half way through the first season. I would recommend people to watch this series, especially if they are looking for unmatched main (and a lot of the time, supporting) characters",
            "date": "2013-03-11T06:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 89383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/parmbir21",
                "username": "parmbir21"
            },
            "url": "https://myanimelist.net/reviews.php?id=89383"
        },
        {
            "content": "I DON'T KNOW I JUST LOVE THIS SHOW!\r\nI READ THE MANGA, AND I'M WISHING THERE'D BE SEASON 4. I WANNA SEE KEIMA CONFESS HIS FEELING TO CHIHIRO.\r\nBUT, to be honest, I'd prefer Ayumi than Chihiro, but still it's a bad idea to date one of the host goddess hahaha.\r\ntherefore, I like Keima and Chihiro. THEY'RE OTP!!! hahaha\r\nI WANT TO SEE SEASON 4 SO BAD! PLEASE MAKE IT HAPPEN!!! :'D\r\nat first, I thought this show was suck, but then I enjoyed so bad.\r\nKeima is very clever, calm, and I don't know. I think he's kinda awesome!\r\nhe date with every different girls so easily with his knowledgeabout date-sim game. I wanna be like him hahahahaha.",
            "date": "2015-10-25T19:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 201996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Asch_Fabre",
                "username": "Asch_Fabre"
            },
            "url": "https://myanimelist.net/reviews.php?id=201996"
        },
        {
            "content": "Kami nomi zo Shiru Sekai II or (The World God Only Knows II) was more then quite enjoyable to watch, after finishing it with 24 hours I can say that the anime was more then enjoyable to watch, with the great amount of comedy spread throughout it and romance from the main story. The school life side of it comes out really well with character development but what really impresses me is that this is one of those second seasons to a show where I did not think it dramatically lost pace. It kept up with the story and didn't have some out right enragingplot twist. The MC's style of character, gamer, withdrawn from society also shows interesting ways of deducting evidence while still remaining in a calm, cool self  I only had one small problem with the show and that was it's repetition when it came to the conclusion to chapter the whole \"Knight in shining armor\" just make me feel like our MC actually cares about reality (even if it is only to save his own life)\\n\\n\r\nStill highly recommend it as a top 20 anime",
            "date": "2013-09-17T07:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 113217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/446476.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chazar_90",
                "username": "Chazar_90"
            },
            "url": "https://myanimelist.net/reviews.php?id=113217"
        },
        {
            "content": "The previous season of The World God Only Knows was pretty entertaining. It had a nice plot that combined romantic comedy with some shonen elements, had a cast of very likeable characters, a pretty good soundtrack, and excellent animation. I had a lot of expectations for the second season, and I was not disappointed.\r\nThe World God Only Knows is about a guy named Keima who has been employed by the devil to track down loose souls, which apparently only manifest themselves in teenage (though sometimes older) girls who have identity problems or something along those lines. Which makes sense, because teenage girls certainly are theperfect vessels for a demon to live out of. Angsty and emotional, I can understand why we don’t see any male characters being taken over by loose souls. But I digress. Keima is a gamer, specifically, a dating simulation connoisseur. He runs his own website about them as he beats a couple a day and is even asked for advice by dating simulation developers. Using this knowledge, he attempts to help the girls who have loose souls inside of them by filling the space the soul occupies with himself. He does this through pushing them through tough times and basically getting them to fall in love with him. When the loose soul leaves, Keima’s sister and demon buddy, Elsie, captures them.\\n\\n\r\nThe plot, as I stated in my first season review, isn’t exciting but it’s melting together both shonen and romantic elements makes it have a wider appeal to a wider crowd of people. As a fan of romantic comedies, I found it to be fun and I found the shonen elements to liven it up a bit and give it more flair.\\n\\n\r\nThat’s not to say that the shonen elements are really good. In a particular arc one of the loose souls winds up becoming ultra-powerful and this leads to a big fight. The fight wasn’t exciting, nor was this arc that great, but I admired the fact it was taking something that most people would think girly and made it appeal to guys looking for some action.\\n\\n\r\nThe plot is marked with two filler episodes like the previous season. This time, the roles reverse. The first filler episode is pretty good and funny, while the last one (the last episode) isn’t that exciting.\\n\\n\r\nThe animation is just as good as the previous season. While there were no metaphorical sections that really wowed me like last time, it still managed to have good character designs and smooth animation throughout.\\n\\n\r\nThe sound is the only place in the entire second season where I’m going to have to downgrade the points. This season suffers from a lackluster opening and closing, as well as no stand-out music during the show. Kanon does make an appearance with an uninspired song that lasts a few seconds, but otherwise she’s lost. I was hoping she would be in the background more so this season and her songs would play on radios or in stores for some added fan service, but she isn’t utilized and it leaves the show with a big hole in the sound department. Voice actors still play their roles well though, so sound isn’t bad, it just doesn’t shine quite as much as it did last season.\\n\\n\r\nIn the character department though, I found that this season had better heroines for Keima to conquer than last season. I felt that they were a bit more complex and different from what you typically see. The four of the first season were somewhat generic, but as I said, they had a reason to be. This season gives Keima a lot more of a challenge as the heroines aren’t conforming to his games as much. This really adds to the drama and makes the show so much more fun.\\n\\n\r\nThe two main characters are of course Keima and Elsie. As I said in my previous review, Keima comes off as a complete ass to Elsie, but is a genuinely nice guy to everyone else. Elsie is just plain cute and adorable and you want to hug her and have her as your little sister. She isn’t too deep, but she serves her purpose of being the complete opposite of a demon and the complete opposite of Keima well, as well as playing the role of little sister nicely too. She’s fun and funny.\\n\\n\r\nThe conquests start with Kusunoki Kasuga, a martial artist who is trying to suppress her inner female and act as if she were a male. Her character isn’t that complex but she is very likeable in her ideals. She doesn’t want to show weakness so tries to stay away from cute things and showing affection. She’s the weakest of the conquests of this season, but she is still much deeper and much more enticing than the four girls of the previous season.\\n\\n\r\nThe second conquest is Chihiro Kosaka, which is probably my favorite of all the conquests in the entire series. She’s just normal. She’s average at everything, she looks average, and she tries to quell that averageness by asking out and being rejected by every hot guy she sees. The metaphorical take on her feelings is not awe-inspiring or anything new, but it is good. Everything leading up to the end of her story arc is well constructed, and I thought that the end of the arc was really well done and came across as truly heartfelt.\\n\\n\r\nThe third and final conquest is Jun Nagase, a student teacher. This is the second best conquest of the entire series. Her plot and feelings won’t come across as truly understandable unless you have been a student teacher or know someone who has. She, like student teachers, goes in idealistic and wanting to help people. The problem is, nobody wants her help and she’s kind of in a place where she isn’t respected, no matter how hard she tries to be. It’s a fantastic arc specifically for those emotions that are rooted very much so in reality. She feels like a failure because she isn’t able to get the kids to respect her as a friend; they treat her more as an enemy and an adult than someone they can hang out with.\\n\\n\r\nSo all three conquests are great characters, Another character I need to mention is Haqua, another demon like Elsie who was at the top of her class but has become a failure. She’s a decent character and fun for the little time she’s around, but her past is a little cliché and her character isn’t as well made as the conquest characters.\\n\\n\r\nThe World God Only Knows II is actually better than its predecessor in almost every way. It’s wholly entertaining and surprisingly heart-felt at times. While it’s not deep, nor is it really that smart, it still maintains a good balance of different elements that combine into a very fun ride. It may not be the best thing out there, but it is a very good thing. It’s not bogged down by a lot of cliché. It’s sometimes smart, sometimes funny, sometimes dramatic, and sometimes romantic. It’s everything in a nice little package.",
            "date": "2015-05-22T11:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 188517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188517"
        }
    ],
    [
        {
            "content": "This review is meant to be relatively unbiased and contains no spoilers. This is also my first review and I hope it helps.\r\nSo here it is, the highly anticipated and rather unsurprising second season of The World God Only Knows. If you've watched the first season and enjoyed it then your opinion of the series shouldn't change very much if at all since the underlying aspects haven't been altered in any way. Readers of the manga will be pleased at how well the second season adheres to original story while offering only some small differences in context and doing well to maintain the design andexpression of each character. \\n\\n\r\nBrief Summary (no spoilers):  9/10\\n\\n\r\nOn a brief overlook of the story, we see that Keima and Elsie are still searching for and capturing loose souls that are manifesting themselves within the negative emotions of beautiful, distraught young women all around them. Keima still has to put on the charm and swoon these ladies to his favor in order to release these ghastly geists from their hosts so that Elsie can seal them away in a special jar and return them back to New Hell. The plot of the second season continues where the first one left off with only a few minor differences as each episode progresses. \\n\\n\r\nMy Thoughts:\\n\\n\r\nThis series is particularly interesting for a multitude of reasons. In some sense, it can be put into the category of being, at a glance, your typical harem-romance-comedy series with some supernatural twist... But it's not. If anything, this series drifts away from much of the standardized content floating around by keeping the characters relatively static throughout the story and emphasizing its thematic tones as the overall message rather than the plot itself. By this I mean that even though the romance factor is still an intrinsic part of the show itself, it's the understanding behind the ideology of each relationship which keeps the story unique and interesting to watch.This is prominently demonstrated by the girls who Keima conquers losing their memories immediately after some moral revelation has been achieved. \\n\\n\r\nKeima's philosophy regarding relationships and life itself is undoubtedly what makes this series so appealing to its fans. The way his beliefs revolve around the principles of dating sims is symbolic of how he ultimately desires a world without change and social convention where life follows a linear, logical path at all times. His rejection of reality and surroundings is not necessarily due to hatred for the world by personal animosity, but rather by distaste for the human condition as a whole and manages to remain impartial to it throughout his daily life. None of this affects him negatively aside from the social aspect, however. His application of sheer rationality to relationships with other people is something that is  demonstrated in a very creative manner by the author and is very enjoyable to watch. \\n\\n\r\nAnimation/Art:  9/10  \\n\\n\r\nThe animation quality is best described as being sharp and well-polished with few details being overlooked.The use of colors in each scene notably matches the mood of the characters or the situation which adds for a nice overall effect. Character design is one of the most crucial aspects for this series, particularly facial expression, and the producers did an impressive job on getting it as close to the manga as they could. There's a couple of situations where the fluidity of a character's motions are slightly \"off\" from one another, but it's often easily overlooked by either comedic relief or simply being too brief to even notice or care about. You can tell that a lot of money and hard work went into making the show look the way it does, and it's quite effective.\\n\\n\r\nSound:  8/10\\n\\n\r\nThe sound is above average in quality and serves the general purpose of adding to a comedic sequence or aiding in establishing the proper atmosphere and tone of a scene. The OP is sung by Oratorio this time around, and it's much to the same style as the first season although has more of a pop element to it. The voice acting is good for the most part\\n\\n\r\nOverall: 9/10\\n\\n\r\nThe second season of The World God Only Knows is a step-up in quality from the first season with all of the same characters and great dialogue techniques as before. The game references are still in abundance, as are Keima's priceless methods of getting the ladies to fall in love with him. If you enjoyed the first season, there's no reason why you wouldn't enjoy this sequel. If you're new to the series, it's obviously suggested to watch the prequel for further understanding of the overall plot. For now we'll just have to wait and see where the anime is going next. If it follows the storyline of the manga, things are going to get interesting. Can you see the ending?\\n\\n",
            "date": "2011-05-15T02:11:00+00:00",
            "helpful_count": 108,
            "mal_id": 37004,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473733.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Theraphosa",
                "username": "Theraphosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=37004"
        },
        {
            "content": "I can already see the ending... It's going to be AMAZING!\r\nThe second season has the same look and feel of the first season as our \"Capture God\" Keima continue hunting for lost souls with Elsea. The duo goes after 3 girls this season: A tsundere sporty, a cooldere classmate, and finally a student teacher! This season certainly poses bigger challenge for our heroes.\r\nThen, there is the second girl demon. With exposition not needed this season, two whole episodes and a filler dedicated to introduce her.\r\nOnce again, Keima's game logic is put to test in real life. The absurdity of his value is still funny asever, and the animation and sound do not disappoint in delivering the comedy.\\n\\n\r\nVisually, it has not changed much from last season. The art in this series is generic style drawn to perfection, and characters are as visually pleasing as they could possibly be. The level of detail, especially the eyes and lighting, may even have improved. Camera movements are dynamic in action scenes, and there is not a moment of boredom.\\n\\n\r\nOP song this season has lost the epic sense of the first season, but still accompanied by jaw-dropping overproduced opening animation that's nothing short of amazing. Voicing once again is right on, and perfect sound mixing with appropriate BGM playing on every scene.\\n\\n\r\nThe second season got off to a slow start with Kusunoki, the lone member and captain of girl's karate club. Her arc turned out to be very corny, but the 'Dragon Quest' recap in the first episode was absolutely magnificent. I would say it was a sign that the production staff has plenty of creativity left in store.\\n\\n\r\nNext up is Haqua, Elsea's former classmate. Instead of going after a set target, Keima helps her track down a loose soul she failed to capture. Haqua's character was rather dull, generic clumsy type, but this arc goes on to explain the consequence of letting loose soul grow, and further emphasizes the importance of what the main characters have been doing.\\n\\n\r\nChihiro arc is similar to Shiori arc from the last season, with slow, bittersweet youth drama. The direction in this arc was by far the best this season, and once again, they went with a different pattern. Instead of straightforward \"conquering\" her, Keima helps her conquer another guy. The ending was obvious, but I liked how they changed things up so this series doesn't feel as repetitive as it could've been.\\n\\n\r\nFinally, Jun's arc was the conquering of a teacher in training. The teacher is a stereotype teacher in popular TV dorama like '3-B Kinpachi-sensei'  or 'Gokusen', with high ideals about tough-love and trust, but things doesn't go like dorama for her. This arc had the best character development and a positive message.\\n\\n\r\nThe second season is not quite as good as the first, but it shows Keima and Elsea tackling the problems using different approaches. After two seasons, this series still feels fresh. A sequel is not announced in the finale this time, but I'll definitely see it to the end if it ever happens.",
            "date": "2011-04-12T00:11:00+00:00",
            "helpful_count": 82,
            "mal_id": 35961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35961"
        },
        {
            "content": "The World God Only Knows tells of the wacky adventures of Keima Katsurai, a kid who literally does almost nothing with his free time but play dating sims. Because he's so good as dating sims, he refers to himself as the “Capture God,” claiming that he can beat any gal game imaginable. Elsea, a demon from hell, mistakenly thinks that the specialty of the Capture God is to seduce real women, and enlists his help to retrieve lost souls; demons that hide in the hearts of women, and can only be retrieved by filling the emptiness in the woman's heart. Keima never actually *wants* tohelp retrieve the lost souls, but is forced to due to a contract that he has signed; if does not oblige to the contract, he dies.\\n\\n\r\n\tThis all gives an interesting twist to the “Monster of the Week” dynamic, in that instead of having the main character fight monsters every week, the series has him seduce women.\\n\\n\r\n\tThere's a nice mix of drama and comedy; most of the drama and serious aspects come from the emotional issues that the love interests face–whereas most of the comedy comes from the wacky personalities of Keima and Elsee. The transitions from dramatic to comedic scenes can be abrupt, but most of the time it doesn't feel too forced.\\n\\n\r\n\tDuring a comedic scene, the characters (particularly Keima and Elsee) often switch to a much more cartoony art style, which helps to add comedic affect. There's also a lot of shout outs to various media, which will probably warrant a chuckle or two if you manage to understand any of the references.\\n\\n\r\n\tThe two protoganists of Keima and Elsee, although actually quite likable, come off as a bit one-dimensional. Keima is a genius boy wonder who considers reality “a shitty game,” and Elsee is an adorable demon who screws-up at everything…and there's not really much else to these characters, as there is barely any character development throughout the series. This is justifiable in that the anime only covers the first 40 chapters of the manga, which as of this writing is an ongoing series with 174 chapters released. So when watching this 24 episode series, think of it as the beginning of a larger story than it's own standalone thing.\\n\\n\r\n\tThe level of enjoyment watching this sort of depends on how willing you are to suspend disbelief to the fact that Keima uses his knowledge to win the heart of a woman not once, but multiple times. The fact alone that Keima uses his knowledge of dating sims to win the heart of women will probably come as a little implausible. Nonetheless, it's interesting to see how Keima strategize, and to see *how* he uses his knowledge of gal games.\\n\\n\r\n\tWith each story-arc by itself, each of the heroine's love for Keima doesn't really feel forced or unnatural–especially when you consider that these are women who have their emotional weaknesses amplified by an infesting demon. Each love interest is quite likable, and goes through a fair amount of character development; its somewhat remarkable considering that none of these characters get more than three episodes of screen time.\\n\\n\\n\r\n\tOverall The World God Only Knows is a fun and enjoyable series, albeit one that might challenge your suspension of disbelief depending on how you look at it (although only a little.) It has a nice blend of drama and comedy, and manages to make good use of its premise. If you like romance-centered cartoons, you'll probably like this.",
            "date": "2012-01-27T21:35:00+00:00",
            "helpful_count": 57,
            "mal_id": 52693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/696003.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SNchan",
                "username": "SNchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=52693"
        },
        {
            "content": "And here we continue on with the second season of the anime that is really, more than just a mindless, harem, dating sim based, romantic comedy - it is also poignant in ways, surprising, delightful at times, and perhaps rewarding towards the end. The World God Only Knows - is the world that Keima is living in reality, or simply virtual, or perhaps a bit of both? Or is virtual reality just as real as the reality Keima is living in?\r\nTL;DR\r\nStory: 4/10\r\nArt: 8/10\r\nSound: 6/10\r\nCharacter: 7/10\r\nEnjoyment: 7/10\r\nOverall: 6/10 (rounded down from 6.25)\r\nGood points:\r\n+ Very funny and has good humour\r\n+ Good ED Theme\r\n+ One slight plot twistin the Chihiro arc\\n\r\n+ Very good character design with many variations\\n\r\n+ Strong male main lead\\n\r\n+ Good character growth\\n\r\n+ Some touching and emotional / romantic scenes\\n\\n\r\nBad points:\\n\r\n- Lack of overarching / engaging plot\\n\r\n- Lack of some coherence in the Nagase / Kusunoki arc\\n\r\n- Lousy OP Theme\\n\r\n- Lack of some important character development, especially in main characters\\n\r\n- Can be a bit boring towards the middle\\n\r\n- 2 filler episodes out of 12 of them\\n\\n\r\nStory: 4/10\\n\\n\r\nThere are 4 main plot arcs to the story, 1 of them being an encounter with Haqua and a gigantic loose soul, and 3 of them being the regular \"capturing\" of loose souls by making girls fall in love with Keima - Kusunoki, Chihiro and Nagase. Once again, there is a lack of an overall plot line, though Haqua does shed a bit of light on the extent of this \"loose soul\" capturing contract - 60,000 more - but this adds nothing to the plot whatsoever, neither does it actually give us an indication about whether the end is coming.\\n\\n\r\nThe first arc, Keima encounters Kusunoki - a martial arts / karate tough girl who is basically struggling to reconcile her feminine liking for kawaii things (like cats and clothing), with her masculine fighter training and background. Nothing very ingenious here, sadly. Keima himself didn't do much except take her out for a fun date which was honestly more for comic laughter than to drive to plot. In the end, Kusunoki resolved it on her own by \"fighting\" with her feminine side, eventually leading to an awkward compromise that, to me, didn't really solve the main problem. Perhaps this anime was created too long ago and the writers were still stuck in their own gender stereotypes - but yeah, this plot arc didn't shine too much. Also, Kusunoki randomly being \"forced\" awkwardly to kiss Keima at the end was very unconvincing.\\n\\n\r\nIn the second arc, Haqua comes in, and this is where things start getting interesting. She happens to drop by after failing to catch a loose soul, then gets Elsie's help to capture the loose soul - after quite a lot of cooperation and hard work. Keima doesn't really do much in this particular arc, which is actually quite good in my opinion, since it shows that the actual \"demons\" do have some ability to capture loose souls on their own - as long as the soul has not possessed anyone. There is also talk about how loose souls can possess even demons, and there is greater clarity about the difference between the civilized demons and the more \"wild / loose\" ones who wreck havoc on the earth - so that's some much needed plot development right there. (+1 to interest, +1 to depth)\\n\\n\r\nIn the third arc, we get another interesting girl - this time by the name of Chihiro. Everything about her is uninteresting - she's basically a wallflower / background character with no exceptional skills and nothing (basically, this character is someone the audience can empathize with the most). The plot for this one, however, gets a slight twist, which I thought was good, though it was kind of expected. Keima starts off trying to fill up Chihiro's heart by helping her to make her crush fall in love with her - but it turns out that Chihiro turns back at the last moment, and Keima is forced to make her fall in love with him instead. I also think that out of all the girls so far, Chihiro is by far the most \"realistic\" capture of them all. As an ordinary girl with no particularly special powers bestowed on her, she reacts convincingly to everything that Keima throws at her. (+1 for depth, +1 for coherence)\\n\\n\r\nIn the fourth arc, the final one, we have student teacher Nagase, who used to be on the school's basketball team captain - but disbanded the team after the members left the squad because Nagase was \"too passionate\" about basketball. I really didn't like how this arc played out because it really didn't make much sense. Nagase, as a teacher, tries to help Keima to get off his gaming during class - but she is convinced that this is because Keima is \"lonely\". Clearly, Nagase has not seen the interaction between Keima and Elsie and how they are always inseparable.\\n\\n\r\nAfter many awkward encounters with Nagase during lunch, in class playing games, Keima ends up going to watch a pro-wrestling match with Nagase - and he does so by stealing her seat, then making her share seats with him. First of all, you can't possibly fit two people there without disturbing the rest of the people watching, and second of all, how the heck did Keima even know that Nagase was going to some pro-wrestling match? I know Elsie has information on Nagase, but this is only limited to background info, interest, hobbies, and doesn't actually reflect what is going on in Nagase's calendar / notifications / planner right?\\n\\n\r\nAfter that match, Nagase does one last passionate thing in class before breaking down and heading to the basketball locker room, only to find Keima hiding inside her old locker - which is not only creepy, but almost impossible under any case. I'm not talking about whether Keima could actually fit inside, but if you check the time that Nagase had to reach the locker room and Keima, you would clearly see that Nagase had a headstart of around 30 seconds. Assuming both of them went directly to the basketball locker room - Nagase would have reached first, and there was no way that Keima could have squeezed himself into that locker in time, unnoticed, without leaving any traces such as an open door, a locker, or anything else whatsoever. Although to confirm this, we must have more information about how the \"dummy swap\" spell by Elsie actually works.\\n\\n\r\nIn any case, after Nagase was cheered up by her students, at the end, she probably had no reason whatsoever to go back and kiss Keima. This probably wasn't even part of the plan. Keima had no intention of kissing her or romantically proposing to her - and somehow he was just there at the right time so that the loose soul could be captured? It was very forced toward the end of this arc, I felt. \\n\\n\r\nWe're not even very sure if they went for the marathon in the end, because remember that Nagase signed all of them up without their permission? Firstly, is it really possible to sign an entire class up for a marathon without sufficient details like shirt sizes / NOK details / even making payment? Even if Nagase just used the school's database of students - she would have to fork out close to $1000 just to register the entire class. The anime also never explicitly said anything about Nagase cancelling the marathon or the class going for the marathon in the end - they really glossed over this plot point, didn't they?\\n\\n\r\nAs a whole, the story lacks quite a bit of depth, coherence, and only 1 of the plot arcs was actually very interesting. The rest were \"ordinary\" and were not very special compared to the previous captures.\\n\\n\r\nArt: 8/10\\n\\n\r\nQuality art.\\n\\n\r\nAnimation: 2/3 - The animations were spot-on, striking and very colourful\\n\r\nAesthetics: 3/3 - I really loved the cute theme\\n\r\nOP Sequence: 2/2 - Very well choreographed intro scenes\\n\r\nED Sequence: 1/2 - Nice, but could have been more interesting\\n\\n\r\nSound: 6/10\\n\\n\r\nOP Theme: 0/2 - Really bad. Stop it with those horrible English intros please.\\n\r\nED Theme: 2/2 - Really good, upbeat and catchy. Why isn't this the opening theme??\\n\r\nBackground Music: 2/2 - These were mostly classical, and were used in all the romantic portions of the anime. They suit the mood really well.\\n\r\nAdditional Themes: 2/4 - The comic / upbeat theme that plays at every start of an episode, the light hearted one, is really comfortable to listen to.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nOnce again, we will look at the main characters, Keima and Elsie, first.\\n\\n\r\nSince the first season, Keima has gotten slightly more used to all this catching real-life girls stuff that it's already second nature, and he's already accepted his fate that he pretty much has to embark on a new mission every time the detector goes off \"Doro doro doro...\" As a character though, he has grown slightly, as by the end of the anime, he starts to accept reality more - and says that there might be an \"ideal\" path along the very sad real world that he must find. Keima himself however, still doesn't have much of a backstory, and we don't find out much about any other sides / back stories to his character - as not much of his life other than gaming is shown, or perhaps his entire life is just games. Keima as character remains interesting though, especially in the way that he strategizes his captures, though most of it this time, may have just been due to dumb luck. (+1 to interest, +1 to growth)\\n\\n\r\nElsie, too, has not changed much. She's still her usual hyper-active useless self, and we honestly don't know much about her past either - save for the fact that she was a classmate of Haqua - but it doesn't tell us anything about Elsie.\\n\\n\r\nHaqua, a new character in this series, is also another \"tsundere\" type, but maybe less so. She does come with some backstory - a demon who aces all the theory tests back in school, through sheer hard work and determination, but when it comes to the real world, she falls flat and can't seem to replicate all the successes she had in the past - so that's good, and it really helps to explain her frustrations / dissatisfaction with her current situation. She isn't that interesting of a character though, and she also doesn't exhibit much growth. (+1 to depth)\\n\\n\r\nMoving on to the 3 main heroines, Kusunoki is another \"tsundere\", but this time, it's one that can really kick ass. Definitely one of my favourite character archetypes - the fighter girl - made famous by FFVII's Tifa, that shows that pretty girls can pack a punch that will send you flying across the room. Kusunoki show's some growth after doing girly stuff on a date with Keima, and also after \"embracing\" and \"accepting\" her feminine side. Kusunoki, in this manner has two sides to her, and makes her more multi-faceted than most other girls. (+1 for growth, +1 for uniqueness)\\n\\n\r\nChihiro, is the other less likeable character, that nobody likes and nobody dislikes either. She's just the stereotypically normal girl with stereotypically normal interests and dreams - but since she is this way, you can really empathize with this girl - how she always feels inferior to everyone else who can do things better than she can, how she loses to someone in every department, singing, sports, studying, looks, you name it. But she eventually grows out of this depressing state and moves on to decide to start a band, despite knowing that she sucks at singing, just because she wants to follow her heart. (+1 for growth)\\n\\n\r\nFinally, we have Nagase, the character that I'm not convinced would do so many crazy stuff just because she's passionate about trying to get others to agree with her / follow along with her or trying to \"help others\" in ways that are usually over-the-top and hence uncomfortable for many people. Her personality is actually very linear - sure she has an interesting back story, but it only goes to prove one point - that Nagase suffers from \"overdose of passion\" syndrome and can't understand that you can't impose ideals on other people.(+1 for depth)\\n\\n\r\nNagase isn't that interesting of a character either - and I thought that what Keima did with her was not anywhere near romantic enough to warrant that kiss at the end. All he really did was talk to her in a basketball court and told her to stop imposing her ideals on people, yet continue living out her own ideals for herself, and then it was straight cut to a scene where all her students came over to apologize and encourage her. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nI definitely enjoyed this comedy, once again, with so many laughs here and there and all the funny cutscenes with Keima explaining things to Elsie who always has that clueless cute look on her face :3 The humour is really very good and is one of the few things that this anime executes perfectly. (3 points for good humour)\\n\\n\r\nIn terms of romance, I would say that there were some touching scenes - especially the scene on the boat with Keima and Chihiro. That was probably the one that I felt the most emotions for. The other two kisses by Kusunoki and Nagase were too forced, so I can't give the romance bit too high this time around. Kusunoki going on a date with Keima was -slightly- romantic though, and it definitely was enjoyable to watch Kusunoki's reactions to cute stuff (2 points for romance)\\n\\n\r\nHowever, I have to say that there were honestly some parts of the show where I felt bored - mainly in the Chihiro arc where it seemed very circular in nature - like they were going nowhere, and the background music was so slow that it was making me fall asleep. Luckily, this was only for one of the arcs. (2 points for pacing)\\n\\n\r\nUnfortunately there were some filler episodes - namely episode 8 and 12, so I can't give it any bonus points.\\n\\n\r\nOverall: 6.25/10\\n\\n\r\nKami Nomi 2 seemed interesting, but as a whole, it was inferior to the first season. But I guess it's still necessary to watch because of the characters who will be become main characters again in Kami Nomi 3 - so it's worth watching if you intend to continue the series to season 3, which I believe will be the best out of the three.",
            "date": "2014-11-02T10:03:00+00:00",
            "helpful_count": 30,
            "mal_id": 167171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=167171"
        },
        {
            "content": "*Before you read this you should check out reviews on Kami nomi zo Shiru Sekai if you haven't seen the first season yet.\r\nI Love the Story, great story in my opinion, Love the Devil & Human Cooperation. Its an original story that i respect very greatly, this time around its even better, introducing a new devil to the anime. Haqua FTW :)\r\n9/10\r\nThe Art for this anime is spectacular, after watching a few more episodes of the series i changed my opinion on it. The animation is awesome in each and every episode i saw (excluding the first part of episode 1 but that was justfor laughs) Each and every episode has something new to bring to it. The backgrounds aren't 100% original but what can you do about it? Its hard for anime directors to make an original piece of artwork these days and i feel that Kami Nomi zo Shiru Sekai II does an amazing job at that.\\n\r\n9/10\\n\\n\r\nThe Sound was also okay, the Openings & Endings could've been better. I liked the first season's much better, but i can't complain. The soundtrack is the same as the first season with a few alterations.\\n\r\n9/10\\n\\n\r\nCharacters in this season, oh gosh its gonna be an amazing line up, starting up with Kusunoki Kasuga, followed by  Chihiro Kosaka, then Jun Nagase, and lastly my favourite of the season Haqua du Lot Herminium! =D The only reason why this category didn't recieve a 10/10 was because of Chihiro Kosaka, in my opinion she is the worst character arc in the series... wayy to bland of a character, not cutee, bad attitude and doesn't stand out at all.\\n\r\nvery enjoyable character excluding Chihiro Kosaka. \\n\r\n9/10\\n\\n\r\nEnjoyment - Very much enjoyable. You'd love this squeal to the first season. I guarantee that. It brings in a sort of refreshing aspect to the series introducing more problems, more information, better animation, better plot, and even more background. This time around, I'd say that this season is much more enjoyable than the first.\\n\r\n10/10 \\n\\n\r\nOverall I believe this anime series has carved itself into a category of its own, by portraying originality through the genres  Comedy, Romance, Shounen, Harem, Supernatural. Lots of laughs,  funny romance settings, and a story that i'd say is 100% in its own aspect.  If you've already seen the first season you'd know what i mean. The manga is absolutely amazing, Wakaki Tamiki has astonishing creativity and imagination with his work, if you love the anime, you should check out the manga as well.\\n\r\n10/10 Overall\\n\\n\r\nMuch more to look forward to since its just begun, I hope that this anime will become much more popular than it is today, and continue to entertain its viewers, as much as it does to me.\\n\\n",
            "date": "2011-04-11T19:08:00+00:00",
            "helpful_count": 21,
            "mal_id": 35943,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/467505.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aya-Brea",
                "username": "Aya-Brea"
            },
            "url": "https://myanimelist.net/reviews.php?id=35943"
        },
        {
            "content": "Alright guys I tend to keep my reviews short n sweet and spoiler free so without any a due lets jump on the wagon as I review Kami nomi zo Shiru sekai II, ( The World Only God Knows II).  Those who haven't seen the 1st season even thou this reviews spoiler free go watch it anyway cause its cool haha.  Lets unwarp this bad boy.\r\nStory: 9\r\n  Our hard core gamer Katsuragi Keima and our cute little worker demon Elucia are back to bring us some more GIRLS!!, opp,s, I mean season 2 yeah.  The story premise hasn't changed that much,we still follow the adventures of Keima-kun and Elucia as they try to capture demons, ( bad demons lol), that lurk in the hearts of pretty women.  The story pacing is great and well told over 12 episodes.  The comedy and romance is still there and its as charming as ever.  The funny chemistry between our two main characters keeps you itching to watch the next episode.  \\n\\n\r\nWord Rating: Yep I'm still a hopeless romantic\\n\\n\r\nArt: 9\\n\\n\r\nJust like my previous review I thought the anime artwork was brilliant basking in colour and had crisp clear character design.  Again I highly recommend watching in 720p or 1080p for immersive experience.\\n\\n\r\nWord Rating: Yep lets look at the Mona Lisa next  \\n\\n\r\nMusic: 9\\n\\n\r\nI got the soundtrack what more is there to say.  Hayato Matsuo's work makes an epic return here in the second season with some newer renditions of previous tracks and the older ones too.  The music really sets the tone of the anime and the sublime orchestral work always leaves me standing in awe.  \\n\\n\r\nWord Rating: Yep chuck on your Beats by Dre\\n\\n\r\nOverall: 9\\n\\n\r\nReally enjoyed Kami nomi zo Shiru Sekai II and had a great time watching every episode.  An anime exploding with fun, laughter, romance, magic, and will bring out the little kid in you.  To those who aren't accustomed to this sort of anime genre, just give it a go you might like what you see,  I know I did.\\n\\n\r\nPeace out ZEUS!        \\n\\n",
            "date": "2013-09-10T09:44:00+00:00",
            "helpful_count": 12,
            "mal_id": 112499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3131511.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XiiLE_ZEUS",
                "username": "XiiLE_ZEUS"
            },
            "url": "https://myanimelist.net/reviews.php?id=112499"
        },
        {
            "content": "Yes you are right! Katsuragi Keima, the God of Conquest is back and is ready to track down and capture more loose souls or should I say more girls instead? It is just like the first season however the producers did a greater job on this one.\r\nHow is it better? First of all is the story. Things got more explained here. Another thing is that the animation is improved, as a proof, if you watched the first season, you can notice a big difference with Chihiro's appearance. Yes, the humor and the cuteness is still there. Plus, the harem is a bit better than theprevious season part which is another demon like Elci. \\n\\n\r\nSo in conclusion, if you are into the romantic comedy plus harem type then you would definitely like this anime. It is definitely a must watch.\\n\\n\r\nP.S. Season 3 is already green lit so better hurry so you wouldn't miss out the fun.",
            "date": "2013-02-14T17:13:00+00:00",
            "helpful_count": 10,
            "mal_id": 86801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1861758.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KandaSorata",
                "username": "KandaSorata"
            },
            "url": "https://myanimelist.net/reviews.php?id=86801"
        },
        {
            "content": "WATCH THIS ANIME YOU WONT REGRET IT EVER........................\r\ni wrote a review for the first season and all i explaind in that review was who exactly is KEIMA and how awesome he was and how he do things and how we can relate to him in many ways.I JUST WANT TO TELL  KONATA-CHAN WAS THE BEST FEMALE OTAKU(who is a well rounded geek who is awesome and has a solid personality and not afraid to say she is an otaku but actually very proud to be one and i love her because i love her)AND NOW I HAVE FOUND THE BEST MALE OTAKU yeah.....mywork is done ;3\\n\r\nSTORY-its the continuation where we left off from the first season and the moment its starts it brings a smile to your face that you cant stop no matter what.this anime has the most well planed plot line i have ever seen in a slice of life anime the rezone is- it has drama and comedy mixed together well in the correct moments so it bullied the suspense and anticipation for wanting more episodes also it has hilarious plot twists that you feel after watching the episode  \"i just have to re watch it again\"and i speaks from experience,for me comedy have to be comedy with a great solid plot with pure entertainment and this anime gave me what i want and i love keima!\\n\r\nART-it was very well detailed to the last school mate in their class and it was so cute and beautiful.every character looked so different thank god...when you see the characters they used some high tech stuff to make them look different from other anime and make them unique to this anime so its not dull at all you will wish ahaa..i wish i get painted like that it was that great.the background was so natural and was quality stuff.they weren't afraid to use colours and they made it worked so 10/10.\\n\r\nSOUND-I LOVED IT.....I LOVED THE FACT THAT THEY USED FULL ENGLISH SONGS FOR THE BOTH OP IN THE TWO SEASONS IT WAS VERY CATCHY AND DIDN'T LOOSE IT PURE HEART AS BEING JAPANESE  IT HAD SO MUCH MEANING AND A GOOD MASSAGE TO EVERY ONE WHO WATCHED IT.the sounds used it the anime was both funny and smooth also showed bit sadness at times IF I SAY IT SHORT IT HIT THE SPOT WHEN THE RIGHT MOMENT CAME.\\n\r\nCHARACTERS-for me i need a very good solid plot which have to be explain very well and have to be understandable also need to have common or not i don't care i need good characters they don't have to be unusual they just have to be delivering entertainment for any anime that i have watched AND THIS ANIME NAILED IT WHOOO HOO...i don't care if its horror,shounen,mystery i watch them all and i love them if they have a solid plot and awesome characters im a all rounded viewer and i never dislike any anime an this anime RENEWED MY LOVE FOR ANIME WATCH IT ITS ONE OF KIND MASTERPIECE also HOPING 3RD SEASON COMES SOON :3",
            "date": "2012-11-30T21:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 78766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1045865.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lakshika",
                "username": "lakshika"
            },
            "url": "https://myanimelist.net/reviews.php?id=78766"
        },
        {
            "content": "Review for Kami Tomi 2\r\n=============================================\r\nI have already posted a review for the first season and if you are reading this you are probably wondering if you want to continue this series or not.\r\n=============================================\r\nSummary of the Extended Review down below :\r\nStory : Similar to the first season, I personally enjoyed the first season more, \r\nArt : Same as the first season, Well done, No unique style though this is not a problem\r\nSound : Voices are done well (Japanese Dub) Sound Effects great\r\nCharacter: We get to learn more about our main character, We get introduced to more sub characters\r\nEnjoyment : Lack of Ecchi Scenes (Family Friendly) Funny,Connection to the characters. I personally preferred the first season.\\n\\n\r\n=============================================\\n\\n\r\nStory : Similar to the first season introducing more characters for our main protagonists to conquer, A new season full of new challenges. I personally would say I have enjoyed the execution of the first season more then this season, I personally enjoyed the range of different personalities that has been introduced in this season. 7/10 sad to say not as great as the first season (in my opinion). This great though. \\n\\n\r\nArt : Same Art style as the first season, like I said in my review of the first season, Similar to the art styles of many different animes, a Standard Quality as to say, Nothing unique, But like I said before \"If it's not broken,Don't fix it\".\\n\r\nAnimation is nice, clean and easy to understand. 8/10 is my standard score for generally well done animation. 10/10 are usually for the anime's that have their own unique art styles that work, (it gives the studio that sort of recognizable style)\\n\\n\r\nSound :(Original Japanese Dub) Good work done by the voice actors, the characters sound like they should,(as in the voice fits the look of the character).\\n\r\nThe sound effects are nothing special but they work. 10/10 \\n\r\n(May skim through the series again in the English Dub to rate it) \\n\\n\r\nCharacter : In my review of the first season I have said that the main character was mildly developed compared to the subs and I as a viewer felt more connected to the Sub characters. Though in Season 2, they have managed to develop our main character a lot more though not in the plain way of telling us more about him instead we are able to connect with the our main protagonist by watching his facial expressions and actions in reaction to the situations that occur. I personally like the way the developing was done, The sub characters are still as great as the first season, 9/10 \\n\\n\r\nEnjoyment : After watching the first season I was really looking forward to this one and it did not disappoint, Though I may say it may have been a little messy in some areas where some things are left unexplained, I have enjoyed it anyway. 8/10 scored the same as the first season, \\n\\n\r\nOverall : Story was executed similarly to the first one, The main characters have been developed a little bit more then how much was done in the first season, 8/10 as an Overall Score,",
            "date": "2015-03-26T03:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 183435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4478941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DjKagamine",
                "username": "DjKagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=183435"
        },
        {
            "content": "I was not planning on reviewing any anime, especially so soon after joining MAL, however I feel the need to share an opinion that I have not seen mentioned. Therefore, I submit a simple review with only one main point.\r\nKami nomi zo Shiru Sekai II is very much like its predecessor. Since so many others already have, I will not spend any time describing the premise. The art is strong and the music just as well done as the last season. Each arc follows the same pattern as the one before it, though each has a unique twist that makes it well worth watching. However,it is important to take into account the continuation of the plot as a whole. \\n\\n\r\nThe story of the \"God of Conquest\" began with a protagonist that was nothing more than a (highly-competent) dating-sim otaku. While each arc is a fun parody that sets up the delivery of an (arguably cliche, arguably touching) Aesop, it also acts as a building block for Keima's own character development. The first season established Keima's outlook on life. In the second season, however, we begin to see a change in character. As Keima helps each individual 'conquest' to face reality in their own way, he himself begins to perceive reality differently. \\n\\n\r\nNow, I feel that I would give away the most appealing aspect of the story if I were to describe all of Keima's development, so I'll leave it at this. Each arc in Kami nomi zo Shiru Sekai II follows the same basic pattern because they serve to illuminate underlying theme to the series: every person must eventually face reality; each in their own unique way. This series is extremely fun to watch, but the reason I recommend it is because I feel that it will eventually culminate with a more profound and touching message than any of its individual parts.",
            "date": "2011-12-19T18:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 49603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1061875.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Denoue",
                "username": "Denoue"
            },
            "url": "https://myanimelist.net/reviews.php?id=49603"
        },
        {
            "content": "Finally i've finished watching this second season.\r\ni hope this review is helping the new viewer. :D\r\nIn my humble review, this anime awesomeness is similar to the first season.\r\nthe good backsound and smooth artwork are this anime excess.\r\nbut I think, it would be better if this second  has a few \"element of surprise\" like new plot, or extraordinary methods to capture the 'loose soul\" and so on. So, i think the viewers would like these surprise.\r\nand I hope the next season (if there any) would be more fabulous and surprising.\r\nOverall this anime still one of the best anime that worth your time to watch it.\r\nplentyof it! :D\\n",
            "date": "2011-07-05T07:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 38700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/440771.jpg",
                "scores": {
                    "animation": 9,
                    "character": 0,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hvzfree",
                "username": "hvzfree"
            },
            "url": "https://myanimelist.net/reviews.php?id=38700"
        },
        {
            "content": "This is One of a Kind Series. Definitely worth watching! Don't matter what you prefer! I believe all will like this!\r\n(Based of first 2 episodes)\r\nStory: 9\r\nFor you that have seen Season 1, It's basically just a continuation. But don't stop here lemme explain why this Repetitive Story Pattern, doesn't matter and just makes it all awesome.\r\nStory\r\nKatsuragi Keima is stuck with a demon girl called Elsea. By a contract with Mr.Satan basically. They most cooperate to catch Loose Souls whom have hidden within Girls to fill their emptiness sides. To get the Loose Soul out of the Girls body, Keima must win their heart.\r\nKeima is aGaming freak and his favourite and area of expertise are Dating-Sim Games. He uses his knowledge from this games to win the girls hearts and when he succeeds, Elsea capture the soul.\\n\\n\r\nDid I forget to mention his collar stuck around his neck will kill him if he does not catch these souls?\\n\\n\r\nStory is awesome and super funny, every new girl is a new challenge, and in some episodes you just see Keimas weird absurd sides that will make everyone laugh.\\n\\n\r\nLast Season not much more happened. We need a little Drama to make this a 10. Something more! Which I BET we will see in S2!\\n\\n\r\nArt: 10\\n\r\nAs last season. Just outstanding. It's speechless, no flaws, backgrounds are very detailed and beautiful. School suits are awesome, even sub characters are well made. And main char are just superb. There is nothing at fault here.\\n\\n\r\nSound: 8\\n\r\n8?! WTF!? you think..\\n\r\nWell voice acting is definitely 10. The Opening Theme, lost it's epic touch.\\n\r\nIt's just more damp, it misses the energy and absurdity Keima gives us. Which is why this is an 8. Background music is epic and well done and will not disappoint you.\\n\\n\r\nCharacter: 10\\n\r\nDo I even haft to start?\\n\r\nEvery new girl in this series are at least as good as some Female Protagonist from regular series. Keima is a personality new to the Anime World and is nothing like it. His absurd gaming habit, his quick and well thinking, the conflicts he makes and get involved in is probably what makes us laugh the most and the comedy drama.\\n\r\nElsea is a demon with a cute and kind hearted attitude that wants the best for his master. Keima. With special abilities that helps him out or blows his mind.\\n\\n\r\nEnjoyment: 10\\n\r\nI CANT GET ENOUGH!\\n\r\nThis is epic. I'm just beggin for another episode. Even tho I want to watch them all in a row, since thats gives me more enjoyment. But I cant since it's so awesome. Basically!\\n\\n\r\nLast season. You saw a pattern. New girl, Lots of Fun stuff, Captured. And this repeated 4 times till the season ended.\\n\r\nEven tho its repetitive, it works since each new girl is like a new story in the main story. And the story is of the Highest Quality. It does not bore you even tho it sounds boring just of the word \"repetitive\".\\n\\n\r\nOverall: 10\\n\r\nThis is one epic anime and if you haven't watched this. Watch Season 1 first! Then continue right here with season 2. I seriously DONT want anyone to watch S2 before S1.\\n\r\nThe story amazes me and blows my mind as some other series how the writer even thought of this. it's at the level of Naruto, Bleach, One Piece and so on.\\n\\n",
            "date": "2011-04-21T13:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 36300,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400203.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cornholio77",
                "username": "Cornholio77"
            },
            "url": "https://myanimelist.net/reviews.php?id=36300"
        },
        {
            "content": "I simply must write this review. It doesn't matter to me if it's \"helpful.\"\r\nThis anime is just amazing (yet still only my 15th favorite!). A strait 10 star show.I'll be honest, it's not so fantastic of a 10 star anime compared to others, but it's 10 stars never the less.\r\nthe reason being...\r\nThe ending of the first season gave me goose-bumps. It was amazing, and I expected as much for the ending of the second. It was even better. While the end episode for th first season was of a better design, the final moment in the second season's end episode completely topped the first's.\r\njust... Wow!I really enjoy anime about otakuism and the like. This is the best one of that genre I've ever seen. And you can look at my list... I've seen a lot of anime. Sure opinions are different, but if I give it a 10 star rank, I guarantee there's no way it's not worth at least checking out.\\n\\n",
            "date": "2011-06-27T17:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 38392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/404440.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jety_Lefr",
                "username": "Jety_Lefr"
            },
            "url": "https://myanimelist.net/reviews.php?id=38392"
        },
        {
            "content": "Kaminomi Season 2\r\nStory:\r\nThe Second Season of Kaminomi is still on the same arc as it started on however is not as popular as the first, many say that the binding glue for Kaminomi was Kanon and as she is not featured as much it was not enjoyed as much, not to say that I didn’t enjoy it, it follows the manga fairly well and doesn’t diverge, the second season is still important as more is revealed as well as the long awaited new demon Haqua, we see a similar amount of girls as the first season and stays pretty similar to the settings of thefirst, this does cause some repetitiveness however the first arc is most likely one of the longest so it is understandable, all in all this is an ok anime, maybe not as good as the first but good if you want to continue the series and read the manga. \\n\\n\\n\\n\r\nAnimation\\n\\n\\n\r\nThe Animation in this season does not differ from the first is quite interesting because it shows certain types, firstly the eyes, there are two kinds of eyes in this anime the hawk eyes which are used mainly for boys and some girls who are either have tough or cold personalities. The other eyes are the moe eyes with are large and round and seen with most girls who have soft, cute, shy or moe personalities. The hair is also another key part, like most anime’s of its time it has little detail in the hair using mainly different shades rather than drawing detail into each strand the actual anime is quite good it use small amount of features and a large amount of digital shading which is clever although when the chibi’s are made it doesn’t work as well, otherwise this is very nice animation and the style although similar to other is still quite unique. \\n\r\n‘P.S I wrote what I wrote in the season 1 (on animation) review because there is not difference’\\n\\n\\n\\n\r\nSound:\\n\r\nThe sound and music is still a favourite for me in this anime as the characters still sing the ED’s which I find really cool and clever, Kanon doesn’t have much of a role in this season however she is still referred to at different points and her music is still in some of the episodes, other than this there is not much change in sound.\\n\\n\r\nMain Characters\\n\r\nThe second season is relatively like the first we are introduced to a new main character Haqua and she is the studious type who fails as life an obvious anime personality so this is nothing new, we have some new heroine all with a theme, karate, teacher and real world girl although Keima seems to have struggled with them all, we are also (as I said before) shown the backstories of some of the main characters, including Elsie and some of Haqua, Elsie backstory cleverly talks about the failure and how she was looked down upon in her society, whereas Haqua’s backstory talks about how hard she worked only to turn out as a failure so it is cleverly pointed out that Elsie was bad at school but good at ‘soul-catching’  and how Haqua was good at school but bad at ‘soul-catching’, I will now focus more on Haqua’s personality, I’m saying this now because she technically is not a heroine even though she had a loose soul in her which was removed by Elsie’s friendship. Haqua is a very proud demon, she works hard and tries to do her best in everything, some may find her slightly repulsive because of her proud and disbelieving personality however as the season continues she starts to come down to earth so to speak and even congratulates Elise. Not much else is talked about her other than that, now some changes have occurred in Keima, firstly he has come to terms with his job, he may not be happy with it but he has seemingly adapted to the situation (by playing more games in class) at the end of the this season Keima finally falls in love with a character from his game nicknamed Yokkyun, he sees he as the perfect gaming girl and begins to wonder that is such bad looking game can have such a nice heroine weather the real world can have a perfect route in which to take, However going back to the main part of TWGOK we look at the humour which is put in this as always they find a way to interconnect the humour so that it blends in with the theme of the episode and as always Keima gives his riddles of dating sims which of are many.\\n",
            "date": "2013-06-09T08:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 100439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2678357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animeno",
                "username": "animeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=100439"
        },
        {
            "content": "The World God Only Knows has continued to impress me over its two seasons, mainly due to its consistency. With its short story arc formula, I don’t think this anime will ever hit god-like status, but for me, week in and week out I had more fun watching this, than any other show this season.\r\nFirst let me say I had a great time watching this last episode. Like the first season’s finale, season two’s ending deals with Keima and his actual playing of games. \r\nSo, my thoughts on the season as a whole are as follows. Like I said, the show was consistently good. Iwould also add that the show, sort of surprisingly from its description, was pretty well-rounded, more so even in its sophomore season. There are romantic and supernatural elements of the show, but most importantly it seems to balance the comedic and dramatic parts pretty well.\\n\\n\r\nHowever, don’t add dramatic + romantic and assume the show will = deep. Besides some overtones of escapist behavior from the show’s lead, Keima Katsuragi, the show’s plot never becomes too heavy. While making it easy to watch the non-deepness is another reason the show will probably never crack my favorites list.\\n\\n\r\nSo, here are some more things I thought season two did well. For one it was paced really well. The last episode felt a little crammed, but the entire season prior had a nice flow to it. The second season, while having a similar pace as the first, seemed way less formulaic, to which I would attribute the introduction of Haqua.\\n\\n\r\nNo only was her story arc possibly the best, it really, really helped break up the season. If they would have never introduced her and instead, substituted a different generic-lonely girl, the show would, in my opinion, have gotten stale.  Along with Haqua were flashbacks of her and Elsie’s past in hell, which were one of the highlights of the season for me. Besides all the hot romantic kissing of course.\\n\\n\r\nThe production of the show is also very consistent. The show always looks great, from the character designs to the switch between normal and super-deformed, I always enjoyed looking at it. While not as beautiful as some of the new shows seen this season, the animation always seems to fit the story. Even Yokkyun, lol. The other production elements also seemed fine to me.\\n\\n\r\nI’m not a huge fan of opening/ending songs, but just the like the first season, the entire opening sequence is incredible (2D purists may disagree). One of my favorite openings of all time was from .hack//Sign where the characters sort of get digitalized into the game world and the opening this season had a similar feel.\\n\\n\r\nSo, I felt the pacing and production were very good. The characters themselves however, were just ok. We get much of the same from Keima and Elsie as in the first season, where to be honest, some growth could have really benefited the series. We also get much of the same from season two’s group of possessed girls, unless you count Haqua, who was more developed (story wise, not cup size). Based on completely shallow merits, I enjoyed the Jun Nagase arc more than the others, as she was an older woman (making it slightly dangerous) and ridiculously cute with her fist pumps.\\n\\n\r\nI will say in closing, adding to my thought on Keima and Elsie, I really wish they would have done more with them. A reader once asked if I was reading the manga, to which I replied I wasn’t. So my indictment about the lack of character development may have to be directed towards the source material. Several times throughout the season it seemed like Keima would have to face reality only to have plot take him somewhere else.\\n\\n\r\nElsie is one of my favorites, but she really got the shaft this season. Any plot or development regarding Elsie was pretty much brought on by Haqua and her own story. While she continues to be incredibly adorable, it would have been nice If Elsie had gotten her own episode or maybe a new magical/demon power to show off. \\n\\n\r\nSo, I enjoyed the season and after a short break, I’ll be ready for a season three. For a couple of its faults there’s nothing entirely similar to The World God Only Knows. I can easily recommend this to someone who enjoys some light romance with their comedy, to the occasional bishoujo fan (like myself), or to anyone who likes well-rounded, but not overly deep series.\\n\\n\r\n[Additional thoughts about final episode removed due to spoilerish tendencies: go to http://moemonster.com/2011/06/24/a-channel-episode-12-finale/ for full unedited review with Pics]",
            "date": "2011-07-06T12:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 38766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/495271.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KidKonseptual",
                "username": "KidKonseptual"
            },
            "url": "https://myanimelist.net/reviews.php?id=38766"
        },
        {
            "content": "I loved the first season of this anime, and I didn't have much expectations to the second season once a saw the cast of characters.\r\nThe second season starts a little slow, The first capture wasn't all that interesting in my eye's, althought the humor was all solid as ever and none of Kasuga's personlity or charm was interesting enough satisfy me. But once Haqua's arc began this season only got better and better, and it was finally Elisie's time to show her worth and that she isn't all the useless in a capture.\r\nChihiro's arc was the arc I was looking least forward to. But Ihave to admit it was the best capture until now and the far more interesting.\\n\r\nIn Jun's arc Katsuragi really had to use all of his date sim skills and brain power to capture her! And he never stop's impressing me with his timing and his use of words.\\n\\n\r\nSomething that did disappoint me a little is that Elisie didn't get more attention, something I was hoping for this season.\\n\r\nThat was the only thing that really disappointed me this season.\\n\\n\r\nAnd I was happy to watch that it wasn't really some boring filler episode's this season as in the previous one. And it was good watching Katsuragi's silliness and Elsie's clueless once again. And I'll be looking forward to season 3",
            "date": "2011-06-30T11:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 38509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441723.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Pera",
                "username": "Pera"
            },
            "url": "https://myanimelist.net/reviews.php?id=38509"
        },
        {
            "content": "This is my first review so sorry if im bad at this...anywho lets get stated.\r\nStory (9)\r\nI found this story to be quite enjoyable and it was definitely unique, or atleast to me. It was a fine comedy but the romantic part was a bit shaky at first. When i first saw this series, it was different kind of romance, but it was a great way to keep me into it.\r\nArt (8)\r\nA lot of anime series have similar art style, well according to me, and let they always are different from one another, but it is a minor change that doesn't really bother me. Art isn'treally a big thing to talk about, but it is no reason to not watch the series.\\n\\n\r\nCharacter (9)\\n\r\nI found the character to be quite enjoyable and changing a lot. Changing character isn't a bad thing because it shows that the characters might react different to certain situations then they may have earlier in the series. The characters in this series were something. We got a nice, annoying demon from hell, that catches other demons, that are evil. Then we got the main character who is person that is always caught up in his dating sims, but hate reality.\\n\\n\r\nOverall (9)\\n\r\nOverall i gave this series a 9. It wasn't one of the best series i have seen, but the series did grow on me about half way through the first season. I would recommend people to watch this series, especially if they are looking for unmatched main (and a lot of the time, supporting) characters",
            "date": "2013-03-11T06:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 89383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/parmbir21",
                "username": "parmbir21"
            },
            "url": "https://myanimelist.net/reviews.php?id=89383"
        },
        {
            "content": "I DON'T KNOW I JUST LOVE THIS SHOW!\r\nI READ THE MANGA, AND I'M WISHING THERE'D BE SEASON 4. I WANNA SEE KEIMA CONFESS HIS FEELING TO CHIHIRO.\r\nBUT, to be honest, I'd prefer Ayumi than Chihiro, but still it's a bad idea to date one of the host goddess hahaha.\r\ntherefore, I like Keima and Chihiro. THEY'RE OTP!!! hahaha\r\nI WANT TO SEE SEASON 4 SO BAD! PLEASE MAKE IT HAPPEN!!! :'D\r\nat first, I thought this show was suck, but then I enjoyed so bad.\r\nKeima is very clever, calm, and I don't know. I think he's kinda awesome!\r\nhe date with every different girls so easily with his knowledgeabout date-sim game. I wanna be like him hahahahaha.",
            "date": "2015-10-25T19:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 201996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Asch_Fabre",
                "username": "Asch_Fabre"
            },
            "url": "https://myanimelist.net/reviews.php?id=201996"
        },
        {
            "content": "Kami nomi zo Shiru Sekai II or (The World God Only Knows II) was more then quite enjoyable to watch, after finishing it with 24 hours I can say that the anime was more then enjoyable to watch, with the great amount of comedy spread throughout it and romance from the main story. The school life side of it comes out really well with character development but what really impresses me is that this is one of those second seasons to a show where I did not think it dramatically lost pace. It kept up with the story and didn't have some out right enragingplot twist. The MC's style of character, gamer, withdrawn from society also shows interesting ways of deducting evidence while still remaining in a calm, cool self  I only had one small problem with the show and that was it's repetition when it came to the conclusion to chapter the whole \"Knight in shining armor\" just make me feel like our MC actually cares about reality (even if it is only to save his own life)\\n\\n\r\nStill highly recommend it as a top 20 anime",
            "date": "2013-09-17T07:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 113217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/446476.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chazar_90",
                "username": "Chazar_90"
            },
            "url": "https://myanimelist.net/reviews.php?id=113217"
        },
        {
            "content": "The previous season of The World God Only Knows was pretty entertaining. It had a nice plot that combined romantic comedy with some shonen elements, had a cast of very likeable characters, a pretty good soundtrack, and excellent animation. I had a lot of expectations for the second season, and I was not disappointed.\r\nThe World God Only Knows is about a guy named Keima who has been employed by the devil to track down loose souls, which apparently only manifest themselves in teenage (though sometimes older) girls who have identity problems or something along those lines. Which makes sense, because teenage girls certainly are theperfect vessels for a demon to live out of. Angsty and emotional, I can understand why we don’t see any male characters being taken over by loose souls. But I digress. Keima is a gamer, specifically, a dating simulation connoisseur. He runs his own website about them as he beats a couple a day and is even asked for advice by dating simulation developers. Using this knowledge, he attempts to help the girls who have loose souls inside of them by filling the space the soul occupies with himself. He does this through pushing them through tough times and basically getting them to fall in love with him. When the loose soul leaves, Keima’s sister and demon buddy, Elsie, captures them.\\n\\n\r\nThe plot, as I stated in my first season review, isn’t exciting but it’s melting together both shonen and romantic elements makes it have a wider appeal to a wider crowd of people. As a fan of romantic comedies, I found it to be fun and I found the shonen elements to liven it up a bit and give it more flair.\\n\\n\r\nThat’s not to say that the shonen elements are really good. In a particular arc one of the loose souls winds up becoming ultra-powerful and this leads to a big fight. The fight wasn’t exciting, nor was this arc that great, but I admired the fact it was taking something that most people would think girly and made it appeal to guys looking for some action.\\n\\n\r\nThe plot is marked with two filler episodes like the previous season. This time, the roles reverse. The first filler episode is pretty good and funny, while the last one (the last episode) isn’t that exciting.\\n\\n\r\nThe animation is just as good as the previous season. While there were no metaphorical sections that really wowed me like last time, it still managed to have good character designs and smooth animation throughout.\\n\\n\r\nThe sound is the only place in the entire second season where I’m going to have to downgrade the points. This season suffers from a lackluster opening and closing, as well as no stand-out music during the show. Kanon does make an appearance with an uninspired song that lasts a few seconds, but otherwise she’s lost. I was hoping she would be in the background more so this season and her songs would play on radios or in stores for some added fan service, but she isn’t utilized and it leaves the show with a big hole in the sound department. Voice actors still play their roles well though, so sound isn’t bad, it just doesn’t shine quite as much as it did last season.\\n\\n\r\nIn the character department though, I found that this season had better heroines for Keima to conquer than last season. I felt that they were a bit more complex and different from what you typically see. The four of the first season were somewhat generic, but as I said, they had a reason to be. This season gives Keima a lot more of a challenge as the heroines aren’t conforming to his games as much. This really adds to the drama and makes the show so much more fun.\\n\\n\r\nThe two main characters are of course Keima and Elsie. As I said in my previous review, Keima comes off as a complete ass to Elsie, but is a genuinely nice guy to everyone else. Elsie is just plain cute and adorable and you want to hug her and have her as your little sister. She isn’t too deep, but she serves her purpose of being the complete opposite of a demon and the complete opposite of Keima well, as well as playing the role of little sister nicely too. She’s fun and funny.\\n\\n\r\nThe conquests start with Kusunoki Kasuga, a martial artist who is trying to suppress her inner female and act as if she were a male. Her character isn’t that complex but she is very likeable in her ideals. She doesn’t want to show weakness so tries to stay away from cute things and showing affection. She’s the weakest of the conquests of this season, but she is still much deeper and much more enticing than the four girls of the previous season.\\n\\n\r\nThe second conquest is Chihiro Kosaka, which is probably my favorite of all the conquests in the entire series. She’s just normal. She’s average at everything, she looks average, and she tries to quell that averageness by asking out and being rejected by every hot guy she sees. The metaphorical take on her feelings is not awe-inspiring or anything new, but it is good. Everything leading up to the end of her story arc is well constructed, and I thought that the end of the arc was really well done and came across as truly heartfelt.\\n\\n\r\nThe third and final conquest is Jun Nagase, a student teacher. This is the second best conquest of the entire series. Her plot and feelings won’t come across as truly understandable unless you have been a student teacher or know someone who has. She, like student teachers, goes in idealistic and wanting to help people. The problem is, nobody wants her help and she’s kind of in a place where she isn’t respected, no matter how hard she tries to be. It’s a fantastic arc specifically for those emotions that are rooted very much so in reality. She feels like a failure because she isn’t able to get the kids to respect her as a friend; they treat her more as an enemy and an adult than someone they can hang out with.\\n\\n\r\nSo all three conquests are great characters, Another character I need to mention is Haqua, another demon like Elsie who was at the top of her class but has become a failure. She’s a decent character and fun for the little time she’s around, but her past is a little cliché and her character isn’t as well made as the conquest characters.\\n\\n\r\nThe World God Only Knows II is actually better than its predecessor in almost every way. It’s wholly entertaining and surprisingly heart-felt at times. While it’s not deep, nor is it really that smart, it still maintains a good balance of different elements that combine into a very fun ride. It may not be the best thing out there, but it is a very good thing. It’s not bogged down by a lot of cliché. It’s sometimes smart, sometimes funny, sometimes dramatic, and sometimes romantic. It’s everything in a nice little package.",
            "date": "2015-05-22T11:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 188517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188517"
        }
    ],
    [
        {
            "content": "Sequel to The World God Only Knows. \r\nStory: It's mostly the same premise but there's a lot more depth this time. I noticed that season 2 was definitely better than season 1 since it expanded a lot in the world of The World God Only Knows. \r\nArt: Not much different to season 1's art really. Which is great, because season 1 had very good art.\r\nSound: Again, no major difference. A very good thing.\r\nCharacters: While season 1 was great with its characters, season 2 somehow still managed to improve on that. We get a deeper look at our main protagonist, and even get a deeper lookinto some of the heroines we loved from season 1. \\n\\n\r\nAs I said, I think season 2 was better than season 1. Absolutely couldn't stop watching!\\n\\n\r\nIMPORTANT: Once you finish Season 2, be sure to watch 4-nin to Idol and Tenri-hen. These are OVAs significant to the story. Optionally, there's also Magical Star Kanon 100%.",
            "date": "2018-09-19T08:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 289406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289406"
        },
        {
            "content": "after finishing s1 of \"The world God only knows\" i started to watch this season\r\nSTORY:\r\nIts like the season 1, or continuation of the last ep of s1. \" conquer all the girl to capture the loose soul\"\r\nSOUND:\r\ni like the opening because its English. The lyrics is match on the anime.\r\nCHARACTER: \r\nsame as season 1, elsie and keima.\r\nbut in this season not only school girl he needs to conquer\r\nthere is a: teacher, a tsundere girl, and a annoying classmate\r\nENJOYMENT:\r\ni totally enjoy watching this anime, because i though he cant conquer a cold hearted girl ( tsundere ), a annoying classmate, and a teacher.i totally laugh whenhe failed ( the time when he needs a help in his sensei nikaido ) he have a wrong decision there. When the time he conquer the teacher, i learn many things.\\n\\n\\n\r\noverall: \\n\r\n10/10 because of comedy romance. :)  \\n\\n",
            "date": "2013-10-09T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 116187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/278631.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shast007",
                "username": "shast007"
            },
            "url": "https://myanimelist.net/reviews.php?id=116187"
        },
        {
            "content": "All together the three seasons of The World only God knows represent my favorite anime of all time, finally knocking dragon ball z from it's nearly permanent perch there. \r\nThe first season is very interesting and I was hooked after the third girl was introduced, the second season was the weakest of the three but I still loved it because they kept finding interesting new characters to introduce. The third season though, that was when the story finally topped dragon ball z. After an initial confusion of the first couple of episodes of season 3, mostly because I hadn't watched the ova's yet, I becamepossessed by the story, with a constant feeling of suspense keeping me hooked through out the entire season, which I binge watched in a single day.\\n\\n\r\nThe character development was very natural feeling, and the transformation was part of what kept me hooked, truly one of the best developed shows I've seen. Not only that but I feel in love with so many of the characters, their interactions were perfectly mixed with realism and classic anime comedy.\\n\\n\r\nThe ending though really got me, it was perfect but it got me more than any show ever has. I shed a couple tears, which is more than I have for a show before and I'm not even sure if it was more because of the way the show ended or if I was sad that it was over. I didn't even cry at the end of Angel Beats, that fact making me feel alittle bit like an awful person. \\n\\n\r\nAnyway I highly recommend the series to anyone looking to fall in love with most of the cast of a show.",
            "date": "2014-11-29T18:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 170381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Brelic",
                "username": "Brelic"
            },
            "url": "https://myanimelist.net/reviews.php?id=170381"
        },
        {
            "content": "I think this show is great.\r\nLet me clarify, I don't mean I'm comparing it to Evangelion, or Fullmetal Alchemist, or steins;gate. There's a lot of different kinds of greatness and you have to judge things based on their own merits, what they're trying to do, not by some single arbitrary Standard of Good that applies to everything. I cannot say Kami Nomi is ground-breakingly innovative, or that its art is transcendent, or that its characters are unique and perfectly sketched.\r\nWhat I can say is that this series has so much of a spirit of fun to it. It's such a thorough, loving parody of gamers,of relationship-games especially (obviously) and of the ways they don't reflect reality--and the ways that they do. Because as frustrating and weirdly obsessive as Keima is, he actually has a lot of insight into the human heart. Not enough to form a sincere connection--he's not honest enough with himself and with others for that--but enough that one day, when he wakes up, he will be able to.\\n\\n\r\nThe plot is highly episodic and there's not much to say that isn't spoilerish. You'll be able to \"see the ending\" pretty quickly, but you're supposed to; the joy is in the ride, not the destination, for this one.\\n\\n\r\nLet me just say a word about the characters. They're cliches, sort of--Keima of course, his delinquent mother, the sweet genki-girl imouto (Elsie), the proud tsundere (Haqua), the various love interests who do, and don't, defy expectations. But they're cliches that are being used to a specific purpose and who each have their own moments of depth and honesty and genuine affection, beyond just going through the motions. And whatever their shortcomings, they are relentlessly charming.\\n\\n\r\nOn the one hand, if you take this series seriously, it's actually sad. Here's this incredibly talented person surrounded by so many opportunities in life and he throws it all away on a little screen. But this is a moment in his life, one he'll grow out of (we hope), and most importantly, it's not a show that's to be taken entirely seriously. (How could you?) Instead it's one that moves seamlessly from funny to sweet to surprisingly exciting and moving, and overall I definitely think it's worth a watch.",
            "date": "2017-07-26T22:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 253912,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6284433.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aesaloniichan",
                "username": "aesaloniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=253912"
        },
        {
            "content": "I'm going to assume if you're reading this review, you've already watched the 1st season or you're looking at the overall ratings for all three seasons. If you're here for the latter, you've probably read too far. My Overall Score for this anime is in the top right, geez!\r\nThe story got a little more boring for me during the second season because I got used to the \"otaku girl conquerer\" premise. But not too bored. Once again, the art and the sound are nothing special.\r\nI feel whether the characters were better or not this season is a little more subjective. Basically, do you like thesegirls or the 1st season girls? I personally like the heroines this season more than the first season, so I've rated the characters higher. Kasuga was interesting, Chihiro was the best character so far, and Nagase provided an interesting moral for her story arc. Elsie is still just Elsie, and Katsuragi is is still Katsuragi. Haqua doesn't do much or show much.\\n\\n\r\nThe fact that the anime is still totally built off the same premise but still kept my attention with more interesting characters allows it to come out of this review unscathed with a 7.",
            "date": "2016-12-04T20:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 234906,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zeralul",
                "username": "zeralul"
            },
            "url": "https://myanimelist.net/reviews.php?id=234906"
        },
        {
            "content": "the world only god know II is almost similar with the first season, \r\nboth i saw it in day, the first time i saw this anime is nothing special, until a few episode the character of the primary character katsuragi keima is more explored, '' i can see the ending' (my favorite quote hhahaha)' ,\r\nit is very enjoyable anime, with light and understandable story, also nice character (since almost character are also funny), and of course excellent graphic art (no doubt)\r\nrecomended to otaku game like me hhahaha\r\n*sorry im not so good in english",
            "date": "2014-01-08T16:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 127837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2989491.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/vellaire",
                "username": "vellaire"
            },
            "url": "https://myanimelist.net/reviews.php?id=127837"
        },
        {
            "content": "Outstanding!!\r\nAs expected from the prequel, it's perfect\r\n...  Well, let's get going to the review...\r\nThe story 10/10:\r\nNot too much changes from my latest review, there are no addition in this, It's perfect, so what's beyond perfect? Well \r\nThe story progress is very perfect, even this is harem, the story goes perfectly, well i thought that the story would be very easy to be guess... But not in this anime, there are no cliche moment, there are almost no \"coincidences\", that's make the story perfect, the story plot, the incident that happen on the story, have a reason why that story is happen which is rareto be seen in harem, ussualy harem just men bumping into girls, and girls going to like him, even the guy is dumbbass... well not in this case, I'm not going too spoil anymore, the story it's perfect, an ideal anime harem...\\n\\n\r\nArt: 10/10\\n\r\nThe graphic is well drawn, the animation work perfectly, Perfect.!!!\\n\r\nEven there are too exaggerated moment, but it's okay\\n\\n\r\nSound: 9/10\\n\\n\r\nWell, I don't have much interest with the music, I'm not enjoying the OP, That's for the music, but for the sound animation have very good quaility, no disturbing sound, no unnecesary sound, and etcetra\\n\\n\r\nCharacter: 9/10\\n\r\nChanges started to meet here, it's started with the girls behaviour, there are several similarity with other harem, It's downgraded from before, for the first girl and the second monster, It's downgraded too much, but for Keima it's still like usual, btw he resemble Lelouch vi Britania from code geass, don't you think? \\n\r\nEvents are triggered not by coincidences but by the hero behaviour, that's what I call this harem is different with another harem, The character which is Keima, is suited for the role, and suited with how the story work, The target/girls are perfect too, there are a lot of explanation about why they behave like that, Like they triggered by some sort of events, \\n\\n\r\nEnjoyment: 10/10\\n\r\nLike the prequel\\n\r\nThe genre is enjoyable, there are lot of comedy too... The comedy is getting along with the story, not to forced, rare too see too...\\n\\n\r\nOverall: 10/10\\n\r\nYou must watch this, this is the best harem.\\n\\n\\n",
            "date": "2013-07-17T07:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 105721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2746821.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/snowpirate12",
                "username": "snowpirate12"
            },
            "url": "https://myanimelist.net/reviews.php?id=105721"
        },
        {
            "content": "well this is my first review and it will be short \r\nfirst the world god only knows season one was good and interesting which made me watch season 2 after episode 8 to 12 it is really change for the god of conquest and the daemon Elise definably with here friend from hell haqura who was seen at the end of season one \r\nsecond \r\nthe comedy part of god only knows is quiet good and worth a watch it dose good for a harmen romance but i really wish that the girls that were conquered remembered it.\r\nso that was my short review and if itlook like i haven put much in is because im not wanting to go in to extreme detail for now.\\n\r\nplease give it your truthful options and leave me a message if some thing was wrong.d",
            "date": "2011-11-28T19:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 48253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/747073.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TIBBS4LIFE",
                "username": "TIBBS4LIFE"
            },
            "url": "https://myanimelist.net/reviews.php?id=48253"
        },
        {
            "content": "I won't write there what this anime is all about, if you don't know, you'd better watch first season or read a review of it. I will only write my feelings after watching second season. You are warned.\r\nApart from what I thought starting to watch this season, it turned out to be about as good as first season. It was a bit less funny, but the last \"conquest\" was a really outstanding story. I must say that as far I don't especially like sequels, I'm waiting for third season, which according to the very ending should get aired. And... I don't especially know what isthere more to mention. Sound was a bit worse than in first season (especially opening), art was exactly the same, the characters are still outstanding, and watching this is pretty fun. So there's it, short review of something that is just very good continuation of first season. I hope you find at least a bit of it helpful and I really think that everybody, who enjoyed first season, will enjoy this also.",
            "date": "2012-05-05T06:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 60563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1138925.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Amikke",
                "username": "Amikke"
            },
            "url": "https://myanimelist.net/reviews.php?id=60563"
        },
        {
            "content": "I'm writing this under the assumption that readers have seen Season 1 or at least read the manga.\r\n~ Story\r\nThe story continues from where Season 1 left off. Keima is still capturing the hearts of girls in order to fill the void in their heart and catch the demons that have taken refuge.\r\nIf S2 opening is anything like S1 opening, then it seems that this season revolves around Chihiro, Jun Nagase, and Kusunoki. Also Haqua joins the team",
            "date": "2011-05-17T08:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 37069,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=37069"
        }
    ]
]