[
    [
        {
            "content": "Popular to contrary belief, Japan's Tokugawa (or Edo) period, wasn't all about fancy clothes and fairy tales at all. It was a time when honor and loyalty ruled in a man's world. Where women were treated as mere objects and held rather little to no power. And being formal with your enemies was as common as wielding a blade. This story basically follows the trials and tribulations of two warring clans rife with sex, lies, and deceit. \r\nDon't get me wrong, Shigurui isn't a complete historically accurate show, but it's damn close. Starting off with the music, its very reminiscent of something you would hearstraight out of a Japanese stage opera and sets the mood and pace perfectly for this show. If you turned off your monitor you swear you were watching a Japanese play unfold before your very ears its all a beautiful experience. Even the cold silence can emit a feeling unlike any other. \\n\\n\r\nThe actual sound effects of the show are also very play-oriented. It's usually silent with the exception of the actors playing their role, but when there are sound effects they are  usually very subtle, environmental, sound effects like wind rustling, or flames snapping, or even the sound of gravel being undisturbed beneath a warriors feet. Less sound in this instance is good as it gives immerses the viewer in to such an intriguing drama.\\n\\n\r\nThe voice acting are all top notch as well. I'm not a big fan of a mostly male seiyu cast, but all the voice actors play their part with such passion and seriousness that I am not very accustomed to. Albeit its not very hard to act as a badass or a madman with very little lines in every episode. Compared to all the cute loli anime being released in droves recently, this is a very welcome change of pace. \\n\\n\r\nFrom the beginning of the opening credits, one can already see that they are in for a visual treat. Its not often that you get to experience something like this. EVERY scene in this show is so beautiful that each cel can be a masterpiece in its own right. The background art is so pretty you swear you've seen the art off a history text or a museum its that immaculate. Even every camera angle has its own beauty and flair. To add to its historic feel colors are pretty limited to a neutral tone (brownish green tinge) more reminiscent of tapestry paintings of the time. Apart from the background art, the character art has its own beauty and uniqueness not found anywhere else. Each character (including stand-in's) are all drawn with the utmost care. Wrinkles, shadows, beards all drawn in with large detail. Each person looks completely unique from their eyes hair and face, all the way down to their clothing (with unique patterns and colors) and sandles. Little forewarning there are a lot of adult situations including violence and sexuality, but they are all there for reason. Even if its only there to show how brutal and harsh (yet elegant) the Edo period really was. \\n\\n\r\nThe story itself is a rather hit and miss mostly because  of the &quot;Tarantino&quot; effect they did with the main story. After a few episodes you almost forget about the main story. But how they skillfully use art and sound and voice acting in every episode the viewer is more drawn to the situation at hand rather than what happened 4 episodes ago. It can be intriguing for some and a turn off for others. But I really appreciate the detail and accuracy they try to pull off with this show. Now I'm no expert in the Tokugawa period or Japanese history in general,  but I am a decent history buff and know more than enough to truly appreciate an epic such as this. \\n\\n\r\nFor you kiddies expecting to watch something like bleach or samurai champloo or even Inyuasha, i highly recommend reading up on some good Japanese literature.  Namely, Amaterasu, List of Divinities, or Kojiki (they were required reading for my uni). Or wiki up some Tokugawa period history (specifically Kan'ei)  if you don't feel like reading up on such historic pieces. As for everyone else, I highly recommend watching this as this should be one of the best examples on how to do an artistic anime. Don't expect much in terms of pace, treat it like you were watching a stage play on your pc. One word of caution, be prepared to experience cold, brutal, reality",
            "date": "2008-05-15T19:21:00+00:00",
            "helpful_count": 312,
            "mal_id": 4762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4762"
        },
        {
            "content": "Do not drop this anime, endure a few episodes! (Assuming that you are aware that this one has maybe too much gore/blood/violence!).\r\nThis anime has one of the greatest plots  I have ever seen (and not just anime), every scene is there for a reason and a part of the complete picture. So, from my! point of view Shigurui is underrated.\r\nWhy?\r\nLet me tell you how I started to watch this one; I wanted to watch something with samurais in it and started to watch Shigurui as a coincidence.  The first episode was just awful, I did not liked it at all; too much blood,too much violence(I even covered my eyes with my hands instinctively at some scenes). So at first it was just an anime that was tried to be made interesting using lots of unneccessary disturbing scenes, so I nearly dropped it but still there were some interesting things (or lets say unexpected character reactions) so I could not drop the series as a result... Next day I had nothing to do and so I took a deep breath and resumed watching it but after a while the general atmosphere of the anime got me very very interested. The story was very solid not to say disturbingly unique (due to the realistic reactions of the characters maybe;  not the usual either black or white characters but ones with shades). The art was top notch as the sounds (no music at every scene, sometimes just sound of cicadas -though I found them rather annoying-  but perfect both for reflecting the mood and complementing the plot). \\n\r\nSo before I realized, the series was over and I was awestructed, cause I did not get the ending at first. But after 5mins or so I started to remember scenes, scenes from first episode, scenes from 5 th or 9th episode and I just got it. It was like oh my gosh ( stupid sentence but describes my feelings precisely). So watch it till the end because the masterpiecycity (copyright at Guuguk) of the series is increasing exponentially. \\n\\n\r\nThis is a very sophisticated anime which might be enjoyed by careful and patient viewers only, so take notes :), take a deep breath and complete the 12 episode in e few days (to avoid the 'baccano effect') \\n\r\nSo finally :) the process of watching was hard for me due to the high gore level but it was worth it! This is one of the stories that I will possibly remember for a long long time, not for the story itself but for how it was told...  \\n\\n\\n\r\nPS: I admit that I am not familiar with the 'actua'l Edo period (I learned a little bit in Kenshin though :) ) but still the value of the plot is unbelievable and it is just fiction right.\\n\r\nI did not give examples from scenes and stuff, just to avoid giving any spoilers, which might really spoil the ' it was like oh my gosh' effect... \\n",
            "date": "2008-11-25T14:53:00+00:00",
            "helpful_count": 163,
            "mal_id": 9841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GuUguk",
                "username": "GuUguk"
            },
            "url": "https://myanimelist.net/reviews.php?id=9841"
        },
        {
            "content": "Among the numerous things a review is supposed to accomplish, there's this: Give the reader a sense of what to expect from the content that's under examination in order to help them determine whether or not they should dedicate their valuable time to checking it out. To that end, I'll try to steer some poor souls away from trouble immediately by saying that Shigurui contains a massive amount of exceedingly gruesome gore as well as all manner of violent sexual predations, and in many cases  those two things appear onscreen simultaneously. If you have a strong aversion to the stomach-turning, you can probably justcontinue on your merry way, because this show is two cuts above grotesque. That being said, I don't believe that art is under any obligation to be shiny and happy, and content of a violent and brutal nature doesn't necessarily make something “bad” (although, in this instance, the point is a little moot). But for anyone who remains undeterred, there is an actual review up ahead.\\n\\n\r\nTo say that Shigurui has high production values would be an understatement. Even by the standards of the frequent overachievers at studio Madhouse, Shigurui is looking at “high production values” in the rearview mirror half a mile back. It's a shame that much of the show takes place in dimly lit dojos and huts, because the outdoor backgrounds are nothing short of gorgeous. I'll be blunt in saying that the character designs are repulsive—everything about them is exaggerated, and from their overblown facial features to their overly pale, shiny skin, they look more like wax caricatures of humanity than anything else. Given the show's general love of putting the disgusting on display, I'd wager that this is intentional, and while the designs aren't aesthetically pleasing, they're fitting, and their remarkable level of detail and consistency can't be denied. The one artistic aspect where Shigurui falls a tad short is the animation; on the rare occasions where fluid animation is actually present, it looks great, but unfortunately the series defaults more to blink-and-you-miss-it shortcuts and fades for its fight scenes, which are less than enthralling (more on that later).\\n\\n\r\nShigurui is musically minimal. Most of the score consists of slower, more traditional Japanese music. Ominous drumbeats and strings are par for the course, sometimes punctuated by a deep, wailing chant. Atmospheric sound is common and used to good effect, with the old standbys of keening cicadas and chirping birds being the most noticeable. Some of the show's better music actually comes in the form of rhythmic folk songs sung by field laborers or village children as the samurai pass them by. To some degree, this befits both the setting and the “slow but violent under the surface” nature of the series.\\n\\n\r\nAnd now we come to the writing, which, for the most part, is where I lose the ability to say anything positive about Shigurui. For all of its artistry and its attention-garnering violence and sexuality, the plot is built on fairly typical samurai fare: In the present time, a swordsmanship tournament is being held. Facing each other are two decrepit samurai, one of them blind and one of them missing an arm. They are both students of the same school of swordsmanship, they have a historic rivalry with each other, and the rest of the series is a flashback that delves into that rivalry. Revenge, rivalry, and betrayal can be made powerful with a quality story and good characterization (see Berserk, Gungrave) but it just isn't so here. Shigurui's writers seem to be going for the “slow but deliberate” buildup, and as a result the story dawdles,  takes frequent forays into the backgrounds of characters and objects which have a minimal connection with the plot, and all the while fails to generate tension or momentum in any significant amount. A lack of complexity isn't always a bad thing, and good execution can take a simple plot, run with it, and make it compelling. But here is simplicity done wrong: Meandering, directionless, trying its hardest to pull something out of nothing and be more than it really is. Entire episodes could be skipped with minimal loss. You can practically see the seams where the plot is stitched together—in the first half of the show, someone is wronged, and in the second half, that someone seeks revenge in a methodical, predictable fashion while everyone else runs around like chickens with their heads cut off. The show's ending is somewhat fitting, but it's also anticlimactic in the first degree, and leaves many questions unanswered. It's insult to injury, and as a result, Shigurui's story is an absolute drag, a bloody, swerving run-on sentence with no period.\\n\\n\r\nMemorable characters could probably dig the show out of the hole, but to call Shigurui's efforts in that area “paper-thin” would be to short-change paper. The leads, Fujiki and Irako, are both tools of the plot, and they bend to its will in completely unreal turnarounds. Irako goes from “sinister, merciless, master swordsman” to “blubbering, defenseless idiot” seemingly at the drop of a hat, and Fujiki, originally the least offensive protagonist, develops into a brutal, sadistic shell of a man for what appears to be no reason whatsoever. Both characters have motivations that are either completely unknown (Fujiki) or laughably simple-minded and one-note (Irako). As previously mentioned, the show would rather spend time delving into shoddily introduced plot elements than fostering any sort of actual interaction between these two characters; it glosses over their development as fellow swordsmen completely, and in the end the root of their much-touted, show-spanning rivalry seems to be limited to “Irako beat Fujiki in a practice match this one time and then Fujiki punched Irako in the face.” They hardly ever speak to each other; the show seems to be going for effective minimalism in this aspect, but it falls short. We know almost nothing about the ideals of either man, and while they might have good reasons to kill each other, the truth is that they're both cold and simple characters to a nearly inhuman degree, and it's nearly impossible to care about them or relate to them in any sense. Add to that some terribly flat supporting roles who seem to exist for the dual purposes of dying gruesomely and killing time while the show struggles to reach the 12-episode mark and you get a lackluster cast that's utterly incapable of picking up the slack left by the similarly flawed story.\\n\\n\r\nIn fact, Shigurui as a whole feels like the result of one big case of writer's block. That there's talent and effort poured into the series is beyond question—the near-flawless artistry, the attention to detail, and the willingness to show things that the audience might not want to see are all hallmarks of a strong creative team. It's even directed by Hiroshi Hamasaki, who managed to score a home-run with similar directorial style in the slow-but-powerful Texhnolyze. I've little doubt that if Shigurui's writing had been handled differently, the show could float above average, maybe even to greatness. I'm all for rooting for the underdog, and I'd love to be able to write a cute blurb along the lines of “despite its outward mask of grotesquely twisted sex and violence, Shigurui has numerous redeeming qualities...” \\n\\n\r\n...but, truthfully, short of the art and the general atmosphere, I just don't see anything worth praising. Shigurui has nothing to say. It has all of the means in the world, but no conceivable ends. It's completely without vision, and as a poor replacement for vision, it reaches onto the shelf and pulls out the book of sheer brutality and shock value. It's the angry pre-teen, screaming (admittedly creative) obscenities, hoping that others will mistake them for maturity. In a sort of sad irony, its positive aspects actually look retrospectively silly when coupled with its writing, like lipstick on a pig. The fight scenes, which amount to staring contests punctuated by swift blows delivered via animation shortcuts, could have been effective if there was any emotion brewed between the characters involved, but lacking that element, they ring hollow. The slow, traditional music and voice-over narration sound absurdly ham-fisted and out of place next to the needless sexual violence. Countless artistic shots of butterflies and cicadas, symbols of change and rebirth, are not a substitute for writing characters who actually undergo convincing development.  The show has zero self-awareness; at its best moments it's a halfway entertaining gut-spiller, and at its worst moments it's borderline BDSM smut, yet from start to finish it operates under the misleading pretense that it's an engaging work of art. In all walks of life it's best not to kid yourself, and I can't help but recommend that if you're going to make something as pointless and mind-numbingly gratuitous as this show, you could at least maintain some honesty about it.",
            "date": "2013-05-20T21:58:00+00:00",
            "helpful_count": 127,
            "mal_id": 97895,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1485537.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mahoganycow",
                "username": "mahoganycow"
            },
            "url": "https://myanimelist.net/reviews.php?id=97895"
        },
        {
            "content": "WHAT YOU SHOULD KNOW BEFORE WATCHING THIS ANIME:\r\n1. It's a very serious anime.  No jokes, all business.\r\n2. There is brief full-frontal female nudity in almost every episode.  Sex scenes are brief, and are presented much like a slideshow of dim, still images.\r\nSTRENGTHS:\r\n1. Production value is obviously very high.\r\n2. Story is solid as long as you watch the entire series within a relatively short span of time.  If you leave too much time between episodes, the story will be harder to follow.\r\n3. If you're in the mood for an intense, violent, and gory samurai anime, this is definitely the one for you.\r\nWHAT KEPTIT FROM GETTING A HIGHER SCORE:\\n\r\nI would have given it an 8 if it had a little bit of lightheartedness.  A hint of humor would have made the characters more likeable.  It would have made the story more interesting too.  I mean, c'mon, even the most serious of movies had a bit of comedy in them.\\n\\n\r\nI would have given it an 9 if the pacing had been a little faster.  The anime drags at times; especially since the director tried to make EVERY scene intense.  The minimalism of the soundtrack exacerbates the sluggishness sometimes.\\n\\n\r\nI would have given it a 10 if the story was exceptional, which it was not.  It ended up being a story of pride and revenge, which most people have seen before.  Still a pretty solid plot though.\\n\\n\r\nRecommended if you're in the mood for something really really serious.\\n",
            "date": "2008-03-10T13:55:00+00:00",
            "helpful_count": 51,
            "mal_id": 3025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bjtdevera",
                "username": "bjtdevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=3025"
        },
        {
            "content": "I was recommended to watch Shigurui, knowing that i like the Edo and Sengoku era i was obviously going to watch it but till i ended the other ones that i have listed but i was told that this was accurate on the dark side of the samurais and how despicable they were and how mature the art and story was, and i was convinced to watch this anime before the other ones.\r\nStory\r\nStory is really mature, it's confusing at the beginning because there are a lot of flashbacks and you don't realise those are flashbacks at the moment but later when you are tying thepieces together you get whtat's happening, may be boring for some people to see that the story advances slowly, but it has something addictive and keeps you watching the next episode, don't expect a happy story, is dark, in the first minutes after the OP of ep. 3, i was ''Oh no, everything but that kind of things'' but i knew what i was into so i kept watching it, the english name of the anime is Death Frenzy, so expect that in cruel ways, the bad thing is that they didn't conclude the story in the anime at least and that can be annoying for a lot of people and i saw it was Madhouse the king of ''Watch this unfinished ending by reading the manga,'cause 2nd season ain't happening son'', yeah they made this anime, and it was like with their 80% of animes they release, they don't make 2nd season, only for the other 20%, so i googled the parts that were not explained and how it ended, overall was great.\\n\\n\r\nArt & Sound\\n\r\nThis two go hand to hand, the dense and dark atmosphere, with a mature art style and the fit music for the samurai theme with sometimes silent parts were great, i'm not fan of the gore, but i didn't mind at all the gore in this anime, because of the samurai theme, it makes sense, it was almost like this back in the era where not everyone were respectable samurais but there was the despicable ones, both Art and Sound were great.\\n\\n\r\nCharacter\\n\r\nI can say that 99% of characters were really despicable, but that's why this is great, it makes you dislike them but at the same time like them a little (well maybe just Fujiki and Ushimata) and you get to see how different they were, i mean different ways of being despicable, Iwamoto and Irako being the most despicable characters, you have to see for yourself, they were great for a samurai setting, as i stated the thing is that they didn't clarify how was it that Fujiki lost the arm (NOT a spoiler the arm lost, you see him for the first time like that on Ep. 1, but they don't explain it) unless you google it or read the manga, and that's what i did to find out, overall was great.\\n\\n\r\nEnjoyment\\n\r\nI really was able to enjoy this, being careful to follow the plot and it was great overall.",
            "date": "2015-08-13T15:26:00+00:00",
            "helpful_count": 34,
            "mal_id": 196073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196073"
        },
        {
            "content": "1st impression:\r\nIt's not your everyday samurai anime, more realistic. It starts off with final battle (didnt show result) for the rest of the episodes to uncover the past. The art is top notch.\r\nBest selling point(s):\r\nI dare to say : All\r\nReason of liking the anime:\r\nI like it because 1st of all i am sick of those wannabe-samurai anime. I heard this is somewhat special and decided to have a go for it. The story telling is so good and pace is well controlled even for a short series anime. The gores comes with some torturings of women( yes , it's somewhat sick anime) and even showeddetailed parts of humans organs when duelers received damage upon duels.  Ah, i forgot to mention the tension created, it works so well with the music copping with the story pace.  I dare to say there're no other better samurai anime than this one.\\n\\n\r\nWhat i Dislike:\\n\r\nSome scenes can be too dark or too bright to be seen.\\n\\n\r\nAdvice(s):\\n\r\n1) Not for women( well if you wanna have a go,be my guest) . For 18+age , Not for wannabe-samurai anime fans or any shounen anime  fans.\\n\\n\r\n2) It's like reading a good novel/story book, so have patience to watch it.\\n\\n\r\n3) The story is good that it makes you wanna watch on, watch slowly or you will finish watching it too soon :P.\\n\\n\\n\\n\\n\\n",
            "date": "2008-01-07T21:02:00+00:00",
            "helpful_count": 24,
            "mal_id": 1894,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19740.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dj_Frog",
                "username": "Dj_Frog"
            },
            "url": "https://myanimelist.net/reviews.php?id=1894"
        },
        {
            "content": "Shigurui as an anime is simply a serious anime. It lacks the humor and the character development of majority of animes - they protagonist with the sense of justice or past that pushes him into a direction or the antagonist that considers destruction of all for his own purposes. If one considers true human nature with all its complexity it is hard to establish an antagonist. Before going further, I will state - and justify later - that Shigurui is underrated.\r\nAn anime should be considered for what it intended to show or depict. Shigurui is not meant to be a fast paced action with Samurai'sjumping around and showing off flashy moves. Neither is it a display of a person's will to fight on and move forward by overcoming challenges. To first give an impression I will say that the anime refers to a believable edo period with skills fearsome and breath taking. Don't expect cut scenes similar to fights typical to One Piece, Bleach, Basilisk or Ninja Scroll (the last two titles for a better comparison). It contains sufficient violence and nudity but for the purpose of a more vivid and convincing plot not for fan service. The pace at which the story proceeds might be considered slow for some but in my opinion it is balanced and is targeted towards people who are more intuitive and let a tale seep in rather than skip scenes to reach the end. Patience is required for a reward as the anime proceeds. It is not for those who prefer first episodes like Deadman Wonderland, Mirai Nikki. I won't go into the details of the story itself. What I will say is that the story is an exceptionally well execution of an everyday attribute of humans: ambition. It combines that with the complex and varying personalities of humans to give a theme that is more or less a commonly occurring phenomenon in places/departments where people compete to rise to the top but is executed with such intricacy that a person continuously wants to know what will happen ahead. That is, if you let the anime display its potential in an episode or two. Having said that, the anime is sadly in complete - the ending which one is looking forward is not reached BUT, DESPITE THAT, the anime does finish off at a point of certain progression. It left me disappointed but did not make me question if I should have watched the anime or not (like it does with deadman wonderland, Attack on Titan for me).\\n\\n\r\nThe art is impressive - the character appearance and architecture is realistic - it tilts towards designs similar to that of Paprika (for comparison) in which proportions are closer to real life and eyes/nose differ from those usually found. The color/hue throughout the anime is dull. It is meant to be that way since the anime takes place in a dark era with most scenes in dojo's and open gardens. The dreariness of dull colors is a perfect match for the atmosphere. Yet the backgrounds are detailed, the art is crisp and impressive. That includes the gore that does not only include splattering showers of blood or non-existent organs/muscles/limbs flying around. Also - with an anime that is meant to depict realistic Samurai scene sequences, \"excessive bloodshed\" is a must. If one wants a serious historical anime with sword fight but lack of bloodshed then I wonder what they are searching for.\\n\\n\r\nThe sound in the anime is meant to compliment scenes. The background chirping of the insects in the morning and occasional slow tune in the background that is barely noticeable again suits and compliments the type of anime this is and is not existent in every scene, every time the protagonist turns around there would be a dramatic bass playing in the background. This is not a suspense thriller of the sort.\\n\\n\r\nThe characters, as has been discussed earlier - are realistic. In what sense? They are not one dimensional. Meaning that they are not unmovable representations of a single goal or vision from which they will not waver. They are not simply distinguished as good or bad. A sense of justice, a code for Samurai has been set in the beginning and it is maintained - death for their master is an honor for a Samurai. The character of Fujiki Genouske is not just of a loyal man. It is of a loyal Samurai with all the restrictions applied. The restrictions do impose certain emotional responses in him (That are subtle to comprehend at the very least) but he overcomes them. Irako Seigen is a Samurai that considers personal gains and goals more important and is impulsive - he does not want to live in the constraints that tie down a Samurai. But is that necessarily bad? Don't we at many times act in such a way that duty is not neglected yet personal gain is also met. In the same way is Fujiki really that good? Is following rules that at times may impart distress on some, really that good? Is it wrong for the Mistress Iku to want to find love, or feel negatively for a murderer of his loved one? The way ambition, emotions and circumstances drive the characters and in turn the story is beautiful.\\n\\n\r\nNow to conclude, where is the enjoyment in this anime? Its the realism of the situation. It is the competition, the fact that righteousness does not always prevail. The fact that this is an anime that does not deal with the super natural yet exhibits skills that one wants to witness again and again. The excitement of waiting for a slash for it determines the fate of the fight. YES, for those that prefer long fight sequences with up's and downs in stamina and dialogues during the fight won't enjoy this. After all this is not devil may cry.\\n\\n\r\nSo I will finally say that this anime is a beautiful execution of a dark period and a sinister story. For viewers of happy, fast paced or supernatural animes, this is not your thing. For patient viewers looking for a more mature yet interesting and deep storyline that challenges the brain into thinking, this is a wonderful anime. Partial, yes, but wonderfully executed till then.\\n\\n\r\nFeedback is appreciated!",
            "date": "2014-01-07T14:54:00+00:00",
            "helpful_count": 18,
            "mal_id": 127727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3229339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NotenSMSK",
                "username": "NotenSMSK"
            },
            "url": "https://myanimelist.net/reviews.php?id=127727"
        },
        {
            "content": "Overview:\r\nShigurui or \"Death Frenzy\" is a...controversial anime. This anime has a LOT of gore, a LOT of nudity and sexual violence, and doesn't exactly tackle its gloomy subject matter with artistic subtlety. Basically, imagine combining the 1990s OVA Ninja Scroll with elements of Rurouni Kenshin, Berserk, and some exploitation movie that the Cinema Snob would review! THAT is exactly what Shigurui feels like to watch! Despite all of this...I actually enjoyed this series. This is definitely not a series for everyone, but it has some positive elements that are truly worthy of praise.\r\nStory:\r\nThe story starts in the year 1629 with a large kendo tournament usingreal swords and matches to the death. This tournament is being held by the brutal tyrant Tadanaga Tokugawa, who is the younger brother of the shogun ruling Japan. Tadanaga was executed for his \"criminal insanity\" and is sort of like Japan's Caligula, so this tournament is not out of place with the kind of deeds commonly attributed to him by Japanese historians. However, that isn't to say that Shigurui tries to be 100% historically accurate. Shigurui will instantly remind viewers of the much more famous Rurouni Kenshin with legendary swordsmen standing around and waiting for their opponents to unleash the \"Super Secret Bullshit Technique\" of the \"Does not exist\" school of sword fighting. Shigurui is infamous for having so many rape scenes, but nothing gets raped worse than the laws of physics in this series! The 2 main fighters in the tournament are long time rivals and mortal enemies. The entire series is a flashback explaining their histories and all the bad blood between them. The main 2 characters are the samurais Fujiki and Irako. Both were once students of universally feared Kogan School of Kendo, which was run by a brutal and completely insane old man named Kogan Iwamoto. Irako was blinded and exiled from the school for cheating with Kogan's mistress and now wishes to annihilate the entire school for revenge. Fujiki is loyal to the school and wishes to get revenge on Irako for killing everyone it it besides him. That's the entire plot! Also this is a condensed adaptation that didn't want to create its own \"filler ending\" so instead it just abruptly ends in the middle of the story! What makes the series interesting is its action, music, portrayal of history, artwork, and believe it or not the questions that it asks!\\n\\n\r\nCharacters:\\n\\n\r\nThe 2 main characters have commonly been compared to Guts and Griffith from Berserk and although this was actually based off a novel far older than Berserk, I can REALLY see why people would say that. Fujiki is a one armed swordsman who is loyal to a fault and against his conscience will carry out brutal deeds if ordered. Fujiki lives on for the sole purpose of getting revenge on Irako for killing all of his friends. Irako is a highly effeminate, Machiavellian bastard that wears lipstick. Irako was born to the lower class, but he is extremely ambitious and charismatic, willing to kill anyone and everyone to rise to the top. However, here is where the similarities end! Fujiki may feel sort of bad for following terrible orders, but he would never quit his master like Guts did after Griffith ordered him to assassinate the Duke. Guts would never follow an order to hurt someone he cares about, while Fujiki willingly held down a girl he liked so another man could rape her. Guts shows a lot of strong emotions and is a Byronic Hero, while Fujiki is NOT portrayed as a hero at all. Fujiki is frequently called a \"puppet\" with no will and ambition of his own, and this is honestly accurate. Irako may share similarities to Griffith, but the show never at any point attempts to make the viewer admire Irako. Griffith has his many \"magnificent bastard\" moments when the viewer is awed by his cunning, intelligence, and skill. Griffith also was shown in Caska's flashbacks to have at one time been a fairly decent person that sort of cared about the lives of his men. Irako is a straight up evil motherfucker. This guy laughably murders a kitten for absolutely no reason! He randomly murders prostitutes and only joined the Kogan School to \"drain everything it had and move on\". To top it all off, he's not even very cunning and is only the 4th best fighter in the series! His revenge only succeeded as well as it did due to random outside help combined with dumb luck. He hires someone to poison the # 3 best fighter, beats the #1 fighter by backstabbing when he was distracted, and gets his ass kicked by the #2. There are some other characters with potential, but the 2 scorned and revenge obsessed female characters don't have enough development. Kogan is a sick old fuck who happens to be freakishly strong, much like Wyald from the Berserk manga. There is a reason Wyald keeps getting cut out of the adaptations! He is a plot device, not a well developed character. Now on to the things this anime really does well!\\n\\n\r\nArt:\\n\\n\r\nShigurui was animated by Studio Madhouse and it looks absolutely fantastic! Japanese characters actually fucking look Japanese!!! People actually have intestines and well drawn organs instead of red paint and indiscernible chunks. When a character gets his head split in 2 we actually get to see a Sagittal Plane view showing everything inside with decent anatomical accuracy! The characters wear clothes that are period accurate and look like some actual thought and effort went into them. The backgrounds are well detailed and aren't marred by horrible use of CG. This was made in 2009 when bad CG, lazy backgrounds, and \"Moe\" absolutely dominated the anime industry. This series took a gamble and it really paid off!\\n\\n\r\nMusic:\\n\\n\r\nThe music is entirely traditional Japanese music that stays consistent with the Tokugawa Shogunate time period. It doesn't switch back and forth between period appropriate music and a really crappy comic relief track played on synthesizer whenever some dumbass appears on screen! This may not sound like much, but seriously I have seen over 300 anime and this basically NEVER happens! \\n\\n\r\nPortrayal of history:\\n\\n\r\nThe days of the samurai in Japanese pop culture, much like Europe's Medieval Period in much of Western literature, is frequently romanticized as \"the good old days\". This was when people knew their place in the world, served with honor, and nobly sacrificed themselves to avoid shame befalling their family. Much like Game of Thrones, Shigurui rejects this nostalgia and shows the poverty, disease, filth, and low quality of life that the ordinary people of this period had to suffer through. The author of the original novel was named Norio Nanjo and he was a Japanese soldier in China during WW2. He felt it was unjust that Japanese history at that point solely focused on Emperors, Generals, and the people at the very top. The life of an ordinary Japanese soldier or the civilians they massacred weren't written about and historians simply didn't care about that part history. Nanjo not only wished to show history from the perspective of the common man, but also to reveal the whole truth and not conceal any embarrassing details. For example, Shigurui actually has the balls to mention that samurai very commonly had 5-10 year old boys as assistants called \"wakashu\". A samurai was fully expected to have anal sex with their wakashu in order to teach them submission and loyalty to their master. In addition to this, most respected samurai did NOT remain faithful to their wives and visited prostitutes FREQUENTLY. I'm not talking about Geisha for music and conversation, I mean actual prostitutes! How about the fact that women in Japan until the Meiji Period would purposely blacken their teeth because blacker teeth were considered more beautiful? In a country like Japan with such reverence for ancestors and history, to show the naked truth and not polish up the unpleasant details is a rather bold and commendable feat!\\n\\n\r\nPhilosophy:\\n\\n\r\nThere is no good and evil in Shigurui. Instead we are left to decide which is worse: a man who will follow any evil deed like a robot, or a man who commits evil of his own volition and cares only for himself. Neither is portrayed in a flattering light and no answers are definitively given here. Normally the concept of absolute loyalty is revered in Japan, but after personally witnessing the actions of the Japanese Army in China and the willingness of soldiers to follow the \"Kill all, Burn all, Loot all\" policy, Nanjo began to question this supposed truth. In many ways, the simply evil and selfish character Irako is actually the anti-hero and chief protagonist of this story for rebelling against the Japanese cultural principles that led to the deaths of over 10 million civilians in just a few years. This is a rather interesting question and not one that is frequently brought up either in Japanese media or elsewhere. The supposed hero of the story Fujiki is someone the viewer grows to both pity and despise for embodying what is almost always portrayed as a great trait in anime. \\n\\n\\n\r\nOverall:\\n\\n\r\nWho would have thought that an anime that features a martial arts master karate chopping a prostitute's nipple off and then eating it would cause the viewer to reflect and think?! I really would have preferred that the anime had more episodes and completed the manga instead of remaining faithful for the parts that it covered... but just abruptly ending. However, the fact that this wasn't a big hit in Japan and didn't get a sequel isn't the fault of Shigurui. It is the fault of consumers that demand Ikki Tousen have 5 seasons and frequently neglect more worthy anime. This is certainly a series with some big flaws, but as I explained I also really loved some aspects. It is certainly a series I would recommend checking out, as long as you have a fairly strong stomach that is!",
            "date": "2015-09-27T15:59:00+00:00",
            "helpful_count": 17,
            "mal_id": 199890,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=199890"
        },
        {
            "content": "Shigurui (Death Frenzy): Reviewed\r\nAuthor: Takayuki Yamaguchi\r\nAnime Director: Hirotsugu Hamakzaki\r\nOriginal Run: July 19, 2007 – October 12, 2008.\r\nGenre: Chanbara\r\nEpisodes: 12\r\nPlot:\r\nIt’s often said that “The way of the samurai is found in death”, Shigurui is tale set in the early 1600 hundreds that beautifully foretells the ideology of a samurai’s life through renowned artistic violence. The premise of the show is centered around a duel between two master swordsmen, Gennosuke Fujiki a one-armed swordsman, and Seigen Irako a blind swordsman with an almost crippled foot. Through foreshadowing story telling the series gives birth to a magnificent plot. The plot then, guides the path for the young masterswordsmen, Gennosuke Fujiki and Seigen Irako with a display of sensational visuals and an in-depth mastery of outstanding artistic showmanship, as they showcase their ability, courage and loyalty in hopes of grasping an unrivaled set of skills.\\n\\n\r\nCharacters:\\n\\n\\n\r\nGennosuke Fujiki: Voiced by: Daisuke Namikawa (Japanese), John Burgmeier (English)\\n\r\nThe protégé of the kogan dojo and the ideal candidate that’s most likely to inherit the dojo. Through out the series, Fujiki is portrayed as a calm and rational figure that never allows his emotions to dedicate the pace of his judgment. His ability to wield the sword is uncanny, and his compassion towards his fellow comrades is heartfelt and sincere. Amongst these admirable traits, the one that shuns his other noble traits, Is Fujiki’s loyalty for his master Kogan.\\n\\n\r\nSeigen Irako: Voiced by: Nozomu Sasaki (Japanese), J. Michael Tatum (English)\\n\\n\\n\r\nAn aspiring master swordsman, whose methods of reaching a profound goal lack proportion. In the series, Irako’s ideals are encompassed in the sense of deceit, betrayal, and utter disloyalty for his master. Not only does he lack a sense of cultural value, his actions often, are very impulsive, as if they required a sense of instant gratification. The desire to reach a higher plateau is very demanding, and treacherousness is often a counter productive method that is likely to hinder progression. The noble path Irako walks requires a sense of self-acceptance, prudence, and mutual respect between pupil and master, traits that Irako profoundly lacks.\\n\\n\r\nKogan Iwamoto: Voiced by: Seizō Katō (Japanese), Jerry Russell (English)\\n\\n\\n\r\nKogan Iwamoto is the headmaster of the Kogan-Ryuu school. He is a fearsome person whose mastery of the sword is regarded as unrivaled. In the series he’s depicted as an unbalanced figure who’s suffering from dementia: and once a year he breaks free from his uncertain slumber to oversee his dojo. He constantly wishes for a strong breed which in turn will oversee the dojo in his demise. To ensure the success of this, Kogan treats daughter as an instrument that is bring forth this vital breed.\\n\\n\r\nMie Iwamoto: Voiced by: Hōko Kuwashima (Japanese), Laura Bailey (voice actress) (English)\\n\\n\\n\r\nMie Iwamoto is loving daughter with an infinite sense of pride. She tends to her father when he’s in his dementia state, along with the aid of Fujiki. Mie is portrayed as a maiden of staggering beauty that is lovely as the autumn rain. The Kogan-Ryuu school’s survival rested solely on her shoulders, as the presupposed offspring she is to produce would be the future of the Kogan dojo.\\n\\n\r\nSummation:\\n\r\nTo amass an unprecedented amount of artistry of violence through remarkable story telling is an astounding achievement that requires profound dedication and a level of sophistication that is almost impossible to reach, but Shigurui with ease, was able to capture all of these requirements. The bloody path of a samurai’s a life was captured instantly from the get-go of the series, until it reached its wondrous climax. The aspect of a samurai’s life was ensnared wonderfully with phenomenal storytelling that captured the core of its ideology.\\n\\n\r\nTheme:\\n\r\nThe society we live in today follows many ideologies that are coherent to our present time, but Shigurui strongly introduces its audience to a style of ideology that will surely appear to be morally twisted, and completely unnecessary. The series offers several valid themes that can relate to how our society behaves in the current times, but the main theme it wonderfully depicts, is the resolute and harmonious loyalty that a samurai wholeheartedly adheres by. This distinctive quality was terrifically exposed through out the series, with events that tested a samurai’s physical and mental tolerance for his master. Shigurui magnificently delivers this profound and rich artistic representation of the early 1600 hundreds with immense success, and it paints how marginally the ideologies of the past were regarded with great ambition and respect, a rare trait that our self-imposing society lacks.\\n\\n\r\nMedia Related:\\n\r\nWith a stellar star mesmerizing image, Shigurui showcases a marvelous prospective through beautifully realized violence. Visually astonishing, artistically inspiring, these are the stupendous rich traits that the series embodies. The visual aspect of the show is demonstrated constantly with revered artistry that marvelously appears to be as graceful as the left hand of Rembrandt. Shigurui is a phenomenal work of art that is worthy of the highest recognition.",
            "date": "2010-02-11T21:06:00+00:00",
            "helpful_count": 16,
            "mal_id": 23171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JustJuice",
                "username": "JustJuice"
            },
            "url": "https://myanimelist.net/reviews.php?id=23171"
        },
        {
            "content": "Blood, boobs, and bad asses. Shigurui is one manly animu, no question. Unfortunately, it is also historically accurate. I say unfortunately because while it is refreshing to see a samurai series take the-path-less traveled (no quiet, morally driven heroes here), its still an unpleasant ride that insists on showing the uglier side of things.\r\nThe first episode of the story is set in the early 1600's during the Tokugawa years. One of Tokugawas crazy brothers decides hes going to hold a tournament, but the competitors will be using real swords instead of wooden ones. This is misleading. There is no tournament and you don't even getto see the climax between the two main (in name only) characters. Instead, we're brought back in time to tell the story between the two main characters.\\n\\n\r\nFujiki Gennosuke is the number one pupil of his dojo. Irako Seigen appears and challenges Fujiki for that spot. Their sensei has a daughter, Mie, and the succesor to the dojo not only gets her, but the land, prestige, and power that comes with her.\\n\\n\r\nPretty simple plot thats not too difficult to follow. However, reading this you might believe that Fujiki is the hero of the story. That is not so. Fujiki is portrayed throughout the series as a serious, silent puppet...ironic, considering at one point in the series he is deemed the only non-puppet in the dojo. He does, on occasion, show anger, but beyond those few short snippets he has no personality and no background. We are never told why he his training to be a great swordsman or what he wants out of life or whats driving him. He perhaps was to be enigmatic, but instead he came across flat and 2-dimensional.\\n\\n\r\nInteresting to note, Fujiki began showing signs of some typical samurai honor early on,  but any inkling of that was dashed away the moment he felt content defeating a weakened rival\\n\\n\r\nOn the other side of the coin, the main villain, Irako Seigen, has a wealth of history and personality. We are told who he was, who who wants to become, where he came from and where he wants to go. In the course of the series, Irako is betrayed by his dojo and destroyed by them. He later overcomes his injuries and handicaps to take his revenge. As a result, Irako comes off as the true hero of this series which I do not believe was the intention.\\n\\n\r\nThe other characters fill their roles well and a simple story is told in detail. That means theres a lot of slow spots in this one folks. Yet, with everything moving so slow, the story often crescendos violently into epic scenes with massive blood loss and gore. The contrasts are well done and make the bloodletting far more effective.\\n\\n\r\nOverall, this is an animu for samurai fans. It is very rare that you see what samurai were actually like and not the fantasized ones we're used to seeing. However, you have to take the good with the bad, and thats experiencing and acknowledging the widespread practice of homosexuality as well as acknowledging that honor wasn't practiced to the extent we've been led to believe.\\n\\n\r\nFor everyone else, I'd recommend to avoid this one. It is well animated, the music is great, everything about it works well...its just a question of taste. It is slow and blurs the line between good and bad to the point where the &quot;bad guy&quot; is far more heroic and interesting. There is a slight incestuous element but no real romance. There is a ton, A TON, of gore and blood and grotesque, wincing scenes that could just make you sick. \\n\\n\\n\\n\\n",
            "date": "2009-01-22T21:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 11774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Redward",
                "username": "Redward"
            },
            "url": "https://myanimelist.net/reviews.php?id=11774"
        },
        {
            "content": "The first thing that struck me was the opening to Shigurui. Immediately, the colourful and stylistic scenes and art was inviting. Unfortunately, it was followed by rather bland, mid-toned artwork. Although there were redeeming factors in the actual visuals, like detailed environments and facial expressions, the overall feel lacked any invitation. Nothing immediately caught the eye other than the constant snowfall!\r\n The second thing that impressed me immediately was the sound. The background music was very refreshing, and more importantly true to the era depicted in the setting. But again, it failed to hold its own became it became extremely monotonous by the endof the first episode. It was almost like a very good loop was played throughout the series. This caused many awkward moments where the music did not match the scene appropriately.\\n\r\n  The character development was almost non-existent. There was very little evolution of any type. Other than perhaps two of the characters, there was also a dire need for more emotional voice-acting in order to instill some life into the inhabitants of the dojo, the focal setting of the series. Due to a problem with the chronology of the story, the viewer becomes even less involved.\\n\r\n  As far as the animation was concerned, the majority of the effort was put into the action sequences. Yet again, this factor of the anime failed to deliver. Although a unique and interesting method of representing the tension before each fight was used, the fights usually lasted about a second or two with very little actual animation, which doesn't say much about the rest of the anime.\\n\r\n  There is a decent amount of gore, and the faint of heart are warned to stay away if that is not your cup of tea. One particular molestation scene stands out as one of the most blatantly gratuitous scenes in any anime I've watched recently, and I can handle a lot of disturbing violence. I can't help but think that it was used for shock value rather than being an integral part of the story.\\n\r\n  Overall, I had to force myself to get through the coma-inducing pace of the entire series. All that was left was a bitter taste of needless gore, and confusing story-telling with a few artistic qualities worth mentioning. I strongly recommend looking elsewhere if you're looking for a historic anime revolving around the patriarchal society in a dojo, with a peppering of inadequate samurai action sequences thrown in for giggles.",
            "date": "2008-06-15T11:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 5509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68619.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/agphoenix",
                "username": "agphoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=5509"
        },
        {
            "content": "Simply, the first thing to consider is that this anime is composed largely of some of the most graphic scenes of violence in the industry. It also is fairly free in its portrayal of sex and thus I would instantly dismiss it if you do not care for these things. In watching Shigurui, they cannot be avoided.\r\nIf this does not concern you then you will certainly appreciate the art, the degree of artistry and realism in the violence alone justifies a high rating, entrails feature heavily. Otherwise the anime is generally graphically pleasing, the general Edo period scenery is well presented the characters are verywell drawn and this makes it all the more disturbing when they near-inevitably breathe their last. Fans of period drama will appreciate this one without a doubt.\\n\\n\r\nThe story is not so engrossing, partly because it is confrontation that drives the storys events rather than actual intrigue, but as a device to tie one bloody murder to another the plot is more than sufficient and fairly well written. Ultimately, there are samurai, sword-lineages, secret techniques and endless betrayal as one would expect from a good example of an Edo period anime. The truly exceptional part is that they have managed to make it more violent than ever, showing us that there is truly no upper limit.\\n\\n\r\nThe sound blends  beautifully with the horror of the visual situation and highlights just how disgusting what you are watching is, in case you had forgotten. Traditional japanese sound effects and music underscore the whole thing.\\n\\n",
            "date": "2009-03-19T08:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 13305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Starstriker6666",
                "username": "Starstriker6666"
            },
            "url": "https://myanimelist.net/reviews.php?id=13305"
        },
        {
            "content": "Before the main body of my review, there are two things to note:\r\n1. This review represents the opinion of someone with very little knowledge of Japanese history and who didn't read up about it before watching the series. It's not like I actively try not to have a sense of the context, it's just that I believe that I shouldn't have to know all about the historical background of something before I watch an anime about it, as it's essentially fiction and should really be good enough to keep me entertained without that. So this review represents my opinion of this anime as a pieceof entertainment in its own right. If you did read up on Japanese history before watching this, fair enough, I'm not having a go at you, it's just not something I do.\\n\\n\r\n2. People keep going on about how realistic this series is. It isn't. You get impossibly strong punches, razor-sharp hand swipes, special moves that are somehow unblockable, and more. It does, however, feel fairly real in that people don't go jumping 30m into the air or shrugging off fatal wounds.\\n\\n\r\nNow, onto the review: I watched this series because I wanted to watch a samurai anime that wasn't too stylised, i.e. without superhuman jumping about and ridiculous attacks. Shigurui sounded like it fitted the bill (and close enough did, I suppose), so I watched it. It's told in the form of starting at the chronological end of the series, and showing the events leading up to it in the remainder of the series. More on why I scored its story so badly later.\\n\\n\r\nShigurui's art was good, albeit fairly bleak. It had some nice scenery, and characters were drawn well. As others have mentioned, very often a scene would be so dark that you literally couldn't see what was going on, which was really rather irritating, necessitating turning down the contrast, leaving fuzzy outlines of figures. The series' animation was also good, with little repetition and smooth movement. \\n\\n\r\nShigurui had fairly standard voice acting, which stood out in netiher a good nor a bad way: neither was it surprisingly good, nor did it ever detract from the series. The score was very atmospheric and fitted the series well, so as a score it was excellent. As music, it wasn't all that pleasant to listen to, but it fulfilled its function well.\\n\\n\r\nThe series as a whole is very well put together in terms of cinematography, art, etc.\\n\\n\r\nWhere it all goes wrong is with the story. It's nothing original, which isn't usually a major problem (almost everything follows some sort of template), but here, I think originality is one of the few things that might have saved this series. By the end of the second episode, you can deduce roughly what will happen throughout the rest of the series, meaning that it feels more like atmosphere and build-up than a plot. But this build-up comes to nothing: you might expect there to be some closure for the series, but it just tails off, so you end up wishing that they'd at least covered some new ground. Imagine a version of Reservoir Dogs where you neither find out just how they got to the safehouse, nor are you shown much of what actually happens when they're there. You'd think that they'd show you what happened to Fujiki's arm and Irako's leg, but they don't. You might have some sort of insane idea that they'd show you what the outcome of the battle, to which it all feels like it's moving, was, but you don't see this either. It doesn't end at the place the series began. It doesn't even end anywhere near there.  When I watched the end, I was sure I'd missed an ep, but I hadn't. It left me with a horrible mixture of disappointment and emptiness, and the bollocksed up ending made the bits of the series I had enjoyed feel shallow and pointless. I have a bad taste in my mouth when I mention this series.\\n\\n\r\nMy overall score of 6/10 reflects the juxtaposition of some really rather good atmosphere and art with a deficient storyline. Almost everything I've watched comes from recommendations from close friends, meaning that I've seen almost exclusively what I would call good stuff, but this is the one series I would not recommend to my friends. Maybe it's someone else's cup of tea, but it's certainly not mine.",
            "date": "2009-01-15T15:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 11525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/121481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiskyBusiness",
                "username": "RiskyBusiness"
            },
            "url": "https://myanimelist.net/reviews.php?id=11525"
        },
        {
            "content": "At first glance this anime is much like any other samuria based anime. But as soon as the first episode you are thrown into a chaotic world where you literally have no clue what&rsquo;s happening and why it happened. That perhaps being the strongest point of this anime, the story is amazingly well done, that it always keep you interested. Like some invisible grip over you, it keep you coming back for more and more. However I will say this, this anime is not for weak hearted people and definitely not for anyone under 18 years old. Itcontains a very mature theme. Bloods, severed limbs, wild emotions, sex and everything else you can think of, you will see it in this short 12 episodes series. The story line is also somewhat hard to understand at first, but I promise you that if you watch this anime carefully, by the end you will understand everything. \\n\r\n    There is one drawback however, it&rsquo;s only a 12 episode series. In the end when it&rsquo;s all over and enough blood has been spilled, this anime leaves you with the feeling that something is missing, and you will definitely wish there was more. Perhaps that is the real drawback of this anime, its only 12 episode and when it&rsquo;s over you wish for more. \\n",
            "date": "2008-03-08T11:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 2974,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39935.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ShadowLone",
                "username": "ShadowLone"
            },
            "url": "https://myanimelist.net/reviews.php?id=2974"
        },
        {
            "content": "Shigurui is known for its gore, and I mean there's no other way I can put it - - IT'S **** GRUESOME.\r\nProduced by Madhouse in 2007, it spans 12 episodes of asking yourself: \"What's going on?\" Never has there been a series that kept me up all the way, not because of all the blood and insides lying around, but because of its cruel, yet realistic nature. It's most definitely the epitome and the first anime that comes to mind when talking about the anime that present the harsh realities of the world.\r\n[Story: 8]\r\nNothing much has to be said here, except that apart from theinfamous first episode, it's a pure psychological, thrilling, captivating, never-NOT-to-be--terrified mind***k. It kicks off with a fight between two samurai: Irako Seigen and Fujiki Gennosuke, not with wooden swords or anything like that, but with real ones. We never get to see the winner (because Madhouse ofc, lol) though. There's a lot of drama going on behind the scenes with the grandmaster of the school the young samurai apply to, Iwamoto Kogan, who also has dementia. I won't be spoiling any more stuff, because there's a lot. The final fight is also noteworthy, as it is singlehandedly.. PHENOMENAL.\\n\\n\r\n[Character: 9]\\n\\n\r\nThe characters of this anime are not directly likable.. at all. What impressed me are the distinct personalities and their motivations, fused with the fact that they are simply the complete opposites of each other. That causes, apart from the unpredictability of the story, that there's always for tremendous character exploration. This anime does an amazing job with its main cast, the two samurai, and of course the zombie grandmaster.\\n\\n\r\n[Sound: 8]\\n\\n\r\nWhat can I say, I mean the voice acting is great, the soundtrack is very solid, but it's lacking good sound effects in my opinion. The opening song is also good, although it's just an instrumental.\\n\\n\r\n[Art & Animation: 10]\\n\\n\r\nWhat can I say.. It's Madhouse, of course you're gonna get good animation and, in this one.. Especially art. This department really exceeded my expectations. The dark tone is genius.. For real, it's just done too well, the color pallette is also something worthy of mention. I personally believe it's the best animation Madhouse has ever done.\\n\\n\r\n[Enjoyment: 6]\\n\\n\r\nPretty much as expected from a series like this. It's not bad, but certainly one of the least enjoyable show ever, because of what it presents and the way it executes.",
            "date": "2019-05-04T11:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 307776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7584996.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dnd_18",
                "username": "dnd_18"
            },
            "url": "https://myanimelist.net/reviews.php?id=307776"
        },
        {
            "content": "To preface this review, Shigurui portrays violence with extreme detail. \r\nEven if you are someone who can endure graphic depictions of violence, I would caution you that Shigurui takes it to places that are unnecessarily vicious. I am someone who has a strong stomach, but this show made me wretch nearly every episode. Despite the disturbing imagery, the series does nothing with it, instead relying on shock factor alone to keep people interested. If the violence somehow supplemented a meaningful story, I might have given it a better rating, but nothing in this show is coherent and often feels like gore is just a cop-outfor lack of narrative.\\n\\n\r\nAdmittedly, the show started off from a relatively interesting place. A Lord is holding a tournament that involves his samurai , but where these were originally fought with wooden swords, he has altered the rules for them to fight with real swords instead. To augment this story, Shigurui attempts to show the politics of the period, as well as add to the development of the characters that will be fighting against each other, through flashbacks. Seems pretty cool, right? Unfortunately for you, there is nothing interesting in these flashbacks at all. To sum up most episodes, it's a camera pan between two rival warriors until the screen goes white, a sword slash occurs, and someone's head rolls onto the ground. \\n\\n\r\nAs for the soundtrack and art, they are both just as dull as everything else. The soundtrack is usually just a bunch of cicadas and a couple smacks on a drum; not much else to say there. The art is just as lackluster, being almost completely washed out, save for the few moments where blood is splattering all over the screen. They made sure to make that nice and bright for you, just in case you missed that eye explosion scene. It was clear they were trying to emphasize it through their color choices, but it doesn't save Shigurui from having distasteful art all together.\\n\\n\r\nTo sum it all up, I cannot recognize any redeeming qualities in this anime. Many tout this as a mature series, but it just seems like they used an uninspired narrative to justify making unreasonable amounts of graphic violence and sex. If you feel like you can stomach the show, then run through the first episode and see what you think. The first episode is about the same pace and tone of the rest of the episodes, so if you like that, then you'll like the rest. Other than that, I would stay away from this one at all costs.",
            "date": "2017-02-12T16:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 240452,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5142431.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/OnlyFestive",
                "username": "OnlyFestive"
            },
            "url": "https://myanimelist.net/reviews.php?id=240452"
        },
        {
            "content": "Randomly picked to watch, I don't know for how long it has been on my list or how it got there, but after watching the first five minutes of the first episode of Shigurui (or, as I would call, \"Tits and bowels\") I thought \"damn it, it is directed by the same guy from Texhnolyze\" and I was right... it looks like Hamasaki's speciality and main goal is to make you drop his series at the first episode, the torturous slow pace and cryptic direction, how he goes on and on barely developing anything, can only be endured because of the trully astonishing art andmusic that accompanies his work, and for knowing him I knew I'd also be greatly rewarded with the story development once enough pieces of it were presented if could just endure this beginning. So be wary of that if you pick it to watch.\\n\\n\r\nShiguriu takes place in the Edo period and feels like a classic novel, it's not an adventure nor action packed, and after watching it I went straight to the manga (you will know why if you watch). The manga is a masterpiece on its own, and I thought how hard it would be build up the tension and suspense as Hamasaki does in the anime without the aid of timing and music, but then I realized the real challenge might have been how to transfer all the emotions to the animation without the use of a narrator. Even if the manga was completed by the time the anime came out (it wasn't), Hamasaki's directors cut couldn't be more precise, and it was trully a superb adaptation, extremelly faithful but at the same time bringing this historical romance to new heights thanks to his skillful direction.\\n\\n\r\nI still loathe the slow pace and crypticness, and think for this series too the whole thing could be fit into a single movie and that movie would be awesome. Hamasaki became someone I love to hate, but now I'm left to wonder if this part is not a necessary contrast to reach a greater climax.",
            "date": "2018-12-13T18:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 295735,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5103626.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PxHC",
                "username": "PxHC"
            },
            "url": "https://myanimelist.net/reviews.php?id=295735"
        },
        {
            "content": "The only real thing that could throw people off of this anime is that they are all used to fast paced manly men jumping around showing off their entirely unrealistic swords man skills (that was a shot at Mugen from Samurai Champloo, by the way). Most people would find this show slow and boring or grossly disgusting. However, what they fail to realize is that those are very human things, humans are dirty and seemingly boring. \r\nShigurui is undoubtedly the most realistic vision of ancient Japan that I've ever come across, where honor is everything and real old delirious old men drool and soil themselveswithout shame. \\n\\n\r\nWhat really got me was the way sword fighting was portrayed, as mentioned earlier, the sword fights were subtle, albeit highly stylized. That is as real as you can get to true samurai. The art of swordsmanship was just that--an art. It was supposed to be a poetic act of a one on one duel between warriors. It thrilled me to no end how they pulled it off in Shigurui.",
            "date": "2009-01-09T19:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 11284,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6550.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Amerowolf",
                "username": "Amerowolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=11284"
        },
        {
            "content": "I've heard a lot of bad things about this anime, admittedly, the violence might be seen as a little shocking but it's nothing to get over-sensitive about. Besides, although the hyper-violent side of the series is what seems to get the most feedback, the story itself outweighs the brutal aspects of the series to a point where the violence really didn't interest me. I thoroughly enjoyed this short little series and didn't expect to after the first episode. But, from then on, the story slowly weaved it's way in and had me hooked. I'm a fan of a proper, serious samurai movie and this wasdone as a samurai series should be. It reminded me of a Kurosawa samurai movie. Very slow-paced and I think it worked well that way. Very strange at times but also thought provoking if you're into the psyche of a samurai. Much like Texhnolyze, the characters are cold, at times, probably quite dull to your average anime fan. You never really know who to sympathise with, if any. If Lone wolf and cub had ever had an anime series made, it would have been great if it was made in this style. My main gripe with the series is the hugely disappointing ending but I guess that's what you get when the manga is still going. It's a shame, one more episode probably would have done it but I'm hopeful that a second series will get made someday.",
            "date": "2010-03-13T15:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 23943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304186.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuvie",
                "username": "Yuvie"
            },
            "url": "https://myanimelist.net/reviews.php?id=23943"
        },
        {
            "content": "ok.... so the Tokugawa (Edo) Period, in a nutshell, was more-or-less peace from 1600 to 1867.  this story takes place during that time period.  the drama of deceit and betrayal run deep in this plot.  this show is not typical by any means.  if you are not Japanese or do not understand Japanese historical culture, you may want to do some research into the culture.  this show is very true to Japanese theater from music to character's actions.  this is NOT a Naruto or a Bleach type show; DO NOT EXPECT IT OR COMPARE THIS TO THOSE TYPE OFANIME!!!  they do not compare to what this show has to offer to the viewer.",
            "date": "2010-08-08T09:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 29428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jazz007",
                "username": "Jazz007"
            },
            "url": "https://myanimelist.net/reviews.php?id=29428"
        }
    ],
    [
        {
            "content": "Popular to contrary belief, Japan's Tokugawa (or Edo) period, wasn't all about fancy clothes and fairy tales at all. It was a time when honor and loyalty ruled in a man's world. Where women were treated as mere objects and held rather little to no power. And being formal with your enemies was as common as wielding a blade. This story basically follows the trials and tribulations of two warring clans rife with sex, lies, and deceit. \r\nDon't get me wrong, Shigurui isn't a complete historically accurate show, but it's damn close. Starting off with the music, its very reminiscent of something you would hearstraight out of a Japanese stage opera and sets the mood and pace perfectly for this show. If you turned off your monitor you swear you were watching a Japanese play unfold before your very ears its all a beautiful experience. Even the cold silence can emit a feeling unlike any other. \\n\\n\r\nThe actual sound effects of the show are also very play-oriented. It's usually silent with the exception of the actors playing their role, but when there are sound effects they are  usually very subtle, environmental, sound effects like wind rustling, or flames snapping, or even the sound of gravel being undisturbed beneath a warriors feet. Less sound in this instance is good as it gives immerses the viewer in to such an intriguing drama.\\n\\n\r\nThe voice acting are all top notch as well. I'm not a big fan of a mostly male seiyu cast, but all the voice actors play their part with such passion and seriousness that I am not very accustomed to. Albeit its not very hard to act as a badass or a madman with very little lines in every episode. Compared to all the cute loli anime being released in droves recently, this is a very welcome change of pace. \\n\\n\r\nFrom the beginning of the opening credits, one can already see that they are in for a visual treat. Its not often that you get to experience something like this. EVERY scene in this show is so beautiful that each cel can be a masterpiece in its own right. The background art is so pretty you swear you've seen the art off a history text or a museum its that immaculate. Even every camera angle has its own beauty and flair. To add to its historic feel colors are pretty limited to a neutral tone (brownish green tinge) more reminiscent of tapestry paintings of the time. Apart from the background art, the character art has its own beauty and uniqueness not found anywhere else. Each character (including stand-in's) are all drawn with the utmost care. Wrinkles, shadows, beards all drawn in with large detail. Each person looks completely unique from their eyes hair and face, all the way down to their clothing (with unique patterns and colors) and sandles. Little forewarning there are a lot of adult situations including violence and sexuality, but they are all there for reason. Even if its only there to show how brutal and harsh (yet elegant) the Edo period really was. \\n\\n\r\nThe story itself is a rather hit and miss mostly because  of the &quot;Tarantino&quot; effect they did with the main story. After a few episodes you almost forget about the main story. But how they skillfully use art and sound and voice acting in every episode the viewer is more drawn to the situation at hand rather than what happened 4 episodes ago. It can be intriguing for some and a turn off for others. But I really appreciate the detail and accuracy they try to pull off with this show. Now I'm no expert in the Tokugawa period or Japanese history in general,  but I am a decent history buff and know more than enough to truly appreciate an epic such as this. \\n\\n\r\nFor you kiddies expecting to watch something like bleach or samurai champloo or even Inyuasha, i highly recommend reading up on some good Japanese literature.  Namely, Amaterasu, List of Divinities, or Kojiki (they were required reading for my uni). Or wiki up some Tokugawa period history (specifically Kan'ei)  if you don't feel like reading up on such historic pieces. As for everyone else, I highly recommend watching this as this should be one of the best examples on how to do an artistic anime. Don't expect much in terms of pace, treat it like you were watching a stage play on your pc. One word of caution, be prepared to experience cold, brutal, reality",
            "date": "2008-05-15T19:21:00+00:00",
            "helpful_count": 312,
            "mal_id": 4762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4762"
        },
        {
            "content": "Do not drop this anime, endure a few episodes! (Assuming that you are aware that this one has maybe too much gore/blood/violence!).\r\nThis anime has one of the greatest plots  I have ever seen (and not just anime), every scene is there for a reason and a part of the complete picture. So, from my! point of view Shigurui is underrated.\r\nWhy?\r\nLet me tell you how I started to watch this one; I wanted to watch something with samurais in it and started to watch Shigurui as a coincidence.  The first episode was just awful, I did not liked it at all; too much blood,too much violence(I even covered my eyes with my hands instinctively at some scenes). So at first it was just an anime that was tried to be made interesting using lots of unneccessary disturbing scenes, so I nearly dropped it but still there were some interesting things (or lets say unexpected character reactions) so I could not drop the series as a result... Next day I had nothing to do and so I took a deep breath and resumed watching it but after a while the general atmosphere of the anime got me very very interested. The story was very solid not to say disturbingly unique (due to the realistic reactions of the characters maybe;  not the usual either black or white characters but ones with shades). The art was top notch as the sounds (no music at every scene, sometimes just sound of cicadas -though I found them rather annoying-  but perfect both for reflecting the mood and complementing the plot). \\n\r\nSo before I realized, the series was over and I was awestructed, cause I did not get the ending at first. But after 5mins or so I started to remember scenes, scenes from first episode, scenes from 5 th or 9th episode and I just got it. It was like oh my gosh ( stupid sentence but describes my feelings precisely). So watch it till the end because the masterpiecycity (copyright at Guuguk) of the series is increasing exponentially. \\n\\n\r\nThis is a very sophisticated anime which might be enjoyed by careful and patient viewers only, so take notes :), take a deep breath and complete the 12 episode in e few days (to avoid the 'baccano effect') \\n\r\nSo finally :) the process of watching was hard for me due to the high gore level but it was worth it! This is one of the stories that I will possibly remember for a long long time, not for the story itself but for how it was told...  \\n\\n\\n\r\nPS: I admit that I am not familiar with the 'actua'l Edo period (I learned a little bit in Kenshin though :) ) but still the value of the plot is unbelievable and it is just fiction right.\\n\r\nI did not give examples from scenes and stuff, just to avoid giving any spoilers, which might really spoil the ' it was like oh my gosh' effect... \\n",
            "date": "2008-11-25T14:53:00+00:00",
            "helpful_count": 163,
            "mal_id": 9841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GuUguk",
                "username": "GuUguk"
            },
            "url": "https://myanimelist.net/reviews.php?id=9841"
        },
        {
            "content": "Among the numerous things a review is supposed to accomplish, there's this: Give the reader a sense of what to expect from the content that's under examination in order to help them determine whether or not they should dedicate their valuable time to checking it out. To that end, I'll try to steer some poor souls away from trouble immediately by saying that Shigurui contains a massive amount of exceedingly gruesome gore as well as all manner of violent sexual predations, and in many cases  those two things appear onscreen simultaneously. If you have a strong aversion to the stomach-turning, you can probably justcontinue on your merry way, because this show is two cuts above grotesque. That being said, I don't believe that art is under any obligation to be shiny and happy, and content of a violent and brutal nature doesn't necessarily make something “bad” (although, in this instance, the point is a little moot). But for anyone who remains undeterred, there is an actual review up ahead.\\n\\n\r\nTo say that Shigurui has high production values would be an understatement. Even by the standards of the frequent overachievers at studio Madhouse, Shigurui is looking at “high production values” in the rearview mirror half a mile back. It's a shame that much of the show takes place in dimly lit dojos and huts, because the outdoor backgrounds are nothing short of gorgeous. I'll be blunt in saying that the character designs are repulsive—everything about them is exaggerated, and from their overblown facial features to their overly pale, shiny skin, they look more like wax caricatures of humanity than anything else. Given the show's general love of putting the disgusting on display, I'd wager that this is intentional, and while the designs aren't aesthetically pleasing, they're fitting, and their remarkable level of detail and consistency can't be denied. The one artistic aspect where Shigurui falls a tad short is the animation; on the rare occasions where fluid animation is actually present, it looks great, but unfortunately the series defaults more to blink-and-you-miss-it shortcuts and fades for its fight scenes, which are less than enthralling (more on that later).\\n\\n\r\nShigurui is musically minimal. Most of the score consists of slower, more traditional Japanese music. Ominous drumbeats and strings are par for the course, sometimes punctuated by a deep, wailing chant. Atmospheric sound is common and used to good effect, with the old standbys of keening cicadas and chirping birds being the most noticeable. Some of the show's better music actually comes in the form of rhythmic folk songs sung by field laborers or village children as the samurai pass them by. To some degree, this befits both the setting and the “slow but violent under the surface” nature of the series.\\n\\n\r\nAnd now we come to the writing, which, for the most part, is where I lose the ability to say anything positive about Shigurui. For all of its artistry and its attention-garnering violence and sexuality, the plot is built on fairly typical samurai fare: In the present time, a swordsmanship tournament is being held. Facing each other are two decrepit samurai, one of them blind and one of them missing an arm. They are both students of the same school of swordsmanship, they have a historic rivalry with each other, and the rest of the series is a flashback that delves into that rivalry. Revenge, rivalry, and betrayal can be made powerful with a quality story and good characterization (see Berserk, Gungrave) but it just isn't so here. Shigurui's writers seem to be going for the “slow but deliberate” buildup, and as a result the story dawdles,  takes frequent forays into the backgrounds of characters and objects which have a minimal connection with the plot, and all the while fails to generate tension or momentum in any significant amount. A lack of complexity isn't always a bad thing, and good execution can take a simple plot, run with it, and make it compelling. But here is simplicity done wrong: Meandering, directionless, trying its hardest to pull something out of nothing and be more than it really is. Entire episodes could be skipped with minimal loss. You can practically see the seams where the plot is stitched together—in the first half of the show, someone is wronged, and in the second half, that someone seeks revenge in a methodical, predictable fashion while everyone else runs around like chickens with their heads cut off. The show's ending is somewhat fitting, but it's also anticlimactic in the first degree, and leaves many questions unanswered. It's insult to injury, and as a result, Shigurui's story is an absolute drag, a bloody, swerving run-on sentence with no period.\\n\\n\r\nMemorable characters could probably dig the show out of the hole, but to call Shigurui's efforts in that area “paper-thin” would be to short-change paper. The leads, Fujiki and Irako, are both tools of the plot, and they bend to its will in completely unreal turnarounds. Irako goes from “sinister, merciless, master swordsman” to “blubbering, defenseless idiot” seemingly at the drop of a hat, and Fujiki, originally the least offensive protagonist, develops into a brutal, sadistic shell of a man for what appears to be no reason whatsoever. Both characters have motivations that are either completely unknown (Fujiki) or laughably simple-minded and one-note (Irako). As previously mentioned, the show would rather spend time delving into shoddily introduced plot elements than fostering any sort of actual interaction between these two characters; it glosses over their development as fellow swordsmen completely, and in the end the root of their much-touted, show-spanning rivalry seems to be limited to “Irako beat Fujiki in a practice match this one time and then Fujiki punched Irako in the face.” They hardly ever speak to each other; the show seems to be going for effective minimalism in this aspect, but it falls short. We know almost nothing about the ideals of either man, and while they might have good reasons to kill each other, the truth is that they're both cold and simple characters to a nearly inhuman degree, and it's nearly impossible to care about them or relate to them in any sense. Add to that some terribly flat supporting roles who seem to exist for the dual purposes of dying gruesomely and killing time while the show struggles to reach the 12-episode mark and you get a lackluster cast that's utterly incapable of picking up the slack left by the similarly flawed story.\\n\\n\r\nIn fact, Shigurui as a whole feels like the result of one big case of writer's block. That there's talent and effort poured into the series is beyond question—the near-flawless artistry, the attention to detail, and the willingness to show things that the audience might not want to see are all hallmarks of a strong creative team. It's even directed by Hiroshi Hamasaki, who managed to score a home-run with similar directorial style in the slow-but-powerful Texhnolyze. I've little doubt that if Shigurui's writing had been handled differently, the show could float above average, maybe even to greatness. I'm all for rooting for the underdog, and I'd love to be able to write a cute blurb along the lines of “despite its outward mask of grotesquely twisted sex and violence, Shigurui has numerous redeeming qualities...” \\n\\n\r\n...but, truthfully, short of the art and the general atmosphere, I just don't see anything worth praising. Shigurui has nothing to say. It has all of the means in the world, but no conceivable ends. It's completely without vision, and as a poor replacement for vision, it reaches onto the shelf and pulls out the book of sheer brutality and shock value. It's the angry pre-teen, screaming (admittedly creative) obscenities, hoping that others will mistake them for maturity. In a sort of sad irony, its positive aspects actually look retrospectively silly when coupled with its writing, like lipstick on a pig. The fight scenes, which amount to staring contests punctuated by swift blows delivered via animation shortcuts, could have been effective if there was any emotion brewed between the characters involved, but lacking that element, they ring hollow. The slow, traditional music and voice-over narration sound absurdly ham-fisted and out of place next to the needless sexual violence. Countless artistic shots of butterflies and cicadas, symbols of change and rebirth, are not a substitute for writing characters who actually undergo convincing development.  The show has zero self-awareness; at its best moments it's a halfway entertaining gut-spiller, and at its worst moments it's borderline BDSM smut, yet from start to finish it operates under the misleading pretense that it's an engaging work of art. In all walks of life it's best not to kid yourself, and I can't help but recommend that if you're going to make something as pointless and mind-numbingly gratuitous as this show, you could at least maintain some honesty about it.",
            "date": "2013-05-20T21:58:00+00:00",
            "helpful_count": 127,
            "mal_id": 97895,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1485537.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mahoganycow",
                "username": "mahoganycow"
            },
            "url": "https://myanimelist.net/reviews.php?id=97895"
        },
        {
            "content": "WHAT YOU SHOULD KNOW BEFORE WATCHING THIS ANIME:\r\n1. It's a very serious anime.  No jokes, all business.\r\n2. There is brief full-frontal female nudity in almost every episode.  Sex scenes are brief, and are presented much like a slideshow of dim, still images.\r\nSTRENGTHS:\r\n1. Production value is obviously very high.\r\n2. Story is solid as long as you watch the entire series within a relatively short span of time.  If you leave too much time between episodes, the story will be harder to follow.\r\n3. If you're in the mood for an intense, violent, and gory samurai anime, this is definitely the one for you.\r\nWHAT KEPTIT FROM GETTING A HIGHER SCORE:\\n\r\nI would have given it an 8 if it had a little bit of lightheartedness.  A hint of humor would have made the characters more likeable.  It would have made the story more interesting too.  I mean, c'mon, even the most serious of movies had a bit of comedy in them.\\n\\n\r\nI would have given it an 9 if the pacing had been a little faster.  The anime drags at times; especially since the director tried to make EVERY scene intense.  The minimalism of the soundtrack exacerbates the sluggishness sometimes.\\n\\n\r\nI would have given it a 10 if the story was exceptional, which it was not.  It ended up being a story of pride and revenge, which most people have seen before.  Still a pretty solid plot though.\\n\\n\r\nRecommended if you're in the mood for something really really serious.\\n",
            "date": "2008-03-10T13:55:00+00:00",
            "helpful_count": 51,
            "mal_id": 3025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bjtdevera",
                "username": "bjtdevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=3025"
        },
        {
            "content": "I was recommended to watch Shigurui, knowing that i like the Edo and Sengoku era i was obviously going to watch it but till i ended the other ones that i have listed but i was told that this was accurate on the dark side of the samurais and how despicable they were and how mature the art and story was, and i was convinced to watch this anime before the other ones.\r\nStory\r\nStory is really mature, it's confusing at the beginning because there are a lot of flashbacks and you don't realise those are flashbacks at the moment but later when you are tying thepieces together you get whtat's happening, may be boring for some people to see that the story advances slowly, but it has something addictive and keeps you watching the next episode, don't expect a happy story, is dark, in the first minutes after the OP of ep. 3, i was ''Oh no, everything but that kind of things'' but i knew what i was into so i kept watching it, the english name of the anime is Death Frenzy, so expect that in cruel ways, the bad thing is that they didn't conclude the story in the anime at least and that can be annoying for a lot of people and i saw it was Madhouse the king of ''Watch this unfinished ending by reading the manga,'cause 2nd season ain't happening son'', yeah they made this anime, and it was like with their 80% of animes they release, they don't make 2nd season, only for the other 20%, so i googled the parts that were not explained and how it ended, overall was great.\\n\\n\r\nArt & Sound\\n\r\nThis two go hand to hand, the dense and dark atmosphere, with a mature art style and the fit music for the samurai theme with sometimes silent parts were great, i'm not fan of the gore, but i didn't mind at all the gore in this anime, because of the samurai theme, it makes sense, it was almost like this back in the era where not everyone were respectable samurais but there was the despicable ones, both Art and Sound were great.\\n\\n\r\nCharacter\\n\r\nI can say that 99% of characters were really despicable, but that's why this is great, it makes you dislike them but at the same time like them a little (well maybe just Fujiki and Ushimata) and you get to see how different they were, i mean different ways of being despicable, Iwamoto and Irako being the most despicable characters, you have to see for yourself, they were great for a samurai setting, as i stated the thing is that they didn't clarify how was it that Fujiki lost the arm (NOT a spoiler the arm lost, you see him for the first time like that on Ep. 1, but they don't explain it) unless you google it or read the manga, and that's what i did to find out, overall was great.\\n\\n\r\nEnjoyment\\n\r\nI really was able to enjoy this, being careful to follow the plot and it was great overall.",
            "date": "2015-08-13T15:26:00+00:00",
            "helpful_count": 34,
            "mal_id": 196073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196073"
        },
        {
            "content": "1st impression:\r\nIt's not your everyday samurai anime, more realistic. It starts off with final battle (didnt show result) for the rest of the episodes to uncover the past. The art is top notch.\r\nBest selling point(s):\r\nI dare to say : All\r\nReason of liking the anime:\r\nI like it because 1st of all i am sick of those wannabe-samurai anime. I heard this is somewhat special and decided to have a go for it. The story telling is so good and pace is well controlled even for a short series anime. The gores comes with some torturings of women( yes , it's somewhat sick anime) and even showeddetailed parts of humans organs when duelers received damage upon duels.  Ah, i forgot to mention the tension created, it works so well with the music copping with the story pace.  I dare to say there're no other better samurai anime than this one.\\n\\n\r\nWhat i Dislike:\\n\r\nSome scenes can be too dark or too bright to be seen.\\n\\n\r\nAdvice(s):\\n\r\n1) Not for women( well if you wanna have a go,be my guest) . For 18+age , Not for wannabe-samurai anime fans or any shounen anime  fans.\\n\\n\r\n2) It's like reading a good novel/story book, so have patience to watch it.\\n\\n\r\n3) The story is good that it makes you wanna watch on, watch slowly or you will finish watching it too soon :P.\\n\\n\\n\\n\\n\\n",
            "date": "2008-01-07T21:02:00+00:00",
            "helpful_count": 24,
            "mal_id": 1894,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19740.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dj_Frog",
                "username": "Dj_Frog"
            },
            "url": "https://myanimelist.net/reviews.php?id=1894"
        },
        {
            "content": "Shigurui as an anime is simply a serious anime. It lacks the humor and the character development of majority of animes - they protagonist with the sense of justice or past that pushes him into a direction or the antagonist that considers destruction of all for his own purposes. If one considers true human nature with all its complexity it is hard to establish an antagonist. Before going further, I will state - and justify later - that Shigurui is underrated.\r\nAn anime should be considered for what it intended to show or depict. Shigurui is not meant to be a fast paced action with Samurai'sjumping around and showing off flashy moves. Neither is it a display of a person's will to fight on and move forward by overcoming challenges. To first give an impression I will say that the anime refers to a believable edo period with skills fearsome and breath taking. Don't expect cut scenes similar to fights typical to One Piece, Bleach, Basilisk or Ninja Scroll (the last two titles for a better comparison). It contains sufficient violence and nudity but for the purpose of a more vivid and convincing plot not for fan service. The pace at which the story proceeds might be considered slow for some but in my opinion it is balanced and is targeted towards people who are more intuitive and let a tale seep in rather than skip scenes to reach the end. Patience is required for a reward as the anime proceeds. It is not for those who prefer first episodes like Deadman Wonderland, Mirai Nikki. I won't go into the details of the story itself. What I will say is that the story is an exceptionally well execution of an everyday attribute of humans: ambition. It combines that with the complex and varying personalities of humans to give a theme that is more or less a commonly occurring phenomenon in places/departments where people compete to rise to the top but is executed with such intricacy that a person continuously wants to know what will happen ahead. That is, if you let the anime display its potential in an episode or two. Having said that, the anime is sadly in complete - the ending which one is looking forward is not reached BUT, DESPITE THAT, the anime does finish off at a point of certain progression. It left me disappointed but did not make me question if I should have watched the anime or not (like it does with deadman wonderland, Attack on Titan for me).\\n\\n\r\nThe art is impressive - the character appearance and architecture is realistic - it tilts towards designs similar to that of Paprika (for comparison) in which proportions are closer to real life and eyes/nose differ from those usually found. The color/hue throughout the anime is dull. It is meant to be that way since the anime takes place in a dark era with most scenes in dojo's and open gardens. The dreariness of dull colors is a perfect match for the atmosphere. Yet the backgrounds are detailed, the art is crisp and impressive. That includes the gore that does not only include splattering showers of blood or non-existent organs/muscles/limbs flying around. Also - with an anime that is meant to depict realistic Samurai scene sequences, \"excessive bloodshed\" is a must. If one wants a serious historical anime with sword fight but lack of bloodshed then I wonder what they are searching for.\\n\\n\r\nThe sound in the anime is meant to compliment scenes. The background chirping of the insects in the morning and occasional slow tune in the background that is barely noticeable again suits and compliments the type of anime this is and is not existent in every scene, every time the protagonist turns around there would be a dramatic bass playing in the background. This is not a suspense thriller of the sort.\\n\\n\r\nThe characters, as has been discussed earlier - are realistic. In what sense? They are not one dimensional. Meaning that they are not unmovable representations of a single goal or vision from which they will not waver. They are not simply distinguished as good or bad. A sense of justice, a code for Samurai has been set in the beginning and it is maintained - death for their master is an honor for a Samurai. The character of Fujiki Genouske is not just of a loyal man. It is of a loyal Samurai with all the restrictions applied. The restrictions do impose certain emotional responses in him (That are subtle to comprehend at the very least) but he overcomes them. Irako Seigen is a Samurai that considers personal gains and goals more important and is impulsive - he does not want to live in the constraints that tie down a Samurai. But is that necessarily bad? Don't we at many times act in such a way that duty is not neglected yet personal gain is also met. In the same way is Fujiki really that good? Is following rules that at times may impart distress on some, really that good? Is it wrong for the Mistress Iku to want to find love, or feel negatively for a murderer of his loved one? The way ambition, emotions and circumstances drive the characters and in turn the story is beautiful.\\n\\n\r\nNow to conclude, where is the enjoyment in this anime? Its the realism of the situation. It is the competition, the fact that righteousness does not always prevail. The fact that this is an anime that does not deal with the super natural yet exhibits skills that one wants to witness again and again. The excitement of waiting for a slash for it determines the fate of the fight. YES, for those that prefer long fight sequences with up's and downs in stamina and dialogues during the fight won't enjoy this. After all this is not devil may cry.\\n\\n\r\nSo I will finally say that this anime is a beautiful execution of a dark period and a sinister story. For viewers of happy, fast paced or supernatural animes, this is not your thing. For patient viewers looking for a more mature yet interesting and deep storyline that challenges the brain into thinking, this is a wonderful anime. Partial, yes, but wonderfully executed till then.\\n\\n\r\nFeedback is appreciated!",
            "date": "2014-01-07T14:54:00+00:00",
            "helpful_count": 18,
            "mal_id": 127727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3229339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NotenSMSK",
                "username": "NotenSMSK"
            },
            "url": "https://myanimelist.net/reviews.php?id=127727"
        },
        {
            "content": "Overview:\r\nShigurui or \"Death Frenzy\" is a...controversial anime. This anime has a LOT of gore, a LOT of nudity and sexual violence, and doesn't exactly tackle its gloomy subject matter with artistic subtlety. Basically, imagine combining the 1990s OVA Ninja Scroll with elements of Rurouni Kenshin, Berserk, and some exploitation movie that the Cinema Snob would review! THAT is exactly what Shigurui feels like to watch! Despite all of this...I actually enjoyed this series. This is definitely not a series for everyone, but it has some positive elements that are truly worthy of praise.\r\nStory:\r\nThe story starts in the year 1629 with a large kendo tournament usingreal swords and matches to the death. This tournament is being held by the brutal tyrant Tadanaga Tokugawa, who is the younger brother of the shogun ruling Japan. Tadanaga was executed for his \"criminal insanity\" and is sort of like Japan's Caligula, so this tournament is not out of place with the kind of deeds commonly attributed to him by Japanese historians. However, that isn't to say that Shigurui tries to be 100% historically accurate. Shigurui will instantly remind viewers of the much more famous Rurouni Kenshin with legendary swordsmen standing around and waiting for their opponents to unleash the \"Super Secret Bullshit Technique\" of the \"Does not exist\" school of sword fighting. Shigurui is infamous for having so many rape scenes, but nothing gets raped worse than the laws of physics in this series! The 2 main fighters in the tournament are long time rivals and mortal enemies. The entire series is a flashback explaining their histories and all the bad blood between them. The main 2 characters are the samurais Fujiki and Irako. Both were once students of universally feared Kogan School of Kendo, which was run by a brutal and completely insane old man named Kogan Iwamoto. Irako was blinded and exiled from the school for cheating with Kogan's mistress and now wishes to annihilate the entire school for revenge. Fujiki is loyal to the school and wishes to get revenge on Irako for killing everyone it it besides him. That's the entire plot! Also this is a condensed adaptation that didn't want to create its own \"filler ending\" so instead it just abruptly ends in the middle of the story! What makes the series interesting is its action, music, portrayal of history, artwork, and believe it or not the questions that it asks!\\n\\n\r\nCharacters:\\n\\n\r\nThe 2 main characters have commonly been compared to Guts and Griffith from Berserk and although this was actually based off a novel far older than Berserk, I can REALLY see why people would say that. Fujiki is a one armed swordsman who is loyal to a fault and against his conscience will carry out brutal deeds if ordered. Fujiki lives on for the sole purpose of getting revenge on Irako for killing all of his friends. Irako is a highly effeminate, Machiavellian bastard that wears lipstick. Irako was born to the lower class, but he is extremely ambitious and charismatic, willing to kill anyone and everyone to rise to the top. However, here is where the similarities end! Fujiki may feel sort of bad for following terrible orders, but he would never quit his master like Guts did after Griffith ordered him to assassinate the Duke. Guts would never follow an order to hurt someone he cares about, while Fujiki willingly held down a girl he liked so another man could rape her. Guts shows a lot of strong emotions and is a Byronic Hero, while Fujiki is NOT portrayed as a hero at all. Fujiki is frequently called a \"puppet\" with no will and ambition of his own, and this is honestly accurate. Irako may share similarities to Griffith, but the show never at any point attempts to make the viewer admire Irako. Griffith has his many \"magnificent bastard\" moments when the viewer is awed by his cunning, intelligence, and skill. Griffith also was shown in Caska's flashbacks to have at one time been a fairly decent person that sort of cared about the lives of his men. Irako is a straight up evil motherfucker. This guy laughably murders a kitten for absolutely no reason! He randomly murders prostitutes and only joined the Kogan School to \"drain everything it had and move on\". To top it all off, he's not even very cunning and is only the 4th best fighter in the series! His revenge only succeeded as well as it did due to random outside help combined with dumb luck. He hires someone to poison the # 3 best fighter, beats the #1 fighter by backstabbing when he was distracted, and gets his ass kicked by the #2. There are some other characters with potential, but the 2 scorned and revenge obsessed female characters don't have enough development. Kogan is a sick old fuck who happens to be freakishly strong, much like Wyald from the Berserk manga. There is a reason Wyald keeps getting cut out of the adaptations! He is a plot device, not a well developed character. Now on to the things this anime really does well!\\n\\n\r\nArt:\\n\\n\r\nShigurui was animated by Studio Madhouse and it looks absolutely fantastic! Japanese characters actually fucking look Japanese!!! People actually have intestines and well drawn organs instead of red paint and indiscernible chunks. When a character gets his head split in 2 we actually get to see a Sagittal Plane view showing everything inside with decent anatomical accuracy! The characters wear clothes that are period accurate and look like some actual thought and effort went into them. The backgrounds are well detailed and aren't marred by horrible use of CG. This was made in 2009 when bad CG, lazy backgrounds, and \"Moe\" absolutely dominated the anime industry. This series took a gamble and it really paid off!\\n\\n\r\nMusic:\\n\\n\r\nThe music is entirely traditional Japanese music that stays consistent with the Tokugawa Shogunate time period. It doesn't switch back and forth between period appropriate music and a really crappy comic relief track played on synthesizer whenever some dumbass appears on screen! This may not sound like much, but seriously I have seen over 300 anime and this basically NEVER happens! \\n\\n\r\nPortrayal of history:\\n\\n\r\nThe days of the samurai in Japanese pop culture, much like Europe's Medieval Period in much of Western literature, is frequently romanticized as \"the good old days\". This was when people knew their place in the world, served with honor, and nobly sacrificed themselves to avoid shame befalling their family. Much like Game of Thrones, Shigurui rejects this nostalgia and shows the poverty, disease, filth, and low quality of life that the ordinary people of this period had to suffer through. The author of the original novel was named Norio Nanjo and he was a Japanese soldier in China during WW2. He felt it was unjust that Japanese history at that point solely focused on Emperors, Generals, and the people at the very top. The life of an ordinary Japanese soldier or the civilians they massacred weren't written about and historians simply didn't care about that part history. Nanjo not only wished to show history from the perspective of the common man, but also to reveal the whole truth and not conceal any embarrassing details. For example, Shigurui actually has the balls to mention that samurai very commonly had 5-10 year old boys as assistants called \"wakashu\". A samurai was fully expected to have anal sex with their wakashu in order to teach them submission and loyalty to their master. In addition to this, most respected samurai did NOT remain faithful to their wives and visited prostitutes FREQUENTLY. I'm not talking about Geisha for music and conversation, I mean actual prostitutes! How about the fact that women in Japan until the Meiji Period would purposely blacken their teeth because blacker teeth were considered more beautiful? In a country like Japan with such reverence for ancestors and history, to show the naked truth and not polish up the unpleasant details is a rather bold and commendable feat!\\n\\n\r\nPhilosophy:\\n\\n\r\nThere is no good and evil in Shigurui. Instead we are left to decide which is worse: a man who will follow any evil deed like a robot, or a man who commits evil of his own volition and cares only for himself. Neither is portrayed in a flattering light and no answers are definitively given here. Normally the concept of absolute loyalty is revered in Japan, but after personally witnessing the actions of the Japanese Army in China and the willingness of soldiers to follow the \"Kill all, Burn all, Loot all\" policy, Nanjo began to question this supposed truth. In many ways, the simply evil and selfish character Irako is actually the anti-hero and chief protagonist of this story for rebelling against the Japanese cultural principles that led to the deaths of over 10 million civilians in just a few years. This is a rather interesting question and not one that is frequently brought up either in Japanese media or elsewhere. The supposed hero of the story Fujiki is someone the viewer grows to both pity and despise for embodying what is almost always portrayed as a great trait in anime. \\n\\n\\n\r\nOverall:\\n\\n\r\nWho would have thought that an anime that features a martial arts master karate chopping a prostitute's nipple off and then eating it would cause the viewer to reflect and think?! I really would have preferred that the anime had more episodes and completed the manga instead of remaining faithful for the parts that it covered... but just abruptly ending. However, the fact that this wasn't a big hit in Japan and didn't get a sequel isn't the fault of Shigurui. It is the fault of consumers that demand Ikki Tousen have 5 seasons and frequently neglect more worthy anime. This is certainly a series with some big flaws, but as I explained I also really loved some aspects. It is certainly a series I would recommend checking out, as long as you have a fairly strong stomach that is!",
            "date": "2015-09-27T15:59:00+00:00",
            "helpful_count": 17,
            "mal_id": 199890,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=199890"
        },
        {
            "content": "Shigurui (Death Frenzy): Reviewed\r\nAuthor: Takayuki Yamaguchi\r\nAnime Director: Hirotsugu Hamakzaki\r\nOriginal Run: July 19, 2007 – October 12, 2008.\r\nGenre: Chanbara\r\nEpisodes: 12\r\nPlot:\r\nIt’s often said that “The way of the samurai is found in death”, Shigurui is tale set in the early 1600 hundreds that beautifully foretells the ideology of a samurai’s life through renowned artistic violence. The premise of the show is centered around a duel between two master swordsmen, Gennosuke Fujiki a one-armed swordsman, and Seigen Irako a blind swordsman with an almost crippled foot. Through foreshadowing story telling the series gives birth to a magnificent plot. The plot then, guides the path for the young masterswordsmen, Gennosuke Fujiki and Seigen Irako with a display of sensational visuals and an in-depth mastery of outstanding artistic showmanship, as they showcase their ability, courage and loyalty in hopes of grasping an unrivaled set of skills.\\n\\n\r\nCharacters:\\n\\n\\n\r\nGennosuke Fujiki: Voiced by: Daisuke Namikawa (Japanese), John Burgmeier (English)\\n\r\nThe protégé of the kogan dojo and the ideal candidate that’s most likely to inherit the dojo. Through out the series, Fujiki is portrayed as a calm and rational figure that never allows his emotions to dedicate the pace of his judgment. His ability to wield the sword is uncanny, and his compassion towards his fellow comrades is heartfelt and sincere. Amongst these admirable traits, the one that shuns his other noble traits, Is Fujiki’s loyalty for his master Kogan.\\n\\n\r\nSeigen Irako: Voiced by: Nozomu Sasaki (Japanese), J. Michael Tatum (English)\\n\\n\\n\r\nAn aspiring master swordsman, whose methods of reaching a profound goal lack proportion. In the series, Irako’s ideals are encompassed in the sense of deceit, betrayal, and utter disloyalty for his master. Not only does he lack a sense of cultural value, his actions often, are very impulsive, as if they required a sense of instant gratification. The desire to reach a higher plateau is very demanding, and treacherousness is often a counter productive method that is likely to hinder progression. The noble path Irako walks requires a sense of self-acceptance, prudence, and mutual respect between pupil and master, traits that Irako profoundly lacks.\\n\\n\r\nKogan Iwamoto: Voiced by: Seizō Katō (Japanese), Jerry Russell (English)\\n\\n\\n\r\nKogan Iwamoto is the headmaster of the Kogan-Ryuu school. He is a fearsome person whose mastery of the sword is regarded as unrivaled. In the series he’s depicted as an unbalanced figure who’s suffering from dementia: and once a year he breaks free from his uncertain slumber to oversee his dojo. He constantly wishes for a strong breed which in turn will oversee the dojo in his demise. To ensure the success of this, Kogan treats daughter as an instrument that is bring forth this vital breed.\\n\\n\r\nMie Iwamoto: Voiced by: Hōko Kuwashima (Japanese), Laura Bailey (voice actress) (English)\\n\\n\\n\r\nMie Iwamoto is loving daughter with an infinite sense of pride. She tends to her father when he’s in his dementia state, along with the aid of Fujiki. Mie is portrayed as a maiden of staggering beauty that is lovely as the autumn rain. The Kogan-Ryuu school’s survival rested solely on her shoulders, as the presupposed offspring she is to produce would be the future of the Kogan dojo.\\n\\n\r\nSummation:\\n\r\nTo amass an unprecedented amount of artistry of violence through remarkable story telling is an astounding achievement that requires profound dedication and a level of sophistication that is almost impossible to reach, but Shigurui with ease, was able to capture all of these requirements. The bloody path of a samurai’s a life was captured instantly from the get-go of the series, until it reached its wondrous climax. The aspect of a samurai’s life was ensnared wonderfully with phenomenal storytelling that captured the core of its ideology.\\n\\n\r\nTheme:\\n\r\nThe society we live in today follows many ideologies that are coherent to our present time, but Shigurui strongly introduces its audience to a style of ideology that will surely appear to be morally twisted, and completely unnecessary. The series offers several valid themes that can relate to how our society behaves in the current times, but the main theme it wonderfully depicts, is the resolute and harmonious loyalty that a samurai wholeheartedly adheres by. This distinctive quality was terrifically exposed through out the series, with events that tested a samurai’s physical and mental tolerance for his master. Shigurui magnificently delivers this profound and rich artistic representation of the early 1600 hundreds with immense success, and it paints how marginally the ideologies of the past were regarded with great ambition and respect, a rare trait that our self-imposing society lacks.\\n\\n\r\nMedia Related:\\n\r\nWith a stellar star mesmerizing image, Shigurui showcases a marvelous prospective through beautifully realized violence. Visually astonishing, artistically inspiring, these are the stupendous rich traits that the series embodies. The visual aspect of the show is demonstrated constantly with revered artistry that marvelously appears to be as graceful as the left hand of Rembrandt. Shigurui is a phenomenal work of art that is worthy of the highest recognition.",
            "date": "2010-02-11T21:06:00+00:00",
            "helpful_count": 16,
            "mal_id": 23171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JustJuice",
                "username": "JustJuice"
            },
            "url": "https://myanimelist.net/reviews.php?id=23171"
        },
        {
            "content": "Blood, boobs, and bad asses. Shigurui is one manly animu, no question. Unfortunately, it is also historically accurate. I say unfortunately because while it is refreshing to see a samurai series take the-path-less traveled (no quiet, morally driven heroes here), its still an unpleasant ride that insists on showing the uglier side of things.\r\nThe first episode of the story is set in the early 1600's during the Tokugawa years. One of Tokugawas crazy brothers decides hes going to hold a tournament, but the competitors will be using real swords instead of wooden ones. This is misleading. There is no tournament and you don't even getto see the climax between the two main (in name only) characters. Instead, we're brought back in time to tell the story between the two main characters.\\n\\n\r\nFujiki Gennosuke is the number one pupil of his dojo. Irako Seigen appears and challenges Fujiki for that spot. Their sensei has a daughter, Mie, and the succesor to the dojo not only gets her, but the land, prestige, and power that comes with her.\\n\\n\r\nPretty simple plot thats not too difficult to follow. However, reading this you might believe that Fujiki is the hero of the story. That is not so. Fujiki is portrayed throughout the series as a serious, silent puppet...ironic, considering at one point in the series he is deemed the only non-puppet in the dojo. He does, on occasion, show anger, but beyond those few short snippets he has no personality and no background. We are never told why he his training to be a great swordsman or what he wants out of life or whats driving him. He perhaps was to be enigmatic, but instead he came across flat and 2-dimensional.\\n\\n\r\nInteresting to note, Fujiki began showing signs of some typical samurai honor early on,  but any inkling of that was dashed away the moment he felt content defeating a weakened rival\\n\\n\r\nOn the other side of the coin, the main villain, Irako Seigen, has a wealth of history and personality. We are told who he was, who who wants to become, where he came from and where he wants to go. In the course of the series, Irako is betrayed by his dojo and destroyed by them. He later overcomes his injuries and handicaps to take his revenge. As a result, Irako comes off as the true hero of this series which I do not believe was the intention.\\n\\n\r\nThe other characters fill their roles well and a simple story is told in detail. That means theres a lot of slow spots in this one folks. Yet, with everything moving so slow, the story often crescendos violently into epic scenes with massive blood loss and gore. The contrasts are well done and make the bloodletting far more effective.\\n\\n\r\nOverall, this is an animu for samurai fans. It is very rare that you see what samurai were actually like and not the fantasized ones we're used to seeing. However, you have to take the good with the bad, and thats experiencing and acknowledging the widespread practice of homosexuality as well as acknowledging that honor wasn't practiced to the extent we've been led to believe.\\n\\n\r\nFor everyone else, I'd recommend to avoid this one. It is well animated, the music is great, everything about it works well...its just a question of taste. It is slow and blurs the line between good and bad to the point where the &quot;bad guy&quot; is far more heroic and interesting. There is a slight incestuous element but no real romance. There is a ton, A TON, of gore and blood and grotesque, wincing scenes that could just make you sick. \\n\\n\\n\\n\\n",
            "date": "2009-01-22T21:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 11774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Redward",
                "username": "Redward"
            },
            "url": "https://myanimelist.net/reviews.php?id=11774"
        },
        {
            "content": "The first thing that struck me was the opening to Shigurui. Immediately, the colourful and stylistic scenes and art was inviting. Unfortunately, it was followed by rather bland, mid-toned artwork. Although there were redeeming factors in the actual visuals, like detailed environments and facial expressions, the overall feel lacked any invitation. Nothing immediately caught the eye other than the constant snowfall!\r\n The second thing that impressed me immediately was the sound. The background music was very refreshing, and more importantly true to the era depicted in the setting. But again, it failed to hold its own became it became extremely monotonous by the endof the first episode. It was almost like a very good loop was played throughout the series. This caused many awkward moments where the music did not match the scene appropriately.\\n\r\n  The character development was almost non-existent. There was very little evolution of any type. Other than perhaps two of the characters, there was also a dire need for more emotional voice-acting in order to instill some life into the inhabitants of the dojo, the focal setting of the series. Due to a problem with the chronology of the story, the viewer becomes even less involved.\\n\r\n  As far as the animation was concerned, the majority of the effort was put into the action sequences. Yet again, this factor of the anime failed to deliver. Although a unique and interesting method of representing the tension before each fight was used, the fights usually lasted about a second or two with very little actual animation, which doesn't say much about the rest of the anime.\\n\r\n  There is a decent amount of gore, and the faint of heart are warned to stay away if that is not your cup of tea. One particular molestation scene stands out as one of the most blatantly gratuitous scenes in any anime I've watched recently, and I can handle a lot of disturbing violence. I can't help but think that it was used for shock value rather than being an integral part of the story.\\n\r\n  Overall, I had to force myself to get through the coma-inducing pace of the entire series. All that was left was a bitter taste of needless gore, and confusing story-telling with a few artistic qualities worth mentioning. I strongly recommend looking elsewhere if you're looking for a historic anime revolving around the patriarchal society in a dojo, with a peppering of inadequate samurai action sequences thrown in for giggles.",
            "date": "2008-06-15T11:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 5509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68619.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/agphoenix",
                "username": "agphoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=5509"
        },
        {
            "content": "Simply, the first thing to consider is that this anime is composed largely of some of the most graphic scenes of violence in the industry. It also is fairly free in its portrayal of sex and thus I would instantly dismiss it if you do not care for these things. In watching Shigurui, they cannot be avoided.\r\nIf this does not concern you then you will certainly appreciate the art, the degree of artistry and realism in the violence alone justifies a high rating, entrails feature heavily. Otherwise the anime is generally graphically pleasing, the general Edo period scenery is well presented the characters are verywell drawn and this makes it all the more disturbing when they near-inevitably breathe their last. Fans of period drama will appreciate this one without a doubt.\\n\\n\r\nThe story is not so engrossing, partly because it is confrontation that drives the storys events rather than actual intrigue, but as a device to tie one bloody murder to another the plot is more than sufficient and fairly well written. Ultimately, there are samurai, sword-lineages, secret techniques and endless betrayal as one would expect from a good example of an Edo period anime. The truly exceptional part is that they have managed to make it more violent than ever, showing us that there is truly no upper limit.\\n\\n\r\nThe sound blends  beautifully with the horror of the visual situation and highlights just how disgusting what you are watching is, in case you had forgotten. Traditional japanese sound effects and music underscore the whole thing.\\n\\n",
            "date": "2009-03-19T08:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 13305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Starstriker6666",
                "username": "Starstriker6666"
            },
            "url": "https://myanimelist.net/reviews.php?id=13305"
        },
        {
            "content": "Before the main body of my review, there are two things to note:\r\n1. This review represents the opinion of someone with very little knowledge of Japanese history and who didn't read up about it before watching the series. It's not like I actively try not to have a sense of the context, it's just that I believe that I shouldn't have to know all about the historical background of something before I watch an anime about it, as it's essentially fiction and should really be good enough to keep me entertained without that. So this review represents my opinion of this anime as a pieceof entertainment in its own right. If you did read up on Japanese history before watching this, fair enough, I'm not having a go at you, it's just not something I do.\\n\\n\r\n2. People keep going on about how realistic this series is. It isn't. You get impossibly strong punches, razor-sharp hand swipes, special moves that are somehow unblockable, and more. It does, however, feel fairly real in that people don't go jumping 30m into the air or shrugging off fatal wounds.\\n\\n\r\nNow, onto the review: I watched this series because I wanted to watch a samurai anime that wasn't too stylised, i.e. without superhuman jumping about and ridiculous attacks. Shigurui sounded like it fitted the bill (and close enough did, I suppose), so I watched it. It's told in the form of starting at the chronological end of the series, and showing the events leading up to it in the remainder of the series. More on why I scored its story so badly later.\\n\\n\r\nShigurui's art was good, albeit fairly bleak. It had some nice scenery, and characters were drawn well. As others have mentioned, very often a scene would be so dark that you literally couldn't see what was going on, which was really rather irritating, necessitating turning down the contrast, leaving fuzzy outlines of figures. The series' animation was also good, with little repetition and smooth movement. \\n\\n\r\nShigurui had fairly standard voice acting, which stood out in netiher a good nor a bad way: neither was it surprisingly good, nor did it ever detract from the series. The score was very atmospheric and fitted the series well, so as a score it was excellent. As music, it wasn't all that pleasant to listen to, but it fulfilled its function well.\\n\\n\r\nThe series as a whole is very well put together in terms of cinematography, art, etc.\\n\\n\r\nWhere it all goes wrong is with the story. It's nothing original, which isn't usually a major problem (almost everything follows some sort of template), but here, I think originality is one of the few things that might have saved this series. By the end of the second episode, you can deduce roughly what will happen throughout the rest of the series, meaning that it feels more like atmosphere and build-up than a plot. But this build-up comes to nothing: you might expect there to be some closure for the series, but it just tails off, so you end up wishing that they'd at least covered some new ground. Imagine a version of Reservoir Dogs where you neither find out just how they got to the safehouse, nor are you shown much of what actually happens when they're there. You'd think that they'd show you what happened to Fujiki's arm and Irako's leg, but they don't. You might have some sort of insane idea that they'd show you what the outcome of the battle, to which it all feels like it's moving, was, but you don't see this either. It doesn't end at the place the series began. It doesn't even end anywhere near there.  When I watched the end, I was sure I'd missed an ep, but I hadn't. It left me with a horrible mixture of disappointment and emptiness, and the bollocksed up ending made the bits of the series I had enjoyed feel shallow and pointless. I have a bad taste in my mouth when I mention this series.\\n\\n\r\nMy overall score of 6/10 reflects the juxtaposition of some really rather good atmosphere and art with a deficient storyline. Almost everything I've watched comes from recommendations from close friends, meaning that I've seen almost exclusively what I would call good stuff, but this is the one series I would not recommend to my friends. Maybe it's someone else's cup of tea, but it's certainly not mine.",
            "date": "2009-01-15T15:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 11525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/121481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiskyBusiness",
                "username": "RiskyBusiness"
            },
            "url": "https://myanimelist.net/reviews.php?id=11525"
        },
        {
            "content": "At first glance this anime is much like any other samuria based anime. But as soon as the first episode you are thrown into a chaotic world where you literally have no clue what&rsquo;s happening and why it happened. That perhaps being the strongest point of this anime, the story is amazingly well done, that it always keep you interested. Like some invisible grip over you, it keep you coming back for more and more. However I will say this, this anime is not for weak hearted people and definitely not for anyone under 18 years old. Itcontains a very mature theme. Bloods, severed limbs, wild emotions, sex and everything else you can think of, you will see it in this short 12 episodes series. The story line is also somewhat hard to understand at first, but I promise you that if you watch this anime carefully, by the end you will understand everything. \\n\r\n    There is one drawback however, it&rsquo;s only a 12 episode series. In the end when it&rsquo;s all over and enough blood has been spilled, this anime leaves you with the feeling that something is missing, and you will definitely wish there was more. Perhaps that is the real drawback of this anime, its only 12 episode and when it&rsquo;s over you wish for more. \\n",
            "date": "2008-03-08T11:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 2974,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39935.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ShadowLone",
                "username": "ShadowLone"
            },
            "url": "https://myanimelist.net/reviews.php?id=2974"
        },
        {
            "content": "Shigurui is known for its gore, and I mean there's no other way I can put it - - IT'S **** GRUESOME.\r\nProduced by Madhouse in 2007, it spans 12 episodes of asking yourself: \"What's going on?\" Never has there been a series that kept me up all the way, not because of all the blood and insides lying around, but because of its cruel, yet realistic nature. It's most definitely the epitome and the first anime that comes to mind when talking about the anime that present the harsh realities of the world.\r\n[Story: 8]\r\nNothing much has to be said here, except that apart from theinfamous first episode, it's a pure psychological, thrilling, captivating, never-NOT-to-be--terrified mind***k. It kicks off with a fight between two samurai: Irako Seigen and Fujiki Gennosuke, not with wooden swords or anything like that, but with real ones. We never get to see the winner (because Madhouse ofc, lol) though. There's a lot of drama going on behind the scenes with the grandmaster of the school the young samurai apply to, Iwamoto Kogan, who also has dementia. I won't be spoiling any more stuff, because there's a lot. The final fight is also noteworthy, as it is singlehandedly.. PHENOMENAL.\\n\\n\r\n[Character: 9]\\n\\n\r\nThe characters of this anime are not directly likable.. at all. What impressed me are the distinct personalities and their motivations, fused with the fact that they are simply the complete opposites of each other. That causes, apart from the unpredictability of the story, that there's always for tremendous character exploration. This anime does an amazing job with its main cast, the two samurai, and of course the zombie grandmaster.\\n\\n\r\n[Sound: 8]\\n\\n\r\nWhat can I say, I mean the voice acting is great, the soundtrack is very solid, but it's lacking good sound effects in my opinion. The opening song is also good, although it's just an instrumental.\\n\\n\r\n[Art & Animation: 10]\\n\\n\r\nWhat can I say.. It's Madhouse, of course you're gonna get good animation and, in this one.. Especially art. This department really exceeded my expectations. The dark tone is genius.. For real, it's just done too well, the color pallette is also something worthy of mention. I personally believe it's the best animation Madhouse has ever done.\\n\\n\r\n[Enjoyment: 6]\\n\\n\r\nPretty much as expected from a series like this. It's not bad, but certainly one of the least enjoyable show ever, because of what it presents and the way it executes.",
            "date": "2019-05-04T11:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 307776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7584996.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dnd_18",
                "username": "dnd_18"
            },
            "url": "https://myanimelist.net/reviews.php?id=307776"
        },
        {
            "content": "To preface this review, Shigurui portrays violence with extreme detail. \r\nEven if you are someone who can endure graphic depictions of violence, I would caution you that Shigurui takes it to places that are unnecessarily vicious. I am someone who has a strong stomach, but this show made me wretch nearly every episode. Despite the disturbing imagery, the series does nothing with it, instead relying on shock factor alone to keep people interested. If the violence somehow supplemented a meaningful story, I might have given it a better rating, but nothing in this show is coherent and often feels like gore is just a cop-outfor lack of narrative.\\n\\n\r\nAdmittedly, the show started off from a relatively interesting place. A Lord is holding a tournament that involves his samurai , but where these were originally fought with wooden swords, he has altered the rules for them to fight with real swords instead. To augment this story, Shigurui attempts to show the politics of the period, as well as add to the development of the characters that will be fighting against each other, through flashbacks. Seems pretty cool, right? Unfortunately for you, there is nothing interesting in these flashbacks at all. To sum up most episodes, it's a camera pan between two rival warriors until the screen goes white, a sword slash occurs, and someone's head rolls onto the ground. \\n\\n\r\nAs for the soundtrack and art, they are both just as dull as everything else. The soundtrack is usually just a bunch of cicadas and a couple smacks on a drum; not much else to say there. The art is just as lackluster, being almost completely washed out, save for the few moments where blood is splattering all over the screen. They made sure to make that nice and bright for you, just in case you missed that eye explosion scene. It was clear they were trying to emphasize it through their color choices, but it doesn't save Shigurui from having distasteful art all together.\\n\\n\r\nTo sum it all up, I cannot recognize any redeeming qualities in this anime. Many tout this as a mature series, but it just seems like they used an uninspired narrative to justify making unreasonable amounts of graphic violence and sex. If you feel like you can stomach the show, then run through the first episode and see what you think. The first episode is about the same pace and tone of the rest of the episodes, so if you like that, then you'll like the rest. Other than that, I would stay away from this one at all costs.",
            "date": "2017-02-12T16:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 240452,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5142431.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/OnlyFestive",
                "username": "OnlyFestive"
            },
            "url": "https://myanimelist.net/reviews.php?id=240452"
        },
        {
            "content": "Randomly picked to watch, I don't know for how long it has been on my list or how it got there, but after watching the first five minutes of the first episode of Shigurui (or, as I would call, \"Tits and bowels\") I thought \"damn it, it is directed by the same guy from Texhnolyze\" and I was right... it looks like Hamasaki's speciality and main goal is to make you drop his series at the first episode, the torturous slow pace and cryptic direction, how he goes on and on barely developing anything, can only be endured because of the trully astonishing art andmusic that accompanies his work, and for knowing him I knew I'd also be greatly rewarded with the story development once enough pieces of it were presented if could just endure this beginning. So be wary of that if you pick it to watch.\\n\\n\r\nShiguriu takes place in the Edo period and feels like a classic novel, it's not an adventure nor action packed, and after watching it I went straight to the manga (you will know why if you watch). The manga is a masterpiece on its own, and I thought how hard it would be build up the tension and suspense as Hamasaki does in the anime without the aid of timing and music, but then I realized the real challenge might have been how to transfer all the emotions to the animation without the use of a narrator. Even if the manga was completed by the time the anime came out (it wasn't), Hamasaki's directors cut couldn't be more precise, and it was trully a superb adaptation, extremelly faithful but at the same time bringing this historical romance to new heights thanks to his skillful direction.\\n\\n\r\nI still loathe the slow pace and crypticness, and think for this series too the whole thing could be fit into a single movie and that movie would be awesome. Hamasaki became someone I love to hate, but now I'm left to wonder if this part is not a necessary contrast to reach a greater climax.",
            "date": "2018-12-13T18:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 295735,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5103626.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PxHC",
                "username": "PxHC"
            },
            "url": "https://myanimelist.net/reviews.php?id=295735"
        },
        {
            "content": "The only real thing that could throw people off of this anime is that they are all used to fast paced manly men jumping around showing off their entirely unrealistic swords man skills (that was a shot at Mugen from Samurai Champloo, by the way). Most people would find this show slow and boring or grossly disgusting. However, what they fail to realize is that those are very human things, humans are dirty and seemingly boring. \r\nShigurui is undoubtedly the most realistic vision of ancient Japan that I've ever come across, where honor is everything and real old delirious old men drool and soil themselveswithout shame. \\n\\n\r\nWhat really got me was the way sword fighting was portrayed, as mentioned earlier, the sword fights were subtle, albeit highly stylized. That is as real as you can get to true samurai. The art of swordsmanship was just that--an art. It was supposed to be a poetic act of a one on one duel between warriors. It thrilled me to no end how they pulled it off in Shigurui.",
            "date": "2009-01-09T19:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 11284,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6550.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Amerowolf",
                "username": "Amerowolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=11284"
        },
        {
            "content": "I've heard a lot of bad things about this anime, admittedly, the violence might be seen as a little shocking but it's nothing to get over-sensitive about. Besides, although the hyper-violent side of the series is what seems to get the most feedback, the story itself outweighs the brutal aspects of the series to a point where the violence really didn't interest me. I thoroughly enjoyed this short little series and didn't expect to after the first episode. But, from then on, the story slowly weaved it's way in and had me hooked. I'm a fan of a proper, serious samurai movie and this wasdone as a samurai series should be. It reminded me of a Kurosawa samurai movie. Very slow-paced and I think it worked well that way. Very strange at times but also thought provoking if you're into the psyche of a samurai. Much like Texhnolyze, the characters are cold, at times, probably quite dull to your average anime fan. You never really know who to sympathise with, if any. If Lone wolf and cub had ever had an anime series made, it would have been great if it was made in this style. My main gripe with the series is the hugely disappointing ending but I guess that's what you get when the manga is still going. It's a shame, one more episode probably would have done it but I'm hopeful that a second series will get made someday.",
            "date": "2010-03-13T15:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 23943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304186.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuvie",
                "username": "Yuvie"
            },
            "url": "https://myanimelist.net/reviews.php?id=23943"
        },
        {
            "content": "ok.... so the Tokugawa (Edo) Period, in a nutshell, was more-or-less peace from 1600 to 1867.  this story takes place during that time period.  the drama of deceit and betrayal run deep in this plot.  this show is not typical by any means.  if you are not Japanese or do not understand Japanese historical culture, you may want to do some research into the culture.  this show is very true to Japanese theater from music to character's actions.  this is NOT a Naruto or a Bleach type show; DO NOT EXPECT IT OR COMPARE THIS TO THOSE TYPE OFANIME!!!  they do not compare to what this show has to offer to the viewer.",
            "date": "2010-08-08T09:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 29428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jazz007",
                "username": "Jazz007"
            },
            "url": "https://myanimelist.net/reviews.php?id=29428"
        }
    ],
    [
        {
            "content": "The only redeeming features is how stunning the art work is everything else is an affront to the genre, the story odes not make sense there like gaps in the information you are given about characters so have no real basis for how the story got to the point it started at.\r\nSo Shiguri is a show that looks cool but is just not, I'm sure this show will have a following but they are way better things in the genre to watch than this.",
            "date": "2009-06-27T07:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 16187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Koolag1",
                "username": "Koolag1"
            },
            "url": "https://myanimelist.net/reviews.php?id=16187"
        },
        {
            "content": "The way they presented the story felt a bit overly dramatic to me,& the ending was a cliffhanger...Which pissed me off very much.Needs a season 2 badly,but other than that this is a must watch for people who want realistic,gruesome & dark Samurai based anime.\r\nA very dark,unusual,realistic & engrossing samurai based storyline..This anime is a lot more different than your typical samurai ages,It focuses more on the story than the actions.\r\nThe animation/artstyle was a bit different & can be kinda disturbing at times,but that's what makes this anime unique..The action scenes are simple,short,gruesome & realistic too..The kind that keeps your eyes wide open.\r\nThis anime isintended for mature audiences,contains extreme blood & gore,mild nudity,sexually explicit content & some very disturbing scenes too..So steer clear of this anime If you dislike these kinds of violent content.\\n\r\nThe characters in this story are absolutely amusing is all I can say.\\n\r\nThe soundtracks are basically old school samurai era based music,so perfectly suitable for this kind of anime.",
            "date": "2017-11-19T07:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 263551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6515508.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/M3Cyberpunk",
                "username": "M3Cyberpunk"
            },
            "url": "https://myanimelist.net/reviews.php?id=263551"
        },
        {
            "content": "Wanna watch a depiction of the reality in the samurai age? Then Shigurui is the right anime for you!\r\nIt basically follows the harsh reality of a sword style dojo, with the detail that the master has dementia. \r\nIn the first episode, you'll not understand what are those two crippled samurai doing there, in front of the feudal lord, having a sword battle, but it will all get explained during the show.\r\nWe'll see the challenging of the dojo by a outsider and how they treated them.\r\nThe story is mainly a tale of taking control of the dojo, revenge the power of the feudal lords, it willhave sex, in several forms, including BDSM and raping. And don't forget, this is the most violent and gory anime ever made.",
            "date": "2017-10-17T00:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 260999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3007063.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/misterferrari",
                "username": "misterferrari"
            },
            "url": "https://myanimelist.net/reviews.php?id=260999"
        },
        {
            "content": "Very gory samurai anime that some may call pretentious and overly arty but I think it's an excellent show in so many ways. The story line is simple, easy to follow and classic: pitting two swordsmen against one another and telling their story by jumping in and out of a chronological order. \r\nThe art is well done and some of the sword-fighting scenes are superb not because they are flashy but because they pack a whole lot of tension. It's like being coiled up like a spring and unleashing at the sound of a drum-beat. Lethally cool. \r\nEach character had a specific style or look,which was excellent. Particularly Seigen Irako and Gennosuke Fujiki, both of which have distinct/unique fighting stances or skills. \\n\\n\r\nThe series ends in a cliff-hanger and leaves a lot of questions unanswered. I was expecting a few more episodes to wrap things up so it definitely left me hanging. Will be looking forward to a season 2 and hope that they do create one too. This is a terrific anime and a great mood piece. If you're into samurai movies/animes you should really give this a watch.",
            "date": "2009-05-03T13:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 14756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127814.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/milhouse",
                "username": "milhouse"
            },
            "url": "https://myanimelist.net/reviews.php?id=14756"
        },
        {
            "content": "Shigurui will grab you with its dark yet amusing vibe from the very beginning. There were times where i got just a little bored, but as a whole the anime is excellent. This anime is probably as realistic as it gets, it is most honorable for a samurai show. The grotesqueness is absolutely 100% enjoyable. Okay i lied, 95% for sure though. Anyhow if your dad is getting tired of the old cowboy movies put this on for him.",
            "date": "2012-04-27T06:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 59807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1189361.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/serj_tankian",
                "username": "serj_tankian"
            },
            "url": "https://myanimelist.net/reviews.php?id=59807"
        },
        {
            "content": "Shigurui is an art piece.\r\nA significant visual style, combined with unique audio, a samurai story and a sizable cast of characters, creates an atmosphere I’ve never seen the likes of.\r\nEnvision a post-modern art exhibition. You’re entering a large white room filled with a few abstract objects. You definitely recognize the objects, but you are unsure of what their purposes are. In the background an old cd-player let's off a reverberating noise, this noise could be anything from a car engine to a water droplet, graciously touching the water. The sound and the visual objects are supposed to converge into a symbiosis of something deep, somethingmeaningful and passionate. This combination of perceptual information is supposed to reflect the artist's feelings and expression, and convey some sort of message.  At least that is usually the intention.\\n\\n\r\nShigurui tries desperately to be like this sort of art piece, and some people would probably regard it as a successful one. The subjectivity of the matter is therefore prevalent.\\n\\n\r\nObjectively the art and animation is of a high quality. The animators of Madhouse successfully create a dark and washed out canvas, which really adds to the usual perception of the romanticized vision we hold of Edo Era Japan. The outdoor scenes during daytime are particularly beautiful, albeit most of the scenes are contained within Dojos, which feels like it does the animators a great disservice, hamstringing the visual variety to a great degree. Understandably this is a limitation created by the story and the source material, which is a bit unfortunate in my opinion.\\n\r\nThe way the story is told felt disjointed and messy.  Focusing around a “final lesson in the artistry of violence where nothing is more beautiful than the kill.” (episode description), the story emphasizes strange parts of what’s important when conveying a good story. The characters throughout the series are never really introduced in a way that differentiates them, except for their respective fighting styles. The whole cast of characters neither feel protagonistic, nor antagonistic, they simply feel bland. Like soldiers (in this case samurai) following their generals orders. Instead of conveying thought, judgment or even consideration for their actions, the cast is more reminiscent of participants in the Milgram Experiment than actual human beings. Historically this might be somehow accurate, but it when conveying a story, this really hurts the ability to generate emotion and recognition for the viewers.\\n\\n\r\nThe story in itself is really basic and boils down to “People must kill each other because (insert reason)”. Devoid of characters of interest, the plot doesn’t generate any purpose. Simply put, when characters you don’t care about simply die, you simply won’t care. Thus the kill serves no purpose except for the visual presentation of a murder. When this is expressively described in the episode summary, you certainly must realize that the focus of the storytelling is simply wrongly weighted. \\n\\n\r\nIn addition to the unbalanced storytelling, Shigurui is also its self-perception. The fact that the anime takes itself so seriously makes the action feel forced and unnecessary. Perhaps this is historically accurate, but that is still no excuse for such a dull presentation of an interesting subject as Samurai. Instead an idiosyncratic presentation of each of the samurai, and a battle after such an introduction, would’ve felt much more satisfying. \\n\\n\r\nThe focus on the “Beauty of the kill” and not on the characters isn’t the only fault of Shigurui. The way the audio and visuals converge feels horrid. The simple noises, always playing in the background distract you from what happens on the screen, instead of simply adding to the story. A good musical score would have fit this story a lot more.  Even though I prefer a good score, the creators should be commended for trying something different, but when taking such a risk, you should be prepared to fail. Shigurui fails strongly in this regard. \\n\\n\r\nTL;DR: In short Shigurui tries to be a post-modern art piece about Edo Era Japan, but fails in every regard in doing so. The presentation is hamstrung by its historical ties. Even though the art is beautiful, the story feels disjointed, the characters feel mechanical and they don’t reflect any emotions or characteristics worth noting. The sound design is weak and detracts from the overall experience. \\n",
            "date": "2014-05-30T03:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 145083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3529959.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shadepollution",
                "username": "Shadepollution"
            },
            "url": "https://myanimelist.net/reviews.php?id=145083"
        },
        {
            "content": "Prefacing this review by saying this show is bad. If you're considering it, don't. It's not worth it. This show has no pay off and the moments which can be considered good are few and far between. \r\nNow, I'll explain.\r\nI've seen some strange and downright weird shit in movies/anime over the years but everything pales next to Shigurui. It's elicits an uneasy sense of dread, a fear of nothing that is hard to compare to anything. You will feel sickly at certain points, that is a certainty. I would like to mention that I'm normally good with stuff like this. I like to think Ihave the stomach for this but by the end even I found this hard to watch.\\n\\n\r\nThe worst aspect of this show is how they attempt to turn every scene into the worst possible scenario. You will see rape, molestation, murder, decapitation, grievious bodily harm with the intention of maiming and some of the weirdest character interaction ever seen. And the worst part is you won't even care what happens because you will have no sense of any of the characters by the end of the show. They are all wooden sociopaths who like to swing swords. That's it. \\n\\n\r\nAlso the story seems like it never knew where it wanted to go and the ending you get is not the one you want. I will give quarter and say the opening to this show is interesting and it will pull you in but there is nothing worth staying for. I honestly have never felt so cheated with an ending. \\n\\n\r\nThe animation is decent, nothing spectacular with a bland depressing colour palette to accentuate the already depressing atmosphere. You like grey, black, brown and red? Then this is the show for you. Didn't see green, purple, yellow or orange at any point. \\n\\n\r\nMy ultimate gripe with this show are showdown sword fights. These should be the highlight of this show, I mean, the rest is talking and setting the mood as they build up to a  bloody fight and then you get, what's that? Still images of the character as they swing towards each other and cutting away to after the fight where the victor stands over a corpse. I understand cinematic integrity and that it is their choice but they don't do this just once. They do it at least four times. We want to see the action but sadly that does not happen.\\n\\n\r\nSo... yeah, I didn't enjoy this at all. If despite this review you wish to watch this show then go ahead. Just be prepared for the disappointment of getting nothing out of it. \\n\\n",
            "date": "2016-01-23T00:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 209166,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955705.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dieseldorf",
                "username": "Dieseldorf"
            },
            "url": "https://myanimelist.net/reviews.php?id=209166"
        },
        {
            "content": "Summary: The art in this anime is fantastic... it is one of the few I'd recommend watching in 1080p instead of a lower quality. That said, everything else about this anime is pretty bad. The story is extremely confusing (told in flash backs and flash forwards), most of the characters look very similar, tons of plot points are dropped or not nearly as relevant as the amount of screen time they were given, almost all of the characters were awful people and had little development, and the story STOPS IN THE MIDDLE. IF you're not interested in intense violence and gore with flashy animations orsamurai and the Edo time period, I suggest just skipping right on by this one. In fact, do yourself a favor and watch Basilisk if you're looking for that kind of thing, since it is basically this story but 10x better in basically every way.\\n\\n\r\nStory: 4/10\\n\r\nThe story is bad. It is extremely confusing, told in an odd way, and doesn't make a lot of sense to me. I didn't really know who a lot of characters were, what their motivations were, or where they were going. It certainly doesn't help the story starts with an epic scene and then flashes back and concludes before the flashback (so you have no idea how the intro fight scene turns out).\\n\\n\r\nArt: 9/10\\n\r\nFlashy and done extremely well, this is an artsy piece. The violence is gory and realistic, if this isn't your thing you won't like the overall art style.\\n\\n\r\nSound: 6/10\\n\r\nIt is period appropriate and gets the job done. The voice actors do a good job but generally the sound is minimalist.\\n\\n\r\nCharacter: 5/10\\n\r\nMaybe it was because I couldn't tell anyone apart except for a few of the main characters, but I didn't understand most of the characters development, motivations, or really much else. This may be better than I am giving it credit for, but you have to have a very good sense of what is going on and pay very close attention.\\n\\n\r\nEnjoyment: 3/10\\n\r\nI did not enjoy this. It took me nearly 2 weeks to get through it (and it is only 1 season). I just didn't empathize with the characters or have much of an idea what was going on. The style of story telling was fairly bad and if I hadn't invested into it for the first half of the season I would have dropped it. \\n\\n\r\nOverall: 5/10\\n\r\nIf you have a good attention span and really like samurai and period pieces with gore and sex and violence you might enjoy the. Then again, if you like coherent stories, a diverse cast with character development and a story that wraps up at the end of the anime, you'll hate it. \\n\\n\r\nSidebar, if you are planning to hold on to see who wins from the fight in the 1st episode, just drop it. You never find out in the anime. I was thinking about using google to figure out how the manga ended, but I think I'll just forget about it and move on since honestly at this point I really don't care.",
            "date": "2016-03-06T14:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 212391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=212391"
        },
        {
            "content": "~This anime is about the stories of Fujiki Gennosuke and Irako Seigen, the two extraordinary skilled swordsmen of Iwamoto Kogan's \"academy\". One of them will eventually become the heir of the academy, which creates a bit of a tension between them, even tho the potential heritage isn't the only thing that makes them dislike each other.  \r\n~I find the story really interesting, and the gore element makes it even more appealing to me (hehe) but despite all that, during the series, I felt like something was missing. \r\n~I soon realised that I didn't really care about the death/torture/rape (yes it includes all that) scenestowards most of the characters. I found that I was having a hard time bonding with the characters, mostly because I felt like I was just a spectator to whom the feelings and the emotional states of the characters weren't fully displayed. Most of the characters are closed to themselves, rarely expressing any feelings. Some people might like that, but after a while it made me lose interest in the story and be amused only from the interesting gore scenes. \\n\r\n~After all, it is a great story, with interesting animation (everyone looks alike yet so different), character development but lacks expression towards the viewer. If only I could sympathise with a character or really feel what it's like for them to change, this series would be so, so much better. \\n\\n\r\nAaaand that was my review teehee ~~~",
            "date": "2017-06-20T06:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 250431,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4781938.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AlexMark_",
                "username": "AlexMark_"
            },
            "url": "https://myanimelist.net/reviews.php?id=250431"
        },
        {
            "content": "At the risk of fanboying, this is one of the few if not the only series's I've ever encountered that manages to not idealize feudal era Japan. It truly reflects the stoic and jarring world of honor bound killing and entire communities premised on power and violence. \r\nIn addition to its starkly accurate historical perspective, the directing aides the story so well, suspending every moment to discomfort and stress. One of the most unique animes ive ever seen, truly fascinating and well crafted.",
            "date": "2013-06-02T13:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 99499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2655965.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IKB",
                "username": "IKB"
            },
            "url": "https://myanimelist.net/reviews.php?id=99499"
        },
        {
            "content": "This is a pretty bloody ronin show with surpringsingly little action. While there is so much gore, it hardly happens in swordfights but all kind of violent situations along the way. The show focuses mostly on establishing on this calm, unsettling atmosphere like in Seriel Experiments Lain or Kurozuka, wich is quite to my liking. Most of the sword fights consist of the characters meditating / starring at each other and are suddenly over in one blow. \r\nUnfortunately this super slow story telling really eats on the enjoyment in the long run. The more episodes you watch, the more it becomes a drag. The storyfrom these 12 episodes could have been told in 4 to 5 episodes and we are also faced with some major plotholes. So if you enjoy the atmosphere in the shows of Yasuyuki Ueda and Hiroshi Hamasaki, this one might be for you.",
            "date": "2018-10-11T14:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 291504,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ParadoxDelta",
                "username": "ParadoxDelta"
            },
            "url": "https://myanimelist.net/reviews.php?id=291504"
        },
        {
            "content": "I was looking for something over the top. Lol I found this. If you can handle some serious crazy **** this is for you. It was a little slow but the art work is good and the gory factor was high. The storyline was interesting enough for me to watch when I'm not really into samurai stuff. Truthfully I think only finished it to see what other horrible things could happen. Definitely entertaining. I probably will not watch again however it is worth watching. I will not be forgetting this anime any time soon. \r\nSpoilers.\r\nHe really ate that nipple.....\r\nWatch and be beware of this horrificscene. As a lady I could not think of something worst than this lol.\\n\\n\\n\\n\\n",
            "date": "2016-04-09T09:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 215929,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5256193.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Breeshi",
                "username": "Breeshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=215929"
        },
        {
            "content": "Having been attracted to the show because of its gory theme, I was ready to embrace the brutality, but upon looking a little deeper, there's just no substance here. To quote a character in the last episode, “This isn’t a dojo, this is hell.” Beyond displaying the bleakness and brutality of the Edo period, this show has nothing to say. Even those looking for beautiful kills and gore will not be satisfied. Heralded as one of the most violent things out there, I see why, but not in the way I had wished. The reason it has this reputation is that it focuses on theblood and innards of its victims. Intestines spilt out in the beginning scene is a forewarning. This is their go to for showing brutality...intestines! I appreciate this the first time, I don’t often see this level of the grotesque, and I appreciate that, I’m not squeamish, but you see intestines spilt 4-5 times. It loses its shock by the second time, and by the fifth time, in the last episode, I was laughing. “O God, they're going for the intestines again?!” All jokes aside, lets show some creativity here, there are many ways to dismember samurai. Grotesqueness does little for the viewer unless there’s some meaning behind it. That goes for the nudity as well, they just take off the clothes of their two female protagonists like no body’s business, it is done in a very pornish kind of way, “wow look at her tits,” beyond the shock value there’s no meaning behind the nudity. If you're going to have nudity, do it a little more skillfully.\\n\r\n     The show looks phenomenal, but too often I feel like they wasted money and detail on dreary settings and guts, hence why the show doesn’t even make it through a season. Yes, that’s right, some reviewers here have glossed over the fact that this show is simply not completed. It just dies after 12 episodes. After a promising first episode they flashback to 2 years previous, intentionally of course, to develop the characters, yet in the end, you never even make it back to the first episode. The rivalry between the two main protagonists and their eventual battle, which i thought was the entire motivation of the show and intention for the flashback, never comes to fruition. So, I get it, the show is not finished, I won’t judge it on just that, plenty of good shows get the plug pulled on them, if those 12 episodes are brilliant then that’s great, there will be the blue ballz effect as some story arcs will never be fulfilled, but I can still appreciate it an extent. This is pure pornography though. The story is at times intriguing, but the way scenes jump around doesn’t make sense. I could follow the show but I had to assume a lot. I’m sure it was created with the manga reader in mind, but that doesn’t mean they should leave huge holes. There’s no real narrative, random things just kind of occur.                     \\n\r\nOn top of that, there are no real likable characters. You’re naturally drawn to Fujiki, I guess the main protagonist, but that’s only because he’s slightly nicer than everyone else. Every character in this show is a piece of shit. But even with shows like Death Note or Game of Thrones, inhabited by antiheroes, there are things that attract you to the characters. There’s no one worth rooting for in the show. Everyone acts for the sake of power and for themselves. Maybe this is realistic, which some reviewers say Shigerui recreates a realistic Edo Japan, but I have a hard time seeing that none of those samurai, especially, the dojo leader, have an ounce of wisdom in them. There is no love of life in these characters, just in furthering their own power and exacting revenge. They are all quite shallow, sure we can enjoy characters like this in many shows, but when all the characters have this viewpoint the show becomes a bit of a boor. You could plug any character (besides Fujiki) into any situation and they’d probably do the same thing.\\n\r\nThe intentional flashback 11 episode arc, doesn’t even do a good job of building up characters. Characters rarely last longer than an episode. A character is often introduced, there is a brief flashback to show what a character is generally like, and then they kill him off frighteningly quick. There’s no point of showing background info for a new character if you’re just going to kill him off in 7 minutes, its a waste of time for the viewer. And that’s also the problem, I understand its realistic for samurai to take their enemy down in as few swords swings as possible, but because of the quick nature of these fights, there’s no real satisfaction in the fighting. They build up a fight for ten minutes and then someones dead instantly. Every fight has potential and then in end it was obvious how much stronger one of the samurai was. What’s the beauty in that, samurai didn’t just kill to kill? There really aren’t many fights per se, there are some murders, and sometimes they don’t even show the fight, just the result of a decapitated head. For example, one samurai is said to have incredible strength, they build up his potential, then he is merely killed in a hot tub, he is unnamed and doesn’t put up a fight, what’s focused on is the blood splattered in the bath house. Later, another might warrior is killed when his back is turned to his enemy. Not trying to go on here, but what I’m saying here is there is no beauty in the kill, the gore is just exemplified, and let me make this clear, I love gore! \\n\r\nOn top of that the show tries to be deep at points, showing closeups of flies on guts, cicadas screeching, but it just falls short, being artsy without real meaning is cringe worthy, it made me laugh in the end. Its all too bad because it really seems like there is tons of talent on the show. They really just needed the writing to pull it all together, but as is its just a bunch scenes mashed together. Beyond showing the brutality of the era it doesn’t give me much. If you’re a fan of intestines and want to see something brutal, go for it, it’s only 12 episodes, but by the end, like me, you’ll probably feel a little cheated. This is just not a real show, it is incomplete.",
            "date": "2015-03-26T11:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 183479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LordFolgers",
                "username": "LordFolgers"
            },
            "url": "https://myanimelist.net/reviews.php?id=183479"
        },
        {
            "content": "It starts of very interesting. The animation and the way they display and build the characters is interesting. The gore is nice too.  However the anime is very confusing to understand. The ending is greatly disappointing too. The more i watched this the further i became confused and less interested. As for the action i felt it was too slow paced. I'm a fan of action anime and usually prefer fast paced action or thrilling action. But as the series went on i felt that this was lacking so for that reason I wouldn't recommend this anime",
            "date": "2014-09-11T06:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 159901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BobDiesel",
                "username": "BobDiesel"
            },
            "url": "https://myanimelist.net/reviews.php?id=159901"
        },
        {
            "content": "I enjoy blood with a purpose but this was just graphic and violent. Not my taste at all. The story was hard to get into - maybe I didn't give it justice as I know many anime start slow and get better but I just couldn't get past the violence. I also gravitate more toward heroine stories so this may have been part of my disappointment.",
            "date": "2011-02-23T03:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 34671,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/434253.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Noshgard",
                "username": "Noshgard"
            },
            "url": "https://myanimelist.net/reviews.php?id=34671"
        },
        {
            "content": "This anime was exquisitely drawn and edited, some of the most graphic violence I've ever seen, and the characters and everything were awesome- but the ending was awful.\r\nKeeping in mind you see the end of the story in the 1st episode and the other episodes build up to that, there was still a lot left out, like there should have been a second season.  Had there been more episodes to properly complete the story, this would have been a 9 or a 10.\r\nIt was worth watching, was very good and enjoyable, the ending was just a huge let down, like there were was thisbig chunk missing from the plot.",
            "date": "2011-08-18T18:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 41717,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/414218.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sonjajade",
                "username": "sonjajade"
            },
            "url": "https://myanimelist.net/reviews.php?id=41717"
        }
    ]
]