[
    [
        {
            "content": "Okusama ga Seitokaichou is a perfect example of how to do simplistic ecchi correctly. It doesn't have any form of serious storyline, no cheesy drama, no annoying teasing at romance that never actually goes anywhere. It's just pure intimacy in both love and lust; more of an actual representation of what teenage couples do to each other in real life. And quite frankly it's a breath of fresh air, because it gives you exactly what you're looking for as a viewer and nothing more.\r\nThe story (if you can call it that) is extremely straightforward. We have student council president Ui who one day announces thatbecause of an alcohol-influenced agreement between their parents, she is to become the fiancé of the vice president and protagonist Hayato. Thus they start cohabitating together, and they quickly get very intimate with each other. Queue lots and lots of lewdness. Uncensored lewdness (even during the TV-airing, on AT-X). It doesn't quite reach the level of ecchi legends like Kiss x Sis for example, but it's still pretty damn hot. Many boners have been had. But it's more than just that, because honestly their relationship feels a hell of a lot more natural than most couplings you see in anime.\\n\\n\r\nThe only real problem I have with this anime is that despite everything, it is a quite poor adaptation. For one, the characters are way less moe than in the manga. Especially Ui herself is nowhere near as loli as in the original, and I also find her voice actress choice rather questionable. More importantly however, Okusama ga Seitokaichou is ruined quite a bit by the fact that it for whatever reason only has 8-minute episodes. I don't really know why it couldn't get a normal-length TV-airing given that the manga has like 8 volumes' worth of content already, but what's done is done. Of course what little content the anime actually does cover is still very good, but it kind of feels like the story is over before it's even began this way.\\n\\n\r\nThat being said though, in the end what you have is an anime which feels incredibly natural as far as character relationships go, much more so than most series. The ecchi scenes never feel forced or out of place, they go beyond mere teasing and they actually give you what you want to see as a viewer. It's almost sad just how rare that is to see in anime.\\n\\n\r\nOh, and make absolutely sure to watch the uncensored version if/when you pick this anime up. There is absolutely no reason whatsoever to watch it otherwise. And once you've done that, I'd recommend you to try out the manga as well, because it's so much better still.",
            "date": "2015-09-17T11:53:00+00:00",
            "helpful_count": 170,
            "mal_id": 198756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=198756"
        },
        {
            "content": "When the \"plot\" is more important than the plot, you know you're dealing with a second-rate show. Okusama ga Seitokaichou! isn't the type of title that requires any sort of in-depth analysis to explain, it's pure fanservice in animated form. With that being said, this review will be brief. \r\nThe 1st episode of Okusama is perhaps the biggest troll of the 2015 summer season. It caught many by surprise and rightfully so, as it seemed to have devised a way to get past Japan's impenetrable censorship law, leaving its rival ecchi titles in the dust. While most shows were caught up in the red tapeof censorship, Okusama was delivering the 'goods' with no filter whatsoever. This prompted many viewers to loosen their belts for what was expected to be a \"plot\"-driven ecchi title that wasn't afraid of going the extra mile to please the audience. But just as quickly as it garnered attention, it seemed that it couldn't maintain it, as the following episodes showed that the initial climax was well behind us. Lack of censorship, the only benefit Okusama had going for it, was quickly stripped away, bringing with it a tidal wave of flaccid onlookers. And as the buzz dissipated into a soft murmur, Okusama fell in line as yet another xerox copy of the same ole shit that has come before it and will continue to be produced long after its 15-minutes of fame was up. \\n\\n\r\nLike most ecchi comedy series, the story of Okusama is basically the same setup seen countless of times before. A guy is forced into some odd relationship with a girl under circumstances that he has no control over, lots of sexual comedic mishaps happen, yadda yadda yadda, you know the drill. It's the tired trite that makes up a majority of the shows within this genre. The only purpose of the narrative is to compress as many titillating encounters as it possibly can in the limited time-span given.  \\n\\n\r\nThe cast, as to be expected, is composed of one guy and a plethora of girls. The only girl of relevance, Ui Wakana, serves as the main love interest and also the source of grief for our protagonist. The rest of the female cast can simply be defined by a personality quirk and their breast size.\\n\\n\r\nPossibly the only saving grace for this title is its protagonist Hayato Izumi, as he's among the very few ecchi leads that aren't afraid to take action if his hormones boil over. Of course, he pussies out like any other beta-male, but he still does a lot more than other counterparts delegated to his role. But even with that being said, don't hold your breath, as the TV release was still censored to all hell, with raunchy scenes being swapped out for what I can only describe as collage screenplays (sometimes live-action), leaving the audience to only imply what might be going on. It's more frustrating than funny since it defeats the purpose of it being an ecchi. Watching censored ecchi is like watching an action movie with all the action scenes being blacked out. It's utterly pointless, and really, that's Okusama in a nutshell, utterly pointless. \\n\\n\r\nOverall: 2/10 \\n\\n\r\nIf you just want some fanservice or enjoy being cock-teased, then look no further, as Okusama seem to be dead set on doing just that and nothing more. But honestly, with ecchi shows like Prison School, Highschool DxD and Queen's Blade around, it's hard to even recommend this show even on such simple merits. In this day and age, Okusama is already antiquated.",
            "date": "2015-09-17T16:39:00+00:00",
            "helpful_count": 118,
            "mal_id": 198777,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=198777"
        },
        {
            "content": "In recent years, the concept of what is allowed in anime in terms of any kind of lewd media has slowly been changed.  It's to the point that the shackles have completely been broken and focusing on which girl has the biggest breasts or who can scream the most lewd has become top priority.  And so we have Okusama ga Seitokaichou, or My wife is the student council president, a show that tests this idea, but not as intensely as one may think.\r\nStory: Okusama (as I will be calling this show) starts off with our main protagonist Izumi Hayato, a boy who triesto get the student council president spot in order to lead the school into a new era.  That is...until his rival, Wakana Ui crashes the party and wins the election by a landslide by promoting a \"healthy relationship policy\", forcing our main protagonist to become the vice president of the school rather than the coveted student council president.  Even more to beat a dead horse, he finds out that this same girl is also his fiancee as organized by their fathers in a drunk meeting when they were just kids.  And well, that's...really our story.  \\n\\n\r\nAs a television short, Okusama has a very short runtime and doesn't really give much in terms of content for the show.  For the most part during its seven minute runtime, the show gives a quick overview of a given chapter in the manga, with most of its time centered heavily around the more risque areas of the chapters.  For the most part, any given episode is a general gist of the setting or period of time that's happening, usually with Hayato thinking \"No, I'm not doing anything with this girl\", and then proceeds to do stuff with said girl, usually resulting in breast suckling, inappropriate touching, and lewd screams.  There really isn't much to say for the show in terms of progression because the characters for the most part stay the same the whole way through and the only real development is time passing with every new episode.  \\n\\n\r\nOne of my biggest complaints about this show is simply the fact that it is a television short.  A lot of the story and characters could've become more fleshed out if they were given a proper 30 minute timeframe rather than a tiny seven minute one.  In the end, this short didn't really serve to do much more than create sexual tension between an adolescent boy and girl, and there really is already enough of that in the world of anime as is.  There wasn't really any variation because it was all ecchi, and ecchi doesn't always make a good show.  Plus, the ending was quite lackluster since it just...stops at a random chapter in the manga.  \\n\\n\r\nOverview:\\n\r\n+/-  Very ecchi centered (if you're not into that, then you won't like it)\\n\r\n-  Entire show is basically all ecchi\\n\r\n-  Not much variation from one episode to another\\n\\n\r\nCharacters: Characters in Okusama are a bit of a definite distinction.  There's Ui, there's Hayato, and then...there's everyone else.\\n\\n\r\nLet's start with Wakana Ui, our main female protagonist.  Ui is a doubled sided coin.  On one hand, she is the dominant president at school who will do everything in her power to enforce her \"healthy relationship\" policy, and on the other, she's a little kid who begs her \"husband\" to do everything for her.  Her personality is mostly focused on the idea that she is a girl who accepts the engagement and wishes to be a good wife to the main she is \"married\" to.  As her persisting trait, she attempts to get Hayato to love her back the same way which creates the most prominent gag in the anime, which proceeds to create some very dangerous situations.  (I will get back to that later.)  Apart from her innate traits, she is very one-sided, not broadcasting any form of character development or anything of the sort, so don't expect anything like that.  (This is just a seven minute short after all.)\\n\\n\r\nAnd then there's Izumi Hayato, the male protagonist.  Unlike Ui, Hayato is very resentful to the idea of the marriage the two of them share, as he doesn't like the idea of having Ui as his wife and is very much against the idea of this girl just coming into his life and proclaiming that she is married to him.  That is, until the male hormones kick in, then things get interesting.  Unlike a lot of other male protagonists that share a similar situation, Hayato does have a \"breaking point\".  Most male characters that have a temptress flaunt their goods at them tend to just shy away or even run from the situation entirely.  Hayato isn't like that.  Instead, he will dive straight into those boobies and suck out whatever they're good for.  While it is honestly quite refreshing to see this trait, it also serves as the show's downfall.  As a direct result, it creates these low brow ecchi moments that really don't serve much purpose aside from cheap and overused fanservice.  Does a justice, but hits the series hard at the same time.\\n\\n\r\nAside from those two, the other characters in the series include Misumi, the disciplinary head with the cow tits, her loli boobrest Sawatari, other members of the student council, and Ui's parents.  All of them are presented as one note characters, with each getting about ten or so minutes of screentime maximum since their purpose in the series is to become a plot device that only either drives the story along, or serves to create more ecchi moments.  Cause lord knows we can't have enough of those.  :p  Really though, they're only plot devices in this anime, so they're not worth talking about too much.  \\n\\n\r\nOverview:\\n\r\n+ Different character trait for an Ecchi Protag\\n\r\n-  All of the characters are very one sided\\n\r\n-  Side characters are simply plot devices above all else\\n\\n\r\nArt: The art for Okusama is very standard for this day and age.  It has a very light color scheme so everything shimmers off to the point that everything kind of looks like Key's Clannad (right down to the eye designs, kind of) and it all looks rather bland to be honest.  Everything is kind of a beige color and there really isn't much color pop for the series to be proud about.  \\n\\n\r\nAnd since this is an ecchi show, talking about the ecchi's art in this show is a must.  Since the entire show save for maybe three minutes in a given episode is ecchi to some degree, the show surprisingly enough, shows uncensored footage for its release.  (Odd for a TV short.)  Meaning when you watch this show anywhere, you'll be getting every bit of breast they show, and every sexy moment that they squeeze into a seven minute time frame.  Is it done tastefully?  Not exactly, but it's not entirely cringeworthy to watch.  It does get tired after a while though.\\n\\n\r\nOverview:\\n\r\n+ Uncensored release\\n\r\n+/-  Average art style\\n\r\n-  Bland color scheme\\n\r\n-  Ecchi gets boring after seeing it so many times\\n\\n\r\nSound:  The soundtrack for Okusama is just basically its opening and its ending.  The opening is the more memorable of the two for being catchy to a degree, but neither song really has much impact on the show as a whole.  \\n\\n\r\nPersonal Enjoyment: As someone who has read the Okusama manga, this adaptation was honestly subpar at best.  Looking at the anime at face value, there really isn't much to say about it.  It's an anime about a girl and a guy who end up getting into some pretty risque situations before ending the episode and wait till next week where we'll see them tease each other in a different place.  There really wasn't much variation from one episode to the next and in terms of basing it from the actual manga itself, was hardly really there save for the story progression and the base character personalities.\\n\\n\r\nDid I like this anime?\\n\\n\r\nI liked it to a degree.  Since I like the Okusama manga, I was tolerable towards this adaptation because I knew what was going to happen and I have a good feel for the character in this series.  Aside from that though, not much else.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nI didn't like the fact that the show just focused solely on the ecchi while not entirely focusing on any sort of story elements that occurred within the chapters they decided to animate.  Aside from that however, a few important characters, Misumi for example, didn't really play as big of a part as she should've which left a bit of a bad taste in my mouth.  No one was fleshed out and it felt a lot more generic than it really should've been.  Plus, the ecchi is very distracting.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you're a fan of ecchi, then you will like this because it's all ecchi.  If you don't like ecchi, then skip it.  It's a seven minute series that runs for 12 episodes, so it doesn't take that long to run through it, but if you're not fond of seeing fanservice to a high degree, I would very much recommend skipping this.",
            "date": "2015-09-17T17:04:00+00:00",
            "helpful_count": 33,
            "mal_id": 198780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198780"
        },
        {
            "content": "My Okusama ga Seitokaichou! review. OPPAI\r\nMy ratings:\r\nStory: Pathetic 1.\r\nArt: Good 7.\r\nSound: Fair 6.\r\nCharacter: Poor 3.\r\nEnjoyment: Good 7.\r\nOverall: Pathetic 1.\r\nFor an 8 minute and 12 episode anime, this was really not a good one, so no more BS. Story (up), the plot was as basic as it can be, it just involves a girl moving into the guy's life and thing were never the same....you might say that there really isn't a story at all, so it was really as pathetic as it can be. Art (up) tbh the rating I gave was for the fanservice since it was the only thing that makes this animefun to watch. Sound (up) well I simply have nothing much to say about the sound except that I do find the opening and closing theme befitting in this anime. Character (up) what can I say, this anime is just all about Ui Wakana and Hayato Izumi, whom I always wish that they just start banging on each other and not just limit it to foreplay, thought I also like Rin Misumi I jaz basically see her as a 5th wheel. Enjoyment (up) basically it's the fanservice and the titillating scene that were the enjoyable part of this anime, everything else are just BS cu'z it was just all foreplay and no actual banging, overall (up) it was really too pathetic even in it's manga form, frankly they should have went hentai with this thing, so that those whom would wanna play with there joy stick can do it in the comfort of their lonesome.\\n\\n\r\nOppai!",
            "date": "2015-09-20T21:31:00+00:00",
            "helpful_count": 25,
            "mal_id": 199109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=199109"
        },
        {
            "content": "Eroticism brings out the carnivorous beast inside of us all, even if we are not aware of its existence. At least with those people who are not repressed to their sexual drives by the time they reach that age group where it truly shines. Anime has been having no shortage of shows that try to tap into these drives in recent seasons. To which I will go against the majority by saying: There is nothing wrong with that. Especially whenever they are just as fun, sexy, and hilarious as Okusama ga Seitokaichou!\r\nA fair comparison to be made about Okusama would be Kiss x Sis. Notnecessarily just because the main girl, Ui Wakana, is voiced by the same Seiyuu, Ayana Taketatsu, who voiced Ako Suminoe in Kiss x Sis, but because of how both anime use fanservice to create a nice, playful atmosphere. As a comedy anime that has the running time of under 8 minutes, this style of fanservice that is there to stimulate and entertain people fits perfectly with the short duration. If this were an anime that was your standard 24 minutes including OP and ED, I don't think the fanservice would've held on for so long. Or worst, it could've tried to take a serious turn to its story like most bad ecchi anime.\\n\\n\r\nKiss x Sis gets away with a 24 minute running time because of the amount of charm all of the characters possess, while Okusama, unfortunately, only has the charm of our two main protagonists. The main male lead, Hayato Izumi, and the aforementioned Ui Wakana both supply a solid connection that was built up to a silly concept of getting married together out of spite from both of their parents. Ui's brand of perverted antics is both subtle and humorous when she tries to bed with Hayato that really takes it up a notch from Ayana Taketatsu's great performance of her. Of course, when those sexy scenes between them occur, they are nothing short of magical, despite how short they are.\\n\\n\r\nThat is where the character praises take a back seat for the supporting cast. Although I do think Ui's mother is just as entertaining as her daughter, the rest do not leave much of an impression due to their short presence. Whatever good that can be found to their character, they are overshadowed by our main protagonists fairly quickly. Ui and Hayato even have moments of hilarity by themselves from their delightful charisma. Ui stalking the other girl who has affections was gut-bustlingly hilarious to see and her throwing condoms to show a sex-positive message to her students added a nice touch of nuance commentary and absurdity to Okumasa.\\n\\n\r\nAs far as short anime shows go, Okusama takes advantage of its duration and makes something that is suitable to take in. Kind of like a fast food restaurant, the quality of the food is suitable for the cost and time that it take for it to be created for consumption. Sometimes if a short anime does too much for its running time, it will appear all over the place as a result. Okusama is a solid watch to experience the character interactions being for what they are inside, lewd carnivorous beasts.\\n\\n\r\nGrade: B\\n",
            "date": "2015-09-25T23:21:00+00:00",
            "helpful_count": 10,
            "mal_id": 199621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=199621"
        },
        {
            "content": "If you're just watching it for the uncensored version, then you're fine. But for the rest of us, even if this was just a mini series, it doesn't really offer anything new. There's really nothing much to say.\r\nStory: There's not much really to talk about this show because it's a short series, and nothing much at all happens. It's about a pair of couples who promised to marry their children to each other, basically. And now Izumi has to live with and is apparently married to Wakana Ui, the student council president at their school.\r\nArt: It's consistent throughout the series. If you're watching the uncensoredversion it's the better of the two since you're not hindered with annoying censorship. The coloring and the animation is alright, serviceable at best.\\n\\n\r\nCharacter: This is show's weakest points. Izumi Hayato is every reluctant brown hair male protagonist archetype. It's no excuse that I say there's nothing much to say, because there's nothing much to say. Everyone is pretty derivative, and don't pull that fanboy shit on me defending it. Wakana has no range as the heroine, unless you're counting the teases. But that's not at all character. The rest of the cast such as the disciplinary committee and Wakana's parents are simply rushed in and rushed out. They're just there.\\n\\n\r\nEnjoyment: Characters are average, simply making the ecchi average or worse. It's no enjoyment if the characters themselves aren't anything special to boot.\\n\\n\r\nOverall: There's nothing to say, really, I really do mean that. It's not the worse thing I've ever seen, which if it were, I could criticize this show much further and elaborate my points. But this is just Ayy lmao.",
            "date": "2015-09-17T14:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 198768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/715239.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/StigmataSasha",
                "username": "StigmataSasha"
            },
            "url": "https://myanimelist.net/reviews.php?id=198768"
        },
        {
            "content": "I have to say that this series was one of the pleasant surprises this season. I went into it expecting it to be a run-of-the-mill ecchi, but ended up finding a funny series with the right mix between comedy and erotic content. Both of these were done pretty tastefully.\r\nThe premise of the show is that the the parents of the two main characters, Ui and Hayato, agreed that they would marry when they were of an appropriate age. So when Ui shows up at her highs chool classmate's house and springs the news that now she was going to live with him, she turns Hayato'sworld upside down.\\n\\n\r\nThe characters are well developed and even though the episodes last only 8 minutes, they managed to make me care for what happened to them and their relationship. The art is very nice, but in order to appreciate this show you need to watch the uncensored version (I also checked out a few of the censored episodes and the quality decreases considerably by missing key scenes).",
            "date": "2015-09-17T16:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 198778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586338.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sebaf74",
                "username": "sebaf74"
            },
            "url": "https://myanimelist.net/reviews.php?id=198778"
        },
        {
            "content": "If you came for boobs, you came to the right place.\r\nWelcome to Okusama ga Seitokaichou, where the objective is to titillate (I respect this anime enough to hand-type the title).\r\nIs there a story? The story goes as far as setting up compromising situations for our lead and the members of his harem. Mission accomplished. (I mean really, can you take an anime with the title \"My Wife is the Student Council President\" seriously?)\r\nArt? Graphic enough to titillate. Mission accomplished.\r\nSound? Acceptable enough not to get in the way of the titillation. Mission accomplished\r\nCharacters? Juuust good enough to make you not face-palm at how cliche they are,allowing you to instead use your palm for something else, amirite? Mission accomplished.\\n\\n\r\nEnjoyment? The episodes are 8 minutes long. Depending on how long you last, this is either the most frustrating thing ever or a perfect fit hehe xd\\n\\n\r\nIf I had to rate this anime for my friends and family, I'd give it a 1 or 2. But for you guys, who I KNOW are thinking of watching this anime the exact same reasons as me, I give it a solid 7.\\n\\n",
            "date": "2016-11-21T13:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 234152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zeralul",
                "username": "zeralul"
            },
            "url": "https://myanimelist.net/reviews.php?id=234152"
        },
        {
            "content": "Can we take a moment to note that there was an absurd amount of sex comedies this season. Between Shimoneta, Monster Musume, Prison High School, To Love Ru Darkness 2nd and now Okusama ga Seitokaichou! It seems like every possible niche was explored to some complicity. But what separates Okusama from the rest of the list is in it's simplified length and even more simplified plot. \r\nOkusama is your typical fair for the genre. The female character is the aggressor in the 'relationship' though she isn't nearly as bad as I am making her out to be. And I say 'relationship' whereas the only reasonthey are together is because the female lead, Ui Wakana moved into the male leads apartment because their parents set them up for marriage when they were children. Something apparently only Ui remembers. \\n\\n\r\nWhile it sounds like I am harping on this show in a negative light I found it pretty hard to find anything actually 'wrong' with the series. It's short length cuts out the filler and goes straight to whatever the issue is that episode. Whether it be a miscommunication or a fellow student living next door. Things you expect almost to a fault. But the energy of the series is fast pace and the characters at least enjoyable in 8 minute bursts. What really helped it along was the clean look of the art which complimented the rather brisk length.\\n\\n\r\nI should probably mention I watched the uncensored broadcast via Crunchyroll. There isn't much to say on the topic. Every couple of episodes would get as close to soft core porn as it could before something prevented the couple from going further. \\n\\n\r\nWhile I didn't fall in love with this anime there wasn't anything to get upset about. It was mediocre but not unwatchable. Some of the subplots were entertaining but due it their short length none of them had a conclusion. The opening and closing songs were forgettable. And yet I would be remissed to give it a bad score. To coin the late great Douglas Adams it was 'Mostly Harmless'. \\n\\n",
            "date": "2015-09-18T23:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 198860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4883381.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/The_Boogiepope",
                "username": "The_Boogiepope"
            },
            "url": "https://myanimelist.net/reviews.php?id=198860"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI remember having a position in my high school’s student council. By student council, I mean a shoddily put together group of kids that mostly used the affiliation for their college applications rather than as a means to “make change.” Of course, we did take part in acts of kindness – I distinctly remember creating gift baskets for the bus drivers and dealing with the tabulation of numbers on a spreadsheet. The sad revelation is that, outside of those two moments, I did not do much within the student council. I was not the president, thevice president, or even a member with an official title. I was simply one more body to be called on when a specific occasion popped up, with nothing but the extra graduation chord around my neck signifying the impact I had while a part of that club. Needless to say, then, marriage was not on the menu during my brief stay within the student council, but the same cannot be said for Okusama ga Seitokaichou!, an anime related to matrimony, important meetings, and a smattering of breasts now and again.\\n\\n\r\nSTORY\\n\\n\r\nOkusama ga Seitokaichou!’s narrative can be summarized as one word: amount.\\n\\n\r\nThe heftiest amount of emphasis the anime has is on the concept of marriage. Traditionally, marrying another individual involves devoting one’s body, mind, and soul completely. Polygamy exists – where one marries many – but the majority of people think of the one-to-one bond as opposed to the multiplicative one. In other words, the amount of times someone marries – excluding divorces and death – is once.\\n\\n\r\nInterestingly, despite the anime’s focus, it blurs the line between singular and some. While not technically listed as a harem, the anime goes out of its way to place attention on a handful of women, giving the audience a plethora of girls to root for or fancy. Granted, the only other true contender besides Ui is Rin, but even then it goes against its own tenets.\\n\\n\r\nThe show is titled, “My Wife is the Student Council President.” Not “My Wives Include the Student Council President” or “One Wife of Mine is the Enemy of the Student Council,” signifying the importance of the relationship between the male and female leads. So it is strange to see the anime trying to force the supposed husband onto other women; the “tsundere” specifically has erotic scenarios, with one instance having her and Hayato in a love hotel and another with him groping her butt. Again, for the sake of argument, Hayato does not seek these situations purposefully – the former was the result of bad weather while the latter was a classic misunderstanding. But that still does not detract from the notion that the show intermittently reduced its attention on its marriage aspect in favor of contextual cheating.\\n\\n\r\nReduction can also be seen in the amount of minutes available. At approximately eight minutes per episode, the show is constantly pressed for time, leading to two types of thought. The first requires the anime, due to so little time, to do more per episode than a normal, twenty-four minute one. The anime literally has no time to prolong conflict, forcing it to cram in as much as it can in order to leave an impression and to push its narrative and its characters in a worthwhile direction. The second requires nothing of the anime since it is understood that less time means less to offer. It might be slightly unfair to expect the show to do much of anything with the minimal amount of resources it has.\\n\\n\r\nIn Okusama ga Seitokaichou!’s case, it combines both routes, resulting in even further reduction. At times, the anime goes meaningful, trying to instill some value in the tale it was telling. This most notably happens near the end, where Hayato recollects his past, causing him to care deeper for Ui than he had previously. But it feels awkward following a pair of boobs being (literally) shoved in the viewer’s face. Other times, the anime sticks to its “ecchi” guns, opting for nudes instead of platitudes. For example, Hayato and Ui have a side alley escapade, with Hayato removing Ui’s panties, heating up the atmosphere both in and out of show. But similar to the other example, it feels out-of-place, with a touching exchange between Ui and her lackeys happening just prior. The anime takes this approach often – shifting between both extremes – leaving the audience, and subsequently the show, unsure of what it really wants to be.\\n\\n\r\nAt the minimum, the anime is not unsure about the amount of concealment when it comes to its material, providing uncommon and uncensored skits. Uncensored events are usually favored for being “true” in their presentation, but here especially it makes logical sense because the maturity of marriage somewhat demands it. After all, a man and a woman in the throes of love will most certainly show each other a bit of skin, even more so if that couple happen to be married to one another. So when a scene with passionate kissing, bodily sucking, or genital messaging does occur, it not only demonstrates the strength a marital bond holds but also fits within the themes of the show.\\n\\n\r\n“Amount” is the name of the game for Okusama ga Seitokaichou!, especially when it comes to its narrative, however that amount is low when execution is fully calculated.\\n\\n\r\nANIMATION\\n\\n\r\nThe anime takes place primarily at three locations: the school, Hayato’s apartment, and random outside locations. None of them are particularly noteworthy, mostly due to the lack of detail. Each does little more than act as a simple background in which the characters move, causing the show to gain nothing in terms of power. To compensate, the anime often transitions into a “chibi” or minimalist form to displace the attention away from the art and onto the characters currently being drawn in this comedic manner.\\n\\n\r\nThe character designs are as simple as the art, with characters more or less having a singular trait defining them. Hayato wears glasses to give him an air of intelligence, Ui has a sharp tooth to enhance her cuteness, and Rin has massive breasts that increase her overall sexuality. Misato, Ui’s mother, actually reveals a common thread: each design is the opposite of its respective characterization. For example, Hayato is not always the smartest when it comes to handling the situations he is thrust into, Ui is rather forward, Rin is on the disciplinary committee to thwart lewd behavior, and Misato’s short stature paints her as a child and not an adult. In this way, the character designs have a degree of cleverness that makes them, however slightly, better than the art they find themselves on.\\n\\n\r\nNot as clever is the actual animation, which is barely above passing at most points throughout the season. The “chibi” art is used once more to combat this fact since such a comedic style uses exaggerated movements, meaning less fluidity and more choppiness is permitted. The anime also leans on the use of head-only-cut-outs, for quick transitions and as a way to, once again, avoid extensive animation. It tends to pick up a bit during the steamier moments – tongue twirling, breast squeezing, and hip gyrating, to name a few – but since these instances constitute the minority, the majority of the time the characters refrain from moving too much.\\n\\n\r\nCHARACTERS\\n\\n\r\nOkusama ga Seitokaichou! does not have particularly complex characters, with it focusing mainly on the trio of Hayato, Ui, and Rin.\\n\\n\r\nHayato is arguably the best of the bunch, not due to his main lead status or his kindness but instead due to his more instinctual behavior. Hayato, being a male teenager, has spouts of horniness; when he gets into a situation that pushes his hormones to the brink, he sort of snaps, becoming a lion where he once was a cub. His lapses in rationality do not last terribly long, but they do last long enough for him to act out on his base desires. While a literal and natural part of life, this feature makes Hayato more human, more relatable – for men and for women – since such moments of “weakness” are something people experience in their own lives. Conspiracy theorists might argue that Hayato’s forced femininity correlates to a stance on same-sex marriage, but considering that his makeup, wig, and female underwear was more a comedy sketch than a political statement, the interpretation has little merit.\\n\\n\r\nWeakness of the first variety continues in Ui. Technically the star of the show, Ui is a young woman who does not have to search for “the one” since she has known who that was and who that would be for most of her life. Part of what makes Ui’s character similarly interesting is how, like Hayato, she does not follow standard tropes, at least in relation to anime. She is the aggressor and the instigator, the one who pushes the issue when she is alone with Hayato because she wants to make him know just how much she cares for and wants him. She is shy and nervous, as are most people performing sexual acts for the first time, but she always manages to overcome these feelings, creating intimacy and sensuality whenever she interacts with Hayato. Again, such actions are relatable because people in love want to express their emotions, with Ui’s palpable libido a natural extension of this type of expression.\\n\\n\r\nHayato and Ui’s relationship being as open and physical as it is aligns well with its overall marital vibe. Much like the story, where the uncensored material makes sense in the context of the anime’s goals, it likewise makes sense that a couple, primed to be together until death parts them, be as sexually active as they are. Yet Rin’s inclusion sort of throws a kink in the works, seemingly dampening the relationship the main duo share. As a character, she does not do much besides having a few sexy scenes and supporting Hayato’s misunderstood crossdressing hobby. Surprisingly, though, it is how her character affects the other two that gives her strength. For Hayato, he never actively pursues her, instead worrying about Ui’s well-being or wondering how best to protect her whenever Rin happens to be around. For Ui, Rin’s presence generates urgency and on some levels jealousy, spurring her to control and drive her connection with Hayato forward. Under this view, Rin is not an obstacle but rather a provider, pushing the other two into thinking about each other, thereby tightening the bond that they share.\\n\\n\r\nThe rest of the cast is largely forgettable: Ayane is a “cat” who understands the feelings of others the most, Karen is a violent lesbian, Mato is a girl who soils herself any time she accidentally falls over, and Ryouji, Ui’s father, is overprotective of his daughter. However they, too, exist to push Hayato and Ui closer together. Ayane and Karen make Ui realize the importance of communication, Mato forces Ui to think critically about why she loves Hayato, and Ryouji gives Hayato the opportunity to decide on what kind of relationship he wants to have with Ui. So while the side characters are hardly around, they at least manage to have some purpose within the anime.\\n\\n\r\nCollectively, the cast is clearly not complex. While everyone does not see much development whatsoever of their own, Hayato and Ui foster the foundation of their relationship, with the people surrounding them bolstering it as much as they can.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme has nice vocals, an upbeat tone, and a set of instruments that give it a light-rock feel. Combined together, they create a track that is appropriate for the anime. While not that catchy or long, it still does a nice job of getting the viewer ready for what the show has in store. The ending theme increases the speed, with its vocalist “stepping” between the syllables of the lyrics to form a simple yet fun track. However, like its OP counterpart, it is neither catchy nor memorable.\\n\\n\r\nThe remainder of the soundtrack is by no means vast, but it, like the OP and the ED, are pieces that fit the occasion as well as they can. A techno ensemble plays during mellow moments, a dainty piano for the silly times, and a gentle track is heard when Hayato and Ui are getting frisky. None of them are extravagant but they get the job done.\\n\\n\r\nVoice acting for the anime is somewhere around average. Ayana Taketatsu as Ui provides a cute and girly voice to improve her already established adorableness. Kazuyuki Okitsu as Hayato yells a lot but does not come off as annoying. And Tomoko Kaneda as Misato gives as childish a voice as she could muster. It is also worth noting that Ayana Taketatsu and Kazuyuki Okitsu did a reasonable job panting, grunting, and moaning during their sultry scenes.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis is a short show. So it is understandable that it does not do much of anything besides showing a nipple or two, providing a laugh every once in a while, and showcasing a cute girl here and there. Coincidentally, it does all three: the uncensored events were both thematically relevant and a sight for sore eyes (due to how much the medium loves to censor its material), the show’s brand of comedy was up my alley, and Ui and Rin definitely fit the “cute girl” definition. From the formatting of the jokes to the actual substance of the ideas, it being shorter worked mostly in its favor. If anything, the side cast is severely ignored; characters like Ayane and Kei – Rin’s older sister – are there but play only their absolute bare minimum roles. The problem, though, is that giving them more screen-time means less for Hayato and Ui to share which in turn leads to weaker themes, and giving them less screen-time means their characters are neglected even further. Simply put, it is a lose-lose situation of the anime’s own design.\\n\\n\r\nThe ending of the season also cuts off way too hard. It came off as wanting to tell more, almost as if there might already be a second season in production. This is not a huge gripe, but it was enough of a head-scratcher that I made a mental note of it.\\n\\n\r\nWhat I found most entertaining about the show was its ability to consistently progress beyond the previous episode’s limits. First it was naked apron wearing, then some hand holding, which quickly changed into tight bikinis, make-out sessions, and transparent lingerie. The anime also incorporated nether regions, with Hayato putting his face or his hands directly on Ui’s crotch, a large leap ahead of many “mainstream” anime. Consequently, the show managed to “go where most anime have never gone before,” adding an air of uniqueness to the total experience.\\n\\n\r\nIn the end, Okusama ga Seitokaichou! is an average anime. Its relatively nice cast picks up the slack of the less-than-stellar story it weaves, with the rest of its offerings – from its art to its music to its comedy – being little more than par for the course. Analogously, the anime is me when I was in the student council: mediocre at best.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, semi-harem antics hurt marital motif, flip-flopping from super-“ecchi” to super-“serious” is jarring, but the uncensored material fits thematically\\n\\n\r\nAnimation: Fine, boring art style, interesting character designs, just about average actual animation\\n\\n\r\nCharacters: Good, Hayato and Ui break tropes while maintaining a nice relationship, with the rest of the cast supporting their “marriage”\\n\\n\r\nSound: Fine, okay OP, okay ED, okay OST, about average VA performances\\n\\n\r\nEnjoyment: Fine, sexiness, laughs, and cuteness in handfuls, an untimely season cutoff, and steadily expanding lewdness\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-10-19T12:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 201583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=201583"
        },
        {
            "content": "Another day, another ecchi comedy, this one based on the manga by Yumi Nakata (oh?) & directed by Hiroyuki Furukawa (oh...) \r\nIt's not uncommon for odd couple romances in anime to employ some contrived means to quickly get our odd couple together before just as quickly forgetting about it. My Wife is the School Council President's (Okusama) devise is handily put in the shows title, just in case you were wondering how Ui & Hayato could possibly find themselves embarking down the road to romance that it's clear from the start they will be taking. As Vice-President of the Student Council, Hayato finds himself reluctantlyserving under the leadership of Ui, who won the presidential election on a platform promising to bring love to their school, which bans relationships between boys & girls. As if Hayato's day couldn't get any worse, that evening he finds Ui at his door, her stuff on her back & an email in her hand, announcing that they are to be married. What a setup!\\n\\n\r\nWell no, not really, because that would imply Okusama makes any use of its setup at all. Instead, we're treated to yet another by the numbers ecchi school rom com where the only thing that really distinguishes it from its peers is the one paragraph synopsis you read before watching it. There's nothing about the \"marriage\" between Hayato & Ui that couldn't just as easily have been explained away by, for instance, an administrative error by the school causing them to share a dorm room. In the end, all it's there for is to establish that Ui is Hayato's \"girl\" & the story, such as it is, will go through the usual list of love triangles, wife husbandry & \"innocent\" misunderstandings that every high school romance seems to have to go through, ecchi or not. \\n\\n\r\nIt's not often that I find myself thinking \"I wish they focused more on the story\" when it comes to ecchi comedies like this, but Okusama is an exception because, somewhere in there, there's a decent sounding little story that could be going on. Ui's goal of bringing love back to the school, facing off against the more prudish & busty (because that juxtaposition is funny. I SAID ITS FUNNY!)  Rin, head of the disciplinary committee could have led to an amusing clash of personalities as they battle for the morality of their classmates. Even when it's clear the main reason for Ui's enthusiasm is for the \"humorous\" contrast it creates with her complete cluelessness about what lovers actually do when she's with Hayato, it could have still told a decent, if less original story. \\n\\n\r\nIndeed, the framework for such a comedy is there, but it's so lazily put together that it undermines anything the show might be going for. The usual romance tropes are here: Ui having made a forgotten childhood promise; Rin having a personal reason to oppose Ui with the tenacity she does; a love triangle which serves to create misunderstandings between the three while also ultimately showing Hayato why he's better to stick with Ui; an assortment of other girl characters that get in compromising situations with Hayato to shake things up a bit - It's all there, all thrown in with little care & with little effort to set it up or to show how it impacted on the characters afterwards. \\n\\n\r\nEverything feels like it's just going through the motions, the minimal effort required to get us between contrived ecchi scenes where we're treated to the usual ecchi girl logic like \"Oh, my love rival gave you her panties? Well, it seems the logical thing to do would be for me to let you take mine off in this back alley!\" Nothing about Okusama has the goofy charm of 'Golden Boy,' nor the shamelessness of 'Haganai' or 'Highschool DxD.' It doesn't really even measure up to Yumi's previous adapted work 'Chu-Bra,' which was nothing special but at least made some effort to distinguish itself & actually run with its premise. & all this is before we get to the matter of how the show approached it's TV censorship.\\n\\n\r\nNow, it is possible to watch the episodes uncensored if you want to (& clearly a lot of people on Crunchyroll did), which renders this a somewhat moot point. None the less, it's worth mentioning because Okusama employed possibly the most obnoxious method I've yet encountered. While one comes to expect light lines & black bars in ecchi shows, at least until the BDs come out, Okusama opted instead to cut the scenes from the show entirely, replacing them with \"wife theatre\" a stick puppet show that looks like it was originally conceived as the preview skit after the end credits. The jokes aren't funny, aren't clever, go on ridiculously long &, perhaps worst of all, aren't really being used to censor anything particularly lewd or pornographic.\\n\\n\r\nIn the final episode, for instance, we're subjected to a two minute skit where the female cast fight JRPG style against footage of a kitten (taming the pussy hahaha!) which gives the impression that it's replacing a full H scene. Yet in the uncensored version it turns out to have simply being replacing a twenty second boob smother that includes, shock horror, a nipple slip. I haven't gone through every omitted scene to check, but I doubt I missed anything to merit it being removed entirely rather than simply blurred or blacked out. The art isn't bad, by any means. But really if that's what you're here for you might as well look for a compilation of the ecchi scenes to avoid an hour of \"plot\" getting in the way of what you're after. Quite why Furukawa went with this, I have no idea. Maybe it was supposed to give the illusion to the viewers that this show was dirtier than it turned out to be. The result, however, was to make the show even more of a chore to sit through that it already was.\\n\\n\r\nBut even without Wife Theatre, there's nothing to recommend about Okusama. It's not as lewd as it tried to imply. It's premise is wasted, it's story pedestrian & it's characters are dull. The only thing to say in its favour is that it's 8 minute episode length means you can watch the whole thing in under two hours, shrug you shoulders & move on.",
            "date": "2015-09-29T10:34:00+00:00",
            "helpful_count": 7,
            "mal_id": 200080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=200080"
        },
        {
            "content": "Okusama ga Seitokaichou! is a very simplistic ecchi anime with a very shallow plot.  To some this would be labeled \"simple ecchi done right\" while others would call it mediocre/crummy.  In my opinion, both are partially right.  The anime is nothing new for the ecchi genre and it really doesn't try to be.\r\nThe plot is basic: After being beaten out by a \"love liberation\" speech by female student council running opponent Ui Wakan, our male protagonist Hayato Izumi is forced into the vice president position while being fairly upset with the new president's school stance.  That evening the president comes tohis house and tells him she is his new wife, due to a drunken agreement made by their parents when the two of them were 3, and that she will now be living with him.  Realistic, right?  No, just a typical excuse to get the two players living in close proximity to each other.  Again, you either roll and enjoy the implausibility, or get critical on something that is OBVIOUSLY stupid from conception and ruin any chance of enjoyment.\\n\\n\r\nThere is also another player in this game in the form of a third romantic lead who grows to like the main male protagonist, causing tension between him and his so-called \"wife.\"  This girl is a polar-opposite and is against \"free love,\" but only because she was hurt in the past.  Again, all of this is in an attempt to float as many peoples' boats as possible (living together due to valid \"explanations\", \"sexual\" accidents with more than one girl, girls on both ends of the spectrum so you can pick sides, etc).\\n\\n\r\nDoes the anime do anything extremely well?  Not particularly, although for the first half of the show's episodes the opening credits had \"highlights\" of the last episode's plot which are helpful if you had forgotten.  So that was a nice touch.  The average episode length is also good (usually around 10-minutes) and makes the anime more palatable if you are bored and want to binge a series in a short few hours without risking enjoyment of it (due to binging).\\n\\n\r\nSexually, the show really doesn't shake it up at all (as far as the nudity).  There is basically a guaranteed breast shot ONCE each episode (all that's shaken up....is the way we get to it).  Personally, I found this tiring after the first few episodes and wished they had thought a little more outside the box (some episodes having more or less, depending on plot).  I think it would have really helped towards the second half.\\n\\n\r\nOn a more personal note, I also didn't particularly favor the very frequent \"free love\" mantra and it was really forced on the audience (and frankly, many episodes disprove what little message they were trying to get across).  Extremes really bug me, because they are both usually wrong/polarized sides of the presented argument.\\n\\n\r\nAre the characters unique?  No, not really.  \\n\r\nIs the plot gripping?  It's amusing and can be fun at times.\\n\r\nIs the animation or sound good?  Pretty average/standard fare.\\n\r\nEnjoyment?  Depends on who you are.  I don't feel like it was a total waste, but it's not a show I'd watch again.\\n\r\n(Oh, and the show's final episode had no closure whatsoever.  I'm totally banking on the fact it itself seems to want a second season.)\\n",
            "date": "2015-11-13T12:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 203285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4336091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Romantic19",
                "username": "Romantic19"
            },
            "url": "https://myanimelist.net/reviews.php?id=203285"
        },
        {
            "content": "To be honest I had very low expectation on this series. For #1, its a short. And for second, the premise or synopsis did not impressed me. Overall I did watched the first episode... oh my... Im very mad at the moment when I watched the show. Let's be straight on honest on this series. Note that this comes from a person who loves at least a pass the time series, short series such as Wakaba*Girl which is short but very cute slice of life and others. This show... well... let me just say it doesn't impress me. Note this is going to be ashort review. So keep that in mind. Also I ain't going to bash on those that likes the show, if you like this series, then thats fine by me.\\n\\n\r\nStory: ... Um... There's no type of story whatsoever pretty much in this series. Let's just say, that the series itself is just mindless fun. Just personally for me there's nothing much to talk about in this manner.\\n\\n\r\nCharacters: Well... they're below average lets be honest. They're just your 1 Dimensional Characters. Thats not technically a bad thing considering I've seen shows that had that but... theyre nothing special to my eyes. But they're not terrible cast. At least the MC has some bravery to do shit.\\n\\n\r\nArt/Animation: This is pretty much average too. Its nothing special yet its not terrible art as well. The reasons why are that the art and animation s very low budget and at the same time it sometimes suffers from the inconsistencies. It feels jarring and very eye soaring.\\n\\n\r\nMusic: Um... The music is quite eh... I don't know its pretty much mediocre at best to be honest. Pretty generic for a show, as for the VA... I can say they're pretty average. The reasons why some do fit, but some do not. For the sound... its terrible. Because my ears bleed like hearing a song from I dunno how to mention his name without getting in trouble.\\n\\n\r\nEnjoyment: I did enjoyed a bit but then after the first two or so episode this actually wore off.\\n\\n\r\nOverall: If you like a lot of mindless ecchi, and fun stuff at least, go and give it a try. If you want something with a story at least... or at the least a lot of redeeming qualities, this is not personally for you. \\n\\n\r\nI will lastly admit, yes, I somehow enjoyed a bit of its comedy and face expressions, but the rest overall... for me it was just a miss. But if you happen to enjoy this, have fun.",
            "date": "2015-09-17T18:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 198785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=198785"
        },
        {
            "content": "Your Wife is the Student Council President!...Ecchi Ensues...\r\nOkusama Seito Kaichou! is an unbashed ecchi harem anime short anime series where under wacky circumstances our main protagonist Hayato Izumi voiced by Kazuyuki Okitsu running for student council president gets shot-down by Ui Wakana voiced by Ayana Taketatsu, an ace of the school who conducts a reform of sex-ed and allows relationships in the school...later on well ecchi and harem ensues, though it focuses more on Ui and Hayato's secret relationship.\r\nFor an ecchi anime, it's either awkward or titillating or both merged with an ok relationship into the mix with it's elements of harem, ecchi and romancebut mainly of Ui and Hayato's secret ecchi relationship as well as Rin Misumi voiced by Minami Tsuda's love interest to Hayato forming the harem element as well as her rivalry of Ui's sex-ed reform since she's the Disciplinary Committee head.  \\n\\n\r\nThe awkward or titillating comes from the ecchi moments where it might as well be softcore hentai, it's uncensored but the furthest it ever goes is sexual moaning and bare boobs. Though the panty and suggestive shots is typical from the ecchi genre. Obviously if you have disdain towards fanservice this ecchi anime is gonna be awkward (though the sexual moaning in general is awkward to watch), but if you want short bursts of titillation then Okusama Seito Kaichou! for an anime short is an easy and quick pick.\\n\\n\r\nIn terms of characters, the majority of the anime is focused on Ui and Hayato rather sexual relationship, it's not a bad thing how LA let it goes, sure it maybe slightly fueled by sexual exploits that Hayato stumbles on and Hayato at times \"snaps\" and nearly goes all out at times, nonetheless as sexual their relationship is, Hayato and you the audience \"might\" see that this relationship is still stable and it's not just one-sided as Hayato and Ui expresses their feelings yes sexually, but it does make their relationship blossom even if Hayato has a pseudo-harem forming (realize that Hayato is \"married\" to Ui quite early...thus LA says \"pseudo-harem\"). Rin Misumi does get screentime but she applies the rival love interest and rival to Ui for the reforms, she isn't a wasted character as she kinda does her job as the rival/love interest for the most part.\\n\\n\r\nThe minor characters have a best one episodes to their name, such as Mato Sawatari voiced by Juri Nagatsuma as the \"secretary\" to Misumi and Ui's father Ryouji voiced by Yuu Kobayashi, the only two characters that gets more screentime goes to Ui's mother Misato voiced by Tomoko Kaneda and Misumi's older sister Kei voiced by Ryoko Shiraishi. The rest, like Karem Fujisaki voiced by Yoshie Sugiyama and Ayane Niikura voiced by Aoi Fujimoto, the other student council members hardly get developed at all.\\n\\n\r\nThe comedy revolves around Hayato being the straight man and nearly the entire cast being the \"tsukommi\" and yes because of this the comedy goes alot into \"misunderstandings\" but still due to how the animation makes it chibi and the exaggerated expressions kinda lands the comedic moments at times. \\n\\n\r\nIn terms of animation done by Studio Seven has two styles, typical ecchi and chibi. The typical ecchi is the obvious and with the more curvy and polished character designs from the female characters whilst giving Hayato a more normal yet comedic \"protagonist\" character design. The chibi style is only used for comedic situation though these two style clash alot of the time, maybe used to break the ice but nonetheless as separate styles they are ok, but NOT when the merge together from two differing scenes, though it being an ecchi comedy LA won't bash this aspect too much, it's kinda doing it job nonetheless. The animation is of average quality throughout though.\\n\\n\r\nThe voice acting, well LA will give Ayana Taketatsu this, she kinda got LA's favourite voice actor in Okusama Seito Kaichou!, just from her awkward nervous vocals to her moa- *ahem* comedic vocals are a broad range, Minami Tsuda has a pretty typical tsundere mode for the majority of the time and Ryoko Shiraishi voicing Kei is quite a welcoming surprise with her somewhat femme fatale vocals, though it's kinda typical for her what with her wide-ranged vocals. What can LA say but the vocal department in Okusama Seito Kaichou! is pretty decent and typical.\\n\\n\r\nOkusama Seito Kaichou! though it prides itself as a fanservice heavy show, there is a romance/harem element in there. The comedy is a nice relief from the fanservice though this element and the comedy coincide with one another alot of the time, it is an ecchi comedy. The characters though typically cliche they have a layer of sexual soft-puppy love relationship coated into it make what is a fanservice-heavy show into something with a bit of candy-coated to all the cheesecake. Okusama ga Seitokaichou! KNOWS what it is and laughs at the notion of being embarrassed (ironic since Ui does at *ahem* those times) and will cater to those who want something like this and what with it's length, it can easily be finished less than 2 hours. If there was a food LA could explain Okusama ga Seitokaichou! is like having ice cream cake for dinner, you know it has tons of sugar and it's quite BAD FOR YOU, but you just can't help but eat it because it's SOOOO TASTY and SWEET, just replace sugar with fanservice and you have Okusama ga Seitokaichou!. LA hate to admit it but LA wants another cake...\\n\\n\r\nIs anyone else getting hungry or is it just LA?...",
            "date": "2016-11-28T14:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 234551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=234551"
        },
        {
            "content": "First of all,this is very same type of ecchi anime as others,very basic but enjoyable plot,nice looking art without awkward animations,symphatic protagonist who doesnt seems like virgin when he sees some boobs, everything was great about this anime except the length,you cant enjoy good plot and atmosphere with this anime with just 8 min. lenght which is extremly short,i would recommend to authors at least 15-20minutes.\r\nBut,compared to other same genre ecchi,love,romance anime this one is slightly short also on plot,if you are heavy-minded on plot you can find this anime somehow unsatisfying for you,but for average ecchi audience i think this one will do hiswork.\\n\\n\r\nIf you enjoyed anime like for example : To Love Ru,Rosario to Vampire etc, you will also love this one,just without supernatural things and aliens.\\n\\n\r\n8/10 I highly recommend this short-length but great anime :)",
            "date": "2016-11-21T08:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 234136,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5852554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuBoySlovakia",
                "username": "OtakuBoySlovakia"
            },
            "url": "https://myanimelist.net/reviews.php?id=234136"
        },
        {
            "content": "Not all anime needs to be a masterwork of storytelling. Some shows just aim to be entertaining, and most often when a show understands what it is and doesn't try to be more is when a show enters a league of its own. Okusama no Seitokaichou is a rapid-fire romcom ecchi-bordering-softcore-porn, and it succeeds at being what it is.\r\nThe setup of Seitokaichou is as simple as the synopsis presents, with a little more - guy loses to girl in election, girl moves into his apartment on the premise of a childhood promise to be his wife, sexy hilarity ensues. That's it - and that's allit has to be. It doesn't try to pull a lot of drama, or pull comedy from silly plot elements like its harem comedy counterparts, no nonsense. Here's a setup, here's the joke. \\n\\n\r\nAnd boy, what jokes it does get. It appeals to crude humor but in such a way that is rather funny, if only for the *massive* degree to which it takes the lewdness. Crass? Yes. Vulgar? Undoubtedly. But it made me laugh, whereas the generic tsundere-abusing-MC \"comedies\"of other shows didn't, so Okusama is obviously doing SOMETHING right. \\n\\n\r\nFor as little screentime as characters get in an 8-minute anime, the characters of Okusama are charming, bearing a lot of artifacts from their origin as 4-koma manga characters both in design and in execution. Combined with respectable animation quality and great performances by the voice cast, there are no real complaints on that front. Like the story, the characters exist to do what they need to do, with no illusion of being deep, dramatic fonts of insight. \\n\\n\r\nOkusama ga Seitokaichou is a show that knows what it is, and doesn't try to be anything more. The jokes bring out a laugh, the ecchi is, well, ecchi, and overall it's very high in the enjoyment:time ratio category. It's a fun show - and really, that's all it needs to be.",
            "date": "2015-09-27T20:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 199926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3617255.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xthorgoldx",
                "username": "xthorgoldx"
            },
            "url": "https://myanimelist.net/reviews.php?id=199926"
        },
        {
            "content": "This anime is very much like the manga, if you have read the manga like I have then you know what to expect. It's very simple when it comes to the story, with the usual blue balls fan service, but it's still a very enjoyable anime series. A lot of people won't like this anime because they have not read the manga, or they just don't like boobs and borderline hentai Anime/Manga. The animation is amazing, actually it's very well done for this type of anime, however I wish it had longer episodes but 8 minutes is reasonable due to manga not having many chaptersas IT HAS NOT BEEN UPDATED IN A LONG TIME (SOMEONE GET YOUR LAZY ASS BACK INTO RELEASING THE NEXT CHAPTERS)\\n\\n\\n\\n\r\nNow if you will excuse me as I continue to wait for the next chapter of Okusama ga Seitokaichou",
            "date": "2016-03-30T03:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 214774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474161.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/suigintou101",
                "username": "suigintou101"
            },
            "url": "https://myanimelist.net/reviews.php?id=214774"
        },
        {
            "content": "Right, let's get the synopsis out of the way, shall we? It's actually quite simple: the male lead, Izumi Hayato is running for class president, but gets beaten by Wakana Ui, who promises free love on the school grounds, and less harshness when dealing with dating. Somewhat gutted, he still stays vice-president but that evening discovers that the president (now revealed as the female lead), was actually arranged to marry him, and so she decides to move in with him as his wife. The stage is set, the lights lit, let the show begin!\r\n     And that'sbasically it: it's a form of slice of life focusing mostly on the relationship the two characters have (with a very slight love triangle after a bit). Oh sure, there is some ecchi (that'll be most enjoyed in the uncensored version), but it's nothing TOO hardcore, in fact it's almost cute. You have two leads, both sixteen-ish living together and actually attracted to each other, so of course ther are going to be some moments that will make ecchi haters cringe, but they don't spoil the actual plot in any way. So there's no \"accidental\" groping, slipping to land in someone's boobs, it's all planned out.\\n\\n\r\n     There are also a couple funny scenes in this, some fun situations, and you can really get the character's feelings. Overall, nothing cringingly bad really ^^\\n\\n\r\n     Anyway, I'm giving this an 8, because I quite enjoyed it and it reminded me of a couple things I went through ages ago. Either way, if you're into this, I'm sure you'll quite enjoy it. And remember, season 2 is coming out in October ^^\\n\\n\r\nNow excuse me while I check out the manga this was adapted from.\\n",
            "date": "2016-08-30T08:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 227942,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4986320.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wereprophet71",
                "username": "wereprophet71"
            },
            "url": "https://myanimelist.net/reviews.php?id=227942"
        },
        {
            "content": "this is good anime , WOOOO i Love it\r\nI have watched all the episodes of this anime and I highly recommend it for people in the world\r\nin terms of the story of this anime is good, especially the ecchi scene in it that makes me addicted\r\nI can't say anything for this 8-minute anime which is really good\r\nthis is the number 1 ecchi anime that runs the story and the ecchemical scene is satisfying\r\nThis anime is the right place for oppai lovers to overlay the hobby (don't forget to prepare tissue :v)  \r\nI hope this anime has a movie version",
            "date": "2019-01-18T02:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 299340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7709692.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/egi23",
                "username": "egi23"
            },
            "url": "https://myanimelist.net/reviews.php?id=299340"
        },
        {
            "content": "I try to avoid Slice of life and especially Harem shows as much as I can because they just do not fit my taste in entertainment. Nonetheless I´ve seen two Slife of life/Ecchi series which I genuinely liked.\r\nThe reason I enjoyed those two,being their sheer offensiveness. Two Anime, who went that one step beyond the boring  panty shots and accidental tit gropes, to tell their story. They also didn´t involve any annoying bickering many main couples within harem or romance Anime go through. I watched Okusama ga Seitokaichou, expecting an exxagerated offensive comedy  similar to the likes of  Shimoneta or Prison School,but I was wrong. Those shows suceeded in surprising me with their ridiculous premises and their over the top plottwists, to the point where I bursted out in laughter because of sheer surprise.\\n\\n\r\nOkusama ga Seitokaichou on the other hand, turned out to be a fairly generic  comedy echi harem, with all it´typical character archetypes and boring plot you´ll  come to expect when watching a show of that kind. I won´t spoil anything, but if you think you´ve seen the shows  characters before. It´s because you have.\\n\r\nBut, the show has two saving graces compared to it´s peers. It´s  short run of 8 minutes per episode and  it´s lack of consistent cockblocking, that similar shows are infamous for. There are no annoying parents or siblings, storming the doors, or obnoxious sidecharacters jumping into the picture, to ruin the fun for everyone when its \"heros\" are exploring their bodies.\\n\r\nIf you want to watch borderline hentai this show perfectly delivers.\\n\\n\r\nNo strategical placed hair, that covers nipples, asshole lights or conveniently placed objects and limbs to obstruct the view here.\\n\r\nYou get to see everything from the bellybuton upwards  and when a hand happens to slide down a crotch or on top of a booby it happens out of free will and not because of banana peel or slippery stairs.\\n\\n\r\nWhich conveys more the feeling of a terrible teen Movie like American Pie, rather than a terrible harem Anime, that keeps cockteasting it´s audience with what they actually wanna see. I gave this show a 7. While it´s certainly not for me I can see audiences really enjoying that show.  That audience  being a horde of adolencent teenagers that have no acces to actual porn, or are too shy to watch it.",
            "date": "2016-05-12T10:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 218434,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231465.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Isterio",
                "username": "Isterio"
            },
            "url": "https://myanimelist.net/reviews.php?id=218434"
        }
    ],
    [
        {
            "content": "Okusama ga Seitokaichou is a perfect example of how to do simplistic ecchi correctly. It doesn't have any form of serious storyline, no cheesy drama, no annoying teasing at romance that never actually goes anywhere. It's just pure intimacy in both love and lust; more of an actual representation of what teenage couples do to each other in real life. And quite frankly it's a breath of fresh air, because it gives you exactly what you're looking for as a viewer and nothing more.\r\nThe story (if you can call it that) is extremely straightforward. We have student council president Ui who one day announces thatbecause of an alcohol-influenced agreement between their parents, she is to become the fiancé of the vice president and protagonist Hayato. Thus they start cohabitating together, and they quickly get very intimate with each other. Queue lots and lots of lewdness. Uncensored lewdness (even during the TV-airing, on AT-X). It doesn't quite reach the level of ecchi legends like Kiss x Sis for example, but it's still pretty damn hot. Many boners have been had. But it's more than just that, because honestly their relationship feels a hell of a lot more natural than most couplings you see in anime.\\n\\n\r\nThe only real problem I have with this anime is that despite everything, it is a quite poor adaptation. For one, the characters are way less moe than in the manga. Especially Ui herself is nowhere near as loli as in the original, and I also find her voice actress choice rather questionable. More importantly however, Okusama ga Seitokaichou is ruined quite a bit by the fact that it for whatever reason only has 8-minute episodes. I don't really know why it couldn't get a normal-length TV-airing given that the manga has like 8 volumes' worth of content already, but what's done is done. Of course what little content the anime actually does cover is still very good, but it kind of feels like the story is over before it's even began this way.\\n\\n\r\nThat being said though, in the end what you have is an anime which feels incredibly natural as far as character relationships go, much more so than most series. The ecchi scenes never feel forced or out of place, they go beyond mere teasing and they actually give you what you want to see as a viewer. It's almost sad just how rare that is to see in anime.\\n\\n\r\nOh, and make absolutely sure to watch the uncensored version if/when you pick this anime up. There is absolutely no reason whatsoever to watch it otherwise. And once you've done that, I'd recommend you to try out the manga as well, because it's so much better still.",
            "date": "2015-09-17T11:53:00+00:00",
            "helpful_count": 170,
            "mal_id": 198756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=198756"
        },
        {
            "content": "When the \"plot\" is more important than the plot, you know you're dealing with a second-rate show. Okusama ga Seitokaichou! isn't the type of title that requires any sort of in-depth analysis to explain, it's pure fanservice in animated form. With that being said, this review will be brief. \r\nThe 1st episode of Okusama is perhaps the biggest troll of the 2015 summer season. It caught many by surprise and rightfully so, as it seemed to have devised a way to get past Japan's impenetrable censorship law, leaving its rival ecchi titles in the dust. While most shows were caught up in the red tapeof censorship, Okusama was delivering the 'goods' with no filter whatsoever. This prompted many viewers to loosen their belts for what was expected to be a \"plot\"-driven ecchi title that wasn't afraid of going the extra mile to please the audience. But just as quickly as it garnered attention, it seemed that it couldn't maintain it, as the following episodes showed that the initial climax was well behind us. Lack of censorship, the only benefit Okusama had going for it, was quickly stripped away, bringing with it a tidal wave of flaccid onlookers. And as the buzz dissipated into a soft murmur, Okusama fell in line as yet another xerox copy of the same ole shit that has come before it and will continue to be produced long after its 15-minutes of fame was up. \\n\\n\r\nLike most ecchi comedy series, the story of Okusama is basically the same setup seen countless of times before. A guy is forced into some odd relationship with a girl under circumstances that he has no control over, lots of sexual comedic mishaps happen, yadda yadda yadda, you know the drill. It's the tired trite that makes up a majority of the shows within this genre. The only purpose of the narrative is to compress as many titillating encounters as it possibly can in the limited time-span given.  \\n\\n\r\nThe cast, as to be expected, is composed of one guy and a plethora of girls. The only girl of relevance, Ui Wakana, serves as the main love interest and also the source of grief for our protagonist. The rest of the female cast can simply be defined by a personality quirk and their breast size.\\n\\n\r\nPossibly the only saving grace for this title is its protagonist Hayato Izumi, as he's among the very few ecchi leads that aren't afraid to take action if his hormones boil over. Of course, he pussies out like any other beta-male, but he still does a lot more than other counterparts delegated to his role. But even with that being said, don't hold your breath, as the TV release was still censored to all hell, with raunchy scenes being swapped out for what I can only describe as collage screenplays (sometimes live-action), leaving the audience to only imply what might be going on. It's more frustrating than funny since it defeats the purpose of it being an ecchi. Watching censored ecchi is like watching an action movie with all the action scenes being blacked out. It's utterly pointless, and really, that's Okusama in a nutshell, utterly pointless. \\n\\n\r\nOverall: 2/10 \\n\\n\r\nIf you just want some fanservice or enjoy being cock-teased, then look no further, as Okusama seem to be dead set on doing just that and nothing more. But honestly, with ecchi shows like Prison School, Highschool DxD and Queen's Blade around, it's hard to even recommend this show even on such simple merits. In this day and age, Okusama is already antiquated.",
            "date": "2015-09-17T16:39:00+00:00",
            "helpful_count": 118,
            "mal_id": 198777,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=198777"
        },
        {
            "content": "In recent years, the concept of what is allowed in anime in terms of any kind of lewd media has slowly been changed.  It's to the point that the shackles have completely been broken and focusing on which girl has the biggest breasts or who can scream the most lewd has become top priority.  And so we have Okusama ga Seitokaichou, or My wife is the student council president, a show that tests this idea, but not as intensely as one may think.\r\nStory: Okusama (as I will be calling this show) starts off with our main protagonist Izumi Hayato, a boy who triesto get the student council president spot in order to lead the school into a new era.  That is...until his rival, Wakana Ui crashes the party and wins the election by a landslide by promoting a \"healthy relationship policy\", forcing our main protagonist to become the vice president of the school rather than the coveted student council president.  Even more to beat a dead horse, he finds out that this same girl is also his fiancee as organized by their fathers in a drunk meeting when they were just kids.  And well, that's...really our story.  \\n\\n\r\nAs a television short, Okusama has a very short runtime and doesn't really give much in terms of content for the show.  For the most part during its seven minute runtime, the show gives a quick overview of a given chapter in the manga, with most of its time centered heavily around the more risque areas of the chapters.  For the most part, any given episode is a general gist of the setting or period of time that's happening, usually with Hayato thinking \"No, I'm not doing anything with this girl\", and then proceeds to do stuff with said girl, usually resulting in breast suckling, inappropriate touching, and lewd screams.  There really isn't much to say for the show in terms of progression because the characters for the most part stay the same the whole way through and the only real development is time passing with every new episode.  \\n\\n\r\nOne of my biggest complaints about this show is simply the fact that it is a television short.  A lot of the story and characters could've become more fleshed out if they were given a proper 30 minute timeframe rather than a tiny seven minute one.  In the end, this short didn't really serve to do much more than create sexual tension between an adolescent boy and girl, and there really is already enough of that in the world of anime as is.  There wasn't really any variation because it was all ecchi, and ecchi doesn't always make a good show.  Plus, the ending was quite lackluster since it just...stops at a random chapter in the manga.  \\n\\n\r\nOverview:\\n\r\n+/-  Very ecchi centered (if you're not into that, then you won't like it)\\n\r\n-  Entire show is basically all ecchi\\n\r\n-  Not much variation from one episode to another\\n\\n\r\nCharacters: Characters in Okusama are a bit of a definite distinction.  There's Ui, there's Hayato, and then...there's everyone else.\\n\\n\r\nLet's start with Wakana Ui, our main female protagonist.  Ui is a doubled sided coin.  On one hand, she is the dominant president at school who will do everything in her power to enforce her \"healthy relationship\" policy, and on the other, she's a little kid who begs her \"husband\" to do everything for her.  Her personality is mostly focused on the idea that she is a girl who accepts the engagement and wishes to be a good wife to the main she is \"married\" to.  As her persisting trait, she attempts to get Hayato to love her back the same way which creates the most prominent gag in the anime, which proceeds to create some very dangerous situations.  (I will get back to that later.)  Apart from her innate traits, she is very one-sided, not broadcasting any form of character development or anything of the sort, so don't expect anything like that.  (This is just a seven minute short after all.)\\n\\n\r\nAnd then there's Izumi Hayato, the male protagonist.  Unlike Ui, Hayato is very resentful to the idea of the marriage the two of them share, as he doesn't like the idea of having Ui as his wife and is very much against the idea of this girl just coming into his life and proclaiming that she is married to him.  That is, until the male hormones kick in, then things get interesting.  Unlike a lot of other male protagonists that share a similar situation, Hayato does have a \"breaking point\".  Most male characters that have a temptress flaunt their goods at them tend to just shy away or even run from the situation entirely.  Hayato isn't like that.  Instead, he will dive straight into those boobies and suck out whatever they're good for.  While it is honestly quite refreshing to see this trait, it also serves as the show's downfall.  As a direct result, it creates these low brow ecchi moments that really don't serve much purpose aside from cheap and overused fanservice.  Does a justice, but hits the series hard at the same time.\\n\\n\r\nAside from those two, the other characters in the series include Misumi, the disciplinary head with the cow tits, her loli boobrest Sawatari, other members of the student council, and Ui's parents.  All of them are presented as one note characters, with each getting about ten or so minutes of screentime maximum since their purpose in the series is to become a plot device that only either drives the story along, or serves to create more ecchi moments.  Cause lord knows we can't have enough of those.  :p  Really though, they're only plot devices in this anime, so they're not worth talking about too much.  \\n\\n\r\nOverview:\\n\r\n+ Different character trait for an Ecchi Protag\\n\r\n-  All of the characters are very one sided\\n\r\n-  Side characters are simply plot devices above all else\\n\\n\r\nArt: The art for Okusama is very standard for this day and age.  It has a very light color scheme so everything shimmers off to the point that everything kind of looks like Key's Clannad (right down to the eye designs, kind of) and it all looks rather bland to be honest.  Everything is kind of a beige color and there really isn't much color pop for the series to be proud about.  \\n\\n\r\nAnd since this is an ecchi show, talking about the ecchi's art in this show is a must.  Since the entire show save for maybe three minutes in a given episode is ecchi to some degree, the show surprisingly enough, shows uncensored footage for its release.  (Odd for a TV short.)  Meaning when you watch this show anywhere, you'll be getting every bit of breast they show, and every sexy moment that they squeeze into a seven minute time frame.  Is it done tastefully?  Not exactly, but it's not entirely cringeworthy to watch.  It does get tired after a while though.\\n\\n\r\nOverview:\\n\r\n+ Uncensored release\\n\r\n+/-  Average art style\\n\r\n-  Bland color scheme\\n\r\n-  Ecchi gets boring after seeing it so many times\\n\\n\r\nSound:  The soundtrack for Okusama is just basically its opening and its ending.  The opening is the more memorable of the two for being catchy to a degree, but neither song really has much impact on the show as a whole.  \\n\\n\r\nPersonal Enjoyment: As someone who has read the Okusama manga, this adaptation was honestly subpar at best.  Looking at the anime at face value, there really isn't much to say about it.  It's an anime about a girl and a guy who end up getting into some pretty risque situations before ending the episode and wait till next week where we'll see them tease each other in a different place.  There really wasn't much variation from one episode to the next and in terms of basing it from the actual manga itself, was hardly really there save for the story progression and the base character personalities.\\n\\n\r\nDid I like this anime?\\n\\n\r\nI liked it to a degree.  Since I like the Okusama manga, I was tolerable towards this adaptation because I knew what was going to happen and I have a good feel for the character in this series.  Aside from that though, not much else.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nI didn't like the fact that the show just focused solely on the ecchi while not entirely focusing on any sort of story elements that occurred within the chapters they decided to animate.  Aside from that however, a few important characters, Misumi for example, didn't really play as big of a part as she should've which left a bit of a bad taste in my mouth.  No one was fleshed out and it felt a lot more generic than it really should've been.  Plus, the ecchi is very distracting.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you're a fan of ecchi, then you will like this because it's all ecchi.  If you don't like ecchi, then skip it.  It's a seven minute series that runs for 12 episodes, so it doesn't take that long to run through it, but if you're not fond of seeing fanservice to a high degree, I would very much recommend skipping this.",
            "date": "2015-09-17T17:04:00+00:00",
            "helpful_count": 33,
            "mal_id": 198780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=198780"
        },
        {
            "content": "My Okusama ga Seitokaichou! review. OPPAI\r\nMy ratings:\r\nStory: Pathetic 1.\r\nArt: Good 7.\r\nSound: Fair 6.\r\nCharacter: Poor 3.\r\nEnjoyment: Good 7.\r\nOverall: Pathetic 1.\r\nFor an 8 minute and 12 episode anime, this was really not a good one, so no more BS. Story (up), the plot was as basic as it can be, it just involves a girl moving into the guy's life and thing were never the same....you might say that there really isn't a story at all, so it was really as pathetic as it can be. Art (up) tbh the rating I gave was for the fanservice since it was the only thing that makes this animefun to watch. Sound (up) well I simply have nothing much to say about the sound except that I do find the opening and closing theme befitting in this anime. Character (up) what can I say, this anime is just all about Ui Wakana and Hayato Izumi, whom I always wish that they just start banging on each other and not just limit it to foreplay, thought I also like Rin Misumi I jaz basically see her as a 5th wheel. Enjoyment (up) basically it's the fanservice and the titillating scene that were the enjoyable part of this anime, everything else are just BS cu'z it was just all foreplay and no actual banging, overall (up) it was really too pathetic even in it's manga form, frankly they should have went hentai with this thing, so that those whom would wanna play with there joy stick can do it in the comfort of their lonesome.\\n\\n\r\nOppai!",
            "date": "2015-09-20T21:31:00+00:00",
            "helpful_count": 25,
            "mal_id": 199109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=199109"
        },
        {
            "content": "Eroticism brings out the carnivorous beast inside of us all, even if we are not aware of its existence. At least with those people who are not repressed to their sexual drives by the time they reach that age group where it truly shines. Anime has been having no shortage of shows that try to tap into these drives in recent seasons. To which I will go against the majority by saying: There is nothing wrong with that. Especially whenever they are just as fun, sexy, and hilarious as Okusama ga Seitokaichou!\r\nA fair comparison to be made about Okusama would be Kiss x Sis. Notnecessarily just because the main girl, Ui Wakana, is voiced by the same Seiyuu, Ayana Taketatsu, who voiced Ako Suminoe in Kiss x Sis, but because of how both anime use fanservice to create a nice, playful atmosphere. As a comedy anime that has the running time of under 8 minutes, this style of fanservice that is there to stimulate and entertain people fits perfectly with the short duration. If this were an anime that was your standard 24 minutes including OP and ED, I don't think the fanservice would've held on for so long. Or worst, it could've tried to take a serious turn to its story like most bad ecchi anime.\\n\\n\r\nKiss x Sis gets away with a 24 minute running time because of the amount of charm all of the characters possess, while Okusama, unfortunately, only has the charm of our two main protagonists. The main male lead, Hayato Izumi, and the aforementioned Ui Wakana both supply a solid connection that was built up to a silly concept of getting married together out of spite from both of their parents. Ui's brand of perverted antics is both subtle and humorous when she tries to bed with Hayato that really takes it up a notch from Ayana Taketatsu's great performance of her. Of course, when those sexy scenes between them occur, they are nothing short of magical, despite how short they are.\\n\\n\r\nThat is where the character praises take a back seat for the supporting cast. Although I do think Ui's mother is just as entertaining as her daughter, the rest do not leave much of an impression due to their short presence. Whatever good that can be found to their character, they are overshadowed by our main protagonists fairly quickly. Ui and Hayato even have moments of hilarity by themselves from their delightful charisma. Ui stalking the other girl who has affections was gut-bustlingly hilarious to see and her throwing condoms to show a sex-positive message to her students added a nice touch of nuance commentary and absurdity to Okumasa.\\n\\n\r\nAs far as short anime shows go, Okusama takes advantage of its duration and makes something that is suitable to take in. Kind of like a fast food restaurant, the quality of the food is suitable for the cost and time that it take for it to be created for consumption. Sometimes if a short anime does too much for its running time, it will appear all over the place as a result. Okusama is a solid watch to experience the character interactions being for what they are inside, lewd carnivorous beasts.\\n\\n\r\nGrade: B\\n",
            "date": "2015-09-25T23:21:00+00:00",
            "helpful_count": 10,
            "mal_id": 199621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=199621"
        },
        {
            "content": "If you're just watching it for the uncensored version, then you're fine. But for the rest of us, even if this was just a mini series, it doesn't really offer anything new. There's really nothing much to say.\r\nStory: There's not much really to talk about this show because it's a short series, and nothing much at all happens. It's about a pair of couples who promised to marry their children to each other, basically. And now Izumi has to live with and is apparently married to Wakana Ui, the student council president at their school.\r\nArt: It's consistent throughout the series. If you're watching the uncensoredversion it's the better of the two since you're not hindered with annoying censorship. The coloring and the animation is alright, serviceable at best.\\n\\n\r\nCharacter: This is show's weakest points. Izumi Hayato is every reluctant brown hair male protagonist archetype. It's no excuse that I say there's nothing much to say, because there's nothing much to say. Everyone is pretty derivative, and don't pull that fanboy shit on me defending it. Wakana has no range as the heroine, unless you're counting the teases. But that's not at all character. The rest of the cast such as the disciplinary committee and Wakana's parents are simply rushed in and rushed out. They're just there.\\n\\n\r\nEnjoyment: Characters are average, simply making the ecchi average or worse. It's no enjoyment if the characters themselves aren't anything special to boot.\\n\\n\r\nOverall: There's nothing to say, really, I really do mean that. It's not the worse thing I've ever seen, which if it were, I could criticize this show much further and elaborate my points. But this is just Ayy lmao.",
            "date": "2015-09-17T14:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 198768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/715239.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/StigmataSasha",
                "username": "StigmataSasha"
            },
            "url": "https://myanimelist.net/reviews.php?id=198768"
        },
        {
            "content": "I have to say that this series was one of the pleasant surprises this season. I went into it expecting it to be a run-of-the-mill ecchi, but ended up finding a funny series with the right mix between comedy and erotic content. Both of these were done pretty tastefully.\r\nThe premise of the show is that the the parents of the two main characters, Ui and Hayato, agreed that they would marry when they were of an appropriate age. So when Ui shows up at her highs chool classmate's house and springs the news that now she was going to live with him, she turns Hayato'sworld upside down.\\n\\n\r\nThe characters are well developed and even though the episodes last only 8 minutes, they managed to make me care for what happened to them and their relationship. The art is very nice, but in order to appreciate this show you need to watch the uncensored version (I also checked out a few of the censored episodes and the quality decreases considerably by missing key scenes).",
            "date": "2015-09-17T16:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 198778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586338.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sebaf74",
                "username": "sebaf74"
            },
            "url": "https://myanimelist.net/reviews.php?id=198778"
        },
        {
            "content": "If you came for boobs, you came to the right place.\r\nWelcome to Okusama ga Seitokaichou, where the objective is to titillate (I respect this anime enough to hand-type the title).\r\nIs there a story? The story goes as far as setting up compromising situations for our lead and the members of his harem. Mission accomplished. (I mean really, can you take an anime with the title \"My Wife is the Student Council President\" seriously?)\r\nArt? Graphic enough to titillate. Mission accomplished.\r\nSound? Acceptable enough not to get in the way of the titillation. Mission accomplished\r\nCharacters? Juuust good enough to make you not face-palm at how cliche they are,allowing you to instead use your palm for something else, amirite? Mission accomplished.\\n\\n\r\nEnjoyment? The episodes are 8 minutes long. Depending on how long you last, this is either the most frustrating thing ever or a perfect fit hehe xd\\n\\n\r\nIf I had to rate this anime for my friends and family, I'd give it a 1 or 2. But for you guys, who I KNOW are thinking of watching this anime the exact same reasons as me, I give it a solid 7.\\n\\n",
            "date": "2016-11-21T13:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 234152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zeralul",
                "username": "zeralul"
            },
            "url": "https://myanimelist.net/reviews.php?id=234152"
        },
        {
            "content": "Can we take a moment to note that there was an absurd amount of sex comedies this season. Between Shimoneta, Monster Musume, Prison High School, To Love Ru Darkness 2nd and now Okusama ga Seitokaichou! It seems like every possible niche was explored to some complicity. But what separates Okusama from the rest of the list is in it's simplified length and even more simplified plot. \r\nOkusama is your typical fair for the genre. The female character is the aggressor in the 'relationship' though she isn't nearly as bad as I am making her out to be. And I say 'relationship' whereas the only reasonthey are together is because the female lead, Ui Wakana moved into the male leads apartment because their parents set them up for marriage when they were children. Something apparently only Ui remembers. \\n\\n\r\nWhile it sounds like I am harping on this show in a negative light I found it pretty hard to find anything actually 'wrong' with the series. It's short length cuts out the filler and goes straight to whatever the issue is that episode. Whether it be a miscommunication or a fellow student living next door. Things you expect almost to a fault. But the energy of the series is fast pace and the characters at least enjoyable in 8 minute bursts. What really helped it along was the clean look of the art which complimented the rather brisk length.\\n\\n\r\nI should probably mention I watched the uncensored broadcast via Crunchyroll. There isn't much to say on the topic. Every couple of episodes would get as close to soft core porn as it could before something prevented the couple from going further. \\n\\n\r\nWhile I didn't fall in love with this anime there wasn't anything to get upset about. It was mediocre but not unwatchable. Some of the subplots were entertaining but due it their short length none of them had a conclusion. The opening and closing songs were forgettable. And yet I would be remissed to give it a bad score. To coin the late great Douglas Adams it was 'Mostly Harmless'. \\n\\n",
            "date": "2015-09-18T23:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 198860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4883381.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/The_Boogiepope",
                "username": "The_Boogiepope"
            },
            "url": "https://myanimelist.net/reviews.php?id=198860"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI remember having a position in my high school’s student council. By student council, I mean a shoddily put together group of kids that mostly used the affiliation for their college applications rather than as a means to “make change.” Of course, we did take part in acts of kindness – I distinctly remember creating gift baskets for the bus drivers and dealing with the tabulation of numbers on a spreadsheet. The sad revelation is that, outside of those two moments, I did not do much within the student council. I was not the president, thevice president, or even a member with an official title. I was simply one more body to be called on when a specific occasion popped up, with nothing but the extra graduation chord around my neck signifying the impact I had while a part of that club. Needless to say, then, marriage was not on the menu during my brief stay within the student council, but the same cannot be said for Okusama ga Seitokaichou!, an anime related to matrimony, important meetings, and a smattering of breasts now and again.\\n\\n\r\nSTORY\\n\\n\r\nOkusama ga Seitokaichou!’s narrative can be summarized as one word: amount.\\n\\n\r\nThe heftiest amount of emphasis the anime has is on the concept of marriage. Traditionally, marrying another individual involves devoting one’s body, mind, and soul completely. Polygamy exists – where one marries many – but the majority of people think of the one-to-one bond as opposed to the multiplicative one. In other words, the amount of times someone marries – excluding divorces and death – is once.\\n\\n\r\nInterestingly, despite the anime’s focus, it blurs the line between singular and some. While not technically listed as a harem, the anime goes out of its way to place attention on a handful of women, giving the audience a plethora of girls to root for or fancy. Granted, the only other true contender besides Ui is Rin, but even then it goes against its own tenets.\\n\\n\r\nThe show is titled, “My Wife is the Student Council President.” Not “My Wives Include the Student Council President” or “One Wife of Mine is the Enemy of the Student Council,” signifying the importance of the relationship between the male and female leads. So it is strange to see the anime trying to force the supposed husband onto other women; the “tsundere” specifically has erotic scenarios, with one instance having her and Hayato in a love hotel and another with him groping her butt. Again, for the sake of argument, Hayato does not seek these situations purposefully – the former was the result of bad weather while the latter was a classic misunderstanding. But that still does not detract from the notion that the show intermittently reduced its attention on its marriage aspect in favor of contextual cheating.\\n\\n\r\nReduction can also be seen in the amount of minutes available. At approximately eight minutes per episode, the show is constantly pressed for time, leading to two types of thought. The first requires the anime, due to so little time, to do more per episode than a normal, twenty-four minute one. The anime literally has no time to prolong conflict, forcing it to cram in as much as it can in order to leave an impression and to push its narrative and its characters in a worthwhile direction. The second requires nothing of the anime since it is understood that less time means less to offer. It might be slightly unfair to expect the show to do much of anything with the minimal amount of resources it has.\\n\\n\r\nIn Okusama ga Seitokaichou!’s case, it combines both routes, resulting in even further reduction. At times, the anime goes meaningful, trying to instill some value in the tale it was telling. This most notably happens near the end, where Hayato recollects his past, causing him to care deeper for Ui than he had previously. But it feels awkward following a pair of boobs being (literally) shoved in the viewer’s face. Other times, the anime sticks to its “ecchi” guns, opting for nudes instead of platitudes. For example, Hayato and Ui have a side alley escapade, with Hayato removing Ui’s panties, heating up the atmosphere both in and out of show. But similar to the other example, it feels out-of-place, with a touching exchange between Ui and her lackeys happening just prior. The anime takes this approach often – shifting between both extremes – leaving the audience, and subsequently the show, unsure of what it really wants to be.\\n\\n\r\nAt the minimum, the anime is not unsure about the amount of concealment when it comes to its material, providing uncommon and uncensored skits. Uncensored events are usually favored for being “true” in their presentation, but here especially it makes logical sense because the maturity of marriage somewhat demands it. After all, a man and a woman in the throes of love will most certainly show each other a bit of skin, even more so if that couple happen to be married to one another. So when a scene with passionate kissing, bodily sucking, or genital messaging does occur, it not only demonstrates the strength a marital bond holds but also fits within the themes of the show.\\n\\n\r\n“Amount” is the name of the game for Okusama ga Seitokaichou!, especially when it comes to its narrative, however that amount is low when execution is fully calculated.\\n\\n\r\nANIMATION\\n\\n\r\nThe anime takes place primarily at three locations: the school, Hayato’s apartment, and random outside locations. None of them are particularly noteworthy, mostly due to the lack of detail. Each does little more than act as a simple background in which the characters move, causing the show to gain nothing in terms of power. To compensate, the anime often transitions into a “chibi” or minimalist form to displace the attention away from the art and onto the characters currently being drawn in this comedic manner.\\n\\n\r\nThe character designs are as simple as the art, with characters more or less having a singular trait defining them. Hayato wears glasses to give him an air of intelligence, Ui has a sharp tooth to enhance her cuteness, and Rin has massive breasts that increase her overall sexuality. Misato, Ui’s mother, actually reveals a common thread: each design is the opposite of its respective characterization. For example, Hayato is not always the smartest when it comes to handling the situations he is thrust into, Ui is rather forward, Rin is on the disciplinary committee to thwart lewd behavior, and Misato’s short stature paints her as a child and not an adult. In this way, the character designs have a degree of cleverness that makes them, however slightly, better than the art they find themselves on.\\n\\n\r\nNot as clever is the actual animation, which is barely above passing at most points throughout the season. The “chibi” art is used once more to combat this fact since such a comedic style uses exaggerated movements, meaning less fluidity and more choppiness is permitted. The anime also leans on the use of head-only-cut-outs, for quick transitions and as a way to, once again, avoid extensive animation. It tends to pick up a bit during the steamier moments – tongue twirling, breast squeezing, and hip gyrating, to name a few – but since these instances constitute the minority, the majority of the time the characters refrain from moving too much.\\n\\n\r\nCHARACTERS\\n\\n\r\nOkusama ga Seitokaichou! does not have particularly complex characters, with it focusing mainly on the trio of Hayato, Ui, and Rin.\\n\\n\r\nHayato is arguably the best of the bunch, not due to his main lead status or his kindness but instead due to his more instinctual behavior. Hayato, being a male teenager, has spouts of horniness; when he gets into a situation that pushes his hormones to the brink, he sort of snaps, becoming a lion where he once was a cub. His lapses in rationality do not last terribly long, but they do last long enough for him to act out on his base desires. While a literal and natural part of life, this feature makes Hayato more human, more relatable – for men and for women – since such moments of “weakness” are something people experience in their own lives. Conspiracy theorists might argue that Hayato’s forced femininity correlates to a stance on same-sex marriage, but considering that his makeup, wig, and female underwear was more a comedy sketch than a political statement, the interpretation has little merit.\\n\\n\r\nWeakness of the first variety continues in Ui. Technically the star of the show, Ui is a young woman who does not have to search for “the one” since she has known who that was and who that would be for most of her life. Part of what makes Ui’s character similarly interesting is how, like Hayato, she does not follow standard tropes, at least in relation to anime. She is the aggressor and the instigator, the one who pushes the issue when she is alone with Hayato because she wants to make him know just how much she cares for and wants him. She is shy and nervous, as are most people performing sexual acts for the first time, but she always manages to overcome these feelings, creating intimacy and sensuality whenever she interacts with Hayato. Again, such actions are relatable because people in love want to express their emotions, with Ui’s palpable libido a natural extension of this type of expression.\\n\\n\r\nHayato and Ui’s relationship being as open and physical as it is aligns well with its overall marital vibe. Much like the story, where the uncensored material makes sense in the context of the anime’s goals, it likewise makes sense that a couple, primed to be together until death parts them, be as sexually active as they are. Yet Rin’s inclusion sort of throws a kink in the works, seemingly dampening the relationship the main duo share. As a character, she does not do much besides having a few sexy scenes and supporting Hayato’s misunderstood crossdressing hobby. Surprisingly, though, it is how her character affects the other two that gives her strength. For Hayato, he never actively pursues her, instead worrying about Ui’s well-being or wondering how best to protect her whenever Rin happens to be around. For Ui, Rin’s presence generates urgency and on some levels jealousy, spurring her to control and drive her connection with Hayato forward. Under this view, Rin is not an obstacle but rather a provider, pushing the other two into thinking about each other, thereby tightening the bond that they share.\\n\\n\r\nThe rest of the cast is largely forgettable: Ayane is a “cat” who understands the feelings of others the most, Karen is a violent lesbian, Mato is a girl who soils herself any time she accidentally falls over, and Ryouji, Ui’s father, is overprotective of his daughter. However they, too, exist to push Hayato and Ui closer together. Ayane and Karen make Ui realize the importance of communication, Mato forces Ui to think critically about why she loves Hayato, and Ryouji gives Hayato the opportunity to decide on what kind of relationship he wants to have with Ui. So while the side characters are hardly around, they at least manage to have some purpose within the anime.\\n\\n\r\nCollectively, the cast is clearly not complex. While everyone does not see much development whatsoever of their own, Hayato and Ui foster the foundation of their relationship, with the people surrounding them bolstering it as much as they can.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme has nice vocals, an upbeat tone, and a set of instruments that give it a light-rock feel. Combined together, they create a track that is appropriate for the anime. While not that catchy or long, it still does a nice job of getting the viewer ready for what the show has in store. The ending theme increases the speed, with its vocalist “stepping” between the syllables of the lyrics to form a simple yet fun track. However, like its OP counterpart, it is neither catchy nor memorable.\\n\\n\r\nThe remainder of the soundtrack is by no means vast, but it, like the OP and the ED, are pieces that fit the occasion as well as they can. A techno ensemble plays during mellow moments, a dainty piano for the silly times, and a gentle track is heard when Hayato and Ui are getting frisky. None of them are extravagant but they get the job done.\\n\\n\r\nVoice acting for the anime is somewhere around average. Ayana Taketatsu as Ui provides a cute and girly voice to improve her already established adorableness. Kazuyuki Okitsu as Hayato yells a lot but does not come off as annoying. And Tomoko Kaneda as Misato gives as childish a voice as she could muster. It is also worth noting that Ayana Taketatsu and Kazuyuki Okitsu did a reasonable job panting, grunting, and moaning during their sultry scenes.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis is a short show. So it is understandable that it does not do much of anything besides showing a nipple or two, providing a laugh every once in a while, and showcasing a cute girl here and there. Coincidentally, it does all three: the uncensored events were both thematically relevant and a sight for sore eyes (due to how much the medium loves to censor its material), the show’s brand of comedy was up my alley, and Ui and Rin definitely fit the “cute girl” definition. From the formatting of the jokes to the actual substance of the ideas, it being shorter worked mostly in its favor. If anything, the side cast is severely ignored; characters like Ayane and Kei – Rin’s older sister – are there but play only their absolute bare minimum roles. The problem, though, is that giving them more screen-time means less for Hayato and Ui to share which in turn leads to weaker themes, and giving them less screen-time means their characters are neglected even further. Simply put, it is a lose-lose situation of the anime’s own design.\\n\\n\r\nThe ending of the season also cuts off way too hard. It came off as wanting to tell more, almost as if there might already be a second season in production. This is not a huge gripe, but it was enough of a head-scratcher that I made a mental note of it.\\n\\n\r\nWhat I found most entertaining about the show was its ability to consistently progress beyond the previous episode’s limits. First it was naked apron wearing, then some hand holding, which quickly changed into tight bikinis, make-out sessions, and transparent lingerie. The anime also incorporated nether regions, with Hayato putting his face or his hands directly on Ui’s crotch, a large leap ahead of many “mainstream” anime. Consequently, the show managed to “go where most anime have never gone before,” adding an air of uniqueness to the total experience.\\n\\n\r\nIn the end, Okusama ga Seitokaichou! is an average anime. Its relatively nice cast picks up the slack of the less-than-stellar story it weaves, with the rest of its offerings – from its art to its music to its comedy – being little more than par for the course. Analogously, the anime is me when I was in the student council: mediocre at best.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, semi-harem antics hurt marital motif, flip-flopping from super-“ecchi” to super-“serious” is jarring, but the uncensored material fits thematically\\n\\n\r\nAnimation: Fine, boring art style, interesting character designs, just about average actual animation\\n\\n\r\nCharacters: Good, Hayato and Ui break tropes while maintaining a nice relationship, with the rest of the cast supporting their “marriage”\\n\\n\r\nSound: Fine, okay OP, okay ED, okay OST, about average VA performances\\n\\n\r\nEnjoyment: Fine, sexiness, laughs, and cuteness in handfuls, an untimely season cutoff, and steadily expanding lewdness\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-10-19T12:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 201583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=201583"
        },
        {
            "content": "Another day, another ecchi comedy, this one based on the manga by Yumi Nakata (oh?) & directed by Hiroyuki Furukawa (oh...) \r\nIt's not uncommon for odd couple romances in anime to employ some contrived means to quickly get our odd couple together before just as quickly forgetting about it. My Wife is the School Council President's (Okusama) devise is handily put in the shows title, just in case you were wondering how Ui & Hayato could possibly find themselves embarking down the road to romance that it's clear from the start they will be taking. As Vice-President of the Student Council, Hayato finds himself reluctantlyserving under the leadership of Ui, who won the presidential election on a platform promising to bring love to their school, which bans relationships between boys & girls. As if Hayato's day couldn't get any worse, that evening he finds Ui at his door, her stuff on her back & an email in her hand, announcing that they are to be married. What a setup!\\n\\n\r\nWell no, not really, because that would imply Okusama makes any use of its setup at all. Instead, we're treated to yet another by the numbers ecchi school rom com where the only thing that really distinguishes it from its peers is the one paragraph synopsis you read before watching it. There's nothing about the \"marriage\" between Hayato & Ui that couldn't just as easily have been explained away by, for instance, an administrative error by the school causing them to share a dorm room. In the end, all it's there for is to establish that Ui is Hayato's \"girl\" & the story, such as it is, will go through the usual list of love triangles, wife husbandry & \"innocent\" misunderstandings that every high school romance seems to have to go through, ecchi or not. \\n\\n\r\nIt's not often that I find myself thinking \"I wish they focused more on the story\" when it comes to ecchi comedies like this, but Okusama is an exception because, somewhere in there, there's a decent sounding little story that could be going on. Ui's goal of bringing love back to the school, facing off against the more prudish & busty (because that juxtaposition is funny. I SAID ITS FUNNY!)  Rin, head of the disciplinary committee could have led to an amusing clash of personalities as they battle for the morality of their classmates. Even when it's clear the main reason for Ui's enthusiasm is for the \"humorous\" contrast it creates with her complete cluelessness about what lovers actually do when she's with Hayato, it could have still told a decent, if less original story. \\n\\n\r\nIndeed, the framework for such a comedy is there, but it's so lazily put together that it undermines anything the show might be going for. The usual romance tropes are here: Ui having made a forgotten childhood promise; Rin having a personal reason to oppose Ui with the tenacity she does; a love triangle which serves to create misunderstandings between the three while also ultimately showing Hayato why he's better to stick with Ui; an assortment of other girl characters that get in compromising situations with Hayato to shake things up a bit - It's all there, all thrown in with little care & with little effort to set it up or to show how it impacted on the characters afterwards. \\n\\n\r\nEverything feels like it's just going through the motions, the minimal effort required to get us between contrived ecchi scenes where we're treated to the usual ecchi girl logic like \"Oh, my love rival gave you her panties? Well, it seems the logical thing to do would be for me to let you take mine off in this back alley!\" Nothing about Okusama has the goofy charm of 'Golden Boy,' nor the shamelessness of 'Haganai' or 'Highschool DxD.' It doesn't really even measure up to Yumi's previous adapted work 'Chu-Bra,' which was nothing special but at least made some effort to distinguish itself & actually run with its premise. & all this is before we get to the matter of how the show approached it's TV censorship.\\n\\n\r\nNow, it is possible to watch the episodes uncensored if you want to (& clearly a lot of people on Crunchyroll did), which renders this a somewhat moot point. None the less, it's worth mentioning because Okusama employed possibly the most obnoxious method I've yet encountered. While one comes to expect light lines & black bars in ecchi shows, at least until the BDs come out, Okusama opted instead to cut the scenes from the show entirely, replacing them with \"wife theatre\" a stick puppet show that looks like it was originally conceived as the preview skit after the end credits. The jokes aren't funny, aren't clever, go on ridiculously long &, perhaps worst of all, aren't really being used to censor anything particularly lewd or pornographic.\\n\\n\r\nIn the final episode, for instance, we're subjected to a two minute skit where the female cast fight JRPG style against footage of a kitten (taming the pussy hahaha!) which gives the impression that it's replacing a full H scene. Yet in the uncensored version it turns out to have simply being replacing a twenty second boob smother that includes, shock horror, a nipple slip. I haven't gone through every omitted scene to check, but I doubt I missed anything to merit it being removed entirely rather than simply blurred or blacked out. The art isn't bad, by any means. But really if that's what you're here for you might as well look for a compilation of the ecchi scenes to avoid an hour of \"plot\" getting in the way of what you're after. Quite why Furukawa went with this, I have no idea. Maybe it was supposed to give the illusion to the viewers that this show was dirtier than it turned out to be. The result, however, was to make the show even more of a chore to sit through that it already was.\\n\\n\r\nBut even without Wife Theatre, there's nothing to recommend about Okusama. It's not as lewd as it tried to imply. It's premise is wasted, it's story pedestrian & it's characters are dull. The only thing to say in its favour is that it's 8 minute episode length means you can watch the whole thing in under two hours, shrug you shoulders & move on.",
            "date": "2015-09-29T10:34:00+00:00",
            "helpful_count": 7,
            "mal_id": 200080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=200080"
        },
        {
            "content": "Okusama ga Seitokaichou! is a very simplistic ecchi anime with a very shallow plot.  To some this would be labeled \"simple ecchi done right\" while others would call it mediocre/crummy.  In my opinion, both are partially right.  The anime is nothing new for the ecchi genre and it really doesn't try to be.\r\nThe plot is basic: After being beaten out by a \"love liberation\" speech by female student council running opponent Ui Wakan, our male protagonist Hayato Izumi is forced into the vice president position while being fairly upset with the new president's school stance.  That evening the president comes tohis house and tells him she is his new wife, due to a drunken agreement made by their parents when the two of them were 3, and that she will now be living with him.  Realistic, right?  No, just a typical excuse to get the two players living in close proximity to each other.  Again, you either roll and enjoy the implausibility, or get critical on something that is OBVIOUSLY stupid from conception and ruin any chance of enjoyment.\\n\\n\r\nThere is also another player in this game in the form of a third romantic lead who grows to like the main male protagonist, causing tension between him and his so-called \"wife.\"  This girl is a polar-opposite and is against \"free love,\" but only because she was hurt in the past.  Again, all of this is in an attempt to float as many peoples' boats as possible (living together due to valid \"explanations\", \"sexual\" accidents with more than one girl, girls on both ends of the spectrum so you can pick sides, etc).\\n\\n\r\nDoes the anime do anything extremely well?  Not particularly, although for the first half of the show's episodes the opening credits had \"highlights\" of the last episode's plot which are helpful if you had forgotten.  So that was a nice touch.  The average episode length is also good (usually around 10-minutes) and makes the anime more palatable if you are bored and want to binge a series in a short few hours without risking enjoyment of it (due to binging).\\n\\n\r\nSexually, the show really doesn't shake it up at all (as far as the nudity).  There is basically a guaranteed breast shot ONCE each episode (all that's shaken up....is the way we get to it).  Personally, I found this tiring after the first few episodes and wished they had thought a little more outside the box (some episodes having more or less, depending on plot).  I think it would have really helped towards the second half.\\n\\n\r\nOn a more personal note, I also didn't particularly favor the very frequent \"free love\" mantra and it was really forced on the audience (and frankly, many episodes disprove what little message they were trying to get across).  Extremes really bug me, because they are both usually wrong/polarized sides of the presented argument.\\n\\n\r\nAre the characters unique?  No, not really.  \\n\r\nIs the plot gripping?  It's amusing and can be fun at times.\\n\r\nIs the animation or sound good?  Pretty average/standard fare.\\n\r\nEnjoyment?  Depends on who you are.  I don't feel like it was a total waste, but it's not a show I'd watch again.\\n\r\n(Oh, and the show's final episode had no closure whatsoever.  I'm totally banking on the fact it itself seems to want a second season.)\\n",
            "date": "2015-11-13T12:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 203285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4336091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Romantic19",
                "username": "Romantic19"
            },
            "url": "https://myanimelist.net/reviews.php?id=203285"
        },
        {
            "content": "To be honest I had very low expectation on this series. For #1, its a short. And for second, the premise or synopsis did not impressed me. Overall I did watched the first episode... oh my... Im very mad at the moment when I watched the show. Let's be straight on honest on this series. Note that this comes from a person who loves at least a pass the time series, short series such as Wakaba*Girl which is short but very cute slice of life and others. This show... well... let me just say it doesn't impress me. Note this is going to be ashort review. So keep that in mind. Also I ain't going to bash on those that likes the show, if you like this series, then thats fine by me.\\n\\n\r\nStory: ... Um... There's no type of story whatsoever pretty much in this series. Let's just say, that the series itself is just mindless fun. Just personally for me there's nothing much to talk about in this manner.\\n\\n\r\nCharacters: Well... they're below average lets be honest. They're just your 1 Dimensional Characters. Thats not technically a bad thing considering I've seen shows that had that but... theyre nothing special to my eyes. But they're not terrible cast. At least the MC has some bravery to do shit.\\n\\n\r\nArt/Animation: This is pretty much average too. Its nothing special yet its not terrible art as well. The reasons why are that the art and animation s very low budget and at the same time it sometimes suffers from the inconsistencies. It feels jarring and very eye soaring.\\n\\n\r\nMusic: Um... The music is quite eh... I don't know its pretty much mediocre at best to be honest. Pretty generic for a show, as for the VA... I can say they're pretty average. The reasons why some do fit, but some do not. For the sound... its terrible. Because my ears bleed like hearing a song from I dunno how to mention his name without getting in trouble.\\n\\n\r\nEnjoyment: I did enjoyed a bit but then after the first two or so episode this actually wore off.\\n\\n\r\nOverall: If you like a lot of mindless ecchi, and fun stuff at least, go and give it a try. If you want something with a story at least... or at the least a lot of redeeming qualities, this is not personally for you. \\n\\n\r\nI will lastly admit, yes, I somehow enjoyed a bit of its comedy and face expressions, but the rest overall... for me it was just a miss. But if you happen to enjoy this, have fun.",
            "date": "2015-09-17T18:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 198785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=198785"
        },
        {
            "content": "Your Wife is the Student Council President!...Ecchi Ensues...\r\nOkusama Seito Kaichou! is an unbashed ecchi harem anime short anime series where under wacky circumstances our main protagonist Hayato Izumi voiced by Kazuyuki Okitsu running for student council president gets shot-down by Ui Wakana voiced by Ayana Taketatsu, an ace of the school who conducts a reform of sex-ed and allows relationships in the school...later on well ecchi and harem ensues, though it focuses more on Ui and Hayato's secret relationship.\r\nFor an ecchi anime, it's either awkward or titillating or both merged with an ok relationship into the mix with it's elements of harem, ecchi and romancebut mainly of Ui and Hayato's secret ecchi relationship as well as Rin Misumi voiced by Minami Tsuda's love interest to Hayato forming the harem element as well as her rivalry of Ui's sex-ed reform since she's the Disciplinary Committee head.  \\n\\n\r\nThe awkward or titillating comes from the ecchi moments where it might as well be softcore hentai, it's uncensored but the furthest it ever goes is sexual moaning and bare boobs. Though the panty and suggestive shots is typical from the ecchi genre. Obviously if you have disdain towards fanservice this ecchi anime is gonna be awkward (though the sexual moaning in general is awkward to watch), but if you want short bursts of titillation then Okusama Seito Kaichou! for an anime short is an easy and quick pick.\\n\\n\r\nIn terms of characters, the majority of the anime is focused on Ui and Hayato rather sexual relationship, it's not a bad thing how LA let it goes, sure it maybe slightly fueled by sexual exploits that Hayato stumbles on and Hayato at times \"snaps\" and nearly goes all out at times, nonetheless as sexual their relationship is, Hayato and you the audience \"might\" see that this relationship is still stable and it's not just one-sided as Hayato and Ui expresses their feelings yes sexually, but it does make their relationship blossom even if Hayato has a pseudo-harem forming (realize that Hayato is \"married\" to Ui quite early...thus LA says \"pseudo-harem\"). Rin Misumi does get screentime but she applies the rival love interest and rival to Ui for the reforms, she isn't a wasted character as she kinda does her job as the rival/love interest for the most part.\\n\\n\r\nThe minor characters have a best one episodes to their name, such as Mato Sawatari voiced by Juri Nagatsuma as the \"secretary\" to Misumi and Ui's father Ryouji voiced by Yuu Kobayashi, the only two characters that gets more screentime goes to Ui's mother Misato voiced by Tomoko Kaneda and Misumi's older sister Kei voiced by Ryoko Shiraishi. The rest, like Karem Fujisaki voiced by Yoshie Sugiyama and Ayane Niikura voiced by Aoi Fujimoto, the other student council members hardly get developed at all.\\n\\n\r\nThe comedy revolves around Hayato being the straight man and nearly the entire cast being the \"tsukommi\" and yes because of this the comedy goes alot into \"misunderstandings\" but still due to how the animation makes it chibi and the exaggerated expressions kinda lands the comedic moments at times. \\n\\n\r\nIn terms of animation done by Studio Seven has two styles, typical ecchi and chibi. The typical ecchi is the obvious and with the more curvy and polished character designs from the female characters whilst giving Hayato a more normal yet comedic \"protagonist\" character design. The chibi style is only used for comedic situation though these two style clash alot of the time, maybe used to break the ice but nonetheless as separate styles they are ok, but NOT when the merge together from two differing scenes, though it being an ecchi comedy LA won't bash this aspect too much, it's kinda doing it job nonetheless. The animation is of average quality throughout though.\\n\\n\r\nThe voice acting, well LA will give Ayana Taketatsu this, she kinda got LA's favourite voice actor in Okusama Seito Kaichou!, just from her awkward nervous vocals to her moa- *ahem* comedic vocals are a broad range, Minami Tsuda has a pretty typical tsundere mode for the majority of the time and Ryoko Shiraishi voicing Kei is quite a welcoming surprise with her somewhat femme fatale vocals, though it's kinda typical for her what with her wide-ranged vocals. What can LA say but the vocal department in Okusama Seito Kaichou! is pretty decent and typical.\\n\\n\r\nOkusama Seito Kaichou! though it prides itself as a fanservice heavy show, there is a romance/harem element in there. The comedy is a nice relief from the fanservice though this element and the comedy coincide with one another alot of the time, it is an ecchi comedy. The characters though typically cliche they have a layer of sexual soft-puppy love relationship coated into it make what is a fanservice-heavy show into something with a bit of candy-coated to all the cheesecake. Okusama ga Seitokaichou! KNOWS what it is and laughs at the notion of being embarrassed (ironic since Ui does at *ahem* those times) and will cater to those who want something like this and what with it's length, it can easily be finished less than 2 hours. If there was a food LA could explain Okusama ga Seitokaichou! is like having ice cream cake for dinner, you know it has tons of sugar and it's quite BAD FOR YOU, but you just can't help but eat it because it's SOOOO TASTY and SWEET, just replace sugar with fanservice and you have Okusama ga Seitokaichou!. LA hate to admit it but LA wants another cake...\\n\\n\r\nIs anyone else getting hungry or is it just LA?...",
            "date": "2016-11-28T14:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 234551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=234551"
        },
        {
            "content": "First of all,this is very same type of ecchi anime as others,very basic but enjoyable plot,nice looking art without awkward animations,symphatic protagonist who doesnt seems like virgin when he sees some boobs, everything was great about this anime except the length,you cant enjoy good plot and atmosphere with this anime with just 8 min. lenght which is extremly short,i would recommend to authors at least 15-20minutes.\r\nBut,compared to other same genre ecchi,love,romance anime this one is slightly short also on plot,if you are heavy-minded on plot you can find this anime somehow unsatisfying for you,but for average ecchi audience i think this one will do hiswork.\\n\\n\r\nIf you enjoyed anime like for example : To Love Ru,Rosario to Vampire etc, you will also love this one,just without supernatural things and aliens.\\n\\n\r\n8/10 I highly recommend this short-length but great anime :)",
            "date": "2016-11-21T08:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 234136,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5852554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuBoySlovakia",
                "username": "OtakuBoySlovakia"
            },
            "url": "https://myanimelist.net/reviews.php?id=234136"
        },
        {
            "content": "Not all anime needs to be a masterwork of storytelling. Some shows just aim to be entertaining, and most often when a show understands what it is and doesn't try to be more is when a show enters a league of its own. Okusama no Seitokaichou is a rapid-fire romcom ecchi-bordering-softcore-porn, and it succeeds at being what it is.\r\nThe setup of Seitokaichou is as simple as the synopsis presents, with a little more - guy loses to girl in election, girl moves into his apartment on the premise of a childhood promise to be his wife, sexy hilarity ensues. That's it - and that's allit has to be. It doesn't try to pull a lot of drama, or pull comedy from silly plot elements like its harem comedy counterparts, no nonsense. Here's a setup, here's the joke. \\n\\n\r\nAnd boy, what jokes it does get. It appeals to crude humor but in such a way that is rather funny, if only for the *massive* degree to which it takes the lewdness. Crass? Yes. Vulgar? Undoubtedly. But it made me laugh, whereas the generic tsundere-abusing-MC \"comedies\"of other shows didn't, so Okusama is obviously doing SOMETHING right. \\n\\n\r\nFor as little screentime as characters get in an 8-minute anime, the characters of Okusama are charming, bearing a lot of artifacts from their origin as 4-koma manga characters both in design and in execution. Combined with respectable animation quality and great performances by the voice cast, there are no real complaints on that front. Like the story, the characters exist to do what they need to do, with no illusion of being deep, dramatic fonts of insight. \\n\\n\r\nOkusama ga Seitokaichou is a show that knows what it is, and doesn't try to be anything more. The jokes bring out a laugh, the ecchi is, well, ecchi, and overall it's very high in the enjoyment:time ratio category. It's a fun show - and really, that's all it needs to be.",
            "date": "2015-09-27T20:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 199926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3617255.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xthorgoldx",
                "username": "xthorgoldx"
            },
            "url": "https://myanimelist.net/reviews.php?id=199926"
        },
        {
            "content": "This anime is very much like the manga, if you have read the manga like I have then you know what to expect. It's very simple when it comes to the story, with the usual blue balls fan service, but it's still a very enjoyable anime series. A lot of people won't like this anime because they have not read the manga, or they just don't like boobs and borderline hentai Anime/Manga. The animation is amazing, actually it's very well done for this type of anime, however I wish it had longer episodes but 8 minutes is reasonable due to manga not having many chaptersas IT HAS NOT BEEN UPDATED IN A LONG TIME (SOMEONE GET YOUR LAZY ASS BACK INTO RELEASING THE NEXT CHAPTERS)\\n\\n\\n\\n\r\nNow if you will excuse me as I continue to wait for the next chapter of Okusama ga Seitokaichou",
            "date": "2016-03-30T03:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 214774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474161.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/suigintou101",
                "username": "suigintou101"
            },
            "url": "https://myanimelist.net/reviews.php?id=214774"
        },
        {
            "content": "Right, let's get the synopsis out of the way, shall we? It's actually quite simple: the male lead, Izumi Hayato is running for class president, but gets beaten by Wakana Ui, who promises free love on the school grounds, and less harshness when dealing with dating. Somewhat gutted, he still stays vice-president but that evening discovers that the president (now revealed as the female lead), was actually arranged to marry him, and so she decides to move in with him as his wife. The stage is set, the lights lit, let the show begin!\r\n     And that'sbasically it: it's a form of slice of life focusing mostly on the relationship the two characters have (with a very slight love triangle after a bit). Oh sure, there is some ecchi (that'll be most enjoyed in the uncensored version), but it's nothing TOO hardcore, in fact it's almost cute. You have two leads, both sixteen-ish living together and actually attracted to each other, so of course ther are going to be some moments that will make ecchi haters cringe, but they don't spoil the actual plot in any way. So there's no \"accidental\" groping, slipping to land in someone's boobs, it's all planned out.\\n\\n\r\n     There are also a couple funny scenes in this, some fun situations, and you can really get the character's feelings. Overall, nothing cringingly bad really ^^\\n\\n\r\n     Anyway, I'm giving this an 8, because I quite enjoyed it and it reminded me of a couple things I went through ages ago. Either way, if you're into this, I'm sure you'll quite enjoy it. And remember, season 2 is coming out in October ^^\\n\\n\r\nNow excuse me while I check out the manga this was adapted from.\\n",
            "date": "2016-08-30T08:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 227942,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4986320.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wereprophet71",
                "username": "wereprophet71"
            },
            "url": "https://myanimelist.net/reviews.php?id=227942"
        },
        {
            "content": "this is good anime , WOOOO i Love it\r\nI have watched all the episodes of this anime and I highly recommend it for people in the world\r\nin terms of the story of this anime is good, especially the ecchi scene in it that makes me addicted\r\nI can't say anything for this 8-minute anime which is really good\r\nthis is the number 1 ecchi anime that runs the story and the ecchemical scene is satisfying\r\nThis anime is the right place for oppai lovers to overlay the hobby (don't forget to prepare tissue :v)  \r\nI hope this anime has a movie version",
            "date": "2019-01-18T02:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 299340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7709692.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/egi23",
                "username": "egi23"
            },
            "url": "https://myanimelist.net/reviews.php?id=299340"
        },
        {
            "content": "I try to avoid Slice of life and especially Harem shows as much as I can because they just do not fit my taste in entertainment. Nonetheless I´ve seen two Slife of life/Ecchi series which I genuinely liked.\r\nThe reason I enjoyed those two,being their sheer offensiveness. Two Anime, who went that one step beyond the boring  panty shots and accidental tit gropes, to tell their story. They also didn´t involve any annoying bickering many main couples within harem or romance Anime go through. I watched Okusama ga Seitokaichou, expecting an exxagerated offensive comedy  similar to the likes of  Shimoneta or Prison School,but I was wrong. Those shows suceeded in surprising me with their ridiculous premises and their over the top plottwists, to the point where I bursted out in laughter because of sheer surprise.\\n\\n\r\nOkusama ga Seitokaichou on the other hand, turned out to be a fairly generic  comedy echi harem, with all it´typical character archetypes and boring plot you´ll  come to expect when watching a show of that kind. I won´t spoil anything, but if you think you´ve seen the shows  characters before. It´s because you have.\\n\r\nBut, the show has two saving graces compared to it´s peers. It´s  short run of 8 minutes per episode and  it´s lack of consistent cockblocking, that similar shows are infamous for. There are no annoying parents or siblings, storming the doors, or obnoxious sidecharacters jumping into the picture, to ruin the fun for everyone when its \"heros\" are exploring their bodies.\\n\r\nIf you want to watch borderline hentai this show perfectly delivers.\\n\\n\r\nNo strategical placed hair, that covers nipples, asshole lights or conveniently placed objects and limbs to obstruct the view here.\\n\r\nYou get to see everything from the bellybuton upwards  and when a hand happens to slide down a crotch or on top of a booby it happens out of free will and not because of banana peel or slippery stairs.\\n\\n\r\nWhich conveys more the feeling of a terrible teen Movie like American Pie, rather than a terrible harem Anime, that keeps cockteasting it´s audience with what they actually wanna see. I gave this show a 7. While it´s certainly not for me I can see audiences really enjoying that show.  That audience  being a horde of adolencent teenagers that have no acces to actual porn, or are too shy to watch it.",
            "date": "2016-05-12T10:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 218434,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231465.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Isterio",
                "username": "Isterio"
            },
            "url": "https://myanimelist.net/reviews.php?id=218434"
        }
    ],
    [
        {
            "content": "I previously wrote a review for this anime but I wasn't quite happy with it so I'm remaking it... You can skip to the end for a quick summary.\r\nKeep in mind that this anime is REALLY ecchi, there's nudity and sexual acts so if you don't like that kind of thing then don't watch this. If you didn't like it simply because it was short I'm kind of disappointing in you. \r\nStory: 8\r\nIt's about a boy being engaged to a popular girl at school and them proceeding to live together. This kind of premise is not entirely unique so there's not much to say aboutit. But what originally appealed to me in the story was how they handled its ecchi. Instead of showing meaningless boobs on screen, they actually twist the more ecchi moments into actually being very romantic and intimate moments between the leads. Which serves as both not only fan service for the viewer but also very romantic and touching moments.\\n\\n\r\nArt: 7\\n\r\nThe backgrounds are okay, I didn't find them particularly hard to look at nor particularly stunning. The character models are nice and they often switch from more realistic human models to more chibi like models to convey comedy and make character to appear to be more cute with varying degrees of success. Animations are not stellar but they don't feel lazy.\\n\\n\r\nSound: 7\\n\r\nSFX is often off for example something makes a sound yet the sound appears 1 to 2 sec after that action. This is NOT TOO bad and can often be overlooked. The SFX themselves seems realistic and believable as does the voice acting. The OST is meh. None of the tracks stood out to me but they all help to convey the right moods at the right scenes. \\n\\n\r\nCharacters: 8 \\n\r\nI found all the characters to be very likable. The mc, Izumi, is pretty mature and is NOT afraid to engage in sexual acts with our other mc, Ui. Ui herself can be pretty adorable and gives Izumi that extra push to actually do stuff with her, once engaged, Izumi is pretty ballsy compared to pretty much every other protagonist of an anime like this which is honestly an incredible breath of fresh air. The supporting cast is more or less forgettable, nothing really stands out but they are likable especially Ui's mother. Ui's mother, actually feel like a step-mom, yet she still feels like her own person as she has very childlike qualities that corresponds with her appearance. This anime also does a pretty good job at shoving details about the character's lives and their thinking without going right out and saying it making do on its incredibly short run time\\n\\n\r\nEnjoyment: 8\\n\r\nBecause of its admittedly fan service-y and ecchi nature of this show it easy to enjoy. However, because they spin in it ecchi in such a romantic way the show also becomes quite heartwarming. It's short run time also helps in this because the anime's short comings can easily be overshadowed by the more superior romantic moments.\\n\\n\r\nOverall: 8\\n\r\nWatch if you want to see...\\n\r\n-An intimate romantic relationship\\n\r\n-A LOT of kissing\\n\r\n-A somewhat realistic approach to its engagement premise\\n\r\n-A popular girl/living together romance\\n\\n\r\nNOTE: Keep in mind that these compliments ONLY extend to the s1, s2 is bad don't watch that the best I can give it is a 6 for s2 :\\\\n",
            "date": "2018-07-22T22:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 284561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6354440.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vincent_Lau",
                "username": "Vincent_Lau"
            },
            "url": "https://myanimelist.net/reviews.php?id=284561"
        },
        {
            "content": "Alright guys, how do you spell degenerate? D E G E N E R A T E. That's right! It's also you, and me! Okusama ga Seitokaichou is probably something that will make me feel like a degenerate for the next month, but do I regret watching this? Not really.\r\nStory: For the 10 minutes that the anime has for screentime, the story is actually progressed at a constant and steady rate. The content of that does vary depending on the episode, but overall they do manage to fit in a good amount of story into 10 episodes. Every episode seems to have a focus ona character, and many involve our main character turned degenerate, Hayato, and how his antics seem to affect his soon-to-be wife. With the story of the episodes, they also sometimes throw in a gimmick, like how he and Ui have to make up, a chance meeting with someone, etc. \\n\\n\r\nArt: Alright. I'll say it. I watched the uncensored version. I'm a degenerate. However, all that really did was add in the part from the love hotel, and add in some HYPER REALISTIC ANATOMY. Besides the fact that I watched that version, the art is actually not that bad. They make good use of changing to chibi forms, expressions are nice, and they like using the thinking emote a lot. Also, each and every character stand out in their own way. However, past that, the art is just kinda there.\\n\\n\r\nSound: Lots of lewd noises. Oh, and the opening is nice. Yeah, that's all I got.\\n\\n\r\nCharacter: For 10 minutes per episode, the characters are used very well. Each character got their own episode with something centered on them, and you can definitely tell which character is which based on personality. Everyone is their own selves, and they actually showed character personality to the last detail. However, since the episodes are only 10 minutes, that does not leave much time for deeper development outside of the 2 main characters.\\n\\n\r\nEnjoyment: Overall, yeah. I felt like a total degenerate watching this anime. I would say that hindered my enjoyment just a slight bit. However, getting that out of the way, I still enjoyed this, in a slightly weird way.\\n\\n\r\nOverall: My overall opinion of this show is that it's not bad, but I wouldn't recommend watching it in public, or really anywhere outside your house. Overall, not that bad of an experience, although the short episodes may hinder some enjoyability.",
            "date": "2018-07-09T19:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 283582,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5869540.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rabb2t",
                "username": "Rabb2t"
            },
            "url": "https://myanimelist.net/reviews.php?id=283582"
        },
        {
            "content": "Now just for everyone to know, just because I gave it a 6/10 doesn't mean I didn't enjoy immensely. It's just not neccissarily that good lmao.\r\nWill be calling it Okusama throughout the review. Any spoilers will be makred prior.\r\nStory - Okusama is only 8 minutes each episode for 12 episodes, so the story is pretty subpar honestly. It's an ecchi obviously, so there wasn't much hope for the story in my eyes and I was right. Now this doesn't mean I didn't enjoy the concpet of the show and how events have taken place, but there's just no solid storyline. \r\nArt - Whenever I reviewI also just give Art an 8 or 9 because I'm not a stickler for it, but Ecchi is different. Ecchi si something where I actually pay close attention to the art style and detail, and I was impressed by Okusama. It was pleasing to me and all. I know some people will say it's bland and in a sense it is, but I personally don't like colors popping out everywhere at me.  Everything from the backgrounds to the nipples is done nicely to my tastes, but hey, that's just me.\\n\\n\r\nSound - Sound isn't something I look too closely at because it's not that big of a thing for me. Same instance here. Characters weren't annoying and it all sounded fluent.\\n\\n\r\nCharacter - Now here's something I think shined, and for good reason as well. As you know by now, this is an Ecchi, and characters are usually one sided or bland. In a sense, Okusama'a characters are that as well, but for some reason I really enjoyed them. The main female Ui honestly looks amazing to me and I love her character. The main male character Izumi was also very nicely done and wasn't a cringey MC either, which is also a plus. The side characters are all one sided as well but not annoying, which is there redeeming quality to me. All in all, good characters for an ecchi.\\n\\n\r\nOverall - I see people judging this harshly and I understand why, but I feel as if this isn't something to take oh so serious. It's just an 8 minute episode ecchi with a love subplot. It's not supposed to have the best story out there. It's supposed to provided fanservice and happy feels, which it did in its entirety. That's why I'd rate it overall 6, but personal enjoyment at 9. I just enjoy shows like these.\\n\\n\r\nThis is a category I am only gonna do for Ecchi.\\n\\n\r\n\"Arousal\" Factor - Ok lets be honest, arousal is a part of ecchi and happened to all of us at one point. I always factor it in for rating Ecchi to myself, and I'll share it here with you guys that read this. I don't like Ecchi that will my me \"aroused\" the entire time. If I wanted that, then I would go watch real porn or hentai. I like a series that while sometimes had its calm moments, I still got \"aroused\" at certain points because they were done good. They weren't cringey, cliche moments that make me regret watching. They were either hot, attractive moments that were enjoyable on the eyes, or a cute warm moment that I happen to love personally. I'd give this category a straight up 10 if I could. \\n\\n\r\nOverall, if you like Ecchi and are ok with little to no story, you'd enjoy Okusama. If you want something deeper with a linear story, this isn't for you my friend. It's something fun to watch, so enjoy yourself.",
            "date": "2016-10-08T00:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 231311,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5236335.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mr_Miner",
                "username": "Mr_Miner"
            },
            "url": "https://myanimelist.net/reviews.php?id=231311"
        },
        {
            "content": "Okusama ga Seitokaichou: (Short Review)\r\nTo start of this review I'll give a quick synopsis of the setting; which features a young boy in highschool named Izumi Hayato who runs for Student council president and then failures to the other candidate Ui Wakana who wins by throwing condoms into the audience. To which afterwards he discovers that he is engaged to this person, is going to live with her and function as her vice president while in school in which hilarity commences.\r\nFrom here on out the story takes format of the characters living daily lives while trying to hide their engagement under wraps as well asthe Izumi getting into compromising situations with Ui as well as other girls found within the show. This leads to quite a heart warming show with correct amount of balance between Slice of life scenarios and fan service like moments, that help deliver a quick fix of slice of life that is around 8 minutes per episode, which doesn't drag out any unnecessary scenarios keeping the plot smart and simple.\\n\\n\r\nHowever the plot can be fairly predictable at times with the various scenarios that take place, as such if you have seen lots of anime you will be able to tell how they will end, but even if you have not seen much anime you can take a guess on how they'll all end. This also leads we to the ending which was fairly predictable; with it  just ending on a cliff-hanger which brings the series down as a whole having no real ending.    \\n\\n\r\nNext I will talk about the characters which are quite few for a show like this but this is a 8 minute show so it was best to keep it few to minimum cast. To start of I will talk about the two main characters the first being Izumi Hayato who has a very simple personality being the stubborn, smart man with straight man humour added alongside it which fits the show but he could be replace with anyone else and still feel the same; and secondly the their is the main heroine Ui Wakana who has the child like personality crossed with an adults mind during the more scandalous scenes which gives her a certain charm and has a nice fit for the show. Both don't get any real development through out the series but this is be expected given how long each episode is.\\n\\n\r\nThe supporting characters of the show are mainly comprised of other candidates to tempt Izumi anyway from Ui and provide various fetishes the viewer may like. The first set I'll look at is the rest of the student council which comprises of a cosplaying girl (Ayane Niikura) who barely appears and small Tsundere girl (Karen Fujisaki) with feeling for Ui and a hatred for Izumi who serve as more as comic relief than anything.\\n\\n\r\nNext is the Disciplinary squad who fight against the student council's view on relationships (the throwing condoms into the audience part and the aftermath), in which only two characters from their are introduced, the first being another small character (Sato Sawatari) who plays the loli role and has a rivalry with Karen but is never stated why and has a similar personality as looking up to her leader, Rin Misumi who serves as head of the Disciplinary Committee as well as turning into Ui rival in love part way into the show, and is primarily used as to create conflict as well as fill in some of the ecchi role.\\n\\n\r\nThere are some other characters not mentioned but they have barely any presence and don't much so I feel they are not worth touching upon.         \\n\\n\r\nNext is the animation which is decent and isn't really worthy of any really mention, which can also be said about the soundtrack which didn't stand out much and I can't describe how it sounds on its own as I can't find it however I can say the OP and end of the show are a nice fit having a warm and comfortable feeling to them.",
            "date": "2015-09-30T05:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 200148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=200148"
        },
        {
            "content": "Rate a 6\r\nEnglish Subbed\r\nA nice change for an anime based on an ecchi perspective. Most ecchi is sadly aggressive. Not rape based maybe but a strong firm. In this case the ecchi element is pure and innocent. While naughty intentions arise they weren't intended. What makes the ecchi elements pure is the amount or romance and drama applied. Frankly that is how ecchi should be. For if ecchi was aggressive wouldn't you at some point be sad due to guilt? Ecchi is exciting for sure but it should be based on a mutual portrayal or not at all.\r\nThe story is simple and honest for bothsides. Each action taken from either gender character did seem realistic without much in terms of overthinking. While the idea of adding a harem mixture element to this may come across as offensive given how pure and romantic this is. To be honest it is needed. For the harem element does a fine job at showing the struggle the main female and male character have trying to cope with a decision that wasn't theirs.\\n\\n\r\nEnding was a bit troubling. While the sentiment of closeness was expressed the way it was told/drawn illustrated that they have reached the borderline for the rating. While this may not be considered a bad aspect does make you question on how a sequel would go. Normally, follow ups of things are stronger and better. Only two ways come to mind. Either a change to hentai or a reveal of their secret. But if they revealed their secret would that be enough of a story?\\n\\n\r\nArt\\n\r\n-did a fine job matching the romantic/innocent portrayal.\\n\r\n-provided some food for thought for non-Japanese people on the age element. Opens the mind to the cultural strains and norms on how to appear.",
            "date": "2017-08-12T18:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 255295,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227232.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sidewinder51",
                "username": "Sidewinder51"
            },
            "url": "https://myanimelist.net/reviews.php?id=255295"
        },
        {
            "content": "Have an itch for a bit of ecchi? Short on time? Then by all means give this a go. This is, quite literally, an instant girlfriend ecchi-based comedy that is borderline hentai. Right off the heels of Shimoneta, I can say that this seitokaichou is pretty much as aggressive as Anna, only much naughtier as well. Amazingly, they are able to put together the semblance of a story and give decent character expositions (both personality and skin-wise) despite each episode only lasting eight minutes- seven if you take out the OP and ED. While the show isn't going to win any awards for depth, ithas an honest sense of warmth between the characters that is all but lacking in most current-generation harems. If you can deal with all the skin ship in the show and have an hour and a half to kill, this is indeed an interesting way to spend it.\\n\\n\r\nAnimation:\\n\r\nCompared to full-length shows, the animation is a bit spotty. However, compared to most 4-koma shows, this is superior. Thus, you get the best of both worlds in a way, pretty decent quality and not too much story fluff. As for characters, there are a lot at first but all of them are unique in appearance and behavior enough to work your way through them. Don't expect that much in terms of character expressions, though expect quite a few elated expressions; the bird chicks coming out of character heads is interesting. This show does have a lot of ecchi, and by that I mean suggestive positions, soft-core rubbing, and topless nudity on top of your standard bouncy and upskirts- definitely not for your tablet on a plane flight.\\n\\n\r\nSound:\\n\r\nThe show opens with a short, upbeat light rock piece with a fair melody, and ends with an even faster-paced rock piece sung by Ayana Taketatsu. The BGM is mixed extremely lightly, the vocals and effects dominate the sound in general, don't expect any particularly memorable pieces. The VA cast is fair overall, but really, you'll be listening mostly to Ayana Taketatsu so expect a\"stimulating\" performance to say the least.\\n\\n\r\nStory:\\n\r\nThe story follows our standard nice, studious lead Hayato, who happens to be forced into living with the student council president Ui. However, Ui isn't satisfied with just being in the same apartment, she's looking for more from her darling. Not really a bad deal is it? All Hayato has to do is hide everything from the school's discipline committee- but it appears the leader there is a bit horny herself...\\n\\n\r\nThis somewhat nonsensical excuse to watch ecchi doesn't really have much of a focused plot, most episodes are for the most part episodic. I guess from an ecchi perspective, everything is \"short and sweet\". To the extent where you soon run out of episodes before you know it.\\n\\n\r\nCharacter:\\n\r\nAs mentioned above, the characters are indeed interesting. Unlike your typical harem lead, Hayato actually has some balls and is more than willing to respond to girls' attempts at getting his interest. Even more, his relationship with Ui is, admittedly, kind of cute; it has a fuzzy feeling that is reminiscent of what we saw in Dannaken. The two grow in, let's just say, many ways through the short show. There are definitely more supporting characters than truly necessary but for the most part the show sticks to the main couple; the others do make for some good jealousy episodes though.\\n\\n\r\nValue:\\n\r\nIf you're looking for pretty serious ecchi, this is a dirt cheap time investment. On top of that, there are actually pretty good characters too. Overall, it's an entertaining way to kill an hour and a half.",
            "date": "2015-11-07T23:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 202933,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202933"
        },
        {
            "content": "Okusama Ga Seitokaichou is about the daily life of Hayato Izumi, a normal teen who's forced to marry Ui Wakana, the student council president.\r\nThis was one of the funniest and lewdest animes from this season, and it was pretty romantic too... so that adds points in my list.\r\nThe only thing that REALLY bothered me about this anime is the fact that ANYTHING happened and most of the characters barely had screen time... IDK if they're making a second season but if they do... please don't make the eps 8 minutes long AGAIN.\r\nIf you wanna laugh a little and see some boobs, this is your anime.",
            "date": "2015-12-17T11:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 205784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205784"
        },
        {
            "content": "Yeah this show is trash. But its short trash. So there's that. But between the problematic character motivations (This girl is starving for his D just because her parents told her to be his wife, the main character isn't a perv but will sexually assault a girl just cos, etc.), the awful cutaways during what are obviously sex scenes, and very little if any depth to the characters, plot, or themes. Theres just not much to really sink one's teeth into here. \r\nI'd only reccomend this to the loneliest of neckbeards whose waifu's are on hiatus this season. Mostly because the main character is soself-insert it felt like fanfic at times and I know neckbeards like those types of shows. Watch Shinomoeta instead folks. \\n\\n\r\n3/10",
            "date": "2018-01-15T23:56:00+00:00",
            "helpful_count": 0,
            "mal_id": 268728,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Alamojak",
                "username": "Alamojak"
            },
            "url": "https://myanimelist.net/reviews.php?id=268728"
        }
    ]
]