[
    [
        {
            "content": "I \"love\" it when an anime tries to ask deeply philosophical and ethical questions, only to answer them with fists, feet, and super powers. Personally I find it annoying when characters claim that they can overcome things like God, Fate, Destiny, Karma, etc, with nothing more than willpower and a kickass partner (since the main character so often is a complete novice in combat, or has no redeeming qualities whatsoever).\r\nEnter then Kurokami, as a shining example of these things at work.\r\nNow, when I started watching this I had no idea that Kurokami was originally a manga Sung-Woo Park (illustrator), and Dal-Young Im (story), and tosay that the anime and manga are like chalk and cheese would be an understatement. \\n\\n\r\nThe story in the anime version centres around Ibuki Keita, a highschool student with a very similar isolationist attitude to Ikari Shinji from NGE. The reason for this is that, for no apparent reason, everyone around him seems to die. One evening he meets a young girl named Kuro, and it is from her that he learns the true nature of the world.\\n\\n\r\nI'll stop there as the story is quick to hit its stride, however I have some big issues with the plot on the whole, the first issue being why Keita, who in the manga is a 19 year old games programmer, is suddenly a high school student in the anime. Now, many of you may think this isn't a problem, but in actuality it causes a major incosistency in the flow of the story and the development of the characters.The plot for the manga has been written with Keita as a 19 year old who is working. This means that many of the thoughts, feelings and actions he takes in the story are based on the fact that he has already completed high school and is effectively an adult. The anime, on the other hand, portrays Keita as a teenager, a \"child\" so to speak. The reason for this change is purely a marketing issue. The producers wanted this series to appeal to a teenage fan base, in paritcular the fans of shows like Shakugan no Shana, Zero no Tsukaima, Fate/Stay Night, etc. \\n\\n\r\nImagine for a second the difference in your own thought processes over over a two year period, in particular, the difference in how you perceived the world, and more importantly, how you reacted to it. Beginning to see what I mean? The plot for the anime stays true to the manga for the most part when, in truth, it should have been rewritten completely.\\n\\n\r\nAnother big change is the fact that the manga involves transplanting an arm. The whole idea of transplanting hearts was, again, purely a marketing strategy. That change was made so that it would appeal to a more \"romantic\" audience, something which the anime could have done without.\\n\\n\r\nBoth changes (and they're unfotunately not the only ones), have severely damaged the flow of the plot and the development of Keita and Kuro as characters. The original concept was very good, and if they'd stuck to it instead of pandering to the audience in an effort to cash in on the Shana/Louise/Sabre franchise, then it would have been a much better show. \\n\\n\r\nAnimation is another issue I have with this series. Overall its not too bad, but Sunrise and Bandai really didn't seem to put any effort into this show on the whole. The animation is often jerky and confusing, especially during the action sequences. The studio has tried to make the show look \"cool\", with the proviso that this be done at the lowest cost possible. There's naked character transformation scenes in the style of the mahou shoujo genre, overblown, overpowered special moves with silly names in the style of Bleach et al, strange character actions (like running, eating, etc), and an overall sense that the animators really couldn't be bothered to get their fingers out. \\n\\n\r\nThe art for the backdrops is actually pretty decent on the whole, and is the main reason why I scored the art as mediocre instead of bad. Unfortunately, these backgrounds don't have the same kind of vitality to them that can be found in other shows, and are often there so that one of the characters can be sent crashing through it with a punch.\\n\\n\r\nThe characters have been designed along the lines of the manga, so no real issues there. I just wish they'd put more effort into the overall work though.\\n\\n\r\nAs far as the sound goes, the only reason I didn't give this area a good rating is because of the cumulatively annoying OP and ED, and the change of OP midway through the series only compounded this.\\n\\n\r\nThe rest of the music throughout the series can is generally okay, however there are points where the music and mood don't match. The voice actors are on the capable side, but once again there doesn't seem to be any real effort involved in their portrayals as the acting is sometimes very wooden.\\n\\n\r\nThe characters are, again, pretty decent on the whole. There isn't any real development that goes on with any of them barring the two main characters, and any changes in the persona of the sub characters tends to happen off-screen. As for Keitaand Kuro, the fact that Sunrise and Bandai's marketing teams got involved with production means that there's some annoyingly inconsistent threads running through their development, Keita's relationship with Akane being an example of this.\\n\\n\r\nThis is an odd anime. It's clearly influenced by the likes of Fate/Stay Night and Shakugan no Shana, as well as Bleach and DBZ (surprisingly). The confusing plot and the inconsistencies stand out so it makes suspension of disbelief more difficult. It's enjoyable in it's own way, but is still one of those \"watch once and forget\" titles that seem to be cropping up more frequently.\\n\\n\r\nOn the whole, this is not a good series, but it isn't bad either. The fact that it tried to include a complex plot with some deep philophical and ethical issues is one of it's few saving graces.",
            "date": "2009-09-16T21:41:00+00:00",
            "helpful_count": 300,
            "mal_id": 18869,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=18869"
        },
        {
            "content": "\"Can you change a destiny that has already been written for you?\"\r\nEnter \"Kurokami\", a series that shows the struggle of two individuals, as they attempt to change their own path that others say can not be changed.\r\nStory: 7/10\r\nThe center of the plot revolves around \"the Dopleliner System\". What this means is there exists three versions of the same person (2 subs and 1 root). Should any one of these three come in plain sight of the other, they will perish, and only the root will live, and thus will consume the energy force of them known as tera. Our main heroes are Kuro (a TeraGuardian trying to stop the Doppleliner system and defeat her brother) and Keita (an ordinary boy who unwillingly ends up becoming her partner). What interested me the most about the anime, is the way that the actual battles take place. It almost feels like you are watching a more mature version of Pokemon at times. Each Tera Guardian can form a pack with a human, and thus use their power in conjunction with their own. So fights take place with the two helping each other--ie: the Tera Guardian fights, and the humans remain on the sidelines channeling their powers to their partner. The fighting scenes are also quite good, because despite the characters featuring \"power/energy\" moves, the fighting scenes themselves feel very street brawling oriented, and stylized. It overall does a good job of mixing the super powers with more authentic looking moves. Now regarding the way the actual storyline progresses, here is where I feel Kurokami tends to miss the mark. There are enough plot threads going on, and many of them do evolve throughout the series. However, they end up happening few and far between. A lot of episodes play the role of fillers, and some fight scenes that take place seem unnecessary. This can make the plot a bit tedious to follow, as it can sometimes take many episodes for something simple to be made clear. Still, making your way through the anime just to see the last few episodes really makes things worth while, as the final episodes are exciting and fast paced, though I did find it a bit odd that episode 23 ends up being a re-cap of all the others, but through a slightly different perspective. Where this anime really shines through is with its actual ending. Everything concludes nicely, and feels very satisfying at the end. And some events even end up being a bit unexpected. As a whole the story is good, there is plenty of action and plot twists to keep things exciting. But due to the storyline tending to drag on, does hinder it as a whole, but nothing too drastic.\\n\\n\r\nAs far as offensive material goes, Kurokami does have a few scenes which contain gory elements where blood spurts and/or is smeared on the ground. These scenes don't happen very frequently, in fact only the first few episodes really have them, with it only happening occasionally after that. Some battles even end with little to no blood spilled at all. \\n\\n\r\nArt: 8/10\\n\r\nThe arts style to this is dark and moody, but not really in a creepy kind of way. The backgrounds come off pretty well detailed, with nice looking city designs and foliage areas. Even so, the overall color schemes tend to make the series look a bit washed out. The character design is good, all of them are well proportioned and have a good sense of style to each one of the cast. The super moves (also known as \"Exceeds\") are flashy and colorful, with each character’s move set differing from one another. The fight scenes are by far the best part in the animation. Character moves are animated smoothly, with every punch and kick shown off with just the right amount of impact.\\n\\n\r\nSound: 6/10\\n\r\nFor me this was the weakest point in the series. The voice acting in both the English and Japanese version is very well done, I still feel the Japanese audio is better by far in the long run. However, a majority of the soundtrack seems to favor one style of genre in music...rock! The opening and ending themes change twice through out the series. The opening animations both play rock style music tracks, while the ending theme (surprisingly) plays soft lite hearted melodies sung by Yousei Teikoku. The background music it plays also consists of rock music. I can see where they are going with this, and while I don’t care for heavy rock music, I can at least appreciate it for this anime. If you like this type of genre in music then you will love the soundtrack, but if you’re like me and don’t care for it, then you will most likely turn the volume down during some of the scenes.\\n\\n\r\nCharacters: 7/10\\n\r\nThe characters are hit and miss. I will go on record of saying that Kuro is one of the coolest female heroines to come along in an anime as of late. She has a sweet and funny personality, yet holds back a lot of sorrow in here life--she is quite the layered individual. Of all the characters in the series, Keita is probably going to be the one that is hardest to tolerate...especially during the beginning. He tends to complain a lot, and is unwilling to help anyone towards the beginning, and will most likely annoy many viewers. To his credit though, he does end up changing as the story progresses, and at least becomes more tolerable in the end. The supporting cast is also the same, some characters such as Excel, Reishin and Daichi do a good job off adding to the storyline. However, there are a number of supporting characters that just don’t make the cut. Many of them don’t really seem to have much impact on what is going on, and thus make some feel unnecessary to the storyline. They’re not a bad cast by any means, some of them just don’t seem to have a staple purpose in the anime. As a whole though, the main characters themselves do end up doing their parts well for the stories’ purpose, and in that regards it is done right.\\n\\n\r\nOverall: 7/10\\n\r\nDespite some of its flaws, Kurokami is a good anime. If you can make it through some of the fillers, and don’t mind the story dragging on somewhat, then I think you will find this a deep enough series to check out. There is enough action and plot in this to keep both the Seinen fans and casual viewers satisfied. And as it stands, it’s a series I think anime fans should give a try.",
            "date": "2009-06-24T22:40:00+00:00",
            "helpful_count": 82,
            "mal_id": 16113,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=16113"
        },
        {
            "content": "“Power to achieve something”\r\nThe Story…\r\nIt revolves on a system that we called “Doppeliner System”. The story tells about the involvement of the three main characters, which is Kuro, Keita, and Akane. They are somewhat confused on this system and willing to find out the real main reason why this system exists, making it as an obligation as they put their life in danger or helping others to find out the cure to its existence.\r\nThe point of view here is not the twist of the story rather the main attraction here will be the action / super power scenes. It gives excitement and thrill but onthe other hand there are some minor / major problems that you may notice in it within the show. Though the twist of the story adds effects for the whole series, it’s quite ineffective in such a way that it consists of somewhat boring conversations, bad combination of action and romance, and bad flow of the events throughout the story. \\n\\n\r\nThis might be the uniqueness of it from the other anime. It comes up with a different representation of martial arts with super power. It is also the main reason why it’s been quite exciting to watch the series, nothing less and nothing more.\\n\\n\r\nArt & Animation…\\n\\n\r\nWell it might be obvious what the series will give. It emphasizes fighting scenes, stunts, and signature blows and it also gives different camera angles to be shown on every move. The art is quite normal and they didn’t make it a grand, a simple and fitted for the series.\\n\\n\r\nSound…\\n\\n\r\nThe sound suited well to this action series. OP song that has fast beat music and gives a thrilling excitement. ED song that gives a soothing and melodic music that points a change of view to the series. BG music/sounds adds a great effect through the fighting, emotional and funny scenes.\\n\\n\r\nCharacters…\\n\\n\r\nIrritating, balanced and appealing. This is what the characters do in the anime, they give such appealing formation or stance, but in the other part they also give an irritating and disappointing effects throughout the show. So in the end it gives just a balanced mood on the entire series that never changes up to the end. It’s quite disappointing in my part.\\n\\n\r\nEnjoyment…\\n\\n\r\nThe enjoyment will define as “animation vs monologue”, “story vs characters”. In this cases you may find out in the series that either of the definition will have a contrast to each other, so when it happened it would turn out to be a problem as you continue on watching it. It has a high-low features that will sometimes give you annoyance or enjoyment.\\n\\n\r\nOverall…\\n\\n\r\nEven though it has an ups feature on the series, it also have a down feature that pulls the excitement out of it. A balanced mood will show up throughout the series that will sometimes put you on thinking to quit on watching.",
            "date": "2009-07-03T22:05:00+00:00",
            "helpful_count": 23,
            "mal_id": 16420,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=16420"
        },
        {
            "content": "#Ring A Fing Ding Ding# \r\nor something like that so its been a while since i viewed an anime which i though deserved an honest review so lets get to it \r\nStory so in this we have 3 main protagonist 1st the high school student who thinks and is more or less cursed with a warped fate which he is trying to evade desperately while hurting others as he believes  that it will save their lives if they don't come into contact with him and i mean save them from  a gory death due to his past encounters. 2nd a working woman inher early 20s who happens to care a great deal about the high school boy I mentioned earlier to the point of sacrificing herself if necessary so basically pure an simple love. last but not least we have our third main girl protagonist who happens to be the same age as the boy protagonist but isn't exactly human but instead is a being who's job is to serve as guardians.\\n\\n\r\nI think any anime fan who has viewed a decent amount of anime already knows what happens next the girl and the boy protagonist form a pact of sort to save the protagonist's life. been there seen that before but never the less from a slow start up point this anime really jumps to an all out action anime but not in the way most anime would do major spoiler the dont read ahead\\n\r\nthe guys a wuss cry baby and he does nothing but just stadn there most of the time seeing his partner get beat up really wtf this is more like an anime where the protagonist roles are switched and even with the ending its not what you think my friend its the damned opposite of what should have happened \\n\\n\r\nart its quite descent actually its awesome my reason for rating it 9 is solely based on the story and. the animation were fluid and had been used to perfection to bring out the best in the anime from the color to the fluidity it was very nice.\\n\\n\r\nwhy people have dissed this anime hell the roles of the protagonist were switched in both the action part of the story and the ending.\\n\r\ni mean all the mainstream anime have one thing in common which is the roles are clearly decided if its an action anime guys got to do something considering he is the protagonist  instead of just waste the time standing there like a douche bag seriously man what a fail. i mean if this anime was remade and the guy was doing even half the fighting the gril did i would rate it 10/10 without a doubt i mean if want to watch anime like that i would go see queens blade or something. ok so i am going of topic here so to end it\\n\r\nhere i would recommend this anime to all anime fans as its uniqueness will drive yo either  crazy or it might just change your point of view on how to rate anime not solely based on the characters.",
            "date": "2014-03-29T13:56:00+00:00",
            "helpful_count": 19,
            "mal_id": 137749,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2152369.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Devastator004",
                "username": "Devastator004"
            },
            "url": "https://myanimelist.net/reviews.php?id=137749"
        },
        {
            "content": "EXCEEEEEEEEEEEEEEEEEEEEEEEEED!!! Kurokami will be sure to knock your socks off!\r\nKurokami is an action-packed, adventure-filled, life-changing anime. From awesome storyline to kick-ass characters ( Kuro ftw. xD ), you could never go wrong with watching Kurokami.\r\nThe audio and art effects are PURE GENIUS. Voice acting was a complete WONDER (Japanese VA). The plot twists take your breath away as the characters go through every corner of the story.\r\nIs it just me or is the fact that how the main character always goes to eats noodles funny?\r\nAnyway, Kurokami was one of my favourites and I'm sure that you'll love it too.\r\nHAPPY WATCHING!",
            "date": "2012-01-24T19:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 52485,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1113635.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lina-chan87",
                "username": "Lina-chan87"
            },
            "url": "https://myanimelist.net/reviews.php?id=52485"
        },
        {
            "content": "Kurokami is .... one of the most irritating and confusing animes I've seen so far . The reason why is that, I'll tell later.\r\nBefore continuing with the story , a few things need to be explained (that'll be important for the story). People and Mototsumitama coexist together. Mototsumitama are people with super natural powers, and to gain even more power they need to form a contract with humans. Also, there are 3 identical copies of every human being (one root and two subs). That's the so called \"Doppeliner System\". If a subs meet his root, his live energy (aka Terra) will be sucked by theroot, causing his inevitable death and the only way for the sub to survive is to kill his root before he dies. When a both of the subs are dead, the root becomes Master Root(and has big luck) or if the sub kill the root the he becomes Minus Root(similar to Master Root). \\n\\n\\n\r\nAnd the story goes: A evil organization is trying to mass produce Master Roots (by killing their subs) in order to dominate Japan (and later, the world) by placing Master Roots in key positions in Japan. The mass production is causing unbalance in the world, which can lead to his destruction. And of course , our two main characters (Kuro and Ibuki) will be fighting against them. Just to show how evil the organization  is, their youngest Master Root, a 6-7 year old girl, can say only one fraking word: \"DELETE\". Cmon, they could at least send her to a school to lean some new words :D. \\n\\n\\n\r\nIbuki is a high school student, who's mother died in a car accident, after seen a person who looked just like her .After that he tried to avoid making new friends, scared that similar thing might also happen to them too.\\n\r\nKuro is a Mototsumitama who came from the Holy Lands (where her Mototsumitama clan live)  to get revenge against his brother for killing most of her clan and her mother. \\n\r\nBy some circumstances , Kuro and Ibuki meet, make a contract and start fighting against the evil.\\n\\n\\n\r\nMost of the characters (especially the main one) are really annoying. Ibuki is the kind of person who can't stop talking nonsense, especially in the beginning, when he's always arguing and reconciling with Kuro. Also the enemies are pretty stupid. I mean, if you are fight against a stronger opponent, it's logical to attack the weaker one (the human) and not the stronger (mototsumitama), especially because if U defeat the human, the mototsumitama will lose most of his/her powers (since his/her contractee is beaten). But no, they always attack the mototsumitama, and usually lose.\\n\\n\\n\r\nThe animation is solid, nothing to complain about. Since there are many, many fights, you will see many special effects, which is the best part of this anime. The sound is pretty good, especially during the fights, except for one song that really annoyed me . The OP and ED were good too.\\n\\n\\n\r\nSo in the end.. the reason why this anime is confusing and annoying:\\n\r\n- Confusing , because you never know who the main enemy is. Every time, after they defeat the main enemy , a new, even \"greater\", appears. And after that, another one. So till the end you don't know who the main opponent is. And not to say, that one of their greatest enemy becomes their ally....\\n\r\n- Irritating, because of the main characters. I really hate when people talk too much during fights. Also, the battle system is weird. The Mototsumitama, is the only one fighting, while all the human can do is to support her. But the main thing that annoyed me, is that the \"Doppeliner System\" rules does not apply to the main characters. In one scene, Ibuki meets his root, so he had two options: To have his Terra sucked up by hist root and die, or to kill him and become Minus Root. But I guess I forgot the third option: The miracle. And of course, he didn't die (nor did the root), and everyone was saved by this \"miracle\".  \\n\\n\\n\r\nI gave this anime 6/10, because of the many annoying things I explained before. But if you are only interested in fights (which this anime has plenty) and you don't mind the annoying talks of Ibuki, you might even like this anime. Unfortunately I'm not that kind of person. \\n",
            "date": "2009-08-05T04:56:00+00:00",
            "helpful_count": 9,
            "mal_id": 17503,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67642.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gravedigger",
                "username": "gravedigger"
            },
            "url": "https://myanimelist.net/reviews.php?id=17503"
        },
        {
            "content": "Speaking from episode 16,  i felt that this anime needed another perspective. \r\nWhat I Like:\r\nI like the entire \"Partner\" ideal, and how the characters develop as the story goes along. It is similar to other anime such as  Shakugan no Shana, Fate Stay Night, and Pandora Hearts, but it has own originality,  suspense, fighting, and story.\r\nWhat i dislike:\r\nIt has some overused anime cliche's when dealing with the romance, and the  \"Weak guy\" + \"Awesome girl\" setup similar to the anime i listed above.(I wouldn't mind the character setup  as much, as long as the weak guy learns to fight aswell).\\n\\n\r\n-----Review Ratings-----\\n\\n\r\nStory: 9\\n\r\nIt deserves a 9 because there are some points that entirely focus on fighting, instead of character development, and although the character development isn't effected in this manor, it still takes away from the story.\\n\r\nArt:10 \\n\r\nThe first episode i watched seemed a little fast paced, but the camera angles, and art styles were beautiful. On occasion, Kuro will make an unrealistic face, but its so rare, that its barely worth mentioning.\\n\r\nSound: 8\\n\r\nThe music is there. It picks up before a fight, and calms down before any sort of disagreement or slightly romantic scene, it is very well mixed into the anime where i don't suddenly jump out and notice that the music is distracting, or is \"off\" in any way, but its not an entirely epic soundtrack.\\n\r\nCharacter:9\\n\r\nI love some of the new anime stereotypes I've been noticing, and the anime has a similar character development style to others I've been watching recently but  the villains so far are awesome, Twists on the \" seemingly good guy slaughtering his clan\" and the \"Good guy turned bad\"\\n\r\nEnjoyment:10\\n\r\nThis show kept me on the edge of my seat the entire time. Its a little predictable, but it keeps my mind moving from subject to subject, always keeping me thinking about what is going to happen next.\\n\r\nOverall:46/50\\n\r\nIts an great series to watch, especially if you liked other similar series, or if you are just looking for something interesting.",
            "date": "2010-09-27T00:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 30841,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/303241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hysvear",
                "username": "Hysvear"
            },
            "url": "https://myanimelist.net/reviews.php?id=30841"
        },
        {
            "content": "the story line of kurokami for me is simply beautifully written and animated. it epic  and those who liked fate stay night might enjoy watching kurokami as they show some similarities about the character protagonist. also a contract is form between  human and super being but in kurokami not with a Ancient Champion but a super Race.\r\nat first the story may seems slow but its worth the wait. As to me the sequence of the story being told was simply heighten my curiosity in proceeding to the next episodes.",
            "date": "2012-06-05T05:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 62715,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sashimee-kenna",
                "username": "sashimee-kenna"
            },
            "url": "https://myanimelist.net/reviews.php?id=62715"
        },
        {
            "content": "this is my first time to write a review of an anime and i didn't know why i picked kuro kami. so where should i start? hmm.. basically, kuro kami is about someone who was brave enough to change their fate. this was the story of ibuki keita who tried to be indifferent to the people around him because he thinks that he could affect their fates which lead them to death. until he met kuro.. a mototsumitama. he then became aware of 'doppeliners' (doppelgangers) and 'terra' (could be explained as energy or ki in simple terms). at the verge of his death, kuro madea 'contract' with him. and that's where the story begins. he became known to certain things that he couldn't believe exists. of the doppleliners' main roots and substitutes. of the mototsumitama and their 'contractees'. and the probable reason why his mother was accidentally killed on his childhood.\\n\\n\r\nstory: 8/10\\n\r\ni will not say that this is not a typical anime because there are some which had the same/similar plotting (but of course with different story lines and characters). but the story is quite good and enjoyable. there were some mysteries and revelations that you have to discover though if you are a hardcore anime fan, you could probably predict some.\\n\\n\r\ncharacters: 7/10\\n\r\ncharacters are average. even though i could say that kuro is one of the coolest heroines out there. though she could be compared and/or similar to some characters i've watched so far, still, she still had this uniqueness in her character. keita was a bit dragging in the beginning but nevertheless, you'll like his determination. there are other characters who made impact such as reishin (brother of kuro) with which you would totally give him a second thought as the story progresses.\\n\\n\r\noverall: 7/10\\n\r\nthe series is action-packed, has humor, drama, and unexpected revelations in the end. i don't want to say anything that could probably give someone a second thought about picking this anime, it's just that the ending actually 'broke' my heart. i just didn't expect to end it that way. the 2nd to the last episode could have been a much nicer ending even though one could say that it would be just as similar to most animes out there that ended with a cliffhanger. but at least you could just use your imagination and picked a nicer ending. that aside, kuro kami is a good pick anime fans should try watching :)",
            "date": "2009-11-14T11:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 20547,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/153319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ichirako",
                "username": "ichirako"
            },
            "url": "https://myanimelist.net/reviews.php?id=20547"
        },
        {
            "content": "I thought in the beginning this anime would be pretty good but the further I progressed into this storyline i realized that this was just another cookie-cutter program.  He dies then miraculously comes back to life multiple times.  the bad guy dies without a doube then somehow comes back to life.  this is stupid after a while.  this isn't even creative at this point.  It's a paycheck.  I'm only watching this one now because I've come so far in the story I want to see what the stupid ending is.  I've seen a lost of anime at thispoint in my life, more than what I've posted here.  I can say that this is one of the biggest disappointments that I've come across.  It's too overwhelmingily cliche.  The back and forth is so predictable.  I could support the claim that many storylines in anime have been done therefore new ideas are few but this is so cookie-cuter that I can't seem to muster the energy to support it.  Hopefully true anime fans will feel the same way about this.  I can't believe that I'm all alone here.",
            "date": "2009-06-06T23:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 15547,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rusty400",
                "username": "rusty400"
            },
            "url": "https://myanimelist.net/reviews.php?id=15547"
        },
        {
            "content": "The story of Kurokami revolves around our two central protagonists on a journey to exact revenge on the antagonist, so basically at the start Kuro creates a pact with Keita and they search out Kuro's brother who committed a crime in 'there world.' The show introduces the Doppeliner System, the basis behind it is that there are three of 'you' out there in the world and if you happen to have eye contact with one of them you will die (unless your the root.) Its a different take on a Doppelgänger which has been popular in fiction. \r\nI found with this show there was barelyany breather episodes or fillers as you were in the last half of the show, it's very action packed including a lot of battles where we get to see a wide variety of super powers being used, i really liked how each person had there own ability.\\n\\n\r\nThe art for this show is decent, the backgrounds were all well drawn and a lot of detail was put into them, the character designs were cool, and the lighting effects on Kuro's head was neat. As i said previously the different abilities were all great to see, they were well drawn and animated, the fight scenes were what stood out for me, they were highly detailed and extremly fun to watch.\\n\\n\r\nVoice acting was up to a decent standard, i watched the dub and only a few of the original Japanese, all the voices fit there respected characters and we got a few unknown or actors some or most may not of heard of, Wil Wheaton even has a semi big role. The openings were fun and were pretty good rock songs to kick off the show.\\n\\n\\n\r\nOverall if you enjoy martial art based super power Anime then this is definitely worth checking out, fast pace to keep you wanting more, dark atmosphere to add to the grittyness of each battle and the struggles, characters that are cute and lovable to characters to want to see get there ass kicked. This show does have it's flaws, i haven't ripped about them here because i find it hard to talk about them, i know there there it just hard to put into words, i do say the good points do out way the bad points though.",
            "date": "2010-10-12T16:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 31302,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/265292.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NoblesseOblige3",
                "username": "NoblesseOblige3"
            },
            "url": "https://myanimelist.net/reviews.php?id=31302"
        },
        {
            "content": "This anime sure have a great impact on how the world have three same face but share different fate. It have an original way on how to use this doppeliner system to create the story. The revenge on the person they love is typical in many anime so this a bit suspense type anime.\r\nThe story line is normal where the hero die at first and then revive back by the heroin and help her in the quest. The best part of this anime is they use a syncro and contract to increase the power.\r\nAbout the character, there is nothing special. it just the same asmany recent action anime.\\n\\n\r\nThe sountrack of this anime is good especially the ending by Yousei Teikoku.",
            "date": "2009-07-28T01:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 17196,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/164930.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kuruma_Natsu",
                "username": "Kuruma_Natsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=17196"
        },
        {
            "content": "This review contain minor spoilers.\r\nStory 8/10\r\nI'm not going to write much about story, because it's synopsis is easy to find. Story revolves around Ibuki Keita, school boy, who lost his mother when he was very young.Then he decided to alienate himself from the people. Of course after a certain point in the story he is going to change, but nevermind that. \r\nOverall story is enjoyable, but much worse than in it's manga counterpart.And it's biggest flaw is ending,but i'm going to return to this topic later.\r\nArt 10/10\r\nKurokami biggest advantage is surely art style.\r\nBackground is detailed, characters are well designed. Fight scenes are mind blowing -it's short anime, but battle scenes can be compared to long running and well recieved series, like DB,Bleach or Naruto. Choreography is simply amazing.\\n\r\nSound 8/10\\n\r\nVoice acting was done well, with some small exceptions (I'm talking about you Keita). Music is great, rock fits well to this battle shounen and reminds me a little of Persona series.\\n\r\nCharacters 8/10\\n\r\nKeita character was changed heavily in comparission to hes manga counterpart and it made him unlikable.  Akane was reminding me of Orihime from Bleach series and almost made me to throw up and drop whole series. On the other hand Kuro is one of the coolest heroines in the manga/anime industry ever.\\n\r\nOverall 5/10\\n\r\nWhy score is so low? Because of ENDING which left me feeling empty and depressed.*SPOILER* Keita turned out to be a big jerk, Orihime ver.0.9 was alive and happy,Kuro got screwed and whole effort to save her was in vain(in my opinion of course)*/SPOILER*\\n\r\nI'm hoping for reebot of the series, maybe Kurokami Brotherhood ;).\\n\r\nBut for now i'm not goind to reccomend this anime - it's whole potential was wasted by last 3 episodes.",
            "date": "2013-12-15T08:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 123933,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2007578.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sidholun",
                "username": "Sidholun"
            },
            "url": "https://myanimelist.net/reviews.php?id=123933"
        },
        {
            "content": "Kurokami is one of those many animes that would have done a lot better had it been given more episodes. For the depth of the story that is told, I would say about 75 episodes are needed. As it is, the series stands very well by itself.\r\nThe show takes place in a world in which there are three of every person- a Root and two Subs. The Doppeliner System favors the Roots, in that they have the majority of the luck in life. If a Sub were ever to meet their corresponding Sub or Root, that person would die. People called Mototsumita are charged withmaintaining the balance of the system in the world and as the show begins, the system is being subverted by a famous corporation for its own ends.\\n\\n\r\nThere are two protagonists- Keita (male) and Kuro (female). Kuro was born to be a princess of her land, but she begins the story by wandering the streets of Tokyo. The reasons for this are explained later in the story.\\n\\n\r\nThe show mainly revolves around the two heroes' relationship together and their deepening connection through a series of conflicts. There are support characters in the story, but these aren't given enough time to realize their full potential. Because of this, the other Mototsumita showing up to support Kuro often seem like random people. This is literally a series that could have become a popular shounen work with 400+ episodes to its credit had the creators expanded on what was already there. 23 episodes isn't that bad, but the story's advancements often seem to come out of left field and the plot twists lose their meaning because enough time wasn't given to establish the meaning of the development to all the characters involved.\\n\\n\r\nNevertheless, Kurokami remains a good show. It's a show about two people doing their best to fight against the destiny they were given and the ways in which they overcome the rules society put in place to restrict their lives. In many ways, it's a philosophical progression of Japanese morals which began by saying that people had to work inside the system they were given to now determining the ways in which they want to the system to affect them. If anything, Kurokami is a sure indication that Japanese thought is becoming steadily more individualistic.",
            "date": "2011-01-10T09:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 33620,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429809.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/damagegirl",
                "username": "damagegirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=33620"
        },
        {
            "content": "I've seen 9 episodes so far, but that should be enough to point out major problems with this anime. You really need to turn your brain off before watching this. The main character is unbearable since he is not acting like a normal human. As far as i can tell, the anime will continue like this: they meet the enemies->enemies kick their asses-> they power up and kick the enemies' asses->they meet stronger enemies. Major flaws: during battle why would you target a much stronger opponent when her partner is right their asking for it?  Why would you fight the enemies of your enemies,your saviors? What is the point of meeting people then talk trash rather than giving  important information? (I know... to keep the audience confuse even though the plot is so simple). The sound, esp. during fight scenes, is just bad. The art is ok, but the fight scenes don't look cool/epic at all.",
            "date": "2014-08-24T06:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 157725,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZgodKnight",
                "username": "ZgodKnight"
            },
            "url": "https://myanimelist.net/reviews.php?id=157725"
        },
        {
            "content": "I was really disappointed with Kurokami. The first 12 episodes were pretty decent, but as the anime dragged on it became harder and harder to watch.\r\nA lot of the fights don't make any real sense. The contractees are acting as a battery to the Mototsumitamas, but they are hardly ever attacked. \r\nThe characters are probably what killed it the most for me. Kuro was awesome, and by far my favorite character of the show. Keita was a lot more interesting at the beginning, but somewhere along the line he becomes so bland that I wanted to shoot him. I think that a main character death,namely Akane, would've made the show a lot more interesting.\\n\\n\r\nThe last two episodes are what really made dislike the show. For all its faults, I enjoyed the show up until that point. Maybe its because I was waiting for a death that never came, but I hated the ending.",
            "date": "2011-03-26T12:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 35373,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TauntingBeat",
                "username": "TauntingBeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=35373"
        },
        {
            "content": "What can i say the doppeliner system was the first thing that kept me interested. The art style was superb. It reminded me of Dark than Black and Shakugan no Shana, which were excellent animes fyi :). The opening sympathizer also became one of my favorites.  There were some twists that I couldn't predict, but it was effective when it occurred.  These twists really rekindled my interest (when i was starting to lose interest in the middle >_>) in the anime in a big way.  The only beef i had with this anime was the repetitive battles and transformations. \r\n(i am basingmy review purely on the anime)\\n\r\nI have read the manga and although it is entirely different you should not shy away from this series.",
            "date": "2009-06-25T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 16126,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Diazt3r",
                "username": "Diazt3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=16126"
        },
        {
            "content": "WHY YOU SHOULD WATCH THIS: First and foremost, for the action scenes. The fights consist primarily of well-choreographed hand-to-hand, with the flashy special attacks mixed in rather than dominant. Coupled with the two-on-two setup, this makes for plenty of exciting battles. Clearly this is Kurokami's strong point, enhanced by strong animation and the rock-style soundtrack. Also, though none of the characters could claim to be deep or complex, the main pair is a refreshing change from the contract mold. Kuro is not a seasoned vet, but rather wet-behind-the-ears with only her training to go on. And though Keita does threaten to be a typical whinymale lead at first, before long he comes to fully embrace his role, including (gasp) actually being useful in battle. \\n\\n\r\nCONCERNS: The plot, while not bad per se, is fairly unspectacular. The \"doppeliner system\" turns out to be little more than a gimmick, and most of the developments can be seen a mile away. It does do its job in allowing for plenty of fights though, and unlike many manga-based series Kurokami comes to a full conclusion. Besides that, I'd be remiss not to warn that battles usually start out with unbelievably cheesy \"synchro\" sequences, straight out of a mahou shoujo or super sentai show. Not really a big deal, but it will irk some people.\\n\\n\r\nPSA: There is often relevant content after the end credits of each episode, so be sure to watch for it. I found myself feeling a bit lost at the start of each ep until I figured that out.\\n\\n\r\nSUMMARY: I like to say that all an action series needs to be good entertainment is strong animation, music, and fight scenes. Kurokami is certainly a success on that front, and the plot and characters are just decent enough to keep from dragging down... And lastly, ending is FAIR...",
            "date": "2013-10-17T09:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 117171,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=117171"
        },
        {
            "content": "This is my first review here, so please bear with me!\r\nKurokami is about \"Kuro\", a mototsumitama and her human contractee Keita. They journey together to Okinawa to defeat Kuro's brother who abusing the dopperliner system. This system means that in the world there are 3 copies of the same person. If you see your doppelganger you will die. It gets a tad more complicated but I wouldn't want to ruin the story for you guys so ill stop there!\r\n--Story--\r\nI found the story really unique and interesting. There is one thing Kuro and Keita wish to do during the entire series, their main goal is todefeat Kuro's brother Reishin. There is also a rather big side story relating to the K-on mart who also wish to take advantage of the doppeliner system. Series 1 has less of a story than series 2, it is much slower and gets you to know some of the characters. Series 2 is where most of the action is and where the plot really comes together and has you on the edge of your seat.\\n\\n\r\n--Art--\\n\r\nThe fighting scenes have to be mentioned here - I found them so well choreographed and they were very fun to watch. The art in Kurokami is beautiful, everything is very clear and vibrant. We also see those big cute faces especially Kuro's when she is eating Ramen! :3\\n\\n\r\n--Sound--\\n\r\nThis was not bad at all - the opening and closing for scene for series 1 was a little boring for me but I loved the opening to series 2 as well as the music the fights were choreographed to in series 2! Guitars are pretty heavy in a lot of the music in Kurokami.\\n\\n\r\n--Character--\\n\r\nCharacter development for Kuro was fab, you really connect with her she's just so cute. In the first episode you see her eating Ramen with her big mouth and shes just so happy. It's hard to believe that she's a tough cookie when you see her like that. Throughout the series you learned more and more about where she has come from and why she is in Tokyo, why did she choose Keita to be her contractee? Why does she want to kill her brother? There are flashbacks as well as her own explanations. Unfortunately the same cannot be said for her contractee Keita. I felt that this anime made him look useless. He would hang back in fights and you didn't get to see his fighting spirit until quite a few episodes in. This series does not do a very good job of explain Keita's background. \\n\r\nOther characters join in here and there, Steiner and Exel were my favourite background characters, they are a very powerful pair from Germany. You'll also meet another motosumitama from Kuro's clan who wants to help her to defeat her brother as well as another who wants to kill Reishin for revenge. I'll leave it at that :3\\n\\n\r\n--Enjoyment--\\n\r\nAt first I was disappointment with this anime - there was a lot of stuff thrown in that didn't make a whole lot of sense. After finishing series 1 I was almost ready to drop it but I'm really glad I didn't as season 2 was much better.\\n\\n\r\n--Overall--\\n\r\nIf you like anime where there is lots of action and fighting then you will like this - there is a fight almost every episode and they are long. I can't say its the best plot ever because its not, its not the best anime out there but I would definitely give it a try! :3",
            "date": "2012-01-25T06:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 52517,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/998769.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/moon_jammer",
                "username": "moon_jammer"
            },
            "url": "https://myanimelist.net/reviews.php?id=52517"
        },
        {
            "content": "So this anime is actually better then what I was expecting. The animation reminded me of One Punch Man specifically the fighting scenes wich surprised me, because the main reason I watched this was cause I watched a tiny clip on youtube. Like all the animes I watch that have been out for awhile. The story sparked my interest in the beggining and then the theme of Doppelganger and the psychological factor as well when people died out of nowhere turns a bit emotional and makes you a little sentimental towards our MC (cause literally everyone one around him just dies out of nowhere).\r\nDont knowif this consideres a Psychological Anime but it scared me of the though of one of the characters I started to like or actually like suddently died. Luckly for me no one died that fits that category except the little kid in the first episodes made me feel sad. But they kinda dont die but I wont spoil that much besides that I just mentioned just now.\\n\\n\r\nNote: Not a fan of Psychological anime dont know if this is considered one but I started watching just cause I saw a clip on youtube and was going in blind. Also has a bit of plot twists like any Psychological anime\\n\\n\r\nBut onto to the point of this review:\\n\\n\r\n- Do I recommends it? Yes\\n\r\n- Is it good? Good animation (fighting scenes), Soundtrack is surprisingly good, Story never been good to judge that but I think its interesting, Characters those that I like dont die so everyone else to me is irrelevant.",
            "date": "2017-12-08T09:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 264764,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911515.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Slivko",
                "username": "Slivko"
            },
            "url": "https://myanimelist.net/reviews.php?id=264764"
        }
    ],
    [
        {
            "content": "I \"love\" it when an anime tries to ask deeply philosophical and ethical questions, only to answer them with fists, feet, and super powers. Personally I find it annoying when characters claim that they can overcome things like God, Fate, Destiny, Karma, etc, with nothing more than willpower and a kickass partner (since the main character so often is a complete novice in combat, or has no redeeming qualities whatsoever).\r\nEnter then Kurokami, as a shining example of these things at work.\r\nNow, when I started watching this I had no idea that Kurokami was originally a manga Sung-Woo Park (illustrator), and Dal-Young Im (story), and tosay that the anime and manga are like chalk and cheese would be an understatement. \\n\\n\r\nThe story in the anime version centres around Ibuki Keita, a highschool student with a very similar isolationist attitude to Ikari Shinji from NGE. The reason for this is that, for no apparent reason, everyone around him seems to die. One evening he meets a young girl named Kuro, and it is from her that he learns the true nature of the world.\\n\\n\r\nI'll stop there as the story is quick to hit its stride, however I have some big issues with the plot on the whole, the first issue being why Keita, who in the manga is a 19 year old games programmer, is suddenly a high school student in the anime. Now, many of you may think this isn't a problem, but in actuality it causes a major incosistency in the flow of the story and the development of the characters.The plot for the manga has been written with Keita as a 19 year old who is working. This means that many of the thoughts, feelings and actions he takes in the story are based on the fact that he has already completed high school and is effectively an adult. The anime, on the other hand, portrays Keita as a teenager, a \"child\" so to speak. The reason for this change is purely a marketing issue. The producers wanted this series to appeal to a teenage fan base, in paritcular the fans of shows like Shakugan no Shana, Zero no Tsukaima, Fate/Stay Night, etc. \\n\\n\r\nImagine for a second the difference in your own thought processes over over a two year period, in particular, the difference in how you perceived the world, and more importantly, how you reacted to it. Beginning to see what I mean? The plot for the anime stays true to the manga for the most part when, in truth, it should have been rewritten completely.\\n\\n\r\nAnother big change is the fact that the manga involves transplanting an arm. The whole idea of transplanting hearts was, again, purely a marketing strategy. That change was made so that it would appeal to a more \"romantic\" audience, something which the anime could have done without.\\n\\n\r\nBoth changes (and they're unfotunately not the only ones), have severely damaged the flow of the plot and the development of Keita and Kuro as characters. The original concept was very good, and if they'd stuck to it instead of pandering to the audience in an effort to cash in on the Shana/Louise/Sabre franchise, then it would have been a much better show. \\n\\n\r\nAnimation is another issue I have with this series. Overall its not too bad, but Sunrise and Bandai really didn't seem to put any effort into this show on the whole. The animation is often jerky and confusing, especially during the action sequences. The studio has tried to make the show look \"cool\", with the proviso that this be done at the lowest cost possible. There's naked character transformation scenes in the style of the mahou shoujo genre, overblown, overpowered special moves with silly names in the style of Bleach et al, strange character actions (like running, eating, etc), and an overall sense that the animators really couldn't be bothered to get their fingers out. \\n\\n\r\nThe art for the backdrops is actually pretty decent on the whole, and is the main reason why I scored the art as mediocre instead of bad. Unfortunately, these backgrounds don't have the same kind of vitality to them that can be found in other shows, and are often there so that one of the characters can be sent crashing through it with a punch.\\n\\n\r\nThe characters have been designed along the lines of the manga, so no real issues there. I just wish they'd put more effort into the overall work though.\\n\\n\r\nAs far as the sound goes, the only reason I didn't give this area a good rating is because of the cumulatively annoying OP and ED, and the change of OP midway through the series only compounded this.\\n\\n\r\nThe rest of the music throughout the series can is generally okay, however there are points where the music and mood don't match. The voice actors are on the capable side, but once again there doesn't seem to be any real effort involved in their portrayals as the acting is sometimes very wooden.\\n\\n\r\nThe characters are, again, pretty decent on the whole. There isn't any real development that goes on with any of them barring the two main characters, and any changes in the persona of the sub characters tends to happen off-screen. As for Keitaand Kuro, the fact that Sunrise and Bandai's marketing teams got involved with production means that there's some annoyingly inconsistent threads running through their development, Keita's relationship with Akane being an example of this.\\n\\n\r\nThis is an odd anime. It's clearly influenced by the likes of Fate/Stay Night and Shakugan no Shana, as well as Bleach and DBZ (surprisingly). The confusing plot and the inconsistencies stand out so it makes suspension of disbelief more difficult. It's enjoyable in it's own way, but is still one of those \"watch once and forget\" titles that seem to be cropping up more frequently.\\n\\n\r\nOn the whole, this is not a good series, but it isn't bad either. The fact that it tried to include a complex plot with some deep philophical and ethical issues is one of it's few saving graces.",
            "date": "2009-09-16T21:41:00+00:00",
            "helpful_count": 300,
            "mal_id": 18869,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=18869"
        },
        {
            "content": "\"Can you change a destiny that has already been written for you?\"\r\nEnter \"Kurokami\", a series that shows the struggle of two individuals, as they attempt to change their own path that others say can not be changed.\r\nStory: 7/10\r\nThe center of the plot revolves around \"the Dopleliner System\". What this means is there exists three versions of the same person (2 subs and 1 root). Should any one of these three come in plain sight of the other, they will perish, and only the root will live, and thus will consume the energy force of them known as tera. Our main heroes are Kuro (a TeraGuardian trying to stop the Doppleliner system and defeat her brother) and Keita (an ordinary boy who unwillingly ends up becoming her partner). What interested me the most about the anime, is the way that the actual battles take place. It almost feels like you are watching a more mature version of Pokemon at times. Each Tera Guardian can form a pack with a human, and thus use their power in conjunction with their own. So fights take place with the two helping each other--ie: the Tera Guardian fights, and the humans remain on the sidelines channeling their powers to their partner. The fighting scenes are also quite good, because despite the characters featuring \"power/energy\" moves, the fighting scenes themselves feel very street brawling oriented, and stylized. It overall does a good job of mixing the super powers with more authentic looking moves. Now regarding the way the actual storyline progresses, here is where I feel Kurokami tends to miss the mark. There are enough plot threads going on, and many of them do evolve throughout the series. However, they end up happening few and far between. A lot of episodes play the role of fillers, and some fight scenes that take place seem unnecessary. This can make the plot a bit tedious to follow, as it can sometimes take many episodes for something simple to be made clear. Still, making your way through the anime just to see the last few episodes really makes things worth while, as the final episodes are exciting and fast paced, though I did find it a bit odd that episode 23 ends up being a re-cap of all the others, but through a slightly different perspective. Where this anime really shines through is with its actual ending. Everything concludes nicely, and feels very satisfying at the end. And some events even end up being a bit unexpected. As a whole the story is good, there is plenty of action and plot twists to keep things exciting. But due to the storyline tending to drag on, does hinder it as a whole, but nothing too drastic.\\n\\n\r\nAs far as offensive material goes, Kurokami does have a few scenes which contain gory elements where blood spurts and/or is smeared on the ground. These scenes don't happen very frequently, in fact only the first few episodes really have them, with it only happening occasionally after that. Some battles even end with little to no blood spilled at all. \\n\\n\r\nArt: 8/10\\n\r\nThe arts style to this is dark and moody, but not really in a creepy kind of way. The backgrounds come off pretty well detailed, with nice looking city designs and foliage areas. Even so, the overall color schemes tend to make the series look a bit washed out. The character design is good, all of them are well proportioned and have a good sense of style to each one of the cast. The super moves (also known as \"Exceeds\") are flashy and colorful, with each character’s move set differing from one another. The fight scenes are by far the best part in the animation. Character moves are animated smoothly, with every punch and kick shown off with just the right amount of impact.\\n\\n\r\nSound: 6/10\\n\r\nFor me this was the weakest point in the series. The voice acting in both the English and Japanese version is very well done, I still feel the Japanese audio is better by far in the long run. However, a majority of the soundtrack seems to favor one style of genre in music...rock! The opening and ending themes change twice through out the series. The opening animations both play rock style music tracks, while the ending theme (surprisingly) plays soft lite hearted melodies sung by Yousei Teikoku. The background music it plays also consists of rock music. I can see where they are going with this, and while I don’t care for heavy rock music, I can at least appreciate it for this anime. If you like this type of genre in music then you will love the soundtrack, but if you’re like me and don’t care for it, then you will most likely turn the volume down during some of the scenes.\\n\\n\r\nCharacters: 7/10\\n\r\nThe characters are hit and miss. I will go on record of saying that Kuro is one of the coolest female heroines to come along in an anime as of late. She has a sweet and funny personality, yet holds back a lot of sorrow in here life--she is quite the layered individual. Of all the characters in the series, Keita is probably going to be the one that is hardest to tolerate...especially during the beginning. He tends to complain a lot, and is unwilling to help anyone towards the beginning, and will most likely annoy many viewers. To his credit though, he does end up changing as the story progresses, and at least becomes more tolerable in the end. The supporting cast is also the same, some characters such as Excel, Reishin and Daichi do a good job off adding to the storyline. However, there are a number of supporting characters that just don’t make the cut. Many of them don’t really seem to have much impact on what is going on, and thus make some feel unnecessary to the storyline. They’re not a bad cast by any means, some of them just don’t seem to have a staple purpose in the anime. As a whole though, the main characters themselves do end up doing their parts well for the stories’ purpose, and in that regards it is done right.\\n\\n\r\nOverall: 7/10\\n\r\nDespite some of its flaws, Kurokami is a good anime. If you can make it through some of the fillers, and don’t mind the story dragging on somewhat, then I think you will find this a deep enough series to check out. There is enough action and plot in this to keep both the Seinen fans and casual viewers satisfied. And as it stands, it’s a series I think anime fans should give a try.",
            "date": "2009-06-24T22:40:00+00:00",
            "helpful_count": 82,
            "mal_id": 16113,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=16113"
        },
        {
            "content": "“Power to achieve something”\r\nThe Story…\r\nIt revolves on a system that we called “Doppeliner System”. The story tells about the involvement of the three main characters, which is Kuro, Keita, and Akane. They are somewhat confused on this system and willing to find out the real main reason why this system exists, making it as an obligation as they put their life in danger or helping others to find out the cure to its existence.\r\nThe point of view here is not the twist of the story rather the main attraction here will be the action / super power scenes. It gives excitement and thrill but onthe other hand there are some minor / major problems that you may notice in it within the show. Though the twist of the story adds effects for the whole series, it’s quite ineffective in such a way that it consists of somewhat boring conversations, bad combination of action and romance, and bad flow of the events throughout the story. \\n\\n\r\nThis might be the uniqueness of it from the other anime. It comes up with a different representation of martial arts with super power. It is also the main reason why it’s been quite exciting to watch the series, nothing less and nothing more.\\n\\n\r\nArt & Animation…\\n\\n\r\nWell it might be obvious what the series will give. It emphasizes fighting scenes, stunts, and signature blows and it also gives different camera angles to be shown on every move. The art is quite normal and they didn’t make it a grand, a simple and fitted for the series.\\n\\n\r\nSound…\\n\\n\r\nThe sound suited well to this action series. OP song that has fast beat music and gives a thrilling excitement. ED song that gives a soothing and melodic music that points a change of view to the series. BG music/sounds adds a great effect through the fighting, emotional and funny scenes.\\n\\n\r\nCharacters…\\n\\n\r\nIrritating, balanced and appealing. This is what the characters do in the anime, they give such appealing formation or stance, but in the other part they also give an irritating and disappointing effects throughout the show. So in the end it gives just a balanced mood on the entire series that never changes up to the end. It’s quite disappointing in my part.\\n\\n\r\nEnjoyment…\\n\\n\r\nThe enjoyment will define as “animation vs monologue”, “story vs characters”. In this cases you may find out in the series that either of the definition will have a contrast to each other, so when it happened it would turn out to be a problem as you continue on watching it. It has a high-low features that will sometimes give you annoyance or enjoyment.\\n\\n\r\nOverall…\\n\\n\r\nEven though it has an ups feature on the series, it also have a down feature that pulls the excitement out of it. A balanced mood will show up throughout the series that will sometimes put you on thinking to quit on watching.",
            "date": "2009-07-03T22:05:00+00:00",
            "helpful_count": 23,
            "mal_id": 16420,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=16420"
        },
        {
            "content": "#Ring A Fing Ding Ding# \r\nor something like that so its been a while since i viewed an anime which i though deserved an honest review so lets get to it \r\nStory so in this we have 3 main protagonist 1st the high school student who thinks and is more or less cursed with a warped fate which he is trying to evade desperately while hurting others as he believes  that it will save their lives if they don't come into contact with him and i mean save them from  a gory death due to his past encounters. 2nd a working woman inher early 20s who happens to care a great deal about the high school boy I mentioned earlier to the point of sacrificing herself if necessary so basically pure an simple love. last but not least we have our third main girl protagonist who happens to be the same age as the boy protagonist but isn't exactly human but instead is a being who's job is to serve as guardians.\\n\\n\r\nI think any anime fan who has viewed a decent amount of anime already knows what happens next the girl and the boy protagonist form a pact of sort to save the protagonist's life. been there seen that before but never the less from a slow start up point this anime really jumps to an all out action anime but not in the way most anime would do major spoiler the dont read ahead\\n\r\nthe guys a wuss cry baby and he does nothing but just stadn there most of the time seeing his partner get beat up really wtf this is more like an anime where the protagonist roles are switched and even with the ending its not what you think my friend its the damned opposite of what should have happened \\n\\n\r\nart its quite descent actually its awesome my reason for rating it 9 is solely based on the story and. the animation were fluid and had been used to perfection to bring out the best in the anime from the color to the fluidity it was very nice.\\n\\n\r\nwhy people have dissed this anime hell the roles of the protagonist were switched in both the action part of the story and the ending.\\n\r\ni mean all the mainstream anime have one thing in common which is the roles are clearly decided if its an action anime guys got to do something considering he is the protagonist  instead of just waste the time standing there like a douche bag seriously man what a fail. i mean if this anime was remade and the guy was doing even half the fighting the gril did i would rate it 10/10 without a doubt i mean if want to watch anime like that i would go see queens blade or something. ok so i am going of topic here so to end it\\n\r\nhere i would recommend this anime to all anime fans as its uniqueness will drive yo either  crazy or it might just change your point of view on how to rate anime not solely based on the characters.",
            "date": "2014-03-29T13:56:00+00:00",
            "helpful_count": 19,
            "mal_id": 137749,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2152369.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Devastator004",
                "username": "Devastator004"
            },
            "url": "https://myanimelist.net/reviews.php?id=137749"
        },
        {
            "content": "EXCEEEEEEEEEEEEEEEEEEEEEEEEED!!! Kurokami will be sure to knock your socks off!\r\nKurokami is an action-packed, adventure-filled, life-changing anime. From awesome storyline to kick-ass characters ( Kuro ftw. xD ), you could never go wrong with watching Kurokami.\r\nThe audio and art effects are PURE GENIUS. Voice acting was a complete WONDER (Japanese VA). The plot twists take your breath away as the characters go through every corner of the story.\r\nIs it just me or is the fact that how the main character always goes to eats noodles funny?\r\nAnyway, Kurokami was one of my favourites and I'm sure that you'll love it too.\r\nHAPPY WATCHING!",
            "date": "2012-01-24T19:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 52485,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1113635.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lina-chan87",
                "username": "Lina-chan87"
            },
            "url": "https://myanimelist.net/reviews.php?id=52485"
        },
        {
            "content": "Kurokami is .... one of the most irritating and confusing animes I've seen so far . The reason why is that, I'll tell later.\r\nBefore continuing with the story , a few things need to be explained (that'll be important for the story). People and Mototsumitama coexist together. Mototsumitama are people with super natural powers, and to gain even more power they need to form a contract with humans. Also, there are 3 identical copies of every human being (one root and two subs). That's the so called \"Doppeliner System\". If a subs meet his root, his live energy (aka Terra) will be sucked by theroot, causing his inevitable death and the only way for the sub to survive is to kill his root before he dies. When a both of the subs are dead, the root becomes Master Root(and has big luck) or if the sub kill the root the he becomes Minus Root(similar to Master Root). \\n\\n\\n\r\nAnd the story goes: A evil organization is trying to mass produce Master Roots (by killing their subs) in order to dominate Japan (and later, the world) by placing Master Roots in key positions in Japan. The mass production is causing unbalance in the world, which can lead to his destruction. And of course , our two main characters (Kuro and Ibuki) will be fighting against them. Just to show how evil the organization  is, their youngest Master Root, a 6-7 year old girl, can say only one fraking word: \"DELETE\". Cmon, they could at least send her to a school to lean some new words :D. \\n\\n\\n\r\nIbuki is a high school student, who's mother died in a car accident, after seen a person who looked just like her .After that he tried to avoid making new friends, scared that similar thing might also happen to them too.\\n\r\nKuro is a Mototsumitama who came from the Holy Lands (where her Mototsumitama clan live)  to get revenge against his brother for killing most of her clan and her mother. \\n\r\nBy some circumstances , Kuro and Ibuki meet, make a contract and start fighting against the evil.\\n\\n\\n\r\nMost of the characters (especially the main one) are really annoying. Ibuki is the kind of person who can't stop talking nonsense, especially in the beginning, when he's always arguing and reconciling with Kuro. Also the enemies are pretty stupid. I mean, if you are fight against a stronger opponent, it's logical to attack the weaker one (the human) and not the stronger (mototsumitama), especially because if U defeat the human, the mototsumitama will lose most of his/her powers (since his/her contractee is beaten). But no, they always attack the mototsumitama, and usually lose.\\n\\n\\n\r\nThe animation is solid, nothing to complain about. Since there are many, many fights, you will see many special effects, which is the best part of this anime. The sound is pretty good, especially during the fights, except for one song that really annoyed me . The OP and ED were good too.\\n\\n\\n\r\nSo in the end.. the reason why this anime is confusing and annoying:\\n\r\n- Confusing , because you never know who the main enemy is. Every time, after they defeat the main enemy , a new, even \"greater\", appears. And after that, another one. So till the end you don't know who the main opponent is. And not to say, that one of their greatest enemy becomes their ally....\\n\r\n- Irritating, because of the main characters. I really hate when people talk too much during fights. Also, the battle system is weird. The Mototsumitama, is the only one fighting, while all the human can do is to support her. But the main thing that annoyed me, is that the \"Doppeliner System\" rules does not apply to the main characters. In one scene, Ibuki meets his root, so he had two options: To have his Terra sucked up by hist root and die, or to kill him and become Minus Root. But I guess I forgot the third option: The miracle. And of course, he didn't die (nor did the root), and everyone was saved by this \"miracle\".  \\n\\n\\n\r\nI gave this anime 6/10, because of the many annoying things I explained before. But if you are only interested in fights (which this anime has plenty) and you don't mind the annoying talks of Ibuki, you might even like this anime. Unfortunately I'm not that kind of person. \\n",
            "date": "2009-08-05T04:56:00+00:00",
            "helpful_count": 9,
            "mal_id": 17503,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67642.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gravedigger",
                "username": "gravedigger"
            },
            "url": "https://myanimelist.net/reviews.php?id=17503"
        },
        {
            "content": "Speaking from episode 16,  i felt that this anime needed another perspective. \r\nWhat I Like:\r\nI like the entire \"Partner\" ideal, and how the characters develop as the story goes along. It is similar to other anime such as  Shakugan no Shana, Fate Stay Night, and Pandora Hearts, but it has own originality,  suspense, fighting, and story.\r\nWhat i dislike:\r\nIt has some overused anime cliche's when dealing with the romance, and the  \"Weak guy\" + \"Awesome girl\" setup similar to the anime i listed above.(I wouldn't mind the character setup  as much, as long as the weak guy learns to fight aswell).\\n\\n\r\n-----Review Ratings-----\\n\\n\r\nStory: 9\\n\r\nIt deserves a 9 because there are some points that entirely focus on fighting, instead of character development, and although the character development isn't effected in this manor, it still takes away from the story.\\n\r\nArt:10 \\n\r\nThe first episode i watched seemed a little fast paced, but the camera angles, and art styles were beautiful. On occasion, Kuro will make an unrealistic face, but its so rare, that its barely worth mentioning.\\n\r\nSound: 8\\n\r\nThe music is there. It picks up before a fight, and calms down before any sort of disagreement or slightly romantic scene, it is very well mixed into the anime where i don't suddenly jump out and notice that the music is distracting, or is \"off\" in any way, but its not an entirely epic soundtrack.\\n\r\nCharacter:9\\n\r\nI love some of the new anime stereotypes I've been noticing, and the anime has a similar character development style to others I've been watching recently but  the villains so far are awesome, Twists on the \" seemingly good guy slaughtering his clan\" and the \"Good guy turned bad\"\\n\r\nEnjoyment:10\\n\r\nThis show kept me on the edge of my seat the entire time. Its a little predictable, but it keeps my mind moving from subject to subject, always keeping me thinking about what is going to happen next.\\n\r\nOverall:46/50\\n\r\nIts an great series to watch, especially if you liked other similar series, or if you are just looking for something interesting.",
            "date": "2010-09-27T00:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 30841,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/303241.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hysvear",
                "username": "Hysvear"
            },
            "url": "https://myanimelist.net/reviews.php?id=30841"
        },
        {
            "content": "the story line of kurokami for me is simply beautifully written and animated. it epic  and those who liked fate stay night might enjoy watching kurokami as they show some similarities about the character protagonist. also a contract is form between  human and super being but in kurokami not with a Ancient Champion but a super Race.\r\nat first the story may seems slow but its worth the wait. As to me the sequence of the story being told was simply heighten my curiosity in proceeding to the next episodes.",
            "date": "2012-06-05T05:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 62715,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sashimee-kenna",
                "username": "sashimee-kenna"
            },
            "url": "https://myanimelist.net/reviews.php?id=62715"
        },
        {
            "content": "this is my first time to write a review of an anime and i didn't know why i picked kuro kami. so where should i start? hmm.. basically, kuro kami is about someone who was brave enough to change their fate. this was the story of ibuki keita who tried to be indifferent to the people around him because he thinks that he could affect their fates which lead them to death. until he met kuro.. a mototsumitama. he then became aware of 'doppeliners' (doppelgangers) and 'terra' (could be explained as energy or ki in simple terms). at the verge of his death, kuro madea 'contract' with him. and that's where the story begins. he became known to certain things that he couldn't believe exists. of the doppleliners' main roots and substitutes. of the mototsumitama and their 'contractees'. and the probable reason why his mother was accidentally killed on his childhood.\\n\\n\r\nstory: 8/10\\n\r\ni will not say that this is not a typical anime because there are some which had the same/similar plotting (but of course with different story lines and characters). but the story is quite good and enjoyable. there were some mysteries and revelations that you have to discover though if you are a hardcore anime fan, you could probably predict some.\\n\\n\r\ncharacters: 7/10\\n\r\ncharacters are average. even though i could say that kuro is one of the coolest heroines out there. though she could be compared and/or similar to some characters i've watched so far, still, she still had this uniqueness in her character. keita was a bit dragging in the beginning but nevertheless, you'll like his determination. there are other characters who made impact such as reishin (brother of kuro) with which you would totally give him a second thought as the story progresses.\\n\\n\r\noverall: 7/10\\n\r\nthe series is action-packed, has humor, drama, and unexpected revelations in the end. i don't want to say anything that could probably give someone a second thought about picking this anime, it's just that the ending actually 'broke' my heart. i just didn't expect to end it that way. the 2nd to the last episode could have been a much nicer ending even though one could say that it would be just as similar to most animes out there that ended with a cliffhanger. but at least you could just use your imagination and picked a nicer ending. that aside, kuro kami is a good pick anime fans should try watching :)",
            "date": "2009-11-14T11:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 20547,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/153319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ichirako",
                "username": "ichirako"
            },
            "url": "https://myanimelist.net/reviews.php?id=20547"
        },
        {
            "content": "I thought in the beginning this anime would be pretty good but the further I progressed into this storyline i realized that this was just another cookie-cutter program.  He dies then miraculously comes back to life multiple times.  the bad guy dies without a doube then somehow comes back to life.  this is stupid after a while.  this isn't even creative at this point.  It's a paycheck.  I'm only watching this one now because I've come so far in the story I want to see what the stupid ending is.  I've seen a lost of anime at thispoint in my life, more than what I've posted here.  I can say that this is one of the biggest disappointments that I've come across.  It's too overwhelmingily cliche.  The back and forth is so predictable.  I could support the claim that many storylines in anime have been done therefore new ideas are few but this is so cookie-cuter that I can't seem to muster the energy to support it.  Hopefully true anime fans will feel the same way about this.  I can't believe that I'm all alone here.",
            "date": "2009-06-06T23:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 15547,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rusty400",
                "username": "rusty400"
            },
            "url": "https://myanimelist.net/reviews.php?id=15547"
        },
        {
            "content": "The story of Kurokami revolves around our two central protagonists on a journey to exact revenge on the antagonist, so basically at the start Kuro creates a pact with Keita and they search out Kuro's brother who committed a crime in 'there world.' The show introduces the Doppeliner System, the basis behind it is that there are three of 'you' out there in the world and if you happen to have eye contact with one of them you will die (unless your the root.) Its a different take on a Doppelgänger which has been popular in fiction. \r\nI found with this show there was barelyany breather episodes or fillers as you were in the last half of the show, it's very action packed including a lot of battles where we get to see a wide variety of super powers being used, i really liked how each person had there own ability.\\n\\n\r\nThe art for this show is decent, the backgrounds were all well drawn and a lot of detail was put into them, the character designs were cool, and the lighting effects on Kuro's head was neat. As i said previously the different abilities were all great to see, they were well drawn and animated, the fight scenes were what stood out for me, they were highly detailed and extremly fun to watch.\\n\\n\r\nVoice acting was up to a decent standard, i watched the dub and only a few of the original Japanese, all the voices fit there respected characters and we got a few unknown or actors some or most may not of heard of, Wil Wheaton even has a semi big role. The openings were fun and were pretty good rock songs to kick off the show.\\n\\n\\n\r\nOverall if you enjoy martial art based super power Anime then this is definitely worth checking out, fast pace to keep you wanting more, dark atmosphere to add to the grittyness of each battle and the struggles, characters that are cute and lovable to characters to want to see get there ass kicked. This show does have it's flaws, i haven't ripped about them here because i find it hard to talk about them, i know there there it just hard to put into words, i do say the good points do out way the bad points though.",
            "date": "2010-10-12T16:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 31302,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/265292.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NoblesseOblige3",
                "username": "NoblesseOblige3"
            },
            "url": "https://myanimelist.net/reviews.php?id=31302"
        },
        {
            "content": "This anime sure have a great impact on how the world have three same face but share different fate. It have an original way on how to use this doppeliner system to create the story. The revenge on the person they love is typical in many anime so this a bit suspense type anime.\r\nThe story line is normal where the hero die at first and then revive back by the heroin and help her in the quest. The best part of this anime is they use a syncro and contract to increase the power.\r\nAbout the character, there is nothing special. it just the same asmany recent action anime.\\n\\n\r\nThe sountrack of this anime is good especially the ending by Yousei Teikoku.",
            "date": "2009-07-28T01:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 17196,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/164930.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kuruma_Natsu",
                "username": "Kuruma_Natsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=17196"
        },
        {
            "content": "This review contain minor spoilers.\r\nStory 8/10\r\nI'm not going to write much about story, because it's synopsis is easy to find. Story revolves around Ibuki Keita, school boy, who lost his mother when he was very young.Then he decided to alienate himself from the people. Of course after a certain point in the story he is going to change, but nevermind that. \r\nOverall story is enjoyable, but much worse than in it's manga counterpart.And it's biggest flaw is ending,but i'm going to return to this topic later.\r\nArt 10/10\r\nKurokami biggest advantage is surely art style.\r\nBackground is detailed, characters are well designed. Fight scenes are mind blowing -it's short anime, but battle scenes can be compared to long running and well recieved series, like DB,Bleach or Naruto. Choreography is simply amazing.\\n\r\nSound 8/10\\n\r\nVoice acting was done well, with some small exceptions (I'm talking about you Keita). Music is great, rock fits well to this battle shounen and reminds me a little of Persona series.\\n\r\nCharacters 8/10\\n\r\nKeita character was changed heavily in comparission to hes manga counterpart and it made him unlikable.  Akane was reminding me of Orihime from Bleach series and almost made me to throw up and drop whole series. On the other hand Kuro is one of the coolest heroines in the manga/anime industry ever.\\n\r\nOverall 5/10\\n\r\nWhy score is so low? Because of ENDING which left me feeling empty and depressed.*SPOILER* Keita turned out to be a big jerk, Orihime ver.0.9 was alive and happy,Kuro got screwed and whole effort to save her was in vain(in my opinion of course)*/SPOILER*\\n\r\nI'm hoping for reebot of the series, maybe Kurokami Brotherhood ;).\\n\r\nBut for now i'm not goind to reccomend this anime - it's whole potential was wasted by last 3 episodes.",
            "date": "2013-12-15T08:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 123933,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2007578.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sidholun",
                "username": "Sidholun"
            },
            "url": "https://myanimelist.net/reviews.php?id=123933"
        },
        {
            "content": "Kurokami is one of those many animes that would have done a lot better had it been given more episodes. For the depth of the story that is told, I would say about 75 episodes are needed. As it is, the series stands very well by itself.\r\nThe show takes place in a world in which there are three of every person- a Root and two Subs. The Doppeliner System favors the Roots, in that they have the majority of the luck in life. If a Sub were ever to meet their corresponding Sub or Root, that person would die. People called Mototsumita are charged withmaintaining the balance of the system in the world and as the show begins, the system is being subverted by a famous corporation for its own ends.\\n\\n\r\nThere are two protagonists- Keita (male) and Kuro (female). Kuro was born to be a princess of her land, but she begins the story by wandering the streets of Tokyo. The reasons for this are explained later in the story.\\n\\n\r\nThe show mainly revolves around the two heroes' relationship together and their deepening connection through a series of conflicts. There are support characters in the story, but these aren't given enough time to realize their full potential. Because of this, the other Mototsumita showing up to support Kuro often seem like random people. This is literally a series that could have become a popular shounen work with 400+ episodes to its credit had the creators expanded on what was already there. 23 episodes isn't that bad, but the story's advancements often seem to come out of left field and the plot twists lose their meaning because enough time wasn't given to establish the meaning of the development to all the characters involved.\\n\\n\r\nNevertheless, Kurokami remains a good show. It's a show about two people doing their best to fight against the destiny they were given and the ways in which they overcome the rules society put in place to restrict their lives. In many ways, it's a philosophical progression of Japanese morals which began by saying that people had to work inside the system they were given to now determining the ways in which they want to the system to affect them. If anything, Kurokami is a sure indication that Japanese thought is becoming steadily more individualistic.",
            "date": "2011-01-10T09:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 33620,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429809.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/damagegirl",
                "username": "damagegirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=33620"
        },
        {
            "content": "I've seen 9 episodes so far, but that should be enough to point out major problems with this anime. You really need to turn your brain off before watching this. The main character is unbearable since he is not acting like a normal human. As far as i can tell, the anime will continue like this: they meet the enemies->enemies kick their asses-> they power up and kick the enemies' asses->they meet stronger enemies. Major flaws: during battle why would you target a much stronger opponent when her partner is right their asking for it?  Why would you fight the enemies of your enemies,your saviors? What is the point of meeting people then talk trash rather than giving  important information? (I know... to keep the audience confuse even though the plot is so simple). The sound, esp. during fight scenes, is just bad. The art is ok, but the fight scenes don't look cool/epic at all.",
            "date": "2014-08-24T06:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 157725,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZgodKnight",
                "username": "ZgodKnight"
            },
            "url": "https://myanimelist.net/reviews.php?id=157725"
        },
        {
            "content": "I was really disappointed with Kurokami. The first 12 episodes were pretty decent, but as the anime dragged on it became harder and harder to watch.\r\nA lot of the fights don't make any real sense. The contractees are acting as a battery to the Mototsumitamas, but they are hardly ever attacked. \r\nThe characters are probably what killed it the most for me. Kuro was awesome, and by far my favorite character of the show. Keita was a lot more interesting at the beginning, but somewhere along the line he becomes so bland that I wanted to shoot him. I think that a main character death,namely Akane, would've made the show a lot more interesting.\\n\\n\r\nThe last two episodes are what really made dislike the show. For all its faults, I enjoyed the show up until that point. Maybe its because I was waiting for a death that never came, but I hated the ending.",
            "date": "2011-03-26T12:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 35373,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TauntingBeat",
                "username": "TauntingBeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=35373"
        },
        {
            "content": "What can i say the doppeliner system was the first thing that kept me interested. The art style was superb. It reminded me of Dark than Black and Shakugan no Shana, which were excellent animes fyi :). The opening sympathizer also became one of my favorites.  There were some twists that I couldn't predict, but it was effective when it occurred.  These twists really rekindled my interest (when i was starting to lose interest in the middle >_>) in the anime in a big way.  The only beef i had with this anime was the repetitive battles and transformations. \r\n(i am basingmy review purely on the anime)\\n\r\nI have read the manga and although it is entirely different you should not shy away from this series.",
            "date": "2009-06-25T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 16126,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Diazt3r",
                "username": "Diazt3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=16126"
        },
        {
            "content": "WHY YOU SHOULD WATCH THIS: First and foremost, for the action scenes. The fights consist primarily of well-choreographed hand-to-hand, with the flashy special attacks mixed in rather than dominant. Coupled with the two-on-two setup, this makes for plenty of exciting battles. Clearly this is Kurokami's strong point, enhanced by strong animation and the rock-style soundtrack. Also, though none of the characters could claim to be deep or complex, the main pair is a refreshing change from the contract mold. Kuro is not a seasoned vet, but rather wet-behind-the-ears with only her training to go on. And though Keita does threaten to be a typical whinymale lead at first, before long he comes to fully embrace his role, including (gasp) actually being useful in battle. \\n\\n\r\nCONCERNS: The plot, while not bad per se, is fairly unspectacular. The \"doppeliner system\" turns out to be little more than a gimmick, and most of the developments can be seen a mile away. It does do its job in allowing for plenty of fights though, and unlike many manga-based series Kurokami comes to a full conclusion. Besides that, I'd be remiss not to warn that battles usually start out with unbelievably cheesy \"synchro\" sequences, straight out of a mahou shoujo or super sentai show. Not really a big deal, but it will irk some people.\\n\\n\r\nPSA: There is often relevant content after the end credits of each episode, so be sure to watch for it. I found myself feeling a bit lost at the start of each ep until I figured that out.\\n\\n\r\nSUMMARY: I like to say that all an action series needs to be good entertainment is strong animation, music, and fight scenes. Kurokami is certainly a success on that front, and the plot and characters are just decent enough to keep from dragging down... And lastly, ending is FAIR...",
            "date": "2013-10-17T09:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 117171,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=117171"
        },
        {
            "content": "This is my first review here, so please bear with me!\r\nKurokami is about \"Kuro\", a mototsumitama and her human contractee Keita. They journey together to Okinawa to defeat Kuro's brother who abusing the dopperliner system. This system means that in the world there are 3 copies of the same person. If you see your doppelganger you will die. It gets a tad more complicated but I wouldn't want to ruin the story for you guys so ill stop there!\r\n--Story--\r\nI found the story really unique and interesting. There is one thing Kuro and Keita wish to do during the entire series, their main goal is todefeat Kuro's brother Reishin. There is also a rather big side story relating to the K-on mart who also wish to take advantage of the doppeliner system. Series 1 has less of a story than series 2, it is much slower and gets you to know some of the characters. Series 2 is where most of the action is and where the plot really comes together and has you on the edge of your seat.\\n\\n\r\n--Art--\\n\r\nThe fighting scenes have to be mentioned here - I found them so well choreographed and they were very fun to watch. The art in Kurokami is beautiful, everything is very clear and vibrant. We also see those big cute faces especially Kuro's when she is eating Ramen! :3\\n\\n\r\n--Sound--\\n\r\nThis was not bad at all - the opening and closing for scene for series 1 was a little boring for me but I loved the opening to series 2 as well as the music the fights were choreographed to in series 2! Guitars are pretty heavy in a lot of the music in Kurokami.\\n\\n\r\n--Character--\\n\r\nCharacter development for Kuro was fab, you really connect with her she's just so cute. In the first episode you see her eating Ramen with her big mouth and shes just so happy. It's hard to believe that she's a tough cookie when you see her like that. Throughout the series you learned more and more about where she has come from and why she is in Tokyo, why did she choose Keita to be her contractee? Why does she want to kill her brother? There are flashbacks as well as her own explanations. Unfortunately the same cannot be said for her contractee Keita. I felt that this anime made him look useless. He would hang back in fights and you didn't get to see his fighting spirit until quite a few episodes in. This series does not do a very good job of explain Keita's background. \\n\r\nOther characters join in here and there, Steiner and Exel were my favourite background characters, they are a very powerful pair from Germany. You'll also meet another motosumitama from Kuro's clan who wants to help her to defeat her brother as well as another who wants to kill Reishin for revenge. I'll leave it at that :3\\n\\n\r\n--Enjoyment--\\n\r\nAt first I was disappointment with this anime - there was a lot of stuff thrown in that didn't make a whole lot of sense. After finishing series 1 I was almost ready to drop it but I'm really glad I didn't as season 2 was much better.\\n\\n\r\n--Overall--\\n\r\nIf you like anime where there is lots of action and fighting then you will like this - there is a fight almost every episode and they are long. I can't say its the best plot ever because its not, its not the best anime out there but I would definitely give it a try! :3",
            "date": "2012-01-25T06:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 52517,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/998769.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/moon_jammer",
                "username": "moon_jammer"
            },
            "url": "https://myanimelist.net/reviews.php?id=52517"
        },
        {
            "content": "So this anime is actually better then what I was expecting. The animation reminded me of One Punch Man specifically the fighting scenes wich surprised me, because the main reason I watched this was cause I watched a tiny clip on youtube. Like all the animes I watch that have been out for awhile. The story sparked my interest in the beggining and then the theme of Doppelganger and the psychological factor as well when people died out of nowhere turns a bit emotional and makes you a little sentimental towards our MC (cause literally everyone one around him just dies out of nowhere).\r\nDont knowif this consideres a Psychological Anime but it scared me of the though of one of the characters I started to like or actually like suddently died. Luckly for me no one died that fits that category except the little kid in the first episodes made me feel sad. But they kinda dont die but I wont spoil that much besides that I just mentioned just now.\\n\\n\r\nNote: Not a fan of Psychological anime dont know if this is considered one but I started watching just cause I saw a clip on youtube and was going in blind. Also has a bit of plot twists like any Psychological anime\\n\\n\r\nBut onto to the point of this review:\\n\\n\r\n- Do I recommends it? Yes\\n\r\n- Is it good? Good animation (fighting scenes), Soundtrack is surprisingly good, Story never been good to judge that but I think its interesting, Characters those that I like dont die so everyone else to me is irrelevant.",
            "date": "2017-12-08T09:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 264764,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911515.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Slivko",
                "username": "Slivko"
            },
            "url": "https://myanimelist.net/reviews.php?id=264764"
        }
    ],
    [
        {
            "content": "It really bugs me when a very good story is ruined for various reasons. Unfortunately Kurokami has the same problem. It had a really interesting main-concept but the plot got butchered right after te second episode. This happenns because with such a complexity that a thing like doppeliners has the story could have countless twists and turns but instead of that the writters seemed like they wanted to get everything the easiest way possible. So we have a very complicated plot that could be amazing made into a really mediocre story. I believe this was mainly because of the huge changes that the writters ofthe anime made in comparison with the manga. I haven't read the manga but i know that Keita is an adult in there and not a high school kid. Also -SPOILER ALERT- in the second episode we see Kuro replacing Keita's heart whne in the anime she replaced his hand. So as you could have probably understood the differences play a HUGE role in what  the anime is going to be like. Normally I wouldn't have a problem with that but the writters didn't manage to correspond to such a complicated story and the major changes that they did with the result the plot to be full of plot holes. As for the art well Sunrise is a good studio (it made Code Geass) but in this anime they didn't put as much effort as with their other works. Some repetitive scenes like when Kuro and Keita synchroed annoyed me pretty much.\\n\r\nThe openings and the endings were good but nothing really special. There were a couple of good OST's though. What about the characters? Well Keita is a patient of ''the Yuki Amano syndrome'' (that means that he starts off being a complete pussy). I liked that because it was more realistic and I was expecting a huge development. The development came eventually but it was so rushed and mediocre that it really disappointed me. Same goes with Kuro and almost every character of the anime especially the villains who they seemed to me really flat ad with not very powerful motives. Overall this anime was a huge disappointment to me. I couldn't enjoyed it and I certainly couldn't bring myself too love it. Seriously guys if you don't want a very good story to be butchered rigth in front of your eyes stay away from this anime.",
            "date": "2015-01-09T15:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 177093,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4161079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/femto999",
                "username": "femto999"
            },
            "url": "https://myanimelist.net/reviews.php?id=177093"
        },
        {
            "content": "to be honest, i agree with everyone on how confusing this anime was in the beginning.  I kept watching and i started understanding more of the plot of the story.  After finishing this anime, i was happy to say that this anime is actually pretty nice and good!  The story in the beginning was confusing but after watching more episodes, i knew what was going on and enjoyed the anime. This anime is good if you didnt give up like other people.  I love this anime, the ending was so sad.",
            "date": "2010-01-15T14:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 22416,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60219.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/aznmonk64",
                "username": "aznmonk64"
            },
            "url": "https://myanimelist.net/reviews.php?id=22416"
        },
        {
            "content": "Ok, first review. I saw this because it was on Crunchyroll for the iPod. Overall, Kurokami was enjoyable, especially some of the earlier hand to hand figting scenes. I'm no huge fan of those over-the-top channeling energy stuff, so that turned me off later in the story. However, it was well animated and had a cool plot twist near the end. It's fun to watch and definitely is worth your time, especially if you like action.\r\nOh and I noticed some copy pasted animations, notably the Tera moves and Synchro. That got kind of annoying, especially after many Exceeds.",
            "date": "2010-11-23T00:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 32254,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/410844.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kudoku",
                "username": "Kudoku"
            },
            "url": "https://myanimelist.net/reviews.php?id=32254"
        },
        {
            "content": "This anime pretty much consisted of war cries and the main protagonist yelling \"KURO!\" in the complete wrong pronunciation - my mistake for watching the dub. It dragged on an had no plot development whatsoever. From start to finish - or at least as far as I got before just abandoning the show all together - I was confused as to what the heck was going on. The show doesn't bother to try and slow everything down so you can fully understand what's happening, so if you plan to watch this show, pay attention. If you daze off for even a couple seconds, you couldmiss a lot due to poor explaining. \\n\\n\r\nIn a normal anime that I love, if there are 24 or less episodes I usually learn all the characters names by the end due to good character development. Well, this anime lacked that, so I pretty much only knew Keita and Kuro from all the shouting of their names during the long and mediocre fight scenes. \\n\\n\r\nThe show got an R rating because of violence, and at first I understood that because people were being brutally killed at the beginning of the show. After a while, the only \"violence\" that was going on was the Terra guardians and their contractees shooting balls of light at each other. I was super disappointed with this anime and can honestly say that it was the worst one I have ever seen. ",
            "date": "2017-02-15T19:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 240667,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240667"
        },
        {
            "content": "Kinda ironic, i had lots of chances in the past to watch kurokami.\r\nBut i was skeptical about it and mostly said \"Meh dont think its worth my time\"\r\nand maan i was so stupid saying it.\r\nWhen i finally decided to watch it,i was simply amazed the anime was fantastic and the character development is truly amazing.\r\nand throughout the anime it left me with so many questions and no answers(dont worry all your questions will be answered as you watch the anime).\r\nIf some of you watched shakugan no shana before kurokami or the opposite,You will find lots of similiarites between both of these animes,examples:\r\n-A girl with superpowers who makes some sort of a contract with a guy which bonds them together\\n\r\n-The main protagonist ends up getting dragged into something he never wanted to\\n\r\nPersonally,i watched shakugan no shana and i liked it very very much. but kurokami was simply amazing,i gave it a 10/10 and i rarely give my 10s,well unless i find an anime with something truly amazing.\\n\r\nOne thing i truly learned about animes before watching it is:Dont judge a book by its cover,or more like dont judge an anime by its cover art.\\n\r\nOh btw this is my first review i ever made about a complete anime so yeah im not very experienced in this yet and pardon my english if i made any typos\\n",
            "date": "2010-11-25T10:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 32298,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/253937.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pursoul",
                "username": "pursoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=32298"
        },
        {
            "content": "Kurokami  was a very interesting anime I've ever come across. The story line was fairly decent, it had decent background information and such. The theme is based on boxing, which isn't the typical kind of anime you'll find me watching. Though this anime didn't have much romance, which I was not expecting (forgot to look at the genre) the action made up for it. It was kinda disappointing how wimpy and useless the main male protagonist was though, I don't find anime's interesting where the girl tends to protect the guy, but hey, that's only my opinion. I would have gave this anime a6/10 if I hadn't have watched the ending which was a complete shock and bummer. It just had me at shock and was nothing that I was expecting. It also left me hanging a bit, which makes me want to give it a rating of 2/10. It is only my opinion, but I don't think you should waste your time. The characters barely develop and it's just nothing amusing.",
            "date": "2012-12-15T12:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 80214,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1903804.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tranxo",
                "username": "tranxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=80214"
        },
        {
            "content": "I just finished watching this yesterday and I think I'm feeling better now. The show is good. It really is. What I'm having a problem with is the ending. I don't want to reveal any spoilers, and it's not a typical ending, but I'm unsatisfied with it. If they would just change the last 2 episodes, it would really make me feel a LOT better about the show.\r\nUntil Ep 21, I was ready to give this series a 9 for story and character, but the ending just ruined it for me.\r\nNow, don't get me wrong, it's a great story and the pacing is VERY good.I haven't seen something like this in a LONG time. It's the kind of story that keeps you engrossed and wanting to just see it to the end.\\n\\n\r\nThe ending itself, they tie up all the ends, so there really isn't much left asking ...  but. ... well,, it's probably just me. \\n\\n\r\nThe show itself is really good and I enjoyed it. I really did.",
            "date": "2009-08-23T02:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 18004,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/chronodekar",
                "username": "chronodekar"
            },
            "url": "https://myanimelist.net/reviews.php?id=18004"
        },
        {
            "content": "Overall i would recomend this anime. I perfer subs to dubs but i watched the eng dub of the anime just because i like the main character's voice actor(kuro's). in my opinion episodes 3-7 or 8 start to have way more corny moments in them than the ones before them. i found this rather annyoing but it makes me wonder if the sub would have been this way, because i started to watch one of the subs once and one of the very first sentences was \"Shut the #*@% up\" and that same sentence in the dub was \"How qwant\"..... (sorry for spelling qwant worngi havent had much sleep and cant think of how to spell it right) so the dialog seams to be quite different in the dub than the sub. At some parts in the story i dont really think the characters react the way they should at points in the story. I am also not a reall fan of the way it ended. Thier is one point the story controdicts itself too... you probably wont notice it tho and it is to big of a spoiler a state here. In the first half of the story i was annoyed at the way Keita acte ( i had not been that annoyed by a charcters atitude scince Shinji form Neon Genesis ). The second part of the anime had a way faster pace to it. The anime was good enough for me to want to read the manga someday too so i would recomend it. I just hope the manga ends in a diffrent way.",
            "date": "2010-07-29T08:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 29068,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/358446.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/cford50",
                "username": "cford50"
            },
            "url": "https://myanimelist.net/reviews.php?id=29068"
        },
        {
            "content": "\" BOXING GIRL? \"..... NO NO NO, I dont say that.. \r\nThis anime is not about the battle between the hands, but a story about a girl that has a great ability to fight.\r\nSynopsis: \"Although time has passed quite a while but still, my memory will not disappear when it\r\nThe girl who appeared in front of my mother and I are very similar to my mother \"\r\nThat had in mind the thoughts of a young man named Keita Ibuki. Since the meeting when it was her mother later died. Nine years later, Keita has grown up and worked as a freelance progammer until one dayhe finally get the chance to join a company sebuh game maker of some standing.\\n\r\nHis return he stopped at a ramen shop customers, and there he meets a strange little girl named Kuro. Because of her compassion Keita gave ramennya to Kuro. But moments later a man appeared who attacked Kuro. Keita trying to help but that happened even one of Keita's hand off. Since these events will inevitably be involved in the conflict Keita Mototsumitama and unexpectedly it will also take him to know the truth about her mother's death nine years ago.\\n\\n\r\nLike Ordinary Anime Square Enix producing an impressive ...",
            "date": "2010-06-16T02:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 27214,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/--Sunclaudius",
                "username": "--Sunclaudius"
            },
            "url": "https://myanimelist.net/reviews.php?id=27214"
        },
        {
            "content": "Contains High kick of action. Korean mangas, the once i'm familiar with, Breaker and as an anime in Kurokami offer a completely different flow of story wherein they hope to do justice to the the theme of story as a whole rather than individual characters or plots. So dont be disappointed if the story hits a slump, the ending will be rewarding. The anime however offer good action in return but that too doesn't keep viewers interested enough because of lack in flow of the story, variety, and quality even. Initially It would feel like a story just made for some action where a bunchof people fight against each other with some mystery to all of it. The plot and characters have been handled in a very apathetic manner its just fights from beginning to end with good ending. Would recommend it to kill time.",
            "date": "2012-04-02T09:24:00+00:00",
            "helpful_count": 0,
            "mal_id": 57697,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261710.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/puvijain",
                "username": "puvijain"
            },
            "url": "https://myanimelist.net/reviews.php?id=57697"
        },
        {
            "content": "Just finished kurokami. I tried it and liked it but at the end it seemed they rushed the whole episode and didn't explain much but idk. Good anime tho",
            "date": "2011-09-18T01:11:00+00:00",
            "helpful_count": 0,
            "mal_id": 43633,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZeusLovesAnime",
                "username": "ZeusLovesAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=43633"
        }
    ]
]