[
    [
        {
            "content": "I'm so happy to see a new season of Natsume Yuujinchou, I thought it would not going to happen. It is, no doubt, my favorite anime. Good story, great characters, with a calm e heartwarming atmosphere. Some episodes will make you laugh, some episodes will make you cry, but most of them will make you calm. My heart  fills with happiness everytime I watch Natsume Yuujinchou.\r\nCharacters:\r\nNatsume Yuujinchou has a lot of characters with their own particularities. Natsume had a tough childhood, always alone and being bullied, it could have been a reason for him to hate people, but instead, he has compassion and he'sable to do anything for those who are important to him. Nyanko sensei, despite trying to look \\n\r\ntough, he has a big heart and cares more about Natsume than the book. He is fun, funny, cute, brave and, especially, loyal. I'll not write about every character, but I can say all of them are really well worked. Even the Youkais who only appears in one episode. Their stories are always showed in a deep and interesting way. \\n\\n\r\nArt and animation:\\n\r\nThe art is beautiful. Without exaggerations, simple, and its simplicity makes it so marvelous. Great character's design, no unnecessary details. I love everything about the art style... The characters, the sceneries, the youkais/ayakashis. Everything. And I really love the animation of Natsume returning the Youkais's names, it's pretty ang magical. \\n\\n\r\nMusic:\\n\r\nThe music is marvelous, as always. Not only the opening and ending music, but, especially, the background musics. They match so perfectly with the situations, give you good so many good sensations, sometimes it even gives me goose bumps. Just wonderful, best OST I've ever heard.\\n\\n\r\nIf there's one anime I want to recommend to EVERYONE, this anime is Natsume Yuujinchou.",
            "date": "2016-10-26T17:36:00+00:00",
            "helpful_count": 101,
            "mal_id": 232680,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3795693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GabrielaWolff",
                "username": "GabrielaWolff"
            },
            "url": "https://myanimelist.net/reviews.php?id=232680"
        },
        {
            "content": "I don't know about you, but when I watch this series, I almost want to live with Natsume, his family and his friends. So many moments warm my heart that it would be difficult for me to count them.\r\nStory: (10/10) As always, we follow Natsume Takashi, an orphan high school student who had an unfortunate childhood and now adopted by the Fujiwara. Natsume helps the different yokai/humans who are connected to the \"Book of Friends\" accompanied by Madara (Nyanko-sensei) a powerful yokai. Natsume also comes to humans' aid not affected by this \"book\". (You know the story if you want to watch the 5th season...)\r\nOverall,the series has an episodic format that could discourage you because it would be repetitive and it would become tiresome after a few episodes. However I would like to point out the inventiveness of Yuki Midorikawa will impress you with every episode and you will be surprised by the turn of events.\\n\r\nThe stories are very often moving and I won't fail to tell you I have cried many times while watching an episode.\\n\r\nDon't expect a \"forced drama\" series, no, the direction is very subtle and prefers to go through the narration to reach his audience.\\n\r\nThis 5th season focuses more on the secondary characters and their past. More specifically Touko and Shigeru Fujiwara, Natori, Taki and Reiko.\\n\\n\r\nCharacters: (10/10) As mentioned earlier, many episodes focus on Natsume's friends and family, more than Natsume himself which changes a bit from previous seasons. \\n\r\nI won't say any more at the risk of spoiler.\\n\\n\r\nArt: (7/10) Always great despite the studio change. (The staff is almost similar to previous seasons)\\n\r\nOverall, we will very rarely find badly drawn characters when they are close to the camera.\\n\\n\r\nSound: (10/10) It plays a very important part in the atmosphere of the series. Many older OSTs like \"Furusato no Nioi\" or \"Daiidaro no Toki\" are used and I can't explain the reason but I feel calming by listening to them. There are other new soundtracks I don't know the titles yet to recommend.\\n\r\nWe owe this work to Makoto Yoshimori.\\n\\n\r\nEnjoyment: (10/10) Needless to say that I spend great time with each episode. My favorites are the 1st, 5th and 10th, and what are your favorites?\\n\r\nApart from the fantasy/supernatural aspect that plunges you into a universe inspired by the myths of Japanese folklore, this series is a slice of life and also talks about daily life. For example, the moments spent lunching with his adoptive parents, traveling with friends, etc. Things that most of us live. And here the series accentuates these passages and tries to make us understand to what extent these little moments of happiness are precious and that we must cherish them. And to see it from the point of view of Natsume is important insofar as he had a very difficult childhood, rejected by his classmates, and the previous adoptive families.\\n\\n\r\nIn conclusion: I highly recommend this series and this S5 even more.\\n\r\nGood points:\\n\r\n+ Narration: in many series adapted by Takahiro Omori, we find this narrative system with a character telling his story, his past.\\n\r\n+ Characters: very interesting development of Taki, Natori and Fujiwara that you shouldn't miss.\\n\r\n+ Slice of life: I insist but this series has a certain beauty that sets it apart\\n\r\n+ OST\\n\r\n+ OP (by Sasanomaly) and ED (by Aimer) which correspond perfectly to the atmosphere of the series\\n\\n\r\nNegative point:\\n\r\n+ mmh ... 11 episodes, it's too short, I want more.\\n\\n\r\nThank you for reading this review.",
            "date": "2016-12-21T06:21:00+00:00",
            "helpful_count": 79,
            "mal_id": 235988,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4797625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TuyNOM",
                "username": "TuyNOM"
            },
            "url": "https://myanimelist.net/reviews.php?id=235988"
        },
        {
            "content": "It's Natsume Yuujinchou. If you aren't following this series, you've either not tried it or slice of life anime is just not for you. That's okay if you don't like slower shows. Otherwise... Join us in the iyashikei world, where the world is good and pureness reigns and smiles are protected! Go! We'll see you at Roku!\r\nOVERALL - 9\r\nAlways happy for more Natsume Yuujinchou. Heartwarming. Fluffy. Pure. Activates the \"I must protect this smile!\" instinct. Feels. Feels that are sometimes happy. Feels that are sometimes REALLY KINDA HEARTBREAKING??? Iyashikei but with an undertone of constant melancholy that almost makes you have multiple existential crises butthen your heart is healed into a pure state? Aw yes!\\n\\n\r\nSTORY - rounded down 9.5\\n\r\nShort stories. Always superb. Some used this season were more dynamic than I've ever seen Natsume Yuujinchou show us before---more than enough to make up for some of the more forgettable ones (sorry).\\n\\n\r\nART/ANIMATION - 9\\n\r\nSo we have moved from Brain's Base to Shuka. There's reason to be skeptical of this infant studio that tends to slack of halfway, but they poured a lot into consistantly making Natsume beaut-- I mean, Natsume Yuujinchou beautiful, haha. The softer colour palette and more pencil-like lines compliment the iyashikei feel. And it's hard to not melt a little bit (or, you know, a LOT) at the very gentle and fluid animation every time Natsume smiles. Good to know Shuka knows where to pour the most effort.\\n\\n\r\nSOUND/MUSIC - 8\\n\r\nNatsume Yuujinchou uses the same lovely OST every season with only some new tracks, so let's just talk about the OP/ED. Like the OP: makes me excited for more Natsume. Love the ED: reminds me of Zoku's ending which is my personal favourite.\\n\\n\r\nCHARACTERS - 9\\n\r\nIt's season 5. You know who you love and who you disapprove of by now. (If you don't like Natsume himself within 1-3 episodes of the first season... ¯\\_(ツ)_/¯ Sorry, he's the MC and a boy of kindness & good intentions whose Shuka-animated smile I will always treasure.)\\n\\n\r\nENJOYMENT - 10\\n\r\nIt's season 5.\\n\\n\r\nAdditional Ratings : SEIYUU - 10 (Kamiya Hiroshi. Jun'ichi Suwabe. The usual cast. The usual greatness) ; CINEMATOGRAPHY - 9",
            "date": "2016-12-31T15:12:00+00:00",
            "helpful_count": 24,
            "mal_id": 237119,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4461001.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SendPieSenpai",
                "username": "SendPieSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=237119"
        },
        {
            "content": "I love how each episode they show us the youkai's, natori, Touko and Shigeru's backstory very very heart warming. Some episode manage to make me touched with every single character they have and made me care for them like what happend to them after that? how are they doing now? is Natsume going to be straight or gay? Taki or someone?\r\nThere is though some episode that is meh at certain part but they fixed quite quickly, the art is beautiful they always upgraded their art every single single season. The ending in this anime is one of my favorites\r\nOverall i'm going to rate this 9/10",
            "date": "2017-01-29T07:07:00+00:00",
            "helpful_count": 23,
            "mal_id": 239409,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5993343.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SirLancelot99",
                "username": "SirLancelot99"
            },
            "url": "https://myanimelist.net/reviews.php?id=239409"
        },
        {
            "content": "The fifth season of Natsume Yuujinchou was a true pleasure to watch. In this season, we see Natsume's friendships develop and grow. We learn more about his troubled past and the backstory behind the Fujiwaras. \r\nStory: 9\r\nOne of my favorite aspects of Natsume Yuujinchou is how each episode stands alone. There is a distinct thought or feeling, a pearl that is revealed at the end of the episode as Natsume reflects upon what happens. He speaks directly to the audience. This is so powerful and so beautiful. And yet, there is a distinct thread that runs throughout the series. We see Takashi grow and mature.We see his friends follow him as well. But we also see Takashi's past as well. Overall, the story is cohesive and well-paced.\\n\\n\r\nArt: 9\\n\r\nThe art is certainly beautiful, and the landscapes are quite scenic. There is definitely attention to details and the animation is good too.\\n\\n\r\nSound:9 \\n\r\nThe soundtrack reinforces the key emotions of the show. Overall a pleasure, but not the best in the series. \\n\\n\r\nCharacter:10\\n\r\nThe character development is truly outstanding. This is what keeps this series going season after season. \\n\\n\r\nWe can all relate to the emotions and feelings that Natsume Takashi has. We admire Takashi's bravery and selflessness, and his genuine desire to help others, whether it be human, Ayakashi, or beast. He has a true heart of gold.\\n\\n\r\nNyanko-Sensei, the bumbling buta-neko, is a true companion. He claims to only want the Book of Friends, but we see that he has sincere concern for Takashi. They have such a cute relationship. And of course, they always find a way for Nyanko-Sensei to be gone so that Natsume can fight some of his battles on his own. It's pretty well done. \\n\\n\r\nTaki and Tanuma are Natsume's somewhat spiritual friends. They're OK. \\n\\n\r\nKitamoto is the cutest character, besides maybe Takashi. He needs more screen time. \\n\\n\r\nEnjoyment: 10\\n\r\nDefinitely a pleasure to watch. Not so sad that it's a tear-jerker every episode, but it does taste a little bittersweet like a good dark chocolate. \\n\\n\\n",
            "date": "2017-04-16T20:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 245679,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pooprocks",
                "username": "pooprocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=245679"
        },
        {
            "content": "It is more of the same thing that was in previous seasons: A somewhat melancholic, calm slice of life kind of show that deals with supernatural elements. If you watched and liked previous seasons, you'll like this one as well.\r\nDetailed breakdown:\r\nStory: Story is on a melancholic side, and moves slowly, without haste, giving enough time to think about events/characters in the show. This anime does a good job being subtle and creating highly emotional scenes effortlessly. There's no overarching story here, while events probably happen in order, they're pretty much separate from each other, and are only connected by protagonist. The anime occasionally gets darker,but does not go overboard with it. \\n\\n\r\nArt:\\n\r\nSame as before. Decent above average modern \"realistic\" (as in character proportions and all) anime. Youkai have unique designs and are interesting to look at. So, art is good.\\n\\n\r\nSound:\\n\r\nComplements the anime nicely, not much add to that.\\n\\n\r\nCharacters:\\n\r\nCharacters are beleivable, and this anime does a good job portraying subtle reactions, or otherwordly behavior of youkai. Although it on occasion feels that it goes a bit oto far when natsume starts worrying about other people, otherwise all the characters are quite believable.\\n\\n\r\nEnjoymenet:\\n\r\nSame as with previous seasons - it won't put you at the edge of your seat, but it is interesting to watch.\\n\\n\r\nOverall: Recommended, especially if you liked previous seasons.",
            "date": "2017-04-04T20:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 244643,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=244643"
        },
        {
            "content": "I almost went into labor when I knew that Natsume Yuujinchou got a new season. And ooommmggg, it were four long years of waiting, goddammit! I thought they had canceled the animation projects, but then this came out and I became extremely happy to continue watching the adaptation of one of the best Shoujo manga (if not THE best) that exists in the manga market. Geez, I don't know if I'm able to tell in this review how much excited and sincerely pleased I'm right now. Finally!\r\nStory: The plot goes on telling about a high school boy who can see and communicate with spirits (actuallysupernatural creatures from Japanese folklore, to be exact), also called youkai. Despite this \"ability\" seemed to be something interesting, actually was a factor causing much suffering to Natsume: from a child that was considered \"strange\" in all schools he went to, as a poor orphan always being passed from relative to relative and always being rejected because of his peculiar attitudes that usually caused fear and anger in others. Natsume always tried to explain and talk about what he saw, but nobody believed him and he was regarded as a liar, repeatedly. Thanks to the constant situations of misunderstanding, rejection and even bullying, Natsume has grown introverted and unhappy - and he also develops a feeling of disgust for any \"non-living\" creature. The problem is that Natsume couldn't do anything about his ability to see youkai and even worse, many of those spirits were really dangerous. One day, however, Natsume discovers a book - apparently that belonged to his grandmother - that somehow \"control\" the youkai. From there, his life begins to change gradually.\\n\\n\r\nSpecifically speaking, Natsume Yuujinchou Go tells us more about the development of this previous story, deepening the personalities of the characters, the relationships between them and some other small details that are being discovered every new episode. I really feel pleased to see that the studio is taking this job seriously and trying to join the loose ends in the previous seasons. The story has been built as a puzzle and it's becoming more and more lively! And I could not help but comment that it's super cool to discover new things about this new plot, which is full of interesting surprises! You keep asking yourself if someday Natsume is going to have to choose between human world or youkai world or if he's going to handle both of them.\\n\\n\r\nArt is still warming and super well done. The small details of each scenario makes you want to stop and admire every little thing. I'm glad this didn't changed. I really like the style of the traits! It's that kind of animation you can pause at any time and rarely find failures.\\n\\n\r\nCharacter: Natsume Go tell us more about those incognito and mysterious characters like Matoba or Natori. And that is definitively something that urged me and bothered me since the first season. Natsume is still that gentle freaking cute boy trying to help everyone, Madara is still funny and sarcastic as ever (aaaand round as ever). Until now, I've been feeling that something is about to change in the Fujiwara's house because of Natsume, but I really hope they end up well, cuz they are a really lovely family. Also, we finally get to know more about freaking super Reiko! She's more awesome than I thought! How is this even possible? hahaha <3 I just love her so much and this is great. \\n\\n\r\nSound: Apparently, the background soundtrack is still the same as in previous seasons. And it's still wonderful, full of Japan's typical music details that give a special touch for the \"more adventurous\" moments of the series. Besides, I love how the songs are sad and cherish at the same time.\\n\\n\r\nThe opening and ending songs also add enough content that the series attempts to pass to the viewers, and well, I was so homesick about it that until now I didn't fail to see and hear any of them until the very end. \\n\\n\r\nThe voice actors are still doing a great job too! I just love how they transform the plot into something magical just by the tone of their voices. \\n\\n\r\nSo, if I'm enjoying it? Plenty! This anime is still outstanding and amazing as ever. Sometimes I find myself looking forward to the unfolding of the story, I get scared with some shadows and creepy youkai that appear from time to time in the corners, I get myself laughing at cute and funny stories about youkai, I get glad to see that Natsume is managing to survive well and a little happier, despite the difficulties. I wanted so freaking much to get in the story and hug him to death!! Gosh. Can't hold my feelings because, wow, there are so many. I usually do not like suspense stories, but I'll make an exception for Natsume's Book of Friends, because this is getting tremendously good!",
            "date": "2017-11-16T17:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 263361,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1242487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Liao",
                "username": "Liao"
            },
            "url": "https://myanimelist.net/reviews.php?id=263361"
        },
        {
            "content": "Alright, so the longer I watch this anime, the harder it is to review. Here's the thing about this anime: it grows on you. The things that I would've wanted to be changed before, I don't want them to be changed anymore. \r\nFor example, the little, seemingly disconnected stories that fill every episode. I love that this anime can give you tension while still keeping the overall tone of the anime calming and tranquil. This season in particular also saw a couple episodes that were backstories for some of the secondary characters, which is something I didn't know I wanted until I saw it. Thedepth that it gives to the anime was unexpectedly wonderful.\\n\\n\r\nI will say, once again, that I'm still looking for this story to develop a bit of a bigger picture. I thought it was beginning to happen this season, but it hasn't gone anywhere yet. What I mean is I want to see Natsume become a part of a season-long story that allows him to learn more about the world of youkai and, possibly, the humans involved with them. Instead of Natsume fulfilling this role of someone that is antiquated with both youkai and humans separately, I want to see Natsume become a part of both worlds in a way that changes his relationships on both sides. To put it more simply, I want this story to start carrying some weight and consequence that it hasn't fully done thus far. Bits and pieces, sure, but I would love to see it go full throttle. \\n\\n\r\nThe last thing I was happy to see/want to see more of was some background on Reiko. She was a big driving force behind the anime, especially in the beginning, but she never got fleshed out, and I'm glad I finally got to see some of that this season.\\n\\n\r\nGoing forward, I'm excited to see how Natsume will entangle himself with the exorcists as well as how his relationships with his adoptive parents and friends will develop. I really hope this anime takes a dive to become a little more gritty and serious because I know it can do that and still be the lovely, heartwarming anime that it is.",
            "date": "2019-03-05T18:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 302969,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302969"
        }
    ],
    [
        {
            "content": "I'm so happy to see a new season of Natsume Yuujinchou, I thought it would not going to happen. It is, no doubt, my favorite anime. Good story, great characters, with a calm e heartwarming atmosphere. Some episodes will make you laugh, some episodes will make you cry, but most of them will make you calm. My heart  fills with happiness everytime I watch Natsume Yuujinchou.\r\nCharacters:\r\nNatsume Yuujinchou has a lot of characters with their own particularities. Natsume had a tough childhood, always alone and being bullied, it could have been a reason for him to hate people, but instead, he has compassion and he'sable to do anything for those who are important to him. Nyanko sensei, despite trying to look \\n\r\ntough, he has a big heart and cares more about Natsume than the book. He is fun, funny, cute, brave and, especially, loyal. I'll not write about every character, but I can say all of them are really well worked. Even the Youkais who only appears in one episode. Their stories are always showed in a deep and interesting way. \\n\\n\r\nArt and animation:\\n\r\nThe art is beautiful. Without exaggerations, simple, and its simplicity makes it so marvelous. Great character's design, no unnecessary details. I love everything about the art style... The characters, the sceneries, the youkais/ayakashis. Everything. And I really love the animation of Natsume returning the Youkais's names, it's pretty ang magical. \\n\\n\r\nMusic:\\n\r\nThe music is marvelous, as always. Not only the opening and ending music, but, especially, the background musics. They match so perfectly with the situations, give you good so many good sensations, sometimes it even gives me goose bumps. Just wonderful, best OST I've ever heard.\\n\\n\r\nIf there's one anime I want to recommend to EVERYONE, this anime is Natsume Yuujinchou.",
            "date": "2016-10-26T17:36:00+00:00",
            "helpful_count": 101,
            "mal_id": 232680,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3795693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GabrielaWolff",
                "username": "GabrielaWolff"
            },
            "url": "https://myanimelist.net/reviews.php?id=232680"
        },
        {
            "content": "I don't know about you, but when I watch this series, I almost want to live with Natsume, his family and his friends. So many moments warm my heart that it would be difficult for me to count them.\r\nStory: (10/10) As always, we follow Natsume Takashi, an orphan high school student who had an unfortunate childhood and now adopted by the Fujiwara. Natsume helps the different yokai/humans who are connected to the \"Book of Friends\" accompanied by Madara (Nyanko-sensei) a powerful yokai. Natsume also comes to humans' aid not affected by this \"book\". (You know the story if you want to watch the 5th season...)\r\nOverall,the series has an episodic format that could discourage you because it would be repetitive and it would become tiresome after a few episodes. However I would like to point out the inventiveness of Yuki Midorikawa will impress you with every episode and you will be surprised by the turn of events.\\n\r\nThe stories are very often moving and I won't fail to tell you I have cried many times while watching an episode.\\n\r\nDon't expect a \"forced drama\" series, no, the direction is very subtle and prefers to go through the narration to reach his audience.\\n\r\nThis 5th season focuses more on the secondary characters and their past. More specifically Touko and Shigeru Fujiwara, Natori, Taki and Reiko.\\n\\n\r\nCharacters: (10/10) As mentioned earlier, many episodes focus on Natsume's friends and family, more than Natsume himself which changes a bit from previous seasons. \\n\r\nI won't say any more at the risk of spoiler.\\n\\n\r\nArt: (7/10) Always great despite the studio change. (The staff is almost similar to previous seasons)\\n\r\nOverall, we will very rarely find badly drawn characters when they are close to the camera.\\n\\n\r\nSound: (10/10) It plays a very important part in the atmosphere of the series. Many older OSTs like \"Furusato no Nioi\" or \"Daiidaro no Toki\" are used and I can't explain the reason but I feel calming by listening to them. There are other new soundtracks I don't know the titles yet to recommend.\\n\r\nWe owe this work to Makoto Yoshimori.\\n\\n\r\nEnjoyment: (10/10) Needless to say that I spend great time with each episode. My favorites are the 1st, 5th and 10th, and what are your favorites?\\n\r\nApart from the fantasy/supernatural aspect that plunges you into a universe inspired by the myths of Japanese folklore, this series is a slice of life and also talks about daily life. For example, the moments spent lunching with his adoptive parents, traveling with friends, etc. Things that most of us live. And here the series accentuates these passages and tries to make us understand to what extent these little moments of happiness are precious and that we must cherish them. And to see it from the point of view of Natsume is important insofar as he had a very difficult childhood, rejected by his classmates, and the previous adoptive families.\\n\\n\r\nIn conclusion: I highly recommend this series and this S5 even more.\\n\r\nGood points:\\n\r\n+ Narration: in many series adapted by Takahiro Omori, we find this narrative system with a character telling his story, his past.\\n\r\n+ Characters: very interesting development of Taki, Natori and Fujiwara that you shouldn't miss.\\n\r\n+ Slice of life: I insist but this series has a certain beauty that sets it apart\\n\r\n+ OST\\n\r\n+ OP (by Sasanomaly) and ED (by Aimer) which correspond perfectly to the atmosphere of the series\\n\\n\r\nNegative point:\\n\r\n+ mmh ... 11 episodes, it's too short, I want more.\\n\\n\r\nThank you for reading this review.",
            "date": "2016-12-21T06:21:00+00:00",
            "helpful_count": 79,
            "mal_id": 235988,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4797625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TuyNOM",
                "username": "TuyNOM"
            },
            "url": "https://myanimelist.net/reviews.php?id=235988"
        },
        {
            "content": "It's Natsume Yuujinchou. If you aren't following this series, you've either not tried it or slice of life anime is just not for you. That's okay if you don't like slower shows. Otherwise... Join us in the iyashikei world, where the world is good and pureness reigns and smiles are protected! Go! We'll see you at Roku!\r\nOVERALL - 9\r\nAlways happy for more Natsume Yuujinchou. Heartwarming. Fluffy. Pure. Activates the \"I must protect this smile!\" instinct. Feels. Feels that are sometimes happy. Feels that are sometimes REALLY KINDA HEARTBREAKING??? Iyashikei but with an undertone of constant melancholy that almost makes you have multiple existential crises butthen your heart is healed into a pure state? Aw yes!\\n\\n\r\nSTORY - rounded down 9.5\\n\r\nShort stories. Always superb. Some used this season were more dynamic than I've ever seen Natsume Yuujinchou show us before---more than enough to make up for some of the more forgettable ones (sorry).\\n\\n\r\nART/ANIMATION - 9\\n\r\nSo we have moved from Brain's Base to Shuka. There's reason to be skeptical of this infant studio that tends to slack of halfway, but they poured a lot into consistantly making Natsume beaut-- I mean, Natsume Yuujinchou beautiful, haha. The softer colour palette and more pencil-like lines compliment the iyashikei feel. And it's hard to not melt a little bit (or, you know, a LOT) at the very gentle and fluid animation every time Natsume smiles. Good to know Shuka knows where to pour the most effort.\\n\\n\r\nSOUND/MUSIC - 8\\n\r\nNatsume Yuujinchou uses the same lovely OST every season with only some new tracks, so let's just talk about the OP/ED. Like the OP: makes me excited for more Natsume. Love the ED: reminds me of Zoku's ending which is my personal favourite.\\n\\n\r\nCHARACTERS - 9\\n\r\nIt's season 5. You know who you love and who you disapprove of by now. (If you don't like Natsume himself within 1-3 episodes of the first season... ¯\\_(ツ)_/¯ Sorry, he's the MC and a boy of kindness & good intentions whose Shuka-animated smile I will always treasure.)\\n\\n\r\nENJOYMENT - 10\\n\r\nIt's season 5.\\n\\n\r\nAdditional Ratings : SEIYUU - 10 (Kamiya Hiroshi. Jun'ichi Suwabe. The usual cast. The usual greatness) ; CINEMATOGRAPHY - 9",
            "date": "2016-12-31T15:12:00+00:00",
            "helpful_count": 24,
            "mal_id": 237119,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4461001.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SendPieSenpai",
                "username": "SendPieSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=237119"
        },
        {
            "content": "I love how each episode they show us the youkai's, natori, Touko and Shigeru's backstory very very heart warming. Some episode manage to make me touched with every single character they have and made me care for them like what happend to them after that? how are they doing now? is Natsume going to be straight or gay? Taki or someone?\r\nThere is though some episode that is meh at certain part but they fixed quite quickly, the art is beautiful they always upgraded their art every single single season. The ending in this anime is one of my favorites\r\nOverall i'm going to rate this 9/10",
            "date": "2017-01-29T07:07:00+00:00",
            "helpful_count": 23,
            "mal_id": 239409,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5993343.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SirLancelot99",
                "username": "SirLancelot99"
            },
            "url": "https://myanimelist.net/reviews.php?id=239409"
        },
        {
            "content": "The fifth season of Natsume Yuujinchou was a true pleasure to watch. In this season, we see Natsume's friendships develop and grow. We learn more about his troubled past and the backstory behind the Fujiwaras. \r\nStory: 9\r\nOne of my favorite aspects of Natsume Yuujinchou is how each episode stands alone. There is a distinct thought or feeling, a pearl that is revealed at the end of the episode as Natsume reflects upon what happens. He speaks directly to the audience. This is so powerful and so beautiful. And yet, there is a distinct thread that runs throughout the series. We see Takashi grow and mature.We see his friends follow him as well. But we also see Takashi's past as well. Overall, the story is cohesive and well-paced.\\n\\n\r\nArt: 9\\n\r\nThe art is certainly beautiful, and the landscapes are quite scenic. There is definitely attention to details and the animation is good too.\\n\\n\r\nSound:9 \\n\r\nThe soundtrack reinforces the key emotions of the show. Overall a pleasure, but not the best in the series. \\n\\n\r\nCharacter:10\\n\r\nThe character development is truly outstanding. This is what keeps this series going season after season. \\n\\n\r\nWe can all relate to the emotions and feelings that Natsume Takashi has. We admire Takashi's bravery and selflessness, and his genuine desire to help others, whether it be human, Ayakashi, or beast. He has a true heart of gold.\\n\\n\r\nNyanko-Sensei, the bumbling buta-neko, is a true companion. He claims to only want the Book of Friends, but we see that he has sincere concern for Takashi. They have such a cute relationship. And of course, they always find a way for Nyanko-Sensei to be gone so that Natsume can fight some of his battles on his own. It's pretty well done. \\n\\n\r\nTaki and Tanuma are Natsume's somewhat spiritual friends. They're OK. \\n\\n\r\nKitamoto is the cutest character, besides maybe Takashi. He needs more screen time. \\n\\n\r\nEnjoyment: 10\\n\r\nDefinitely a pleasure to watch. Not so sad that it's a tear-jerker every episode, but it does taste a little bittersweet like a good dark chocolate. \\n\\n\\n",
            "date": "2017-04-16T20:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 245679,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pooprocks",
                "username": "pooprocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=245679"
        },
        {
            "content": "It is more of the same thing that was in previous seasons: A somewhat melancholic, calm slice of life kind of show that deals with supernatural elements. If you watched and liked previous seasons, you'll like this one as well.\r\nDetailed breakdown:\r\nStory: Story is on a melancholic side, and moves slowly, without haste, giving enough time to think about events/characters in the show. This anime does a good job being subtle and creating highly emotional scenes effortlessly. There's no overarching story here, while events probably happen in order, they're pretty much separate from each other, and are only connected by protagonist. The anime occasionally gets darker,but does not go overboard with it. \\n\\n\r\nArt:\\n\r\nSame as before. Decent above average modern \"realistic\" (as in character proportions and all) anime. Youkai have unique designs and are interesting to look at. So, art is good.\\n\\n\r\nSound:\\n\r\nComplements the anime nicely, not much add to that.\\n\\n\r\nCharacters:\\n\r\nCharacters are beleivable, and this anime does a good job portraying subtle reactions, or otherwordly behavior of youkai. Although it on occasion feels that it goes a bit oto far when natsume starts worrying about other people, otherwise all the characters are quite believable.\\n\\n\r\nEnjoymenet:\\n\r\nSame as with previous seasons - it won't put you at the edge of your seat, but it is interesting to watch.\\n\\n\r\nOverall: Recommended, especially if you liked previous seasons.",
            "date": "2017-04-04T20:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 244643,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=244643"
        },
        {
            "content": "I almost went into labor when I knew that Natsume Yuujinchou got a new season. And ooommmggg, it were four long years of waiting, goddammit! I thought they had canceled the animation projects, but then this came out and I became extremely happy to continue watching the adaptation of one of the best Shoujo manga (if not THE best) that exists in the manga market. Geez, I don't know if I'm able to tell in this review how much excited and sincerely pleased I'm right now. Finally!\r\nStory: The plot goes on telling about a high school boy who can see and communicate with spirits (actuallysupernatural creatures from Japanese folklore, to be exact), also called youkai. Despite this \"ability\" seemed to be something interesting, actually was a factor causing much suffering to Natsume: from a child that was considered \"strange\" in all schools he went to, as a poor orphan always being passed from relative to relative and always being rejected because of his peculiar attitudes that usually caused fear and anger in others. Natsume always tried to explain and talk about what he saw, but nobody believed him and he was regarded as a liar, repeatedly. Thanks to the constant situations of misunderstanding, rejection and even bullying, Natsume has grown introverted and unhappy - and he also develops a feeling of disgust for any \"non-living\" creature. The problem is that Natsume couldn't do anything about his ability to see youkai and even worse, many of those spirits were really dangerous. One day, however, Natsume discovers a book - apparently that belonged to his grandmother - that somehow \"control\" the youkai. From there, his life begins to change gradually.\\n\\n\r\nSpecifically speaking, Natsume Yuujinchou Go tells us more about the development of this previous story, deepening the personalities of the characters, the relationships between them and some other small details that are being discovered every new episode. I really feel pleased to see that the studio is taking this job seriously and trying to join the loose ends in the previous seasons. The story has been built as a puzzle and it's becoming more and more lively! And I could not help but comment that it's super cool to discover new things about this new plot, which is full of interesting surprises! You keep asking yourself if someday Natsume is going to have to choose between human world or youkai world or if he's going to handle both of them.\\n\\n\r\nArt is still warming and super well done. The small details of each scenario makes you want to stop and admire every little thing. I'm glad this didn't changed. I really like the style of the traits! It's that kind of animation you can pause at any time and rarely find failures.\\n\\n\r\nCharacter: Natsume Go tell us more about those incognito and mysterious characters like Matoba or Natori. And that is definitively something that urged me and bothered me since the first season. Natsume is still that gentle freaking cute boy trying to help everyone, Madara is still funny and sarcastic as ever (aaaand round as ever). Until now, I've been feeling that something is about to change in the Fujiwara's house because of Natsume, but I really hope they end up well, cuz they are a really lovely family. Also, we finally get to know more about freaking super Reiko! She's more awesome than I thought! How is this even possible? hahaha <3 I just love her so much and this is great. \\n\\n\r\nSound: Apparently, the background soundtrack is still the same as in previous seasons. And it's still wonderful, full of Japan's typical music details that give a special touch for the \"more adventurous\" moments of the series. Besides, I love how the songs are sad and cherish at the same time.\\n\\n\r\nThe opening and ending songs also add enough content that the series attempts to pass to the viewers, and well, I was so homesick about it that until now I didn't fail to see and hear any of them until the very end. \\n\\n\r\nThe voice actors are still doing a great job too! I just love how they transform the plot into something magical just by the tone of their voices. \\n\\n\r\nSo, if I'm enjoying it? Plenty! This anime is still outstanding and amazing as ever. Sometimes I find myself looking forward to the unfolding of the story, I get scared with some shadows and creepy youkai that appear from time to time in the corners, I get myself laughing at cute and funny stories about youkai, I get glad to see that Natsume is managing to survive well and a little happier, despite the difficulties. I wanted so freaking much to get in the story and hug him to death!! Gosh. Can't hold my feelings because, wow, there are so many. I usually do not like suspense stories, but I'll make an exception for Natsume's Book of Friends, because this is getting tremendously good!",
            "date": "2017-11-16T17:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 263361,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1242487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Liao",
                "username": "Liao"
            },
            "url": "https://myanimelist.net/reviews.php?id=263361"
        },
        {
            "content": "Alright, so the longer I watch this anime, the harder it is to review. Here's the thing about this anime: it grows on you. The things that I would've wanted to be changed before, I don't want them to be changed anymore. \r\nFor example, the little, seemingly disconnected stories that fill every episode. I love that this anime can give you tension while still keeping the overall tone of the anime calming and tranquil. This season in particular also saw a couple episodes that were backstories for some of the secondary characters, which is something I didn't know I wanted until I saw it. Thedepth that it gives to the anime was unexpectedly wonderful.\\n\\n\r\nI will say, once again, that I'm still looking for this story to develop a bit of a bigger picture. I thought it was beginning to happen this season, but it hasn't gone anywhere yet. What I mean is I want to see Natsume become a part of a season-long story that allows him to learn more about the world of youkai and, possibly, the humans involved with them. Instead of Natsume fulfilling this role of someone that is antiquated with both youkai and humans separately, I want to see Natsume become a part of both worlds in a way that changes his relationships on both sides. To put it more simply, I want this story to start carrying some weight and consequence that it hasn't fully done thus far. Bits and pieces, sure, but I would love to see it go full throttle. \\n\\n\r\nThe last thing I was happy to see/want to see more of was some background on Reiko. She was a big driving force behind the anime, especially in the beginning, but she never got fleshed out, and I'm glad I finally got to see some of that this season.\\n\\n\r\nGoing forward, I'm excited to see how Natsume will entangle himself with the exorcists as well as how his relationships with his adoptive parents and friends will develop. I really hope this anime takes a dive to become a little more gritty and serious because I know it can do that and still be the lovely, heartwarming anime that it is.",
            "date": "2019-03-05T18:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 302969,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302969"
        }
    ]
]