[
    [
        {
            "content": "I really love the anime however the animation, fight scene, plot , & many more are lacking \"effort\" from the animation studio. This anime is a example of a wasted story not given effort by the animation company. I envy one-punch man for the animation from the studio the created it. Sadly, We can't also blame the animation company because of making the series long story into a short 10-12 episode anime.  \r\nLuckily, the opening theme is spectacular. I always anticipated each episode just because of the anime different theme versions.\r\nSo 5/5 for music, 2/5 for the sum total of animation and everything!",
            "date": "2015-12-13T23:01:00+00:00",
            "helpful_count": 171,
            "mal_id": 205498,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050638.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/belingblade",
                "username": "belingblade"
            },
            "url": "https://myanimelist.net/reviews.php?id=205498"
        },
        {
            "content": "For the past few years, the idea of \"quality entertainment\" in anime I've felt has completely changed meaning.  Currently, we're in the age where sex sells, and the idea of not having it in some way shape or form is almost a completely ludicrous thought.  And so, to bolster that terrible, terrible thought, we have Shinmai Maou no Testament Burst, sequel to the first Sister Testament series, and a piece of crap that is even more of an insult to the series than the sister testament series already was to itself.\r\nStory:  The story here is pretty basic.  Picking off from thewhere the first season ended, Burst continues along the sexual and badass adventures of our main protagonist, Basara, where he sucks bitches and fights monsters.  Kinda like what he did in the first season, but this time, in the demon realm, and with a plot that's even more incomprehensible.  \\n\\n\r\nReally though, that is it for our story.  Aside from the change in setting, Basara and co. are essentially doing the exact same thing that they were doing in the first season, just with more stuff added to it that tries to build up the world, but only really adds in to cause more confusion.  There are several major reasons why this second season fails, several very, very big ones.  \\n\\n\r\nFirst of all, we have the main duality of reasons: pacing and information.  As a fantasy show, Sister Testament requires quite a bit of info dumping so that we as the audience can understand what kind of world these characters are getting into and therefore, understand their situation or conflict at hand.  Problem is, we don't have that.  Instead, we get a story that struggles to tell us what the hell is going on, while also trying to move along a story that just makes no sense.  They add in a lot of setup for some \"dangerous things\" to come, and then drop it altogether, (Like that bigass coffin thing.)  as well as supposedly important aspects of our main protagonist that feels like a maguffin for the series simply because it's not treated well.  Combine those with the tiny, tiny runtime of 10 episodes, and you have yourself a recipe for disaster.  And don't even get me started on the politics, because these factions don't have defined lines whatsoever.  \\n\\n\r\nAnd so, with that, you may be asking yourself, what about the thing that people care about?  The ecchi?  Well, likewise to its season one counterpart, there's no shortage of that.  In fact, they go to the extent of having full-on orgies with the girls because Production IMS thought that putting more than what was \"needed\" was a good idea.  They're honestly quite tasteless and just serve to give whoever enjoys this show a stiffy complete with sensual moans, boobs flopping all over the place, and lots and lots of fluid.  (Wait for blu-ray release for the full experience.)\\n\\n\r\nIn short, I'll be honest here, the show is basically softcore porn with only the skeleton of a story added into it.  While the show puts a bit more focus onto the 'story' aspect of the show, nothing about what was going on felt organic or even made any sense as the 10 episode runtime rushed everything to the point of losing several possibly important details behind, and thus losing what little credibility that this series had.\\n\\n\r\nOverview:\\n\r\n+ Porn  (I mean technically, you get a pornographic experience out of this, so that's a plus, I guess.)\\n\r\n-  Horrible pacing\\n\r\n-  Missing plot points\\n\r\n-  Incomprehensible plot\\n\r\n-  Forced well...everything\\n\\n\r\nCharacters:  The characters as well for this series are really quite a treat.  Not only do we have our resident harem king and his resident bitches go back into the spotlight, but we have a whole slew of unimportant plot devices added into the mix as well.  \\n\\n\r\nSo, let's start with the main cast.  (Because I am not analyzing these asshats one by one again.)  Like before, we have the main characters of the series; Basara, Mio, Maria, Yuki, and a new edition that we met back in season 1, Kurumi.  Like before, they all are pretty much the same kind of people as you'd expect them to be coming into season 2.  Basara is our resident badass who wants to protect his 'family' (aka, his girls.), Mio is the main female who oddly enough is more willing to go into her sex slave role (when did that happen, exactly?), and Maria and Yuki are pretty much the same, etc, etc.  \\n\\n\r\nSo, what's to gripe about these guys?  Well, they're just not interesting.  All of them fall into a category of trope in one way or another and nothing about them feels natural.  Their motivations all feel fake and forced upon, and for the most part, nothing has really changed.  Well, that's aside from the inseki acceptance, but that was gonna happen anyway.  \\n\\n\r\nAs for the side characters, many, if not all are extremely underdeveloped.  A lot of the show takes place in the demon realm and adds in this whole new layer of people and characters that should've made the series seem so much better, even adding in some of the old ones from season 1 like Maria's mom, Basara's dad, or even my personal favorite, Lars.  But even with this new setting and this new chance at redemption, the show doesn't even try to get you to fully understand who these new people are, because all of them are just plot devices that either get offed early, or get offed later.  Either way, they get offed without really any reason.  Seriously, we have some 'villain' who just sit in the shadows and get killed without much happening to them.\\n\\n\r\nOne of my biggest complaints comes with the character Leohardt, the 'new demon lord' for the demon world.  Leo as a character was made to be the central 'villain' to this season and the reason for the main characters to even come into the demon realm.  But throughout the series, through the show's lack of any sort of explanation, his reasoning for doing anything just doesn't exist or is just forced upon him like the development for everyone else.  He, like everyone else gets shafted to the extent that it makes no reason why he even does anything anymore.  \\n\\n\r\nOverview:\\n\r\n-  Bland characters\\n\r\n-  New characters are just as bad\\n\r\n-  Confusing traits and/or forced, uneven development\\n\\n\r\nArt: Art for Sister Testament is relatively the same as it was in season 1 in terms of quality and appearance.  Like before, I will sing as much praise as I can for it because the show is pretty standard for anime these days, just going the extra mile for the way that the magic and the character designs are for some of the characters.  Cause honestly though, some of these designs are pretty nice.  \\n\\n\r\nAnd for ecchi, well, you know what to expect if you've seen this series before.  If you don't know what I'm talking about, well, picture this.  One guy, surrounded by five girls, two of which are extremely busty, three who are average in bust, all playing with each other (using various other outside things as well), with boobs flopping all over the place, and fluid EVERYWHERE.  (I swear only half of it is sweat.)  And that's just about your average ecchi scene in Sister testament.  And bear in mind, this is how these characters get stronger.  :P\\n\\n\r\nOverview:\\n\r\n+  Decent artwork\\n\r\n+/-  Ecchi, hardcore ecchi  (This all depends on your view of ecchi.)\\n\\n\r\nSound:  As for the sound, the tracks that they use this time aren't really all that noteworthy.  Contrary to the OP in the first season made by Sweet Arms, these bundle of tracks really aren't that great or memorable.  \\n\\n\r\nPersonal Enjoyment:  Alright, now time for my opinion.  What do I think of this show?  Well, if it wasn't clear enough before, this show is shit.  I've noticed a trend in the past few years that any time a series gets a season 2 with only 10 episodes, the quality is going to drop.  This happened with DAL II, Hitsugi no Chaika, Prillya, and now, Sister Testament.  The reason for this is because of its tiny runtime only being able to squeeze so much, eventually losing out on a large amount of detail because they don't have an extra 40-60 minutes to help develop the story more like a normal anime runtime does.  And so, now onto my real thoughts.\\n\\n\r\nDid I like this show?\\n\\n\r\nOh HELL no.  HELL no.  This show is an abomination and an insult to any shred of dignity this series had left simply because it just lacked any kind of substance.  Anything that they made was hollow in terms of explanation and tried to make up for it with boobs, boobs, and more boobs which of course, didn't help this show's case at all.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nEverything, basically. None of the new supposedly important characters got any attention, the 10 episode runtime doomed this series from the start, and the soundtrack is really average at best.  If anything, this show's only saving grace would be its artwork, but it's not stellar either, so it doesn't really save all that much.   \\n\\n\r\nWould I recommend this show?  \\n\\n\r\nYea-no.  In fact, I would go as far to say that the entire Shinmai Testament series is a complete waste of time.  It's a series devoted to pandering to a certain audience and provides a less than mediocre story to fill up the 'empty space' between all of the ecchi moments.  Cause if nothing else, that's the only reason to watch this show in the first place.  So, if you're in the need for some fapping material, go ahead; it's all it's good for.  If you want some quality entertainment or just general entertainment period, I would suggest looking elsewhere.",
            "date": "2015-12-11T16:10:00+00:00",
            "helpful_count": 28,
            "mal_id": 205266,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=205266"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nShinmai Maou no Testament Burst has an affinity for bathing. That makes sense. An ecchi anime without a bath scene or two is like an anime without animation – it is almost unheard of.\r\nFor myself, bathing has never generated any exceptional stories. Save for one.\r\nGrowing up, I’ve always liked minty snacks. But, as a young kid, I took it a few steps further. When I bathed, I had this plastic container that I would fill with both water and toothpaste because the toothpaste tasted like mint. And, as the weirdo I was, I ate mywatery-tooth-pasty concoction. Not just once either. Every shower, be it Crest or Aquafresh, I would partake in my makeshift, minty mousse.\\n\\n\r\nThe outcome? I would get sick. Many a night I had tears in my eyes and a bucket in my lap as I vomited a mixture of water, toothpaste, and SpaghettiOs. I did not learn my lesson for quite a while, but, suffice it to say, the only toothpaste I “eat” nowadays is by accident when brushing my teeth.\\n\\n\r\nI tell this tale because watching Burst is like eating toothpaste: Its pleasing at first, but the bile aftertaste cannot be avoided.\\n\\n\r\nSTORY\\n\\n\r\nBurst continues on from the first season. Basara still has his Banishing Shift, Mio cares deeply for her Onii-chan, and Yuki remains as forward as ever. However, there is evil afoot. Evil that this harem has to contend with.\\n\\n\r\nBefore diving into the bosom of the anime, some positives deserve to be pointed out. For starters, the anime adds more members to the harem: Yuki’s younger sister Kurumi and Zolgia’s former bodyguard Zest fall for Basara. Expanding the harem in a harem-focused anime is usually not a negative, so it deserves some props.\\n\\n\r\nBurst also deserves props for continuing to make its sexual content purposeful. As with the first season, in order to strengthen the bond between Basara and the girls as well as increase their power, they must take part in lewd activities with each other. Having ecchi material for fun is fine, but having it be important to the narrative makes it that much more of a positive. So, once again, Burst gets props.\\n\\n\r\nUnfortunately, where the anime begins to waver is in the activities themselves. In short, it’s a mixed bag. On the one hand, the sexual scenes more often than not take place in a bath or shower with one-too-many breast-to-back washings, inducing repetition and therefore a lack of creativity. On the other hand, some of the sexual scenes are quite nice. The girls cosplaying and the entire harem going at it at once demonstrate that Burst understands how to do ecchi content right when it wants to.\\n\\n\r\nPast the harem and the ecchi is where one begins to taste the bile. The ten episodes of this season are split up into essentially three different arcs. The first involves the school festival and the ensuing battles. The second involves a trip to the demon realm and the machinations therein. And the third involves a whole lot of fighting. All three are some combination of lame or boring.\\n\\n\r\nIn the first arc, a lot goes down. Yuki uses her butt to bump balloons, Basara loses his arm (for a short time), and both gods and vampires are introduced. While the sex scene with Hasegawa-sensei is beyond steamy (and welcome), many of the elements of this arc are not used later. For instance, the vampires and the heroes have no place. Hasegawa-sensei and the god-related information has no involvement. And even something as simple as Lars speaking with Mio and Yuki about killing Basara if they have to does not have such foreshadowing addressed since they never once attempt or even think about killing him – even when he rampages.\\n\\n\r\nIn the second arc, even more goes down. Political maneuvering by the moderate faction, the reigning Demon Lord, and the Demon Council make life difficult for Basara and the harem. During this middle stretch, character setup and event setup takes center stage. Massive entities called heroic spirits are introduced as is the catalyst for the rising of their leader Chaos. Basara and the gang get trained for the eventual tournament. And, all the while, sex runs rampant. Simply put, it’s middle of the road material.\\n\\n\r\nIn the third and final arc, the most goes down. Almost everybody fights somebody else. Mio crushes a heroic spirit. Maria loses to Lars. Kurumi gets tricked by her adversary – he later gets demolished. (That’s putting it lightly; the dude gets his arms cut off and his body beaten beyond recognition.) Yuki decimates her opponent (the brother of a villain from the first season) with an unseen flurry. Basara squares off against Leohart. And they, with Mio, quarrel with Chaos while everybody else deals with protecting the city.\\n\\n\r\nThis last arc reduces the ecchi density, and that’s a problem for this ecchi-centric show, but a bigger problem exists. Namely, too much villain clutter. Before the tourney, Ramsas, Leohart, one of Leohart’s followers named Gald, Lars, and a lesser lackey named Nebra are all antagonists. Then, during and after the tourney, the Demon Council, a helper of the Demon Council named Viscount Admirath, Chaos, and Leohart’s older sister named Riara are added to the mix. But, to make matters even worse, some of the initial antagonists flip sides, making it hard to say who exactly the group is combating let alone what they are combating for.\\n\\n\r\nStill, the outcome of this clutter actually has some merit. Basara killing off a high-ranking, dangerous figure stops the radicals from revolting. The murder of the entire Demon Council (at the hands of Riara) removes a lot of tension in the demon world. And Basara and Mio working with Leohart to stop Chaos and subsequently save the city gives Mio indirect protection from would-be pursuers because, now, wars will die down and a “path to peace,” as Basara’s father Jin puts it, can be traveled.\\n\\n\r\nThe final scene of Burst has each of the girls of Basara’s harem throwing themselves at him. Said scene succinctly sums up the anime. The season has a narrative that is not too concerned with delivering a profound message. Instead, all it wanted to do was deliver some sexual goodness with an action-heavy plot on the side.\\n\\n\r\nYet, on both fronts, it did not hold up all that well.\\n\\n\r\nANIMATION\\n\\n\r\nMuch of Burst’s art has no redeeming qualities.\\n\\n\r\nThe lighting is not played with, the cinematography does not go beyond the standard, and the backgrounds are plain. In particular, episode eight has shot of the audience from afar, but they all appear to be human. Considering they are in the demon world, and that people of irregular skin colors had been shown moments prior (e.g., green, dark blue, etc.), this mistake was either an oversight or slight laziness. Of course, this observation is nitpicking, but it somewhat indicates the care the art received.\\n\\n\r\nIn terms of animation, Burst has a lot of fighting that goes on over the course of the season. “Fighting,” though, may be the wrong word. The fights usually consist of lots of explosions. Lots of explosions. Mio creating a black hole, Ramsus generating gravity magic, and Jin evaporating a section of a forest whilst training his son leave very little room for choreography and, hence, a reduction in actual animation.\\n\\n\r\nBut this reduction is done for an obvious reason: the ecchi content. For Burst, it puts as much attention as it can into its sexual scenes. Breasts jiggle, tongues twirl, and bodies dance, creating one libido-driven spectacle after another.\\n\\n\r\nReturning again is the anime’s brand of censoring. When nipples or too much below the waist would have been shown, the anime overlays these naughty bits with cutesy miniatures of the characters. This time around, there are even more variations, like Zest in a maid outfit with spatulas that form an X or a distressed Kurumi that does her best to hide herself. While the censoring is certainly unfortunate – arguably a detriment – having it be a comedy bit as opposed to a total nuisance makes up somewhat for including it.\\n\\n\r\nAlso returning are the nice character designs. Symbolism still exists: Mio’s red symbolizes her fiery passion, Yuki’s blue symbolizes her coolness, and so on. The newcomers get the same treatment: Kurumi’s purple symbolizes her sense of respect, and Zest’s yellowish-green symbolizes her happiness and stability. Besides the colors, the girls do not change their outfits all that much, and the outfits they usually wear are not that detailed. Regardless, the girls have pretty faces and ample figures, increasing their attractiveness and thereby improving their ecchi scenes that much more.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Burst finds a lot of difficulty in being more meaningful than just the sex they so often showcase. And, to some extent, that’s fine. What the girls lack in thematic weight they make up for in fetishes. At least, the harem girls do.\\n\\n\r\nMio’s all about her breasts, Yuki has her butt, and so on. To put it differently, the girls have a specialization that differentiates them beyond just their personalities. Plus, having such sexual diversity only improves the ecchi content.\\n\\n\r\nExamining the cast beyond their sex-centric traits begins to reveal problems.\\n\\n\r\nStarting with Basara, he arguably ends up as the worst character of the bunch. He acts as a standard, harem lead: ultra-powerful, overly kind, and surrounded by beauties. These traits are fine since the audience is more or less meant to self-insert into his role. It’s more everything else that hurts him.\\n\\n\r\nFirst, some explanation. This seasons sees Basara struggling to contain his power. Early on, he’s shown to have no control, prompting Jin to train Basara harder. Jin also drops the most important bit of info – Basara has to eliminate his so-called “limiters” if he stands a chance of beating the baddies and reigning in his beastlike power.\\n\\n\r\nJin essentially tells Basara that these limiters are personal battles, conscious and subconscious wars that Basara has to win to overcome. But Basara does not do any waging. In fact, he almost cheats, taking some (alluringly heart-shaped) drugs to overcome the limiters placed on him and, subsequently, his power. It feels entirely like a copout – rather than progressing as a person, he just pops some pills to save the day. He continues to prove his own lack of development when he is unable to stop himself from rampaging once again near the end of the season.\\n\\n\r\nCue Mio. A lot of Mio’s character revolved around Basara. If she was compatible with him. Placing trust in him. Whether or not she could protect him when he needed it most. In this way, a lot of her actions have him in mind: debasing herself to enhance the Master-Servant pact, going berserk herself when she believes Basara has perished, and believing in him when he asks her to.\\n\\n\r\nMio has conflicts of a more personal nature. Going back to the demon realm creates feelings of trepidation and uncertainty, feelings that she does her best to confront. But, in a nice bit of writing on Burst’s part, this conflict ties back to her relationship with Basara. Instead of going at it all alone – like the Mio of last season may have done – she leans on him and, to some extent, her other friends.\\n\\n\r\nThe peak of Mio’s character happens at the trough of Basara’s. As Basara rampages, still unable to control himself, Mio does what Basara has always done for her: She rushes to help him. Granted the whole wading through his mind is a bit too magical for the anime, but it lets Mio return the favor by being there for Basara. The sexual nature of this encounter may seem out of place, but, when ecchi is so common and their relationships are literally strengthened through sex, it makes perfect sense in context. And so Mio, rather surprisingly, becomes the best character Burst has to offer.\\n\\n\r\nA few other characters are worth talking about: Yuki, Maria, Lars, Kurumi, and Zest.\\n\\n\r\nYuki’s handled strangely. Throughout a sizeable portion of the season, Yuki has nightmares of losing her friends and huge concerns for Basara. Essentially, she worries about losing those close to her – similar to what happened in the past. But neither of her problems are confronted. She fails in protecting Kurumi and Maria, and, even more strangely, she never says a single word to Basara about her worries. To be fair, Kurumi gives a small piece of encouragement to Yuki, but it is not nearly enough to compensate for how poorly her character unfolds.\\n\\n\r\nThe anime also tries to make Maria into a more meaningful character. Her older sister Rukia demonstrates just how immature Maria tends to be, but a lack of interaction between the two of them – be it conversation or even just battling side-by-side at length – fails to make this parallel purposeful. The parallel of Maria and Rukia with Yuki and Kurumi also goes nowhere besides quick shots of all of them battling together in the finale.\\n\\n\r\nThen, during the tournament, Lars chides Maria for trying to use her unlocked power, claiming that her trying to wield such power without first controlling it is futile. His words ring true when she loses the fight.\\n\\n\r\nThis idea both works and doesn’t. It works because it ties in with her immaturity and has parallelism with Basara’s own struggles. It does not work because her unlocked power was never used or called into question beforehand, and she neither uses nor reflects on her power afterward, making Lars’s words feel empty.\\n\\n\r\nAs for Lars himself, he ends up a bit better character-wise. Largely because he sits in a morally ambiguous spot – his allegiance coincides with his own personal desires. For him, that’s revenge against those that hurt him and his friends oh so long ago. At the same time, he has moments of humanity, advising Maria and helping Basara and warning both Mio and Yuki. That is, he focuses on aiding himself while also aiding those around him. Usually in whatever way best suits him.\\n\\n\r\nThat explains his mask: His motivations remain hidden behind a veil of ambiguity. Unfortunately, this depth is as deep as Lars’s character goes. He does not get the chance to (directly) exact that revenge, and he does not have a large enough presence within the anime to greatly affect the characters and the outcomes.\\n\\n\r\nKurumi and Zest are last. Besides being the newest additions to the harem, they represent the concept of acceptance. Kurumi is naïve and Zest has never really had people who cared about her for her. Despite this, Basara, Mio, and the others (especially Maria in Kurumi’s case) accept them into their circle, providing them with the camaraderie and friendship they have always sought. Their characters do not get much more than this, but it was nice to see them get something.\\n\\n\r\nOverall, it’s hard to say how strong the cast is. Mio sits at the top, Basara’s at the bottom, and everyone else is in-between. But the balance tips more towards Basara’s end than it does Mio’s, sexual specializations or no.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track of Burst is, at first listen, nothing special. Some nice singing accompanied by a rock-n-roll and orchestral composition make the song both cool and lofty. On second and third listens, however, the song changes. Becomes different for two reasons.\\n\\n\r\nOne, the vocalist changes. Rather than sticking to one singer, the track switches the singer multiple times creating multiple versions of the piece. Two, some of these versions include sound-effects. As the song plays, one can hear Yuki slicing at a heroic spirit or Maria landing with immeasurable force on a roof. Technically these sound-effects get in the way of the OP, but they, however slightly, make the track somewhat special.\\n\\n\r\nThe ending track does change up its visuals but not the actual music itself. This track as well combines the rock-n-roll and orchestral compositions, making it sound a lot like the OP. The major difference here is that the ED likes its background choir. It’s a painfully average piece that barely deserves to be deemed an ED.\\n\\n\r\nThe rest of the original soundtrack is likewise par for the course. Burst includes hard battle tracks for the numerous fights it contains. It includes ominous tracks for the dramatic times and softer tracks for the melancholy ones. And it includes grandiose tracks for those steamier moments. Nothing extraordinary, nothing awful. Just a whole lot of passable.\\n\\n\r\nThe only section that performs well is the voice acting. Sarah Emi Bridcutt as Yuki, Yuu Asakawa as Hasegawa-sensei, and Seiko Yoshida as Zest (with shout-outs to the other voice actresses) not only have voices befitting their roles – cool, mature, and subservient respectively – but also their screaming in the streets and moaning in the sheets is duly appreciated.\\n\\n\r\nENJOYMENT\\n\\n\r\nI cannot deny that the only reason I decided to watch the sequel was for the ecchi content therein.\\n\\n\r\nAnd, for the most part, I liked the sexual scenes quite a bit no matter how repetitive they could be at times. Though there were two big issues: everything not ecchi and the character density.\\n\\n\r\nIt says a lot that whenever the anime was attempting to push action or drama that I just wanted them to get back to showing off Mio and the others half-naked. The vampire kid in the first arc was lame, I did not care for Leohart and the politics, and the tournament with its heroic spirits made me yawn. Luckily the tournament had the cat-girl announcer in the skimpy outfit (yet another fetish added to the anime’s list) to give me something worth watching.\\n\\n\r\nThe second problem was the character density. By “character density,” I simply mean the proportion of the character’s on-screen time to the overall season. This includes ecchi content, too. I am partial to Yuki, Hasegawa-sensei, and Zest, but they have some of the lowest character density. Hasegawa-sensei only appears in the first three episodes with just a single ecchi scene of her own. Same goes for Zest but in the middle of the season.\\n\\n\r\nYuki, however, is the most disappointing. She’s around, but she does a lot more fighting and worrying than interacting. Worse still, all of that fighting and worrying cuts into the amount of ecchi content she gets – nothing short of a shame.\\n\\n\r\nShinmai Maou no Testament Burst does not so much burst as it does fizzle. Almost everything, from the story to the music to the entertainment, has issues that the anime has difficulty correcting. On second thought, eating toothpaste may not be all that horrible of an alternative.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the harem expands and the ecchi is purposeful, but repetition in the sexual scenes and a shoddy plot create a subpar narrative\\n\\n\r\nAnimation: Fine, bad artistic direction, okay actual animation, funny censoring, and nice character designs\\n\\n\r\nCharacters: Bad, the girls specialize in fetishes, but, with the exception of Mio, the cast has too many problems or are simply not relevant enough\\n\\n\r\nSound: Fine, okay OP, bad ED, okay OST, good VA performances\\n\\n\r\nEnjoyment: Bad, while the ecchi content was appealing, the action and drama, as well as a lack of Yuki, Hasegawa-sensei, and Zest, was not\\n\\n\r\nFinal Score: 3/10",
            "date": "2016-09-17T17:39:00+00:00",
            "helpful_count": 10,
            "mal_id": 229246,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=229246"
        },
        {
            "content": "To me when it comes to a sequel, at the time the show makes or breaks the show. To be precise what I mean, a prequel series may need something to redeem itself to become at least something for the liking of others, however when a show breaks, it becomes something not a worth while. To keep in mind also this review is coming from a person that actually didn't liked the first season, and due to some certain personal stuff going around with someone else regarding on this show, I gave this another chance in order to regain the show as a whole. Butwell, unfortunately, this is where I say it just worsens in a way.\\n\\n\r\nComing to the sequel of the Testament series, expecting to be expected, to see the runtime of the show being 10 episodes, I personally felt like the runtime was not enough to hold onto its quality of the show, even if the first season is bad. To say the least the runtime didn't hold onto the quality of the show, in fact, it worsens throughout the episodes, because of course, due to the runtime, it doesn't give too much explanations to its characters and neither does the world. In all honesty the story just becomes as a pile of mess of puzzle pieces where you can't even know what to even understand it from. It's a total definition of a train wreck where you basically only see an ecchi with a story. In all honestly I just think the show needed more to an extension to explain somethings out, even the final was at least satisfying, it was not nice at all in my personal opinion. The pacing in itself is also horrible, as I said, it felt very fast and the most things I see in this anime series would be basically more boobs and asses than before. Because of course season 1 had it, but it also had somethings that kept to my interest in a way to have a spark that it can turn out to be better. To be honest I just don't get it, for me personally the show is a mixture of a story telling and soft core porn in a nutshell. It's basically that, it's soft core hentai series, where you just basically go and have a fap fap fap moment. The first season was basically bad, but it had some moments where it actually made me interested, but the second season just completely butchers what it could actually offer, and instead we get a big messed up knot.\\n\\n\r\nAs for the characters, I really can't say much do I? They're just your stereotypical bland characters in my eyes. Yes they can be fun, I can see why people like them a lot, however these characters are extremely bland and they barely get any development. The new girls getting introduced just become as useless to my eyes, of course that's just how I look at things towards the anime series. One thing's for sure, these characters are just cookie cutters but enjoyable depending on your taste on archetypes or if you want a mix of girls with big boobs and small boobs, tsunderes or anything. The only thing these girls are used are on the level of ecchi in a new level. I mean, hell, if you don't get what I mean, go check for yourself what I mean by the new level. \\n\\n\r\nOne question to keep in mind is if I like even one or so characters if they are bland. Well, yeah I do. I like Nonaka Kurumi which she's in my personal eye adorable and I also like Maria. Basara? Yeah in a way I do. It's not saying much. \\n\\n\r\nIn the overall way the characters are just bland, but can be enjoyable depending on your taste on girls and archetypes. Think about it and keep that in mind.\\n\\n\r\nNow for the art and animation? Let's be honest, the art is standard and decent enough, not much of a redeeming factor into the show but it still kept its budget in a way, somehow. Character designs still being the same with only a few ones being nice and at least adorable. And yes, I said adorable, don't ask me. Now for the animation, is nice and alright also, although the potential of the animation was wasted if you get what I mean from that factor.\\n\\n\r\nMusic, for the original soundtrack that just goes for my personal point. I like the soundtrack however for me it's not memorable or the slightest listened out of the anime series, that just depends for me technically. Sound department can be describe as... well, good in a way. I will just say that, if you watched the prequel and the sequel by the time you read this review, you would get my point why I'm saying this for.\\n\\n\r\nFor the Opening and Ending of the second season, I personally prefer the Ending song more than the Opening song, and here is the reason why I'm saying this for. The Opening song depending on the taste of others, in my opinion it was actually catchy but soon afterwards it just became boring. The other one can be considered decently done and I still like to listen to it. Overall I think you would have an idea of which Opening I prefer in the overall series, and yes its Opening 1. I find that more memorable and catchy, and composition being well done.\\n\\n\r\nOverall Veredict over the show:\\n\\n\r\nEnjoyment: I guess to say I have mix feelings with the show when it comes to my personal enjoyment. I will be honest, I personally enjoyed some parts of it and at the same time I did not. I think ecchi is a hit or miss for me because yes, I like ecchi towards an extension\\n\\n\r\nOut of My Enjoyment: The show in my personal opinion would be considered as a train wreck and a lost of opportunity to become something more to offer on the table, rather than having a small runtime and wasting the potential it actually had to become something worth while or having the same quality of the previous season to stand up in a way. It epically went to a thirsty series where its just a waste and when people complain about other ecchi series, I really want to ask which are the more wasteful and worse than the others. Because trust me I have seen the many and there are others way better than this even with its cliche stuff. \\n\\n\r\nI'm not saying this is the worst I have ever seen, but its just wasteful. Unless you just want to have a pass along series just for the sake of either your self indulgence or just you want to see something to get towards dose of fap material.\\n\\n\r\nMy suggestion:\\n\r\nIf you have seen the first season, and want to watch the second season, this all depends on you. \\n\\n\r\n- If you want to watch the second season just for ecchi instead of the story, then go for it. You might find something to your liking\\n\\n\r\n- If you want to watch the second season but you're having a mindset that it will get better, I think you need to watch something else. This show has nothing to go forward towards when it comes to the story.\\n\\n\r\n-If you have not seen the franchise, if you want just to have a fun time for yourself or just to have some sort of nice ecchi series, you can watch this. \\n\\n\r\n-If you have not seen the franchise but you want a story worth while, then you're going to waste 22 episodes of it if you happen to go onto this instead of watching something more decently.\\n",
            "date": "2015-12-12T07:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 205328,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=205328"
        },
        {
            "content": "French guy here so don't blame too much for bad grammar, please.\r\nWell, well, a new season of HDxD's copy then. Let's see what is about.\r\nSo, Shinmai maou no testament burst is about a harem who fought against gay demons, and that's all. This anime is a way more worst thant the first season who was already a waste of time, except if you love to get your face crushed in giant breast for the whole episode. \r\nAnd we are there now, after the encounter of the most charismatic antagonist of all time ( god I love sarcasm ), harem-shit team continue they fantastic adventure inthe real world of the true reality. Between two ( almost ) hentai scenes, we get to know that there is some trouble outside and random people started to use magic to kill the protagonist. Except the fact of \"how normal people could use mana\", more boobs appears every second. After, demons, boobs, fight, boobs, demons, demons, gay demons, boobs and end.\\n\\n\r\nWhat are you expecting of ? This is the lower-level of japanimation, just a soft-core hentai melted to a crappy storyline. All the interest lies in the \"arguments\" of female characters, nothing else. This is unoriginal, gross, stupid, dirty and mercantile. Nothing happened, the real time duration is like two days, characters are stupids, fights are lame and the ending is like \"yay, everythign turns good, let's get in a big orgy pile together !\" exactly like how the first season ended.\\n\\n\r\nThe art is not that bad but not that good for a 2015 anime and all the efforts are gone in the animation of deh bubs. The sceneries are bland on my opinion and extremely repetitive. \\n\\n\r\nThe sound is hilarious, nothing to say.\\n\\n\r\nAnd I'm clearly NOT enjoying this, everything is so predictable that I can see come the outlet of a fight three episodes in advance.\\n\\n\r\nSo this is garbage, if you want an ecchi-harem anime who's well balanced, funny and pleasant to watch, go take a look on Highschool DxD. I'm not saying that's a good anime still but it's a way better than this piece of crap.\\n\\n\\n\\n",
            "date": "2015-12-12T04:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 205308,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4597014.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Zkoctober",
                "username": "Zkoctober"
            },
            "url": "https://myanimelist.net/reviews.php?id=205308"
        },
        {
            "content": "Quick n Dirty Review: \r\nIt's a fun series to watch. Is it gonna blow your mind with character development and detailed extensive stories? No. But it's fun as hell, made me laugh quite a bit, and I didn't have to skip through a ton of pointless exposition. \r\nStory: By the books, nothing original but nothing bad. Average score. 5/10\r\nArt: Art is fine. Nothing negative to say, and Basara at the end is awesome. 7/10.\r\nSound: Music is fine, voice acting is great. 7/10.\r\nCharacters: Characters are interesting in that they play their tropes very well. And the main Protag doesn't spend 90% of the anime crying abouthow weak he is (I really REALLY hate that). The girls are fun, and the Mio is still great. 8/10\\n\r\nEnjoyment: This is a very weird category, but I absolutely enjoyed the crap out of it. I spent all day at work excited to get home so I could watch the last 3 episodes. I had a great time watching this series and absolutely don't regret it. 9/10\\n\r\nOverall: Because math, my overall rating is a 7/10. (7.2/10 really)",
            "date": "2016-01-23T22:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 209239,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1654687.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dizturb3dwun",
                "username": "Dizturb3dwun"
            },
            "url": "https://myanimelist.net/reviews.php?id=209239"
        },
        {
            "content": "Uch, if I wanted to watch something this perverted, I would have just watched a hentai. I mean, I'm all for ecchi anime and I don 't mind fan-service, but the amount in this series is just so over the top, it literally feels like they're just trying to see how much they can get away with before they get slapped with a hentai label. The story is average, and the characters are fine, but it seems like they're trying to find any excuse to dive into an orgy scene with a new type of fetish exploration. Would have appreciated more fight scenes and moreof a plot. I give it a 4/10.",
            "date": "2019-03-02T16:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 302771,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/moviefan",
                "username": "moviefan"
            },
            "url": "https://myanimelist.net/reviews.php?id=302771"
        },
        {
            "content": "Shinmai Maou no Testament Burst follows Basara a former hero who now lives with Demons huge twist right? Basara was instructed by his dad to take care of them as if they were his own blood. So Basara being the person he is agrees to take care of them this is where things get interesting. Mio is actually the daughter of the former demon king. Throughout this series Basara must protect Mio from people who want to bring her harm do to her power of being the former demon kings daughter. This series doesn't have a very strong story behind it besides Mio being daughterof demon king and Basara in charge of protecting her. The awesome battle scenes make up for it a bit but it is also a pretty hardcore Ecchi which is not really the typical thing I like. Its pretty close to softcore Hentai but none the less still pretty alright due to the amount of action in this series makes up for a little bit of this, this is in no means a series I would recommend but I wouldn't really say stay away from it ether. My opinions on this is without the battle scenes it would be a poor attempt at a hentai with little to no story, strong scenes of ecchi, and intense battle scenes this series is a decent watch.",
            "date": "2015-12-23T11:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 206564,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HabitPlays",
                "username": "HabitPlays"
            },
            "url": "https://myanimelist.net/reviews.php?id=206564"
        },
        {
            "content": "(This review covers both seasons as it was meant to be seen and will be on both seasons review section.)\r\nShinmai Maou no Testament comes to a close on this final season. I think is fair to say that it excelled as a successful \"Ecchi\". The Succubus factor not only delivered mind blowing fan service but assimilated well the action elements as well as to rid the common problem of the Hero vs Demon premise suffers from. Locations of peers when kidnapped as well as growth of our protagonist on a steady pace thanks to the aforementioned succubus factor.\r\nWe are left with many questions and Icertainly feel compelled to check out the Light Novel. The story is standard given spice and the elements thrown by the author are very creative, Made use of many cliches and some ideas found on other Light Novels and boosted them to his advantage.\\n\\n\r\nArt  = 8\\n\r\nThe art is very good on regards to the cast, not so much on the enemies. The animation was very good however it didn't steal much.\\n\\n\r\nSound = 8\\n\r\nThe sound is very good and the OP / ED were among the best I may add.\\n\\n\r\nCharacters = 5\\n\r\ni was a bit disappointed on characters since they seem a bit robotic at times and the personality of the villains was a tad cringy.\\n\\n\r\nEnjoyment = 10\\n\r\nDespite it's flaws I very much enjoyed this anime as a whole. The Ecchi factor which is the heavy weight on this installation came through flying colors and was done unusually and well as some high level Fan Service. If you're an Ecchi fan this is for you, I may warn you it's more extreme than DxD and not as good.\\n\\n\r\nOverall = 8\\n\\n\r\n8 + 8 + 8 + 5 + 10 = 39 / 5 = 7.80 rounding up to the nearest 10th. Overall 8.\\n",
            "date": "2016-07-03T19:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 223023,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=223023"
        },
        {
            "content": "What happens when you try to make an anime out of a nukige\r\nStory: 2/10\r\nNot giving 1 because it actually has a story, even though it's just as bad as any hentai out there because this kind of Demon Lord setting is extremely overused, so creating a good story with it is a hard thing, but many enjoy even if it's just like the others, so it's like an assurance to have audience.\r\nThe plot goes like this: \"Basara!\" \"Aahh!!\" *Random Ecchi Scene* -> *Some bad attempt to make MC look badass* -> *Fight Scene* -> Repeat the cycle\r\nBefore watching the first season I thought Shinmai Maouno Testament was an parody of Highschool DxD, but after watching episode 5 of the second season I noticed they didn't intend to stop their shitty parody there, because they tried to copy Akame ga Kill and Shingeki no Kyojin but it was so badly done I had to laugh.\\n\r\nWhat bothers me the most are those borderline hentai scenes in the middle of the episode. They are so random that in the next scene it's like it never happened. Besides, if I wanted to see these kind of scenes I would be watching hentai, for god's sake. \\n\r\nSo much time is lost with stupid dialogue: \"What do you think will happen to me?\" \"Don't worry, I will always be with you\". Whoever the fuck wrote this shit doesn't realize that this doesn't make the MC look good, because the smooth talking is so repetitive it sounds like hentai.\\n\r\nAfter the shit-chat one of the characters goes all out (or it seems to us) to look good, but in the end he/she just explodes something or doesn't do anything at all.\\n\\n\r\nArt: 5/10\\n\r\nWithout censorship it looks like hentai, with a little better animation. The demons are nicely done so in the character aspect, all good.\\n\r\nI don't think having the characters use other clothes is that much of a hassle, but in Shinmai Maou no Testament it seem quite troublesome because either the characters have no clothes at all or they wear their school uniforms. Even in hell. Literally.\\n\r\nAnimation is so bad that it makes the fights seem \"lifeless\", and in a futile effort to cover the poor animation they make everything blow up. But it's still no good.\\n\\n\r\nSound: 7/10\\n\r\nOpening song is actually nice, if it wasn't for those sound effects in the background that ruin the whole song. The rest of the sounds in the anime are almost all from explosions. Maybe some music when there are fights, but nothing special.\\n\\n\r\nCharacters: 2/10\\n\r\nNo character development. For the contrary, they go back the steps. It's so annoying when Basara and Mio almost have sex one scene, then next scene Basara calls Mio his sister (\"Don't touch my imouto!!\"). Siscon much?\\n\r\nEveryone is so emotional, it's like they have some kind of emotional disturbance. They see one of their friends get hurt and go full rage mode so often it doesn't even affect me anymore.\\n\r\nThe MC looks so cool, then when he finally fights, he's actually weak as fuck. Every. Single. Time. *sighs*. Got to give extra points because Basara isn't oblivious to the girls' feelings, like any other harem MC. And he actually does stuff to them (even though they don't go all the way).\\n\\n\r\nEnjoyment: 2/10\\n\r\nThe series is so simple and cliché is just painful to watch, there is almost no enjoyment. Everything I expect to happen, happens. There is no mystery or thrill whatsoever, because the plot lacks creativity.\\n\r\nAt least the MC doesn't run away from the girls when the time comes, but they could implicitly show the characters having sex, after all those ecchi scenes are close enough, so it wouldn't hurt to at least say that they crossed the line.\\n\\n\r\nOverall: 2/10\\n\r\n It's not worth your time. If you want an actual action/harem anime that has both \"plot\" and plot you can go watch HSDxD. This one here can be considered a cheap copy of the first.\\n\r\nBasically no romantic development (when you think it developed it goes back to square one), cliché/unrealistic dialogue (hentai-like), boring fights and meaningless fan-service.\\n\r\nI'm sure a hentai of this would suit it far better than an entire shitty anime. \\n",
            "date": "2015-12-14T16:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 205551,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4712327.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Schzzy",
                "username": "Schzzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=205551"
        },
        {
            "content": "Story: so the story this time around is that in that all Basara and his friends end up getting called down to the demon realm cause of this of course new problems arise of people that wants Mios powers but to also top that off they end up having a tourney to decide who will get mios powers either the demon king and or Basara himself (well more of like not them getting killed and also keeping Mio away from them)\r\nArt: art is the same the powers are pretty cool and so are lewd parts as well\r\nSound: OP and ED are meh at best ipersonally wont go looking for them and downloading them otherwise the characters sounded good.\\n\\n\r\nCharacters: Basara is the main guy of the anime and well he is pretty shy when it comes to the pervy parts but in action he is a total bad ass. Mio one of the main girls she is the demon lords daughter and honestly she can be a perv and also not she is pretty sweet and what not. Maria is another main girl of the anime and the succubus of the anime and she basically like Mio in a sense but she is like hella pervy in the anime and even recording the lewd thing happening. Yuki is the last main girl form the anime and is also basara long time friend she is pretty sweet she really doeskin show that much emotion most of the time unless really in battle but still she does. (copied my character reveiw of season 1 sense stuff about them never really changes.) Kurumi is the sister of Yuki she also goes after Basara in this season she is pretty sweet and nice as her turn on is armpit licking (or when someone does it to her) \\n\\n\r\nEnjoyment: honestly comedy was meh at best the action and the ecchiness outshined the comedy also this anime does have some fetishes for people like toe sucking and armpit licking and boob sucking too name a few none of that stuff bothers me but ill say i really liked this second season.\\n\\n\r\nOverall: it gets a 7 i honestly liked season 1 more just by a tiny bit more than season 2 but season 2 did have decent comedy but the action and ecchiness was the best thing about season 2 easily worth the watch of the whole anime.\\n\\n",
            "date": "2017-06-13T22:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 249865,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=249865"
        },
        {
            "content": "1st review, let's try this out.\r\nEcchi harems can feel a bit stale with overused tropes and formulaic execution. This, combined with the abundance of them in the market, can make it difficult to distinguish one from another. Burst isn't much different from most in that regard, but it is a lot of fun to watch the train wreck.\r\nThe ecchi in this show isn't the most unique but it should be respected for its voracity. The no holds barred action in conjunction with the solid voice work gives it a strong sensuality and sexy atmosphere. The girls themselves are stereotypical and unimpressive, but not unlikable.You'll findyourself smiling at their sexual openness, which is appreciated in a genre where sexual tension is palpable and rarely acted upon. By far, the ecchi fanservice is the highlight of Burst.\\n\\n\r\nNow as for the rest...\\n\\n\r\nThe story centers around Basara and his harem's antics in the demon realm. Two rival demon factions vying for control drag Mio into their dispute and her presence is requested. Basara and his \"sisters\" go with her to support her of course and the shenanigans ensue. Oh, but prior to this, Basara fights an angel in school but loses control of himself, before ultimately being saved by the buxom Chisato sensei. Oh, but prior to that, Jin Toujou (father) has a fight with Leohart, the current young demon lord. If you haven't seen an issue yet, you will if you watch it. The story is very rushed and almost an exact copy paste of another anime. The switch between serious story and ecchi fanservice galore is unpleasant to watch. It comes across as horribly forced and terribly executed. One minute Basara and harem are engaged in a battle to the death, 5 minutes later he's fondling breasts and having an orgy. With a weak story to begin with, this only serves to undermine the plot and annoy the viewer.\\n\\n\r\nThe characters are a dime a dozen clones you see in similar anime but there are some bright spots. Jin, Lars, Ramsus, and Chisato provide a welcome change of pace at points.The OSTs are pretty generic and the animation is nothing to write home about. \\n\\n\r\nOverall, this isn't a good anime if you expect something well written and original. Mindless fun and a guilty pleasure though, that it can be.",
            "date": "2015-12-16T12:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 205705,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/370754.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Layfonkun",
                "username": "Layfonkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=205705"
        },
        {
            "content": "This review is for both series:\r\nFirst, i thought: \"oh, this is a cheap Highschool DxD copy\", but after watching some episodes, i fell in love with this series. I watched the blu-ray [uncensored version], and damn... This anime is so hot, sometimes it looks like a full blown hentai anime (but there is a reason as sex makes the characters strong in the anime) \r\nThere is action, drama, romance, comedy, and strong ecchi scenes, but is is very balanced, everything is on point, the episodes doesn't feel rushed, it is very fluid. Bit by bit, in a good pacing, a harem of servant girls isformed, but the girls aren't just sexual objects, they have their value and objectives, and the MC is not a crazy pervert, he has goals, he has strong moral values and this is GREAT!\\n\\n\r\nAll the characters have strong character development throughout the series, and this is amazing, as the characters doesn't just appear out of nowhere - there is backstory, there is some kind of \"entanglement\" between the characters, and all of them have unique traits that makes them great characters and not boring ones.\\n\\n\r\nI highly recommend this series if you are looking for: action, adventure, comedy, harem and ecchi. All of this is very well mixed.",
            "date": "2017-08-11T20:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 255229,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6340233.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/desgostoamargo",
                "username": "desgostoamargo"
            },
            "url": "https://myanimelist.net/reviews.php?id=255229"
        },
        {
            "content": "So after seeing that the first anime will be dubbed in the coming months, I decided to watch both series out of curiosity. I didn't review the first series but it's pretty much the same as the second so the review will count for both in my case. My decision to watch this show was a waste of time. What a pile of garbage this anime turned out to be. It's not a 1 because there were a few redeeming factors. I'll start with the negatives first, starting with the worst going downward:\r\nCharacters: Holy hell does this series have garbage characters. \r\nBasara, the main character(whom I will be referring as Basura, the Spanish word for garbage as of this point), is your typical harem MC that never really loses and has this intense niceness to him that no normal person would ever have. That is a critique for the harem genre in general so I'll keep that part short. Anyway, what makes Basura such a terrible character is a combination of two main factors. The first is his lack of care for things he obviously should care about. Multiple times people tell him \"you know what I'll just stop talking now,\" right before revealing incredibly useful information. What the hell is that? Any normal person would hound for important information. The second is his ineptitude at what a brother-sister relationship should be. He keeps talking about protecting his little sister one moment, and fondles her breasts the next. He has this really unhealthy view of protecting his \"family\" and yet he's basically dry humping them all. SIBLINGS DON'T DO THAT. EVER.\\n\\n\r\nMio, the main girl in the harem, is is pretty much fine except for one area. She's clearly in love with Basura. YET SHE DOESN'T DECLARE HER LOVE AT ALL. All 22 episodes and she keeps letting him go on as her \"big brother.\" Why? This makes no sense. All the girls just fight over Basura and she just lets it happen. However, I'll save that for issues with the plot.\\n\\n\r\nAll of the other characters are extremely forgettable and useless. They don't have their own lives. The girls are just there to be a part of the harem and the guys are either momentary allies to further the plot or are enemies. \\n\\n\r\nPlot: Now, the plot actually isn't that bad. Don't get me wrong is generic as hell, as most light novel stories are. As a harem plot, Basura will illogically ignore the women fighting over him while he's in the very room and just ignore it for the sake of the plot. This is an issue with the entire genre, but if a harem is going to do this, then it should at least do it without him present. The issue I have with this though is that the plot blatantly insults my intelligence. Multiple times very obvious convenience allows the protagonists to win. Basura constantly contradicts rules that are made minutes after they're said. In fact, many demons comment on how a certain area is only for demonic rulers and we see Basura there in the very next frame. What the hell was the point of establishing that rule if it's not going to do anything? The writer of these novels really has no care in the world for coherency at all. To be honest if it didn't have these specific aspects annoying me I would have been really bored. Basura showed multiple times to instantly recover from damage that should have killed him. You start to wonder what's the point.\\n\\n\r\nArt: This is really the only main redeeming quality of this show. It's pretty to look at. However, it's far from perfect. The reason is because Basura looks almost identical to Issei from Highschool DxD. That's probably not the light novel author's fault but whoever drew these characters didn't have much taste for originality. What's worse is that although Highschool DxD isn't that greatly written either, at least Issei wants the harem, meaning his actions make sense in the context of the show. Here it makes no sense at all. AGAIN. SIBLINGS DON'T DO THESE THINGS.\\n\\n\r\nEcchi: To be honest, this show goes pretty damn far in terms what it can do before becoming a hentai. In fact, many scenes look like sex with clothes on. If you want a show purely for this factor then you'll get what you're looking for. It's actually pretty good in this department. Of course, there's also Mio yelling \"Oni-chan\" every time, which made me want to shoot myself. \\n\\n\r\nMy overall thoughts on the show are pretty simple. If you want to watch an ironic comedy, where you're laughing 90% of the runtime of this show, then go ahead. You'll have a good time. I couldn't stop laughing for most of it. This garbage was that bad. If you're serious in wanting at least a decent ecchi show to watch this isn't it. You'll stick around for the juicy stuff but you'll want to bang your head against your desk in-between them. \\n",
            "date": "2017-07-30T23:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 254295,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Taifood",
                "username": "Taifood"
            },
            "url": "https://myanimelist.net/reviews.php?id=254295"
        },
        {
            "content": "After watching the first season i was very interested in seeing the 2nd season but when it had arrived i had all but realised what it had turned into. It was just a mess of random ecchi scenes for no reason and was just all over the place. I did not enjoy myself as much as the previous season. I know that the ecchi was the appeal of the show but they over did it in the 2nd season. It just went so obverboard that whenever a new female character was introduced, shortly an ecchi scene would follow. The whole story was just drowned outin the immense amount of ecchi scenes. The story barely progressed the characters were just there for fanservice and barely contributed to the story. Overall i would say that they will have to massively improve on these points in the 3rd season if i were to watch their show again.",
            "date": "2017-03-27T08:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 243682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/bluechi5",
                "username": "bluechi5"
            },
            "url": "https://myanimelist.net/reviews.php?id=243682"
        },
        {
            "content": "In lieu of a full review I will discuss how season 2 varied from season 1 (and why it was even worse).\r\nFor starters, the story was even worse than before. It was trash. You aren't given enough background information; the angle with the school nurse, the thing about his mother(s) and other pieces of the plot were explained poorly and there was no follow through. The art and sound were comparable but the characters were even more annoying this time. The ecchi got more uncomfortable, the excuses for it for far worse and the new characters introduced were even more tropish than before. My biggestpet peeve was MCs ability to control his power at the end. He struggled under 2 conditions but seemed to be all good handling all 3, it made no sense and made me painfully aware I had watched 10 episodes all building up to this. Also, there were too many dropped plot points that made me frustrated because I don't know why they were introduced if they didn't plan to finish. A 10 episode run seems short, wondering if this didn't get the plug early or something; that would explain a lot.\\n\\n\r\nSummary: If you liked season 1, you basically need to finish season 2 but don't expect all your questions to be answered. In fact, expect to leave the series with more questions than you had at the end of season 1. Normally when a series ends I check if the source material is available and I can get more of the story on my own but for this one I couldn't care less.\\n\\n\r\nStory 6, Art 9, Sound 7, Character 5, Enjoyment 7, Overall 5/10",
            "date": "2016-07-02T01:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 222729,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=222729"
        },
        {
            "content": "Testament ended with a pretty interesting scene with Basara's dad kicking butt in demon world, and this sequel starts right off where the last season ended. Basically, after a brief incident at school, the gang is asked by the moderate demon faction to head to demon world; at this point virtually all my High School DxD flags are going off. Mio is forced to face her past, and travel to demon world, the exact place that she had been on the run from her whole life. Will her friends be enough to safely get her back?\r\nThe sequel to Testament is more of everything that doesn'tmatter. You get more harem members, more time in demon world, more \"complete\" transformations for Basara, more throwaway antagonists, and more ecchi. Though it's still filled with action and ecchi, it's grown in a way that's just overkill. If you liked the original then this should be a pretty easy follow on. Just know that this season introduces more questions than answers.\\n\\n\r\nAnimation:\\n\r\nGiven that the last season wasn't that long ago, the animation quality here is pretty much on par with that. I was going to give a tad of creativity points for demon world but then swiftly rescinded those points at the sight of abhorrent giants. I do think the budget must have been a bit on the tight side as there were more simple zoomed and panned frames than I normally see in a show. All the characters are pretty much as you remember them from last season, overall above average in character design but not so much for facial animation.\\n\\n\r\nLike the last season, expect a large amount of action in the show- probably on par with the amount in the last season. In general, expect the fights to seem more grand as everyone essentially levels up. That said, the collateral damage to the environments is average at best. There is a fair amount of bleeding and a slight amount of gore though they gloss over or otherwise torn away when someone actually is terminated. The producers obviously thought the show was still lacking diversity in the fetish department; thus, the harem is now expanded to appeal to those with dark skin or armpit fetishes. Purists should still be adequately cared for with plenty of traditional groping, fondling, and censoring (I assume Blu-ray would just be a ton of nudity). For some reason, everyone in the demon world seems to prepare for fights by vigorously engaging with sexual partners. In any case, this show has over the top ecchi that, like the prequel, amounts to soft core porn.\\n\\n\r\nSound:\\n\r\nThe show opens with a rock-based OP that is purposely made for the show; it has a fair melody but nothing particularly memorable. The ED is likewise pretty fast-paced and likewise nothing special. The show recycles the BGM from the previous season though uses certain tracks a lot more; I kind of liked that as it gave the show more of a consistent theme.\\n\\n\r\nMost of the main VA cast returns for Burst though some now have expanded roles. Ayaka Asai continues to do well as Mio though Yuu Asakawa does an excellent job in her expanded role as the school nurse. Likewise, I'm still trying to figure out how Kikuko Inoue can voice such a playful character at her age. The antagonists don't fare as well as they are too numerous and generic both in voice and character.\\n\\n\r\nStory:\\n\r\nBurst expands Testament in almost exactly the same way as the sequels to DxD expanded that franchise. There are now additional races in addition to demons and heroes to track and now they've expanded into the actual demon world. As with most sequels in the action-based ecchi genre, they've expanding the number of harem members and levels of both protagonists and antagonists. Though the execution is still pretty good with well-integrated plot progression and character development, certain parts of the story were just too cliche for my taste this time around.\\n\\n\r\nDespite the expansion of the setting, many of the plot elements are recycled patterns from the prequel. For instance, Basara still gets nearly killed repeatedly and Mio again goes into berserk mode repeatedly. Likewise, plot elements are again hidden only to be explained after the fact.\\n\\n\r\nThe short season can be divided into two discrete arcs. The first short ark expands upon our aggressive nurse's true identity and also hints that Basara's ridiculous injury recovery ability isn't just a fluke. The second longer main arc takes everyone to demon world to engage in a ... wait for it ... tournament. Yep, ouch, that's the best that they can come up with, straight out of the books of DxD. What really kills this arc for me is the repeated fake climaxes and throw-away nature of the antagonists. Even Zolgia from last season feels like a well-developed character compared to the plethora of antagonists here. When you do eventually get to the \"true\" climax, it's like having gone on a roller coaster twenty times; by the n+1th trip you just stop caring. It doesn't particularly help that it feels anticlimactic and open ended. It further irritates me that many questions are again left unanswered- they just leave you with a final ecchi scene to get you to forget their incomplete story writing. At this rate, we won't learn of Basara's true roots until season 5, which might be never.\\n\\n\r\nCharacter:\\n\r\nThere is definitely a lot of character development in this sequel, though with all the wrong people. If you're looking for Mio, Maria, and Yuki to grow, forget it. The attention, harem-wise, shifts to attention-hungry Kurumi and extra-busty Zest. Furthermore, they expand upon Basara's father's seemingly unlimited power as well as some members in the demon world. On top of all this, our nurse is developed along with a pointless vampire trap. Unless they're going for a sequel again, there's a lot of development that hasn't actually paid off in plot yet.\\n\\n\r\nAs mentioned above, all the antagonists other than the demon lord are pretty much junk characters; given the amount of development time for them, you pretty much know that they're just fodder. If not for the demon lord's elder sister, the entire antagonist camp would have been an absolute disaster.\\n\\n\r\nValue:\\n\r\nWhile still entertaining in both action and ecchi, Burst (ironically given the title) loses some of the momentum of the original story, being tied up in explaining a ballooning setting. This addition puts the show much more closely in direct competition and parity with DxD, which happens to be a much more mature franchise. Though the characters in Burst are still among the better drawn, the interactions feel less compelling and the story less engaging. We can only hope that the next season, if there is one, brings back the core focus of the franchise.",
            "date": "2016-02-28T00:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 211855,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=211855"
        },
        {
            "content": "One of the worst things i have ever watched. Season 1 was decent but this was dreadful the ecchi was way to high and the plot took so long to happen that i literally fell asleep watching. The cast was so one dimensional and the girls were so focused on basara that it hurt the show and all development of their characters. The teacher in this series gets really messed up in season 2 and the scene that happens between her and basara is do wrong that i skipped through it and it should never be in this series and be in something r rated.The only real good characters are the supporting and villains they serve the show right and are able to keep you somewhat interested. Finally the music in this show is generic as hell nothing is really memorable and the opening you can forgot in under 5 min. Don't recommend never watch",
            "date": "2018-11-02T08:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 293170,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7530449.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Excaliburknight",
                "username": "Excaliburknight"
            },
            "url": "https://myanimelist.net/reviews.php?id=293170"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the manga/light novel. \r\nART+ANIMATION: \r\nThe art is good. Animation is all over the place with it’s crappy moments but it remains at a standard level overall with a few good scenes. Seriously, some scenes were so good I wish they could extract them, erase the rest of the season and start over with those as key points.\r\nSound effects are merely average. The in-show music is quite good and it fits the mood and theme well too. The theme song at the beginning is pretty average, but I like it.\r\nI watched both censored and non-censored at the same time. Thecensored versions are generally a minute to a minute and half shorter. One improvement this season is the use of chibis and spell-circles to spot-cover instead of the annoying full screen blocking light beams.\\n\\n\r\nSTORY: \\n\r\nWith the first episode or two, the story seemed to be going in an interesting direction. But towards the end of the first arc everything started going downhill. There was a brief moment of redemption at the beginning of the third arc, but once again it fell flat on its face. I was seriously wondering if this was some random ridiculous 80's cartoon but with more recent animation.\\n\\n\r\nI was given the impression that the story would give more attention to the details behind Basara's lead plot armor, but that hope was quickly stomped out. Similarly, I was excited to finally learn the true identities of particular individuals, but when they were introduced with completely new elements to the story and then promptly forgotten about... sigh.\\n\\n\r\nThe first fan service scene had me hoping for good things to follow in the sense that they could continue building their trust as justification, however almost every other scene felt extremely forced and awkward. \\n\\n\r\nPlenty of discontinuities, and new useless characters and elements. Some important details that were avoided in the first season are finally mentioned, but again we are given mention of new ones which are then glossed over. Many actions had no realistic reason behind them.\\n\\n\r\nThere is still plenty of material set up for a third season. Unless it is done under a new studio or director I wouldn't bother.\\n\\n\r\nCHARACTERS:\\n\r\nDid I mention they introduced lots of new characters? And that they served no purpose? Well it certainly felt that way. Some new characters looked cool, others were immediately forgettable. Otherwise none of them were at all interesting.\\n\\n\r\nThere wasn't much character development going on. The main characters are almost exactly same as they were at the end of the first season minus some new powers here and there.\\n\\n\r\nThe voice acting is average. You can assume how a character will sound by looking at them.\\n\\n\r\nENJOYMENT:\\n\r\nThe art was probably the most enjoyable thing. There were also some really epic animated scenes tossed in. Of course the one or two good fan service scenes were enjoyable too.\\n\\n\r\nThe harem got too crowded and friendly to be interesting. I liked it better when it was just Yuuki and Mio, and they hated each other’s guts.\\n\\n\r\nThe biggest blow to enjoyment was the annihilation of the concept I had in my mind of how the story would progress. In the end, they resorted to making all sorts of awkward groping and introducing so many new things as to give me a headache. Thanks to all the new things being horribly underused, I spent a lot of the time wondering how they would interact with each other, only to find out that the studio forgot about them.\\n\\n\\n\r\nOVERALL:\\n\r\nMy god, this series had the potential despite the weak concept, but it was handled so poorly. Many random scenes were legitimately good, but the overall connection was weak. I would have rated this  better had it continued going the way I thought it was going with the first two episodes, assuming it took a similar structure to the first season.\\n\\n\r\nGoing to the demon world was a huge mistake with the seemingly thousands of new characters and elements indiscriminately tossed around. They must have grabbed a handful of mismatched junk and threw it at the wall to see what would stick.\\n\\n\r\nThe humor is just about gone after the first arc, and the show results in random awkward chest rubbing scenes to fill in the spaces between the mostly pointless character 'development' and confusing battle scenes.\\n\\n\r\nI'm thinking about checking out the manga / light novel to see if the way this season turned out is the fault of the studio. Not gonna bother updating if I find out.\\n\\n\r\nTL;DR:\\n\r\nMajor disappointment when compared with the first series. One or two good fan-service scenes are worth watching - the best one isn't even (fully) censored, but the story is disjointed and tedious.\\n",
            "date": "2016-12-11T18:40:00+00:00",
            "helpful_count": 0,
            "mal_id": 235291,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235291"
        },
        {
            "content": "So The testament of sisters new Devil, or as I like to call it \"The DxD rip-off\", is another one of those generic harem series that everyone of us has seen. Matter of fact Im going to show you just how generic it is. Lemme pull out my \"Generic harem anime check list\" (P.S. I don't actually have a list I just wrote that for comedic effect *wink*) Let's have a look *grabs glasses* \r\n1.The male protagonist who does pervy things to girls not because he wants to, but because he has to. ✔\r\n2.The main girl with huge melons who get's cock blocked because moreand more bitches are joining the harem. ✔\\n\r\n3. The Loli ✔\\n\r\n4. The Childhood friend who wants that d✔ \\n\r\n5. Actual plot ✘\\n\r\nI mean to its credit it does have somekind of plot (plot really similar to that of DxD if I may add), but when you get bombarded with cleavage every 10 seconds it's kinda hard to notice it. Then again you are probably watching it coz of the cock tease anyway. You fuckin' weeb. I'd have to say that the main problem is with the structure of the  story, by that I mean that a tit sucking scene comes right after a serious battle scene. Like is the writer trying to make me feel excided or is he trying to get me to beat my meat. Make up your god damn mind.\\n\r\nApart from that problem there are the generic characters that you can easily forget about right after finishing the anime. I mean Mio for example looks like Rias, is a devil like Rias, is somekind of royal family like Rias etc. Its like the writer of the novel just copied Rias and made her body proportions a little bit different. \\n\r\nTo be honest the only good part about this anime (apart from the bath scenes ( ͡° ͜ʖ ͡°) ) was the soundtrack. It has a nice little medieval like battle theme that I find pretty good. The opening isn't half bad as well, but just that isn't enough to make this anime any better.\\n\\n\r\nIn conclusion: Even though this borderline hent- umm I mean anime is pretty to look at it seriously isn't worth your time. Even if u are looking for something perverted there are way better options out there.\\n",
            "date": "2017-06-27T04:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 251198,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4813619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Vibara",
                "username": "Vibara"
            },
            "url": "https://myanimelist.net/reviews.php?id=251198"
        }
    ],
    [
        {
            "content": "I really love the anime however the animation, fight scene, plot , & many more are lacking \"effort\" from the animation studio. This anime is a example of a wasted story not given effort by the animation company. I envy one-punch man for the animation from the studio the created it. Sadly, We can't also blame the animation company because of making the series long story into a short 10-12 episode anime.  \r\nLuckily, the opening theme is spectacular. I always anticipated each episode just because of the anime different theme versions.\r\nSo 5/5 for music, 2/5 for the sum total of animation and everything!",
            "date": "2015-12-13T23:01:00+00:00",
            "helpful_count": 171,
            "mal_id": 205498,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050638.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/belingblade",
                "username": "belingblade"
            },
            "url": "https://myanimelist.net/reviews.php?id=205498"
        },
        {
            "content": "For the past few years, the idea of \"quality entertainment\" in anime I've felt has completely changed meaning.  Currently, we're in the age where sex sells, and the idea of not having it in some way shape or form is almost a completely ludicrous thought.  And so, to bolster that terrible, terrible thought, we have Shinmai Maou no Testament Burst, sequel to the first Sister Testament series, and a piece of crap that is even more of an insult to the series than the sister testament series already was to itself.\r\nStory:  The story here is pretty basic.  Picking off from thewhere the first season ended, Burst continues along the sexual and badass adventures of our main protagonist, Basara, where he sucks bitches and fights monsters.  Kinda like what he did in the first season, but this time, in the demon realm, and with a plot that's even more incomprehensible.  \\n\\n\r\nReally though, that is it for our story.  Aside from the change in setting, Basara and co. are essentially doing the exact same thing that they were doing in the first season, just with more stuff added to it that tries to build up the world, but only really adds in to cause more confusion.  There are several major reasons why this second season fails, several very, very big ones.  \\n\\n\r\nFirst of all, we have the main duality of reasons: pacing and information.  As a fantasy show, Sister Testament requires quite a bit of info dumping so that we as the audience can understand what kind of world these characters are getting into and therefore, understand their situation or conflict at hand.  Problem is, we don't have that.  Instead, we get a story that struggles to tell us what the hell is going on, while also trying to move along a story that just makes no sense.  They add in a lot of setup for some \"dangerous things\" to come, and then drop it altogether, (Like that bigass coffin thing.)  as well as supposedly important aspects of our main protagonist that feels like a maguffin for the series simply because it's not treated well.  Combine those with the tiny, tiny runtime of 10 episodes, and you have yourself a recipe for disaster.  And don't even get me started on the politics, because these factions don't have defined lines whatsoever.  \\n\\n\r\nAnd so, with that, you may be asking yourself, what about the thing that people care about?  The ecchi?  Well, likewise to its season one counterpart, there's no shortage of that.  In fact, they go to the extent of having full-on orgies with the girls because Production IMS thought that putting more than what was \"needed\" was a good idea.  They're honestly quite tasteless and just serve to give whoever enjoys this show a stiffy complete with sensual moans, boobs flopping all over the place, and lots and lots of fluid.  (Wait for blu-ray release for the full experience.)\\n\\n\r\nIn short, I'll be honest here, the show is basically softcore porn with only the skeleton of a story added into it.  While the show puts a bit more focus onto the 'story' aspect of the show, nothing about what was going on felt organic or even made any sense as the 10 episode runtime rushed everything to the point of losing several possibly important details behind, and thus losing what little credibility that this series had.\\n\\n\r\nOverview:\\n\r\n+ Porn  (I mean technically, you get a pornographic experience out of this, so that's a plus, I guess.)\\n\r\n-  Horrible pacing\\n\r\n-  Missing plot points\\n\r\n-  Incomprehensible plot\\n\r\n-  Forced well...everything\\n\\n\r\nCharacters:  The characters as well for this series are really quite a treat.  Not only do we have our resident harem king and his resident bitches go back into the spotlight, but we have a whole slew of unimportant plot devices added into the mix as well.  \\n\\n\r\nSo, let's start with the main cast.  (Because I am not analyzing these asshats one by one again.)  Like before, we have the main characters of the series; Basara, Mio, Maria, Yuki, and a new edition that we met back in season 1, Kurumi.  Like before, they all are pretty much the same kind of people as you'd expect them to be coming into season 2.  Basara is our resident badass who wants to protect his 'family' (aka, his girls.), Mio is the main female who oddly enough is more willing to go into her sex slave role (when did that happen, exactly?), and Maria and Yuki are pretty much the same, etc, etc.  \\n\\n\r\nSo, what's to gripe about these guys?  Well, they're just not interesting.  All of them fall into a category of trope in one way or another and nothing about them feels natural.  Their motivations all feel fake and forced upon, and for the most part, nothing has really changed.  Well, that's aside from the inseki acceptance, but that was gonna happen anyway.  \\n\\n\r\nAs for the side characters, many, if not all are extremely underdeveloped.  A lot of the show takes place in the demon realm and adds in this whole new layer of people and characters that should've made the series seem so much better, even adding in some of the old ones from season 1 like Maria's mom, Basara's dad, or even my personal favorite, Lars.  But even with this new setting and this new chance at redemption, the show doesn't even try to get you to fully understand who these new people are, because all of them are just plot devices that either get offed early, or get offed later.  Either way, they get offed without really any reason.  Seriously, we have some 'villain' who just sit in the shadows and get killed without much happening to them.\\n\\n\r\nOne of my biggest complaints comes with the character Leohardt, the 'new demon lord' for the demon world.  Leo as a character was made to be the central 'villain' to this season and the reason for the main characters to even come into the demon realm.  But throughout the series, through the show's lack of any sort of explanation, his reasoning for doing anything just doesn't exist or is just forced upon him like the development for everyone else.  He, like everyone else gets shafted to the extent that it makes no reason why he even does anything anymore.  \\n\\n\r\nOverview:\\n\r\n-  Bland characters\\n\r\n-  New characters are just as bad\\n\r\n-  Confusing traits and/or forced, uneven development\\n\\n\r\nArt: Art for Sister Testament is relatively the same as it was in season 1 in terms of quality and appearance.  Like before, I will sing as much praise as I can for it because the show is pretty standard for anime these days, just going the extra mile for the way that the magic and the character designs are for some of the characters.  Cause honestly though, some of these designs are pretty nice.  \\n\\n\r\nAnd for ecchi, well, you know what to expect if you've seen this series before.  If you don't know what I'm talking about, well, picture this.  One guy, surrounded by five girls, two of which are extremely busty, three who are average in bust, all playing with each other (using various other outside things as well), with boobs flopping all over the place, and fluid EVERYWHERE.  (I swear only half of it is sweat.)  And that's just about your average ecchi scene in Sister testament.  And bear in mind, this is how these characters get stronger.  :P\\n\\n\r\nOverview:\\n\r\n+  Decent artwork\\n\r\n+/-  Ecchi, hardcore ecchi  (This all depends on your view of ecchi.)\\n\\n\r\nSound:  As for the sound, the tracks that they use this time aren't really all that noteworthy.  Contrary to the OP in the first season made by Sweet Arms, these bundle of tracks really aren't that great or memorable.  \\n\\n\r\nPersonal Enjoyment:  Alright, now time for my opinion.  What do I think of this show?  Well, if it wasn't clear enough before, this show is shit.  I've noticed a trend in the past few years that any time a series gets a season 2 with only 10 episodes, the quality is going to drop.  This happened with DAL II, Hitsugi no Chaika, Prillya, and now, Sister Testament.  The reason for this is because of its tiny runtime only being able to squeeze so much, eventually losing out on a large amount of detail because they don't have an extra 40-60 minutes to help develop the story more like a normal anime runtime does.  And so, now onto my real thoughts.\\n\\n\r\nDid I like this show?\\n\\n\r\nOh HELL no.  HELL no.  This show is an abomination and an insult to any shred of dignity this series had left simply because it just lacked any kind of substance.  Anything that they made was hollow in terms of explanation and tried to make up for it with boobs, boobs, and more boobs which of course, didn't help this show's case at all.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nEverything, basically. None of the new supposedly important characters got any attention, the 10 episode runtime doomed this series from the start, and the soundtrack is really average at best.  If anything, this show's only saving grace would be its artwork, but it's not stellar either, so it doesn't really save all that much.   \\n\\n\r\nWould I recommend this show?  \\n\\n\r\nYea-no.  In fact, I would go as far to say that the entire Shinmai Testament series is a complete waste of time.  It's a series devoted to pandering to a certain audience and provides a less than mediocre story to fill up the 'empty space' between all of the ecchi moments.  Cause if nothing else, that's the only reason to watch this show in the first place.  So, if you're in the need for some fapping material, go ahead; it's all it's good for.  If you want some quality entertainment or just general entertainment period, I would suggest looking elsewhere.",
            "date": "2015-12-11T16:10:00+00:00",
            "helpful_count": 28,
            "mal_id": 205266,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=205266"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nShinmai Maou no Testament Burst has an affinity for bathing. That makes sense. An ecchi anime without a bath scene or two is like an anime without animation – it is almost unheard of.\r\nFor myself, bathing has never generated any exceptional stories. Save for one.\r\nGrowing up, I’ve always liked minty snacks. But, as a young kid, I took it a few steps further. When I bathed, I had this plastic container that I would fill with both water and toothpaste because the toothpaste tasted like mint. And, as the weirdo I was, I ate mywatery-tooth-pasty concoction. Not just once either. Every shower, be it Crest or Aquafresh, I would partake in my makeshift, minty mousse.\\n\\n\r\nThe outcome? I would get sick. Many a night I had tears in my eyes and a bucket in my lap as I vomited a mixture of water, toothpaste, and SpaghettiOs. I did not learn my lesson for quite a while, but, suffice it to say, the only toothpaste I “eat” nowadays is by accident when brushing my teeth.\\n\\n\r\nI tell this tale because watching Burst is like eating toothpaste: Its pleasing at first, but the bile aftertaste cannot be avoided.\\n\\n\r\nSTORY\\n\\n\r\nBurst continues on from the first season. Basara still has his Banishing Shift, Mio cares deeply for her Onii-chan, and Yuki remains as forward as ever. However, there is evil afoot. Evil that this harem has to contend with.\\n\\n\r\nBefore diving into the bosom of the anime, some positives deserve to be pointed out. For starters, the anime adds more members to the harem: Yuki’s younger sister Kurumi and Zolgia’s former bodyguard Zest fall for Basara. Expanding the harem in a harem-focused anime is usually not a negative, so it deserves some props.\\n\\n\r\nBurst also deserves props for continuing to make its sexual content purposeful. As with the first season, in order to strengthen the bond between Basara and the girls as well as increase their power, they must take part in lewd activities with each other. Having ecchi material for fun is fine, but having it be important to the narrative makes it that much more of a positive. So, once again, Burst gets props.\\n\\n\r\nUnfortunately, where the anime begins to waver is in the activities themselves. In short, it’s a mixed bag. On the one hand, the sexual scenes more often than not take place in a bath or shower with one-too-many breast-to-back washings, inducing repetition and therefore a lack of creativity. On the other hand, some of the sexual scenes are quite nice. The girls cosplaying and the entire harem going at it at once demonstrate that Burst understands how to do ecchi content right when it wants to.\\n\\n\r\nPast the harem and the ecchi is where one begins to taste the bile. The ten episodes of this season are split up into essentially three different arcs. The first involves the school festival and the ensuing battles. The second involves a trip to the demon realm and the machinations therein. And the third involves a whole lot of fighting. All three are some combination of lame or boring.\\n\\n\r\nIn the first arc, a lot goes down. Yuki uses her butt to bump balloons, Basara loses his arm (for a short time), and both gods and vampires are introduced. While the sex scene with Hasegawa-sensei is beyond steamy (and welcome), many of the elements of this arc are not used later. For instance, the vampires and the heroes have no place. Hasegawa-sensei and the god-related information has no involvement. And even something as simple as Lars speaking with Mio and Yuki about killing Basara if they have to does not have such foreshadowing addressed since they never once attempt or even think about killing him – even when he rampages.\\n\\n\r\nIn the second arc, even more goes down. Political maneuvering by the moderate faction, the reigning Demon Lord, and the Demon Council make life difficult for Basara and the harem. During this middle stretch, character setup and event setup takes center stage. Massive entities called heroic spirits are introduced as is the catalyst for the rising of their leader Chaos. Basara and the gang get trained for the eventual tournament. And, all the while, sex runs rampant. Simply put, it’s middle of the road material.\\n\\n\r\nIn the third and final arc, the most goes down. Almost everybody fights somebody else. Mio crushes a heroic spirit. Maria loses to Lars. Kurumi gets tricked by her adversary – he later gets demolished. (That’s putting it lightly; the dude gets his arms cut off and his body beaten beyond recognition.) Yuki decimates her opponent (the brother of a villain from the first season) with an unseen flurry. Basara squares off against Leohart. And they, with Mio, quarrel with Chaos while everybody else deals with protecting the city.\\n\\n\r\nThis last arc reduces the ecchi density, and that’s a problem for this ecchi-centric show, but a bigger problem exists. Namely, too much villain clutter. Before the tourney, Ramsas, Leohart, one of Leohart’s followers named Gald, Lars, and a lesser lackey named Nebra are all antagonists. Then, during and after the tourney, the Demon Council, a helper of the Demon Council named Viscount Admirath, Chaos, and Leohart’s older sister named Riara are added to the mix. But, to make matters even worse, some of the initial antagonists flip sides, making it hard to say who exactly the group is combating let alone what they are combating for.\\n\\n\r\nStill, the outcome of this clutter actually has some merit. Basara killing off a high-ranking, dangerous figure stops the radicals from revolting. The murder of the entire Demon Council (at the hands of Riara) removes a lot of tension in the demon world. And Basara and Mio working with Leohart to stop Chaos and subsequently save the city gives Mio indirect protection from would-be pursuers because, now, wars will die down and a “path to peace,” as Basara’s father Jin puts it, can be traveled.\\n\\n\r\nThe final scene of Burst has each of the girls of Basara’s harem throwing themselves at him. Said scene succinctly sums up the anime. The season has a narrative that is not too concerned with delivering a profound message. Instead, all it wanted to do was deliver some sexual goodness with an action-heavy plot on the side.\\n\\n\r\nYet, on both fronts, it did not hold up all that well.\\n\\n\r\nANIMATION\\n\\n\r\nMuch of Burst’s art has no redeeming qualities.\\n\\n\r\nThe lighting is not played with, the cinematography does not go beyond the standard, and the backgrounds are plain. In particular, episode eight has shot of the audience from afar, but they all appear to be human. Considering they are in the demon world, and that people of irregular skin colors had been shown moments prior (e.g., green, dark blue, etc.), this mistake was either an oversight or slight laziness. Of course, this observation is nitpicking, but it somewhat indicates the care the art received.\\n\\n\r\nIn terms of animation, Burst has a lot of fighting that goes on over the course of the season. “Fighting,” though, may be the wrong word. The fights usually consist of lots of explosions. Lots of explosions. Mio creating a black hole, Ramsus generating gravity magic, and Jin evaporating a section of a forest whilst training his son leave very little room for choreography and, hence, a reduction in actual animation.\\n\\n\r\nBut this reduction is done for an obvious reason: the ecchi content. For Burst, it puts as much attention as it can into its sexual scenes. Breasts jiggle, tongues twirl, and bodies dance, creating one libido-driven spectacle after another.\\n\\n\r\nReturning again is the anime’s brand of censoring. When nipples or too much below the waist would have been shown, the anime overlays these naughty bits with cutesy miniatures of the characters. This time around, there are even more variations, like Zest in a maid outfit with spatulas that form an X or a distressed Kurumi that does her best to hide herself. While the censoring is certainly unfortunate – arguably a detriment – having it be a comedy bit as opposed to a total nuisance makes up somewhat for including it.\\n\\n\r\nAlso returning are the nice character designs. Symbolism still exists: Mio’s red symbolizes her fiery passion, Yuki’s blue symbolizes her coolness, and so on. The newcomers get the same treatment: Kurumi’s purple symbolizes her sense of respect, and Zest’s yellowish-green symbolizes her happiness and stability. Besides the colors, the girls do not change their outfits all that much, and the outfits they usually wear are not that detailed. Regardless, the girls have pretty faces and ample figures, increasing their attractiveness and thereby improving their ecchi scenes that much more.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Burst finds a lot of difficulty in being more meaningful than just the sex they so often showcase. And, to some extent, that’s fine. What the girls lack in thematic weight they make up for in fetishes. At least, the harem girls do.\\n\\n\r\nMio’s all about her breasts, Yuki has her butt, and so on. To put it differently, the girls have a specialization that differentiates them beyond just their personalities. Plus, having such sexual diversity only improves the ecchi content.\\n\\n\r\nExamining the cast beyond their sex-centric traits begins to reveal problems.\\n\\n\r\nStarting with Basara, he arguably ends up as the worst character of the bunch. He acts as a standard, harem lead: ultra-powerful, overly kind, and surrounded by beauties. These traits are fine since the audience is more or less meant to self-insert into his role. It’s more everything else that hurts him.\\n\\n\r\nFirst, some explanation. This seasons sees Basara struggling to contain his power. Early on, he’s shown to have no control, prompting Jin to train Basara harder. Jin also drops the most important bit of info – Basara has to eliminate his so-called “limiters” if he stands a chance of beating the baddies and reigning in his beastlike power.\\n\\n\r\nJin essentially tells Basara that these limiters are personal battles, conscious and subconscious wars that Basara has to win to overcome. But Basara does not do any waging. In fact, he almost cheats, taking some (alluringly heart-shaped) drugs to overcome the limiters placed on him and, subsequently, his power. It feels entirely like a copout – rather than progressing as a person, he just pops some pills to save the day. He continues to prove his own lack of development when he is unable to stop himself from rampaging once again near the end of the season.\\n\\n\r\nCue Mio. A lot of Mio’s character revolved around Basara. If she was compatible with him. Placing trust in him. Whether or not she could protect him when he needed it most. In this way, a lot of her actions have him in mind: debasing herself to enhance the Master-Servant pact, going berserk herself when she believes Basara has perished, and believing in him when he asks her to.\\n\\n\r\nMio has conflicts of a more personal nature. Going back to the demon realm creates feelings of trepidation and uncertainty, feelings that she does her best to confront. But, in a nice bit of writing on Burst’s part, this conflict ties back to her relationship with Basara. Instead of going at it all alone – like the Mio of last season may have done – she leans on him and, to some extent, her other friends.\\n\\n\r\nThe peak of Mio’s character happens at the trough of Basara’s. As Basara rampages, still unable to control himself, Mio does what Basara has always done for her: She rushes to help him. Granted the whole wading through his mind is a bit too magical for the anime, but it lets Mio return the favor by being there for Basara. The sexual nature of this encounter may seem out of place, but, when ecchi is so common and their relationships are literally strengthened through sex, it makes perfect sense in context. And so Mio, rather surprisingly, becomes the best character Burst has to offer.\\n\\n\r\nA few other characters are worth talking about: Yuki, Maria, Lars, Kurumi, and Zest.\\n\\n\r\nYuki’s handled strangely. Throughout a sizeable portion of the season, Yuki has nightmares of losing her friends and huge concerns for Basara. Essentially, she worries about losing those close to her – similar to what happened in the past. But neither of her problems are confronted. She fails in protecting Kurumi and Maria, and, even more strangely, she never says a single word to Basara about her worries. To be fair, Kurumi gives a small piece of encouragement to Yuki, but it is not nearly enough to compensate for how poorly her character unfolds.\\n\\n\r\nThe anime also tries to make Maria into a more meaningful character. Her older sister Rukia demonstrates just how immature Maria tends to be, but a lack of interaction between the two of them – be it conversation or even just battling side-by-side at length – fails to make this parallel purposeful. The parallel of Maria and Rukia with Yuki and Kurumi also goes nowhere besides quick shots of all of them battling together in the finale.\\n\\n\r\nThen, during the tournament, Lars chides Maria for trying to use her unlocked power, claiming that her trying to wield such power without first controlling it is futile. His words ring true when she loses the fight.\\n\\n\r\nThis idea both works and doesn’t. It works because it ties in with her immaturity and has parallelism with Basara’s own struggles. It does not work because her unlocked power was never used or called into question beforehand, and she neither uses nor reflects on her power afterward, making Lars’s words feel empty.\\n\\n\r\nAs for Lars himself, he ends up a bit better character-wise. Largely because he sits in a morally ambiguous spot – his allegiance coincides with his own personal desires. For him, that’s revenge against those that hurt him and his friends oh so long ago. At the same time, he has moments of humanity, advising Maria and helping Basara and warning both Mio and Yuki. That is, he focuses on aiding himself while also aiding those around him. Usually in whatever way best suits him.\\n\\n\r\nThat explains his mask: His motivations remain hidden behind a veil of ambiguity. Unfortunately, this depth is as deep as Lars’s character goes. He does not get the chance to (directly) exact that revenge, and he does not have a large enough presence within the anime to greatly affect the characters and the outcomes.\\n\\n\r\nKurumi and Zest are last. Besides being the newest additions to the harem, they represent the concept of acceptance. Kurumi is naïve and Zest has never really had people who cared about her for her. Despite this, Basara, Mio, and the others (especially Maria in Kurumi’s case) accept them into their circle, providing them with the camaraderie and friendship they have always sought. Their characters do not get much more than this, but it was nice to see them get something.\\n\\n\r\nOverall, it’s hard to say how strong the cast is. Mio sits at the top, Basara’s at the bottom, and everyone else is in-between. But the balance tips more towards Basara’s end than it does Mio’s, sexual specializations or no.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track of Burst is, at first listen, nothing special. Some nice singing accompanied by a rock-n-roll and orchestral composition make the song both cool and lofty. On second and third listens, however, the song changes. Becomes different for two reasons.\\n\\n\r\nOne, the vocalist changes. Rather than sticking to one singer, the track switches the singer multiple times creating multiple versions of the piece. Two, some of these versions include sound-effects. As the song plays, one can hear Yuki slicing at a heroic spirit or Maria landing with immeasurable force on a roof. Technically these sound-effects get in the way of the OP, but they, however slightly, make the track somewhat special.\\n\\n\r\nThe ending track does change up its visuals but not the actual music itself. This track as well combines the rock-n-roll and orchestral compositions, making it sound a lot like the OP. The major difference here is that the ED likes its background choir. It’s a painfully average piece that barely deserves to be deemed an ED.\\n\\n\r\nThe rest of the original soundtrack is likewise par for the course. Burst includes hard battle tracks for the numerous fights it contains. It includes ominous tracks for the dramatic times and softer tracks for the melancholy ones. And it includes grandiose tracks for those steamier moments. Nothing extraordinary, nothing awful. Just a whole lot of passable.\\n\\n\r\nThe only section that performs well is the voice acting. Sarah Emi Bridcutt as Yuki, Yuu Asakawa as Hasegawa-sensei, and Seiko Yoshida as Zest (with shout-outs to the other voice actresses) not only have voices befitting their roles – cool, mature, and subservient respectively – but also their screaming in the streets and moaning in the sheets is duly appreciated.\\n\\n\r\nENJOYMENT\\n\\n\r\nI cannot deny that the only reason I decided to watch the sequel was for the ecchi content therein.\\n\\n\r\nAnd, for the most part, I liked the sexual scenes quite a bit no matter how repetitive they could be at times. Though there were two big issues: everything not ecchi and the character density.\\n\\n\r\nIt says a lot that whenever the anime was attempting to push action or drama that I just wanted them to get back to showing off Mio and the others half-naked. The vampire kid in the first arc was lame, I did not care for Leohart and the politics, and the tournament with its heroic spirits made me yawn. Luckily the tournament had the cat-girl announcer in the skimpy outfit (yet another fetish added to the anime’s list) to give me something worth watching.\\n\\n\r\nThe second problem was the character density. By “character density,” I simply mean the proportion of the character’s on-screen time to the overall season. This includes ecchi content, too. I am partial to Yuki, Hasegawa-sensei, and Zest, but they have some of the lowest character density. Hasegawa-sensei only appears in the first three episodes with just a single ecchi scene of her own. Same goes for Zest but in the middle of the season.\\n\\n\r\nYuki, however, is the most disappointing. She’s around, but she does a lot more fighting and worrying than interacting. Worse still, all of that fighting and worrying cuts into the amount of ecchi content she gets – nothing short of a shame.\\n\\n\r\nShinmai Maou no Testament Burst does not so much burst as it does fizzle. Almost everything, from the story to the music to the entertainment, has issues that the anime has difficulty correcting. On second thought, eating toothpaste may not be all that horrible of an alternative.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the harem expands and the ecchi is purposeful, but repetition in the sexual scenes and a shoddy plot create a subpar narrative\\n\\n\r\nAnimation: Fine, bad artistic direction, okay actual animation, funny censoring, and nice character designs\\n\\n\r\nCharacters: Bad, the girls specialize in fetishes, but, with the exception of Mio, the cast has too many problems or are simply not relevant enough\\n\\n\r\nSound: Fine, okay OP, bad ED, okay OST, good VA performances\\n\\n\r\nEnjoyment: Bad, while the ecchi content was appealing, the action and drama, as well as a lack of Yuki, Hasegawa-sensei, and Zest, was not\\n\\n\r\nFinal Score: 3/10",
            "date": "2016-09-17T17:39:00+00:00",
            "helpful_count": 10,
            "mal_id": 229246,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=229246"
        },
        {
            "content": "To me when it comes to a sequel, at the time the show makes or breaks the show. To be precise what I mean, a prequel series may need something to redeem itself to become at least something for the liking of others, however when a show breaks, it becomes something not a worth while. To keep in mind also this review is coming from a person that actually didn't liked the first season, and due to some certain personal stuff going around with someone else regarding on this show, I gave this another chance in order to regain the show as a whole. Butwell, unfortunately, this is where I say it just worsens in a way.\\n\\n\r\nComing to the sequel of the Testament series, expecting to be expected, to see the runtime of the show being 10 episodes, I personally felt like the runtime was not enough to hold onto its quality of the show, even if the first season is bad. To say the least the runtime didn't hold onto the quality of the show, in fact, it worsens throughout the episodes, because of course, due to the runtime, it doesn't give too much explanations to its characters and neither does the world. In all honesty the story just becomes as a pile of mess of puzzle pieces where you can't even know what to even understand it from. It's a total definition of a train wreck where you basically only see an ecchi with a story. In all honestly I just think the show needed more to an extension to explain somethings out, even the final was at least satisfying, it was not nice at all in my personal opinion. The pacing in itself is also horrible, as I said, it felt very fast and the most things I see in this anime series would be basically more boobs and asses than before. Because of course season 1 had it, but it also had somethings that kept to my interest in a way to have a spark that it can turn out to be better. To be honest I just don't get it, for me personally the show is a mixture of a story telling and soft core porn in a nutshell. It's basically that, it's soft core hentai series, where you just basically go and have a fap fap fap moment. The first season was basically bad, but it had some moments where it actually made me interested, but the second season just completely butchers what it could actually offer, and instead we get a big messed up knot.\\n\\n\r\nAs for the characters, I really can't say much do I? They're just your stereotypical bland characters in my eyes. Yes they can be fun, I can see why people like them a lot, however these characters are extremely bland and they barely get any development. The new girls getting introduced just become as useless to my eyes, of course that's just how I look at things towards the anime series. One thing's for sure, these characters are just cookie cutters but enjoyable depending on your taste on archetypes or if you want a mix of girls with big boobs and small boobs, tsunderes or anything. The only thing these girls are used are on the level of ecchi in a new level. I mean, hell, if you don't get what I mean, go check for yourself what I mean by the new level. \\n\\n\r\nOne question to keep in mind is if I like even one or so characters if they are bland. Well, yeah I do. I like Nonaka Kurumi which she's in my personal eye adorable and I also like Maria. Basara? Yeah in a way I do. It's not saying much. \\n\\n\r\nIn the overall way the characters are just bland, but can be enjoyable depending on your taste on girls and archetypes. Think about it and keep that in mind.\\n\\n\r\nNow for the art and animation? Let's be honest, the art is standard and decent enough, not much of a redeeming factor into the show but it still kept its budget in a way, somehow. Character designs still being the same with only a few ones being nice and at least adorable. And yes, I said adorable, don't ask me. Now for the animation, is nice and alright also, although the potential of the animation was wasted if you get what I mean from that factor.\\n\\n\r\nMusic, for the original soundtrack that just goes for my personal point. I like the soundtrack however for me it's not memorable or the slightest listened out of the anime series, that just depends for me technically. Sound department can be describe as... well, good in a way. I will just say that, if you watched the prequel and the sequel by the time you read this review, you would get my point why I'm saying this for.\\n\\n\r\nFor the Opening and Ending of the second season, I personally prefer the Ending song more than the Opening song, and here is the reason why I'm saying this for. The Opening song depending on the taste of others, in my opinion it was actually catchy but soon afterwards it just became boring. The other one can be considered decently done and I still like to listen to it. Overall I think you would have an idea of which Opening I prefer in the overall series, and yes its Opening 1. I find that more memorable and catchy, and composition being well done.\\n\\n\r\nOverall Veredict over the show:\\n\\n\r\nEnjoyment: I guess to say I have mix feelings with the show when it comes to my personal enjoyment. I will be honest, I personally enjoyed some parts of it and at the same time I did not. I think ecchi is a hit or miss for me because yes, I like ecchi towards an extension\\n\\n\r\nOut of My Enjoyment: The show in my personal opinion would be considered as a train wreck and a lost of opportunity to become something more to offer on the table, rather than having a small runtime and wasting the potential it actually had to become something worth while or having the same quality of the previous season to stand up in a way. It epically went to a thirsty series where its just a waste and when people complain about other ecchi series, I really want to ask which are the more wasteful and worse than the others. Because trust me I have seen the many and there are others way better than this even with its cliche stuff. \\n\\n\r\nI'm not saying this is the worst I have ever seen, but its just wasteful. Unless you just want to have a pass along series just for the sake of either your self indulgence or just you want to see something to get towards dose of fap material.\\n\\n\r\nMy suggestion:\\n\r\nIf you have seen the first season, and want to watch the second season, this all depends on you. \\n\\n\r\n- If you want to watch the second season just for ecchi instead of the story, then go for it. You might find something to your liking\\n\\n\r\n- If you want to watch the second season but you're having a mindset that it will get better, I think you need to watch something else. This show has nothing to go forward towards when it comes to the story.\\n\\n\r\n-If you have not seen the franchise, if you want just to have a fun time for yourself or just to have some sort of nice ecchi series, you can watch this. \\n\\n\r\n-If you have not seen the franchise but you want a story worth while, then you're going to waste 22 episodes of it if you happen to go onto this instead of watching something more decently.\\n",
            "date": "2015-12-12T07:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 205328,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=205328"
        },
        {
            "content": "French guy here so don't blame too much for bad grammar, please.\r\nWell, well, a new season of HDxD's copy then. Let's see what is about.\r\nSo, Shinmai maou no testament burst is about a harem who fought against gay demons, and that's all. This anime is a way more worst thant the first season who was already a waste of time, except if you love to get your face crushed in giant breast for the whole episode. \r\nAnd we are there now, after the encounter of the most charismatic antagonist of all time ( god I love sarcasm ), harem-shit team continue they fantastic adventure inthe real world of the true reality. Between two ( almost ) hentai scenes, we get to know that there is some trouble outside and random people started to use magic to kill the protagonist. Except the fact of \"how normal people could use mana\", more boobs appears every second. After, demons, boobs, fight, boobs, demons, demons, gay demons, boobs and end.\\n\\n\r\nWhat are you expecting of ? This is the lower-level of japanimation, just a soft-core hentai melted to a crappy storyline. All the interest lies in the \"arguments\" of female characters, nothing else. This is unoriginal, gross, stupid, dirty and mercantile. Nothing happened, the real time duration is like two days, characters are stupids, fights are lame and the ending is like \"yay, everythign turns good, let's get in a big orgy pile together !\" exactly like how the first season ended.\\n\\n\r\nThe art is not that bad but not that good for a 2015 anime and all the efforts are gone in the animation of deh bubs. The sceneries are bland on my opinion and extremely repetitive. \\n\\n\r\nThe sound is hilarious, nothing to say.\\n\\n\r\nAnd I'm clearly NOT enjoying this, everything is so predictable that I can see come the outlet of a fight three episodes in advance.\\n\\n\r\nSo this is garbage, if you want an ecchi-harem anime who's well balanced, funny and pleasant to watch, go take a look on Highschool DxD. I'm not saying that's a good anime still but it's a way better than this piece of crap.\\n\\n\\n\\n",
            "date": "2015-12-12T04:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 205308,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4597014.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Zkoctober",
                "username": "Zkoctober"
            },
            "url": "https://myanimelist.net/reviews.php?id=205308"
        },
        {
            "content": "Quick n Dirty Review: \r\nIt's a fun series to watch. Is it gonna blow your mind with character development and detailed extensive stories? No. But it's fun as hell, made me laugh quite a bit, and I didn't have to skip through a ton of pointless exposition. \r\nStory: By the books, nothing original but nothing bad. Average score. 5/10\r\nArt: Art is fine. Nothing negative to say, and Basara at the end is awesome. 7/10.\r\nSound: Music is fine, voice acting is great. 7/10.\r\nCharacters: Characters are interesting in that they play their tropes very well. And the main Protag doesn't spend 90% of the anime crying abouthow weak he is (I really REALLY hate that). The girls are fun, and the Mio is still great. 8/10\\n\r\nEnjoyment: This is a very weird category, but I absolutely enjoyed the crap out of it. I spent all day at work excited to get home so I could watch the last 3 episodes. I had a great time watching this series and absolutely don't regret it. 9/10\\n\r\nOverall: Because math, my overall rating is a 7/10. (7.2/10 really)",
            "date": "2016-01-23T22:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 209239,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1654687.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dizturb3dwun",
                "username": "Dizturb3dwun"
            },
            "url": "https://myanimelist.net/reviews.php?id=209239"
        },
        {
            "content": "Uch, if I wanted to watch something this perverted, I would have just watched a hentai. I mean, I'm all for ecchi anime and I don 't mind fan-service, but the amount in this series is just so over the top, it literally feels like they're just trying to see how much they can get away with before they get slapped with a hentai label. The story is average, and the characters are fine, but it seems like they're trying to find any excuse to dive into an orgy scene with a new type of fetish exploration. Would have appreciated more fight scenes and moreof a plot. I give it a 4/10.",
            "date": "2019-03-02T16:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 302771,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/moviefan",
                "username": "moviefan"
            },
            "url": "https://myanimelist.net/reviews.php?id=302771"
        },
        {
            "content": "Shinmai Maou no Testament Burst follows Basara a former hero who now lives with Demons huge twist right? Basara was instructed by his dad to take care of them as if they were his own blood. So Basara being the person he is agrees to take care of them this is where things get interesting. Mio is actually the daughter of the former demon king. Throughout this series Basara must protect Mio from people who want to bring her harm do to her power of being the former demon kings daughter. This series doesn't have a very strong story behind it besides Mio being daughterof demon king and Basara in charge of protecting her. The awesome battle scenes make up for it a bit but it is also a pretty hardcore Ecchi which is not really the typical thing I like. Its pretty close to softcore Hentai but none the less still pretty alright due to the amount of action in this series makes up for a little bit of this, this is in no means a series I would recommend but I wouldn't really say stay away from it ether. My opinions on this is without the battle scenes it would be a poor attempt at a hentai with little to no story, strong scenes of ecchi, and intense battle scenes this series is a decent watch.",
            "date": "2015-12-23T11:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 206564,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HabitPlays",
                "username": "HabitPlays"
            },
            "url": "https://myanimelist.net/reviews.php?id=206564"
        },
        {
            "content": "(This review covers both seasons as it was meant to be seen and will be on both seasons review section.)\r\nShinmai Maou no Testament comes to a close on this final season. I think is fair to say that it excelled as a successful \"Ecchi\". The Succubus factor not only delivered mind blowing fan service but assimilated well the action elements as well as to rid the common problem of the Hero vs Demon premise suffers from. Locations of peers when kidnapped as well as growth of our protagonist on a steady pace thanks to the aforementioned succubus factor.\r\nWe are left with many questions and Icertainly feel compelled to check out the Light Novel. The story is standard given spice and the elements thrown by the author are very creative, Made use of many cliches and some ideas found on other Light Novels and boosted them to his advantage.\\n\\n\r\nArt  = 8\\n\r\nThe art is very good on regards to the cast, not so much on the enemies. The animation was very good however it didn't steal much.\\n\\n\r\nSound = 8\\n\r\nThe sound is very good and the OP / ED were among the best I may add.\\n\\n\r\nCharacters = 5\\n\r\ni was a bit disappointed on characters since they seem a bit robotic at times and the personality of the villains was a tad cringy.\\n\\n\r\nEnjoyment = 10\\n\r\nDespite it's flaws I very much enjoyed this anime as a whole. The Ecchi factor which is the heavy weight on this installation came through flying colors and was done unusually and well as some high level Fan Service. If you're an Ecchi fan this is for you, I may warn you it's more extreme than DxD and not as good.\\n\\n\r\nOverall = 8\\n\\n\r\n8 + 8 + 8 + 5 + 10 = 39 / 5 = 7.80 rounding up to the nearest 10th. Overall 8.\\n",
            "date": "2016-07-03T19:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 223023,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=223023"
        },
        {
            "content": "What happens when you try to make an anime out of a nukige\r\nStory: 2/10\r\nNot giving 1 because it actually has a story, even though it's just as bad as any hentai out there because this kind of Demon Lord setting is extremely overused, so creating a good story with it is a hard thing, but many enjoy even if it's just like the others, so it's like an assurance to have audience.\r\nThe plot goes like this: \"Basara!\" \"Aahh!!\" *Random Ecchi Scene* -> *Some bad attempt to make MC look badass* -> *Fight Scene* -> Repeat the cycle\r\nBefore watching the first season I thought Shinmai Maouno Testament was an parody of Highschool DxD, but after watching episode 5 of the second season I noticed they didn't intend to stop their shitty parody there, because they tried to copy Akame ga Kill and Shingeki no Kyojin but it was so badly done I had to laugh.\\n\r\nWhat bothers me the most are those borderline hentai scenes in the middle of the episode. They are so random that in the next scene it's like it never happened. Besides, if I wanted to see these kind of scenes I would be watching hentai, for god's sake. \\n\r\nSo much time is lost with stupid dialogue: \"What do you think will happen to me?\" \"Don't worry, I will always be with you\". Whoever the fuck wrote this shit doesn't realize that this doesn't make the MC look good, because the smooth talking is so repetitive it sounds like hentai.\\n\r\nAfter the shit-chat one of the characters goes all out (or it seems to us) to look good, but in the end he/she just explodes something or doesn't do anything at all.\\n\\n\r\nArt: 5/10\\n\r\nWithout censorship it looks like hentai, with a little better animation. The demons are nicely done so in the character aspect, all good.\\n\r\nI don't think having the characters use other clothes is that much of a hassle, but in Shinmai Maou no Testament it seem quite troublesome because either the characters have no clothes at all or they wear their school uniforms. Even in hell. Literally.\\n\r\nAnimation is so bad that it makes the fights seem \"lifeless\", and in a futile effort to cover the poor animation they make everything blow up. But it's still no good.\\n\\n\r\nSound: 7/10\\n\r\nOpening song is actually nice, if it wasn't for those sound effects in the background that ruin the whole song. The rest of the sounds in the anime are almost all from explosions. Maybe some music when there are fights, but nothing special.\\n\\n\r\nCharacters: 2/10\\n\r\nNo character development. For the contrary, they go back the steps. It's so annoying when Basara and Mio almost have sex one scene, then next scene Basara calls Mio his sister (\"Don't touch my imouto!!\"). Siscon much?\\n\r\nEveryone is so emotional, it's like they have some kind of emotional disturbance. They see one of their friends get hurt and go full rage mode so often it doesn't even affect me anymore.\\n\r\nThe MC looks so cool, then when he finally fights, he's actually weak as fuck. Every. Single. Time. *sighs*. Got to give extra points because Basara isn't oblivious to the girls' feelings, like any other harem MC. And he actually does stuff to them (even though they don't go all the way).\\n\\n\r\nEnjoyment: 2/10\\n\r\nThe series is so simple and cliché is just painful to watch, there is almost no enjoyment. Everything I expect to happen, happens. There is no mystery or thrill whatsoever, because the plot lacks creativity.\\n\r\nAt least the MC doesn't run away from the girls when the time comes, but they could implicitly show the characters having sex, after all those ecchi scenes are close enough, so it wouldn't hurt to at least say that they crossed the line.\\n\\n\r\nOverall: 2/10\\n\r\n It's not worth your time. If you want an actual action/harem anime that has both \"plot\" and plot you can go watch HSDxD. This one here can be considered a cheap copy of the first.\\n\r\nBasically no romantic development (when you think it developed it goes back to square one), cliché/unrealistic dialogue (hentai-like), boring fights and meaningless fan-service.\\n\r\nI'm sure a hentai of this would suit it far better than an entire shitty anime. \\n",
            "date": "2015-12-14T16:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 205551,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4712327.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Schzzy",
                "username": "Schzzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=205551"
        },
        {
            "content": "Story: so the story this time around is that in that all Basara and his friends end up getting called down to the demon realm cause of this of course new problems arise of people that wants Mios powers but to also top that off they end up having a tourney to decide who will get mios powers either the demon king and or Basara himself (well more of like not them getting killed and also keeping Mio away from them)\r\nArt: art is the same the powers are pretty cool and so are lewd parts as well\r\nSound: OP and ED are meh at best ipersonally wont go looking for them and downloading them otherwise the characters sounded good.\\n\\n\r\nCharacters: Basara is the main guy of the anime and well he is pretty shy when it comes to the pervy parts but in action he is a total bad ass. Mio one of the main girls she is the demon lords daughter and honestly she can be a perv and also not she is pretty sweet and what not. Maria is another main girl of the anime and the succubus of the anime and she basically like Mio in a sense but she is like hella pervy in the anime and even recording the lewd thing happening. Yuki is the last main girl form the anime and is also basara long time friend she is pretty sweet she really doeskin show that much emotion most of the time unless really in battle but still she does. (copied my character reveiw of season 1 sense stuff about them never really changes.) Kurumi is the sister of Yuki she also goes after Basara in this season she is pretty sweet and nice as her turn on is armpit licking (or when someone does it to her) \\n\\n\r\nEnjoyment: honestly comedy was meh at best the action and the ecchiness outshined the comedy also this anime does have some fetishes for people like toe sucking and armpit licking and boob sucking too name a few none of that stuff bothers me but ill say i really liked this second season.\\n\\n\r\nOverall: it gets a 7 i honestly liked season 1 more just by a tiny bit more than season 2 but season 2 did have decent comedy but the action and ecchiness was the best thing about season 2 easily worth the watch of the whole anime.\\n\\n",
            "date": "2017-06-13T22:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 249865,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=249865"
        },
        {
            "content": "1st review, let's try this out.\r\nEcchi harems can feel a bit stale with overused tropes and formulaic execution. This, combined with the abundance of them in the market, can make it difficult to distinguish one from another. Burst isn't much different from most in that regard, but it is a lot of fun to watch the train wreck.\r\nThe ecchi in this show isn't the most unique but it should be respected for its voracity. The no holds barred action in conjunction with the solid voice work gives it a strong sensuality and sexy atmosphere. The girls themselves are stereotypical and unimpressive, but not unlikable.You'll findyourself smiling at their sexual openness, which is appreciated in a genre where sexual tension is palpable and rarely acted upon. By far, the ecchi fanservice is the highlight of Burst.\\n\\n\r\nNow as for the rest...\\n\\n\r\nThe story centers around Basara and his harem's antics in the demon realm. Two rival demon factions vying for control drag Mio into their dispute and her presence is requested. Basara and his \"sisters\" go with her to support her of course and the shenanigans ensue. Oh, but prior to this, Basara fights an angel in school but loses control of himself, before ultimately being saved by the buxom Chisato sensei. Oh, but prior to that, Jin Toujou (father) has a fight with Leohart, the current young demon lord. If you haven't seen an issue yet, you will if you watch it. The story is very rushed and almost an exact copy paste of another anime. The switch between serious story and ecchi fanservice galore is unpleasant to watch. It comes across as horribly forced and terribly executed. One minute Basara and harem are engaged in a battle to the death, 5 minutes later he's fondling breasts and having an orgy. With a weak story to begin with, this only serves to undermine the plot and annoy the viewer.\\n\\n\r\nThe characters are a dime a dozen clones you see in similar anime but there are some bright spots. Jin, Lars, Ramsus, and Chisato provide a welcome change of pace at points.The OSTs are pretty generic and the animation is nothing to write home about. \\n\\n\r\nOverall, this isn't a good anime if you expect something well written and original. Mindless fun and a guilty pleasure though, that it can be.",
            "date": "2015-12-16T12:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 205705,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/370754.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Layfonkun",
                "username": "Layfonkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=205705"
        },
        {
            "content": "This review is for both series:\r\nFirst, i thought: \"oh, this is a cheap Highschool DxD copy\", but after watching some episodes, i fell in love with this series. I watched the blu-ray [uncensored version], and damn... This anime is so hot, sometimes it looks like a full blown hentai anime (but there is a reason as sex makes the characters strong in the anime) \r\nThere is action, drama, romance, comedy, and strong ecchi scenes, but is is very balanced, everything is on point, the episodes doesn't feel rushed, it is very fluid. Bit by bit, in a good pacing, a harem of servant girls isformed, but the girls aren't just sexual objects, they have their value and objectives, and the MC is not a crazy pervert, he has goals, he has strong moral values and this is GREAT!\\n\\n\r\nAll the characters have strong character development throughout the series, and this is amazing, as the characters doesn't just appear out of nowhere - there is backstory, there is some kind of \"entanglement\" between the characters, and all of them have unique traits that makes them great characters and not boring ones.\\n\\n\r\nI highly recommend this series if you are looking for: action, adventure, comedy, harem and ecchi. All of this is very well mixed.",
            "date": "2017-08-11T20:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 255229,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6340233.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/desgostoamargo",
                "username": "desgostoamargo"
            },
            "url": "https://myanimelist.net/reviews.php?id=255229"
        },
        {
            "content": "So after seeing that the first anime will be dubbed in the coming months, I decided to watch both series out of curiosity. I didn't review the first series but it's pretty much the same as the second so the review will count for both in my case. My decision to watch this show was a waste of time. What a pile of garbage this anime turned out to be. It's not a 1 because there were a few redeeming factors. I'll start with the negatives first, starting with the worst going downward:\r\nCharacters: Holy hell does this series have garbage characters. \r\nBasara, the main character(whom I will be referring as Basura, the Spanish word for garbage as of this point), is your typical harem MC that never really loses and has this intense niceness to him that no normal person would ever have. That is a critique for the harem genre in general so I'll keep that part short. Anyway, what makes Basura such a terrible character is a combination of two main factors. The first is his lack of care for things he obviously should care about. Multiple times people tell him \"you know what I'll just stop talking now,\" right before revealing incredibly useful information. What the hell is that? Any normal person would hound for important information. The second is his ineptitude at what a brother-sister relationship should be. He keeps talking about protecting his little sister one moment, and fondles her breasts the next. He has this really unhealthy view of protecting his \"family\" and yet he's basically dry humping them all. SIBLINGS DON'T DO THAT. EVER.\\n\\n\r\nMio, the main girl in the harem, is is pretty much fine except for one area. She's clearly in love with Basura. YET SHE DOESN'T DECLARE HER LOVE AT ALL. All 22 episodes and she keeps letting him go on as her \"big brother.\" Why? This makes no sense. All the girls just fight over Basura and she just lets it happen. However, I'll save that for issues with the plot.\\n\\n\r\nAll of the other characters are extremely forgettable and useless. They don't have their own lives. The girls are just there to be a part of the harem and the guys are either momentary allies to further the plot or are enemies. \\n\\n\r\nPlot: Now, the plot actually isn't that bad. Don't get me wrong is generic as hell, as most light novel stories are. As a harem plot, Basura will illogically ignore the women fighting over him while he's in the very room and just ignore it for the sake of the plot. This is an issue with the entire genre, but if a harem is going to do this, then it should at least do it without him present. The issue I have with this though is that the plot blatantly insults my intelligence. Multiple times very obvious convenience allows the protagonists to win. Basura constantly contradicts rules that are made minutes after they're said. In fact, many demons comment on how a certain area is only for demonic rulers and we see Basura there in the very next frame. What the hell was the point of establishing that rule if it's not going to do anything? The writer of these novels really has no care in the world for coherency at all. To be honest if it didn't have these specific aspects annoying me I would have been really bored. Basura showed multiple times to instantly recover from damage that should have killed him. You start to wonder what's the point.\\n\\n\r\nArt: This is really the only main redeeming quality of this show. It's pretty to look at. However, it's far from perfect. The reason is because Basura looks almost identical to Issei from Highschool DxD. That's probably not the light novel author's fault but whoever drew these characters didn't have much taste for originality. What's worse is that although Highschool DxD isn't that greatly written either, at least Issei wants the harem, meaning his actions make sense in the context of the show. Here it makes no sense at all. AGAIN. SIBLINGS DON'T DO THESE THINGS.\\n\\n\r\nEcchi: To be honest, this show goes pretty damn far in terms what it can do before becoming a hentai. In fact, many scenes look like sex with clothes on. If you want a show purely for this factor then you'll get what you're looking for. It's actually pretty good in this department. Of course, there's also Mio yelling \"Oni-chan\" every time, which made me want to shoot myself. \\n\\n\r\nMy overall thoughts on the show are pretty simple. If you want to watch an ironic comedy, where you're laughing 90% of the runtime of this show, then go ahead. You'll have a good time. I couldn't stop laughing for most of it. This garbage was that bad. If you're serious in wanting at least a decent ecchi show to watch this isn't it. You'll stick around for the juicy stuff but you'll want to bang your head against your desk in-between them. \\n",
            "date": "2017-07-30T23:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 254295,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Taifood",
                "username": "Taifood"
            },
            "url": "https://myanimelist.net/reviews.php?id=254295"
        },
        {
            "content": "After watching the first season i was very interested in seeing the 2nd season but when it had arrived i had all but realised what it had turned into. It was just a mess of random ecchi scenes for no reason and was just all over the place. I did not enjoy myself as much as the previous season. I know that the ecchi was the appeal of the show but they over did it in the 2nd season. It just went so obverboard that whenever a new female character was introduced, shortly an ecchi scene would follow. The whole story was just drowned outin the immense amount of ecchi scenes. The story barely progressed the characters were just there for fanservice and barely contributed to the story. Overall i would say that they will have to massively improve on these points in the 3rd season if i were to watch their show again.",
            "date": "2017-03-27T08:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 243682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/bluechi5",
                "username": "bluechi5"
            },
            "url": "https://myanimelist.net/reviews.php?id=243682"
        },
        {
            "content": "In lieu of a full review I will discuss how season 2 varied from season 1 (and why it was even worse).\r\nFor starters, the story was even worse than before. It was trash. You aren't given enough background information; the angle with the school nurse, the thing about his mother(s) and other pieces of the plot were explained poorly and there was no follow through. The art and sound were comparable but the characters were even more annoying this time. The ecchi got more uncomfortable, the excuses for it for far worse and the new characters introduced were even more tropish than before. My biggestpet peeve was MCs ability to control his power at the end. He struggled under 2 conditions but seemed to be all good handling all 3, it made no sense and made me painfully aware I had watched 10 episodes all building up to this. Also, there were too many dropped plot points that made me frustrated because I don't know why they were introduced if they didn't plan to finish. A 10 episode run seems short, wondering if this didn't get the plug early or something; that would explain a lot.\\n\\n\r\nSummary: If you liked season 1, you basically need to finish season 2 but don't expect all your questions to be answered. In fact, expect to leave the series with more questions than you had at the end of season 1. Normally when a series ends I check if the source material is available and I can get more of the story on my own but for this one I couldn't care less.\\n\\n\r\nStory 6, Art 9, Sound 7, Character 5, Enjoyment 7, Overall 5/10",
            "date": "2016-07-02T01:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 222729,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=222729"
        },
        {
            "content": "Testament ended with a pretty interesting scene with Basara's dad kicking butt in demon world, and this sequel starts right off where the last season ended. Basically, after a brief incident at school, the gang is asked by the moderate demon faction to head to demon world; at this point virtually all my High School DxD flags are going off. Mio is forced to face her past, and travel to demon world, the exact place that she had been on the run from her whole life. Will her friends be enough to safely get her back?\r\nThe sequel to Testament is more of everything that doesn'tmatter. You get more harem members, more time in demon world, more \"complete\" transformations for Basara, more throwaway antagonists, and more ecchi. Though it's still filled with action and ecchi, it's grown in a way that's just overkill. If you liked the original then this should be a pretty easy follow on. Just know that this season introduces more questions than answers.\\n\\n\r\nAnimation:\\n\r\nGiven that the last season wasn't that long ago, the animation quality here is pretty much on par with that. I was going to give a tad of creativity points for demon world but then swiftly rescinded those points at the sight of abhorrent giants. I do think the budget must have been a bit on the tight side as there were more simple zoomed and panned frames than I normally see in a show. All the characters are pretty much as you remember them from last season, overall above average in character design but not so much for facial animation.\\n\\n\r\nLike the last season, expect a large amount of action in the show- probably on par with the amount in the last season. In general, expect the fights to seem more grand as everyone essentially levels up. That said, the collateral damage to the environments is average at best. There is a fair amount of bleeding and a slight amount of gore though they gloss over or otherwise torn away when someone actually is terminated. The producers obviously thought the show was still lacking diversity in the fetish department; thus, the harem is now expanded to appeal to those with dark skin or armpit fetishes. Purists should still be adequately cared for with plenty of traditional groping, fondling, and censoring (I assume Blu-ray would just be a ton of nudity). For some reason, everyone in the demon world seems to prepare for fights by vigorously engaging with sexual partners. In any case, this show has over the top ecchi that, like the prequel, amounts to soft core porn.\\n\\n\r\nSound:\\n\r\nThe show opens with a rock-based OP that is purposely made for the show; it has a fair melody but nothing particularly memorable. The ED is likewise pretty fast-paced and likewise nothing special. The show recycles the BGM from the previous season though uses certain tracks a lot more; I kind of liked that as it gave the show more of a consistent theme.\\n\\n\r\nMost of the main VA cast returns for Burst though some now have expanded roles. Ayaka Asai continues to do well as Mio though Yuu Asakawa does an excellent job in her expanded role as the school nurse. Likewise, I'm still trying to figure out how Kikuko Inoue can voice such a playful character at her age. The antagonists don't fare as well as they are too numerous and generic both in voice and character.\\n\\n\r\nStory:\\n\r\nBurst expands Testament in almost exactly the same way as the sequels to DxD expanded that franchise. There are now additional races in addition to demons and heroes to track and now they've expanded into the actual demon world. As with most sequels in the action-based ecchi genre, they've expanding the number of harem members and levels of both protagonists and antagonists. Though the execution is still pretty good with well-integrated plot progression and character development, certain parts of the story were just too cliche for my taste this time around.\\n\\n\r\nDespite the expansion of the setting, many of the plot elements are recycled patterns from the prequel. For instance, Basara still gets nearly killed repeatedly and Mio again goes into berserk mode repeatedly. Likewise, plot elements are again hidden only to be explained after the fact.\\n\\n\r\nThe short season can be divided into two discrete arcs. The first short ark expands upon our aggressive nurse's true identity and also hints that Basara's ridiculous injury recovery ability isn't just a fluke. The second longer main arc takes everyone to demon world to engage in a ... wait for it ... tournament. Yep, ouch, that's the best that they can come up with, straight out of the books of DxD. What really kills this arc for me is the repeated fake climaxes and throw-away nature of the antagonists. Even Zolgia from last season feels like a well-developed character compared to the plethora of antagonists here. When you do eventually get to the \"true\" climax, it's like having gone on a roller coaster twenty times; by the n+1th trip you just stop caring. It doesn't particularly help that it feels anticlimactic and open ended. It further irritates me that many questions are again left unanswered- they just leave you with a final ecchi scene to get you to forget their incomplete story writing. At this rate, we won't learn of Basara's true roots until season 5, which might be never.\\n\\n\r\nCharacter:\\n\r\nThere is definitely a lot of character development in this sequel, though with all the wrong people. If you're looking for Mio, Maria, and Yuki to grow, forget it. The attention, harem-wise, shifts to attention-hungry Kurumi and extra-busty Zest. Furthermore, they expand upon Basara's father's seemingly unlimited power as well as some members in the demon world. On top of all this, our nurse is developed along with a pointless vampire trap. Unless they're going for a sequel again, there's a lot of development that hasn't actually paid off in plot yet.\\n\\n\r\nAs mentioned above, all the antagonists other than the demon lord are pretty much junk characters; given the amount of development time for them, you pretty much know that they're just fodder. If not for the demon lord's elder sister, the entire antagonist camp would have been an absolute disaster.\\n\\n\r\nValue:\\n\r\nWhile still entertaining in both action and ecchi, Burst (ironically given the title) loses some of the momentum of the original story, being tied up in explaining a ballooning setting. This addition puts the show much more closely in direct competition and parity with DxD, which happens to be a much more mature franchise. Though the characters in Burst are still among the better drawn, the interactions feel less compelling and the story less engaging. We can only hope that the next season, if there is one, brings back the core focus of the franchise.",
            "date": "2016-02-28T00:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 211855,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=211855"
        },
        {
            "content": "One of the worst things i have ever watched. Season 1 was decent but this was dreadful the ecchi was way to high and the plot took so long to happen that i literally fell asleep watching. The cast was so one dimensional and the girls were so focused on basara that it hurt the show and all development of their characters. The teacher in this series gets really messed up in season 2 and the scene that happens between her and basara is do wrong that i skipped through it and it should never be in this series and be in something r rated.The only real good characters are the supporting and villains they serve the show right and are able to keep you somewhat interested. Finally the music in this show is generic as hell nothing is really memorable and the opening you can forgot in under 5 min. Don't recommend never watch",
            "date": "2018-11-02T08:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 293170,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7530449.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Excaliburknight",
                "username": "Excaliburknight"
            },
            "url": "https://myanimelist.net/reviews.php?id=293170"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the manga/light novel. \r\nART+ANIMATION: \r\nThe art is good. Animation is all over the place with it’s crappy moments but it remains at a standard level overall with a few good scenes. Seriously, some scenes were so good I wish they could extract them, erase the rest of the season and start over with those as key points.\r\nSound effects are merely average. The in-show music is quite good and it fits the mood and theme well too. The theme song at the beginning is pretty average, but I like it.\r\nI watched both censored and non-censored at the same time. Thecensored versions are generally a minute to a minute and half shorter. One improvement this season is the use of chibis and spell-circles to spot-cover instead of the annoying full screen blocking light beams.\\n\\n\r\nSTORY: \\n\r\nWith the first episode or two, the story seemed to be going in an interesting direction. But towards the end of the first arc everything started going downhill. There was a brief moment of redemption at the beginning of the third arc, but once again it fell flat on its face. I was seriously wondering if this was some random ridiculous 80's cartoon but with more recent animation.\\n\\n\r\nI was given the impression that the story would give more attention to the details behind Basara's lead plot armor, but that hope was quickly stomped out. Similarly, I was excited to finally learn the true identities of particular individuals, but when they were introduced with completely new elements to the story and then promptly forgotten about... sigh.\\n\\n\r\nThe first fan service scene had me hoping for good things to follow in the sense that they could continue building their trust as justification, however almost every other scene felt extremely forced and awkward. \\n\\n\r\nPlenty of discontinuities, and new useless characters and elements. Some important details that were avoided in the first season are finally mentioned, but again we are given mention of new ones which are then glossed over. Many actions had no realistic reason behind them.\\n\\n\r\nThere is still plenty of material set up for a third season. Unless it is done under a new studio or director I wouldn't bother.\\n\\n\r\nCHARACTERS:\\n\r\nDid I mention they introduced lots of new characters? And that they served no purpose? Well it certainly felt that way. Some new characters looked cool, others were immediately forgettable. Otherwise none of them were at all interesting.\\n\\n\r\nThere wasn't much character development going on. The main characters are almost exactly same as they were at the end of the first season minus some new powers here and there.\\n\\n\r\nThe voice acting is average. You can assume how a character will sound by looking at them.\\n\\n\r\nENJOYMENT:\\n\r\nThe art was probably the most enjoyable thing. There were also some really epic animated scenes tossed in. Of course the one or two good fan service scenes were enjoyable too.\\n\\n\r\nThe harem got too crowded and friendly to be interesting. I liked it better when it was just Yuuki and Mio, and they hated each other’s guts.\\n\\n\r\nThe biggest blow to enjoyment was the annihilation of the concept I had in my mind of how the story would progress. In the end, they resorted to making all sorts of awkward groping and introducing so many new things as to give me a headache. Thanks to all the new things being horribly underused, I spent a lot of the time wondering how they would interact with each other, only to find out that the studio forgot about them.\\n\\n\\n\r\nOVERALL:\\n\r\nMy god, this series had the potential despite the weak concept, but it was handled so poorly. Many random scenes were legitimately good, but the overall connection was weak. I would have rated this  better had it continued going the way I thought it was going with the first two episodes, assuming it took a similar structure to the first season.\\n\\n\r\nGoing to the demon world was a huge mistake with the seemingly thousands of new characters and elements indiscriminately tossed around. They must have grabbed a handful of mismatched junk and threw it at the wall to see what would stick.\\n\\n\r\nThe humor is just about gone after the first arc, and the show results in random awkward chest rubbing scenes to fill in the spaces between the mostly pointless character 'development' and confusing battle scenes.\\n\\n\r\nI'm thinking about checking out the manga / light novel to see if the way this season turned out is the fault of the studio. Not gonna bother updating if I find out.\\n\\n\r\nTL;DR:\\n\r\nMajor disappointment when compared with the first series. One or two good fan-service scenes are worth watching - the best one isn't even (fully) censored, but the story is disjointed and tedious.\\n",
            "date": "2016-12-11T18:40:00+00:00",
            "helpful_count": 0,
            "mal_id": 235291,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235291"
        },
        {
            "content": "So The testament of sisters new Devil, or as I like to call it \"The DxD rip-off\", is another one of those generic harem series that everyone of us has seen. Matter of fact Im going to show you just how generic it is. Lemme pull out my \"Generic harem anime check list\" (P.S. I don't actually have a list I just wrote that for comedic effect *wink*) Let's have a look *grabs glasses* \r\n1.The male protagonist who does pervy things to girls not because he wants to, but because he has to. ✔\r\n2.The main girl with huge melons who get's cock blocked because moreand more bitches are joining the harem. ✔\\n\r\n3. The Loli ✔\\n\r\n4. The Childhood friend who wants that d✔ \\n\r\n5. Actual plot ✘\\n\r\nI mean to its credit it does have somekind of plot (plot really similar to that of DxD if I may add), but when you get bombarded with cleavage every 10 seconds it's kinda hard to notice it. Then again you are probably watching it coz of the cock tease anyway. You fuckin' weeb. I'd have to say that the main problem is with the structure of the  story, by that I mean that a tit sucking scene comes right after a serious battle scene. Like is the writer trying to make me feel excided or is he trying to get me to beat my meat. Make up your god damn mind.\\n\r\nApart from that problem there are the generic characters that you can easily forget about right after finishing the anime. I mean Mio for example looks like Rias, is a devil like Rias, is somekind of royal family like Rias etc. Its like the writer of the novel just copied Rias and made her body proportions a little bit different. \\n\r\nTo be honest the only good part about this anime (apart from the bath scenes ( ͡° ͜ʖ ͡°) ) was the soundtrack. It has a nice little medieval like battle theme that I find pretty good. The opening isn't half bad as well, but just that isn't enough to make this anime any better.\\n\\n\r\nIn conclusion: Even though this borderline hent- umm I mean anime is pretty to look at it seriously isn't worth your time. Even if u are looking for something perverted there are way better options out there.\\n",
            "date": "2017-06-27T04:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 251198,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4813619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Vibara",
                "username": "Vibara"
            },
            "url": "https://myanimelist.net/reviews.php?id=251198"
        }
    ]
]