[
    [
        {
            "content": "For anyone that is unsure about giving this series a chance, then you should read this to see if its right for you or not. (look for *)\r\nIF! you switched half the guys for girls people would say this is one of the best romance anime's to date. That is how good this story, and anime are!\r\nOkay here is a little background on me, I am a Straight male with no interest in men or for even watching a BL series, However there might be a few people out there who's Girlfriends really want to watch this so..... they FORCE you to watch this (whichis what happened to me.) Before i watched this  i knew what it was and i had a feeling i knew where it was going to go. well at first try i almost couldnt stand what was going on, i thought to myself OMG RAPE! and turned it off. then about two weeks later i then tried (got forced) to watch it again. To my surprise i enjoyed this, and very much so.\\n\\n\r\nStory 9\\n\r\nIts very simple but very powering with alot of colorful words. its about three homosexual couples how they live there daily lives, some knew they were gay and accept it, it also shows the people that dont really know if they are gay, or even what being gay really means. It shows there struggle through acceptance, denial, and their love for one another. \\n\\n\r\n* If you dont mind yaoi then this is a most watch, this was my first one. IF you like great romance stories with fun characters and sexually funny moments this is for you. IF the thought of two guys disturbs you in any way then i would try the first episode and see what you think\\n\\n\r\nArt 7\\n\r\nThe art, well its art. this has just the right amount for what its trying to accomplish. I cant give this a higher score because there is no need for the Art to be off the charts its a Rom/Com. they charcter designs were nice some of the guys looked the same so that didnt help any, i did however enjoy the silly faces misaki made when he freaked out, when the humor comes so does the silly drawings which were nice and a refreshing change from a typical romance style art. \\n\\n\r\n* IF you must have Brotherhood type Art or a style classic like Mononoke or and art that has an old school vibe like bebop this isnt for you, this is a typical and averagely average Art style.\\n\\n\r\nSound 8\\n\\n\r\nI cant say it was really typical but it wasnt overly aggressive. The OP and ED were decent nothing great, once again pretty average, the music throughout was the same, however when it needed music the most it got it. Every sappy love speech or new revelation they encountered the music fit wonderfully.\\n\\n\r\n* Not a mozart score by any means, also not some Glee infested over hype. I dont really think theres much to say, but just to be safe if your looking for an awesome blow me over feel from the music and how it makes the whole mood better it does this decently. so if you a sound type of guy/girl not for you.\\n\\n\r\nCharacters 9/9.5\\n\\n\r\nThey were fantastic, i swear misaki is a tsundere... i dont know if thats how it works but whatever. you could clearly tell after a few episodes who wore the pants and who wore the mini skirt in the relationships. The characters were cute, funny, and dramatic what kept me from saying 10 was the over dramatic parts. most of the time the characters pulled of the role great and really shined but every half dozen episodes it was just to overplayed. The last couple to be declared really surprised me as well it also added in some nice background drama that i thought was pretty interesting and cant wait to see who they work out and how the other characters work out there relationships.\\n\\n\r\n* Well this is a BL series so for obvious reasons if you cant get past that you wont like this, if you can do what i did and just treat the \"weaker man\" as the women you will be happy with this series. I think if you watch this it will be hard to say anything negative about these wonderful characteres.\\n\\n\r\nEnjoyment 9\\n\\n\r\nat first i really did not like this, it started of awkwardly with a little mis communication along with other things. Then after that moment passed i really started to get into this and found myself really wanting the relationships to develop. just really great.\\n\\n\r\noveral 8.5/9\\n\\n\r\nIf this review helped and made you want to give this a shot then chances are you will love this it is a pleasant surprise and kind of a shocker for me that i actually enjoyed this as much as i did. \\n\\n\r\nThank you i hope this was helpful.\\n",
            "date": "2011-12-10T22:23:00+00:00",
            "helpful_count": 258,
            "mal_id": 48927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/561795.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OtakuTrey",
                "username": "OtakuTrey"
            },
            "url": "https://myanimelist.net/reviews.php?id=48927"
        },
        {
            "content": "So since no one has gotten a chance to review this anime I guess I will do the honors of being the first. I stumbled upon this anime while searching for random videos of youtube and I have to say I never expected it to be as good as it turned out to be. I just cannot stop watching this anime its completely and utterly addictive. Sorry this isnt going to be very dramatic and new york times like. \r\nStory:\r\nDefinitely a yaoi girls(or guys) dream. The story is filled of 3 main plots all involving 3 different couples. There is the teddy bear obsessed writerdating the younger brother of his best friend. The loner intelligent associate professor dating the student, and the divorced husband dating the brother in law. All stories giving something that puts this anime together. This anime shows how pure love is and how it is unexpected. Not to mention yaoi galore. Be prepared to watch tons of sex scenes.\\n\\n\r\nArt:\\n\r\nI think the art is pretty good. A little different from what I'm use to seeing and definitely different in a good way. I've seen better but it passes the test. It seems to capture the love scenes without making it too *cough* explicit.\\n\\n\r\nSound:\\n\r\nThe opening is alright I suppose. And the music during the show isnt that memorable. \\n\\n\r\nCharacter:\\n\r\nCharacter development in this anime is extremely face paced. But there is never a moment in which you dont know how a certain character is feeling, but it also leaves openings for surprises and turns.\\n\\n\r\nEnjoyment:\\n\r\nAs I said at the beginning this anime is absolutely addiciting. I can sit and watch it all day. The stories that are told are touching and show how love can exist in the most unexpected and different ways. It also has its comedic moments which dont fail to make me laugh, and it is extremely hard to make me laugh.\\n\\n\r\nThis anime no matter how much it reminds me of gravitation is definitely worth the watch. Just make sure there arent any children in the room ;)",
            "date": "2008-05-25T20:01:00+00:00",
            "helpful_count": 253,
            "mal_id": 4981,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9294.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/meowmeow21",
                "username": "meowmeow21"
            },
            "url": "https://myanimelist.net/reviews.php?id=4981"
        },
        {
            "content": "Oh, an anime that certainly puts the fab back in fabulous and the gay back in yaoi. \r\nJunjou Romantica is a yaoi anime, as anyone with eyes would know. What it is, is a well loved yaoi anime and a pretty crappy normal anime. Yes fangirls, feel free to hate on me now, it's okay. Just one word of warning: you will never get any of these men. They're gay and fictional. Now go cry about it. \r\nThe storyline is plain old unbelievable. You expect me to believe that there are so many gay guys who are all inter-related, yet most don't know the restare gay unless they had boinked them in the past or something?? Where are the women in this anime? Fine, I can chalk up with the no women thing since gay men can't see oestrogen anyway unless it's from themselves, but the one woman in the entire anime is a yaoi fangirl. I mean come on. Wtf. \\n\\n\r\nEach story is basically a mirror of the other one. Check this out. \\n\\n\r\nTeacher --&gt; younger man --&gt; butt secks. \\n\\n\r\nThat's all that freaking happens for the entirety of the anime. An older, teacher-like dude meets a muuuch younger dude and they hook up and have lots of unwilling sex with one another. \\n\\n\r\nFirst couple: a tutor who tries to seduce his best friend's little brother. Second couple: a teacher who is seduced, is trying to seduce a younger man. Third couple: another teacher whose ex-brother-in-law is trying to seduce him. God, come on! What's with this? What are they trying to say--that gay men with any position of authority in a younger boy's life will try to lead the boy astray?? Nothing happens in the story other than a whole lot of angst, sappy romance, and sexing all over the place, with a lot of &quot;Nooo! Don't touch--oh wait, go ahead, but nooo!&quot; going on.\\n\\n\r\nArt was trash, sound was worse trash. Those theme songs sucked balls, though if you're a yaoi fangirl, then you won't care too much. \\n\\n\r\nCharacters were dead awful. Most of the time they're whining or they're moping or taking advantage of someone. I mean, come on! The writer guy did nothing but go, &quot;I love you. Let's do it.&quot; for the whole anime. The boy he liked kept going, &quot;Oh, I don't want this...wait, I think I do.&quot; and that's pretty much how it went for the whole anime with EVERY couple. \\n\\n\r\nDon't watch this is you are a normal person. For a yaoi fangirl, this anime is pure genius. For fabulous folks like myself, AVOID.",
            "date": "2009-01-29T15:50:00+00:00",
            "helpful_count": 247,
            "mal_id": 11931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=11931"
        },
        {
            "content": "You want to know what really helps shape a relationship for me? An abundance of rape, sexual assault, and non-consensual acts being performed to your partner. God, what a literal pure romance that is. Thankfully, Junjou Romantica was sure to base one of its relationship entirely off of non-con and definitely wasn't afraid to add in some of that to the other relationships as well! Definitely the type of romance any gay man would dream of.\r\nThere are three different \"love\" stories in this anime, and all three manage to be equally as terrible as the other. For one thing, let's talk about the fact thatliteral sexual assault by a man 10 years older than you leading into love is not only extremely disturbing, but also completely out there. There is no moral groundpoint for the character Misaki, who is constantly abused in many ways by his newfound partner, Usami. This romance is so pure, that Usami literally shoves Misaki into a car against his will because Misaki dared to have a conversation with another man. What a healthy relationship, such a charming guy. Not to mention he doesn't let Misaki speak on the phone with said guy, and makes sure to later sexually assault the poor guy.\\n\\n\r\nSeriously, what in any way is romantic or logical about this? There isn't anything healthy or consensual about the actions that Usami places on Misaki. And not only that, but it's all played as a joke. As if this kind of stuff is a humorous, cute thing that Misaki secretly wants. The romance in here is a total joke, and if you expect me, or any person with a functioning brain to take a relationship completely built off of sexual harassment seriously, then there's a good chance your morals need reevaluating. \\n\\n\r\nThe reason this is such a issue is both because said relationship is the main focus of the show, and because this is apparently a romance. Having your romance start and develop with borderline rape is a terrible choice, because from there on out it's extremely hard to feel anything except disgust at the events occurring. It's an unnecessary element to the relationships. Age difference aside, I wouldn't have had nearly as much of an issue with this show had it not been for all the times that Misaki was screaming \"No! Let go! Stop it!\" when being advanced on. It makes for a very fucked up relationship.\\n\\n\r\nThe other two relationships, while they didn't revolve around borderline rape, still had their major problems in it. One relationship lasted for about 3 - 4 episodes and included a timeline of about 6 years. It also included the man getting up and leaving his partner without any explanation or contact because he thought it'd make him want to come back. Again, great romance there. The last romance only lasts for about 2 episodes, and therefore had less of a chance to be completely idiotic. Though it should be noted the two characters have about 17 year age difference, which is always a plus here. It still featured the token sexual harassment that this show is known for though. \\n\\n\r\nNot only that, but the stories are really choppy and broken up. The first 2 episodes focus on Romantica, episode 3 on Egoist, back to Romantica for a bit, some more of Egoist, etc. Basically it's all very choppily split up, unnecessarily so. The rapey elements obviously ruin it too, and frankly the time it takes for the characters to \"fall in love\", their reasons for doing so, and how they act towards their loved ones (Preventing them from being with friends, going into their house after you've known them for less than 24 hours) is so incredibly far-fetched that the romance just feels terribly pushed.\\n\\n\r\nIn terms of characters, you can tell how they'll be from the designs. Triangle face guys are the seme, and baby-faced boys are the uke. The seme is almost always the one performing the near-rape actions while the uke is the one begging for no more and eventually falling for these creeps. There's not too much to say about them, except for the fact that Usami is an extremely creepy harasser and that the seme in the Terrorist arc actually has some interesting traits to him regarding his past. Other than that, these characters are just here to fill the traditional seme/uke roles and either begin or resist the sexual assault.\\n\\n\r\nThe art reeks of terrible same face syndrome, to the point where you can identify the seme and uke just by looking at their faces. The seme's are all drawn with these very awkward looking rectangle chins and huge broad shoulders, likely to insist their dominance on the usually much younger looking uke character. All the ukes are drawn with childlike features to insist their submissiveness. The animation is very cheap-looking too, often relying on chibi faces in order to save budget. It's honestly an unimpressive looking anime. \\n\\n\r\nThe sound isn't all that bad frankly, just not at all fitting for this type of anime. There's usually some acoustic piece playing in the background as one of the characters is being assaulted, which is very ill fitting and and makes it feel like the show is romanticizing borderline-rape even more. It's not necessarily a memorable soundtrack, but it's decent at best, just not fitting for the gross nature of this show.\\n\\n\r\nBeing asked if I enjoyed this anime is the equivalent to being asked if I enjoy bashing my head against a wall for about 4 hours and would likely have the same answer to them. If you're going to portray a romance, hell, especially a homosexual romance where there's already stereotypes that all homosexuals are pedophiles and stuff, then you don't do it this way. You don't have the starting point of the relationship for a major couple be near-rape. You don't give unequal focus to the relationships and have one take place over a course of 6 years in four episodes. Oh, and you especially don't include homophobic remarks from your own gay characters in an anime. Seriously, how idiotic do you have to get to even think of doing that?\\n\\n\r\nAnime that focuses on something other than straight romance can be really refreshing, but when it's done this way? You'll be left wondering if half the show you just watched was a so-called \"pure romance\" or a stockholm-syndrome documentary.",
            "date": "2014-07-31T17:49:00+00:00",
            "helpful_count": 132,
            "mal_id": 154655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1377187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ihateeveryone",
                "username": "ihateeveryone"
            },
            "url": "https://myanimelist.net/reviews.php?id=154655"
        },
        {
            "content": "In Junjou Romantica you get to follow 2 couples (and a potential third) with Usagi and Misaki being the one that gets the most exposure. Then there is Hiroki and Nowaki which is basically the same thing as the first couple, younger guy + older guy, but reversed positions between the sheets. If you ask me I think that just focusing on Usagi and Misaki would have been better cause the others just feelt tacked on for the sole purpose of having more bi-shounens ( or \"pretty boys\" if you like).\r\nThe music is nothing special, it doesn't help to add to the mood but itdon't do the opposite either. However, there is some nice pieces in there but I found them to seldom be played at the right time. The opening-theme is pretty nice but this isn't 1999 so it feels kind of out of place. The VAs generally does a good job but some of them don't match their character, not a huge problem since it is always with characters that have little screen-time but still annoying. \\n\\n\r\nHave you ever felt that eveyone looks very similar to you? No? Well, I guess the characters in Junjou Romantica have since they all look very alike. Except from the hair and eye color they could all be brothers from the same mother. It is quite rare that you see this kind of bland and unimaginative character design. It tries to make all the characters bi-shounens but man sometimes they failed miserably, in some scenes it looks like they have some kind of facial distortion since it sometimes doesn't fit the body at all. Otherwise the animations and characters  look ok and sometimes even (intentionally) funny when they go into chibi-mode and extreme facial expression-mode.\\n\\n\r\nIf it is so bad then why is it so highly placed on the top-list? There are perfectly bad reasons for that. The first being the amount of sex (non graphical) there is, it is almost ridiculous and you always get the tiresome &rdquo;No, I don't wanna do it with you&rdquo;-reaction from the smaller of the two gets old quickly. Sometimes the reactions are so strong that they almost looks like an attempted rape... You don't get any mentionable depth to most the characters, with the exception of Usagis childhood, but that is good in a way that you don't have to care. The only ones I really came to care about was Misaki and Usagi but the rest I could have been without.\\n\\n\r\nThe highlights of the show is the humor which sometimes makes fun of the show itself. \\n\\n\r\nTo sum the series up it is an unimaginative piece of boredom that tries to excuse that unimaginativeness with some random sex. It has some qualities but they never truly shine through. If you are a fan of boy on boy-relationships then this might be for you. Otherwise I suggest that you don't even poke this with a stick cause there will be a lot of fooling-around going on. You might have read my Legend of Duo review and thinks &rdquo;Hey, this guy clearly dislikes shounen-ai so why should I listen to him?&rdquo;, well... it's not that I dislike it (I try to keep an open mind about all themes) I just haven't found a series that is very enjoyable.\\n\\n\r\nPlease, Studio Deen, you know better than this. You gave us Maria-sama ga Miteru on the shoujo-ai side so please give us Joseph-sama ga Miteru (or something like it) on the shounen-ai side instead and lose the redundant sex scenes in favor for some real heartfelt and meaningful brotherly love. Please.\\n",
            "date": "2008-11-11T00:21:00+00:00",
            "helpful_count": 51,
            "mal_id": 9392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35252.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Whoomp",
                "username": "Whoomp"
            },
            "url": "https://myanimelist.net/reviews.php?id=9392"
        },
        {
            "content": "THIS IS THE ONLY PERFECT 10 I THINK I'LL EVER GIVE!\r\nI really think that this is the best yaoi I have ever watched and will ever watch. There is pretty much no comparison to how amazing it is. I mean, sure, it only is really attractive to yaoi fans to watch it, but I think that other people could learn to love it&hellip; at least the story.\r\nSTORY &ndash; It&rsquo;s totally amazing how they have two storied going at different points. There will be episodes about Usagi and Misaki, and then there will be an episode about Hiroki and Nowaki. The story line for Usagi andMisaki is sooooo humorous and yet adorable and dramatic. And then on the complete opposite spectrum, Hiroki and Nowaki &lsquo;s story is so heart-renching and romantic. Both of the stories are very interesting and I personally can say that I can relate to them VERY well. Especially the story of Hiroki and Nowaki... it is almost exactly like a situation I have been in before. And it&rsquo;s great how the story of Hiroki and Nowaki is tied into the relationship of Usagi and Misaki.\\n\\n\r\nART &ndash; Beautiful, beautiful, beautiful&hellip; the shading and colors are so amazing, and everything is so well drawn. This artist sure knows how to draw attractive men with great expressions and actions. Their faces and body language are always so perfect. Not only that, but there are also moments were the drawings are very cartoony and humorous and they make me laugh and go&hellip; &ldquo;AWWW, that&rsquo;s soooo cute!&rdquo; I absolutely would date any of those guys. The drawings are to die for. EXCEPT, the characters all have the same hair cut! And it makes it sooo hard to tell people apart sometimes. It&rsquo;s easy to get confused.\\n\\n\r\nSOUND &ndash; Not all that much background music, but when there is, it is very well-placed. Also, there are moments where small things, like forks on plates, just set the mood for the sound excellently. The voices for all the characters fit them very well, except for maybe Hiroki. I don&rsquo;t exactly like his voice being that deep. It does not match his character very well to me. The OP theme is to die for. But I did not so much enjoy the ED&hellip; but you  can&rsquo;t always have it your way, yeah?\\n\\n\r\nCHARACTERS &ndash; 4 main characters instead of just the normal two or three. I must say I like that, mostly because it gives the watcher more of a view of different kinds of people and there is more to relate to that way. I&rsquo;ll go through every character for you:\\n\\n\r\nUsagi &ndash; very manly and blunt. He blatantly comes out and says what he is thinking, and that is what is so attractive about him. He doesn&rsquo;t really care what everyone thinks and he is very understanding. He wants love and he finds that love in Misaki.\\n\\n\r\nMisaki &ndash; just absolutely adorable! He is somewhat whiney at times, but he is young, and at times is very na&iuml;ve. It&rsquo;s strange that he is 10 years younger than Usagi, but they really have a love/hate relationship. He changes his mind so much. He will at one moment love Usagi and then act like he hates his guts&hellip; it&rsquo;s kinda stupid if you ask me.\\n\\n\r\nHiroki &ndash; I don&rsquo;t really like his character as much, but he is also mature. But, he changes his mind so much. He is very&hellip; what&rsquo;s the word&hellip; harsh. And it seems like he doesn&rsquo;t care about anyone but himself sometimes.\\n\\n\r\nNowaki &ndash; personally, he is my favorite character. He is so loving and because he is truly in love he knows that he never wants to give up on Hiroki. I look up to him because he reminds me a lot of myself.\\n\\n\r\nENJOYMENT &ndash; I&rsquo;m laughing at every episode of Usagi and Misaki. I&rsquo;m crying at every episode of Hiroki and Nowaki. I somewhat wish that they could have split this show into two separate shows so that I was not trying so hard to remember the love affairs of all 4 characters, but none-the-less I enjoyed every second I watched this. :)\\n\\n\r\nEvery Yaoi lover MUST watch this show. It was the most amazing anime&hellip;",
            "date": "2008-08-01T17:09:00+00:00",
            "helpful_count": 42,
            "mal_id": 6766,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/natsuocosplay",
                "username": "natsuocosplay"
            },
            "url": "https://myanimelist.net/reviews.php?id=6766"
        },
        {
            "content": "Dear yaoi fandom, \r\nthere is such an impressive quantity of yaoi out there that are actually really good. Been there, seen it. So why in the world do you love Junjou Romantica so much?\r\nStarting out as a hardcore fan of the series, I gave myself a few years of growing up before I realized this anime deserves to be proverbially spat on with passion. Shamed and enlightened, I saw the Truth and it set me Free. Dramatic as it sounds, fellow reader, the Truth IS: this anime (especially manga) is an utter fuckup.\r\nProbably the biggest problem with today's yaoi that is present here; the 'uke'side of the couple has little to no back spine and, despite the fact they dedicated an episode trying to convince us he WASN'T forced into the 'loving relationship' he is in right now by the 'seme', it is very painfully obvious he was. In other words, characterization is lacking, as it were.\\n\\n\r\nClass writing with many \"uwwa\" moments. I know you love those.\\n\\n\r\nAnother fun thing about this thing is that there are three couples involved and none of them are done right and all of them are an insult to gay relationships, as well as relationships in general. \\n\\n\r\nIt only came to my attention recently that all three of storylines have \"submission&domination\" formula, which would be OK, I guess, considering how common that is; if all three of them weren't exactly the same. MentorxStudent kind of thing, as hot as it can be, had been done terribly wrong in all three instances.\\n\\n\r\nNow I'd like to talk about characters - or should I say a character? Indeed, they are all relatively identical examples of one and the same fantasy the author apparently has about anime men. Not only their design, it is their \"personalities\" that are particularly painful to watch. \\n\\n\r\nThe characters are so shallow and badly developed, their love is completely unjustified by anything they do.\\n\\n\r\nAnnoying voice acting.\\n\\n\r\nAll in all, fangirls. Pay attention please, I have a few suggestions for you.\\n\r\nHere is a couple of manga you can read instead of watching/reading this dreadful thing, because apparently the best yaoi manga are never made into an anime:\\n\r\nAitsu no Daihonmei, Yume Musubi Koi Musubi and it's slightly hotter spin-off Himegoto Asobi, Doushitemo Furetakunai and its spin off After 9 Hours.\\n\\n\r\nEnjoy the reads, you don't need to thank me, spread the word, gimme some good ones in return and god bless our gay hearts.",
            "date": "2012-03-12T07:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 55831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25159.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Klabautermann",
                "username": "Klabautermann"
            },
            "url": "https://myanimelist.net/reviews.php?id=55831"
        },
        {
            "content": "So bad it's good! \r\nIf you are looking for a terribly written shounen ai anime with the most cliché characters and a ridiculous story, Junjou Romantica is the anime you need to watch! (it has dub-con, be warned)\r\nThis is a must-see if you are a fan of the genre and want a good laugh. If you really want to watch something good (and I assure you, good yaoi does actually exists), I suggest you run far away from this.  \r\nThe characters and situations are as stereotypical as they can get in a romance anime. So stereotypical and cliché in fact, that it actuallybecomes funny.   \\n\\n\r\nStory: 3\\n\r\nExtremely poor. It doesn't really have a plot and the setting is perfectly common (it is not set in a high school so it could have done worse, really). The side stories are the ones that should get your attention the most, since the main one doesn't have anything to tell. Don't worry, you probably won't be able to remember anything about it in a few month, except that the main relationship is based on non-consensual acts (it means rape). \\n\\n\r\nArt: 2\\n\r\nWith its dorito faced seme and soft cheeked uke, JR's character design is the most typical one you can find in the shounen ai/yaoi genre. You wouldn't differenciate the characters if it weren't for their hair color. It's also full of yaoi anatomy examples, as expected from the author.   \\n\\n\r\nSound: 5\\n\r\nActually it's pretty average and the opening song is absolutely what you would expect from a shounen ai anime. Perfectly cheesy and cheerful. \\n\\n\r\nCharacters: 3\\n\r\nThe characters are flat and only consistent in their love interests. To be fair the side couples and characters aren't so bad, you could almost find an average romance story if you were to overlook the two (very annoying) main characters. \\n\\n\r\nEnjoyment: 8\\n\r\nAs I said, it is an absolute must-see for BL fans along with Sekaiichi Hatsukoi. Something to enjoy with your BL fan friends. \\n\\n\r\nOverall: 2\\n\r\nLet's face it, this anime and its spin offs are terrible but can be very enjoyable. I am torn between wishing nothing like that will spawn from Yaoi Hell ever again, and waiting for another gem like this one to land in our lives and cheer us up. \\n\\n\\n\\n\\n\\n",
            "date": "2015-05-12T12:19:00+00:00",
            "helpful_count": 34,
            "mal_id": 187674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4605884.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pastabeanchuu",
                "username": "Pastabeanchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=187674"
        },
        {
            "content": "A bloody brillant show. It was incredibly cute, with so many adorable moments I could've choked on the fluff. It was also very humorous, with some really random, hilarious moments, leaving me laughing out loud. All the characters personalities were incredible, and I loved all of them. It's rare for me to find a show where there's maybe only one person hate, so this show was really good in that sense. Each character is so different and unique, so everytime a new character was introduced it was refreshing. The plot itself wasn't one of the best, although it always managed to make me either cracka smile, or feel like crying. I recomend it any yaoi fans out there.",
            "date": "2008-07-23T22:32:00+00:00",
            "helpful_count": 21,
            "mal_id": 6541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Janks1415",
                "username": "Janks1415"
            },
            "url": "https://myanimelist.net/reviews.php?id=6541"
        },
        {
            "content": "This is my first review, so don't expect it to be perfect... It'll be short.\r\nI'm going to try to get through this review without fangirling, okay? Haha, kidding.\r\nI found this show randomly on RightStuf. the plot sounded pretty good, but I was a little hesitant at first, since it was a yaoi. I honestly expected it to be awful at first. I'm glad it played out the way it did.\r\nStory: 8/10\r\nThe plot of Junjou Romantica revolves around three gay couples going about their everyday lives. It's very simple, but can get confusing since it never focuses on just one couple. It's a character driven romance,so it gets pretty darn dramatic at times. However, this drama is sometimes overplayed and just feels forced.\\n\\n\r\nArt: 7/10\\n\\n\r\nThe art is average, typical of a yaoi. The animation is alright for a romance anime. However, what really turns me off is the character design. They all look the same. I don't necessarily mean the color of the eyes and hair, but they're the same height and the hair is drawn the same. It's confusing at times.\\n\\n\r\nSound: 8/10\\n\\n\r\nSound is also average. The opening and ending themes were good enough to get stuck in my head, and the seiyuu fit well with their characters. The background music was also very nice, and always fit the situation.\\n\\n\r\nCharacter: 9/10\\n\\n\r\nThis show is very character driven. The characters are well rounded and all enjoyable to watch. The minute you meet the couples, you know who's on the top and who's on the bottom. Maybe it's just me, but they seem more human than other characters in anime.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThis show is a fangirl's dream. Being a fangirl and yaoi lover, this show has been like crack to me. It's just that entertaining.\\n\\n\r\nOverall: 9/10\\n\\n\r\nThis anime is a wonderful addition to any anime lovers collection, whether they be man, woman, bi, or straight. It's fun to watch and the characters are enjoyable. I suggest to anyone reading this review go check it out on any anime streaming site, and buy the DVD releases on RightStuf.\\n\\n\r\nSorry, this review was really, really short. I hope this was helpful to someone! :)",
            "date": "2013-11-17T10:31:00+00:00",
            "helpful_count": 19,
            "mal_id": 120601,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3342979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nazunya",
                "username": "nazunya"
            },
            "url": "https://myanimelist.net/reviews.php?id=120601"
        },
        {
            "content": "Since you already have the summary above I'll just jump into my review :)\r\nStory:\r\nWhile I was watching this, I began to wonder how long had it been since I'd gotten so enchanted by a particular story in an anime. So much that watching it put me on the edge of my seat and had me deeply concerned over the fate of the characters. Well Junjou Romantica did all that and more, it left me breathless, and my heart over flowing with joy. The story is absolutely class A work, it doesn't focus on just the sexual relationship the characters have, it actually gives us abeautiful window of how love works in a gay relationship. The uncertainties, the worries, and shows us that their not so different from the relationships of heterosexuals. It goes day to day and gives us a brief yet powerful glimpse at what it means to love, not just because of gender or age, but because we are ultimately draw to that person and how we just cannot help ourselves. It's heartwarming and exciting, a breath of fresh air.\\n\\n\\n\r\nArt:\\n\r\nI have to admit, the only reason I noticed this (out of a literal sea of Yaoi animes) was the beautiful art. I admire how the artist keeps the obvious male qualities and doesn't over feminize the \"uke\" of the relationship but you're constantly aware that their both male, and it leaves little question about it. I must admit, the scenery was beautiful in this particular anime as well. I have to also so that their expression were so full of emotion that you nearly felt like you knew exactly what they were feeling even if they said nothing at all. You could feel the love and affection, and somehow words weren't needed to see it very clearly. Beautiful job on the art!\\n\\n\\n\r\nSound:\\n\r\nI didn't wanna look like too much of a fangirl so I decided to down grade the sound to a 9. I won't lie, the background music was gentle, not overpowering like in some animes, it was perfect for setting the mood. The opening and ending were rather fun too, and it seemed to fit the anime so well it was hard to argue they did a good job choosing the opening and ending for this anime. I think I gave it a nine soully based on the fact that I didn't wanna give it a perfect 10, i'm such a douch but it was still a beautiful soundtrack and I'm definitely considering purchasing the OST's!\\n\\n\\n\r\nCharacter(s):\\n\r\nI have to say first and foremost all of the characters were beautifully done, not just artistically but also personally. You see the personal growth in all the characters and how each hardship just brings them closer together, and even makes them more open and honest with the person that they truly love. You get a feeling for each character and somewhere along the line you start screaming \"SAY IT!\" like a fool. They draw you in, and before you know it you really start to feel like you know them in some strange way, like they were truly real. The characters really were amazing in this anime, I have to say I'd give them all a perfect 10.\\n\\n\\n\r\nEnjoyment:\\n\r\nI haven't enjoyed an anime this much since Ouran High School Host Club, and I haven't watched that anime in over 2 1/2 years. Sure I've watched some good anime but to truely enjoy an anime this much is rare for me. I'm glad I found it, the writer did an amazing job, though some things were lacking but they were scarcely noticeable. I just can't explain how much I enjoyed this anime without writing a novel about it. Lol!\\n\\n\\n\r\nOverall:\\n\r\n10/10 what can I say? The only flaw I had through the anime was the fact that there wasn't alot of \"lovey-dovey\" stuff going on, but I suppose that's how it is in sometimes when both partners are working. It can be abit frustrating but if you like yaoi and a good love story, watch this. It definitely is a crowd pleaser, and even if you're not so keen on it, I doubt you'll end up hating it at the very least.",
            "date": "2010-08-21T22:28:00+00:00",
            "helpful_count": 17,
            "mal_id": 29857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/346026.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rojocharmander",
                "username": "rojocharmander"
            },
            "url": "https://myanimelist.net/reviews.php?id=29857"
        },
        {
            "content": "Well this is my first review and I hope someone finds it helpful. \r\nThe Story:\r\nJunjou Romantica was an incredible yaoi themed anime. It created a story of not just high school romance but adults after school. However the storyline from there is at the best basic. Out of the three storylines written into the overall story only the main story develops. The two basic characters Misaki and Akihiko are two lovers who conquer all expectations of both of them and continue to be together. The end of the plot. Yes there are hardships for the two but the ideas are unrealistic and could cause confusionto people  who are straight looking into a gay themed romance. Basically it does not show the hard ships that are often confronted in the everyday life. The other two stories are about the same way. Only with different aged people. I enjoyed the anime but I fel it was more because of funny plots intermingled and the stereotypical ideals. \\n\\n\r\nThe Art:\\n\r\nIn this catagory I have to say I thought the animation was great. The artwork was different and switched often throughout the anime from chibi mode to the real perspective. I however prefer artwork that is the typical big dramatic eyes than that of a more realistic piece. \\n\\n\r\nThe Sound:\\n\r\nThe voice over actors did a wonderful job to me when portraying the characters. The only exception is the introduction of english into the japanese show. It pains me to hear the really bad english that the actors use. Other than that it was wonderful. The themesong \"Himi Kana\" by pigstar is great and I fell in love with it the first time I heard it. \\n\\n\r\nThe Characters:\\n\r\nThe characters have unique attributes to each of their personalities. Though the idea of them knowing each other without really knowing each other was kind of odd. I think that they could have had a better way of combining the stories but that is my own opinion. I loved each of the characters strange personalities and could be why I enjoyed the anime as much as I did. \\n\\n\r\nEnjoyment:\\n\r\nEven with the awkward storyline of the neverending parade of triumphs over expectations I have to say I really enjoyed it. The characters plus the audio and visual perspectives captivated me. I felt like I needed to see the next one just to see the characters interactions. The hilarious comments and expressions kept me coming back for more.\\n\\n\r\nWith that I have to say overall the experience was very good and I may even watch the anime again.",
            "date": "2009-08-16T09:18:00+00:00",
            "helpful_count": 13,
            "mal_id": 17800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ellenore_shade",
                "username": "Ellenore_shade"
            },
            "url": "https://myanimelist.net/reviews.php?id=17800"
        },
        {
            "content": "Let's start this off with overall Junjou Romantica was a very good anime. The story was intresting enough to keep you watching, with a few slower parts. Though it did leave me with a feeling of just watching a chick flick. It was diffinitaly full of drama.\r\nSome of the characters were deep, others not so much. The animimation of them were done well, and the voices matched the characters. But there were times when the words didn't match the mouths moving. And the timing was off by a noticeable amount.\r\nI'd suggest this anime if your in the mood for drama an romance. Junjou Romantica isfilled with that, but it also has some comedy and fluff. Even if some of the plot seems like it has been done in quite a lot of movies, this is still a good watch.",
            "date": "2010-04-18T17:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 25195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291030.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BrynjaBloodmire",
                "username": "BrynjaBloodmire"
            },
            "url": "https://myanimelist.net/reviews.php?id=25195"
        },
        {
            "content": "The only reason this even has a 2/10 rating is because I enjoyed Nowaki and Hiroki's narrative—1 point for each character.\r\nUsami is a romanticized rapist and manipulator—there's no other way to spin his character. He was very manipulative and predatory and it was just really distasteful. There was nothing likable about him. I really did enjoy Nowaki's and Hiro's stories however. Had the story only been about the two of them, Junjou Romantica would have received a 8/10 rating from me. But it wasn't so I decided to drop it. I just can't support a series that tries to make rape and abuse a normalthing. It happens in real life; I don't need to see it in fantasies too.",
            "date": "2016-07-05T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 223245,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288680.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/juneboba",
                "username": "juneboba"
            },
            "url": "https://myanimelist.net/reviews.php?id=223245"
        },
        {
            "content": "Story 9/10\r\nJunjou Romantica is one of my favourite BL stories of all times. It is not a \"yaoi\" story that is filled with pointless sex scenes. In fact, there is no explicit sex shown in the anime at all. Any sex is mostly short and glossed over, and used to add to the mood of the story. \r\nThe story deals with 3 couples that are semi- interconnected (while living their own lives). These 3 couples have very similar romances and faces similar problems, but each one deals with them differently. The focus of the story is mostly dealing with the character's personal feelings and thoughts,and how they deal with the problems they face in their romance. It's filled with inner thoughts, so there's quite a lot of monologue. \\n\\n\r\nI find that this story deals relatively well with the implications of what do you do when you just happened to fall in love with someone of the same gender.  It's not about gay men per se, but about men who just happened to fall in love with another guy and then having to live with the consequences. Especially in the case of Misaki and Miyag-sensei, they had problems accepting the affections and romantic advances from another guy. Through the story, they had to think it out for themselves and eventually accept their own feelings for another guy. In this sense, it is quite a serious story. However, the day to day events of the story are quite comical. \\n\\n\r\nAnother issue the story dealt with is the age gap. In the 3 couples, the age gaps are 4 years, 10 years, and 17 years. Each one shares different problems, whether it is social pressure, or wanting to be worthy of the one you love, not wanting to lose them to the age difference etc. There's also other social problems involved such as teacher-student or in one case, the younger brother of his ex-wife. The point I wanted to make is that the story focuses on how the characters think about their situation, and how to deal with their feelings and the problems, instead of just about men having sex.\\n\\n\r\nArt 8/10\\n\r\nThe art style is slightly different from the manga, but still quite similar. I think that there is a good balance between masculine and feminine features in the characters. Except in the case of Misaki and Shinobu, where they are somewhat feminine looking (because they are supposed to be younger), all the other men are very masculine without being too masculine. What this achieves is that it avoids the BL cliche that the uke basically looks like a pretty girl. While I don't mind art features metro pretty boys, it is refreshing to watch BL about men who look like men. Very clean and clear animation.\\n\\n\r\nSound 10/10\\n\r\nI personally fell that the background music tracts did a great job to fit the mood and events of the story. There was several times that I thought \"hey, that music's really good\". \\n\\n\r\nCharacter 9/10\\n\r\nAs mentioned earlier regarding the story, Junjou romantica focuses on the character's inner turmoil and thoughts, which means we really get to see the inner workings of the character's minds. While the story is a bit cliche (their thoughts are mostly predictable), but that is the point of romances. Cliche romances are loved by many (including me ^^).\\n\\n\r\nEnjoyment and Overall 10/10\\n\r\nWhat's best about the anime is the blend of everything together, the serious issues that the character deals with but with very good comedy moments. Together, it makes the show very enjoyable to watch. \\n\\n\r\nNow to address the problems with the anime: it was too loud. There was just too much yelling. In each of the 3 relationships, there is one \"quiet\" one and one \"loud\" one. The loud one gets flustered easily and yells WAY too much, and sometimes it really gave me a headache. While reading the manga, you don't have this problem, but I really disliked parts of the anime because of that. The uke also cry a lot in addition to yelling, which can get annoying.\\n\\n\r\nAlso, while each story is different from the others, they all share some similarities in the character stereotyping - strong, quiet seme with loud flustered uke. Junjou Romantica does follow very cliche BL character types (though its not just BL, many romance genres all follow this kind of cliche with a strong and a weaker character in a relationship). \\n\\n\r\nAnother \"failing\" is that while it deals with some serious issues, it never really deals with the issue. Since it focuses on the characters themselves and their thoughts, it doesn't tell us anything about the external world that they live in. You're following the first person POV of the main character basically, which means there is very limited knowledge of the world outside his inner thoughts I put \"failings\" in quotes because this is not really a problem, because overall its a comedy, not some deep soul-searching social commentary. It may be interesting to know more about the rest of the world that the story is set in, but it doesn't make the story bad in any sense. In a way you can interpret it as that the characters live in their own little romance world without care for the rest of the world (which is somewhat true, they worry about it but it's a fleeting worry. One of those Love can conquer all type of story). However, I do feel that the romance may be doomed to fail in the future because of the social problems they face. As a romance comedy, it doesn't take serious problems as seriously as it should. For example, there is very little chance that people would accept a relationship between a professor and a high school student if they wanted to take the relationship public. \\n\\n\r\nIf you are a fan of cliche romances (whether gay or straight), then you will enjoy this. If you don't, then this may not be the best. Definitely, you will have to have an open mind towards BL to really watch the show. I don't think this is a story only for the fangirls (it's focused on romance between two guys, not just some gay porn without plot), I do believe someone who is neutral towards BL may also enjoy it purely for the entertainment value of the story. If you dislike male on male relationships, then you shouldn't be watching BL at all. If you're interested in finding a good romance story staring males, then this is for you.",
            "date": "2011-01-13T23:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 33739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KuraKaze",
                "username": "KuraKaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33739"
        },
        {
            "content": "So this is my fourth yaoi, but first one where it is an actual story with more than two episodes. I would have rated it a ten, but I did not care for the third couple in the terrorist arc. It, to me, was no different than a little girl having a crush on her teacher. This boy, I'm sure he had feelings for him for a long time, but to just up and chase him the way he did. Ugh! He just came off as confused and desperate to me. I didn't like that couple.\r\nBut the other two I love! I like that Misakiand Usagi got as many episode as they did because that couple was my number one favorite. It had more elements and more of a plot than than Hiroki and Nowaki.\\n\\n\r\nI do kind of wish Misaki's brother was used more in the story, but I'm pretty sure in one episode they said he was dense so I guess he was used as much as a dense person could be used, or maybe he just didn't want to force his brother to come with him back home.",
            "date": "2013-09-01T08:24:00+00:00",
            "helpful_count": 11,
            "mal_id": 111831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182527.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hachiko75",
                "username": "Hachiko75"
            },
            "url": "https://myanimelist.net/reviews.php?id=111831"
        },
        {
            "content": "Junjo Romantica is a great yaoi anime, I say yaoi anime on purpose. As an anime, it's so-so I guess, but I'm a huge yaoi-fan and I loves this anime. It's one of the cutest shows I've ever seen.\r\nlet's discuss it:\r\nStory: 7/10\r\nWell, the story isn't that great, I admit. It's pretty obvious what will happen and it's not really progressing. You're just following three couples and how they are changing in the relationship, overcoming obstacles and sometimes becoming the obstacles themselves. \r\nThe main couple is Misaki/Usami, \"side couples\" are Hiroki/Nowaki and Miyagi/Shinobu. I liked that they all sort of know each other (except Shinobu).\r\nThe reasonwhy I rated the story 7 is because it's slooooow, especially how Misaki is unable to say \"I love you\" which goes on like 5 episodes. But, if you're a yaoi-fan like me, you won't find it disturbing.\\n\\n\r\nArt: 7/10\\n\r\nI liked the art, maybe it's a bit angular, but it fits the story. It's not amazing artwork, but it doesn't need amazing artwork. The soft pastel-colors fit the yaoi-genre and the cuteness.\\n\\n\r\nSound: 9/10\\n\r\nGreat voice actors! I think that's quite important. A voice actors can make or break the character. Takahiro Sakurai as Misaki is doing an amazing job, as always. The music didn't really caught my attention, although the opening and ending are nice.\\n\\n\r\nCharacter: 9/10\\n\r\nI think this anime really depends on the characters and not on the story. The \"ukes\" are developing in the relationship, Misaki doesn't want to be a burden to anyone, Hiroki has had missed chances with Usami, Miyagi has a dead (female) lover. But they all bloom in their relationships and it's nice to see them trying to overcome their flaws for their lovers. \\n\\n\r\nEnjoyment: 10/10\\n\r\nBecause it's the best yaoi-anime I've seen and I cried every episode.\\n\\n\r\nOverall: 8/10\\n\r\nIt's an awesome anime for yaoi-lovers!",
            "date": "2010-08-09T03:14:00+00:00",
            "helpful_count": 10,
            "mal_id": 29450,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179509.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Winterwolkje",
                "username": "Winterwolkje"
            },
            "url": "https://myanimelist.net/reviews.php?id=29450"
        },
        {
            "content": "This is one of the best anime I've ever seen in the BL/yaoicategory. It made me burst of with laughing from the hilarious moments, almost crying from the sad moments and smiling from the sweetness.\r\nThe story is not good, but that doesn't matter to me since I enjoyed this series so much anyway.\r\nI think the voices could be better, some of the voices just don't fit the characters. I had to be used to the opening to like it but I don't really like the ending, so that could be better to me (although this part depends on ones taste).\r\nOtherwise this is a masterpriece tome, and the art is amazing! It's very well done like the manga it's based on.\\n\r\nThe characters are great! Some of them are ordinary characters but developed in a way that makes them unique.\\n\r\nI really recommend this to BL/yaoifans! Have a good time watching!",
            "date": "2008-07-24T05:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 6547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12130.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MissOffline",
                "username": "MissOffline"
            },
            "url": "https://myanimelist.net/reviews.php?id=6547"
        },
        {
            "content": "This year for our Valentine's week romance review, we're looking at Junjou Romantica. This one is based off of the best known work of Nakamura Shungiku. The  manga has been going since late 2003. The anime, at least the first series of it, aired in 2008. And that was brought to us by Studio Deen. Yes, the same studio that brought us Gravitation, Twilight Q, & Shouwa Genroku Rakugo Shinju. I have a feeling one of those is going to bear far  more similarities to this than the others. But maybe I'm just making assumptions based on the genre overlap. Is this oneas good as Gravitation was? Let's take a look at  the first series and see. \\n\\n\\n\r\nStory:\\n\\n\r\nWe start out with Misaki, our protagonist, trying to get into a good university. There's just one problem. His test scores are pretty bad. In order to better prepare for the entrance exams he enlists the aid of his older brother's friend who also happens to be a famous author. This is Usami, also called Usagi-san. But things quickly take a strange turn when Usami immediately molests Misaki. We then go through a harrowing narrative as Misaki struggles to cope with the violation and whether or not to involve law enforcement. Or, maybe that's just the start of a romance. It's one of those, and not the one that makes more sense. \\n\\n\r\nTherein lies the fundamental flaw with Junjou Romantica. The main romance is completely fucked up. Usami straight up sexually assaults Misaki a lot. With dialogue from Misaki to the effect of “Stop. Let go. Get off of me.” and yet we're supposed to buy into the idea that this is a good romantic relationship and not a serial rapist who's chosen a younger victim who happens to be in his power. But it's actually totally the latter and they never acknowledge the severe problems with it. Give a series like Love Stage some credit, at least when it uncomfortably started with an attempted sexual assault they put some effort into showing redemption and repentance on the part of the guilty party. There's also a secondary romance between a university professor and a high school boy who wants to go to the university he teaches at. I foresee no ethical problems with that whatsoever. Frankly, both of these romances are super unhealthy & really uncomfortable to watch. Which also adversely affects the attempts at comedy. Because you aren't getting legitimately funny scenes in a series with an uncomfortable, rapey atmosphere. \\n\\n\r\nThe one area where I'll give the series some credit is that the relationship betwixt  Hiroki & Nowaki generally does work. They demonstrate respect for one another's boundaries, which should go without saying but, in this series, is unique. They also have some compelling relationship issues that do speak to the kinds of real problems that healthy couples face. Like a lack of communication or jealousy. \\n\\n\r\nCharacters:\\n\\n\r\nThe characters could almost be pretty typical. Usami is the talented rich boy who has a childish side into adulthood, with a side of being a rapist. Misaki is the youngster with a lot of potential who's uncertain about himself but will do anything for the one they love. Or, in this case, the one he's got Stockholm syndrome for. Ultimately, that makes them worse than generic. Because this series is grotty. \\n\\n\r\nLike with the romance in general, the only characters who somewhat redeem the series are Hiroki & Nowaki. Since the problems they deal with are pretty legitimate and they handle their situations in a somewhat realistic fashion. \\n\\n\r\nArt: \\n\\n\r\nIn terms of artwork, there are some nice backgrounds. The character designs look decent enough. The comedic art shift that you get when the series thinks it's pulled away from the uncomfortable romance aspects enough to go for a joke look pretty bad and they're kind of over done in terms of how frequently it happens. \\n\\n\r\nSound: \\n\\n\r\nThey did get some very talented actors for this. Including our old friend, Sakurai Takahiro. There's also Itou Kentarou, Canna Nobutoshi & Kishio Daisuke to name a few. That being said, these aren't their best performances. A lot of it boils down to them having reactions that are really downplayed because “this is a romance. So, your “no, stop” needs to be a soft protest.” It's almost like that element singularly damages virtually every facet of the series. That's also why Itou & Canna give, by a good margin, the best performances in the series. Since their characters are allowed to react to their situation in a way that isn't totally stilted. The music is by MOKA, the same music unit that brought us Elfen  Lied's  average music. This is slightly better than that. It's okay. \\n\\n\r\nHo-yay:\\n\\n\r\nWell, we have three main couples, all of which are gay. Our main couple is really rapey and repulsive. One of our secondary couples is exceedingly unethical excrement. That leaves the Hiroki/ Nowaki couple. Which, to be honest, isn't worth sitting through the rest of this for. They have some cute moments and if they were in a series by themselves I'd probably be pretty fond of it. Overall, though, this is not a series with a healthy concept of what a romantic relationship between men looks like. You'd be better off with Gravitation or Gakuen Heaven. Even something with a gay couple on the side like Gundam Wing or Voyages of the Cerberus (I know, shameless self plug) would be better if decently handled. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nIt's probably pretty plain to see that I did not care for this series. Part of the problem is that it paints sexual assault as an ordinary part of romance. Part of the problem is that it portrays itself as a “pure” romance series while having that kind of shite as a staple. Ultimately, it's pretty bad and I really don't recommend it unless you have a fetish for gay rape. Which I won't judge you for but I may slowly back away from you and only ever be around you in bright, crowded areas. The one redeeming factor is the Hiroki/ Nowaki romance, which is, unfortunately, not the focus. So, the final rating is going to stand at a 3/10. Next week I'll look at A-Ko the Versus.",
            "date": "2018-02-15T12:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 271573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=271573"
        },
        {
            "content": "This anime sucked balls.\r\nThere is, for some reason, an abundance of female characters throughout the story. Everything is repetitive. I now wonder after watching this series, how I managed to cope with this. Every fucking gay man has a triangular face, the love interests i.e Misaki or whatever, looks like a five year old idiot who kept whining and complaining. Like, dude. If someone is assaulting or raping you, you need to kick them in the balls, punch their face and go home to tell your brother to break his friendship with him and report against him for sexual assault.\r\nBut, instead, he stayed with thedouche bag and eventually fell in love with him. After two major headaches and ten episodes later, they're still not an item. Like what the f dude? \\n\\n\r\nTHIS ANIME MADE NO SENSE, WHATSOEVER.",
            "date": "2017-08-02T07:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 254495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6253228.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/melodyvonshewk",
                "username": "melodyvonshewk"
            },
            "url": "https://myanimelist.net/reviews.php?id=254495"
        }
    ],
    [
        {
            "content": "For anyone that is unsure about giving this series a chance, then you should read this to see if its right for you or not. (look for *)\r\nIF! you switched half the guys for girls people would say this is one of the best romance anime's to date. That is how good this story, and anime are!\r\nOkay here is a little background on me, I am a Straight male with no interest in men or for even watching a BL series, However there might be a few people out there who's Girlfriends really want to watch this so..... they FORCE you to watch this (whichis what happened to me.) Before i watched this  i knew what it was and i had a feeling i knew where it was going to go. well at first try i almost couldnt stand what was going on, i thought to myself OMG RAPE! and turned it off. then about two weeks later i then tried (got forced) to watch it again. To my surprise i enjoyed this, and very much so.\\n\\n\r\nStory 9\\n\r\nIts very simple but very powering with alot of colorful words. its about three homosexual couples how they live there daily lives, some knew they were gay and accept it, it also shows the people that dont really know if they are gay, or even what being gay really means. It shows there struggle through acceptance, denial, and their love for one another. \\n\\n\r\n* If you dont mind yaoi then this is a most watch, this was my first one. IF you like great romance stories with fun characters and sexually funny moments this is for you. IF the thought of two guys disturbs you in any way then i would try the first episode and see what you think\\n\\n\r\nArt 7\\n\r\nThe art, well its art. this has just the right amount for what its trying to accomplish. I cant give this a higher score because there is no need for the Art to be off the charts its a Rom/Com. they charcter designs were nice some of the guys looked the same so that didnt help any, i did however enjoy the silly faces misaki made when he freaked out, when the humor comes so does the silly drawings which were nice and a refreshing change from a typical romance style art. \\n\\n\r\n* IF you must have Brotherhood type Art or a style classic like Mononoke or and art that has an old school vibe like bebop this isnt for you, this is a typical and averagely average Art style.\\n\\n\r\nSound 8\\n\\n\r\nI cant say it was really typical but it wasnt overly aggressive. The OP and ED were decent nothing great, once again pretty average, the music throughout was the same, however when it needed music the most it got it. Every sappy love speech or new revelation they encountered the music fit wonderfully.\\n\\n\r\n* Not a mozart score by any means, also not some Glee infested over hype. I dont really think theres much to say, but just to be safe if your looking for an awesome blow me over feel from the music and how it makes the whole mood better it does this decently. so if you a sound type of guy/girl not for you.\\n\\n\r\nCharacters 9/9.5\\n\\n\r\nThey were fantastic, i swear misaki is a tsundere... i dont know if thats how it works but whatever. you could clearly tell after a few episodes who wore the pants and who wore the mini skirt in the relationships. The characters were cute, funny, and dramatic what kept me from saying 10 was the over dramatic parts. most of the time the characters pulled of the role great and really shined but every half dozen episodes it was just to overplayed. The last couple to be declared really surprised me as well it also added in some nice background drama that i thought was pretty interesting and cant wait to see who they work out and how the other characters work out there relationships.\\n\\n\r\n* Well this is a BL series so for obvious reasons if you cant get past that you wont like this, if you can do what i did and just treat the \"weaker man\" as the women you will be happy with this series. I think if you watch this it will be hard to say anything negative about these wonderful characteres.\\n\\n\r\nEnjoyment 9\\n\\n\r\nat first i really did not like this, it started of awkwardly with a little mis communication along with other things. Then after that moment passed i really started to get into this and found myself really wanting the relationships to develop. just really great.\\n\\n\r\noveral 8.5/9\\n\\n\r\nIf this review helped and made you want to give this a shot then chances are you will love this it is a pleasant surprise and kind of a shocker for me that i actually enjoyed this as much as i did. \\n\\n\r\nThank you i hope this was helpful.\\n",
            "date": "2011-12-10T22:23:00+00:00",
            "helpful_count": 258,
            "mal_id": 48927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/561795.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OtakuTrey",
                "username": "OtakuTrey"
            },
            "url": "https://myanimelist.net/reviews.php?id=48927"
        },
        {
            "content": "So since no one has gotten a chance to review this anime I guess I will do the honors of being the first. I stumbled upon this anime while searching for random videos of youtube and I have to say I never expected it to be as good as it turned out to be. I just cannot stop watching this anime its completely and utterly addictive. Sorry this isnt going to be very dramatic and new york times like. \r\nStory:\r\nDefinitely a yaoi girls(or guys) dream. The story is filled of 3 main plots all involving 3 different couples. There is the teddy bear obsessed writerdating the younger brother of his best friend. The loner intelligent associate professor dating the student, and the divorced husband dating the brother in law. All stories giving something that puts this anime together. This anime shows how pure love is and how it is unexpected. Not to mention yaoi galore. Be prepared to watch tons of sex scenes.\\n\\n\r\nArt:\\n\r\nI think the art is pretty good. A little different from what I'm use to seeing and definitely different in a good way. I've seen better but it passes the test. It seems to capture the love scenes without making it too *cough* explicit.\\n\\n\r\nSound:\\n\r\nThe opening is alright I suppose. And the music during the show isnt that memorable. \\n\\n\r\nCharacter:\\n\r\nCharacter development in this anime is extremely face paced. But there is never a moment in which you dont know how a certain character is feeling, but it also leaves openings for surprises and turns.\\n\\n\r\nEnjoyment:\\n\r\nAs I said at the beginning this anime is absolutely addiciting. I can sit and watch it all day. The stories that are told are touching and show how love can exist in the most unexpected and different ways. It also has its comedic moments which dont fail to make me laugh, and it is extremely hard to make me laugh.\\n\\n\r\nThis anime no matter how much it reminds me of gravitation is definitely worth the watch. Just make sure there arent any children in the room ;)",
            "date": "2008-05-25T20:01:00+00:00",
            "helpful_count": 253,
            "mal_id": 4981,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9294.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/meowmeow21",
                "username": "meowmeow21"
            },
            "url": "https://myanimelist.net/reviews.php?id=4981"
        },
        {
            "content": "Oh, an anime that certainly puts the fab back in fabulous and the gay back in yaoi. \r\nJunjou Romantica is a yaoi anime, as anyone with eyes would know. What it is, is a well loved yaoi anime and a pretty crappy normal anime. Yes fangirls, feel free to hate on me now, it's okay. Just one word of warning: you will never get any of these men. They're gay and fictional. Now go cry about it. \r\nThe storyline is plain old unbelievable. You expect me to believe that there are so many gay guys who are all inter-related, yet most don't know the restare gay unless they had boinked them in the past or something?? Where are the women in this anime? Fine, I can chalk up with the no women thing since gay men can't see oestrogen anyway unless it's from themselves, but the one woman in the entire anime is a yaoi fangirl. I mean come on. Wtf. \\n\\n\r\nEach story is basically a mirror of the other one. Check this out. \\n\\n\r\nTeacher --&gt; younger man --&gt; butt secks. \\n\\n\r\nThat's all that freaking happens for the entirety of the anime. An older, teacher-like dude meets a muuuch younger dude and they hook up and have lots of unwilling sex with one another. \\n\\n\r\nFirst couple: a tutor who tries to seduce his best friend's little brother. Second couple: a teacher who is seduced, is trying to seduce a younger man. Third couple: another teacher whose ex-brother-in-law is trying to seduce him. God, come on! What's with this? What are they trying to say--that gay men with any position of authority in a younger boy's life will try to lead the boy astray?? Nothing happens in the story other than a whole lot of angst, sappy romance, and sexing all over the place, with a lot of &quot;Nooo! Don't touch--oh wait, go ahead, but nooo!&quot; going on.\\n\\n\r\nArt was trash, sound was worse trash. Those theme songs sucked balls, though if you're a yaoi fangirl, then you won't care too much. \\n\\n\r\nCharacters were dead awful. Most of the time they're whining or they're moping or taking advantage of someone. I mean, come on! The writer guy did nothing but go, &quot;I love you. Let's do it.&quot; for the whole anime. The boy he liked kept going, &quot;Oh, I don't want this...wait, I think I do.&quot; and that's pretty much how it went for the whole anime with EVERY couple. \\n\\n\r\nDon't watch this is you are a normal person. For a yaoi fangirl, this anime is pure genius. For fabulous folks like myself, AVOID.",
            "date": "2009-01-29T15:50:00+00:00",
            "helpful_count": 247,
            "mal_id": 11931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=11931"
        },
        {
            "content": "You want to know what really helps shape a relationship for me? An abundance of rape, sexual assault, and non-consensual acts being performed to your partner. God, what a literal pure romance that is. Thankfully, Junjou Romantica was sure to base one of its relationship entirely off of non-con and definitely wasn't afraid to add in some of that to the other relationships as well! Definitely the type of romance any gay man would dream of.\r\nThere are three different \"love\" stories in this anime, and all three manage to be equally as terrible as the other. For one thing, let's talk about the fact thatliteral sexual assault by a man 10 years older than you leading into love is not only extremely disturbing, but also completely out there. There is no moral groundpoint for the character Misaki, who is constantly abused in many ways by his newfound partner, Usami. This romance is so pure, that Usami literally shoves Misaki into a car against his will because Misaki dared to have a conversation with another man. What a healthy relationship, such a charming guy. Not to mention he doesn't let Misaki speak on the phone with said guy, and makes sure to later sexually assault the poor guy.\\n\\n\r\nSeriously, what in any way is romantic or logical about this? There isn't anything healthy or consensual about the actions that Usami places on Misaki. And not only that, but it's all played as a joke. As if this kind of stuff is a humorous, cute thing that Misaki secretly wants. The romance in here is a total joke, and if you expect me, or any person with a functioning brain to take a relationship completely built off of sexual harassment seriously, then there's a good chance your morals need reevaluating. \\n\\n\r\nThe reason this is such a issue is both because said relationship is the main focus of the show, and because this is apparently a romance. Having your romance start and develop with borderline rape is a terrible choice, because from there on out it's extremely hard to feel anything except disgust at the events occurring. It's an unnecessary element to the relationships. Age difference aside, I wouldn't have had nearly as much of an issue with this show had it not been for all the times that Misaki was screaming \"No! Let go! Stop it!\" when being advanced on. It makes for a very fucked up relationship.\\n\\n\r\nThe other two relationships, while they didn't revolve around borderline rape, still had their major problems in it. One relationship lasted for about 3 - 4 episodes and included a timeline of about 6 years. It also included the man getting up and leaving his partner without any explanation or contact because he thought it'd make him want to come back. Again, great romance there. The last romance only lasts for about 2 episodes, and therefore had less of a chance to be completely idiotic. Though it should be noted the two characters have about 17 year age difference, which is always a plus here. It still featured the token sexual harassment that this show is known for though. \\n\\n\r\nNot only that, but the stories are really choppy and broken up. The first 2 episodes focus on Romantica, episode 3 on Egoist, back to Romantica for a bit, some more of Egoist, etc. Basically it's all very choppily split up, unnecessarily so. The rapey elements obviously ruin it too, and frankly the time it takes for the characters to \"fall in love\", their reasons for doing so, and how they act towards their loved ones (Preventing them from being with friends, going into their house after you've known them for less than 24 hours) is so incredibly far-fetched that the romance just feels terribly pushed.\\n\\n\r\nIn terms of characters, you can tell how they'll be from the designs. Triangle face guys are the seme, and baby-faced boys are the uke. The seme is almost always the one performing the near-rape actions while the uke is the one begging for no more and eventually falling for these creeps. There's not too much to say about them, except for the fact that Usami is an extremely creepy harasser and that the seme in the Terrorist arc actually has some interesting traits to him regarding his past. Other than that, these characters are just here to fill the traditional seme/uke roles and either begin or resist the sexual assault.\\n\\n\r\nThe art reeks of terrible same face syndrome, to the point where you can identify the seme and uke just by looking at their faces. The seme's are all drawn with these very awkward looking rectangle chins and huge broad shoulders, likely to insist their dominance on the usually much younger looking uke character. All the ukes are drawn with childlike features to insist their submissiveness. The animation is very cheap-looking too, often relying on chibi faces in order to save budget. It's honestly an unimpressive looking anime. \\n\\n\r\nThe sound isn't all that bad frankly, just not at all fitting for this type of anime. There's usually some acoustic piece playing in the background as one of the characters is being assaulted, which is very ill fitting and and makes it feel like the show is romanticizing borderline-rape even more. It's not necessarily a memorable soundtrack, but it's decent at best, just not fitting for the gross nature of this show.\\n\\n\r\nBeing asked if I enjoyed this anime is the equivalent to being asked if I enjoy bashing my head against a wall for about 4 hours and would likely have the same answer to them. If you're going to portray a romance, hell, especially a homosexual romance where there's already stereotypes that all homosexuals are pedophiles and stuff, then you don't do it this way. You don't have the starting point of the relationship for a major couple be near-rape. You don't give unequal focus to the relationships and have one take place over a course of 6 years in four episodes. Oh, and you especially don't include homophobic remarks from your own gay characters in an anime. Seriously, how idiotic do you have to get to even think of doing that?\\n\\n\r\nAnime that focuses on something other than straight romance can be really refreshing, but when it's done this way? You'll be left wondering if half the show you just watched was a so-called \"pure romance\" or a stockholm-syndrome documentary.",
            "date": "2014-07-31T17:49:00+00:00",
            "helpful_count": 132,
            "mal_id": 154655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1377187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ihateeveryone",
                "username": "ihateeveryone"
            },
            "url": "https://myanimelist.net/reviews.php?id=154655"
        },
        {
            "content": "In Junjou Romantica you get to follow 2 couples (and a potential third) with Usagi and Misaki being the one that gets the most exposure. Then there is Hiroki and Nowaki which is basically the same thing as the first couple, younger guy + older guy, but reversed positions between the sheets. If you ask me I think that just focusing on Usagi and Misaki would have been better cause the others just feelt tacked on for the sole purpose of having more bi-shounens ( or \"pretty boys\" if you like).\r\nThe music is nothing special, it doesn't help to add to the mood but itdon't do the opposite either. However, there is some nice pieces in there but I found them to seldom be played at the right time. The opening-theme is pretty nice but this isn't 1999 so it feels kind of out of place. The VAs generally does a good job but some of them don't match their character, not a huge problem since it is always with characters that have little screen-time but still annoying. \\n\\n\r\nHave you ever felt that eveyone looks very similar to you? No? Well, I guess the characters in Junjou Romantica have since they all look very alike. Except from the hair and eye color they could all be brothers from the same mother. It is quite rare that you see this kind of bland and unimaginative character design. It tries to make all the characters bi-shounens but man sometimes they failed miserably, in some scenes it looks like they have some kind of facial distortion since it sometimes doesn't fit the body at all. Otherwise the animations and characters  look ok and sometimes even (intentionally) funny when they go into chibi-mode and extreme facial expression-mode.\\n\\n\r\nIf it is so bad then why is it so highly placed on the top-list? There are perfectly bad reasons for that. The first being the amount of sex (non graphical) there is, it is almost ridiculous and you always get the tiresome &rdquo;No, I don't wanna do it with you&rdquo;-reaction from the smaller of the two gets old quickly. Sometimes the reactions are so strong that they almost looks like an attempted rape... You don't get any mentionable depth to most the characters, with the exception of Usagis childhood, but that is good in a way that you don't have to care. The only ones I really came to care about was Misaki and Usagi but the rest I could have been without.\\n\\n\r\nThe highlights of the show is the humor which sometimes makes fun of the show itself. \\n\\n\r\nTo sum the series up it is an unimaginative piece of boredom that tries to excuse that unimaginativeness with some random sex. It has some qualities but they never truly shine through. If you are a fan of boy on boy-relationships then this might be for you. Otherwise I suggest that you don't even poke this with a stick cause there will be a lot of fooling-around going on. You might have read my Legend of Duo review and thinks &rdquo;Hey, this guy clearly dislikes shounen-ai so why should I listen to him?&rdquo;, well... it's not that I dislike it (I try to keep an open mind about all themes) I just haven't found a series that is very enjoyable.\\n\\n\r\nPlease, Studio Deen, you know better than this. You gave us Maria-sama ga Miteru on the shoujo-ai side so please give us Joseph-sama ga Miteru (or something like it) on the shounen-ai side instead and lose the redundant sex scenes in favor for some real heartfelt and meaningful brotherly love. Please.\\n",
            "date": "2008-11-11T00:21:00+00:00",
            "helpful_count": 51,
            "mal_id": 9392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35252.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Whoomp",
                "username": "Whoomp"
            },
            "url": "https://myanimelist.net/reviews.php?id=9392"
        },
        {
            "content": "THIS IS THE ONLY PERFECT 10 I THINK I'LL EVER GIVE!\r\nI really think that this is the best yaoi I have ever watched and will ever watch. There is pretty much no comparison to how amazing it is. I mean, sure, it only is really attractive to yaoi fans to watch it, but I think that other people could learn to love it&hellip; at least the story.\r\nSTORY &ndash; It&rsquo;s totally amazing how they have two storied going at different points. There will be episodes about Usagi and Misaki, and then there will be an episode about Hiroki and Nowaki. The story line for Usagi andMisaki is sooooo humorous and yet adorable and dramatic. And then on the complete opposite spectrum, Hiroki and Nowaki &lsquo;s story is so heart-renching and romantic. Both of the stories are very interesting and I personally can say that I can relate to them VERY well. Especially the story of Hiroki and Nowaki... it is almost exactly like a situation I have been in before. And it&rsquo;s great how the story of Hiroki and Nowaki is tied into the relationship of Usagi and Misaki.\\n\\n\r\nART &ndash; Beautiful, beautiful, beautiful&hellip; the shading and colors are so amazing, and everything is so well drawn. This artist sure knows how to draw attractive men with great expressions and actions. Their faces and body language are always so perfect. Not only that, but there are also moments were the drawings are very cartoony and humorous and they make me laugh and go&hellip; &ldquo;AWWW, that&rsquo;s soooo cute!&rdquo; I absolutely would date any of those guys. The drawings are to die for. EXCEPT, the characters all have the same hair cut! And it makes it sooo hard to tell people apart sometimes. It&rsquo;s easy to get confused.\\n\\n\r\nSOUND &ndash; Not all that much background music, but when there is, it is very well-placed. Also, there are moments where small things, like forks on plates, just set the mood for the sound excellently. The voices for all the characters fit them very well, except for maybe Hiroki. I don&rsquo;t exactly like his voice being that deep. It does not match his character very well to me. The OP theme is to die for. But I did not so much enjoy the ED&hellip; but you  can&rsquo;t always have it your way, yeah?\\n\\n\r\nCHARACTERS &ndash; 4 main characters instead of just the normal two or three. I must say I like that, mostly because it gives the watcher more of a view of different kinds of people and there is more to relate to that way. I&rsquo;ll go through every character for you:\\n\\n\r\nUsagi &ndash; very manly and blunt. He blatantly comes out and says what he is thinking, and that is what is so attractive about him. He doesn&rsquo;t really care what everyone thinks and he is very understanding. He wants love and he finds that love in Misaki.\\n\\n\r\nMisaki &ndash; just absolutely adorable! He is somewhat whiney at times, but he is young, and at times is very na&iuml;ve. It&rsquo;s strange that he is 10 years younger than Usagi, but they really have a love/hate relationship. He changes his mind so much. He will at one moment love Usagi and then act like he hates his guts&hellip; it&rsquo;s kinda stupid if you ask me.\\n\\n\r\nHiroki &ndash; I don&rsquo;t really like his character as much, but he is also mature. But, he changes his mind so much. He is very&hellip; what&rsquo;s the word&hellip; harsh. And it seems like he doesn&rsquo;t care about anyone but himself sometimes.\\n\\n\r\nNowaki &ndash; personally, he is my favorite character. He is so loving and because he is truly in love he knows that he never wants to give up on Hiroki. I look up to him because he reminds me a lot of myself.\\n\\n\r\nENJOYMENT &ndash; I&rsquo;m laughing at every episode of Usagi and Misaki. I&rsquo;m crying at every episode of Hiroki and Nowaki. I somewhat wish that they could have split this show into two separate shows so that I was not trying so hard to remember the love affairs of all 4 characters, but none-the-less I enjoyed every second I watched this. :)\\n\\n\r\nEvery Yaoi lover MUST watch this show. It was the most amazing anime&hellip;",
            "date": "2008-08-01T17:09:00+00:00",
            "helpful_count": 42,
            "mal_id": 6766,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/natsuocosplay",
                "username": "natsuocosplay"
            },
            "url": "https://myanimelist.net/reviews.php?id=6766"
        },
        {
            "content": "Dear yaoi fandom, \r\nthere is such an impressive quantity of yaoi out there that are actually really good. Been there, seen it. So why in the world do you love Junjou Romantica so much?\r\nStarting out as a hardcore fan of the series, I gave myself a few years of growing up before I realized this anime deserves to be proverbially spat on with passion. Shamed and enlightened, I saw the Truth and it set me Free. Dramatic as it sounds, fellow reader, the Truth IS: this anime (especially manga) is an utter fuckup.\r\nProbably the biggest problem with today's yaoi that is present here; the 'uke'side of the couple has little to no back spine and, despite the fact they dedicated an episode trying to convince us he WASN'T forced into the 'loving relationship' he is in right now by the 'seme', it is very painfully obvious he was. In other words, characterization is lacking, as it were.\\n\\n\r\nClass writing with many \"uwwa\" moments. I know you love those.\\n\\n\r\nAnother fun thing about this thing is that there are three couples involved and none of them are done right and all of them are an insult to gay relationships, as well as relationships in general. \\n\\n\r\nIt only came to my attention recently that all three of storylines have \"submission&domination\" formula, which would be OK, I guess, considering how common that is; if all three of them weren't exactly the same. MentorxStudent kind of thing, as hot as it can be, had been done terribly wrong in all three instances.\\n\\n\r\nNow I'd like to talk about characters - or should I say a character? Indeed, they are all relatively identical examples of one and the same fantasy the author apparently has about anime men. Not only their design, it is their \"personalities\" that are particularly painful to watch. \\n\\n\r\nThe characters are so shallow and badly developed, their love is completely unjustified by anything they do.\\n\\n\r\nAnnoying voice acting.\\n\\n\r\nAll in all, fangirls. Pay attention please, I have a few suggestions for you.\\n\r\nHere is a couple of manga you can read instead of watching/reading this dreadful thing, because apparently the best yaoi manga are never made into an anime:\\n\r\nAitsu no Daihonmei, Yume Musubi Koi Musubi and it's slightly hotter spin-off Himegoto Asobi, Doushitemo Furetakunai and its spin off After 9 Hours.\\n\\n\r\nEnjoy the reads, you don't need to thank me, spread the word, gimme some good ones in return and god bless our gay hearts.",
            "date": "2012-03-12T07:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 55831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25159.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Klabautermann",
                "username": "Klabautermann"
            },
            "url": "https://myanimelist.net/reviews.php?id=55831"
        },
        {
            "content": "So bad it's good! \r\nIf you are looking for a terribly written shounen ai anime with the most cliché characters and a ridiculous story, Junjou Romantica is the anime you need to watch! (it has dub-con, be warned)\r\nThis is a must-see if you are a fan of the genre and want a good laugh. If you really want to watch something good (and I assure you, good yaoi does actually exists), I suggest you run far away from this.  \r\nThe characters and situations are as stereotypical as they can get in a romance anime. So stereotypical and cliché in fact, that it actuallybecomes funny.   \\n\\n\r\nStory: 3\\n\r\nExtremely poor. It doesn't really have a plot and the setting is perfectly common (it is not set in a high school so it could have done worse, really). The side stories are the ones that should get your attention the most, since the main one doesn't have anything to tell. Don't worry, you probably won't be able to remember anything about it in a few month, except that the main relationship is based on non-consensual acts (it means rape). \\n\\n\r\nArt: 2\\n\r\nWith its dorito faced seme and soft cheeked uke, JR's character design is the most typical one you can find in the shounen ai/yaoi genre. You wouldn't differenciate the characters if it weren't for their hair color. It's also full of yaoi anatomy examples, as expected from the author.   \\n\\n\r\nSound: 5\\n\r\nActually it's pretty average and the opening song is absolutely what you would expect from a shounen ai anime. Perfectly cheesy and cheerful. \\n\\n\r\nCharacters: 3\\n\r\nThe characters are flat and only consistent in their love interests. To be fair the side couples and characters aren't so bad, you could almost find an average romance story if you were to overlook the two (very annoying) main characters. \\n\\n\r\nEnjoyment: 8\\n\r\nAs I said, it is an absolute must-see for BL fans along with Sekaiichi Hatsukoi. Something to enjoy with your BL fan friends. \\n\\n\r\nOverall: 2\\n\r\nLet's face it, this anime and its spin offs are terrible but can be very enjoyable. I am torn between wishing nothing like that will spawn from Yaoi Hell ever again, and waiting for another gem like this one to land in our lives and cheer us up. \\n\\n\\n\\n\\n\\n",
            "date": "2015-05-12T12:19:00+00:00",
            "helpful_count": 34,
            "mal_id": 187674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4605884.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pastabeanchuu",
                "username": "Pastabeanchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=187674"
        },
        {
            "content": "A bloody brillant show. It was incredibly cute, with so many adorable moments I could've choked on the fluff. It was also very humorous, with some really random, hilarious moments, leaving me laughing out loud. All the characters personalities were incredible, and I loved all of them. It's rare for me to find a show where there's maybe only one person hate, so this show was really good in that sense. Each character is so different and unique, so everytime a new character was introduced it was refreshing. The plot itself wasn't one of the best, although it always managed to make me either cracka smile, or feel like crying. I recomend it any yaoi fans out there.",
            "date": "2008-07-23T22:32:00+00:00",
            "helpful_count": 21,
            "mal_id": 6541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Janks1415",
                "username": "Janks1415"
            },
            "url": "https://myanimelist.net/reviews.php?id=6541"
        },
        {
            "content": "This is my first review, so don't expect it to be perfect... It'll be short.\r\nI'm going to try to get through this review without fangirling, okay? Haha, kidding.\r\nI found this show randomly on RightStuf. the plot sounded pretty good, but I was a little hesitant at first, since it was a yaoi. I honestly expected it to be awful at first. I'm glad it played out the way it did.\r\nStory: 8/10\r\nThe plot of Junjou Romantica revolves around three gay couples going about their everyday lives. It's very simple, but can get confusing since it never focuses on just one couple. It's a character driven romance,so it gets pretty darn dramatic at times. However, this drama is sometimes overplayed and just feels forced.\\n\\n\r\nArt: 7/10\\n\\n\r\nThe art is average, typical of a yaoi. The animation is alright for a romance anime. However, what really turns me off is the character design. They all look the same. I don't necessarily mean the color of the eyes and hair, but they're the same height and the hair is drawn the same. It's confusing at times.\\n\\n\r\nSound: 8/10\\n\\n\r\nSound is also average. The opening and ending themes were good enough to get stuck in my head, and the seiyuu fit well with their characters. The background music was also very nice, and always fit the situation.\\n\\n\r\nCharacter: 9/10\\n\\n\r\nThis show is very character driven. The characters are well rounded and all enjoyable to watch. The minute you meet the couples, you know who's on the top and who's on the bottom. Maybe it's just me, but they seem more human than other characters in anime.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThis show is a fangirl's dream. Being a fangirl and yaoi lover, this show has been like crack to me. It's just that entertaining.\\n\\n\r\nOverall: 9/10\\n\\n\r\nThis anime is a wonderful addition to any anime lovers collection, whether they be man, woman, bi, or straight. It's fun to watch and the characters are enjoyable. I suggest to anyone reading this review go check it out on any anime streaming site, and buy the DVD releases on RightStuf.\\n\\n\r\nSorry, this review was really, really short. I hope this was helpful to someone! :)",
            "date": "2013-11-17T10:31:00+00:00",
            "helpful_count": 19,
            "mal_id": 120601,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3342979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nazunya",
                "username": "nazunya"
            },
            "url": "https://myanimelist.net/reviews.php?id=120601"
        },
        {
            "content": "Since you already have the summary above I'll just jump into my review :)\r\nStory:\r\nWhile I was watching this, I began to wonder how long had it been since I'd gotten so enchanted by a particular story in an anime. So much that watching it put me on the edge of my seat and had me deeply concerned over the fate of the characters. Well Junjou Romantica did all that and more, it left me breathless, and my heart over flowing with joy. The story is absolutely class A work, it doesn't focus on just the sexual relationship the characters have, it actually gives us abeautiful window of how love works in a gay relationship. The uncertainties, the worries, and shows us that their not so different from the relationships of heterosexuals. It goes day to day and gives us a brief yet powerful glimpse at what it means to love, not just because of gender or age, but because we are ultimately draw to that person and how we just cannot help ourselves. It's heartwarming and exciting, a breath of fresh air.\\n\\n\\n\r\nArt:\\n\r\nI have to admit, the only reason I noticed this (out of a literal sea of Yaoi animes) was the beautiful art. I admire how the artist keeps the obvious male qualities and doesn't over feminize the \"uke\" of the relationship but you're constantly aware that their both male, and it leaves little question about it. I must admit, the scenery was beautiful in this particular anime as well. I have to also so that their expression were so full of emotion that you nearly felt like you knew exactly what they were feeling even if they said nothing at all. You could feel the love and affection, and somehow words weren't needed to see it very clearly. Beautiful job on the art!\\n\\n\\n\r\nSound:\\n\r\nI didn't wanna look like too much of a fangirl so I decided to down grade the sound to a 9. I won't lie, the background music was gentle, not overpowering like in some animes, it was perfect for setting the mood. The opening and ending were rather fun too, and it seemed to fit the anime so well it was hard to argue they did a good job choosing the opening and ending for this anime. I think I gave it a nine soully based on the fact that I didn't wanna give it a perfect 10, i'm such a douch but it was still a beautiful soundtrack and I'm definitely considering purchasing the OST's!\\n\\n\\n\r\nCharacter(s):\\n\r\nI have to say first and foremost all of the characters were beautifully done, not just artistically but also personally. You see the personal growth in all the characters and how each hardship just brings them closer together, and even makes them more open and honest with the person that they truly love. You get a feeling for each character and somewhere along the line you start screaming \"SAY IT!\" like a fool. They draw you in, and before you know it you really start to feel like you know them in some strange way, like they were truly real. The characters really were amazing in this anime, I have to say I'd give them all a perfect 10.\\n\\n\\n\r\nEnjoyment:\\n\r\nI haven't enjoyed an anime this much since Ouran High School Host Club, and I haven't watched that anime in over 2 1/2 years. Sure I've watched some good anime but to truely enjoy an anime this much is rare for me. I'm glad I found it, the writer did an amazing job, though some things were lacking but they were scarcely noticeable. I just can't explain how much I enjoyed this anime without writing a novel about it. Lol!\\n\\n\\n\r\nOverall:\\n\r\n10/10 what can I say? The only flaw I had through the anime was the fact that there wasn't alot of \"lovey-dovey\" stuff going on, but I suppose that's how it is in sometimes when both partners are working. It can be abit frustrating but if you like yaoi and a good love story, watch this. It definitely is a crowd pleaser, and even if you're not so keen on it, I doubt you'll end up hating it at the very least.",
            "date": "2010-08-21T22:28:00+00:00",
            "helpful_count": 17,
            "mal_id": 29857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/346026.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rojocharmander",
                "username": "rojocharmander"
            },
            "url": "https://myanimelist.net/reviews.php?id=29857"
        },
        {
            "content": "Well this is my first review and I hope someone finds it helpful. \r\nThe Story:\r\nJunjou Romantica was an incredible yaoi themed anime. It created a story of not just high school romance but adults after school. However the storyline from there is at the best basic. Out of the three storylines written into the overall story only the main story develops. The two basic characters Misaki and Akihiko are two lovers who conquer all expectations of both of them and continue to be together. The end of the plot. Yes there are hardships for the two but the ideas are unrealistic and could cause confusionto people  who are straight looking into a gay themed romance. Basically it does not show the hard ships that are often confronted in the everyday life. The other two stories are about the same way. Only with different aged people. I enjoyed the anime but I fel it was more because of funny plots intermingled and the stereotypical ideals. \\n\\n\r\nThe Art:\\n\r\nIn this catagory I have to say I thought the animation was great. The artwork was different and switched often throughout the anime from chibi mode to the real perspective. I however prefer artwork that is the typical big dramatic eyes than that of a more realistic piece. \\n\\n\r\nThe Sound:\\n\r\nThe voice over actors did a wonderful job to me when portraying the characters. The only exception is the introduction of english into the japanese show. It pains me to hear the really bad english that the actors use. Other than that it was wonderful. The themesong \"Himi Kana\" by pigstar is great and I fell in love with it the first time I heard it. \\n\\n\r\nThe Characters:\\n\r\nThe characters have unique attributes to each of their personalities. Though the idea of them knowing each other without really knowing each other was kind of odd. I think that they could have had a better way of combining the stories but that is my own opinion. I loved each of the characters strange personalities and could be why I enjoyed the anime as much as I did. \\n\\n\r\nEnjoyment:\\n\r\nEven with the awkward storyline of the neverending parade of triumphs over expectations I have to say I really enjoyed it. The characters plus the audio and visual perspectives captivated me. I felt like I needed to see the next one just to see the characters interactions. The hilarious comments and expressions kept me coming back for more.\\n\\n\r\nWith that I have to say overall the experience was very good and I may even watch the anime again.",
            "date": "2009-08-16T09:18:00+00:00",
            "helpful_count": 13,
            "mal_id": 17800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ellenore_shade",
                "username": "Ellenore_shade"
            },
            "url": "https://myanimelist.net/reviews.php?id=17800"
        },
        {
            "content": "Let's start this off with overall Junjou Romantica was a very good anime. The story was intresting enough to keep you watching, with a few slower parts. Though it did leave me with a feeling of just watching a chick flick. It was diffinitaly full of drama.\r\nSome of the characters were deep, others not so much. The animimation of them were done well, and the voices matched the characters. But there were times when the words didn't match the mouths moving. And the timing was off by a noticeable amount.\r\nI'd suggest this anime if your in the mood for drama an romance. Junjou Romantica isfilled with that, but it also has some comedy and fluff. Even if some of the plot seems like it has been done in quite a lot of movies, this is still a good watch.",
            "date": "2010-04-18T17:42:00+00:00",
            "helpful_count": 13,
            "mal_id": 25195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291030.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BrynjaBloodmire",
                "username": "BrynjaBloodmire"
            },
            "url": "https://myanimelist.net/reviews.php?id=25195"
        },
        {
            "content": "The only reason this even has a 2/10 rating is because I enjoyed Nowaki and Hiroki's narrative—1 point for each character.\r\nUsami is a romanticized rapist and manipulator—there's no other way to spin his character. He was very manipulative and predatory and it was just really distasteful. There was nothing likable about him. I really did enjoy Nowaki's and Hiro's stories however. Had the story only been about the two of them, Junjou Romantica would have received a 8/10 rating from me. But it wasn't so I decided to drop it. I just can't support a series that tries to make rape and abuse a normalthing. It happens in real life; I don't need to see it in fantasies too.",
            "date": "2016-07-05T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 223245,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288680.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/juneboba",
                "username": "juneboba"
            },
            "url": "https://myanimelist.net/reviews.php?id=223245"
        },
        {
            "content": "Story 9/10\r\nJunjou Romantica is one of my favourite BL stories of all times. It is not a \"yaoi\" story that is filled with pointless sex scenes. In fact, there is no explicit sex shown in the anime at all. Any sex is mostly short and glossed over, and used to add to the mood of the story. \r\nThe story deals with 3 couples that are semi- interconnected (while living their own lives). These 3 couples have very similar romances and faces similar problems, but each one deals with them differently. The focus of the story is mostly dealing with the character's personal feelings and thoughts,and how they deal with the problems they face in their romance. It's filled with inner thoughts, so there's quite a lot of monologue. \\n\\n\r\nI find that this story deals relatively well with the implications of what do you do when you just happened to fall in love with someone of the same gender.  It's not about gay men per se, but about men who just happened to fall in love with another guy and then having to live with the consequences. Especially in the case of Misaki and Miyag-sensei, they had problems accepting the affections and romantic advances from another guy. Through the story, they had to think it out for themselves and eventually accept their own feelings for another guy. In this sense, it is quite a serious story. However, the day to day events of the story are quite comical. \\n\\n\r\nAnother issue the story dealt with is the age gap. In the 3 couples, the age gaps are 4 years, 10 years, and 17 years. Each one shares different problems, whether it is social pressure, or wanting to be worthy of the one you love, not wanting to lose them to the age difference etc. There's also other social problems involved such as teacher-student or in one case, the younger brother of his ex-wife. The point I wanted to make is that the story focuses on how the characters think about their situation, and how to deal with their feelings and the problems, instead of just about men having sex.\\n\\n\r\nArt 8/10\\n\r\nThe art style is slightly different from the manga, but still quite similar. I think that there is a good balance between masculine and feminine features in the characters. Except in the case of Misaki and Shinobu, where they are somewhat feminine looking (because they are supposed to be younger), all the other men are very masculine without being too masculine. What this achieves is that it avoids the BL cliche that the uke basically looks like a pretty girl. While I don't mind art features metro pretty boys, it is refreshing to watch BL about men who look like men. Very clean and clear animation.\\n\\n\r\nSound 10/10\\n\r\nI personally fell that the background music tracts did a great job to fit the mood and events of the story. There was several times that I thought \"hey, that music's really good\". \\n\\n\r\nCharacter 9/10\\n\r\nAs mentioned earlier regarding the story, Junjou romantica focuses on the character's inner turmoil and thoughts, which means we really get to see the inner workings of the character's minds. While the story is a bit cliche (their thoughts are mostly predictable), but that is the point of romances. Cliche romances are loved by many (including me ^^).\\n\\n\r\nEnjoyment and Overall 10/10\\n\r\nWhat's best about the anime is the blend of everything together, the serious issues that the character deals with but with very good comedy moments. Together, it makes the show very enjoyable to watch. \\n\\n\r\nNow to address the problems with the anime: it was too loud. There was just too much yelling. In each of the 3 relationships, there is one \"quiet\" one and one \"loud\" one. The loud one gets flustered easily and yells WAY too much, and sometimes it really gave me a headache. While reading the manga, you don't have this problem, but I really disliked parts of the anime because of that. The uke also cry a lot in addition to yelling, which can get annoying.\\n\\n\r\nAlso, while each story is different from the others, they all share some similarities in the character stereotyping - strong, quiet seme with loud flustered uke. Junjou Romantica does follow very cliche BL character types (though its not just BL, many romance genres all follow this kind of cliche with a strong and a weaker character in a relationship). \\n\\n\r\nAnother \"failing\" is that while it deals with some serious issues, it never really deals with the issue. Since it focuses on the characters themselves and their thoughts, it doesn't tell us anything about the external world that they live in. You're following the first person POV of the main character basically, which means there is very limited knowledge of the world outside his inner thoughts I put \"failings\" in quotes because this is not really a problem, because overall its a comedy, not some deep soul-searching social commentary. It may be interesting to know more about the rest of the world that the story is set in, but it doesn't make the story bad in any sense. In a way you can interpret it as that the characters live in their own little romance world without care for the rest of the world (which is somewhat true, they worry about it but it's a fleeting worry. One of those Love can conquer all type of story). However, I do feel that the romance may be doomed to fail in the future because of the social problems they face. As a romance comedy, it doesn't take serious problems as seriously as it should. For example, there is very little chance that people would accept a relationship between a professor and a high school student if they wanted to take the relationship public. \\n\\n\r\nIf you are a fan of cliche romances (whether gay or straight), then you will enjoy this. If you don't, then this may not be the best. Definitely, you will have to have an open mind towards BL to really watch the show. I don't think this is a story only for the fangirls (it's focused on romance between two guys, not just some gay porn without plot), I do believe someone who is neutral towards BL may also enjoy it purely for the entertainment value of the story. If you dislike male on male relationships, then you shouldn't be watching BL at all. If you're interested in finding a good romance story staring males, then this is for you.",
            "date": "2011-01-13T23:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 33739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KuraKaze",
                "username": "KuraKaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33739"
        },
        {
            "content": "So this is my fourth yaoi, but first one where it is an actual story with more than two episodes. I would have rated it a ten, but I did not care for the third couple in the terrorist arc. It, to me, was no different than a little girl having a crush on her teacher. This boy, I'm sure he had feelings for him for a long time, but to just up and chase him the way he did. Ugh! He just came off as confused and desperate to me. I didn't like that couple.\r\nBut the other two I love! I like that Misakiand Usagi got as many episode as they did because that couple was my number one favorite. It had more elements and more of a plot than than Hiroki and Nowaki.\\n\\n\r\nI do kind of wish Misaki's brother was used more in the story, but I'm pretty sure in one episode they said he was dense so I guess he was used as much as a dense person could be used, or maybe he just didn't want to force his brother to come with him back home.",
            "date": "2013-09-01T08:24:00+00:00",
            "helpful_count": 11,
            "mal_id": 111831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182527.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hachiko75",
                "username": "Hachiko75"
            },
            "url": "https://myanimelist.net/reviews.php?id=111831"
        },
        {
            "content": "Junjo Romantica is a great yaoi anime, I say yaoi anime on purpose. As an anime, it's so-so I guess, but I'm a huge yaoi-fan and I loves this anime. It's one of the cutest shows I've ever seen.\r\nlet's discuss it:\r\nStory: 7/10\r\nWell, the story isn't that great, I admit. It's pretty obvious what will happen and it's not really progressing. You're just following three couples and how they are changing in the relationship, overcoming obstacles and sometimes becoming the obstacles themselves. \r\nThe main couple is Misaki/Usami, \"side couples\" are Hiroki/Nowaki and Miyagi/Shinobu. I liked that they all sort of know each other (except Shinobu).\r\nThe reasonwhy I rated the story 7 is because it's slooooow, especially how Misaki is unable to say \"I love you\" which goes on like 5 episodes. But, if you're a yaoi-fan like me, you won't find it disturbing.\\n\\n\r\nArt: 7/10\\n\r\nI liked the art, maybe it's a bit angular, but it fits the story. It's not amazing artwork, but it doesn't need amazing artwork. The soft pastel-colors fit the yaoi-genre and the cuteness.\\n\\n\r\nSound: 9/10\\n\r\nGreat voice actors! I think that's quite important. A voice actors can make or break the character. Takahiro Sakurai as Misaki is doing an amazing job, as always. The music didn't really caught my attention, although the opening and ending are nice.\\n\\n\r\nCharacter: 9/10\\n\r\nI think this anime really depends on the characters and not on the story. The \"ukes\" are developing in the relationship, Misaki doesn't want to be a burden to anyone, Hiroki has had missed chances with Usami, Miyagi has a dead (female) lover. But they all bloom in their relationships and it's nice to see them trying to overcome their flaws for their lovers. \\n\\n\r\nEnjoyment: 10/10\\n\r\nBecause it's the best yaoi-anime I've seen and I cried every episode.\\n\\n\r\nOverall: 8/10\\n\r\nIt's an awesome anime for yaoi-lovers!",
            "date": "2010-08-09T03:14:00+00:00",
            "helpful_count": 10,
            "mal_id": 29450,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179509.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Winterwolkje",
                "username": "Winterwolkje"
            },
            "url": "https://myanimelist.net/reviews.php?id=29450"
        },
        {
            "content": "This is one of the best anime I've ever seen in the BL/yaoicategory. It made me burst of with laughing from the hilarious moments, almost crying from the sad moments and smiling from the sweetness.\r\nThe story is not good, but that doesn't matter to me since I enjoyed this series so much anyway.\r\nI think the voices could be better, some of the voices just don't fit the characters. I had to be used to the opening to like it but I don't really like the ending, so that could be better to me (although this part depends on ones taste).\r\nOtherwise this is a masterpriece tome, and the art is amazing! It's very well done like the manga it's based on.\\n\r\nThe characters are great! Some of them are ordinary characters but developed in a way that makes them unique.\\n\r\nI really recommend this to BL/yaoifans! Have a good time watching!",
            "date": "2008-07-24T05:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 6547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12130.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MissOffline",
                "username": "MissOffline"
            },
            "url": "https://myanimelist.net/reviews.php?id=6547"
        },
        {
            "content": "This year for our Valentine's week romance review, we're looking at Junjou Romantica. This one is based off of the best known work of Nakamura Shungiku. The  manga has been going since late 2003. The anime, at least the first series of it, aired in 2008. And that was brought to us by Studio Deen. Yes, the same studio that brought us Gravitation, Twilight Q, & Shouwa Genroku Rakugo Shinju. I have a feeling one of those is going to bear far  more similarities to this than the others. But maybe I'm just making assumptions based on the genre overlap. Is this oneas good as Gravitation was? Let's take a look at  the first series and see. \\n\\n\\n\r\nStory:\\n\\n\r\nWe start out with Misaki, our protagonist, trying to get into a good university. There's just one problem. His test scores are pretty bad. In order to better prepare for the entrance exams he enlists the aid of his older brother's friend who also happens to be a famous author. This is Usami, also called Usagi-san. But things quickly take a strange turn when Usami immediately molests Misaki. We then go through a harrowing narrative as Misaki struggles to cope with the violation and whether or not to involve law enforcement. Or, maybe that's just the start of a romance. It's one of those, and not the one that makes more sense. \\n\\n\r\nTherein lies the fundamental flaw with Junjou Romantica. The main romance is completely fucked up. Usami straight up sexually assaults Misaki a lot. With dialogue from Misaki to the effect of “Stop. Let go. Get off of me.” and yet we're supposed to buy into the idea that this is a good romantic relationship and not a serial rapist who's chosen a younger victim who happens to be in his power. But it's actually totally the latter and they never acknowledge the severe problems with it. Give a series like Love Stage some credit, at least when it uncomfortably started with an attempted sexual assault they put some effort into showing redemption and repentance on the part of the guilty party. There's also a secondary romance between a university professor and a high school boy who wants to go to the university he teaches at. I foresee no ethical problems with that whatsoever. Frankly, both of these romances are super unhealthy & really uncomfortable to watch. Which also adversely affects the attempts at comedy. Because you aren't getting legitimately funny scenes in a series with an uncomfortable, rapey atmosphere. \\n\\n\r\nThe one area where I'll give the series some credit is that the relationship betwixt  Hiroki & Nowaki generally does work. They demonstrate respect for one another's boundaries, which should go without saying but, in this series, is unique. They also have some compelling relationship issues that do speak to the kinds of real problems that healthy couples face. Like a lack of communication or jealousy. \\n\\n\r\nCharacters:\\n\\n\r\nThe characters could almost be pretty typical. Usami is the talented rich boy who has a childish side into adulthood, with a side of being a rapist. Misaki is the youngster with a lot of potential who's uncertain about himself but will do anything for the one they love. Or, in this case, the one he's got Stockholm syndrome for. Ultimately, that makes them worse than generic. Because this series is grotty. \\n\\n\r\nLike with the romance in general, the only characters who somewhat redeem the series are Hiroki & Nowaki. Since the problems they deal with are pretty legitimate and they handle their situations in a somewhat realistic fashion. \\n\\n\r\nArt: \\n\\n\r\nIn terms of artwork, there are some nice backgrounds. The character designs look decent enough. The comedic art shift that you get when the series thinks it's pulled away from the uncomfortable romance aspects enough to go for a joke look pretty bad and they're kind of over done in terms of how frequently it happens. \\n\\n\r\nSound: \\n\\n\r\nThey did get some very talented actors for this. Including our old friend, Sakurai Takahiro. There's also Itou Kentarou, Canna Nobutoshi & Kishio Daisuke to name a few. That being said, these aren't their best performances. A lot of it boils down to them having reactions that are really downplayed because “this is a romance. So, your “no, stop” needs to be a soft protest.” It's almost like that element singularly damages virtually every facet of the series. That's also why Itou & Canna give, by a good margin, the best performances in the series. Since their characters are allowed to react to their situation in a way that isn't totally stilted. The music is by MOKA, the same music unit that brought us Elfen  Lied's  average music. This is slightly better than that. It's okay. \\n\\n\r\nHo-yay:\\n\\n\r\nWell, we have three main couples, all of which are gay. Our main couple is really rapey and repulsive. One of our secondary couples is exceedingly unethical excrement. That leaves the Hiroki/ Nowaki couple. Which, to be honest, isn't worth sitting through the rest of this for. They have some cute moments and if they were in a series by themselves I'd probably be pretty fond of it. Overall, though, this is not a series with a healthy concept of what a romantic relationship between men looks like. You'd be better off with Gravitation or Gakuen Heaven. Even something with a gay couple on the side like Gundam Wing or Voyages of the Cerberus (I know, shameless self plug) would be better if decently handled. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nIt's probably pretty plain to see that I did not care for this series. Part of the problem is that it paints sexual assault as an ordinary part of romance. Part of the problem is that it portrays itself as a “pure” romance series while having that kind of shite as a staple. Ultimately, it's pretty bad and I really don't recommend it unless you have a fetish for gay rape. Which I won't judge you for but I may slowly back away from you and only ever be around you in bright, crowded areas. The one redeeming factor is the Hiroki/ Nowaki romance, which is, unfortunately, not the focus. So, the final rating is going to stand at a 3/10. Next week I'll look at A-Ko the Versus.",
            "date": "2018-02-15T12:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 271573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=271573"
        },
        {
            "content": "This anime sucked balls.\r\nThere is, for some reason, an abundance of female characters throughout the story. Everything is repetitive. I now wonder after watching this series, how I managed to cope with this. Every fucking gay man has a triangular face, the love interests i.e Misaki or whatever, looks like a five year old idiot who kept whining and complaining. Like, dude. If someone is assaulting or raping you, you need to kick them in the balls, punch their face and go home to tell your brother to break his friendship with him and report against him for sexual assault.\r\nBut, instead, he stayed with thedouche bag and eventually fell in love with him. After two major headaches and ten episodes later, they're still not an item. Like what the f dude? \\n\\n\r\nTHIS ANIME MADE NO SENSE, WHATSOEVER.",
            "date": "2017-08-02T07:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 254495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6253228.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/melodyvonshewk",
                "username": "melodyvonshewk"
            },
            "url": "https://myanimelist.net/reviews.php?id=254495"
        }
    ],
    [
        {
            "content": "I just finished watching this.. literally. I had to review it before I watch the second half (Season 2) so I can separate it at least for you guys.\r\nThis is my second BL anime - Sekaiichi Hatsukoi being the first. For a sense of similarity I wasn't bored or disappointed at all. There are a lot of people who compare this to SH and with good reason - it's practically the same. BUT what you are watching is not just the same story with different characters, they are separate in their own right and the back lay for settings and themes is totally different. \r\nI'llkeep this short considering there isn't much to say. One focus story - two main stories (3 stories total) which all contain at least one acquaintance of another story. In other words - the whole anime flows and doesn't contain pointless side stories that have no relation whatsoever to the MS. Five points I need to make clear:\\n\\n\r\n1. The men are men. They act like men. They talk like men. MEN.\\n\\n\r\n2. It is not an anime purely for girls nor is it an uncomfortable anime, those thoughts need to be eradicated right now. \\n\\n\r\n3. There is more romance in this than you will ever find in a mainstream/more popular anime.\\n\\n\r\n4. The messages are a bit more deeper than \"sex in the library will solve any relationship problems\" and if you can't handle that then stay off the judgmental ship.\\n\\n\r\n5. You WILL enjoy this if you give it a try! There is just the right amount of Drama, Comedy and Slice of Life for everyone to enjoy.\\n\\n\r\nIf you have seen Sekaiichi Hatsukoi and enjoyed it, then you will like this and if you haven't then there's the next anime for you to watch.\\n\\n\\n",
            "date": "2015-04-29T20:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 186800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Utsusemi1",
                "username": "Utsusemi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=186800"
        },
        {
            "content": "How the hell did I get wrapped up in Junjou Romantica? I will never really know. But one way or another, this series managed to gain my interest\r\nI started watching Junjou at the very beginning of the year. It was actually my very first (and so far only) shonene ai* series. I'll admit, however, that this was not a very good series to start with because...well...err...there was sex in nearly every episode. (not graphic, mostly implied) However, once I got used to those scenes, I was able to enjoy this series through all of its ups and downs.\r\nThere's not really a main story for Junjou.The series centers around three odd gay couples and their relationships. The main couple is Misaki and Usami. Misaki is the little brother of Takahiro, a man Usami was madly in love with. When Takahiro gets engaged, it almost seems as though Misaki has become his replacement. Despite his internal struggle, he can't seem to deny the fact that he just might be falling under the seductive Usami's spell.\\n\\n\r\nHiroki has been in love with Usami for several years. Apon discovering that Usami will never feel the same way, heartbroken Hiroki runs to the park to be alone. There, he meets Nowaki, a kind young man who has fallen for Hiroki at first sight. Hiroki tries to remain cool and nonchalant, as he usually is, but something in Nowaki brings out a side of Hiroki that he doesn't recognize, and certainly doesn't like.\\n\\n\r\n35 year old Miyagi is Hiroki's coworker. He is recently divorced, and is going through a lot in his life. Things get much more complicated when his ex-wife's brother, 16 year old Shinobu, (umm big age difference much?) claims to be madly in love with him, and ends up living with him in his apartment.\\n\\n\r\nSo what's so special about these stories? To be honest, not very much. Every episode seemed to be basicly the same thing. There wasn't really anything original; anything we hadn't seen before. However, the way the stories are delivered somehow pulls you in. You don't really think about the lack of originality while you're watching Junjou Romantica. I give this series major props for so cleverly hiding these uninteresting storylines behind amazing delivery.\\n\\n\r\nI felt like Hiroki, Nowaki, and Miyagi were the only three characters with any real depth. The rest of the cast, though entertaining, seemed rather generic and flat. Usagi was the steryotypical seme, Misaki, the classic uke*, and Shinobu...some kid trying to force himself onto a middle aged man. It's not that I really disliked any of the characters in this series--they were all very diverse and interesting--I just wish I had gotten to know them a little better. In the course of 26 episodes, (2 seasons, 13 episodes per season) I think they could have done much better.\\n\\n\r\nThe art was probably the weakest part of the series. I can honestly say nothing good about the art style. I constantly found myself confusing characters with other characters. There were literally only 3 hairstyles for male characters in this series, and 2 hairstyles for female characters. It felt like they picked a few hairstyles and faces, and tried some different combinations to come up with their characters. I know, it could be a lot worse, but the art was still pretty lame.\\n\\n\r\nNow about the sexual content...like I said, it's mostly implied. You only see faces, hands, and sometimes upper bodies. The sex scenes in Junjou Romantica were actually very tasteful. You don't really see \"sex\" here. You see two men in love giving themselves to each other. The only problem I had with the sex scenes was that, although they were pretty at first, they got old very quickly. The sex was just excessive. As I said, they put one at the end of nearly every episode. Had they put only one every five or so episodes, it would have been easier to appreciate the beauty of these scenes.\\n\\n\r\nSo why did I like Junjou Romantica? Because, despite its many flaws, it has been the most passionate shonen ai series I have seen to date. I've realized that the reason I haven't had the desire to continue any of the other shonen ai series I have tried is because, on episode one, I always find myself thinking \"Junjou Romantica was much better.\" This series made me love it for reasons I myself don't even quite understand.",
            "date": "2011-01-07T07:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 33539,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229998.jpg",
                "scores": {
                    "animation": 2,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/manami-chan669",
                "username": "manami-chan669"
            },
            "url": "https://myanimelist.net/reviews.php?id=33539"
        },
        {
            "content": "Alright, before some yaoi fangirl strangles me to death for writing this review, first listen to the reasons.\r\njunjou romantica is an extremely popular anime in the shounen-ai genre. However, it isn't as good as you might think.\r\nThe art is crappy, the characters are very sappy and romancy (in other words, they make you wanna puke.) Please note, the review up till now is spoiler free but i'm getting in to detail below. Not many spoilers are mentioned though.\r\n**SPOILER WARNING**\r\nThe relationship between characters is given below:\r\n1) Misaki and Usami:\r\nMisaki and Usami's relationship could've been better. If they had not included the whopping ten-year age gap, andnot included various 'rape' elements. When Misaki first meets Usami, he gets sexually abused by him, for waking him up from his sleep when he TRIES to confront him about why he writes about sex between both of them.\\n\\n\r\nWhat the actual crap.\\n\\n\r\nCHARACTER OF MISAKI:\\n\r\nMisaki is a very stupid character, in general. He lives with Usami after his brother moves away and often has sex with him. Literally every episode has steamy sex in it. NO story development, nothing. What ticks me off, is that once he bangs him, he's like 'I don't wanna do it' and then after two seconds changes his mind. What's more? he is very stupid and often doe the most cliche things ever. Like go on a friendly 'date' with someone knowing that Usami is going friggin jealous.\\n\\n\r\nI actually don't know why I saw this anime. For BL fans this might be a gem, but for me? well it's stupid AF",
            "date": "2017-06-22T11:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 250676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6285839.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Evelyn_stone",
                "username": "Evelyn_stone"
            },
            "url": "https://myanimelist.net/reviews.php?id=250676"
        },
        {
            "content": "This anime has me conflicted. As a fanfiction writer and a girl who lives on tumblr and thrives off of shipping, this is first class 100% yaoi with probably some of the best not straight up smut that the BL market has to offer. Looking at it through those eyes, this is somewhat of a BL classic if I'm being honest. But looking at it through the eyes of a literature and anime enthusiast who loves well-written shows, this is kinda a steaming pile of shit that perpetuates some very dangerous stereotypes and promotes rape culture and heteronormative fetishizations of gay men. Thus, I'm reallyconflicted about this. \\n\\n\r\nTo begin with, the story is not that good. There are three very loosely connected storylines-- while I call it a 'storyline', there is hardly any real plot. It's just loose events that are barely connected at all to lead up to the smutty scenes-- that's pretty much all it is. If you're into yaoi smut, then this is a great choice-- however, if you're looking for a real romance anime, this isn't the place you want to be. \\n\\n\r\nAs for the art, I can say that it leaves a lot to be desired. In a lot of places it's very sloppy and awkward looking, to the point where these characters barely even look human. The colors are dull, the backgrounds are half-assed, and no real effort is made. You can take one look at the characters and tell who's supposed to be the seme and the uke. \\n\\n\r\nThe voice actors did a decent job. I had a problem with the background music especially. While it was done well during more heated scenes (I personally liked the romantic saucy music), at other times, they really made what was basically rape seem comical with the background music, which I really didn't like. The OP was pretty much to listen to, but the closing was so boring that I could barely get through it once. \\n\\n\r\nAs for the characters, I have a lot of problems with them. The only couple I could see even possibly being in a healthy relationship is Hiro and Nowaki. With their backstory and the healthier dynamics of their relationship (despite the massive lack of communication) I can see that being a possibly normal relationship. On the other hand, the other two couples displayed a lot of rape and sexual assault scenarios, along with the power dynamics of the bedroom leaking into their normal lives. The worst in this aspect was the main couple, Misaki and Akihiko. Misaki's nonconsent is verbal and physical, yet Akihiko continues like nothing is wrong at all. In the end, it's kinda a rape scenario. \\n\\n\r\nOverall, I hate myself for enjoying this. There is no other way to put it. This show perpetuates the seme and uke stereotypes-- the idea that there's always a submissive, feminine partner in a gay relationship, and a forceful, masculine partner. As a straight woman myself, this is catered directly towards me-- two men, both of which are reasonably attractive, engaging in a dynamic that's usually meant for me to be on the receiving end. Somehow, it's nice not to have to worry about the woman in the relationship (which I personally always do when it's a romance anime). On the other hand, the more humane and less primal side of myself sees that the complete and utter domination and submission dynamics going on are unhealthy and abusive... yet I can't stop watching because there's a part of me that likes watching it. \\n\\n\r\nIf you can't tell by my scores, I'm awfully conflicted and I honestly can't decide how I proceed with this. I'm honestly disgusted with myself but I can't stay away from this show either. If you feel in a similar way about this kind of subject material, you might enjoy this to an extent like I did. \\n\\n\r\nI would recommend this if you: like BL (this is ultimate BL), like submissive/dominant roles, like the seme/uke stereotype, like 'jealousy' and possessiveness, get bored when an entire show is about only one couple \\n\\n\r\nI would NOT recommend this if you: like realistic representations of gay men, do not like fetishizations of homosexuality, don't like hetero-normative gay anime, don't like the idea of sub/dom, like character development and plot, are touchy about clear verbal consent, the idea of technical sexual assault really bothers you\\n\\n\r\nHave a great day everyone! :)",
            "date": "2018-07-17T09:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 284166,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=284166"
        },
        {
            "content": "I am a newcomer to this sort of genre but it has actually been quite an enjoyable and educational experience for me.\r\nStory - 8\r\nThe story surrounds 1 main gay couple and 2 other gay couples, how they met and how they try to maintain or deepen their relationship. There are a few intimate scenes straight on in the first couple of episodes (nothing too revealing but still intimate), which at first for me was a little hard to watch. However, after seeing the characters take on the challenges of maintaining a \"taboo' relationship (age difference, jealousy, loss, misunderstandings), you really understand how much the charactersreally care and love each other. So after a while, the intimate scenes become a natural representation of love, which after a few episodes became quite enjoyable to watch. In some ways, gay relationships are more interesting than straight, as there are many more challenges to overcome such as dealing with social norms etc. The plot is not crazy or packed full of action, but conveys meaningful teachings about love. There are also loads of funny moments throughout as well so look forward to those:)\\n\\n\r\nArt - 8\\n\r\nThe art is not crazily amazing, but I absolutely love all the chibi drawings during the funny moments, definitely balances out the more deeper and serious moments. Intimate scenes are drawn with discretion and care, so nothing too revealing. The art style suits this genre.\\n\\n\r\nSound - 7\\n\r\nIntro and ending themes are pretty good. Background music are constantly appropriate throughout. \\n\\n\r\nCharacters - 9\\n\r\nAll the characters, although not too out of the ordinary, do seriously care for their partner, and you see that constantly throughout, thus making them quite memorable. They also have little quirks about them that makes them really funny and peculiar at times. (If you like teddy bears, this is the anime for you!)\\n\\n\r\nOverall - 8\\n\r\nTook me only 3 days to finish it. I recommend this to everyone, even if you are new to this kind of anime, it is quite deep and does make me understand a little bit more about gay relationships. Please give it a go ! :D",
            "date": "2015-04-11T18:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 185414,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4548661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagicPotato98",
                "username": "MagicPotato98"
            },
            "url": "https://myanimelist.net/reviews.php?id=185414"
        },
        {
            "content": "For whom it may concern...\r\nThe story has three arches, each focusing on one couple. Two of these, romanitca and terrorist, romanticize pedophilia and unhealthy relationship dynamics. They feature statutory rape while the other characters in the story acknowledge the underage status of the victims, and they also feature full-on rape with the victims repeated telling the older person to cease.\r\nIn both cases, the older person is in a position of trust. In romantica, he was a tutor, and in egoist he was previously related to him as well as nearly twice as old. Egoist is particularly heinous with the adult doing nothing but taking advantageof someone who is twice his junior and raping him on more than one occasion. He mocks him based on how he's sexually inexperienced, and yet somehow cannot feel pity for anyone but himself when he becomes obsessed with him. In romantica, it romanticizes how it's okay to keep pushing someone even if they tell you to stop, because they know those aren't their //true// intentions.\\n\\n\r\nThe second story arch in the middle of the anime, egoist, contains two adults and is overall a great improvement over the other two. However, it is still somewhat unhealthy based on something which happens later on. Had the anime focused on this relationship I would be more than willing to recommend it to others.\\n\\n\r\nThough I am not a victim of abuse or anything else mentioned above, I am underaged and watching how the story romanticized adults taking advantage of underage people made me very uncomfortable.",
            "date": "2016-01-05T15:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 207829,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5096955.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/apollos",
                "username": "apollos"
            },
            "url": "https://myanimelist.net/reviews.php?id=207829"
        },
        {
            "content": "This is a totally guilty pleasure for any Western fan with the slightest concept of \"consensual sex\", because it is a prime example of what sort of stuff passes for successful relationships in BL land.  I have to constantly remind myself that as a gay man I am not the target audience here, but that this functions as self-insert fantasy for Japanese women, and actually fulfills a useful role in having them play with gender and sexuality.  The characters are not gay men, and they are not meant to be.  This isn't a part of the \"rape culture\" (which is indeed areal thing and a serious thing), but rather it's an example of nonconsensual fantasy.  We don't get to see that in the West in mainstream entertainment, except badly done in porn, but it exists here too in niche genre markets because it fills a need for some people.\\n\\n\r\nWhen ranked against good non-BL anime, this is really terrible.  But among other BL anime, this is a fun romp because it never takes itself too seriously.  There are sex scenes here, but nothing at all graphic, and it's mostly the voices that make a scene sexy.  Seriously, the drama CDs are hotter.\\n\\n\r\nStory (5/10):  There isn't really one; it's more a slice of life thing, though each relationship depicted makes some slight progress during its arc.  There are 3 couples, A =Usami Akihiko x Takahashi Misaki (famous literary author who also moonlights as a BL mangaka and his pupil / boarder who so happens to be the younger brother of Usami's unrequited love), B = Kusama Nowaki x Kamijou Hiroki (medical student and college professor who was previously in love with Usami), C = Miyagi You x Takatsuki Shinobu (college professor in the same department as Kamijou, and high schooler who is Miyagi'sex-wife's brother).  With all three couples there is an age difference, which is most pronounced for the third couple. While there are only 4 years separating Nowaki and Hiroki, interestingly enough the difference presents the largest problem to the relationship. This is also the odd one out when it comes to the seme/uke setup -- Nowaki, the younger one, is the seme. No, wait, C is also unusual in that the uke does all the pursuing and the seme is resistant.  Couple A starts out with the two characters being kind of randomly thrown together, couple B meet when Kamijou is mourning his lost love, and Kusama comes across him in the park and it's love at first sight for him; couple C is basically Takatsuki interpreting a random encounter during which Miyagi helped him as \"fate\".  There is a slight supernatural potential here, but nothing ever comes of it.\\n\\n\r\nArt (3/10):  Atrocious.  I cannot stand Nakamura Shungiku's art; it's ugly -- heads are often too small for bodies, as are hands, facial shapes are unappealing, mouths look like the characters are in a bad mood, eyes are often dull, and worst of all, she has only two character types, seme and uke and they all look alike within type.  The backgrounds are decent, but I bet Nakamura doesn't do them herself.  I do like her chibi and SDs.  The animation is stiff and wooden, the usual victim, I imagine, of low budgets for BL anime.\\n\\n\r\nSound (7/10): I didn't care for most of the BGM, and the OP and ED are generic JPop.  The voice talent on the other hand is mostly superb -- Sakurai Takahiro voices Misaki; he is still a favourite seiyuu of mine.  It's a perfect portrayal, but he also has some range to play with, since Misaki is easily the most expressive character.  Inoue Kazuhiko also does a great job with Miyagi; I could listen to that man read the phone book and probably get aroused.\\n\\n\r\nCharacter (5/10): The primary character, the one in whose head we spent the most time, is Misaki.  And I constantly vacillated between being utterly frustrated with him and kind of rooting for him. Because he has to be the most naive and idiotically dense character I've encountered in a long time, and he is also the typical tsundere uke who completely denies his feelings and is unwilling to ever say the L word; he fights every bit of affection with tooth and nail, while secretly liking it but also being horribly ashamed of it -- Japan is fucked up, seriously.  But while he always instinctively acts like a cactus, he also thinks about everything, and though he often settles temporarily on a naive answer, eventually he works his way around to what is actually going on.  He is also hampered by his back story, which has made him into a person who never wants to be a bother to anyone, and he likes to please people -- but his tsundere nature works against that in many ways which he doesn't even recognize.  \\n\\n\r\nUsami is a cantankerous, crotchety egotist, and I never warmed up to him, even when he goes all lovey-dovey later. He pushes Misaki into intimacy (we'd call it sexual assault here), but it's hard to deny that if he didn't, Misaki would never ever do anything on his own.  I don't like that sort of setup and I'd never get involved with somebody like that, but yeah, it's not my culture.\\n\\n\r\nThe other two couples don't have the same unpleasant dynamic going on because while Kamijou is also a tsundere, at least he is basically willing, just also embarrassed.  The problem with Nowaki is that I completely lost any liking for him when he disappears for a whole year.  It was also Kamijou's fault for not paying attention, but the justification for Nowaki pulling that stunt was garbage.  Couple C interested me primarily because I was watching for signs of Shinobou being Miyagi's first love's reincarnation.\\n\\n\r\nEnjoyment (7/10): The humour is what makes the show.  It's a strange mix, but with relatively little sexual innuendo humour; most of it comes from Misaki struggling with everything in his life in amusing and often unexpected ways.  I'd really like to hang out with Nakamura Shungiku some time.  ;)",
            "date": "2016-09-24T01:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 229973,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229973"
        },
        {
            "content": "Let me start by saying, I am utterly jealous of Japanese kids! Men falling in love with men,  is something that the whole world is still having problems accepting. Let alone a country like mine which the stupid government comes out and says: \"We have no such thing at all!!\" so yeah, I am jealous! Since their early ages, they know such thing does exist and it is normal! The suffering, the heartbeats, the pain, the joy, it's all there and it is something sweet and nice!\r\ncomparing it to other animes I have seen, this was not a great anime. Didn't have perfect artsor music or story. But the subject itself, and the way characters developed, made it a very interesting anime. \\n\\n\r\nIn the 3 couples you see during the anime, Usagi-Misaki are the main one. The way Misaki gets the idea little by little and the fact that it even surprises him, is so real. Plus I like Usagi. He's cool :D \\n\r\nThe second couple are Hiroki-Nowaki. They are my favorite. The way Hiroki is mad at Nowaki ruining his life(which is actually him falling in love!), and the way Nowaki tries his utmost to be \"worth\" him. \\n\r\nbut the third one, is my least favorite. Myagi-Shinobou. Till now, I don't get them! The only thing I like about them, is Myagi's voice which is the same as Naruto's Kakashi :D\\n\\n\r\nIn overall I give it a 7.",
            "date": "2010-05-05T02:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 25747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304999.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Azar",
                "username": "Azar"
            },
            "url": "https://myanimelist.net/reviews.php?id=25747"
        },
        {
            "content": "I watched all seasons of Sekaiichi Hatsukoi and even the movie before watching this one. One thing I must say about this one is that everything happens remarkably fast. I swear the main character from Sekaiichi Hatsukoi took forever to say \"I love you\". In Junjou Romantica, everything moves forward so fast, and I swear it's a lot more about sex that the other show. I'm not complaining, I'm just saying I didn't expect it to be so forward.\r\nThe story is alright I suppose. It doesn't build up on much this season as Sekaiichi Hatsukoi did in it's first season. What I like about itis that the characters do not beat around the bush. They are men and they need to speak up and get to the point and not whine about stupid things. I can understand the younger characters and let it pass, though. I found myself laughing quite a bit while watching. It can get quite humorous at times. This season has three different stories of different couples, and some are intertwined. That being said, the first couple's arc is funny, but I like the second couple's love story much more. The third, well, there's not much of that present. \\n\\n\r\nAt times I find myself routing for them if they should go ahead and do the right thing, instead of b**ching about and whining a lot lol I wish I could rate this anime a little higher than the first season of Sekaiichi Hatsukoi since it was a little more amusing and straight to the point, but it's not much of a difference. I would say an overall of 7.4, so not enough for me to have given it the full 8. I'd just say good instead of Very Good.",
            "date": "2015-12-05T22:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 204888,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=204888"
        },
        {
            "content": "oh my god! this is like the best anime i've ever seen! :D \r\nit's like every dream of a fangirl\\fanboy came true! \r\nBasically- there are 3 different stories that are somehow all related to each other. they are all emotional and amazing. \r\nPlot- is the best. each story focuses on a different issue which is great cuz they are not repeated but there is something similiar, just a bit. \r\nArt- all the charecters are well drawn, but there's a single thing that is troublesome- the hair style. it's really confusing because some of the characters look alike each other and it's a bit disturbing. butother than that- every thing else is awsome. \\n\\n\r\nSound- the soundtrack is great. also the opening theme and the ending is quite good. \\n\\n\r\nManga details- from what i've seen it's almost the same as the manga. even the small details are in the anime as well. it's great, because there's no need in reading the manga to realize what's going on. \\n\\n\r\nOverall- the show is absolutly great. recommended for all the fangirls\\fanboys who love yaoi. \\n\\n\r\ni totally enjoyed it! :) awsome anime.",
            "date": "2008-08-01T04:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 6756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81586.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/VampireLio",
                "username": "VampireLio"
            },
            "url": "https://myanimelist.net/reviews.php?id=6756"
        },
        {
            "content": "well. i never expected to love this anime so much as i did, it's fantastic. it's made me cry because of how happy it made me . :D",
            "date": "2011-02-05T18:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 34279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/heatherbear",
                "username": "heatherbear"
            },
            "url": "https://myanimelist.net/reviews.php?id=34279"
        },
        {
            "content": "Okay, first of all, this is a YAOI, so if you're a homophobe or a minor or both, just stop reading here and go back to the last page you were on.\r\nFor the rest of you, this was the first yaoi anime I ever watched, and I fell in love with it.  It is touching at times, heartwarming at times, and laugh-out-loud funny all the time.  The end of every episode left me with a smile on my face, and that's not something I can say about any other anime (except maybe Fruits Basket).\r\nPerhaps another reason this anime appealed to me so muchis that it is about an older group of people.  Most of the characters are college students.  Misaki, the youngest, is 18, and the oldest character is a 35-year-old professor named Miyagi.  The characters are well-developed, intelligent, and witty.  The story follows the love lives of three gay couples.  While it is definitely very hot and sexy, it's far from being graphic, so in no way can it be considered smut.  It is a genuinely wonderful, feel-good story.\\n\\n\r\nSo, to all the ladies, gays, and handful of men secure enough with their sexuality to not be bothered by some hot guy-on-guy action, this is definitely a must-see!  10/10!!",
            "date": "2009-08-11T07:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 17666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/184790.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AikaHime",
                "username": "AikaHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=17666"
        },
        {
            "content": "So I had heard about the Junjou Romantica series a while ago, and as an avid yaoi fangirl I was thrilled. I was intending to watch it. However, I was intimidate by the three seasons it had to offer, and was thus swept away by the seasonal anime on offer at the time. This year, my friends encouraged me to finally get into it. And oh boy am i gad that I did. \r\nJunJou Romantica is a 36 episode 3 season long anime that falls into the Shonen Ai (Boys' Love) genre. It follows 3 different sets of all male couples, but mainly revolves aroundthe saucy romance between Usami and Misaki, the coverboys for the series. If you're a fujioshi searching for a Boys' Love anime, then look no further!\\n\\n\r\nOne of the things I most love about the Junjou Romantica series is just how relatable it can be sometimes. You may think it's absurd of me to say that, but one you look past the man-dating-man exterior, there are certain things in this anime that resounded within me regardless of sexuality or gender. \\n\r\nFor example, unrequited love is explored in great detail. I'm sure we all know what it feels like to love someone , despite them not loving you back. This is explored through the characters Shinobu and You. Sure it mostly paints an unrealistic picture with those two, a student in love with a professor who is more than 10 years older. However, there are still themes embedded in that we can all relate to in some fashion.\\n\\n\r\nAnother thing I liked about this series is that there was more than enough action in each episode to keep me entertained (heh). Interactions between characters were always lively, and some exchanges left me on the edge of my seat! Another minor detail that I quite enjoyed, was that the main characters would somehow appear in each others' lives, even if briefly.\\n\\n\r\nTo be quite frank there wasn't much I disliked about this anime. Sometimes I did find it implausible how the characters would express their feelings, but this can be forgiven as the anime is very heavily drama-based. \\n\r\nHowever,, there was one scene in particular that irked me a lot. I'll try no to spoil too much. So, one character feels an urge to kiss another one. As he's about to do it, the one who's being kissed's lover catches them and whisks him away. This particular scenario was never mentioned again, despite all 3 being main characters.\\n\\n\r\nOverall, Junjou Romantica is such a wonderful anime , and one i recommend to anyone into the romance/ drama genre.",
            "date": "2018-11-28T04:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 294865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6342694.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nessdabest",
                "username": "nessdabest"
            },
            "url": "https://myanimelist.net/reviews.php?id=294865"
        },
        {
            "content": "I have a poster of this series on my bedroom wall, I ordered volumes of the manga straight from Japan, along with some CD dramas, and all three seasons of the anime on DVD. So it's about time I ripped the first season to shreds.\r\nLet's start with the core concept. The story is told by the 18-year-old Takahashi Misaki, who moves into the house of his brother's best friend, the 28-year-old Usami Akihiko (Usagi). Usagi has been in love with Misaki's brother for years, but when he gets married, he decides that he'd be better off screwing a completely normal, heterosexual, 18-year-old boy, because ifsimply being gay wasn't enough for the audience to call it quits, being borderline pedophiliac must do the trick. Misaki somehow survives the first encounter (for which he has my respect), but afterwards reacts to Usagi-san's advances with hysterical fits of rage; this doesn't stop them from having sex at least once per episode, though. During the season, Misaki starts to develop Stockholm syndrome, which becomes incurable by the end of it, when the concept of Usagi breaking up with him results in him making a passionate confession of his feelings, worthy of a true tsundere. Oh, and Usagi-san is writing a light novel about this beautiful romance, which raises some serious questions about the original author's personal life.\\n\\n\r\nThere are two sideplots, too, but I'd rather not get into details about those. Although the relationship of Hiroki and Nowaki (alias Junjou Egoist) is believably written, I still can't understand why Hiroki'd fall in love with an egocentric, boring, bitter and overall unpleasant person such as Usagi. (I guess it's because he's similar to him.) But even the worst parts of these storylines are Shakespearean exemplars of contemporary romantic drama compared to the aberrated trainwreck that is \"Junjou Terrorist\", which is about as enjoyable as you'd expect from something with \"Terrorist\" in its very name. (Actually, nevermind, Zankyou no Terror exists, and as far as I know, it's not as bad as this.) Basically, imagine Usagi-san, except he's 35 instead of 28, he's now called Miyagi, and he's about 69 times as much of a douche towards his partner, sometimes going as far as to rape the poor 18-year-old Misa- I mean Shinobu. Doesn't this just sound fantastic?\\n\\n\r\nWell, a normal person would jump out of an 8th story window right about now, but if you have read the first sentence, you already know I'm everything but normal.\\n\\n\r\nRatings:\\n\\n\r\nStory: (6)\\n\r\nFrom everything above, you might think that the story is a giant piece of turd. And it is, I'm just really kind. Let's not talk about this further.\\n\\n\r\nSound: (6)\\n\r\nUsagi and Miyagi sound like Google Text-to-Speech reading the transcript, put through a filter. Completely monotone. All uke characters (Misaki, Hiroki, Shinobu) talk via frenzied shouting. Nowaki, however, is able to passionately, softly and overall perfectly say \"Hiro-saaan\" about 623 times.\\n\r\nThe background music is great, but I'd rather not talk about the OP and ED. I swear I tried, but I just couldn't listen to the entire ED even once.\\n\\n\r\nAnimation: (4)\\n\r\nThere are still frames lasting for 20 seconds. I get that anime often sacrifice FPS and animation in favour of more detailed character models and backgrounds, but I swear, judging from the quality of the animation, the majority of the budget was spent on blinking and mouth movements.\\n\\n\r\nCharacters: (7)\\n\r\nOriginal, funny, relatable and believable, but not really likeable. Nowaki raises the score here by a few points.\\n\\n\r\nEnjoyment: (100)\\n\r\nI'm a fujoshi. That's all.",
            "date": "2018-04-14T11:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 278050,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6251294.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lucisz",
                "username": "Lucisz"
            },
            "url": "https://myanimelist.net/reviews.php?id=278050"
        },
        {
            "content": "What you're about to read will be really deep, that's what you need to know. \r\nI've never really understood why people even liked yaoi or why there were so many people fangirling over it. One day, I was really curious about what yaoi anime was like, so I looked up for some and found Junjou Romantica. \r\nI was a young teenager during this time, going through puberty and all. I have had a history of being emotionally abused often, so when I saw this anime I thought it was cute and couldn't see the abuse at all because I thought this was normal, and thecharacters really reminded me of how my emotionally abusive mom who was super overprotective like the characters in the anime. I didn't understand what healthy relationships or friendships were like back then, so yaoi became my coping mechanism for that. I went to a toxic school, and also got sexually molested once which basically traumatized me but yaoi made me feel safe and not have to deal with the emotions that come with trauma most of the time. It was my escape.\\n\\n\r\nI know not everyone was like me. This anime basically made me feel comfortable and made me feel nostalgic for some reason. I really liked this one, but opened my eyes... \\n\\n\r\nI realized it wasn't a great anime. Plenty of kids go around watching stuff like this, and you've probably met some annoying fangirls in your life. Luckily it didn't make me fetishize gay men, but recognize that hey, gay relationships are pretty normal like straight ones. \\n\\n\r\nEither this anime will make you fetishize gay men or not, there's no in-between. The story isn't that great, it's pretty cliche but I have to say that the strongest point of this anime could be the characters since I did feel emotional while watching this and for whatever reason am able to empathize with them. But they were not written well,  at least not developed enough for me to find them memorable. The character designs are OK. \\n\\n\r\nAs for the sound, pretty average but it's addicting. The opening song ( first one ) was my favorite, the rest... not really. The OST is also good, at least it suits the mood of the anime but the opening and ending songs are actually quite awkward to listen to because of the lyrics. Nevertheless, I did enjoy the anime at the time I saw it. I give the art an 8, at least the animators drew the scenes better than the mangaka because honestly I couldn't even get through reading the first few chapters of the manga, the anatomy was just so terrible. At least her art has improved over the years, but I don't like how they have seme and uke stuff and how they give them different characteristics. Normal gay couples don't look like that, nor do they always have huge age gaps.\\n\\n\r\nAlso can't deny that this would be a terrible influence on younger people nowadays, doesn't matter what gender you are. If you don't understand what abuse is, you will think that someone who is mean to you is in love with you. That's not how real relationships work. And as we know, the first couple basically involved sexual harassment. Most yaoi mangakas play it off as if it's no big deal and turn it into a romantic love story, where the guy eventually falls in love with the other guy. If this event happened in real life, the person would be traumatized. It kind of gives away the message that people who get sexually harassed actually enjoy it, this is NOT true at all. \\n\\n\r\nIt is easy to get attached to the characters, I think a lot of young teenagers like this anime because it's super girly but has a childish side to it which they can connect to. Some people use it to cope with trauma ( that's me ), while others are going through puberty and maybe some are just here to fetishize gay men. There's nothing wrong with shipping two men, but if you are shipping someone non-fictional in real life with someone else... you have a problem here. \\n\\n\r\nThe author may have been sexually harassed and is writing this to cope with trauma. This is a possibility, because sexual harassment against women is quite common in Japan to the point where they have trains for only women. I do recall watching the spin-off of this series, The World's Greatest First Love. In one of the episodes, Kisa mentions that he got sexually harassed sometimes because he got mistaken for a girl. \\n\\n\\n\r\nBack then, I might have given this anime an 8. I'd give it a 6/10 now after knowing why I liked this. It was better than most yaoi animes on average back when I watched this, but nowadays they're releasing better BL anime.\\n\\n\r\nIf you want good BL, watch Classmates. I would highly recommend it. And maybe Tiger & Bunny for real queer representation, although Tiger & Bunny isn't really yaoi, the two main characters are meant to be interpreted as a gay couple or bromance, you choose. I wouldn't blame anyone who watched Junjou and thinks it's great, if you are reading this and may consider watching it then please educate yourself on abusive and healthy relationships and STDs, and then watch the anime. It's better to be safe than sorry. \\n",
            "date": "2018-01-26T13:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 269725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4112403.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zetsushiki",
                "username": "zetsushiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=269725"
        },
        {
            "content": "First off, let me say this is FICTION. It is free to be over dramatic, sappy, and unrealistic. That is part of what makes fiction so enjoyable-- it's not something we see everyday. Some of the characters do cry in situations a lot of people, especially males, probably wouldn't actually cry about in real life, which you see in the first episode. And since I'm not a guy or a gay guy, I guess I can't really have an opinion on how boyish or girly the guys in this are, but generally I don't think they're too feminine, and I don't think it even matterseither way. There ARE quite a few gay characters in this that are all connected in some way, which I can see is unrealistic, but again, it's fiction, and I want to add that a lot of them do go through trouble accepting their feelings toward another guy or acting embarrassed when they're saying something romantic. But, this doesn't focus much on them accepting their sexuality. It doesn't totally ignore it like everybody's gay and it's super acceptable, either. Anyway...\\n\\n\r\nThis anime makes me so happy when I watch it. It may not be genius writing or anything, but I don't care. It's sweet, adorable, hilarious, and fun to watch.  If the borderline harassment doesn't bother you too much (a certain character is pretty inappropriate with his touching, especially at first, though they go into that later and explain how they both actually feel about it. Also he's my absolute favorite character despite him acting like that) you might grow to adore the characters as much as I do. \\n\\n\r\nIf you're wondering if this is a soft shonen ai or a yaoi, it's definitely a shonen ai with some short sex scenes that don't actually show anything. And it may not have a deeper plot to it, but that's because the story is just about their day to day lives and watching the characters and their relationships grow bit by bit. If you love slice of life, romance, and comedy, this anime is really great.",
            "date": "2017-09-12T17:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 257372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6408168.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shayne112",
                "username": "shayne112"
            },
            "url": "https://myanimelist.net/reviews.php?id=257372"
        },
        {
            "content": "Seriously, everything about this is really great.\r\n and +++++Yaoi *kyaa*\r\nBut This is really worth your time, you'll always look forward to what the stupid couples will do next. When I say stupid, you know what I mean right... love love stupid...\r\nAn 'coz of that the whole anime is just *kawaiii*\r\n*gah* I sound like a stupid fan girl, but you get my drift..\r\nIf you are a female, and like yaoi, then this is just the right thing for you, great story, the art makes me wanna be part of it *not in a perverted way*, The characters are all so very funny, and great. You'll reallyenjoy this this is just really outstanding and funny, you'll never really get bored with this..\\n\r\n Its is a biiiiig 10 from me :D",
            "date": "2008-11-24T06:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 9805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91892.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hannechan",
                "username": "hannechan"
            },
            "url": "https://myanimelist.net/reviews.php?id=9805"
        },
        {
            "content": "This anime was awesome. it made me lauhg till i cried. the 2 main pairs are the funniest. I loved the sound it was great. the story was sick two it was obviously well thought out. the art was outstanding , i mean all the main guys were drop dead gorgeous ( just between you and me i fell head over heels for both characs. in the 2 main pairs) to me it didnt matter that they were gay it was hilarious and i loved it so if ever want serious comedy you might too!",
            "date": "2011-06-26T02:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 38325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/411149.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sarcastic_neon",
                "username": "sarcastic_neon"
            },
            "url": "https://myanimelist.net/reviews.php?id=38325"
        },
        {
            "content": "Junjou Romantica is not the best anime. However, for whatever reason, I couldn't bring myself to hate it.\r\nStory - This is (obviously) a yaoi anime based on 2 main couples; a tutor flirting with his friend's brother and a teacher who falls in love with a younger guy. There's a 3rd one as well, but it's not quite as important. The first one, Usagi and Misaki, is really the more focused on of all of them. Basically, all the couples do is argue, get all depressed, and then have make up sex. Lather, rinse, repeat. That's the main conflict in this anime, in a nutshell.\r\nArt- Um, to put it bluntly, the art sucks. In my opinion, the worst part of this anime. Seriously, Usagi's chin is awkward and boxy. It looks like someone took a hammer to it and then tried to fix it back to normal with their hands or something. I think someone already pointed this out, but the characters pretty much all look the same but with different hair and eye colors. Very boring designs. Needless to say, the art is absolute crap.\\n\\n\r\nSound - Opening and ending songs are garbage. Seriously. Background music was bland, didn't do much to enhance some of the more meaningful moments in this anime. Not much more to say about this.\\n\\n\r\nCharacter - Here's where I'm kind of drawing a blank. The characters aren't bad necessarily... just not the best. They actually do develop, but still. I could predict their every action before they even made it. They're just plain boring. Not sure how else to put it. They're whiney, and the seme of the relationship seemed to be obsessed with exploiting the uke. Same old, same old. However, they have proven to have interesting interactions with each other on occasion. It is kind of amusing to watch the uke being taken advantage of, over and over again.\\n\\n\r\nEnjoyment - Junjou Romantica wasn't all that bad. Repetitive characters, boring plot, ugly art, terrible music. It sounds terrible from how I described it, but if you watch it yourself you'll see that it's kind of a fun anime. It has a lot of issues, but it's still cute. It's entertaining, just not the best thought out show out there. \\n\\n\r\nOverall - I know it seems like this whole review is just bashing JR, but it's not the worst anime out there. There's better, of course. JR just isn't an anime that you can really hate exactly. Yaoi fangirls, if you're looking for porn without a plot, don't watch this. The sex scenes in this aren't explicit, and it actually does have a plot (as lacking as it is...) If you like cute romantic relationships between 2 guys without much substance, then give this a shot. If you can stop staring at Usagi's hideous chin, you may even enjoy this. ^_^",
            "date": "2012-01-06T18:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 51119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1091729.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MaiValentine",
                "username": "MaiValentine"
            },
            "url": "https://myanimelist.net/reviews.php?id=51119"
        },
        {
            "content": "100% i'm gonna be the worst review person ever, though i can only go by art, sound, and animation. So the story part I can only do the plot. Along with that, deal with my worst spelling NA\r\nI'll be scoring all three of the seasons. (And my friends comment too)\r\nStory - 10\r\nGiving enough details in advance on what will happen, even though the sexual starts. That leads us to every character too on their part. Know that each character haves their own Plot story.\r\nFriend: WTF?! HE GOT RAPPED!\r\nMe: But he moaned ;)\r\nArt/animation - 10\r\nAt least give her credit for going a great job on theart/animation! ^^\\n\r\nFriend: BUT THE SOUND WAS MESSED UP!\\n\r\nMe: But it goes along with the anime :U\\n\\n\r\nSound - 8\\n\r\nHaha, just don't ask ask my friend!\\n\r\nFriend: Please, GOD NO!\\n\\n\r\nCharacter - 10\\n\r\nI really enjoy that each character haves their own persinallity and really goes along with the character and whom they date.\\n\r\nFriend: DEAR LORD NAW!\\n\\n\r\nEnjoyment - 10\\n\r\nHAHAHA I LOVE YAOI :D\\n\r\nFriend: I didn't :'(\\n\\n\r\nOverall - 10\\n\r\nall of the three seasons combined really did a outstanding job! Though I don't recommend it for people who hate Boy's Love or Gay Rights!\\n\r\nFriend: no it wasen't ;A;",
            "date": "2015-11-10T13:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 203128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675957.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Potato_Teresa",
                "username": "Potato_Teresa"
            },
            "url": "https://myanimelist.net/reviews.php?id=203128"
        }
    ],
    [
        {
            "content": "As my first Shounen-Ai anime, starting off at 12 years at age, I fairly enjoyed it, if anyone has some spare time, you should give this one a chance, even if you are homo-phobic and have a strong intolerance to gay people...It's not that bad, its not strong like \"WOAH! Wasn't expecting that to happen...\" This anime has some kisses, yea its a Shounen-Ai anime and some minor sex scenes...but that's all...\r\nMy Review-\r\nStory: 8/10\r\nThe story was cute at first when we meet our first couple, and we gradually get to know the characters better later on, and learn about them.\r\nArt: 9/10 \r\nI enjoyed the artstyle; especially the backgrounds, I found it to be very beautiful..\\n\r\nSound:\\n\r\nThe music was enjoyable, brings the different scenarios into play...really ties it together..\\n\r\nCharacter: 6/10\\n\r\nThe characters were OK to me, sometimes the designs were wonky and the bodies were out of proportion but to me it settled with my liking to this anime.\\n\r\nEnjoyment: 9/10\\n\r\nAs mentioned earlier, it was my first anime like this, but my enjoyment was great for this one...It should have a higher rating, but that's my opinon..\\n\r\nOverall: 9/10\\n\r\nIt was really good to watch, and re-watch as I have done, it was really enjoyable...\\n",
            "date": "2015-03-13T18:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 182291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4500907.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/maxxkns14",
                "username": "maxxkns14"
            },
            "url": "https://myanimelist.net/reviews.php?id=182291"
        },
        {
            "content": "Junjou Romantica to me was what I call a \"mood anime\", which you can watch with no problems whenever the mood comes. For instance, I must have watched this first season about two or three times now, and in most of these times I spent 90% of the time laughing, and 10% of the time horny. Easy now, I will explain.\r\nThe Story - 6\r\nThe story is not exactly the best one yet, and you will come to realise most of the things that happen are soon forgotten by the own characters that took part on the actions, or simply end up happening because of... reasons.Although, it is very adequate to the kind of objective I assume the authors had while writing this story, so it became a sort of charm through my eyes.\\n\r\nAnother issue that bugged me a little and I think is worth mentioning is the substance given to certain dialogues and actions. I don't think a lot of people end up minding about it, but as for me, a writer, it ended up breaking the illusion of the plot, and just made me laugh for about two thirds of the entire series. As time went by, it started having this impression that all of the characters – without exceptions – were all a bunch of grown-up kids who fight over silly things that they did without even thinking before. The conversations and motivations they end up having for themselves as the reason behind their affection towards one another are not the most visible throughout the series, so if that bugs you, you will end up having the same experience than me.\\n\r\nBonus: The arguments. Oh, the arguments. Sometimes I had that strange feeling of finding myself in the middle of a very embarrassing situation among two people, and me not being involved. How to explain that? Imagine yourself walking into a couple arguing in the middle of a narrow alley, while you are stuck between the wall and them. That’s how I felt.\\n\\n\r\nThe Art and Sound – both 8\\n\r\nI won’t blab over the art style because I myself don’t bother and even find it very pleasing – and fitting for the time it was produced (2007/2008). As for the sound, the voice actors are actually very good, though through their voices you can already tell who’s gonna be who (if it is a bummer). As a matter of fact, the voice acting was one of the main ingredients, along with the art, that kept me in the illusion of the series, even when the plot was overwhelmed with questionable points. Also, I loved the first season`s ending theme.\\n\\n\r\nCharacter – 5\\n\r\nThis was the point that made me upset the most. The character development is zero, and this is me being kind. I am sorry for the ones who really enjoyed or understood the confusion in the characters’ minds, but God, was that an unpleasing ride. The protagonists, because of the lack of proper conversation, end up having a lot of pointless monologues, and going round and round over the same issues for many and many episodes. Also, most of them contradict themselves, saying things like “I never said that”, while obviously this was all over the place in the episode before. But, the number one complain over this topic is undoubtedly the main uke. Jesus, I mean no spoilers when I say he is capable of upsetting the strongest of minds.\\n\\n\r\nEnjoyment – 8\\n\r\nI enjoy the yaoi genre. And it was no different with Junjou Romantica, the absolute symbol of the yaoi culture. Although it was very problematic in some points, the important moments were properly appreciated, thank you. And if you also don’t mind going through some mind trouble to get to those moments, you will also enjoy the series as a whole.\\n",
            "date": "2016-02-05T14:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 210196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049407.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ProfoundlyCrazy",
                "username": "ProfoundlyCrazy"
            },
            "url": "https://myanimelist.net/reviews.php?id=210196"
        },
        {
            "content": "Junjou Romantica is one of the best anime I've ever seen. The relationship between the characters was comical and romantic and the same time giving me even more enjoyment. \r\nGiven the fact that it's a manxman  anime, you would think that not many people would actually watch it, but Junjou Romantica proved different.\r\nThe only thing that I didn't like was the fact that not all couples had the same number of episodes per season.. I mean one fo the couples, that has an incredible story potencial, is only seen in about 3 or 4 episodes, in the 3 seasons.\r\nI liked the themes that werechoosen. From age difference to social status.\\n\\n\r\nBut overall is was absolutely amazing.",
            "date": "2016-02-19T05:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 211237,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208013.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tori_asuna",
                "username": "tori_asuna"
            },
            "url": "https://myanimelist.net/reviews.php?id=211237"
        },
        {
            "content": "YAY YAOI !!!\r\nWait, I’m a dude...\r\nWe all have this sense of curiosity when you hear something surprising and unexpected. Both Junjou Romantica and Sekaiichi Hatsukoi series have a whooping score of 8. Eight is like the “great” scope of rating here in MAL, and I was shocked when I saw that score. But I really shouldn’t be shocked; only a few people have watched these series, and trust me, I know exactly who and why they rated it so highly. Yaoi is a very delicate genre to begin with and I honestly thought that people would rate this lowly without even watching it (but itwould show on your list so there’s that).\\n\\n\r\nAnd so I watched it. It was embarassing for me at first but it eventually grew on me. Of course, I still am a dude.\\n\\n\r\nI expect that people would disagree at the things I’ll say later on since there are things that non-fujoshis cannot see. Keep in mind that I’m open-minded on these topics, so if I said something offensive, it is not intended to degrade certain views.\\n\\n\r\nYou should try watching too so you can expand your mind on homosexual topics (if you can).\\n\\n\r\n/////////////////////////////////////\\n\r\nTHE GOOD\\n\r\n/////////////////////////////////////\\n\r\nLAUGHTER IS THE BEST MEDICINE\\n\r\n[Comedy]\\n\r\nis surprisingly funny. Slapstick comedy is often used here and the characters usually turn into simple chibi drawings and the background into plain comedy skits. Without thinking that this is yaoi, you would get some kind of satisfaction or engagement and arguably, you would be able to enjoy this. I was honestly surpised by this and I honestly thought that the show would just throw bishounen, yaoi things at me. It can also provide something enjoyable even for dudes like me, and I enjoyed it. Although it can be corny at times, a lot of the jokes used here will definitely tickle your stomach. But of course, you need to have an open-minded view on this since most of the jokes here are yaoi-related.\\n\\n\r\nTWO IS BETTER THAN ONE\\n\r\n[Multiple Barrage of Couples]\\n\r\nThere are a total of 6 main couples throughout the Junjou and Sekaiichi series, 3-4 sub-couples more or less also in the series, OVAs, and movies. That was a good thing since I get to know their views on their relationship rather than fixating on a repetetive main couple that keeps appearing on every other episodes.  Unfortunately, this part has issues, but I will talk about that later on.\\n\\n\r\nIS THIS THE REAL LIFE? IS THIS JUST FANTASY?\\n\r\n[The Introduction of Contemporary and Societal Issues]\\n\r\nI was sorta relieved when the show introduced couples that are mature(arguably), working men. Again I have an open-minded view on yaoi but not on shotacon. Shotacon is just wrong wtf. Anyways, I never really thought that topics like age gaps, teacher-student complex, divorce, death of a loved one, and job-related hindrances would be talked about. Even the notion of what people may say if they found out that you are dating someone with the same gender(sex) is tackled. I thought that it would just be about a petty love story (which is true in some degree) but it also ventured on what may be “new” to the anime world. It just shows that this kind of anime would even tackle on trivial things. That’s when I realize that this anime is not for those who simply wants to see guys banging each other; it’s for those who are confused with their relationship (heterosexuals included).\\n\\n\r\nThis part also has issues and will be talked about later.\\n\\n\r\nNATSUYUKI RENDEZVOUS\\n\r\n[The Terrorist couple]\\n\r\nOf all the couples, the one that struck me the most is the Terrorist (the straight and the blonde young man). I was talking about death, age gaps and teacher-student relationships earlier since he was the most realistic and moving character in these series for me. The Terrorist tries to make the Straight fall in love with him but the Straight wholeheartedly refused because of a certain thing in the past. He even thought the the guy was delusional and affected by the curiousty of youth. More over, their age gap is very long and some people may not accept that. And fuck, he’s straight; he loved a woman, he married a woman, he divorced a woman. That is something I’m looking for especially for a yaoi series since it complicates their relationship and can venture on a more believable romance.\\n\\n\r\nSHOUJO IS STILL A SHOUJO\\n\r\n[Feels exactly like a Shoujo Romance]\\n\r\nReplace their partners with women and it would still feel the same. \\n\\n\r\nSo why is it good?\\n\\n\r\nGenre needs to conform with the likes and dislikes of its audience and utilize that to create stories similar to one another. I personally don’t like cliches, but the show stayed true to it’s demographic and that’s a good thing. Who would want yaoi on a masculine anime like JoJo? Hah.\\n\\n\r\n/////////////////////////////////////\\n\r\nTHE BAD\\n\r\n/////////////////////////////////////\\n\r\nWWE’S WRESTLING MATCH\\n\r\n[Too Submissive]\\n\r\nI don’t know much about the Japanese’s view on Yaoi but almost all of the uke (the bottom partner) here just gives in. I mean characters like Misaki are always angry when their partner tries to kiss them, but becomes submissive later on. The ironic thing is that they keep saying that they are not gay. Maybe men in Japan are ok with homosexuality but they don’t certainly bang each other the first day they met. The beginning of Junjou Romantica proves this wherein Usagi suddenly gropes Misaki on his bed. Misaki, arguing that Usagi must stop, never used his arms, body, nor legs to kick him in the nuts. Note that that was Misaki’s (presumably) first yaoi encounter and I don’t think that people would just give in for that. (The utterance of the words  “I love you” is a different submissive thing)\\n\\n\r\nMost of the first sexual encounters here are like “I think I like you so I’ll kiss you, even though we’re dudes”. There was never really a provoking reason why they would like that guy. In other words, it’s shallow, and it makes their relationship questionable.\\n\\n\r\nMaybe I’m looking for realism, but the point is that it is not believable.\\n\\n\r\nJOKES ARE NOT FUNNY WHEN USED THE SECOND TIME AROUND\\n\r\n[Too Repetitive]\\n\r\n---Character Design\\n\r\nWhen you have multiple barrage of characters, you expect them to be completely unique from one another. But nooo, all of the them look overwhelmingly similar. All the ukes are smaller and thinner with similar hairdos (except the second couple). All the semes have almost the same height, same looks, and same jaws (I laughed when I first saw Usagi, his chin was so sharp it would slit Misaki’s throat if he kissed him at the right angle). It was repetitive and honestly I think the artist just got bored with creating another unique face and just rode along with it. At times I was confused on pinpointing the characters since they have little unique features. \\n\\n\r\n---Personality\\n\r\nThis is true for almost all of them since they are all a bunch of airheads. Too many misunderstandings and subtle remarks which are seriously easy to negate, got in the way and made me uninterested with their current arc.\\n\\n\r\nThe ukes seem to have the same arrogant personality. I know that people would sometimes get irritated with them because I frequently do. They are loud but submissive when groped by the male partner and really, if they’re gonna do that again then at least change their personalities.\\n\\n\r\nThe semes are overprotective when they are confronted by a competition so you would expect them to push these suckers away again and again without any real satisfaction from non-romantic viewers like me.\\n\\n\r\n---Problems\\n\r\nThe problem with the first couple is that they keep introducing people who have the same kind of interest to Misaki. \\n\r\nThe problem with the second couple is that their jobs/careers repeatedly hinder their relationship, which should have been taken care of since that was already fixed, but still, they raised the same misunderstandings and same outcome again and flunked.\\n\r\nThe problem with the last couple is that it went too fast. What could’ve been the most interesting couple got pwned by time. Every season, they have an average number of appearances from 1 to 2 episodes. With that kind of number, you would expect them to rush their relationship, which they did by the way that’s why it became stale. That is also true with the last couple of Sekaiichi and I never got any real interest for them.\\n\\n\r\nThe last but certainly not the least problem I have encountered with repetitiveness is that the first couple of both Junjou and Sekaiichi are prioritized. They never slated enough equal time for the other couples, that’s why they were tiresome to watch and they keep repeating the same formula over and over again. When the preview shows that the main-main couple will be the spotlight of the next episode, I frown.\\n\\n\r\nWHO RUN THE WORLD? (NOT GIRLS)\\n\r\n[Lack of Female Characters]\\n\r\nI get that this is BOYS LOVE and it would make sense that all main characters are men but c’mon. I could only remember two females throughout both series and honestly, they don’t really shake the show. They’re just there for conversations and character expositions. Oh, and they don’t care about the yaoi relationship going on with the couples. Maybe it’s because I’m a dude, but there are also things that women can only see and perceive especially on feminine things like yaoi. It sucks that we never got to know any view on same-sex relationships from outside parties. But hey, there are many female viewers so there’s that.\\n\\n\r\nIT’S A TRAP!\\n\r\n[Feminizing Masculinity]\\n\r\nIn other words, men suddenly becoming gay. There’s not much to say about this since this is a hands-off for me. The problem I have here is the transformation. That’s all I’m conflicted about.\\n\\n\r\nLOVE AND LOGIC\\n\r\n[Lack of Concrete Reasons]\\n\r\nOkay, you think you love him, but your love  for someone who doesn’t have a striking good quality except his looks and his great sexual assaults would make you fall in love with him? (I’m talking to you Misaki).\\n\\n\r\nI’ve been saying this again and again, but a great issue of this anime is the lack of believable reasons why they would love their partner. For example, the Straight suddenly took a liking on our dear uke. Why? Because he just feels like it. Note that he dearly misses this certain someone from a certain event, but suddenly he just realized that he want to give that boy a chance because something is stringing his heart. You can make that relationship though, but the only needed thing here is time, which they, unfortunately, don’t have.\\n\\n\r\nI know that this is yaoi and it’s mostly fan-favored, but this is also romance, it has got to be moving.\\n\\n\r\nSTICKS AND STONES MAY BREAK MY BONES\\n\r\n[Sexual Assaults]\\n\r\nThis is the most arguable thing here since it seems that sexual assaults are “ok” in a sense. You know what they say, actions speaks louder than words. Well technically, just words and light actions would be shounen-ai, but Junjou and Sekaiichi are yaoi; it has action, but it’s usually forced. Though the forced thing is just groping and kissing, the fucking is not forced on the uke.\\n\\n\r\nThere is also a possibility that the uke wants that but just acts arrogant, but that’s a different story.\\n\\n\r\n/////////////////////////////////////\\n\r\nTHE BEST\\n\r\n/////////////////////////////////////\\n\r\nSAVE THE BEST FOR LAST\\n\r\n[Sex]\\n\r\nNot gender, but ACTUAL SEX.\\n\\n\r\nAm still a dude yo.\\n\\n\r\nSex is like the “denouement” of most of the arcs and I think that it’s a good ending for a plotline of a yaoi. It’s all about build-up; you are together, you encounter a problem, you fight, you find the light, you solve it, you confess to one another, you have sex.\\n\\n\r\nIf you replace their partners with a female, you know that you feel it’s good. All the tension the story gives to the characters will eventually boom and explode in sex (no pun intended). Though I have never encountered a male-female sex on a non-hentai anime (I think I don’t), I feel that that would be a good ending on a mature anime like this.\\n\\n\r\nSpeaking of mature anime, it’s a good thing that almost all characters here are over 20 years old. If it wasn’t then it would be very controversial. *cough* Boku no Pico *cough*.\\n\\n\r\n/////////////////////////////////////\\n\r\nFOR DUDES AND GALS WHO WANT TO WATCH\\n\r\n/////////////////////////////////////\\n\r\nDon’t watch this if you do not accept (or you’re not open-minded with) yaoi or even yuri. You would just hate this without any reasons story-wise. It’s perfectly fine for a dude to watch this, but make sure that you wouldn’t condemn this simply because you think same-sex relationships are bad. At some point, you man, will question your sexuality, and that’s normal. But as I keep saying over and over again, I am still a dude, so I am your evidence that you shouldn’t feel guilty watching this, also I have a girlfriend so heh. It’s a different story religion-wise so I’m not talking about that.\\n\\n\r\nPersonally, I have all the arsenals to hate this not simply because it’s yaoi but because it is not done well. It has all the potential utilities to become a good anime but it did not utilize that and ultimately became shallow. Most of the stories are not-believable and the overly repetitive problems keep appearing on different episodes. The main-main couples are prioritized so it hurt the other couples who also have the potential to become a great yaoi couple. The character design is also repetitive and it did not help remembering which is which. It definitely feels like a shoujo romance but it’s also a good and a bad thing. I also have problem with their submissiveness and sexual assaults that a moralist person like me would definitely question. \\n\\n\r\nI definitely enjoyed this, but again it has some problems that one would expect on a shoujo anime especially a yaoi one. The fujoshis may rain hate on me but I’m just giving my personal opinion (No h8 m8). Again, all things I have said here are completely subjective and are bound to mistakes and misunderstandings. Feel free to watch this if you want to become open-minded with same-sex relationships and understand that what you think about yaoi is wrong in some degree. It provided something unique yet risky, as it would be the bane of all men out there. I’m not sure if I’ll like this if I was a woman (or a fujoshi/fudanshi), but there’s all sorts of hate from society that people cannot change completely.\\n\\n\r\nI rate this a 7/10 by MAL ranking standards. Not a high score, but definitely not a low score; it’s average. And it presented something average, so i rated it like that. (Though I rated it as 5/10 in my list since I rate things differently, besides, 5 is a very low score in MAL and it would be better if I conform with your standards.)",
            "date": "2016-03-31T04:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 214914,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5195923.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ryuugamono",
                "username": "Ryuugamono"
            },
            "url": "https://myanimelist.net/reviews.php?id=214914"
        },
        {
            "content": "This is a must watch. I've seen this anime numerous times and I never got bored. \r\nStory: At first it is quite confusing, especially if you never read the manga. So you might want to check the characters information for better understanding. \r\nThere's so much going on. It's exciting, hot, romantic, beautiful and sad at the same time.  \r\nArt: Amazing animation plus unique art. I've never seen anything similar to that. \r\nSound: Very good choice of music. It's pleasant to the ears and matches perfectly to the events. \r\nCharacter: Couldn't be any better. Every one of them is lovable. \r\nEnjoyment: Every episode is filledwith more and more surprises and the romance rises higher than the sky. \\n\\n\\n\r\nOverall: Once you enter the Junjou Romantica world, you'll never want to leave. It's worth every second. 10/10",
            "date": "2012-08-05T06:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 68761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314398.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nolri",
                "username": "Nolri"
            },
            "url": "https://myanimelist.net/reviews.php?id=68761"
        },
        {
            "content": "It's been a while since I've watched anime (and yaoi, for that matter). As such, I can't really compare this to any other series/OVA, but here are a few thoughts circling in my mind:\r\nEither the Japanese concept of consent is very different from what I have learned, or they just showcase it this way in fiction (I remember this has bugged me a little before, too); a common trait in this series seemed to be the uke rejecting the seme, for whatever reason - especially the physical, sexual advances - even after love confessions had been uttered and they were in a relationship, which seemeda little redundant. Dubious consent, at the very least, was easily detected but instead of viewing it as what it is, they make it into drama. (Like I said, it's been a while since I've watched anime and even back then I didn't get too deep into it, so this could simple be a cultural difference I am yet to understand.)\\n\\n\r\nThe stories of the three couples were very much alike. In fact, the characters did not look that much unlike each other, and on the first view it was occasionally hard to keep track of who was who. However, it was nice to see how the three stories became connected, and I look forward to seeing what they do with those connections next - or whether they'll leave them as they are.\\n\\n\r\nI keep hoping for small improvements, because most of the character conflicts in these 12 episodes seemed to come from complete lack of communication and unnecessary dramatics. (Could be another cultural difference, or it could just be bad writing.)\\n\\n\r\nThe art was beautiful; this style especially appeals to me, and the humorous bits, for the most part, made me laugh out loud.\\n\\n\r\nOverall, I got hooked and watched episode after episode to see how these strange relationships progressed. (They did progress, to a certain point, but I cannot but wonder how healthy the foundation is in any of these three relationships, and how they'll grow from their rather bumpy beginnings - some more challenging than the others.)",
            "date": "2014-05-16T02:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 143449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/215350.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/oxana",
                "username": "oxana"
            },
            "url": "https://myanimelist.net/reviews.php?id=143449"
        },
        {
            "content": "I'm tired of seeing reviews in which people go \"This is a bad reflection of gay people!\"... it's yaoi, people, get over it. It's girls' fantasies. I isn't supposed to be realistic! After reading years' worth of yaoi, I can say that nearly all of them have non-consenting relationships. This one is no different. Don't say it's \"atrocious to the BL name\", because nearly all BL are like that. Seriously! Why do people get so serious over an anime? It's just anime, and anime are supposed to be unrealistic to their very core. Who do you think watches yaoi and goes \"That's definitely how gayrelationships are in real life!\"???\\n\\n\r\nOkay... done with my rant.\\n\\n\r\nThis anime is \"different\". That's the only word I have for it. You have two age gap relationships (18 and 28, 18 and 35), the first in which the seme is pushing himself on the uke and the second in which the uke tries to push himself on the seme. If you're into dominant uke, you might like this anime.\\n\\n\r\nThe first relationship is Usagi and Misaki, a relationship built solely on past turmoil (Usagi loving Misaki's brother but not being able to have him) and attempted rape. The relationship is built on extreme jealousy, cheating accusations, and anything but consent. Sometimes I get the feeling that maybe Misaki just has Stockholm Syndrome or something. Who falls for their rapist? But hey, it's yaoi.\\n\\n\r\nThere's the second relationship, Shinobu and Miyagi, a relationship built on \"fate\" and an age gap that the two have to overcome (Shinobu feels he's just a kid in Miyagi's eyes and thinks he's always a bother). I really don't think this is a non consensual relationship. Maybe on Miyagi's part, but Shinobu really wanted Miyagi's attention and he was the one asking to be in a sexual and emotional relationship.\\n\\n\\n\r\nThen there's the third relationship, Hiroki and Nowaki, which is a relationship full of emotional hardships, the struggle of balancing work and a relationship, and jealousy and distrust. It is a love at first sight relationship. This is probably the most pure relationship of the three as there is no real \"rape\" because it is obvious the two care about each other and Hiroki doesn't scream \"no\" or \"stop\" at Nowaki like Misaki does with Usagi.\\n\\n\r\nThis anime is entirely nostalgic for me. It was one of the first ever anime I watched, and I have seen it 7 times so far. If you're a hardcore yaoi fan, then you'll enjoy it. If you're one of those triggered gay people, don't watch it. Simple as that. This isn't an anime of lovey-dovey relationships but rather an anime about emotional distress in several forms. If you know how yaoi works (most yaoi have non consensual relationships), then watch this anime. If you're new to yaoi and dislike the concept of forced relationships, don't watch this anime.",
            "date": "2016-08-17T06:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 226936,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5299860.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YaoiMaster",
                "username": "YaoiMaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=226936"
        },
        {
            "content": "*English isn't my first language* \r\n*This review is covering all 3 seasons of the anime*\r\nJunjo Romantica is quite popular. It is known to be one of if not the greatest shounen-ai anime of all time. Many people praising it for it's \"realistic story\" and \"interesting story.\" Not going to lie. When I heard this, I got quite interested. I do enjoy watching some shounen-ai shows. I always love seeing two guys fall in love with each other. Same with two girls. However, when I sat down and watched all 3 seasons of this anime, I was shocked by how underplayed this anime was. \r\nStory: 5/10\r\nInterestinglyenough, there are 3 stories to this anime. Usagi/Misaki, Hiroki/Nowaki, and Shinobu/Miyagi. I'm not gonna lie, as generic as some of the stories for the couples are, they are quite interesting. Each pairing bringing us something interesting to see. I also enjoy how these couples do in their everyday life situation. Such as Usagi being a manga author, Hiroki being a college professor, and Miyagi dealing with the death of his wife. These are the REAL parts of the anime. I also love seeing Misaki shoot to get into the college that his brother wanted to before their parents died. And as cliche as some of it, I do enjoy watching them. However, the anime suffers from being repetitive, predictable, and even cliche. Oh dear, dead parents. Oh dear, gotta tell my brother I'm secretly gay (which never happens). Oh dear, dead wife. It follows way too many tropes that we seen in other romance anime, and done better. Also, the anime tries to pull you into certain stories that would be very interesting, but unfortunately, never gives us these things. Such as Misai telling his brother he's in a gay relationship. Usagi and Misaki have been in a relationship for 4 years and yet he STILL hasn't told his brother. I understand that it would be difficult since you are worried that they wouldn't accept you for you, but it's just ridiculous. And the pacing is poor. So many things are dragged out that should not be dragged out. Like Misaki accepting the fact he's gay, Miyagi realizing there's an 18 year old in love with, etc. The story isn't bad, but there needs to be some polishing. \\n\\n\r\nArt: \\n\\n\r\n4/10 \\n\\n\r\nI do like some of the colors that mix in. It gives you a good feeling of what kind of show you are watching. The backgrounds are in also quite nice. Nothing special, but nice as is. The animation itself is stilted. The characters move so awkwardly most of the time it becomes funny. The character designs are quite awkward themselves. Not to mention that the semes and ukes look the same. Season 3 does fix the animation making it more colourful and less awkward, but still a little funky looking. Not terrible, but needs some fixing up. The facial expressions on Misaki are really good though.  \\n\\n\r\nSound: \\n\\n\r\n4/10\\n\\n\r\nTakahiro Sakurai, the voice of Misaki, is wonderful. His performance is real for all 3 seasons. He is having so much with the role it's just beautiful. It's so enjoyable. Everyone else does great as well. The voices match the characters well. The soundtrack, however, is bad. Maybe it's just my taste in music, but it's bad. The openings, to me, are unbearable. They are so annoying. The ending songs are mediocre. Nothing stands out. Not bad, but not great. Really bad soundtrack, great performances. \\n\\n\r\nCharacters:\\n\\n\r\n3/10\\n\\n\r\nMisaki, even with a few redeemable qualities, is a fucking idiot. I know he's human. Humans make mistakes, but this guy is just so fucking stupid and annoying that it's just irritating. Usagi tells him a million times not to do something that would seriously hurt him. And he does it anyways even knowing the consequences. And, for some reason, every single guy that is somehow related to Usagi falls in love with him. For no reason. Why him? I don't fucking know. Usagi is abusive. He constantly throws Misaki in the car, tells him he can't go out, forbids him from calling other people, he's an abusive boyfriend. He even basically MOLESTS HIM IN EPISODE ONE. What they have isn't real love, it's lust. They have sex EVERY SINGLE EPISODE. Hiroki and Nowaki are characters I enjoy. Hiroki is a college professor who struggles constantly, and Nowaki is always there for him. He truly loves Hiroki. They are a real gay couple. They are the only realistic couple in the entire anime. They are both interesting. Shinobu is an annoying, possessive freak that no one would ever associate themselves with ever. His actions would make people run away from him in a second. If something doesn't get his way, it's like it's the end of the world I want to kick him in the fucking throat. Miyagi has no personality whatsoever. Their relationship is decent despite the age difference. I do like how their romance and relationship develop. Usagi's editor, is as useless and boring. Her only joke is getting mad at Usagi for not meeting deadlines. Everyone else is forgettable and bland. \\n\\n\r\nEnjoyment:\\n\\n\r\n5/10 \\n\\n\r\nDespite my rage and frustration, I did somewhat enjoy this show sometimes. I did still want to see what was going on. I was still interested in what would happen next as predictable as it was going to be. \\n\\n\r\nOverall: \\n\\n\r\nJunjo Romantica is a below average anime with some decent art, a few decent characters, slightly enjoyable story, but still fails with some unrealistic relationships, predictable story and idiotic characters. I still do recommend this show to people who enjoy the shounen-ai genre and aren't as critical as me. You may get to see something in the characters that I just can't. YOu many enjoy the strange art style. You may like the predictable story. Or if you want to pass time, then I guess this wouldn't be so bad. Anyone else, I don't recommend it. It still suffers from serious issues. I heard the manga wasn't much better so I'm not thrilled. Not a terrible anime, but not a good one either. That's why we have Sekai Icchi Hatsukoi, which is like Junjo Romantica, but did everything 100% better. \\n\\n\r\n4/10",
            "date": "2016-08-10T01:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 226374,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006570.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LittleTwilight",
                "username": "LittleTwilight"
            },
            "url": "https://myanimelist.net/reviews.php?id=226374"
        },
        {
            "content": "Well, i watched this anime over six times, i really love it! I also read the manga that is still airing and i'm really into it! It's sweet and always make me cry! The main character are all so funny and every time I watch this anime is better. The Soundtrack is really good, it's moving and excitingl. The drawings are a little monotone, all the characters are similar and... I don't know but they're quite... Strange, if you understand what i mean XP Anyway the plot is captivating and easy to follow. *Such a short review >< i'm sorry for my bad english...*",
            "date": "2011-12-05T08:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 48637,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/435439.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChocoLate666",
                "username": "ChocoLate666"
            },
            "url": "https://myanimelist.net/reviews.php?id=48637"
        },
        {
            "content": "This is the most popular shounenai anime of all time. Why you ask? I really don't know...probably cause it gives what the audience want! It's a long series about three gay couples with storylines that crossover eachother and the couples have sex every now and then. I know it sounds kinda dumb but that's what the majority of the fans want. Somebody was smart and decided-- people want crap, lets make crap!\r\nThe show really isn't that crappy...it's clearly a romance/drama...and that's exactly what they give us. It's the fans that are scary, people are so obsessed with this series it kind of ruined the guiltypleasure sense of it and make it look like some sort of masterpiece. It really ins't. \\n\\n\r\nBut I didn't say I'm not a fan, I love the series! But I know it isn't that good.",
            "date": "2011-11-06T21:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 46991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56334.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/neilcfreak",
                "username": "neilcfreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=46991"
        },
        {
            "content": "I think Junjou Romantica was great !\r\nIts differently something suitable for girls who love a bit of boy with boy romance.\r\nWhat i thought was great about this anime was that it wasnt one of those yaoi that consists of so much sex but actual problems that these couples had which im sure girls can relate to. \r\nI found this anime very enjoyable !",
            "date": "2008-08-29T05:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 7540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26826.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jade-v27",
                "username": "jade-v27"
            },
            "url": "https://myanimelist.net/reviews.php?id=7540"
        },
        {
            "content": "JUNJOU ROMANTICA\r\nas the title says this is a romance, comedy, Drama, and Shouen Ai(BOy Love)\r\nthis anime was one of my favorite animes it had a good plot and storyline and also it had ok episodes some i recommend skipping but you have to watch all of it AT LEAST ONCE\r\nthe main characters name are \r\nMisaki and he is in college about 18(19) he is staying in Usagi's condo(since brother moved away) and is falling in love with him he is Bold and can have trouble talkin. He is  also shy at first but later near the end of the second season admits he feelsthe same way about Usagi\\n\r\nUsami(Usagi) he is a novelist and is about an adult around 28 years old his first love was misakis older brother but when he got married Usagi fell in love with Misaki and is the one that takes action more in the couple he says i love you to misaki numerous times( he and Hiroki are Childhood friends)\\n\r\nthese two are the main couples, there episdoes are 1,4,7,8,12,13,15,17,19,21,22,23,24\\n\\n\r\nHiroki is bout 27 years old and is a professor and used to love Usami but realized he loved someone else(takahiro, Misaki's brother)Hiroki later meats  Hiroki is more shy about his feelings and has pride in his work and relationship(which gets to be a problem) He is also caring and gets angry easily which can make him misunderstand the situation(a later problem)\\n\r\nNowaki is training to be a doctor and is four years younger than HIroki and i think he is about 23\\n\r\nHe wants to work harder to make up the four year age gap between him and Hiroki.( he also works as a flower shop worker,(he meets Misaki at his job))\\n\r\nHe is more outgoing then Hiroki and is probablly the go to person in the relationships.He is jelous more often and is more romantic. He is curious to know why hiroki avoids him at first and is calmer then Hiroki He is like Usami because he is more sure than Hiroki like usami is to Misaki that they are meant to be and that he loves Him\\n\r\nTHey are my favorite couple\\n\r\nThe have many troubles and i can not tell you but if you would like to know either email me OR WATCH IT they appear in episodes 3,5,6,(9 is a sidestory on how hiroki met USami and how he first thought he was falling for Usami)16 AND 18 \\n\\n\r\nShinobu is an 18 year old transfer student from australia he was born in Japan first. His sister used to be Myagi's wife but they divorced he later tell Myagi that he loves him at first its a love hate love hate from both people but ends up ok he is shy and outgoing and his pride makes him want to improve in Myagi's eyes.\\n\r\nMYagi is a 37 year old who falls in love with Shinobu he is a profeser and when he was drunk he made a move on Hiroki( THis is the Nowaki Jelous thing) HE and Hiroki work together as profesers(at the same college as Misaki)\\n\r\nHe fell in love with his High school teacher but shortly after she died\\n\r\nShinobu gets jelous because Myagi is still in love with her. They kiss a couple of times but are not shown in much episodes only 10,11,20 it is my least favorite couple \\n\\n\r\nOverall This Is one of my MOST FAVORITE ANIME its AWSOME IT HAS TWO SERIES I mAY REVIEW THE SECOND ONE BUT REALLY IT IS FROM EPISODes 13-24 so i included some of it in this review sorry but WATCH this anime at i think animeseason.com has all the episodes and some other good animes so check it out but go to the full animes seiries list to look at them all ok \\n",
            "date": "2009-06-03T20:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 15467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/189568.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/yoruenvytoshirou",
                "username": "yoruenvytoshirou"
            },
            "url": "https://myanimelist.net/reviews.php?id=15467"
        },
        {
            "content": "So, I know I say this a lot, but I don't categorize myself as a BL fan. I'm really just in it for the good story and the fact that I am completely indifferent to the gender of the couples. \r\nJunjou Romantica, like most of the other BL's I watch, was picked up literally on a whim. I was bored with the manga I was reading and wanted a break. I have watched Sekaiichi Hatsukoi, which was done by most of the same team as JR so I figured I'd give it a shot. \r\nI found that, unlike most critiques, MINUS the Terrorist plotline, Ienjoyed JR a lot more then SH. The plots were slightly more realistic, all the gays didn't find themselves working at the exact same place, overall, more believable. \\n\\n\r\nHowever, I have a lot of gripes. First, the terrorist plot. I'm sorry but you just can not make a straight male gay like that. And do force him against all of his moral codes is fairly ridiculous. Age is a number in my eyes, but they pushed this one a bit. Second, to much sex. When only two out of twelve episodes do not include sex scenes, theres an issue. Third, I am just not a fan of how fast these characters seem to spew the word love.\\n\\n\r\nBut some of the good points were prominent. The egoist plot was one I was pleased with. Considering t showed a real gay relationship more accurately and how it would be broken down through the years. I also appreciated the fact that not every character was...I suppose the word is Tsundere? Unlike in SH where all of them found the need to play hard to get. \\n\\n\r\nThe art is fairly average all things considered and the music isn't very notable either.\\n\\n\r\nOverall, this anime was interesting enough, but it wasn't one of my favorites.",
            "date": "2011-08-29T19:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 42405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359736.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EzmierTheSwift",
                "username": "EzmierTheSwift"
            },
            "url": "https://myanimelist.net/reviews.php?id=42405"
        },
        {
            "content": "It might seem as if I'm putting in 10 in every rating, but because Junjo Romantica has certainly made me whoozy all over, I bow my head. We are all aware of the discrimination against homosexuals, but this show ignores it. Even if it focuses on a small group (i.e. yaoi fans), it has attracted many other watchers, and despite its theme, it has survived and reaches the top. The music certainly fits the anime, and sure enough, after every episode you'll be wanting for more.",
            "date": "2008-07-27T22:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 6636,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sakrash",
                "username": "sakrash"
            },
            "url": "https://myanimelist.net/reviews.php?id=6636"
        },
        {
            "content": "Junjou Romantica Review\r\nStory: 6/10\r\nArt: 7/10\r\nSound: 9/10\r\nCharacter: 7/10\r\nEnjoyment: 9/10\r\nOverall: 8/10\r\nUrgh.....hmm....hrm....hnnnnng....\r\nUgh...I want so badly not to like this anime.  I really do.  I just can't bring myself to dislike it though.  \r\nStory: 6/10\r\nThe story is....there.  It's not fantastic, it's not dreadful, but it's there.  It's also rife with shonen-ai/yaoi clichés, so if you can't get past that, I wouldn't recommend it.   In no way, shape, or form is the story believable or realistic; don’t dive in thinking anything that happens here could ever happen in reality.  You watch this genre for the fluff and pretty boys, not because youwant a realistic depiction of romance.\\n\\n\r\nArt: 7/10\\n\\n\r\nIt's good, but not great.  It isn't this over-the-top, hyper-detailed animation, but it gets the job done.  My chief complaint about it would have to be how a good majority of the characters look almost exactly the same.  Just look at any given picture with more than one of the semes/ukes in it.  I mean...you've got all the face and eye shapes in the world, and you give all the semes the same one and all the ukes the same one (minus Hiroki's eye shape--it's the only thing that really distinguishes him from the other two ukes).  Not only does this feel lazy, it can also make things pretty confusing.  For example, Misaki's friend Sumi looks an awful lot like Akihiko.  Miyagi looks an awful lot like Nowaki.  Shinobu looks an awful lot like Misaki.  It can get confusing pretty fast if you're not good at remembering their names.\\n\\n\r\nMy only other real complaint about the art is the constant use of \"side-mouth.\"  I know this is present in a LOT of animes, but I just found it really jarring in this one.  This probably has to do with the profuse amount of close-up shots on the characters' faces; it makes it infinitely more noticeable.  I found myself staring at the characters' mouths a lot when they were talking during these shots.  I know this isn't a big deal to some people, and I know how hard it is to animate mouths from a profile view, but it just drove me nuts, so I figured I'd point it out.\\n\\n\r\nSound: 9/10\\n\\n\r\nThe opening theme is boss.  Best opening I've ever heard for a shonen-ai/yaoi anime.  It's so much nicer than the typical \"cutesy sugar-pop\" style openings that plague this genre.  It actually caught me off-guard when I was watching the first episode—I had expected something much….softer and super “kawaii.”  I can’t emphasize how much nicer it is than a typical opening for this genre though.\\n\\n\r\nThe background music was nice and appropriate for the situations—nothing spectacular, nothing bad.\\n\\n\r\nI really enjoyed the voice acting; the characters’ voices were fitting and believable.  Misaki’s in particular was my favorite, but I enjoyed the others as well.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nI grapple really hard with the characters in Junjou Romantica.  On one hand, they’re really the only reason I kept watching the show.  On the other hand, they’re one of the biggest gripes I have with the show.  They’re very copy-and-paste.  There aren’t any particularly unique characters—they’re all kind of your standard boy-love fodder.  The ukes are shy and goofy; the semes are straightforward and serious.  If it weren’t for the situational differences, you’d basically be seeing the same couple in all three stories.\\n\\n\r\nI also have trouble with the fact the semes don’t seem to understand “NO” all that well.  This is a hugely common theme for this genre, and I personally wish it would stop, or at least ease up a bit.  There’s something seriously wrong with this formula.  \\n\\n\r\n“I love you!  Let’s kiss and have sex!”\\n\\n\r\n“No!”\\n\\n\r\n“Don’t worry, you’ll warm up to it once I pretty much force myself on you!”\\n\\n\r\n“Oh hey, you’re right!  I’ll still say ‘no’ again next time, and you still won’t listen, but that’s okay because you luuuuurve me!”\\n\\n\r\nNo.  It’s not okay.  I understand that it’s a semi-believable situation (only in that one of the characters is saying “no”), but it happens literally every single time Misaki and Akihiko become intimate (which happens often if you watch both seasons).  The dude said no, quit grabbing his wrists and pushing him onto conveniently nearby couches and beds.  Since this is entirely fiction and no one is actually getting hurt, the only real problem with it is the fact that it’s being romanticized.  Persisting after someone says “no” three times is not romantic.  It’s not cute, it doesn’t show devotion, and it’s not in any way a good thing.  Personally, I don’t find this particular aspect “offensive”; it’s more of an annoying, over-used trope to me.  I just think it’s important that more impressionable/younger people watching this (while I know this isn’t a series for a young audience, we all know younger teens are watching it) are aware that this is not how a healthy, happy relationship should work.  At all.  Ever.  Under any circumstances.  No means no.\\n\\n\r\nAlong with that, I found myself wishing the couples were more…mutual.  A lot of their interactions feel one-sided, with one half being pushy and into it, and the other being either indifferent or resistant.\\n\\n\r\nSo why, after all that whining, did I still give the characters a seven?  Honestly, the character interactions.  Misaki is adorable and his reactions to various situations were entertaining and funny enough to keep me watching.  The genuine, sweet moments between the couples are very cute, though I do wish there were more of them.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nDespite all my qualms listed above, I really did enjoy this anime.  I hate myself for it, but I really loved it.  It’s adorable and funny, and I’d consider watching it again.\\n\\n\r\nOverall: 8/10\\n\\n\r\nTLDR: All in all, I would recommend this anime to someone who’s already a fan of the genre.  The story and characters are cliché, but it’s still charming and funny.  If you can’t get past the tired story formula and less-than-original characters, I’d say pass on it.  I enjoyed it for what it was—a goofy, overdone story about boys who like (or refuse to admit they like) boys.\\n\\n\r\nAlso, I cannot emphasize enough to younger viewers of this anime—the couples in this show are NOT good examples of healthy, realistic romantic relationships.  Please keep that in mind when watching this.  Life does not work this way.  Things don’t happen like this.\\n",
            "date": "2014-06-12T15:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 146801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3824527.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/R1VET",
                "username": "R1VET"
            },
            "url": "https://myanimelist.net/reviews.php?id=146801"
        },
        {
            "content": "Basically, I like the fact that the anime is sticking true to the manga as much as possible as not many manga-turned-animes do that. Although they did make some changes, it wasn't drastic. I do wish they showed some parts of the manga, though (but since it didn't have anything to do with the main plot, it's fine, I guess).\r\nMy main problem is in the manga-art, so I won't say it here. But [un]like most other yaoi animes, this is censored, so it's nearly safe. The story overall is great. Though cliche, they did have some changes (i.e., the seme isn't cold hearted. has asuperior complex, maybe, but very loving). Each and every episode I watched made me hooked. Even if I already knew the story, it was great to see the anime version because they did it so well that you'd understand without needing to read the manga for details. :)",
            "date": "2008-08-12T09:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 7057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85246.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mknsenko",
                "username": "mknsenko"
            },
            "url": "https://myanimelist.net/reviews.php?id=7057"
        },
        {
            "content": "Its a great BL show, love it. I've re watched this about 20 times and I can never get bored with it. But just so you know there are some... some of the charters are sometimes out of portions but over all its a great story. When your first watching it, it can get confusing when they switch character plot lines. Also so you know if you want to know what happens you have to read the manga because they stop this show at season 3. I would highly recommend if you want to watch boyXboy love. \r\nI have nothing else to say just amazingshow.",
            "date": "2017-01-08T12:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 237791,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5964352.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MYanimeBOO",
                "username": "MYanimeBOO"
            },
            "url": "https://myanimelist.net/reviews.php?id=237791"
        },
        {
            "content": "I didn't know what to expect going into the show, but what I discovered had me in stitches most of the time. The dialogue went well with the camp elements of the storyline. The characters made me smile in spite of myself. The only thing I disliked about the show was the artwork, though I have the sneaking suspicion this was a deliberate act on the part of the artist/author.",
            "date": "2011-10-07T02:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 44995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482950.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/keikomushi",
                "username": "keikomushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=44995"
        },
        {
            "content": "The longest romantic yaoi series, this one has been really popular. It's basically the story of three gay couples and all of their ridiculous problems with communication—not so much how they get together as how they stay together.\r\nUnfortunately, two of the three couples follow those annoying anime-yaoi rules, i.e. rich and tall seme, childish uke, psuedo-rape is okay, even the gay characters acknowledge that being gay is not normal, etc. The lead couple, Misaki and Usami, and the third couple, Miyagi and Shinobu, are at times cute and at times creepy because of this.\r\nSo don't watch it for them! Watch it for the hilarious relationshipbetween older, grumpy professor Kamijou and idealist medical student Nowaki. They defy most of the stereotypes and are very enjoyable to watch.\\n\\n\r\nIt's pretty interesting how the characters' paths cross randomly, and some of the little details are really cute and self-deprecating (like how Usami is trying to relive his childhood by strewing teddy bears across the apartment, Usami's shadow profession as a BL writer, the recurring wooden bear carvings).\\n",
            "date": "2010-10-03T16:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 31049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=31049"
        },
        {
            "content": "I just stumbled on this genre of shounen ai and I am really enjoying it even though I am a girl.\r\nI really hope they are making more seasons.\r\nUsagi san is sooo hot. Him and Misaki make such a cute couple and their relationship give you butterflies...",
            "date": "2010-03-15T14:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 24013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/keshniru",
                "username": "keshniru"
            },
            "url": "https://myanimelist.net/reviews.php?id=24013"
        }
    ],
    [
        {
            "content": "This was the first Yaoi i ever watched, and you know being a girl and stuff people expect you to like it, but I never really got into Yaoi even though my friends were always ranting and raving about it.\r\nHonestly i love it, more so because the love stories were just stunning, and the sex scenes were just as great. It was a great balance of lust and love and overall craziness. Especially because of the fact its three couples instead of just one or two things get tangled together, and you can see how all the puzzle pieces fit. \r\nAll in all I candefinitely say this anime is worth the watch.",
            "date": "2014-04-22T10:26:00+00:00",
            "helpful_count": 0,
            "mal_id": 140941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3692533.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RoseContra",
                "username": "RoseContra"
            },
            "url": "https://myanimelist.net/reviews.php?id=140941"
        },
        {
            "content": "i think people can't forget their first love since they dwell much of their time to their special someone that at times they forgot their own happiness. At the right time, you will meet someone the least you expected, but in the end, you yourself will discover that he/ she is really for you. Your fated one.\r\nAs the story goes, you will find a lot of revealing stories about the 3 couples in which you will discover how their lives are being linked together.",
            "date": "2009-10-08T18:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 19508,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/chui13",
                "username": "chui13"
            },
            "url": "https://myanimelist.net/reviews.php?id=19508"
        },
        {
            "content": "Junjou Romantica was the first yaoi I ever watched. It is still my favorite to this today. The characters are adorable, and everything is very well drawn. It has 3 cute story lines that all pull together wonderfully. Each character is very unique and memorable. The voices are great, I especially love Usami's. ;) It's fun, it's cute, it's romantic, it's funny, and even has a lot of sexy scenes! Yes, Junjou Romantica is funny. There are many jokes scattered throughout the series. I often found myself laughing out loud while watching it. The series really touched me as well. I found myself crying atthree scenes (which I will not disclose, as to not spoil it for those reading!) ;) Although I must say I cried the most when the series was over. Since it ended I have gone back to watch it numerous times. For some reason, there's just no other yaoi in my opinion that can ever beat Junjou Romantica. It's absolutely everything I look for in a yaoi, and it was the first one I stumbled upon to boot! Cute bishounens, humor, romance, sex (though they don't show anything, it's still hot,) and more. Infinity stars for Junjou Romantica! If you haven't watched it yet, you must! You won't regret it! ;)",
            "date": "2009-08-20T22:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 17950,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/223773.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lexiSTAR",
                "username": "lexiSTAR"
            },
            "url": "https://myanimelist.net/reviews.php?id=17950"
        },
        {
            "content": "This won't be long or very descriptive, however I have to admit - despite being an overly fussy person when it comes to my anime, I thoroughly enjoyed this series.\r\nWhile some of it is greatly lacking, for some reason (most likely just personal taking to it) I found it to be a great series & very addictive. I found myself staying up late to watch it. The romance is decent, it has a fair bit of humor & it's just a bright & for the most part cheery anime full of all the cute crap people can muster.",
            "date": "2011-08-08T10:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 40991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266874.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/arlen",
                "username": "arlen"
            },
            "url": "https://myanimelist.net/reviews.php?id=40991"
        },
        {
            "content": "*I'm not a big fan of manga so I know I've watched a good anime after I plan to read it's manga where the anime left off just to get more of the story.\r\nI watched Jonjou Romantica a bit differently. According to the couples, I watched the Romantica episodes first, then the Terrorist, following by the Egoist episodes. For me, it made the stories easier to follow and that much more enjoyable. I loved being able to recognize a conection between the 3 couples such as Miaski purchasing flowers from the Egoist couple's Nowaki. The first time I started watching Jonjou Romantica(season 1) Iloved the Romantica couple but when they started pulling these other couples out of know where I became disinterested and the idea of skiping around didn't occor to me. I eventually gave the series another try and I'm very glad I did. \\n\\n\r\nI was pretty skeptical for this being my first time watching a Yaoi but I think I enjoyed it as much as I would or maybe more any other anime. I easily really got attatched to each couple which is probally why I liked it so much. Regardless of how unsightly a plot can be if there are good characters it cancels it out. Although it wasn't nessisarily the case here. There was a probally in mostly every episode which usually tugged at my heart and be kindly resolved at the end which I'm greatful for, if I care about the character I need a happy ending. \\n\\n\r\nIf you aren't ecspecially tollerent with this show like I was, you'll probally dislike how each couple basicly has the similar sort of same problems/plot but for me, I was okay with it. What I wasn't okay with is how annoying some of the tsundere were, always denying how they felt and pushing the one they love away with their always angry faces, geez. In the case, the character development must've been was REALLY good so it made up for it. Even the tsundere were still characters I loved characters.\\n\\n\r\nThe art; Eh, my only complaint about it is that most of the characters looked too much alike which might turn someone off from this anime because of getting confused. But each character was drawn very good looking, I must say. I liked the way they potrayed the comedy scenes as well.\\n\\n\r\nI even took me a long time to get through one episode because of how many scenes I kept replaying. Jonjou Romantica was a really good time for me, as was season 2.",
            "date": "2012-06-19T02:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 63791,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332867.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Wuddupashley",
                "username": "Wuddupashley"
            },
            "url": "https://myanimelist.net/reviews.php?id=63791"
        }
    ]
]