[
    [
        {
            "content": "This anime. Or rather, this copy-paste formulaic anime adaptation of the light novel that apparently was voted #1 in the Japan’s Kono Light Novel ga Sugoi! for 2017 made me wonder if the anime industry even tries anymore. It’s 2018 and here we are, an anime adaptation based on shogi with a cast filled with questionable characters and content. I was cautiously optimistic about this show at first but upon finishing this anime, I can say that without a shadow of a doubt, Ryuunou no Oshigoto left little more than desired.\r\nSometimes, people say don’t judge a book by its cover. Unfortunately, that statement is hardto apply for this series. Upon looking at the key visual, you’ll notice an average dull looking male protagonist surrounded by what seems to be a harem of girls. No, I’m not calling this anime a harem but it doesn’t help by the fact that some of them look about half his age. Still, there’s some hope because the show involves shogi, a strategic game of intelligence, right?\\n\\n\r\nWrong.\\n\\n\r\nThe story itself may be focused on shogi but the overall tone of the show will be far distracting than you’ll realize. The first few episodes can easily rub people in the wrong way with the way its characters are introduced. The main culprit is 9-year old Ai Hinatsuru who seems to have an attraction towards shogi master Yaichi. It leaves a controversial impression especially with how she reacts to him when other girls are involved in their lives. After being taken in as disciple, she seems to be even more attached to him to the point where you’ll see “yandere” moments. That’s just the tip of the iceberg though. We also meet Ginko Sora, a female prodigy who also happens to be Yaichi’s childhood friend. I think it’s easy to pinpoint her intentions after watching her reactions from just the first episode alone. Nonetheless, the initial beginning will test the audience on whether they should continue or not. For me, I decided to give this show a chance to see if it improves. Sadly, I’m mistaken.\\n\\n\r\nIt seems almost every episode along the way wants to showcase shogi but also leaves the impression of underage girls doing what a grown up would do. Is that an overstatement? However, it’s undeniable that the show gives an uncomfortable feeling whenever characters such as Ai, Charlotte, or others tries to get Yaichi’s attention. Yaichi himself is hardly an interesting character either. The show saturates him with a generic personality and gets him often into compromising positions, either with his disciples or Ginko. It doesn’t help that he is dense as a black hole and the show never really develop him as a character. Speaking of development, the show is mostly void of that except on technical improvement of shogi skills. The only character that I respect in this anime would be Keika Kiyotaki. In perhaps one of the more realistic and heartwarming episodes, we see her determination and strive to improve. The storytelling of her past also make us understand Keika as a person and shogi player. Unfortunately, one episode can’t carry the show as altogether as the others are far less welcoming to watch.\\n\\n\r\nNow I’m not an expert on shogi but this anime seems to dedicate a lot of time in the matches themselves. One might think this is a positive but it’s hardly that. The mind games and psychology is hardly felt because of the way dialogue are delivered. It doesn’t help that the show often jumps around between opponents without giving the audience a memorable rivalry. Furthermore, the main cast is just incredibly one dimensional with personalities that are hardly interesting. If you want some actual shogi with integrity and promising story, check out 3-gatsu no Lion.\\n\\n\r\nProject No.9 is an oddball studio. My impression of their work in recent years has quite underwhelming and it seems that they didn’t manage to step up to the plate this time. On paper, the anime quality looks tolerable with the body movements, character designs, and facial expressions. However, there’s not much else that makes this anime’s visual quality stand out. Sure, there’s character reactions that can be comedic at times but it gets tedious fast. You can pretty much open up a light novel and see similarities in almost every series these days. It doesn’t help that the anime pulls out fan service moments that set off red flags. Oh and Yaichi, he has a very punchable face.\\n\\n\r\nOn a more positive note, I suppose the anime’s soundtrack and voice mannerism managed to stay its welcome. Younger characters aren’t easy to portray but I got the impression that it was well delivered. Ginko’s voice is perhaps the most noticeable whenever she gets into a bad mood. On the other hand, I wish there was an auto-mute button whenever Yaichi talks in overly long dialogues. The theme songs of the show are rather catchy despite how generic it looks.\\n\\n\r\nIf I said it once, I said it a hundred times. This show leaves little to be desired. You can watch this anime for the shogi but in the end, you’ll probably remember more than that. And I don’t mean that as a positive impression. One character I will actually remember for good measure though is Keika. I prayed the show would develop her more but it seems the anime decided to take steps back after that one memorable episode. For what’s worth, watch this anime with caution if you choose. It honestly became a show that gives shogi a bad name.",
            "date": "2018-03-26T06:14:00+00:00",
            "helpful_count": 84,
            "mal_id": 275146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=275146"
        },
        {
            "content": "Please note this review assumes that you have finished watching Ryuuou no Oshigoto and while care has been taken to minimise story related spoilers there may still be spoilers within character analysis. You have been warned. \r\nLearning to value the bonds that a master and disciple make while playing Shogi with Ai and friends\r\nBased off a well-known light novel series of the same name Ryuuou no Oshigoto or its English title which is the Ryuo’s work is never done gives us the opportunity to look into the world of Shogi from not just a player’s perspective but also from a master’s perspective as they trainprospective students to enter the often-overlooked world of competitive shogi. It does this by introducing us to the Osaka Shogi scene and the many people that are connected to it which includes among their number powerful Shogi players as well as prospective shogi players who wish to enter the world of shogi for many varied reasons. The first episode of the series made a pretty impression on me largely due to the demonstration of the main heroine Ai Hinatsuru’s skill at shogi despite her young age. While wary of the many bad impressions that people had on the premise of the show I kept the show on my watch list and looking back at it I'm glad that I did as I really enjoyed this show. \\n\\n\r\nTaking place within the modern era within the city of Osaka and the surrounding areas Ryuuou no Oshigoto’s overall story follows the life of Yaichi Kuzuryuu a 16 year old teenager that despite his young age is already an accomplished shogi player who had just won the coveted shogi title of Ryuo and his encounter with Ai Hinatsuru a  9 year old elementary school girl a prodigy at shogi who had come seeking to become his disciple. As Yachi and Ai becomes master and apprentice and enter the Osaka shogi scene he soon begins to appreciate the unique skills that Ai has and how they can be used to both introduce new talent to the Osaka shogi scene while at the same time improve his own skills as they both confront the unique challenges that both title holders and beginners in the world of competitive shogi face. Along the way, Yachi and Ai would encounter many varied and interesting characters in their journey to improve their skills in Shogi. These include Ginko Sora Yaichi’s fellow apprentice who is as beautiful as she is skilled in Shogi, Ai Yashajin a rich and arrogant girl from Kobe that possesses skills equal to his disciple, Keika Yaichi’s fellow apprentice and his masters daughter who is determined to break into the league before time runs out and Ika a title holder that approaches Shogi with arrogance and seeks only to beat opponents relentlessly to satisfy her ego. \\n\\n\r\nYaichi \\n\\n\r\nYaichi Kuzuryuu voiced by veteran voice actor Yuuma Uchida of Classroom Crisis fame is one of the main characters of the series and is the main protagonist of the series. Despite his young age, Yaichi is already a veteran shogi player and a newly christened title holder having managed to secure the coveted title of Ryuo and becoming the youngest player to achieve that title in history. A 16-year-old teenager Yaichi is a kind, polite and considerate person that on first impression did not really fit the image of a pro shogi player and indeed more like a normal teenager. While kind and polite in the beginning Yaichi was also seen to be someone that was also understanding and patient and treated everyone with respect and dignity whether they are surprise gatecrashers or fellow shogi players. Having played shogi since childhood it can be seen that Yachi is someone that views the sport as something sacred and treats it with the utmost respect and as a result dislikes people that either dismiss it as a game or those players that treat their matches badly as he feels that they are not respecting the sport if they don’t play it seriously. While appearing indecisive in the beginning Yaichi was also someone that was noted to be intelligent and fast thinking and was the type of person that researched his opponents seriously to come up with countermeasures that show his determination to pay respect to both the game and to his opponents. While noted to have a great deal of pride at the beginning Yaichi true to his kind nature was also noted to be someone that was not just perceptive but also intelligent enough to realise the error of his ways and admit to the mistakes that he had made. \\n\\n\r\nAs the series goes on and as events allow him to meet both Ai Hinatsuru as well as Ai Yashajin Yaichi’s personality gradually starts to change as the series progresses. At the beginning of the series as a result of his slump, Yaichi was noted to be someone that had low self-esteem that was only held back by his positive attitude and passion for the sport and worked only to secure a victory to silence his many detractors. This however changed after his encounter with Ai Hinatsuru. While initially sceptical of Ai given how she just suddenly appeared in front of him this opinion of her gradually changed after seeing the level of skill that she had skills that were every bit as equal to his own despite the lack of training and actual playing experience that she had. As a result of seeing the level of skill that she had as well as seeing her earnest desire to become his disciple Yaichi’s core focus soon changed to one that revolved around the training of Ai as his disciple and raise her as a pro shogi player that will be able to make full use of the talent that she had. While somewhat reluctant at the beginning due to the many opinions that people had about him and Ai as the series goes on this reluctance gradually disappears and is replaced by his desire to teach her carefully and calmly showing his determination to fulfil this promise. While somewhat reluctant and embarrassed to be associated with Ai at first this feeling gradually transforms to that of pride at having someone as skilled as her as his disciple and is something that Yaichi makes use of as his main source of motivation as the series goes on. While positive and calm on the surface Yaichi in the series also faced a number of problems that were unique to him. At the beginning of the series while Yachi had great skill he was also rather unimaginative with his tactics and as such was looked down by many people and his victory over the previous Ryuo was widely seen as a fluke. While dismissing them as harmless it can be seen that beneath the surface these sentiments affected him greatly. As the series progresses and Yaichi encounters first Ai Hinatsuru and later Ai Yashajin this feeling of inferiority starts to decrease as he upon seeing both their skills at shogi develops a motivation to improve his skills not just to improve his standing within the shogi world but also to be a good master to them. Yaichi’s most prominent trait is without a doubt his desire to not see Shogi as just another competitive sport but also a sport where his disciples can be good at and enjoy while respecting other players. This aspect of him I particularly liked as it showed how much he loved and respected the sport. \\n\\n\r\nAi Hinatsuru \\n\\n\r\nAi Hinatsuru voiced by veteran seiyuu Rina Hidaka of SAO and Accel world fame is one of the main characters of the series and is the series main heroine. A 9-year-old girl that’s still in elementary school Ai is on first appearance a quiet and nervous girl that nonetheless tries to project a cheerful attitude to mask it. After overcoming this it can be seen that Ai is also someone that is polite and well mannered and is also someone that is intelligent and fast thinking while also having a strong spirit that refuses to admit defeat. These three latter traits however can be said to be the ones that truly define her as they help form the foundation of Ai’s most prominent skill which is her skills as a shogi player. From the beginning of the series, it can be seen that despite her young age Ai was noted to have an unusual amount of skill when it came to shogi and indeed can be seen to be a prodigy at that sport that is shown best in the first match that she had with Yaichi. In this, it can be seen that while only adept at the basic moves at first Ai’s real skill that continues to improve as the series goes on is her ability to enter into a focused state where she can focus her concentration on reading the shogi board and plan out her moves before they can be made. This type of ability while far from being non-existent is usually possessed by veteran players of the game who have had hundreds of matches under their belt and as a result, seeing a 9-year-old girl have this same ability is indeed something that can be said to be most unusual indeed. In line with this ability is another of Ai’s impressive traits which is her flawless memory which is her ability to remember every move and shogi problem that she had made or solved. When combined with her ability to enter into a focused state the level of ability that Ai has while certainly unrefined at first is nothing short of astounding and ensures that the title of shogi prodigy is an apt title for her. \\n\\n\r\nWhile Ai and Yaichi had the most unusual of first encounters as the series goes on it can be seen that Ai views her master with both admiration and respect and it can be seen that being his disciple is something that she had aspired to do since their first meeting. As a result of this level of admiration for her, master Ai is someone that is noted to have a great deal of pride on being recognised as his disciple and dislikes it when she has competition for this important role. True to this act Ai is shown to be very loyal to her master and will come to his defence at once if someone slanders him something that I felt was admirable of her. As the series goes on it can be seen that Ai’s feelings towards her master is something that easily exceeds that of a normal master-disciple relationship that can be seen in her attempts to please her master and her reactions when she see’s him with other girls. In this side of her, it can be seen that Ai is very conscious of her master’s actions and she can easily tell if he’s hiding something from her through her boosted perception skills something that I find quite hilarious as nothing beats seeing Yaichi being pinned to the wall by Ai’s glare. As the series goes on and as Ai and Yachi’s relationship improves it can be seen that Ai has begun to be more perceptive of the feelings and moods that Yachi projects as a result of the bond that they share and as a result she can feel both joy at seeing her master when he’s happy as well as feel disheartened when she see’s him in pain. This level of perception, however, is a doubled edged sword as while the former can make Ai’s determination to win and fight tenaciously to the end it can also have the opposite effort of affecting her morale and concentration when she senses the bond between her and her master weakening. The character of Ai Hinatsuru I felt was an interesting one as though she’s off a relatively young age the level of maturity that she has as well as the level of skill that she has in Shogi was very impressive. Despite the level of players that she has to face in her journey to become a pro player her determination to face them head on to both prove her skills and his masters trust in her was very admirable. I felt that her seiyuu Rina Hidaka really did a fantastic job at portraying the character of Ai Hinatsuru. \\n\\n\r\nGinko \\n\\n\r\nGinko Sora voiced by veteran seiyuu Hisako Kanemoto of Food Wars and Gunslinger Strato’s fame is one of the main characters of the series and is both Yaichi’s fellow shogi apprentice and fellow shogi title holder. A 14-year-old Junior high school student Ginko despite her young age is like Yaichi a fellow title holder in Shogi that also commands a lot of respect within the community due to her impressive win record against her fellow female pro shogi players. Unlike Yaichi no one denies the skills that Ginko has in Shogi and while she has many titles to her name it is the nickname that her fans gave her that truly make her stand out over her other titles this being the Snow White of Naniwa which is a somewhat ominous nickname.  A childhood friend and fellow shogi disciple of Yaichi Ginko has the unique position of being both a childhood friend and a senior disciple of Yaichi which also makes her somewhat of a mentor to Yaichi as well. As a result of this, it can be seen that Yaichi pays her a lot of respect in deference to this role. A quiet, blunt and confident young woman by nature Ginko is someone that’s shown to be a very determined and highly motivated person that has a strong will to succeed in everything that she does. While quiet by nature and indeed not one for small talk Ginko is shown to be someone that prefers a more direct approach to things seen both in her matches in shogi as well as in life. While conscious of the fame that she has managed to achieve within the shogi world Ginko is shown to be a modest person by nature and will respect those that have played the best they can against her whether she likes them or not. \\n\\n\r\nAs the series goes on however Ginko’s personality starts to gradually change. At the beginning of the series, Ginko was noted to have a very icy personality especially when she deals with Yaichi and in which she’s noted to treat him rather harshly irrespective of the actions that he may or may not have done. This is especially true when she interrogates him for information when she determines that he’s hiding things from her. In this however we can see that the relationship between the two of is not as simple as it sounds as more than anything its obvious that Ginko sees Yaichi as more than a friend and fellow disciple and instead see’s him as something of a rival that can be relied upon to help each other when one needs help in shogi as well as let off steam by playing each other relentlessly. In this, despite the disparity between them in terms of titles, it can be seen that Ginko see’s Yaichi as a rival that’s superior to her in shogi and it is this desire to match Yaichi that truly acts as her core motivation to do well in Shogi. While Ginko, in the beginning, was quiet and somewhat blunt she was also shown to be rather assertive with her demands on Yachi but at the same time, she was also shown to have a rather mischievous side to her personality as well a contrast that I felt was interesting. While shown to be near expressionless in the beginning as the series goes on It can be seen that Ginko was someone that was also very loyal to her friends and was someone that easily got upset if their actions caused them distress a side of her personality that I particularly liked as it contrasted well with her Tsundere personality. This is best shown in her attempts to help Yaichi face his problems during his crisis during the Ryuo title match and her subsequent reaction when she was rebuffed by him. As the series goes on it can be seen that Ginko has a rather interesting complex in which she dislikes being seen and treated as a girl by others and can easily get embarrassed if she has to wear clothing that is typically associated with girls. This side of her personality was an interesting one as her behaviour when she’s in this mode is very much like a cute girl as she acts embarrassed and blushes openly rather than her usual icy Tsundere look. While harsh and violent towards Yaichi most of the time it’s interesting to note that even she has a softer side to her that she will show when she tries to help friends that are in a tight spot. The character of Ginko I felt was an interesting one as though she was Yaichi’s fellow disciple she was also his mentor and it can be seen that both rely on each other to improve their skills at shogi. The contrast between her personality with that of Ai and Yaichi I felt was interesting as it highlighted the fact that while they may have different personalities and approaches to shogi they are all united in their determination to play shogi and respect both the game and their opponents in doing so. I felt that her seiyuu Hisako Kanemoto really did an excellent job in portraying the character of Ginko. \\n\\n\\n\r\nAi Yashajin\\n\\n\r\nAi Yashajin voiced by veteran seiyuu Ayane Sakura is one of the main characters of the series. A 9-year-old girl from a rich family that lives in Kobe Ai Yashajin on initial appearance is an arrogant and self-confident young girl that in the beginning tended to look down on others and was the complete opposite to Ai in terms of personality. While arrogant and possessing boundless confidence in herself Ai Yashajin was also noted to be a cynical person that had a lot of pride in her skills as a shogi player despite her lack of actual combat experience in the beginning and was also fiercely competitive regardless of who her opponent was. Despite that Ai Yashajin was also noted to have a teasing and malicious side to her that she makes use off when she feels the situation calls for it a side that I felt complemented her arrogant personality pretty well. Indeed, from the onset it can be seen that while Ai Hinatsuru has the image of a cute angel Ai Yashajin was the opposite and instead having the aura of a demon as in the beginning she got angry very easily and fought with great tenacity in her matches even when the tide has turned against her. \\n\\n\r\nAs the series goes on however Ai Yashajin’s personality gradually changes as a result of not just meeting Yaichi but also seeing what the shogi world really was like. In the beginning of the series as a result of learning to play shogi through both self-taught materials as well as her parents records and notes Ai Yashajin while having the basics of shogi locked down was noted to have no actual combat experience in the real world and as a result of this often fell into traps when faced with opponents that make use of unconventional tactics. This shows that while she has the basics locked down she was lacking in the ability to read people’s moves and intentions which like in all board games is of great importance. As the series goes on this weakness of her’s gradually vanishes. While still tenacious and unwilling to give up Ai Yashajin gradually gets better at both reading the board and of people greatly improving her chances of victory. While Ai Yashajin as the series goes on generally retains her arrogant nature it can be seen that this attitude of her’s gradually softens as she learns to enjoy playing shogi with others and learn that shogi is not just about playing to win against her opponents but also to make connections with like-minded people while enjoying testing your strength against theirs. While Ai Yashajin and Yaichi did not have the best of first encounters and indeed she at first looked down on him at first this gradually changed as the series went as she was able to see the great effort and attentive care that Yaichi put in to help her understand the knowledge that she would need if she wanted to enter the shogi world and make a name for herself. As a result of this Ai Yashajin’s attitude towards Yaichi gradually changed and she soon learned to both respect his skills at shogi as well as the fact that he treated her like a normal person and did not let her status stop him from treating her bluntly if she did not get anything that was taught. The character of Ai Yashajin I felt was an interesting character as in addition to being polar opposites to Ai Hinatsuru in terms of shogi tactics Ai Yashajin was also every bit the opposite in terms of personality. The gradual thawing of Ai Yashajin’s personality from a withdrawn Tsundere that only played shogi to remember to one that had found that playing shogi in the real world while more punishing was actually more fun and challenging I felt was something that was well done and made great use of one of the series main themes which was that only by playing together would one be able to improve their skills while enjoying the game. I felt that her seiyuu Ayane Sakura really did an excellent job at portraying the character of Ai Yashajin.  \\n\\n\r\nKeika \\n\\n\r\nKeika Kiyotaki voiced by veteran seiyuu Ai Kayano of 3 Gatsu no lion and Anohana fame is one of the main support characters of the series and is both Yaichi’s fellow shogi disciple and the daughter of his master. A young woman in her mid-twenties Keika is a kind, caring and thoughtful person that’s also considerate and understanding of others. In this, it can be seen that Keika fits the very image of a big sister within the shogi family that Yaichi, Ai and Ginko belong too. Unlike Yaichi and Ginko Keika is not a title holder and indeed not a pro player as well and is instead she like Ai is a shogi trainee that hopes to be able to pass the training course and become a pro player. \\n\\n\r\nAs the series goes on and as Keika’s personality is gradually revealed to us it can be seen that Keika has her fair share of problems that are worrying her that she tries to hide from her fellow shogi family members. While positive and relaxed on the surface beneath this it can be seen that Keika struggles greatly with the fact that despite the shogi skills that she had inherited from her father as well as through practice with Yachi and Ginko she hasn’t been able to make much headway with her dream of becoming a pro player while her fellow family members Yaichi and Ginko had gradually overtaken her and achieved fame within the world of shogi something that she punishes herself for. As a result of this, it can be seen that Keika is rather desperate to achieve her dream as unlike Yaichi and Ginko Keika also has to contend with the duo pressure of reaching the age limit and being dismissed from the training class due to defeats. As the series goes on Keika’s fortune and luck eventually changes and makes her realise that while having the pride of being from a famous shogi family was a good thing letting that constrain you and force you to punish yourself was not and that one should be able to walk the path that they want too without forgetting their roots. The character of Keika I felt was an interesting one as despite being happy and positive beneath the surface Keika is, in fact, someone that wrestles with a lot of struggles that are unique to her. This contrast in her outer and inner self I felt was especially well done as it allowed us to see the struggles that older shogi players may feel as they struggle to break into the pro players league while having to battle not just opponents that are not just younger than they are but also more skilled that they are. \\n\\n\r\nIka \\n\\n\r\nIka Sainokami voiced by veteran seiyuu singer Haruka Tomatsu of Sword Art online and Asura crying fame is one of the main support characters of the series and is a fellow female pro shogi player to Ginko. A young teenage girl Ika is an arrogant, self-confident and menacing opponent that has the traits of a classic egotist. True to this personality type Ika is someone that cares little about either her opponent or manners and indeed seems to live only to crush her opponents relentlessly and use this to gain even more power and improve her skills. As a result of this, it can be seen that Ika is someone that hates weak opponents and would slander those that she considers weak as she see’s them as someone that’s not worth her time at all. As the series progresses it can be seen that Ika’s view of Yaichi is an unusual one in that she views him as more like an object than a person one that she only wants to herself and one whose only purpose was to play shogi with her to her heart's content. The character of Ika while introduced rather late in the series I felt was an interesting character as more than ever she represented a strong and fearsome opponent to both Ai and Yaichi in more ways than one that they had to overcome if they wanted to progress in their journey.\\n\\n\\n\r\nAmv \\n\\n\r\nAnimation wise I felt that the series did a very job at showing the main setting of the series which was the city of Osaka and the various locales that the city had. The character designs for the series I felt were also well done and were faithful to their light novel counterparts to which I'm thankful. The animation for the moves that the characters make during the matches as well as the animation for the matches themselves was something that I felt was well done and it made it easier to see the significance of each move as well as how it impacted on the match as well.  In terms of voice acting overall, I felt that the main voice cast did an excellent job of portraying their assigned characters. In particular, I feel that Rina Hidaka, Ayane Sakura, and Hisako Kanemoto deserve special praise as I felt that they did an excellent job of portraying their respective characters. In terms of music, I thought that the series OST did a great job at conveying the various feelings and emotions that lay behind each scene and helped greatly in allowing us to see the types of feelings that the characters were going through at that time. \\n\\n\r\nOverall conclusion \\n\\n\r\nIn overall Ryuuou no Oshigoto was a really fun but also a really interesting anime that I really enjoyed watching this season and is arguably one of this season best anime’s. The series main strong points I thought were the interesting premise, story, characters, animation and strong voice acting and its strong emphasis on having fun while also learning how to play shogi with Ai and her friends. Unlike most countries, a lot of countries in Asia have the belief that if one wants to achieve mastery at something one must start training at an early age. As a result of this seeing, a 9-year-old decide to show up and petition a professional to train her as their disciple is by no means unusual. A lot of people seem to have the impression that this practice is shifty, but this is far from the truth as most martial arts and not to mention board games such as shogi really do start training them from an early age. In fact, as the members of the training class has proven the age of entry is actually between 7 and 9. One of the series main themes is learning to play shogi but as with all learning methods, the disciple would have to while learning how to play also encounter others that have the same goals as them. Humans by their very nature are social creatures and if we encounter people that share our interests its natural that we would want to bond with them. When trying to learn anything its always better if you learn it with friends. While learning shogi is the main theme part of that journey involves forging friendships with your fellow players and playing with them to not only improve your skills at it but also improve theirs as well as without playing with others you will not be able to learn what your flaws are and how you can rid yourself of them to improve yourself. While doing a good job at showing the teaching the basics to both Ai and to us viewers the series also did well to use this theme to teach us that winning in shogi is not everything and that defeat too can be a learning experience and one that can be used to figure out your flaws and correct them. Above all, it stresses that the most important thing is that you are having fun challenging others and learning from that experience and in turn helping both them and you. \\n\\n\r\nWith Shogi as the main theme, it was important that the series not only featured interesting and entertaining matches but also genuine shogi moves that are used for real. In this I felt that the series did a great job at showing this as not only are each of the matches interesting and well designed but they also featured analysis’s of not just the players moves via simple and easily followed explanations but also looks at the players mental state and the feelings that they may be feeling as well. The look at the feelings that one may be feeling as well as at the issues that may affect a shogi player I felt was a good move as no matter how calm one is they cannot ignore every feeling that they may have and these can have adverse effects on a shogi match if you are unable to maintain your calmness. One other aspect that I thought the series did well in was its showing of the various ages of people that play in the shogi world. While largely unknown outside of Japan shogi is a world that can be said to attract people from all walks of life and the ages of people that enter its world can vary substantially which is best shown in the ages of the characters that are featured in the series from the 9-year-old Ai to the 14-year-old Ginko and the 16-year-old Yaichi. To them, shogi is the world that links all of them together. Apart from teaching us how to play shogi the other main theme that series makes use off that it makes use of as its main premise is the relationship between Yaichi and Ai in the form of the master and disciple relationship. Though increasingly rare such relationships do certainly exist, and they are of a more important nature than normal relationships. The relationship between a master and a disciple can be a complex one as the master is responsible for not just training their disciple but also learn to exist with them and learn how to tease out the skills that they may have while also working to motivate them and keep them focused. As a result of this, the degree of trust that can be formed between a master and disciple can be potent and deep one that can inspire a great sense of loyalty to the two that can be used to motivate them or break them out of a jam when needed. While Ai and Yaichi had the most random of first encounters as the series progresses it can be seen that a strong bond between the two gradually forms bonds that not only serve to motivate Ai so that she will do her best to not lose and let her master down but also serve to motivate Yachi to work hard for Ai by improving his own skills so that he can continue to teach her. This feeling of both master and disciple working together to both learn shogi and improve their skills by relying on and finding strength from each other as they overcome challenges together I thought was well done and illustrated just how strong such a bond can be if both master and disciple learn to rely on each other. Overall Ryuuou no Oshigoto was an anime that I really enjoyed as while being an effective anime in its own right its focus on teaching how to play shogi also did well to give it the additional role of an educational anime and had the effect of introducing the sport of shogi to a larger audience which I feel will make it more popular and hopefully give it some new blood. As a final score, I would give Ryuuou no Oshigoto a final score of 10/10 as while enjoying learning about Shogi I also really enjoyed seeing Yachi forge bonds with the many characters that he meets along the way while having fun playing shogi. Bonds that can be as powerful as any strategy that one can use to motivate oneself when caught in a pinch.  \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-03-26T07:40:00+00:00",
            "helpful_count": 36,
            "mal_id": 275157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=275157"
        },
        {
            "content": "The Lolicon's Work is Never Done! \r\nA story about a Shogi master (Yaichi) who begins apprenticing a young girl(Ai-chan) who is a little too fond of him. Along the way we meet a few too many other little girl characters who all seem to have some weird magnetization towards our protagonist and a couple of actual high school/adult aged characters who you'd like to imagine will be actual love interests for Yaichi over the plethora of little girls he has to choose from.\r\nThe show, at its core, is about Shogi... and lolis. But supposedly it's mainly about shogi. Yaichi's struggle to figure out how todeal with apprenticing a young girl as well as balancing his relationships with his fellow shogi friends. The characters are likeable. Ai-chan is your standard cute loli girl who is in love with her master. Yaichi is your typical harem protagonist who seems a little too careless on his words towards his loli fanbase. Ginko is the actually decent aged love interest for Yaichi but her screentime gets smaller and smaller despite that she's supposed to be the only one with a real chance at having a relationship with MC. Ai-chan2.0 is a alright character that ends up getting pushed aside in the end in favor of the OG Ai-chan which is kind of a shame since I thought she should've gotten some more character development.\\n\\n\r\nI really enjoyed watching this show every week and looked forward to it. It's not the end all shogi show but it's also not terrible loli trash like some might suggest... Okay, it might be loli trash but not to the extreme degree some make it out to be. \\n\\n\r\n8/10 overall. 9/10 if you factor in cuteness levels but sadly those don't count in reviews. \\n\\n\r\nTL;DR - A Shogi show with some Loli's on the side. They don't go into that much detail on the Shogi though so if you're new to the game it'll still be fine as a story about a guy trying not to get arrested for his clear lolicon nature.",
            "date": "2018-03-26T07:40:00+00:00",
            "helpful_count": 26,
            "mal_id": 275158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Haaselh0ff",
                "username": "Haaselh0ff"
            },
            "url": "https://myanimelist.net/reviews.php?id=275158"
        },
        {
            "content": "this is like black bullet but with shogi instead of an apocalyptic earth. atleast black bullet had some interesting characters. I would have enjoyed this show a lot more but they showed the loli naked in the first episode itself, which threw me off. so i could tell that this is an anime that most lolicons would enjoy.\r\nI'm guessing more characters are on the way. i did enjoy the show in a way. the art and the animation style is pretty cool, so that is a plus. \r\n4 episodes in and they showed us more cliche stuff that happens in the show. shogi is justthere as a medium for these to happen. which throws me off sometimes. lolicons go for it. if you are bored and have seen all of the other anime, go for it. it's not trash level.",
            "date": "2018-01-29T12:16:00+00:00",
            "helpful_count": 21,
            "mal_id": 270037,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6929465.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ZA_WURDO",
                "username": "ZA_WURDO"
            },
            "url": "https://myanimelist.net/reviews.php?id=270037"
        },
        {
            "content": "Not good on reviews or writing so I'll keep it short and simple. First let me start off by saying: Who the hell watches an anime featuring lolis and then cries about it having a bit of loli fan service and comedy. You are watching a show straight out of Japanese culture. As such, you have to expect this kind of thing as it's (sorta) tolerated over there and a well established part of anime culture. I don't like THICC (I hate this term, they are just fat) chicks with big sloppy hooters, fat thighs and bulging bellies, but you don't see me watching everyshow that features them and then whining about it. Honestly, nobody cares about your opinion other then wanting to know if the show is good. As such on to a real review.\\n\\n\r\nYes, it's a good show despite being predictable. Despite not knowing a damn thing about Shogi I really enjoyed this show. You don't need to know anything about Shogi to enjoy it at all. The show provides the tools you need to follow along without being technical and boring. The story and premise is decent and it has a good cast and some funny dialogue. Despite being put in typical awkward situations with lolis the protagonist isn't some kind of pervert and only ever comments on the girls being cute. Watch it for the lolis and stay for the Shogi, it's a decent show.",
            "date": "2018-05-05T08:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 279832,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hatesu",
                "username": "Hatesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=279832"
        },
        {
            "content": "Honestly, I was disappointed by Ryuuou no Oshigoto, or The Ryou's work is Never Done. \r\nPerhaps it was because Joey The Anime Man interviewed the creator a while back? At the time, I found both Joey's views and the Author's expression of his story to be particularly fascinating, not to mention how high it made in the Kono Light Novel ga Sugoi contest a year or so ago.\r\nBottom line, I heard a lot of things about it and I was excited, and even when the first two episodes aired, I was convinced that there had to be at least something that made it popular enoughfor those high conjectures to be made.\\n\\n\r\nAlas, here I am at episode 4 and I am now thoroughly convinced that the author has no idea what he is doing. \\n\\n\r\n-Half-assing plot points\\n\r\n-Reliance on misunderstandings and coincidences to drive forward its plot\\n\r\n-Exposition that doesn't really add anything to the viewing experience (for anybody)\\n\r\n-Lack of substance (Doesn't follow up on promises its set in any meaningful way)\\n\r\n-Hasn't shown any attempt to take advantage of the premise it has set up for itself (i.e. shogi) nor has it used its premise in a way that makes it distinct in comparison to others of its ilk\\n\r\n-Over-dependence on (loli) fanservice as a plot device\\n\\n\r\nI must admit however before bashing on it further that the production values, animation, and art are actually very good on their own. Along with the visual metaphors the anime sometimes employs, if anything, are enough to create intrigue in the viewer and keep them coming back each week. In fact, no matter how much I think this show needs to learn before being something truly notable, I am still intrigued as to where it goes next, so it is entirely possible I am making this review prematurely and the show gets really good by the end... I highly doubt it.\\n\\n\r\nFirst of all, where Ryuuou no Oshigoto goes wrong is in its over-reliance of misunderstandings, coincidences and other cliches that are typical for romantic comedies and harem anime-\\n\\n\r\nIn other words, this show has a lot of light novel bullshit that we are all tired of, and the only way it differentiates itself from the others of its kind is by not dwelling on it for too long by heading directly to the shogi elements on the plot.\\n\\n\r\nIn normal circumstances, this would be okay, after all, we all have a few of our favorite shows rely on cliches a little at the start before evolving into a fully fleshed out narrative with complicated themes. \\n\\n\r\nThat said, the shows that are able to evolve complex and relatable narratives from seemingly cliche endeavors, are the ones that were using those standard archetypes as building blocks to form their own story, instead of falling back on them whenever it doesn't know what to do. \\n\\n\r\nOne of my favorite examples of this is The Pet Girl of Sakurasou, and anime that nearly everyone loves by the end, yet many will call the first few episodes (cliche) average or expected of romantic comedy anime. The difference is, when rewatching those first few episodes, you really start to notice that Sakurasou was never really cliche or typical in the way it was presented- it had consistent logic and from there, the series was free to grow into an anime that consistently inspired others to move forward in life and face its struggles. \\n\\n\r\nThe problem with Ryou no Oshigoto in this aspect is that the anime doesn't have consistent logic, so it can't properly build off of it's preestablished premise without falling all over itself. In the future, if it wishes to inspire people, or give some sort of deep message, then it will have to make even larger leaps in logic than it has already done.\\n\\n\r\nLet's move onto the leaps of logic themselves- the first of which would be its overuse and general misplacement of loli fanservice.\\n\\n\r\nFanservice in general is a pretty device topic, however, fanservice can be used in appropriate and meaningful ways, especially when two characters have a sexual attraction towards each other. We can see this pretty clearly in fanservice-heavy shows like Monogatari and Citrus and heck, even Karakai Juzo no Takagi-san does it better than Ryuuou no Oshigoto. The Main Character (The titular \"Ryou\"), isn't sexually interested in children as far as we know, however, the show has a way of contriving to get Ai and Ryou together. First, it was Ai walking out of the shower while the Ryou's Best Friend/ Sister was coming in. Ryou freaked out and tried to shut out his sister without telling her what was going on, and Ai basically is giving him jealous death threats while naked and holding him.\\n\\n\r\nActually, this scene isn't all that bad on its own, but the way that this type of forceful fanservice is used later in the episodes is what kind of irks me, however, I do give it credit for not doing a panty shot or something. Instead, the show goes out of its way to forcibly engage the two, while simultaneously going back on all of its promises it previously established. \\n\\n\r\nIf Ai doesn't win against three professionals, her parents will decide to take her home. She doesn't win against all three. With the characterization of Ai's Mother, it was almost guaranteed that nothing would change her mind, but just because the Ryou bowed his head, and the Father was kind of wishy-washy, she decided to back down on a condition- if Ryou is unable to make her a female professional, he will have to MARRY AI AND WORK FOR HER FAMILY. \\n\\n\r\nI don't even understand the purpose of doing this in the first place, however, if you take a closer look at that scene it becomes more infuriating. Not only is this sensitive family matter taking place in public, with everybody staring at them instead of taking it to closed doors, and that it is taking place in front of Ai, but it's also everything else. The Mother did something out of character but is so deadpan that it doesn't even come off as character development, which makes it wholly contradictory. The Father was okay with marrying Ai off to a sixteen-year-old but (even if it would take place a few years in the future) this just isn't something parents should be considering at Ai's age (she's nine). The bigger problem with the Father here is that not only is he used for exposition dump (which technically makes him the surrogate audience character), but that he doesn't find this scenario wrong in any way, not even after all of the arguing, he did with the Mother up to this point. This is bad because having him be the surrogate audience character in the scenes leading up to the revelation, makes his stance all the more convincing from a structural standpoint- as I previously explained how this scene is already incompetent, it is a blatant attempt at getting us to agree with something we should have our own opinions on. It doesn't end there, however, because the crowd that forms there at the dojo also doesn't see anything wrong with it and is more or less cheerful the entire time. \\n\\n\r\nAlso Ai's Mother asks him if he has siblings, and the Ryou answers \"yes\" to a younger sibling, which you would think would be used by the Mother in an attempt to marry Ai off to the alluded younger sibling, instead of the Main Character (Why else would she ask at that moment?), but it doesn't come up again and it remains insignificant I guess. If I had to predict why the author put in that question, it was to allude to the younger brother and I guess he'll come in and have feelings for Ai or something and stick around, but that's just speculation. \\n\\n\r\nThen we get to Episode 4, assumedly the first episode in the second light novel, and I see that this problem is actually getting worse. Episode 4 gives the Ryou another apprentice named Ai (we'll call her Ai Prime) and decides to make Ryou even more stupid. He proposes to another nine-year-old (and the author tries to pass it off as a joke by putting him making him say it in a seemingly contrived scenario, even though it was another case where even a nine-year-old would know the proper response), Ai gets jealous (why?), and he hides the fact he has another disciple from both Ai and Ai Prime for no discernable reason. Earlier in the episode, Ryou was thinking about giving Ai a proper rival, and you would think that he would immediately jump to the idea that the two would be great rivals, but instead he hides it from both of them, and Ai walks in on their study session (that took place in a completely random location) by the end of the episode, and it is treated like Ryou is cheating on her by doing that. Did I mention that Ai Prime is a tsundere? It was cute at first, but with considering how the show has already failed pretty badly at building off of archetypes to add depth to characters, I predict the next episode will have both Ais fighting each/ feeling betrayed and Ryou will finally get the idea of them being rivals!\\n\\n\r\nThere's also the fact that he blatantly tells Ai Prime that she is better than Ai, but I won't go into detail on that.\\n\\n\r\nUltimately, while the experience thus far was intriguing at a surface level, when you look deeper into the crevices of the story, you realize that this show is as hollow as a plastic shogi piece. It's a step above the average, but Ryuuou no Oshigoto itself is nothing special. \\n\\n\r\nIt isn't unsalvagable, however, I see no indication that it would salvage itself later in the future, and even when the intensity gets cranked up in the later episodes, I still have a feeling that it will still be a hollow experience, with an ending that emphasizes how important friends are or how fun shogi is or something. But that's just speculation.\\n\\n\r\nIt doesn't excel in any area, even with the ones its supposed to draw from (i.e. shogi/ sports). March comes in like a Lion is getting a lot of traction for how it emphasizes personal/emotional development using shogi as a thematic underpinning- I can't say that the show uses the rules of the game to create an engaging narrative, but the game itself makes a place for itself in the thematic undercurrent of the series, and if it weren't there it wouldn't be the same show- which I cannot say the same for shogi in Ryou no Oshigoto. It really doesn't have many legs to stand on at this point.\\n\\n\r\nWell, I suppose I'm bashing this show enough. I will update my review after watching all 12 episodes, but I think this is enough of my conjecture for now.\\n\\n\r\nIn the end, this show tries to be smart, and every time it does, it is shackled by some other dumb thing it decides to do. (It's basically only here for the lolicons, that said, it doesn't excel in that area either.)\\n\\n\r\nWelp. This was 3-gatsu no Loli. If you like it, whatever, just don't say it's smart or great because it really isn't.",
            "date": "2018-01-29T14:19:00+00:00",
            "helpful_count": 17,
            "mal_id": 270049,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881426.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Draconix814",
                "username": "Draconix814"
            },
            "url": "https://myanimelist.net/reviews.php?id=270049"
        },
        {
            "content": "I'll be honest, I'm probably older than most people here on this site. There comes a time in ones life where fast-paced activities and hobbies either aren't as viable or aren't as gratifying as ones that require thought and concentration. \"Ah, shogi!\" I thought after spotting Ryuuou no Oshigoto while scrolling through a list of currently-airing anime series. \"I've always wanted to learn how to play! Maybe I should give this show a chance.\"\r\nAfter a single episode, it became apparent that I had made a very, VERY grave mistake. This wasn't a shogi show at all... it was a loli show.\r\nMy therapist had warned methat a relapse into my loli addiction would be possible with even the slightest exposure to lolicon material.  And with that would come the guilt, the anger, the night terrors, the sleep-screaming... all of it would come rushing back to haunt me.\\n\\n\r\nAnd it did...\\n\\n\r\nI work in an office now, and I have a close relationship with my boss. My life was well on-track before watching this dreadful show. Now I can't even look him in the eye. I feel like he knows that I watch shows featuring thick loli thighs. I feel like everyone knows. I feel unclean... My did god curse me with such filthy desires? Is he some kind of cruel sadist? Maybe God is actually dead, and we're all alone, left to our own sick and twisted devices on this rotting space-ball we call home.\\n\\n\r\nThe other day I met my boss' wife. I even shook her hand. What kind of monster was I to simply smile and pretend I wasn't some dreadful loli-obsessed ghoul?! My god... I even shook his SON'S hand!... They invited me to his little-league game this weekend. Should I even show up in the state I'm in?! I'm not so sure...\\n\\n\r\nI'm not really sure about anything anymore...\\n\\n\r\nAnyway, this show is pretty good. It has a cute story and some great art and character designs. I give it an 8 out of 10.\\n\\n\r\nIf you enjoyed this review, be sure to like and subscribe, hit the bell for notifications, and check out my other reviews! Also check out my channel where I do vlogs inside a Taco Bell every Wednesday and Friday until someone kicks me out. On Saturdays I do videos where I try to teach my dog to say \"I love you,\" so I can hear it out of the mouth of another living thing. Lastly, if you know where I can find a gf, please send me a message! Please, I'm so alone I don't kn\\n\\n",
            "date": "2018-03-15T14:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 273897,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5759284.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Minteee",
                "username": "Minteee"
            },
            "url": "https://myanimelist.net/reviews.php?id=273897"
        },
        {
            "content": "This anime he does not want to be remembered for anything other than sexualization of \"lolis\"\r\nStory: 1\r\nThe anime has an extremely pig script treating you like an animal by using various expository dialogues to explain obvious things, even if you do not know \"shogi\" it is not here that you will learn\r\nArt: 6\r\nThe character design is well generic but well functional, the setting is nothing to much\r\nSound: 5\r\nIn the part of sound not to nothing too the soundtracks are generic but functional and the sonoplasty decays a few times but until it is functional\r\nCharacter: 1\r\nGeneric, stereotyped (a lot of \"lolis\" who get extremely strange attitudestowards a child just to do \"\"\"comedy\"\"\"\"which is very offensive, predictable, irritating)\\n\\n\r\nEnjoyment: 1\\n\r\nIt's a dorky anime in what it tries to do but when it puts that \"\"\"comedy\"\"\" extremely stupid in the middle (which anime mind more into doing than the main plot) it's very annoying in those parts.\\n\\n\r\nOverall: 2.8\\n\r\nIf you love \"lolis\" being sexualized without any kind of context and the anime does not work your main plot, this anime will be for you",
            "date": "2018-02-18T19:43:00+00:00",
            "helpful_count": 6,
            "mal_id": 271897,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6087095.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Heikor",
                "username": "Heikor"
            },
            "url": "https://myanimelist.net/reviews.php?id=271897"
        },
        {
            "content": "I feel like i shouldn't need to explain it but Shogi is not this intense or interesting ! \r\nI've seen two old people playing Shogi before and it's one of the most boring things i'v ever scene. It's more boring then being in a Hospital room by yourself without anything to entertain yourself with while you wait for the Doctor. Hell, I've even played Shogi once and i was bored to tear.\r\nWhile i didn't really enjoy myself when they were actually playing Shogi ( That's a pretty big negative for a show based around it) I did find myself liking the world and the charactersinvolved with it. \\n\\n\r\nAt first the characters aren't really that interesting. But then i found myself enjoying the characters like Sis and the Bodyguard chick. \\n\\n\r\nHonestly any and all of the Loli's in this are adorable. \\n\\n\r\nAi and Char Char ( I think it's her name ) Are awesome and fun to have on screen. \\n\\n\r\nI do have some scenes where it's trying to make it seem like Ai's match is really important but it's really not. Especially when we have a second plot of one of the older girls trying to become a professional player that is much more interesting. \\n\\n\r\nThe main Antagonist is also kind of nice but i feel they messed up his execution.\\n\\n\r\nFor a Show about Shogi he's actually not bad. All throughout we hadn't heard him say a single word tell the episode and i'd say that was a mistake. I think it have been better if he never said a single word. \\n\\n\r\nAlong with never showing his face. Normally we'd only see the back of his head or rarely just his mouth. I feel that if they kept him as a more mysterious Antagonist it would've been more enjoyable. Give him some secrecy and keep us more interested however much more. \\n\\n\r\nHe's not the greatest Antagonist but he's actually pretty good for a show just about Shogi.\\n\\n\r\nI wish this show just had a girl Protagonist. Imagine how much more interesting this would be if the story was from Ai. A girl about the age of 10 or 11 going through a world completely unknown to her while also having to deal with people not taking her seriously and her having to prove herself by her own skill alone. \\n\\n\r\nAlso i just don't like the MC that much and i like Yuri a shit ton more then this. But hey that's just me. \\n\\n\\n\r\nThe group of loli's in this i obviously like. But i honestly think i would've enjoyed the show a lot more if it was just about the girls. I like imaging the Loli's become friends and imaging the the two Ai's have a close relationship together as they go through High School. One being more rude while the other one being the nice and kind one. Hell, I honestly think they would be a good couple together ( When they're adults and not Loli's. I'm not weird) I would love for this to be a spin of series tbh\\n\\n\r\nFinally i just find something sad about these girls being obsessed with Shogi. Like the two Ai's alone have tremendous skill with one of the Ai's having a brain like a computer. But all that potential is gonna be used on a boring board game of Shogi. \\n\\n\r\nOverall i surprisingly enjoyed myself more then i thought i would with this being a show about something i don't really care for.",
            "date": "2018-03-27T05:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 275304,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=275304"
        },
        {
            "content": "“Ah Mr.Officer its not what it looks like! I’m not a lolicon” To sum up this anime I only have a few words, lolis! Lolis everywhere! Ahem, back to the review, contains minor spoilers.\r\nSo the anime starts off with the Mc in a intense “Ryuo” match(this is basicully a tournament to earn the title of “Ryuo” which is a prestigous title in the shogi world) there he meets a yumm- I mean cute loli called “Hinatsuru, Ai”. Major spoiler he wins the “Ryuo” match, nah jk it is called “The Ryuo’s work is never done for a reason”. After winning and becomming the youngest Ryuoever at the age of 16. After a quick transition the Mc enters the his apartment and behold the loli is there asking to be his diciple. He accepts and finds out that she is a prodigy at shogi and then is it basicully a slice of life where they play intense matches of shogi which some are official matches. Then more lolis get introduced and the plot thickens(Insert lenny face) He also aquires the title of “Loli king” later on so expect some big things from him later on :)\\n\\n\r\nLets discuss the important characthers: First is “Ai” his loli yandere diciple, she is a prodigy and Mc sees a lot of talent in her. Then is “Ginka” who he calls sis when they are not realated but because they trained under the same master. She is basicully the cold type of person and is in love with the Mc but is the type to abuse him, she is also quite good at shogi. She is also the one the bestowed the amazing title of “Loli king” onto the Mc. Next is the hot mature “Keika” she is 25 and she wants to become a female proffesional however she is not good enough as she keeps losing in the training group and her time is running out as once she is 27 she can’t goto the training group.\\n\\n\r\nCharacters are pretty cute and I liked the art style and comedic at times, just an anime I say to pass the time, wouldn’t really call it a master piece of anything. Yes this anime is about shogi, most of the time I had no idea what was going on when they were playing shogi but still pretty enjoyable as they made the matches quite itense.\\n\\n\r\nNow onwards men! Into the kingdom of lolis!\\n",
            "date": "2018-07-24T01:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 284644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5889280.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yip9090",
                "username": "Yip9090"
            },
            "url": "https://myanimelist.net/reviews.php?id=284644"
        },
        {
            "content": "I would first like to state this review contains some spoilers as I needed to discuss the final arc and certain scenes with characters.\r\nStory: 5\r\nThe story is certainly not the strong point of this series. It follows a young shogi prodigy and his daily antics of being a professional shogi player and a Loli harem king.\r\nWhile some arcs are seemingly pointless some are rather good. For example, Keika attempting to be a professional player after so many years of trying. And the final Ryuo match where Yaichi overcomes his slump after turning away his friends. Both were rather heartwarming but still had their respective faults.\r\nHowever,as we neared the end of the story it felt fairly rushed. Firstly, cutting off a potential arc of Sora and Yaichi making up after their argument prior to the Ryuuou match. And even more so in summing up his final 3 matches in a single sentence and leaving it at that. Right after the excitement of his win, I felt it was a slap in the face to be told that he simply won all the rest of his matches in one sentence. It doesn't make any sense and is very anti-climactic\\n\\n\r\nAnimation: 7\\n\r\nThe animation is quite nice. Always smooth and pleasant to look at. This section was well done. There isn't too much else to be said.\\n\\n\r\nSound: 7\\n\r\nAfter about four episodes I had downloaded the OP to my phone. I think it's great and matches the upbeat opening very well. The ED was also quite enjoyable.\\n\\n\r\nSound during the anime was good. No glaring issues but nothing special either.\\n\\n\r\nCharacters: 4\\n\r\nOther than a couple main characters and some sides I feel like many were introduced simply for fan service. However, as a comedy, some of their moments were fairly funny (for ex. the announcer girl) and enjoyable.\\n\\n\r\nThe show had many of the classic character archetypes we have all seen before but they were still made enjoyable.\\n\\n\r\nNo characters were really all that deep aside from Keika (who still wasn't all that deep) whom we learn of her past struggles. Of the others, we don't learn too much but the arc in which Ai gains family approval is quite nice too.\\n\\n\r\nAs per usual in anime, MC's are either dense or beta. And Yaichi follows the trend with his attitude towards Sora. The scene on the beach and his later argument in which he was never shown apologizing for were not pleasant. Character fights that involve drama can create good tension in a show but in this show, I don't feel that sort of drama was needed. But if it was going to be there, as they did, please at the very least resolve the character drama and don't just forget about it. Sora was one of the stronger and more likable characters in the show imo. How can one be so dense? And how can one not apologize for what he did? I don't know. But if they grew up so close you would think he would not just ignore her right when he is thrown countless lolis. But oh well.\\n\\n\r\nEnjoyment: 7\\n\r\nI largely enjoyed this show as it was colorful, eye-catching, and fun. Cute girls playing shogi? How could I not? Even with mediocre story arcs some prevailed and made us feel a bit for the characters. While other may have made us hate them a little too (Fking apologize to Sora).\\n\\n\r\nBut overall lolis and shogi were never going to make a masterpiece of an animation. However, what it did make is an enjoyable comedy with some drama thrown in. Was the drama really needed? Probably not. But it wasn't bad, and the ending was fairly nice and lighthearted as well.",
            "date": "2018-05-05T07:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 279829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5681977.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sistine-Fibel",
                "username": "Sistine-Fibel"
            },
            "url": "https://myanimelist.net/reviews.php?id=279829"
        },
        {
            "content": "\"It can be better, but it chose not to.\"\r\n\r\nPros\r\n1. Cute characters\r\n2. Great details on Shogi\r\nCons\r\n1. Boring art style\r\n2. Rushed adaptation\r\n\r\nI heard about this series through it's winning in the Kono Light Novel Ga Sugoi Contest 2 years in a row, beating series like Snafu and Sword Art Online. It was shocking to see a light novel about shogi with lolis can beat series like SAO in a popularity contest, so I waited for the anime to see how this series handles its loli characters and also the Shogi element. \r\nAfter finishing the series, I have to say that it's quite disappointing, but Istill had fun watching it. There are two things that this series fails at, it's adaptation and it's art. Now let me start with the adaptation part. I only gathered this information based on comments from fans of the LN. Apparently this is a failed attempt at adapting the LN, which I can agree. As an anime only, I can also see a lot of important events being rushed. A lot of the contest were quickly glanced through just to go to the final match. There is seriously a lack of explanation at scenes throughout the series especially near the end. Secondly, the art for Ryuuoh isn't that good. It isn't as bad as Marchen Madchen next door, but compared to a lot of series running this season, the only anime I can find on par with Ryuuoh in terms of art is Mitsuboshi Colors, which is also pretty weak at the art department. The only thing I like about Ryuuoh's art is how the characters' eyes were drawn, especially when the characters are being serious while playing shogi, their eyes are beautifully drawn.  There are also so points within the series where the characters just look badly drawn. Well, coming from Project No 9, it isn't really surprising just by looking at their previous works.\\n\\n\r\nNow moving on to the good part. First its the characters. I like each character in this series. It really isn't because they are well fleshed out or anything, it's just I like how the characterization for this series is done. Among all the characters, my favorite one is definitely Yashajin Ai. I just love her design very much. Development wise, there are some minor development for each character but nothing grand, some examples being characters getting better at shogi, overcoming their fears, having confidence in themselves again etc. \\n\\n\r\nThe details on Shogi is also very apparent in this series. If you know at least the basics of shogi, you can really learn from each of the contest in this series. They really did explain each step well. However, if you aren't familiar with Shogi, then you won't understand anything during the match. Personally I am in the latter part, but I still enjoy watching the matches, maybe because I also play chess and I know the feeling of not wanting to lose easily.\\n\\n\r\nSo overall, I enjoyed watching Ryuuou no Oshigoto, but is it a must watch from this season? No. I will recommend you checking out the LN if you really like this series. I would only recommend the TV anime if you want your daily dose of loli cuteness. Otherwise, just skip this series or just go read the LN.",
            "date": "2018-03-29T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 275567,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=275567"
        },
        {
            "content": "Ko, ko, ko, ko, ko, ko, ok enough of Ai's \"Ko\" moment , so an anime with a loli vibe has just finish. Shit , it kinda sounded like that Ai's is doing that woman on top straddling her seisoh is a sexual way. But, enough of that, ko, ko, ko, ko, ko, how I find this, ko, ko, ko,ko, ko:\r\nPoor 3, Story: \r\nThere is nothing like making something as simple as a Shogi to make is as exaggerated as usual, I mean,  with such busy live do them Japs still give ashit about Shogi these days? Ok, so let's get back to business,we have a guy who is a high ranking shogi player who all of the sudden finds himself having a padawan in a form of a little girl named Ai Hinatsuru, after making such promise from a game, where it doesn't seems to require a lotta effort to play and yet his overacting that he is in such exhaustion that he become this soooo stupidly desperate for water form a loli like Ai was just toooooooooo annoying.  Also him ( Yaichi Kuzuyuu) being this too obsess of losing from an old timer like  Meijin is something that I would like to see the who ever is this anime/novel/manga's creator Shiratori get beating up. This anime's plot was nothing more than a loli love, cu'z the main character has whole bunch of them and Ginko his onee chan who is younger than him and in junior high  can qualify as part of the guy's loli harem. \\n\\n\r\nDecent 4, Art:\\n\\n\r\nNothing hot nor kinky around here, in fact Ginko's swimsuit fanservice is quite lousy. \\n\\n\r\nFair 6, Sound: \\n\\n\r\nNo Comment for me around here, cu'z I simply don't give a ko, ko, ko, ko, damn as to who did who.\\n\\n\r\nPoor 3 Character: \\n\\n\r\nOk so let's go over them characters: \\n\\n\r\nYaichi Kuzuryuu- The Jedi master of Shogi, for him to have the title \"Ryuo\" at 16 was just too much of the Japanese quintessential of young people who needs to grow up fast that him having such title and being this boy who loses to a grown up like Mejin and can't accept it, was just too much of an ill fitted part in a motor. Also him having a loli romance with Ai Hinatsuru and having an affair with another Ai as in Ai Yashajin simply make him a womanizer of sort, that the creator himself was trying to make it look innocent as he jumble from his loli harem padawns to the two Milfs like Keiko and Tamayo , let's not forget his one time fling with Ika.\\n\\n\r\nAi Hinatsuru- For me she is this brat who need some spanking, cu'z how the hell can a 9 year old can have the thinking of an 18 year old, again she is another ill fitted part in a motor.\\n\\n\r\nGinko Sora- She would have been fine to be Yaichi's girlfriend, but being this 14 year old and being another Jedi master of shogi in such young age and  being as aloof and frank as a 20 year old makes her a waste of opportunity for the guy Yaichi to be his wife. I really feel bad for her.\\n\\n\r\nAi Yashajin- To me that girl can surly use some major attitude adjustment.\\n\\n\r\nLet's face them characters where just a bunch of ill fitted parts and that's that.\\n\\n\\n\r\nGood 7, enjoyment:\\n\\n\r\nNevertheless, this anime was still enjoyable to such extent, but the comedic aspect is lost in the last 2 episodes when the relationship between Ai and Yaichi becomes closer than just padawn and master, so..........\\n\\n\r\nGood 7, Overall:\\n\\n\r\nIn the end this has more to do with the guy's relationship with a young girl and though it was good, the title and the genre weren't up to standards as to what the anime was suppose to be.... so, season 2? Ko, ko, ko, ko, ko, ko no way jose.\\n\\n\r\nKo, ko, ko, ko, ko....\\n\\n\\n\\n",
            "date": "2018-03-28T12:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 275473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=275473"
        },
        {
            "content": "Ryuuou no Oshigoto is a controversial anime. One one hand it can be accused of being a lolicon bait and a harem (not that I mind either of those). On the other, shogi games are well made and can get really exciting.\r\nFirst question that comes to mind: do you need to know shogi rules to enjoy it? Not really. I assume a person with deeper understanding of game could find something more in this anime, but as someone who barely knows basics of shogi, I didn't feel too limited by it. Show mentions many moves and strategies, but parts important to follow the story areexplained well enough.\\n\\n\r\nRyuuou no Oshigoto's story is mostly focused on characters, their interactions and development. While shogi is used as a background and a driving force for them, I believe liking the characters is required to enjoy this anime. And this might be hard for some, considering how varied is cast - we have an abusive tsundere, a loli himedere with tsundere tendencies, a loli with yandere tendencies, onee-san character, full psycho yandere... aaand some more lolis.\\n\r\nOh, and most of them are interested in protagonist. Now, don't get me wrong. I'm a fan of harems, and while Ryuuou no Oshigoto doesn't put too much focus on this aspect, I sure enjoyed it. \\n\r\nReading that you probably expect Yaichi to be typical harem MC. That's not the case. He sure is clueless, but other than that I'd say his actions are reasonable and don't make you want to strangle him. He makes mistakes that are understandable and fitting from story perspective.\\n\\n\r\nOutside of nice Slice of Life atmosphere we also get shogi games. I have to admit, those are really well made. Thanks to good introductions, great music, effects and monologues, seemingly slow and \"boring\" games turn into something very exciting and emotional. Even though in most cases one can predict the outcome, they still managed to keep me on the edge of my seat.\\n\\n\r\nWhile art in Ryuuou no Oshigoto isn't anything special in general, I have to mention characters design here. They are pretty. This anime doesn't really go into full fanservice mode - instead the service is done by more tame (in broad meaning...) interactions that shine thanks to characters designs being well used. Example of what I mean here would be Ginko's lips, stockings or occasional midriff. Good stuff.\\n\\n\r\nI'm not sure if I managed to rely it properly in indirect way, so I'll write it directly as a summary: it's a light and enjoyable anime, don't take it too seriously and just enjoy it. I might forget it in few months or maybe even weeks, but I absolutely don't regret watching this series. I believe this title was meant to be a pleasant time killer and it fulfills this tole perfectly.",
            "date": "2018-03-26T13:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 275206,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=275206"
        },
        {
            "content": "We've had series about edgy card games where everything is on the line, mechas to save the planet, battles of magic and technology for the sake of domination or peace....and then, we get the lighthearted series where the japanese \"chess\" game known as shogi means everything in the world in this story. And yes, I know, it's lolicon bait, but honestly, that's not what's really important here. It's a shame that people are probably sleeping on this series, cause it's quite enjoyable in its own right.\r\nSTORY: It's a fairly good setting where shogi means everything like Duel Monsters are with all the yugioh series. Ifound it very interesting how even a modest looking game of shogi can actually be full of tension, and how it can be relatable to real-life situations. Something I did find a bit offputting is how the main character is not really focused on academic goals anymore and is basically already having a job as a pro player, but then again, there are many people out there in real life who have taken a similar route when school never worked out for them or when they found an interest stronger than pursuing academic education. The \"loli bait\" setup is real when it came to the shogi schools, but other than that, I personally didn't feel that bothered by it. The chance meeting with the self-taught prodigy Ai (who is still not even in middle school, mind you) is also kinda cliche, but important, nonetheless.\\n\\n\r\nART: The art is clean and doesn't try to emphasize so much. I do especially like when the \"cow lick\" hair of Ai moves on its own like some sort of muscle or antennae, and it really adds to how adorable looking she is...cause physical appeal is always a plus, imo, as long as it's not forced. I also do like when the character show priceless expressions, be it scared to death, shocked beyond belief, or angry enough to scare the shit out of people.\\n\\n\r\nSOUND: The soundtracks are not really that great, honestly, but I DO like the soundtracks during the actual shogi matches, where the music can really fit in with the tension of each player's moves or expressions...it can really get you glued to the screen even if you're the guy who prefers more violent sci-fi or supernatural action.\\n\\n\r\nCHARACTER: I personally thought the characters were well thought out in terms of complexity, backstory, and appeal. Also, it's hard not to make a yugioh reference when it turned out there were TWO Ais in this series....the main one, Ai Hinatsuru, who plays well with strategies and is basically the \"closer\" in the end game, and the alt one, Ai Yashajin, who plays the basics to perfection. Both young girls have their strengths and weaknesses, as well as backstories and personalities, that are almost perfect opposites of each other. To have that kind of setup for these characters is awesome and really sets the tables for the development and maturity of those two. A similar theme applies to Yaichi, the main protagonist, and Sora, the other main heroine; they are basically the \"other me\" of each other, displaying the same level and strength of shogi play, but having contrasting play styles. Now, what I thought could've been done better would be to elaborate a tad bit more on the supporting cast, especially the three other young shogi students Mio, Ayano, and Charlotte.\\n\\n\r\nENJOYMENT: I was more into this series than I hoped for. Was it because of the loli service? Maybe, but I wouldn't view that in a negative light at all, even if I was more critical of this series. The laughs are WELL worth it, too, especially when it involves the \"main\" Ai or Sora(otherwise known as the Snow Queen and a \"GOD\" shogi player) getting hella pissed off at poor Yaichi. In addition to the laughs, the shogi matches are actually very engaging to watch, as one anxiously waits for a winner. It's something you'd kinda recognize in most sports anime series.\\n\\n\r\nOVERALL: If you're \"loli-phobic\", I can understand why you wouldn't want to watch it. The thing is, if you don't let the lolicon bait material get to you, the series is actually pretty good. Granted, it's not for everybody, considering how lighthearted overall the story is. However, I think the journey and the development matter the most, as long as the other things are not too much of an eyesore.",
            "date": "2018-03-26T08:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 275163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=275163"
        },
        {
            "content": "Honestly I was very skeptical when getting into this anime, I was like \"what is this ? Sangatsu no Lion for lolicon middle schoolers ? \" \r\nTruth be told Sangatsu is one of my favorite anime series I love the realistic drama, deep characters, interesting story progression I love everything about it. This anime didn't seem to have that kind of vibe so I really underestimated it. But here comes the weird part:\r\nIT DOES NOT HAVE THOSE THINGS BUT IT STILL MADE ME LOVE IT !\r\nI don't even know why !\r\nFirst episode was like \"Okay I got a good chuckle but whats with the hugeloli baits\"\\n\r\nSecond episode was like \"Oh that was funny, I guess it's not bad after all\"\\n\r\nAnd before I knew it I was waiting for the next episode to come out with excitement. Hell if I know why it became my most anticipated anime to come out weekly. I watch every episode twice, one alone and one with a Son Wukong reaction video. And I never get bored, I always laugh I always get full enjoyment out of it.\\n\\n\r\nIf you think about its parts separately and with a logical stand-point you won't see why it's enjoyable, the blend of these things just is. Its a fucking mystery I tell you. I guess it's also about who is watching it.\\n\\n\r\nGreat comedy (comedy is subjective so it might differ from the reader's tastes),\\n\r\nlight hearted episodes but also some real drama and real shogi battles going on, it's not totally a lolicon anime (... who am I kidding but atleast it's not creepy with it.. only sometimes), top quality waifus (Sora Ginko top waifu, I will yu-gi-oh battle anyone who claims otherwise. It's time to Du-du-du-du-du-duel !)",
            "date": "2018-03-03T08:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 272889,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727954.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marchearth",
                "username": "Marchearth"
            },
            "url": "https://myanimelist.net/reviews.php?id=272889"
        },
        {
            "content": "No doubt geared towards Shogi players (as it occasionally goes into technical details), but even if you don't play it, this is a fun series.  It's not high on the comedy scale, being more drama than anything, especially how characters deal with losing games, as well as winning.  Some also have to cope with the possibility of never being able to compete professionally.\r\nMatches are shown sparingly or in a highly dramatic form, which whilst not accurate (hopefully), it does make things interesting.\r\nThe characters are nice but flawed - the protagonist especially so, who is essentially being forced to mentor two girls with thethreat of an arranged marriage and having to work elsewhere if he fails in his mission.  In addition to that, he also has to cope with their jealousy towards his friends, and their other problems, and the fact that there are players better than himself.\\n\\n\r\nHis other competitors all have different personalities, but all do seem nice although highly competitive.\\n\\n\r\nAnimation wise, it's nicely animated.  3D graphics are used sparingly.\\n\\n\r\nTitle sequence music is good, but the ending one is rather boring.\\n\\n\\n\\n\\n\\n",
            "date": "2018-02-12T10:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 271355,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962652.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sku_Te",
                "username": "Sku_Te"
            },
            "url": "https://myanimelist.net/reviews.php?id=271355"
        },
        {
            "content": "First of all, gotta say I don't usually write reviews. I like being critical but it's something I don't do out in \"public\" because of how outrageously agressive the anime community is lately. Furthermore, this isn't a technical review, it's an opinionated speech about why i think you should watch \"Ryuuou no Oshigoto!\".\r\nHowever, with this show i felt like i had to do something. You know, this show may be as trashy as you want, and it is probably true. And even though it is, it managed to be fun, heartwarming, dramatic and even emotional (at least to me). And yes, it's filled to thebrim with cliches, and if we go into the more technical stuff the story was average at best and the characters could've been more deep or well written. Tthe animation wasn't the slickest either, and the whole loli theme may have been over the top as well.\\n\\n\r\nAll that being said, this show was sommething I enjoyed, something not dense enough to have to take some time after a few episodes nor light and trashy enough to make me wanna cut my veins for having completed it.\\n\\n\r\nIf you're an anime elitist don't watch it, go bach to your masterpieces, because it'll piss you off, and you know it. On the other hand, if you think of yourself as a tolerant viewer give it a shot, it will crack you up for sure. I'm not saying it's a masterpiece, but it has wit and it doesn't take itself too seriously either, making it an enjoyable ride.\\n\\n\r\nIf you watch anime for anything else than being a bitch about every little detail, like for example, enjoyment, give it a shot, it may surprise you.\\n\\n\r\nThanks for reading.",
            "date": "2018-08-11T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 286243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4128649.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BrightColorLover",
                "username": "BrightColorLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=286243"
        },
        {
            "content": "Another review for my fans. Wait, I don't really have any. So anyway here I go.\r\nDear Author, you suck at adapting your story, please die, and beg for forgiveness!!!\r\nI wanted it to be rated by me to 8 or 9 but the story was ACHING fast paced and those background characters doesn't even have a single backstory line/scene in the series, then the most crucial of all is the love story or relationship between Ginko and Yaichi didn't bloom enough to the point that they should at least kiss, ACHE you author!!!\r\nAnd now the original plot for chess in japan called shogi, shogi is nota popular game in the whole world so creating this plot is only good for those in-you-know. This could be a great anime if they made it up to 26 episodes. So many comedies within the series but its too short!!! The most touching scene of all is the ending, even if I was unsatisfied with the anime series, they tell the whole story in summarized ending.",
            "date": "2018-05-23T07:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 281243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2264483.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/astralkill00",
                "username": "astralkill00"
            },
            "url": "https://myanimelist.net/reviews.php?id=281243"
        },
        {
            "content": "Honestly it's mostly underwhelming. It seemed a bit to slow for my taste, I wouldn't say it's bad just kind of meh to be honest. I plan to finish it at some point but for now (as of the time writing this review) I'm just going to put it on hold. I would say that it has its moments, and that I was interested in some of the characters but I guess it just wasn't my cup of tea. Anyone who likes some serious competitive tension mixed in with comedy frequently enough should check it out, but (at least in my opinion) it was atad bit boring at times. when it does comedy it does it well at least.",
            "date": "2018-05-05T05:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 279824,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7222123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fuzzyhugs01",
                "username": "fuzzyhugs01"
            },
            "url": "https://myanimelist.net/reviews.php?id=279824"
        }
    ],
    [
        {
            "content": "This anime. Or rather, this copy-paste formulaic anime adaptation of the light novel that apparently was voted #1 in the Japan’s Kono Light Novel ga Sugoi! for 2017 made me wonder if the anime industry even tries anymore. It’s 2018 and here we are, an anime adaptation based on shogi with a cast filled with questionable characters and content. I was cautiously optimistic about this show at first but upon finishing this anime, I can say that without a shadow of a doubt, Ryuunou no Oshigoto left little more than desired.\r\nSometimes, people say don’t judge a book by its cover. Unfortunately, that statement is hardto apply for this series. Upon looking at the key visual, you’ll notice an average dull looking male protagonist surrounded by what seems to be a harem of girls. No, I’m not calling this anime a harem but it doesn’t help by the fact that some of them look about half his age. Still, there’s some hope because the show involves shogi, a strategic game of intelligence, right?\\n\\n\r\nWrong.\\n\\n\r\nThe story itself may be focused on shogi but the overall tone of the show will be far distracting than you’ll realize. The first few episodes can easily rub people in the wrong way with the way its characters are introduced. The main culprit is 9-year old Ai Hinatsuru who seems to have an attraction towards shogi master Yaichi. It leaves a controversial impression especially with how she reacts to him when other girls are involved in their lives. After being taken in as disciple, she seems to be even more attached to him to the point where you’ll see “yandere” moments. That’s just the tip of the iceberg though. We also meet Ginko Sora, a female prodigy who also happens to be Yaichi’s childhood friend. I think it’s easy to pinpoint her intentions after watching her reactions from just the first episode alone. Nonetheless, the initial beginning will test the audience on whether they should continue or not. For me, I decided to give this show a chance to see if it improves. Sadly, I’m mistaken.\\n\\n\r\nIt seems almost every episode along the way wants to showcase shogi but also leaves the impression of underage girls doing what a grown up would do. Is that an overstatement? However, it’s undeniable that the show gives an uncomfortable feeling whenever characters such as Ai, Charlotte, or others tries to get Yaichi’s attention. Yaichi himself is hardly an interesting character either. The show saturates him with a generic personality and gets him often into compromising positions, either with his disciples or Ginko. It doesn’t help that he is dense as a black hole and the show never really develop him as a character. Speaking of development, the show is mostly void of that except on technical improvement of shogi skills. The only character that I respect in this anime would be Keika Kiyotaki. In perhaps one of the more realistic and heartwarming episodes, we see her determination and strive to improve. The storytelling of her past also make us understand Keika as a person and shogi player. Unfortunately, one episode can’t carry the show as altogether as the others are far less welcoming to watch.\\n\\n\r\nNow I’m not an expert on shogi but this anime seems to dedicate a lot of time in the matches themselves. One might think this is a positive but it’s hardly that. The mind games and psychology is hardly felt because of the way dialogue are delivered. It doesn’t help that the show often jumps around between opponents without giving the audience a memorable rivalry. Furthermore, the main cast is just incredibly one dimensional with personalities that are hardly interesting. If you want some actual shogi with integrity and promising story, check out 3-gatsu no Lion.\\n\\n\r\nProject No.9 is an oddball studio. My impression of their work in recent years has quite underwhelming and it seems that they didn’t manage to step up to the plate this time. On paper, the anime quality looks tolerable with the body movements, character designs, and facial expressions. However, there’s not much else that makes this anime’s visual quality stand out. Sure, there’s character reactions that can be comedic at times but it gets tedious fast. You can pretty much open up a light novel and see similarities in almost every series these days. It doesn’t help that the anime pulls out fan service moments that set off red flags. Oh and Yaichi, he has a very punchable face.\\n\\n\r\nOn a more positive note, I suppose the anime’s soundtrack and voice mannerism managed to stay its welcome. Younger characters aren’t easy to portray but I got the impression that it was well delivered. Ginko’s voice is perhaps the most noticeable whenever she gets into a bad mood. On the other hand, I wish there was an auto-mute button whenever Yaichi talks in overly long dialogues. The theme songs of the show are rather catchy despite how generic it looks.\\n\\n\r\nIf I said it once, I said it a hundred times. This show leaves little to be desired. You can watch this anime for the shogi but in the end, you’ll probably remember more than that. And I don’t mean that as a positive impression. One character I will actually remember for good measure though is Keika. I prayed the show would develop her more but it seems the anime decided to take steps back after that one memorable episode. For what’s worth, watch this anime with caution if you choose. It honestly became a show that gives shogi a bad name.",
            "date": "2018-03-26T06:14:00+00:00",
            "helpful_count": 84,
            "mal_id": 275146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=275146"
        },
        {
            "content": "Please note this review assumes that you have finished watching Ryuuou no Oshigoto and while care has been taken to minimise story related spoilers there may still be spoilers within character analysis. You have been warned. \r\nLearning to value the bonds that a master and disciple make while playing Shogi with Ai and friends\r\nBased off a well-known light novel series of the same name Ryuuou no Oshigoto or its English title which is the Ryuo’s work is never done gives us the opportunity to look into the world of Shogi from not just a player’s perspective but also from a master’s perspective as they trainprospective students to enter the often-overlooked world of competitive shogi. It does this by introducing us to the Osaka Shogi scene and the many people that are connected to it which includes among their number powerful Shogi players as well as prospective shogi players who wish to enter the world of shogi for many varied reasons. The first episode of the series made a pretty impression on me largely due to the demonstration of the main heroine Ai Hinatsuru’s skill at shogi despite her young age. While wary of the many bad impressions that people had on the premise of the show I kept the show on my watch list and looking back at it I'm glad that I did as I really enjoyed this show. \\n\\n\r\nTaking place within the modern era within the city of Osaka and the surrounding areas Ryuuou no Oshigoto’s overall story follows the life of Yaichi Kuzuryuu a 16 year old teenager that despite his young age is already an accomplished shogi player who had just won the coveted shogi title of Ryuo and his encounter with Ai Hinatsuru a  9 year old elementary school girl a prodigy at shogi who had come seeking to become his disciple. As Yachi and Ai becomes master and apprentice and enter the Osaka shogi scene he soon begins to appreciate the unique skills that Ai has and how they can be used to both introduce new talent to the Osaka shogi scene while at the same time improve his own skills as they both confront the unique challenges that both title holders and beginners in the world of competitive shogi face. Along the way, Yachi and Ai would encounter many varied and interesting characters in their journey to improve their skills in Shogi. These include Ginko Sora Yaichi’s fellow apprentice who is as beautiful as she is skilled in Shogi, Ai Yashajin a rich and arrogant girl from Kobe that possesses skills equal to his disciple, Keika Yaichi’s fellow apprentice and his masters daughter who is determined to break into the league before time runs out and Ika a title holder that approaches Shogi with arrogance and seeks only to beat opponents relentlessly to satisfy her ego. \\n\\n\r\nYaichi \\n\\n\r\nYaichi Kuzuryuu voiced by veteran voice actor Yuuma Uchida of Classroom Crisis fame is one of the main characters of the series and is the main protagonist of the series. Despite his young age, Yaichi is already a veteran shogi player and a newly christened title holder having managed to secure the coveted title of Ryuo and becoming the youngest player to achieve that title in history. A 16-year-old teenager Yaichi is a kind, polite and considerate person that on first impression did not really fit the image of a pro shogi player and indeed more like a normal teenager. While kind and polite in the beginning Yaichi was also seen to be someone that was also understanding and patient and treated everyone with respect and dignity whether they are surprise gatecrashers or fellow shogi players. Having played shogi since childhood it can be seen that Yachi is someone that views the sport as something sacred and treats it with the utmost respect and as a result dislikes people that either dismiss it as a game or those players that treat their matches badly as he feels that they are not respecting the sport if they don’t play it seriously. While appearing indecisive in the beginning Yaichi was also someone that was noted to be intelligent and fast thinking and was the type of person that researched his opponents seriously to come up with countermeasures that show his determination to pay respect to both the game and to his opponents. While noted to have a great deal of pride at the beginning Yaichi true to his kind nature was also noted to be someone that was not just perceptive but also intelligent enough to realise the error of his ways and admit to the mistakes that he had made. \\n\\n\r\nAs the series goes on and as events allow him to meet both Ai Hinatsuru as well as Ai Yashajin Yaichi’s personality gradually starts to change as the series progresses. At the beginning of the series as a result of his slump, Yaichi was noted to be someone that had low self-esteem that was only held back by his positive attitude and passion for the sport and worked only to secure a victory to silence his many detractors. This however changed after his encounter with Ai Hinatsuru. While initially sceptical of Ai given how she just suddenly appeared in front of him this opinion of her gradually changed after seeing the level of skill that she had skills that were every bit as equal to his own despite the lack of training and actual playing experience that she had. As a result of seeing the level of skill that she had as well as seeing her earnest desire to become his disciple Yaichi’s core focus soon changed to one that revolved around the training of Ai as his disciple and raise her as a pro shogi player that will be able to make full use of the talent that she had. While somewhat reluctant at the beginning due to the many opinions that people had about him and Ai as the series goes on this reluctance gradually disappears and is replaced by his desire to teach her carefully and calmly showing his determination to fulfil this promise. While somewhat reluctant and embarrassed to be associated with Ai at first this feeling gradually transforms to that of pride at having someone as skilled as her as his disciple and is something that Yaichi makes use of as his main source of motivation as the series goes on. While positive and calm on the surface Yaichi in the series also faced a number of problems that were unique to him. At the beginning of the series while Yachi had great skill he was also rather unimaginative with his tactics and as such was looked down by many people and his victory over the previous Ryuo was widely seen as a fluke. While dismissing them as harmless it can be seen that beneath the surface these sentiments affected him greatly. As the series progresses and Yaichi encounters first Ai Hinatsuru and later Ai Yashajin this feeling of inferiority starts to decrease as he upon seeing both their skills at shogi develops a motivation to improve his skills not just to improve his standing within the shogi world but also to be a good master to them. Yaichi’s most prominent trait is without a doubt his desire to not see Shogi as just another competitive sport but also a sport where his disciples can be good at and enjoy while respecting other players. This aspect of him I particularly liked as it showed how much he loved and respected the sport. \\n\\n\r\nAi Hinatsuru \\n\\n\r\nAi Hinatsuru voiced by veteran seiyuu Rina Hidaka of SAO and Accel world fame is one of the main characters of the series and is the series main heroine. A 9-year-old girl that’s still in elementary school Ai is on first appearance a quiet and nervous girl that nonetheless tries to project a cheerful attitude to mask it. After overcoming this it can be seen that Ai is also someone that is polite and well mannered and is also someone that is intelligent and fast thinking while also having a strong spirit that refuses to admit defeat. These three latter traits however can be said to be the ones that truly define her as they help form the foundation of Ai’s most prominent skill which is her skills as a shogi player. From the beginning of the series, it can be seen that despite her young age Ai was noted to have an unusual amount of skill when it came to shogi and indeed can be seen to be a prodigy at that sport that is shown best in the first match that she had with Yaichi. In this, it can be seen that while only adept at the basic moves at first Ai’s real skill that continues to improve as the series goes on is her ability to enter into a focused state where she can focus her concentration on reading the shogi board and plan out her moves before they can be made. This type of ability while far from being non-existent is usually possessed by veteran players of the game who have had hundreds of matches under their belt and as a result, seeing a 9-year-old girl have this same ability is indeed something that can be said to be most unusual indeed. In line with this ability is another of Ai’s impressive traits which is her flawless memory which is her ability to remember every move and shogi problem that she had made or solved. When combined with her ability to enter into a focused state the level of ability that Ai has while certainly unrefined at first is nothing short of astounding and ensures that the title of shogi prodigy is an apt title for her. \\n\\n\r\nWhile Ai and Yaichi had the most unusual of first encounters as the series goes on it can be seen that Ai views her master with both admiration and respect and it can be seen that being his disciple is something that she had aspired to do since their first meeting. As a result of this level of admiration for her, master Ai is someone that is noted to have a great deal of pride on being recognised as his disciple and dislikes it when she has competition for this important role. True to this act Ai is shown to be very loyal to her master and will come to his defence at once if someone slanders him something that I felt was admirable of her. As the series goes on it can be seen that Ai’s feelings towards her master is something that easily exceeds that of a normal master-disciple relationship that can be seen in her attempts to please her master and her reactions when she see’s him with other girls. In this side of her, it can be seen that Ai is very conscious of her master’s actions and she can easily tell if he’s hiding something from her through her boosted perception skills something that I find quite hilarious as nothing beats seeing Yaichi being pinned to the wall by Ai’s glare. As the series goes on and as Ai and Yachi’s relationship improves it can be seen that Ai has begun to be more perceptive of the feelings and moods that Yachi projects as a result of the bond that they share and as a result she can feel both joy at seeing her master when he’s happy as well as feel disheartened when she see’s him in pain. This level of perception, however, is a doubled edged sword as while the former can make Ai’s determination to win and fight tenaciously to the end it can also have the opposite effort of affecting her morale and concentration when she senses the bond between her and her master weakening. The character of Ai Hinatsuru I felt was an interesting one as though she’s off a relatively young age the level of maturity that she has as well as the level of skill that she has in Shogi was very impressive. Despite the level of players that she has to face in her journey to become a pro player her determination to face them head on to both prove her skills and his masters trust in her was very admirable. I felt that her seiyuu Rina Hidaka really did a fantastic job at portraying the character of Ai Hinatsuru. \\n\\n\r\nGinko \\n\\n\r\nGinko Sora voiced by veteran seiyuu Hisako Kanemoto of Food Wars and Gunslinger Strato’s fame is one of the main characters of the series and is both Yaichi’s fellow shogi apprentice and fellow shogi title holder. A 14-year-old Junior high school student Ginko despite her young age is like Yaichi a fellow title holder in Shogi that also commands a lot of respect within the community due to her impressive win record against her fellow female pro shogi players. Unlike Yaichi no one denies the skills that Ginko has in Shogi and while she has many titles to her name it is the nickname that her fans gave her that truly make her stand out over her other titles this being the Snow White of Naniwa which is a somewhat ominous nickname.  A childhood friend and fellow shogi disciple of Yaichi Ginko has the unique position of being both a childhood friend and a senior disciple of Yaichi which also makes her somewhat of a mentor to Yaichi as well. As a result of this, it can be seen that Yaichi pays her a lot of respect in deference to this role. A quiet, blunt and confident young woman by nature Ginko is someone that’s shown to be a very determined and highly motivated person that has a strong will to succeed in everything that she does. While quiet by nature and indeed not one for small talk Ginko is shown to be someone that prefers a more direct approach to things seen both in her matches in shogi as well as in life. While conscious of the fame that she has managed to achieve within the shogi world Ginko is shown to be a modest person by nature and will respect those that have played the best they can against her whether she likes them or not. \\n\\n\r\nAs the series goes on however Ginko’s personality starts to gradually change. At the beginning of the series, Ginko was noted to have a very icy personality especially when she deals with Yaichi and in which she’s noted to treat him rather harshly irrespective of the actions that he may or may not have done. This is especially true when she interrogates him for information when she determines that he’s hiding things from her. In this however we can see that the relationship between the two of is not as simple as it sounds as more than anything its obvious that Ginko sees Yaichi as more than a friend and fellow disciple and instead see’s him as something of a rival that can be relied upon to help each other when one needs help in shogi as well as let off steam by playing each other relentlessly. In this, despite the disparity between them in terms of titles, it can be seen that Ginko see’s Yaichi as a rival that’s superior to her in shogi and it is this desire to match Yaichi that truly acts as her core motivation to do well in Shogi. While Ginko, in the beginning, was quiet and somewhat blunt she was also shown to be rather assertive with her demands on Yachi but at the same time, she was also shown to have a rather mischievous side to her personality as well a contrast that I felt was interesting. While shown to be near expressionless in the beginning as the series goes on It can be seen that Ginko was someone that was also very loyal to her friends and was someone that easily got upset if their actions caused them distress a side of her personality that I particularly liked as it contrasted well with her Tsundere personality. This is best shown in her attempts to help Yaichi face his problems during his crisis during the Ryuo title match and her subsequent reaction when she was rebuffed by him. As the series goes on it can be seen that Ginko has a rather interesting complex in which she dislikes being seen and treated as a girl by others and can easily get embarrassed if she has to wear clothing that is typically associated with girls. This side of her personality was an interesting one as her behaviour when she’s in this mode is very much like a cute girl as she acts embarrassed and blushes openly rather than her usual icy Tsundere look. While harsh and violent towards Yaichi most of the time it’s interesting to note that even she has a softer side to her that she will show when she tries to help friends that are in a tight spot. The character of Ginko I felt was an interesting one as though she was Yaichi’s fellow disciple she was also his mentor and it can be seen that both rely on each other to improve their skills at shogi. The contrast between her personality with that of Ai and Yaichi I felt was interesting as it highlighted the fact that while they may have different personalities and approaches to shogi they are all united in their determination to play shogi and respect both the game and their opponents in doing so. I felt that her seiyuu Hisako Kanemoto really did an excellent job in portraying the character of Ginko. \\n\\n\\n\r\nAi Yashajin\\n\\n\r\nAi Yashajin voiced by veteran seiyuu Ayane Sakura is one of the main characters of the series. A 9-year-old girl from a rich family that lives in Kobe Ai Yashajin on initial appearance is an arrogant and self-confident young girl that in the beginning tended to look down on others and was the complete opposite to Ai in terms of personality. While arrogant and possessing boundless confidence in herself Ai Yashajin was also noted to be a cynical person that had a lot of pride in her skills as a shogi player despite her lack of actual combat experience in the beginning and was also fiercely competitive regardless of who her opponent was. Despite that Ai Yashajin was also noted to have a teasing and malicious side to her that she makes use off when she feels the situation calls for it a side that I felt complemented her arrogant personality pretty well. Indeed, from the onset it can be seen that while Ai Hinatsuru has the image of a cute angel Ai Yashajin was the opposite and instead having the aura of a demon as in the beginning she got angry very easily and fought with great tenacity in her matches even when the tide has turned against her. \\n\\n\r\nAs the series goes on however Ai Yashajin’s personality gradually changes as a result of not just meeting Yaichi but also seeing what the shogi world really was like. In the beginning of the series as a result of learning to play shogi through both self-taught materials as well as her parents records and notes Ai Yashajin while having the basics of shogi locked down was noted to have no actual combat experience in the real world and as a result of this often fell into traps when faced with opponents that make use of unconventional tactics. This shows that while she has the basics locked down she was lacking in the ability to read people’s moves and intentions which like in all board games is of great importance. As the series goes on this weakness of her’s gradually vanishes. While still tenacious and unwilling to give up Ai Yashajin gradually gets better at both reading the board and of people greatly improving her chances of victory. While Ai Yashajin as the series goes on generally retains her arrogant nature it can be seen that this attitude of her’s gradually softens as she learns to enjoy playing shogi with others and learn that shogi is not just about playing to win against her opponents but also to make connections with like-minded people while enjoying testing your strength against theirs. While Ai Yashajin and Yaichi did not have the best of first encounters and indeed she at first looked down on him at first this gradually changed as the series went as she was able to see the great effort and attentive care that Yaichi put in to help her understand the knowledge that she would need if she wanted to enter the shogi world and make a name for herself. As a result of this Ai Yashajin’s attitude towards Yaichi gradually changed and she soon learned to both respect his skills at shogi as well as the fact that he treated her like a normal person and did not let her status stop him from treating her bluntly if she did not get anything that was taught. The character of Ai Yashajin I felt was an interesting character as in addition to being polar opposites to Ai Hinatsuru in terms of shogi tactics Ai Yashajin was also every bit the opposite in terms of personality. The gradual thawing of Ai Yashajin’s personality from a withdrawn Tsundere that only played shogi to remember to one that had found that playing shogi in the real world while more punishing was actually more fun and challenging I felt was something that was well done and made great use of one of the series main themes which was that only by playing together would one be able to improve their skills while enjoying the game. I felt that her seiyuu Ayane Sakura really did an excellent job at portraying the character of Ai Yashajin.  \\n\\n\r\nKeika \\n\\n\r\nKeika Kiyotaki voiced by veteran seiyuu Ai Kayano of 3 Gatsu no lion and Anohana fame is one of the main support characters of the series and is both Yaichi’s fellow shogi disciple and the daughter of his master. A young woman in her mid-twenties Keika is a kind, caring and thoughtful person that’s also considerate and understanding of others. In this, it can be seen that Keika fits the very image of a big sister within the shogi family that Yaichi, Ai and Ginko belong too. Unlike Yaichi and Ginko Keika is not a title holder and indeed not a pro player as well and is instead she like Ai is a shogi trainee that hopes to be able to pass the training course and become a pro player. \\n\\n\r\nAs the series goes on and as Keika’s personality is gradually revealed to us it can be seen that Keika has her fair share of problems that are worrying her that she tries to hide from her fellow shogi family members. While positive and relaxed on the surface beneath this it can be seen that Keika struggles greatly with the fact that despite the shogi skills that she had inherited from her father as well as through practice with Yachi and Ginko she hasn’t been able to make much headway with her dream of becoming a pro player while her fellow family members Yaichi and Ginko had gradually overtaken her and achieved fame within the world of shogi something that she punishes herself for. As a result of this, it can be seen that Keika is rather desperate to achieve her dream as unlike Yaichi and Ginko Keika also has to contend with the duo pressure of reaching the age limit and being dismissed from the training class due to defeats. As the series goes on Keika’s fortune and luck eventually changes and makes her realise that while having the pride of being from a famous shogi family was a good thing letting that constrain you and force you to punish yourself was not and that one should be able to walk the path that they want too without forgetting their roots. The character of Keika I felt was an interesting one as despite being happy and positive beneath the surface Keika is, in fact, someone that wrestles with a lot of struggles that are unique to her. This contrast in her outer and inner self I felt was especially well done as it allowed us to see the struggles that older shogi players may feel as they struggle to break into the pro players league while having to battle not just opponents that are not just younger than they are but also more skilled that they are. \\n\\n\r\nIka \\n\\n\r\nIka Sainokami voiced by veteran seiyuu singer Haruka Tomatsu of Sword Art online and Asura crying fame is one of the main support characters of the series and is a fellow female pro shogi player to Ginko. A young teenage girl Ika is an arrogant, self-confident and menacing opponent that has the traits of a classic egotist. True to this personality type Ika is someone that cares little about either her opponent or manners and indeed seems to live only to crush her opponents relentlessly and use this to gain even more power and improve her skills. As a result of this, it can be seen that Ika is someone that hates weak opponents and would slander those that she considers weak as she see’s them as someone that’s not worth her time at all. As the series progresses it can be seen that Ika’s view of Yaichi is an unusual one in that she views him as more like an object than a person one that she only wants to herself and one whose only purpose was to play shogi with her to her heart's content. The character of Ika while introduced rather late in the series I felt was an interesting character as more than ever she represented a strong and fearsome opponent to both Ai and Yaichi in more ways than one that they had to overcome if they wanted to progress in their journey.\\n\\n\\n\r\nAmv \\n\\n\r\nAnimation wise I felt that the series did a very job at showing the main setting of the series which was the city of Osaka and the various locales that the city had. The character designs for the series I felt were also well done and were faithful to their light novel counterparts to which I'm thankful. The animation for the moves that the characters make during the matches as well as the animation for the matches themselves was something that I felt was well done and it made it easier to see the significance of each move as well as how it impacted on the match as well.  In terms of voice acting overall, I felt that the main voice cast did an excellent job of portraying their assigned characters. In particular, I feel that Rina Hidaka, Ayane Sakura, and Hisako Kanemoto deserve special praise as I felt that they did an excellent job of portraying their respective characters. In terms of music, I thought that the series OST did a great job at conveying the various feelings and emotions that lay behind each scene and helped greatly in allowing us to see the types of feelings that the characters were going through at that time. \\n\\n\r\nOverall conclusion \\n\\n\r\nIn overall Ryuuou no Oshigoto was a really fun but also a really interesting anime that I really enjoyed watching this season and is arguably one of this season best anime’s. The series main strong points I thought were the interesting premise, story, characters, animation and strong voice acting and its strong emphasis on having fun while also learning how to play shogi with Ai and her friends. Unlike most countries, a lot of countries in Asia have the belief that if one wants to achieve mastery at something one must start training at an early age. As a result of this seeing, a 9-year-old decide to show up and petition a professional to train her as their disciple is by no means unusual. A lot of people seem to have the impression that this practice is shifty, but this is far from the truth as most martial arts and not to mention board games such as shogi really do start training them from an early age. In fact, as the members of the training class has proven the age of entry is actually between 7 and 9. One of the series main themes is learning to play shogi but as with all learning methods, the disciple would have to while learning how to play also encounter others that have the same goals as them. Humans by their very nature are social creatures and if we encounter people that share our interests its natural that we would want to bond with them. When trying to learn anything its always better if you learn it with friends. While learning shogi is the main theme part of that journey involves forging friendships with your fellow players and playing with them to not only improve your skills at it but also improve theirs as well as without playing with others you will not be able to learn what your flaws are and how you can rid yourself of them to improve yourself. While doing a good job at showing the teaching the basics to both Ai and to us viewers the series also did well to use this theme to teach us that winning in shogi is not everything and that defeat too can be a learning experience and one that can be used to figure out your flaws and correct them. Above all, it stresses that the most important thing is that you are having fun challenging others and learning from that experience and in turn helping both them and you. \\n\\n\r\nWith Shogi as the main theme, it was important that the series not only featured interesting and entertaining matches but also genuine shogi moves that are used for real. In this I felt that the series did a great job at showing this as not only are each of the matches interesting and well designed but they also featured analysis’s of not just the players moves via simple and easily followed explanations but also looks at the players mental state and the feelings that they may be feeling as well. The look at the feelings that one may be feeling as well as at the issues that may affect a shogi player I felt was a good move as no matter how calm one is they cannot ignore every feeling that they may have and these can have adverse effects on a shogi match if you are unable to maintain your calmness. One other aspect that I thought the series did well in was its showing of the various ages of people that play in the shogi world. While largely unknown outside of Japan shogi is a world that can be said to attract people from all walks of life and the ages of people that enter its world can vary substantially which is best shown in the ages of the characters that are featured in the series from the 9-year-old Ai to the 14-year-old Ginko and the 16-year-old Yaichi. To them, shogi is the world that links all of them together. Apart from teaching us how to play shogi the other main theme that series makes use off that it makes use of as its main premise is the relationship between Yaichi and Ai in the form of the master and disciple relationship. Though increasingly rare such relationships do certainly exist, and they are of a more important nature than normal relationships. The relationship between a master and a disciple can be a complex one as the master is responsible for not just training their disciple but also learn to exist with them and learn how to tease out the skills that they may have while also working to motivate them and keep them focused. As a result of this, the degree of trust that can be formed between a master and disciple can be potent and deep one that can inspire a great sense of loyalty to the two that can be used to motivate them or break them out of a jam when needed. While Ai and Yaichi had the most random of first encounters as the series progresses it can be seen that a strong bond between the two gradually forms bonds that not only serve to motivate Ai so that she will do her best to not lose and let her master down but also serve to motivate Yachi to work hard for Ai by improving his own skills so that he can continue to teach her. This feeling of both master and disciple working together to both learn shogi and improve their skills by relying on and finding strength from each other as they overcome challenges together I thought was well done and illustrated just how strong such a bond can be if both master and disciple learn to rely on each other. Overall Ryuuou no Oshigoto was an anime that I really enjoyed as while being an effective anime in its own right its focus on teaching how to play shogi also did well to give it the additional role of an educational anime and had the effect of introducing the sport of shogi to a larger audience which I feel will make it more popular and hopefully give it some new blood. As a final score, I would give Ryuuou no Oshigoto a final score of 10/10 as while enjoying learning about Shogi I also really enjoyed seeing Yachi forge bonds with the many characters that he meets along the way while having fun playing shogi. Bonds that can be as powerful as any strategy that one can use to motivate oneself when caught in a pinch.  \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-03-26T07:40:00+00:00",
            "helpful_count": 36,
            "mal_id": 275157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=275157"
        },
        {
            "content": "The Lolicon's Work is Never Done! \r\nA story about a Shogi master (Yaichi) who begins apprenticing a young girl(Ai-chan) who is a little too fond of him. Along the way we meet a few too many other little girl characters who all seem to have some weird magnetization towards our protagonist and a couple of actual high school/adult aged characters who you'd like to imagine will be actual love interests for Yaichi over the plethora of little girls he has to choose from.\r\nThe show, at its core, is about Shogi... and lolis. But supposedly it's mainly about shogi. Yaichi's struggle to figure out how todeal with apprenticing a young girl as well as balancing his relationships with his fellow shogi friends. The characters are likeable. Ai-chan is your standard cute loli girl who is in love with her master. Yaichi is your typical harem protagonist who seems a little too careless on his words towards his loli fanbase. Ginko is the actually decent aged love interest for Yaichi but her screentime gets smaller and smaller despite that she's supposed to be the only one with a real chance at having a relationship with MC. Ai-chan2.0 is a alright character that ends up getting pushed aside in the end in favor of the OG Ai-chan which is kind of a shame since I thought she should've gotten some more character development.\\n\\n\r\nI really enjoyed watching this show every week and looked forward to it. It's not the end all shogi show but it's also not terrible loli trash like some might suggest... Okay, it might be loli trash but not to the extreme degree some make it out to be. \\n\\n\r\n8/10 overall. 9/10 if you factor in cuteness levels but sadly those don't count in reviews. \\n\\n\r\nTL;DR - A Shogi show with some Loli's on the side. They don't go into that much detail on the Shogi though so if you're new to the game it'll still be fine as a story about a guy trying not to get arrested for his clear lolicon nature.",
            "date": "2018-03-26T07:40:00+00:00",
            "helpful_count": 26,
            "mal_id": 275158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Haaselh0ff",
                "username": "Haaselh0ff"
            },
            "url": "https://myanimelist.net/reviews.php?id=275158"
        },
        {
            "content": "this is like black bullet but with shogi instead of an apocalyptic earth. atleast black bullet had some interesting characters. I would have enjoyed this show a lot more but they showed the loli naked in the first episode itself, which threw me off. so i could tell that this is an anime that most lolicons would enjoy.\r\nI'm guessing more characters are on the way. i did enjoy the show in a way. the art and the animation style is pretty cool, so that is a plus. \r\n4 episodes in and they showed us more cliche stuff that happens in the show. shogi is justthere as a medium for these to happen. which throws me off sometimes. lolicons go for it. if you are bored and have seen all of the other anime, go for it. it's not trash level.",
            "date": "2018-01-29T12:16:00+00:00",
            "helpful_count": 21,
            "mal_id": 270037,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6929465.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ZA_WURDO",
                "username": "ZA_WURDO"
            },
            "url": "https://myanimelist.net/reviews.php?id=270037"
        },
        {
            "content": "Not good on reviews or writing so I'll keep it short and simple. First let me start off by saying: Who the hell watches an anime featuring lolis and then cries about it having a bit of loli fan service and comedy. You are watching a show straight out of Japanese culture. As such, you have to expect this kind of thing as it's (sorta) tolerated over there and a well established part of anime culture. I don't like THICC (I hate this term, they are just fat) chicks with big sloppy hooters, fat thighs and bulging bellies, but you don't see me watching everyshow that features them and then whining about it. Honestly, nobody cares about your opinion other then wanting to know if the show is good. As such on to a real review.\\n\\n\r\nYes, it's a good show despite being predictable. Despite not knowing a damn thing about Shogi I really enjoyed this show. You don't need to know anything about Shogi to enjoy it at all. The show provides the tools you need to follow along without being technical and boring. The story and premise is decent and it has a good cast and some funny dialogue. Despite being put in typical awkward situations with lolis the protagonist isn't some kind of pervert and only ever comments on the girls being cute. Watch it for the lolis and stay for the Shogi, it's a decent show.",
            "date": "2018-05-05T08:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 279832,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hatesu",
                "username": "Hatesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=279832"
        },
        {
            "content": "Honestly, I was disappointed by Ryuuou no Oshigoto, or The Ryou's work is Never Done. \r\nPerhaps it was because Joey The Anime Man interviewed the creator a while back? At the time, I found both Joey's views and the Author's expression of his story to be particularly fascinating, not to mention how high it made in the Kono Light Novel ga Sugoi contest a year or so ago.\r\nBottom line, I heard a lot of things about it and I was excited, and even when the first two episodes aired, I was convinced that there had to be at least something that made it popular enoughfor those high conjectures to be made.\\n\\n\r\nAlas, here I am at episode 4 and I am now thoroughly convinced that the author has no idea what he is doing. \\n\\n\r\n-Half-assing plot points\\n\r\n-Reliance on misunderstandings and coincidences to drive forward its plot\\n\r\n-Exposition that doesn't really add anything to the viewing experience (for anybody)\\n\r\n-Lack of substance (Doesn't follow up on promises its set in any meaningful way)\\n\r\n-Hasn't shown any attempt to take advantage of the premise it has set up for itself (i.e. shogi) nor has it used its premise in a way that makes it distinct in comparison to others of its ilk\\n\r\n-Over-dependence on (loli) fanservice as a plot device\\n\\n\r\nI must admit however before bashing on it further that the production values, animation, and art are actually very good on their own. Along with the visual metaphors the anime sometimes employs, if anything, are enough to create intrigue in the viewer and keep them coming back each week. In fact, no matter how much I think this show needs to learn before being something truly notable, I am still intrigued as to where it goes next, so it is entirely possible I am making this review prematurely and the show gets really good by the end... I highly doubt it.\\n\\n\r\nFirst of all, where Ryuuou no Oshigoto goes wrong is in its over-reliance of misunderstandings, coincidences and other cliches that are typical for romantic comedies and harem anime-\\n\\n\r\nIn other words, this show has a lot of light novel bullshit that we are all tired of, and the only way it differentiates itself from the others of its kind is by not dwelling on it for too long by heading directly to the shogi elements on the plot.\\n\\n\r\nIn normal circumstances, this would be okay, after all, we all have a few of our favorite shows rely on cliches a little at the start before evolving into a fully fleshed out narrative with complicated themes. \\n\\n\r\nThat said, the shows that are able to evolve complex and relatable narratives from seemingly cliche endeavors, are the ones that were using those standard archetypes as building blocks to form their own story, instead of falling back on them whenever it doesn't know what to do. \\n\\n\r\nOne of my favorite examples of this is The Pet Girl of Sakurasou, and anime that nearly everyone loves by the end, yet many will call the first few episodes (cliche) average or expected of romantic comedy anime. The difference is, when rewatching those first few episodes, you really start to notice that Sakurasou was never really cliche or typical in the way it was presented- it had consistent logic and from there, the series was free to grow into an anime that consistently inspired others to move forward in life and face its struggles. \\n\\n\r\nThe problem with Ryou no Oshigoto in this aspect is that the anime doesn't have consistent logic, so it can't properly build off of it's preestablished premise without falling all over itself. In the future, if it wishes to inspire people, or give some sort of deep message, then it will have to make even larger leaps in logic than it has already done.\\n\\n\r\nLet's move onto the leaps of logic themselves- the first of which would be its overuse and general misplacement of loli fanservice.\\n\\n\r\nFanservice in general is a pretty device topic, however, fanservice can be used in appropriate and meaningful ways, especially when two characters have a sexual attraction towards each other. We can see this pretty clearly in fanservice-heavy shows like Monogatari and Citrus and heck, even Karakai Juzo no Takagi-san does it better than Ryuuou no Oshigoto. The Main Character (The titular \"Ryou\"), isn't sexually interested in children as far as we know, however, the show has a way of contriving to get Ai and Ryou together. First, it was Ai walking out of the shower while the Ryou's Best Friend/ Sister was coming in. Ryou freaked out and tried to shut out his sister without telling her what was going on, and Ai basically is giving him jealous death threats while naked and holding him.\\n\\n\r\nActually, this scene isn't all that bad on its own, but the way that this type of forceful fanservice is used later in the episodes is what kind of irks me, however, I do give it credit for not doing a panty shot or something. Instead, the show goes out of its way to forcibly engage the two, while simultaneously going back on all of its promises it previously established. \\n\\n\r\nIf Ai doesn't win against three professionals, her parents will decide to take her home. She doesn't win against all three. With the characterization of Ai's Mother, it was almost guaranteed that nothing would change her mind, but just because the Ryou bowed his head, and the Father was kind of wishy-washy, she decided to back down on a condition- if Ryou is unable to make her a female professional, he will have to MARRY AI AND WORK FOR HER FAMILY. \\n\\n\r\nI don't even understand the purpose of doing this in the first place, however, if you take a closer look at that scene it becomes more infuriating. Not only is this sensitive family matter taking place in public, with everybody staring at them instead of taking it to closed doors, and that it is taking place in front of Ai, but it's also everything else. The Mother did something out of character but is so deadpan that it doesn't even come off as character development, which makes it wholly contradictory. The Father was okay with marrying Ai off to a sixteen-year-old but (even if it would take place a few years in the future) this just isn't something parents should be considering at Ai's age (she's nine). The bigger problem with the Father here is that not only is he used for exposition dump (which technically makes him the surrogate audience character), but that he doesn't find this scenario wrong in any way, not even after all of the arguing, he did with the Mother up to this point. This is bad because having him be the surrogate audience character in the scenes leading up to the revelation, makes his stance all the more convincing from a structural standpoint- as I previously explained how this scene is already incompetent, it is a blatant attempt at getting us to agree with something we should have our own opinions on. It doesn't end there, however, because the crowd that forms there at the dojo also doesn't see anything wrong with it and is more or less cheerful the entire time. \\n\\n\r\nAlso Ai's Mother asks him if he has siblings, and the Ryou answers \"yes\" to a younger sibling, which you would think would be used by the Mother in an attempt to marry Ai off to the alluded younger sibling, instead of the Main Character (Why else would she ask at that moment?), but it doesn't come up again and it remains insignificant I guess. If I had to predict why the author put in that question, it was to allude to the younger brother and I guess he'll come in and have feelings for Ai or something and stick around, but that's just speculation. \\n\\n\r\nThen we get to Episode 4, assumedly the first episode in the second light novel, and I see that this problem is actually getting worse. Episode 4 gives the Ryou another apprentice named Ai (we'll call her Ai Prime) and decides to make Ryou even more stupid. He proposes to another nine-year-old (and the author tries to pass it off as a joke by putting him making him say it in a seemingly contrived scenario, even though it was another case where even a nine-year-old would know the proper response), Ai gets jealous (why?), and he hides the fact he has another disciple from both Ai and Ai Prime for no discernable reason. Earlier in the episode, Ryou was thinking about giving Ai a proper rival, and you would think that he would immediately jump to the idea that the two would be great rivals, but instead he hides it from both of them, and Ai walks in on their study session (that took place in a completely random location) by the end of the episode, and it is treated like Ryou is cheating on her by doing that. Did I mention that Ai Prime is a tsundere? It was cute at first, but with considering how the show has already failed pretty badly at building off of archetypes to add depth to characters, I predict the next episode will have both Ais fighting each/ feeling betrayed and Ryou will finally get the idea of them being rivals!\\n\\n\r\nThere's also the fact that he blatantly tells Ai Prime that she is better than Ai, but I won't go into detail on that.\\n\\n\r\nUltimately, while the experience thus far was intriguing at a surface level, when you look deeper into the crevices of the story, you realize that this show is as hollow as a plastic shogi piece. It's a step above the average, but Ryuuou no Oshigoto itself is nothing special. \\n\\n\r\nIt isn't unsalvagable, however, I see no indication that it would salvage itself later in the future, and even when the intensity gets cranked up in the later episodes, I still have a feeling that it will still be a hollow experience, with an ending that emphasizes how important friends are or how fun shogi is or something. But that's just speculation.\\n\\n\r\nIt doesn't excel in any area, even with the ones its supposed to draw from (i.e. shogi/ sports). March comes in like a Lion is getting a lot of traction for how it emphasizes personal/emotional development using shogi as a thematic underpinning- I can't say that the show uses the rules of the game to create an engaging narrative, but the game itself makes a place for itself in the thematic undercurrent of the series, and if it weren't there it wouldn't be the same show- which I cannot say the same for shogi in Ryou no Oshigoto. It really doesn't have many legs to stand on at this point.\\n\\n\r\nWell, I suppose I'm bashing this show enough. I will update my review after watching all 12 episodes, but I think this is enough of my conjecture for now.\\n\\n\r\nIn the end, this show tries to be smart, and every time it does, it is shackled by some other dumb thing it decides to do. (It's basically only here for the lolicons, that said, it doesn't excel in that area either.)\\n\\n\r\nWelp. This was 3-gatsu no Loli. If you like it, whatever, just don't say it's smart or great because it really isn't.",
            "date": "2018-01-29T14:19:00+00:00",
            "helpful_count": 17,
            "mal_id": 270049,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881426.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Draconix814",
                "username": "Draconix814"
            },
            "url": "https://myanimelist.net/reviews.php?id=270049"
        },
        {
            "content": "I'll be honest, I'm probably older than most people here on this site. There comes a time in ones life where fast-paced activities and hobbies either aren't as viable or aren't as gratifying as ones that require thought and concentration. \"Ah, shogi!\" I thought after spotting Ryuuou no Oshigoto while scrolling through a list of currently-airing anime series. \"I've always wanted to learn how to play! Maybe I should give this show a chance.\"\r\nAfter a single episode, it became apparent that I had made a very, VERY grave mistake. This wasn't a shogi show at all... it was a loli show.\r\nMy therapist had warned methat a relapse into my loli addiction would be possible with even the slightest exposure to lolicon material.  And with that would come the guilt, the anger, the night terrors, the sleep-screaming... all of it would come rushing back to haunt me.\\n\\n\r\nAnd it did...\\n\\n\r\nI work in an office now, and I have a close relationship with my boss. My life was well on-track before watching this dreadful show. Now I can't even look him in the eye. I feel like he knows that I watch shows featuring thick loli thighs. I feel like everyone knows. I feel unclean... My did god curse me with such filthy desires? Is he some kind of cruel sadist? Maybe God is actually dead, and we're all alone, left to our own sick and twisted devices on this rotting space-ball we call home.\\n\\n\r\nThe other day I met my boss' wife. I even shook her hand. What kind of monster was I to simply smile and pretend I wasn't some dreadful loli-obsessed ghoul?! My god... I even shook his SON'S hand!... They invited me to his little-league game this weekend. Should I even show up in the state I'm in?! I'm not so sure...\\n\\n\r\nI'm not really sure about anything anymore...\\n\\n\r\nAnyway, this show is pretty good. It has a cute story and some great art and character designs. I give it an 8 out of 10.\\n\\n\r\nIf you enjoyed this review, be sure to like and subscribe, hit the bell for notifications, and check out my other reviews! Also check out my channel where I do vlogs inside a Taco Bell every Wednesday and Friday until someone kicks me out. On Saturdays I do videos where I try to teach my dog to say \"I love you,\" so I can hear it out of the mouth of another living thing. Lastly, if you know where I can find a gf, please send me a message! Please, I'm so alone I don't kn\\n\\n",
            "date": "2018-03-15T14:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 273897,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5759284.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Minteee",
                "username": "Minteee"
            },
            "url": "https://myanimelist.net/reviews.php?id=273897"
        },
        {
            "content": "This anime he does not want to be remembered for anything other than sexualization of \"lolis\"\r\nStory: 1\r\nThe anime has an extremely pig script treating you like an animal by using various expository dialogues to explain obvious things, even if you do not know \"shogi\" it is not here that you will learn\r\nArt: 6\r\nThe character design is well generic but well functional, the setting is nothing to much\r\nSound: 5\r\nIn the part of sound not to nothing too the soundtracks are generic but functional and the sonoplasty decays a few times but until it is functional\r\nCharacter: 1\r\nGeneric, stereotyped (a lot of \"lolis\" who get extremely strange attitudestowards a child just to do \"\"\"comedy\"\"\"\"which is very offensive, predictable, irritating)\\n\\n\r\nEnjoyment: 1\\n\r\nIt's a dorky anime in what it tries to do but when it puts that \"\"\"comedy\"\"\" extremely stupid in the middle (which anime mind more into doing than the main plot) it's very annoying in those parts.\\n\\n\r\nOverall: 2.8\\n\r\nIf you love \"lolis\" being sexualized without any kind of context and the anime does not work your main plot, this anime will be for you",
            "date": "2018-02-18T19:43:00+00:00",
            "helpful_count": 6,
            "mal_id": 271897,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6087095.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Heikor",
                "username": "Heikor"
            },
            "url": "https://myanimelist.net/reviews.php?id=271897"
        },
        {
            "content": "I feel like i shouldn't need to explain it but Shogi is not this intense or interesting ! \r\nI've seen two old people playing Shogi before and it's one of the most boring things i'v ever scene. It's more boring then being in a Hospital room by yourself without anything to entertain yourself with while you wait for the Doctor. Hell, I've even played Shogi once and i was bored to tear.\r\nWhile i didn't really enjoy myself when they were actually playing Shogi ( That's a pretty big negative for a show based around it) I did find myself liking the world and the charactersinvolved with it. \\n\\n\r\nAt first the characters aren't really that interesting. But then i found myself enjoying the characters like Sis and the Bodyguard chick. \\n\\n\r\nHonestly any and all of the Loli's in this are adorable. \\n\\n\r\nAi and Char Char ( I think it's her name ) Are awesome and fun to have on screen. \\n\\n\r\nI do have some scenes where it's trying to make it seem like Ai's match is really important but it's really not. Especially when we have a second plot of one of the older girls trying to become a professional player that is much more interesting. \\n\\n\r\nThe main Antagonist is also kind of nice but i feel they messed up his execution.\\n\\n\r\nFor a Show about Shogi he's actually not bad. All throughout we hadn't heard him say a single word tell the episode and i'd say that was a mistake. I think it have been better if he never said a single word. \\n\\n\r\nAlong with never showing his face. Normally we'd only see the back of his head or rarely just his mouth. I feel that if they kept him as a more mysterious Antagonist it would've been more enjoyable. Give him some secrecy and keep us more interested however much more. \\n\\n\r\nHe's not the greatest Antagonist but he's actually pretty good for a show just about Shogi.\\n\\n\r\nI wish this show just had a girl Protagonist. Imagine how much more interesting this would be if the story was from Ai. A girl about the age of 10 or 11 going through a world completely unknown to her while also having to deal with people not taking her seriously and her having to prove herself by her own skill alone. \\n\\n\r\nAlso i just don't like the MC that much and i like Yuri a shit ton more then this. But hey that's just me. \\n\\n\\n\r\nThe group of loli's in this i obviously like. But i honestly think i would've enjoyed the show a lot more if it was just about the girls. I like imaging the Loli's become friends and imaging the the two Ai's have a close relationship together as they go through High School. One being more rude while the other one being the nice and kind one. Hell, I honestly think they would be a good couple together ( When they're adults and not Loli's. I'm not weird) I would love for this to be a spin of series tbh\\n\\n\r\nFinally i just find something sad about these girls being obsessed with Shogi. Like the two Ai's alone have tremendous skill with one of the Ai's having a brain like a computer. But all that potential is gonna be used on a boring board game of Shogi. \\n\\n\r\nOverall i surprisingly enjoyed myself more then i thought i would with this being a show about something i don't really care for.",
            "date": "2018-03-27T05:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 275304,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=275304"
        },
        {
            "content": "“Ah Mr.Officer its not what it looks like! I’m not a lolicon” To sum up this anime I only have a few words, lolis! Lolis everywhere! Ahem, back to the review, contains minor spoilers.\r\nSo the anime starts off with the Mc in a intense “Ryuo” match(this is basicully a tournament to earn the title of “Ryuo” which is a prestigous title in the shogi world) there he meets a yumm- I mean cute loli called “Hinatsuru, Ai”. Major spoiler he wins the “Ryuo” match, nah jk it is called “The Ryuo’s work is never done for a reason”. After winning and becomming the youngest Ryuoever at the age of 16. After a quick transition the Mc enters the his apartment and behold the loli is there asking to be his diciple. He accepts and finds out that she is a prodigy at shogi and then is it basicully a slice of life where they play intense matches of shogi which some are official matches. Then more lolis get introduced and the plot thickens(Insert lenny face) He also aquires the title of “Loli king” later on so expect some big things from him later on :)\\n\\n\r\nLets discuss the important characthers: First is “Ai” his loli yandere diciple, she is a prodigy and Mc sees a lot of talent in her. Then is “Ginka” who he calls sis when they are not realated but because they trained under the same master. She is basicully the cold type of person and is in love with the Mc but is the type to abuse him, she is also quite good at shogi. She is also the one the bestowed the amazing title of “Loli king” onto the Mc. Next is the hot mature “Keika” she is 25 and she wants to become a female proffesional however she is not good enough as she keeps losing in the training group and her time is running out as once she is 27 she can’t goto the training group.\\n\\n\r\nCharacters are pretty cute and I liked the art style and comedic at times, just an anime I say to pass the time, wouldn’t really call it a master piece of anything. Yes this anime is about shogi, most of the time I had no idea what was going on when they were playing shogi but still pretty enjoyable as they made the matches quite itense.\\n\\n\r\nNow onwards men! Into the kingdom of lolis!\\n",
            "date": "2018-07-24T01:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 284644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5889280.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yip9090",
                "username": "Yip9090"
            },
            "url": "https://myanimelist.net/reviews.php?id=284644"
        },
        {
            "content": "I would first like to state this review contains some spoilers as I needed to discuss the final arc and certain scenes with characters.\r\nStory: 5\r\nThe story is certainly not the strong point of this series. It follows a young shogi prodigy and his daily antics of being a professional shogi player and a Loli harem king.\r\nWhile some arcs are seemingly pointless some are rather good. For example, Keika attempting to be a professional player after so many years of trying. And the final Ryuo match where Yaichi overcomes his slump after turning away his friends. Both were rather heartwarming but still had their respective faults.\r\nHowever,as we neared the end of the story it felt fairly rushed. Firstly, cutting off a potential arc of Sora and Yaichi making up after their argument prior to the Ryuuou match. And even more so in summing up his final 3 matches in a single sentence and leaving it at that. Right after the excitement of his win, I felt it was a slap in the face to be told that he simply won all the rest of his matches in one sentence. It doesn't make any sense and is very anti-climactic\\n\\n\r\nAnimation: 7\\n\r\nThe animation is quite nice. Always smooth and pleasant to look at. This section was well done. There isn't too much else to be said.\\n\\n\r\nSound: 7\\n\r\nAfter about four episodes I had downloaded the OP to my phone. I think it's great and matches the upbeat opening very well. The ED was also quite enjoyable.\\n\\n\r\nSound during the anime was good. No glaring issues but nothing special either.\\n\\n\r\nCharacters: 4\\n\r\nOther than a couple main characters and some sides I feel like many were introduced simply for fan service. However, as a comedy, some of their moments were fairly funny (for ex. the announcer girl) and enjoyable.\\n\\n\r\nThe show had many of the classic character archetypes we have all seen before but they were still made enjoyable.\\n\\n\r\nNo characters were really all that deep aside from Keika (who still wasn't all that deep) whom we learn of her past struggles. Of the others, we don't learn too much but the arc in which Ai gains family approval is quite nice too.\\n\\n\r\nAs per usual in anime, MC's are either dense or beta. And Yaichi follows the trend with his attitude towards Sora. The scene on the beach and his later argument in which he was never shown apologizing for were not pleasant. Character fights that involve drama can create good tension in a show but in this show, I don't feel that sort of drama was needed. But if it was going to be there, as they did, please at the very least resolve the character drama and don't just forget about it. Sora was one of the stronger and more likable characters in the show imo. How can one be so dense? And how can one not apologize for what he did? I don't know. But if they grew up so close you would think he would not just ignore her right when he is thrown countless lolis. But oh well.\\n\\n\r\nEnjoyment: 7\\n\r\nI largely enjoyed this show as it was colorful, eye-catching, and fun. Cute girls playing shogi? How could I not? Even with mediocre story arcs some prevailed and made us feel a bit for the characters. While other may have made us hate them a little too (Fking apologize to Sora).\\n\\n\r\nBut overall lolis and shogi were never going to make a masterpiece of an animation. However, what it did make is an enjoyable comedy with some drama thrown in. Was the drama really needed? Probably not. But it wasn't bad, and the ending was fairly nice and lighthearted as well.",
            "date": "2018-05-05T07:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 279829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5681977.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sistine-Fibel",
                "username": "Sistine-Fibel"
            },
            "url": "https://myanimelist.net/reviews.php?id=279829"
        },
        {
            "content": "\"It can be better, but it chose not to.\"\r\n\r\nPros\r\n1. Cute characters\r\n2. Great details on Shogi\r\nCons\r\n1. Boring art style\r\n2. Rushed adaptation\r\n\r\nI heard about this series through it's winning in the Kono Light Novel Ga Sugoi Contest 2 years in a row, beating series like Snafu and Sword Art Online. It was shocking to see a light novel about shogi with lolis can beat series like SAO in a popularity contest, so I waited for the anime to see how this series handles its loli characters and also the Shogi element. \r\nAfter finishing the series, I have to say that it's quite disappointing, but Istill had fun watching it. There are two things that this series fails at, it's adaptation and it's art. Now let me start with the adaptation part. I only gathered this information based on comments from fans of the LN. Apparently this is a failed attempt at adapting the LN, which I can agree. As an anime only, I can also see a lot of important events being rushed. A lot of the contest were quickly glanced through just to go to the final match. There is seriously a lack of explanation at scenes throughout the series especially near the end. Secondly, the art for Ryuuoh isn't that good. It isn't as bad as Marchen Madchen next door, but compared to a lot of series running this season, the only anime I can find on par with Ryuuoh in terms of art is Mitsuboshi Colors, which is also pretty weak at the art department. The only thing I like about Ryuuoh's art is how the characters' eyes were drawn, especially when the characters are being serious while playing shogi, their eyes are beautifully drawn.  There are also so points within the series where the characters just look badly drawn. Well, coming from Project No 9, it isn't really surprising just by looking at their previous works.\\n\\n\r\nNow moving on to the good part. First its the characters. I like each character in this series. It really isn't because they are well fleshed out or anything, it's just I like how the characterization for this series is done. Among all the characters, my favorite one is definitely Yashajin Ai. I just love her design very much. Development wise, there are some minor development for each character but nothing grand, some examples being characters getting better at shogi, overcoming their fears, having confidence in themselves again etc. \\n\\n\r\nThe details on Shogi is also very apparent in this series. If you know at least the basics of shogi, you can really learn from each of the contest in this series. They really did explain each step well. However, if you aren't familiar with Shogi, then you won't understand anything during the match. Personally I am in the latter part, but I still enjoy watching the matches, maybe because I also play chess and I know the feeling of not wanting to lose easily.\\n\\n\r\nSo overall, I enjoyed watching Ryuuou no Oshigoto, but is it a must watch from this season? No. I will recommend you checking out the LN if you really like this series. I would only recommend the TV anime if you want your daily dose of loli cuteness. Otherwise, just skip this series or just go read the LN.",
            "date": "2018-03-29T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 275567,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=275567"
        },
        {
            "content": "Ko, ko, ko, ko, ko, ko, ok enough of Ai's \"Ko\" moment , so an anime with a loli vibe has just finish. Shit , it kinda sounded like that Ai's is doing that woman on top straddling her seisoh is a sexual way. But, enough of that, ko, ko, ko, ko, ko, how I find this, ko, ko, ko,ko, ko:\r\nPoor 3, Story: \r\nThere is nothing like making something as simple as a Shogi to make is as exaggerated as usual, I mean,  with such busy live do them Japs still give ashit about Shogi these days? Ok, so let's get back to business,we have a guy who is a high ranking shogi player who all of the sudden finds himself having a padawan in a form of a little girl named Ai Hinatsuru, after making such promise from a game, where it doesn't seems to require a lotta effort to play and yet his overacting that he is in such exhaustion that he become this soooo stupidly desperate for water form a loli like Ai was just toooooooooo annoying.  Also him ( Yaichi Kuzuyuu) being this too obsess of losing from an old timer like  Meijin is something that I would like to see the who ever is this anime/novel/manga's creator Shiratori get beating up. This anime's plot was nothing more than a loli love, cu'z the main character has whole bunch of them and Ginko his onee chan who is younger than him and in junior high  can qualify as part of the guy's loli harem. \\n\\n\r\nDecent 4, Art:\\n\\n\r\nNothing hot nor kinky around here, in fact Ginko's swimsuit fanservice is quite lousy. \\n\\n\r\nFair 6, Sound: \\n\\n\r\nNo Comment for me around here, cu'z I simply don't give a ko, ko, ko, ko, damn as to who did who.\\n\\n\r\nPoor 3 Character: \\n\\n\r\nOk so let's go over them characters: \\n\\n\r\nYaichi Kuzuryuu- The Jedi master of Shogi, for him to have the title \"Ryuo\" at 16 was just too much of the Japanese quintessential of young people who needs to grow up fast that him having such title and being this boy who loses to a grown up like Mejin and can't accept it, was just too much of an ill fitted part in a motor. Also him having a loli romance with Ai Hinatsuru and having an affair with another Ai as in Ai Yashajin simply make him a womanizer of sort, that the creator himself was trying to make it look innocent as he jumble from his loli harem padawns to the two Milfs like Keiko and Tamayo , let's not forget his one time fling with Ika.\\n\\n\r\nAi Hinatsuru- For me she is this brat who need some spanking, cu'z how the hell can a 9 year old can have the thinking of an 18 year old, again she is another ill fitted part in a motor.\\n\\n\r\nGinko Sora- She would have been fine to be Yaichi's girlfriend, but being this 14 year old and being another Jedi master of shogi in such young age and  being as aloof and frank as a 20 year old makes her a waste of opportunity for the guy Yaichi to be his wife. I really feel bad for her.\\n\\n\r\nAi Yashajin- To me that girl can surly use some major attitude adjustment.\\n\\n\r\nLet's face them characters where just a bunch of ill fitted parts and that's that.\\n\\n\\n\r\nGood 7, enjoyment:\\n\\n\r\nNevertheless, this anime was still enjoyable to such extent, but the comedic aspect is lost in the last 2 episodes when the relationship between Ai and Yaichi becomes closer than just padawn and master, so..........\\n\\n\r\nGood 7, Overall:\\n\\n\r\nIn the end this has more to do with the guy's relationship with a young girl and though it was good, the title and the genre weren't up to standards as to what the anime was suppose to be.... so, season 2? Ko, ko, ko, ko, ko, ko no way jose.\\n\\n\r\nKo, ko, ko, ko, ko....\\n\\n\\n\\n",
            "date": "2018-03-28T12:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 275473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=275473"
        },
        {
            "content": "Ryuuou no Oshigoto is a controversial anime. One one hand it can be accused of being a lolicon bait and a harem (not that I mind either of those). On the other, shogi games are well made and can get really exciting.\r\nFirst question that comes to mind: do you need to know shogi rules to enjoy it? Not really. I assume a person with deeper understanding of game could find something more in this anime, but as someone who barely knows basics of shogi, I didn't feel too limited by it. Show mentions many moves and strategies, but parts important to follow the story areexplained well enough.\\n\\n\r\nRyuuou no Oshigoto's story is mostly focused on characters, their interactions and development. While shogi is used as a background and a driving force for them, I believe liking the characters is required to enjoy this anime. And this might be hard for some, considering how varied is cast - we have an abusive tsundere, a loli himedere with tsundere tendencies, a loli with yandere tendencies, onee-san character, full psycho yandere... aaand some more lolis.\\n\r\nOh, and most of them are interested in protagonist. Now, don't get me wrong. I'm a fan of harems, and while Ryuuou no Oshigoto doesn't put too much focus on this aspect, I sure enjoyed it. \\n\r\nReading that you probably expect Yaichi to be typical harem MC. That's not the case. He sure is clueless, but other than that I'd say his actions are reasonable and don't make you want to strangle him. He makes mistakes that are understandable and fitting from story perspective.\\n\\n\r\nOutside of nice Slice of Life atmosphere we also get shogi games. I have to admit, those are really well made. Thanks to good introductions, great music, effects and monologues, seemingly slow and \"boring\" games turn into something very exciting and emotional. Even though in most cases one can predict the outcome, they still managed to keep me on the edge of my seat.\\n\\n\r\nWhile art in Ryuuou no Oshigoto isn't anything special in general, I have to mention characters design here. They are pretty. This anime doesn't really go into full fanservice mode - instead the service is done by more tame (in broad meaning...) interactions that shine thanks to characters designs being well used. Example of what I mean here would be Ginko's lips, stockings or occasional midriff. Good stuff.\\n\\n\r\nI'm not sure if I managed to rely it properly in indirect way, so I'll write it directly as a summary: it's a light and enjoyable anime, don't take it too seriously and just enjoy it. I might forget it in few months or maybe even weeks, but I absolutely don't regret watching this series. I believe this title was meant to be a pleasant time killer and it fulfills this tole perfectly.",
            "date": "2018-03-26T13:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 275206,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=275206"
        },
        {
            "content": "We've had series about edgy card games where everything is on the line, mechas to save the planet, battles of magic and technology for the sake of domination or peace....and then, we get the lighthearted series where the japanese \"chess\" game known as shogi means everything in the world in this story. And yes, I know, it's lolicon bait, but honestly, that's not what's really important here. It's a shame that people are probably sleeping on this series, cause it's quite enjoyable in its own right.\r\nSTORY: It's a fairly good setting where shogi means everything like Duel Monsters are with all the yugioh series. Ifound it very interesting how even a modest looking game of shogi can actually be full of tension, and how it can be relatable to real-life situations. Something I did find a bit offputting is how the main character is not really focused on academic goals anymore and is basically already having a job as a pro player, but then again, there are many people out there in real life who have taken a similar route when school never worked out for them or when they found an interest stronger than pursuing academic education. The \"loli bait\" setup is real when it came to the shogi schools, but other than that, I personally didn't feel that bothered by it. The chance meeting with the self-taught prodigy Ai (who is still not even in middle school, mind you) is also kinda cliche, but important, nonetheless.\\n\\n\r\nART: The art is clean and doesn't try to emphasize so much. I do especially like when the \"cow lick\" hair of Ai moves on its own like some sort of muscle or antennae, and it really adds to how adorable looking she is...cause physical appeal is always a plus, imo, as long as it's not forced. I also do like when the character show priceless expressions, be it scared to death, shocked beyond belief, or angry enough to scare the shit out of people.\\n\\n\r\nSOUND: The soundtracks are not really that great, honestly, but I DO like the soundtracks during the actual shogi matches, where the music can really fit in with the tension of each player's moves or expressions...it can really get you glued to the screen even if you're the guy who prefers more violent sci-fi or supernatural action.\\n\\n\r\nCHARACTER: I personally thought the characters were well thought out in terms of complexity, backstory, and appeal. Also, it's hard not to make a yugioh reference when it turned out there were TWO Ais in this series....the main one, Ai Hinatsuru, who plays well with strategies and is basically the \"closer\" in the end game, and the alt one, Ai Yashajin, who plays the basics to perfection. Both young girls have their strengths and weaknesses, as well as backstories and personalities, that are almost perfect opposites of each other. To have that kind of setup for these characters is awesome and really sets the tables for the development and maturity of those two. A similar theme applies to Yaichi, the main protagonist, and Sora, the other main heroine; they are basically the \"other me\" of each other, displaying the same level and strength of shogi play, but having contrasting play styles. Now, what I thought could've been done better would be to elaborate a tad bit more on the supporting cast, especially the three other young shogi students Mio, Ayano, and Charlotte.\\n\\n\r\nENJOYMENT: I was more into this series than I hoped for. Was it because of the loli service? Maybe, but I wouldn't view that in a negative light at all, even if I was more critical of this series. The laughs are WELL worth it, too, especially when it involves the \"main\" Ai or Sora(otherwise known as the Snow Queen and a \"GOD\" shogi player) getting hella pissed off at poor Yaichi. In addition to the laughs, the shogi matches are actually very engaging to watch, as one anxiously waits for a winner. It's something you'd kinda recognize in most sports anime series.\\n\\n\r\nOVERALL: If you're \"loli-phobic\", I can understand why you wouldn't want to watch it. The thing is, if you don't let the lolicon bait material get to you, the series is actually pretty good. Granted, it's not for everybody, considering how lighthearted overall the story is. However, I think the journey and the development matter the most, as long as the other things are not too much of an eyesore.",
            "date": "2018-03-26T08:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 275163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=275163"
        },
        {
            "content": "Honestly I was very skeptical when getting into this anime, I was like \"what is this ? Sangatsu no Lion for lolicon middle schoolers ? \" \r\nTruth be told Sangatsu is one of my favorite anime series I love the realistic drama, deep characters, interesting story progression I love everything about it. This anime didn't seem to have that kind of vibe so I really underestimated it. But here comes the weird part:\r\nIT DOES NOT HAVE THOSE THINGS BUT IT STILL MADE ME LOVE IT !\r\nI don't even know why !\r\nFirst episode was like \"Okay I got a good chuckle but whats with the hugeloli baits\"\\n\r\nSecond episode was like \"Oh that was funny, I guess it's not bad after all\"\\n\r\nAnd before I knew it I was waiting for the next episode to come out with excitement. Hell if I know why it became my most anticipated anime to come out weekly. I watch every episode twice, one alone and one with a Son Wukong reaction video. And I never get bored, I always laugh I always get full enjoyment out of it.\\n\\n\r\nIf you think about its parts separately and with a logical stand-point you won't see why it's enjoyable, the blend of these things just is. Its a fucking mystery I tell you. I guess it's also about who is watching it.\\n\\n\r\nGreat comedy (comedy is subjective so it might differ from the reader's tastes),\\n\r\nlight hearted episodes but also some real drama and real shogi battles going on, it's not totally a lolicon anime (... who am I kidding but atleast it's not creepy with it.. only sometimes), top quality waifus (Sora Ginko top waifu, I will yu-gi-oh battle anyone who claims otherwise. It's time to Du-du-du-du-du-duel !)",
            "date": "2018-03-03T08:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 272889,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727954.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marchearth",
                "username": "Marchearth"
            },
            "url": "https://myanimelist.net/reviews.php?id=272889"
        },
        {
            "content": "No doubt geared towards Shogi players (as it occasionally goes into technical details), but even if you don't play it, this is a fun series.  It's not high on the comedy scale, being more drama than anything, especially how characters deal with losing games, as well as winning.  Some also have to cope with the possibility of never being able to compete professionally.\r\nMatches are shown sparingly or in a highly dramatic form, which whilst not accurate (hopefully), it does make things interesting.\r\nThe characters are nice but flawed - the protagonist especially so, who is essentially being forced to mentor two girls with thethreat of an arranged marriage and having to work elsewhere if he fails in his mission.  In addition to that, he also has to cope with their jealousy towards his friends, and their other problems, and the fact that there are players better than himself.\\n\\n\r\nHis other competitors all have different personalities, but all do seem nice although highly competitive.\\n\\n\r\nAnimation wise, it's nicely animated.  3D graphics are used sparingly.\\n\\n\r\nTitle sequence music is good, but the ending one is rather boring.\\n\\n\\n\\n\\n\\n",
            "date": "2018-02-12T10:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 271355,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962652.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sku_Te",
                "username": "Sku_Te"
            },
            "url": "https://myanimelist.net/reviews.php?id=271355"
        },
        {
            "content": "First of all, gotta say I don't usually write reviews. I like being critical but it's something I don't do out in \"public\" because of how outrageously agressive the anime community is lately. Furthermore, this isn't a technical review, it's an opinionated speech about why i think you should watch \"Ryuuou no Oshigoto!\".\r\nHowever, with this show i felt like i had to do something. You know, this show may be as trashy as you want, and it is probably true. And even though it is, it managed to be fun, heartwarming, dramatic and even emotional (at least to me). And yes, it's filled to thebrim with cliches, and if we go into the more technical stuff the story was average at best and the characters could've been more deep or well written. Tthe animation wasn't the slickest either, and the whole loli theme may have been over the top as well.\\n\\n\r\nAll that being said, this show was sommething I enjoyed, something not dense enough to have to take some time after a few episodes nor light and trashy enough to make me wanna cut my veins for having completed it.\\n\\n\r\nIf you're an anime elitist don't watch it, go bach to your masterpieces, because it'll piss you off, and you know it. On the other hand, if you think of yourself as a tolerant viewer give it a shot, it will crack you up for sure. I'm not saying it's a masterpiece, but it has wit and it doesn't take itself too seriously either, making it an enjoyable ride.\\n\\n\r\nIf you watch anime for anything else than being a bitch about every little detail, like for example, enjoyment, give it a shot, it may surprise you.\\n\\n\r\nThanks for reading.",
            "date": "2018-08-11T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 286243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4128649.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BrightColorLover",
                "username": "BrightColorLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=286243"
        },
        {
            "content": "Another review for my fans. Wait, I don't really have any. So anyway here I go.\r\nDear Author, you suck at adapting your story, please die, and beg for forgiveness!!!\r\nI wanted it to be rated by me to 8 or 9 but the story was ACHING fast paced and those background characters doesn't even have a single backstory line/scene in the series, then the most crucial of all is the love story or relationship between Ginko and Yaichi didn't bloom enough to the point that they should at least kiss, ACHE you author!!!\r\nAnd now the original plot for chess in japan called shogi, shogi is nota popular game in the whole world so creating this plot is only good for those in-you-know. This could be a great anime if they made it up to 26 episodes. So many comedies within the series but its too short!!! The most touching scene of all is the ending, even if I was unsatisfied with the anime series, they tell the whole story in summarized ending.",
            "date": "2018-05-23T07:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 281243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2264483.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/astralkill00",
                "username": "astralkill00"
            },
            "url": "https://myanimelist.net/reviews.php?id=281243"
        },
        {
            "content": "Honestly it's mostly underwhelming. It seemed a bit to slow for my taste, I wouldn't say it's bad just kind of meh to be honest. I plan to finish it at some point but for now (as of the time writing this review) I'm just going to put it on hold. I would say that it has its moments, and that I was interested in some of the characters but I guess it just wasn't my cup of tea. Anyone who likes some serious competitive tension mixed in with comedy frequently enough should check it out, but (at least in my opinion) it was atad bit boring at times. when it does comedy it does it well at least.",
            "date": "2018-05-05T05:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 279824,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7222123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fuzzyhugs01",
                "username": "fuzzyhugs01"
            },
            "url": "https://myanimelist.net/reviews.php?id=279824"
        }
    ],
    [
        {
            "content": "I unironically enjoyed the show way too much, despite it having glaring flaws and many smaller missteps. I also give it points for novelty - if there's anything else like this out there, I haven't seen it. Not that I have looked all that hard.\r\nThe story is a sort of a romantic comedy, with pandering to male fantasies, between an eager nine-year-old shogi prodigy and her 16yo shogi master.\r\nThe premise is set up with a more gratuitous and racy tone than the rest of the show has. The setup has an obvious culmination, so the slight switch in tone shouldn't be confusing. Otherwise it staysabout what it was so blatantly set up to be about.\\n\\n\r\nThe show manages to gesture at honestly sweet innocence, which I loved. Much happens to hint how true the romance could be. On the other hand, there is fanservice throughout, the male cast is bare-bones, and the plot likes to advance by introducing yet another woman. It's subdued and excused enough that the two themes don't clash much, and there are also long serious sequences, so it's not an \"at least thrice per episode\" scenario.\\n\\n\r\nLightheartedness carries the bulk of the show. Most of it I enjoyed, but I couldn't say I was in tune with the sense of humor. The match with the young gay man made me just despair, so I should let you know it doesn't get anywhere near that bad again.\\n\\n\r\nAfter the setup, little is shown of the pair's private life. For further mystery, a small wedge of ambiguity is left in the boy's actions. It begs the viewer to infer things from everything else, elevating said everything. That might sound like a good concept, but unfortunately it's actually lazy and f*cking st*pid. It saps the drama and leads to issues with the girl's character. She ends up being forgettable and front-loaded, actually becoming shallower as the story progresses. It's not that she doesn't get screentime. In fact, she gets almost everything you can have when boxed in so hard. The ending does leave a mark on her, but that's so cheap and late I won't count it. Her character still sort of works, because not much is required of it, but it would have been such a boon if they'd managed to make her at least a bit memorable.\\n\\n\r\nBy contrast, the boy starts as a bit of a trope, and gets neatly grown without being totally subverted. Ginko and Keika also get developed.\\n\\n\r\nI was expecting the show to play coy, but I don't think it ever did. There was one hotel scene that would have been clever that way, while still achieving the same purpose and more, but they have the girl blush.\\n\\n\r\nThere is also drama, as one should expect. Tragic notes are played, with bitter echoes. Fun, somber scenes of unjust, spiteful enjoyment. The climax made me feel things. It faltered far less than I expected.\\n\\n\r\nThe shogi setting fits well. Essentially everyone is a professional player or aspiring to be one, and their primary motive is love of the game, rather than anything of the earth. Still, I would have liked if there was more of anything that doesn't come right back to shogi.\\n\\n\r\nThe audio/visuals were good enough for me, for the most part, and there were also high points. At one point the girl ends up feverish in bed due to stress, and the thought crossed my mind that they didn't know how to make her look worn out and depressed.\\n\\n\r\nTo end on a positive thought, I'll repeat that I really liked it :D",
            "date": "2018-05-04T00:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 279739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7216058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sinisempi",
                "username": "sinisempi"
            },
            "url": "https://myanimelist.net/reviews.php?id=279739"
        },
        {
            "content": "Ryuuou no Oshigoto! or also known as The Ryuuou's Work is Never Done! or even more commonly know as straight up loli shogi. If you check the studio's past works, you'll notice that they have done two other loli-based series, one that is pretty well known, Ro-Kyu-Bu! (Loli Basketball). This with how it sounds from a general description gives off the vibe off just being another loli-centric series with shogi as a tool to just further the loli-pandering. But boy was I wrong. This show does have a focus on lolis, but also on shogi and although they do not go in-depth and explain howthe game works, it can still be very exciting to watch. They showcase the many different matches of our characters, ranging from a JS all the way to our Christmas Cakes with each of them playing at a higher level than the average player as they're not only trying to compete to become a professional, but against other pros too. \\n\\n\r\nThis show does take advantage of it's use of lolis to put in whatever quips it can to make our protagonist out to be a lolicon, but it does have other jokes available as well, so you won't be tired of seeing them outing him out as one. They have different jokes for the cast they have, with Ayumu, it would be chuuni stuff, with Ginko, it would be just her icy demeanor as she tries being a 'tsundere' and so on. You would see more different characters as you watch and most add something to it for their time there.\\n\\n\r\nNow back to it being exciting to watch. They put some superhuman like abilities into use for some of these, as well as having the intensity of the matches being able to keep you at the edge of your seats. They do add some visuals to add onto this which can make it look ridiculous as to what it is going on, although some may be overboard. Personally I found this to be more fun to watch. I had also decided to pick up on shogi and learn the rules a bit which makes the show even more enjoyable with the added knowledge of knowing what the characters were doing, although it is not necessary in my opinion as some of these matches can go by so quick that you wouldn't be given enough time to see it happen but just have the general idea. \\n\\n\r\nThe music is pretty fun, I did like the oriental bits they played during the matches, but can't really say to much about it. And I would have to say the story is not it's strong suit as there is not much to tell other than they are learning shogi and trying to better themselves while facing their opponents. The appeal is from the characters and the matches which is to be expected with these kinds of shows.\\n\\n\r\nAll in all, it is something that can be very fun to watch if you are looking for a sports/game show without being too familiar with it. It does tend to glaze over some matches, but definitely puts focus on the major ones which is what really makes them more appealing to watch. The fact that this show gave me the final push to go and start playing shogi because of how much fun I was having watching them play is the reason why I decided to give this at least a 9.",
            "date": "2018-03-27T02:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 275290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5230243.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Killthief99",
                "username": "Killthief99"
            },
            "url": "https://myanimelist.net/reviews.php?id=275290"
        },
        {
            "content": "Keisatsu or FBI joke aside.. Ryuuo still has its merit.\r\nAs former fans of 3gatsu lion and 81diver, this is not my first shogi anime (or manga). Though this one is more lightweight than others, but don't let the loli-invasion or first impression deceiving you. Well I don't have any problem with harem or loli or cliche romance, as long as it's offer another aspects to enjoy. Though I understand some people might feel disgusted by that, maybe they're still too pure, lol. \r\nSo what is this show offer besides cliche situations we could see in first few episodes? To my surprise, Ryuuo actually pretty seriousin terms of shogi as well as it's characters. Yes, the plot is not as intense as 81diver, and the romance or daily life is not as sweet as 3gatsu lion. But we still be able to enjoy shogi worlds and the heavy competitions around it (though I'm not sure if they represent RL shogi in Japan), also learn some knowledge and few tricks in playing shogi if that's your thing.\\n\\n\r\nAnd if we talk about characters here, you won't feel bored by those at all. Because the others beside the MC or it's apprentices are not just side kicks. They have proper introduction and back story also slight development. Of course, this anime is still airing and still halfway till the end, so we can't see much of them. We absolutely can't compare this to 3gatsu lion which have almost 50 episodes so far. But Ryuuo offer interesting characters, including MC who isn't just simple lolicon but actually someone who can be good master/teacher. The Ai-chan (both of them) also interesting in their own way (I mean their personality of course :3)\\n\\n\r\nSo far, I have good time watching this. There are few things I can learn (which is weird, coming from comedy anime), there are even some emotional scenes, though not enough to put onions in front of my eyes but still done well. As for fan services, they're not going overboard with it and still bring me smile sometimes (no, don't get wrong idea here >.<). Hopefully, they keep this quality till the end, I think this anime deserve good points and definitely worth your time.",
            "date": "2018-02-23T03:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 272226,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3023903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Juarez",
                "username": "Juarez"
            },
            "url": "https://myanimelist.net/reviews.php?id=272226"
        },
        {
            "content": "he show is funny, lolicon, if you have watched the following recent anime:\r\n- Tenshi no 3P! (Angel's 3Piece!)\r\n- Eromanga-sensei \r\n- Imouto sae Ireba Ii. (A Sister's All You Need)\r\nthen, its similar type of thrill  but in different setting where each story you will find similar age main character , lolicon angel (innocence), same harem life approach (Lucky Pervert), same love madness (love with lot jealousy), and similar rival you dont want to loss to. \r\nwhile the anime is about shogi which i don't know, it not sporty show which show full game of shogi move like puzzle solving, its based of lucky way oflife (which is not in reailty).",
            "date": "2018-02-06T02:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 270796,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/muslem_Zainuddin",
                "username": "muslem_Zainuddin"
            },
            "url": "https://myanimelist.net/reviews.php?id=270796"
        },
        {
            "content": "So this was a cute anime.  I very much enjoyed this anime and its message and the charming characters that will make u gush.\r\nStory: The story pretty much focuses on our main man Yaichi who is considered the best at this game called Shogi.  He holds the title which supports this but yet he is kind of in a slump.  That is till one day he meets a grade school girl called Ai who wants him to train her which he does.  With her help and others he is eventually is able to get out of his slump.  It reallyis a story that teaches that hard work pays off.\\n\\n\r\nArt: The art is decent! All the characters look good as do the places they go.\\n\\n\r\nSound: Sound is good.  The opening and ending song sound nice as do the characters. \\n\\n\r\nCharacter:  I loved the characters. I didn't have a problem with anyone which is nice cause in an anime you will usually find one person u can't stand.  \\n\r\n    Yaichi- He was the main and he was a good guy.  Smart, talented and relatable.\\n\r\n    Ai#1-   His first disciple.  She is very talented and sweet.  A cute girl, she loves her master Yaichi.\\n\r\n    Ai#2-   Yaichis second disciple.  She is very talented as well but is a tsundere.  \\n\r\n    Ginko- She is one of the best female shogi players in the series.  She was taught Shogi with\\n\r\n                Yaichi.  They are really close even calling each other brother and sister.  She has a \\n\r\n                crush on Yaichi.\\n\r\nEnjoyment, Overall:  Overall I did enjoy this anime.  I definitely recommend to people who want an anime this is cute and funny that can be serious and has a good message.\\n",
            "date": "2018-11-06T17:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 293540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7194330.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tmiller7",
                "username": "Tmiller7"
            },
            "url": "https://myanimelist.net/reviews.php?id=293540"
        },
        {
            "content": "The rating of the story was rough for me to judge. The main story was basically average. I feel like there's a trend where a Teenage boy works along side a young female in anime these days. I mean more then Usual. With Ai and Yaichi it was just another Master/Student relationship. However when it came to the backstories of the Side and Minor characters, well that's a different story. I was more entertained by Yashajin, Keika, and Ginko. I felt like they made the anime more enjoyable thanks to their backstories more then Ai and Yaichi.\r\nThe art and animation were top notch. When itcomes to animation I feel like Project No 9. brings it with every anime they've produced.\\n\\n\r\nThe sound and music was basically nothing to get excited about. The opening was fun, and the ending was soothing. The bgm really did not exist. \\n\\n\r\nThe characters I feel like i summed up in my \"story\" section. Again though I liked the Minor and Side characters more then Ai and Yaichi. They were far more entertaining and enjoyable.\\n\\n\r\nMy enjoyment of this anime was like a roller coaster. Some moments got me really excited to watch, while others had me saying \"What?\" in a confused matter. I just felt like the writing was all over at points and they eventually took the easy way out at the end of the show.\\n\\n\r\nOverall this anime is nothing special. There's better anime out there that revolve around the Loli aspect of things.",
            "date": "2018-03-26T19:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 275255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275255"
        },
        {
            "content": "Here we go again with another anime about Shogi. One of them is at my radar (March comes like a lion) and a couple others. The last one I watch and was comic as heck was Tonari no Sei-kun. There were so episodes that dealt with Shogi and the stories the other character made in her mind - one is a battle between chess pieces and shogi. Go watch it.\r\nWell but what's Ryuuou all about? Well the only thing I learn is that anime can make a boring Shogi game into a harem-comedy-exciting and FBI knock-on-your-door kind of sports. Why I say this? Well overallthe anime never tries to teach you about shogi in any way showing some supposedly impressing moves about a game you've never played in your life. Maybe for japanese who play shogi that should be interesting.\\n\\n\r\nIn terms of other stuff not Shogi well... it's sucks.\\n\r\nWe get to know some underage girls who play better than professional players - there isn't a distinction between them all. For those who love soccer - yeah everyone can play BUT you can see when it's a professional player or amateur. You know there are differences between Ronaldo or Messi and most other players in the world so that came out a bit bland. I mean, maybe it's because I don't understand Shogi BUT I don't think that's it...\\n\\n\r\nOverall characterization is nonexistent, with probably Keika a 25 year old shogi player who must evolve to a professional player or else she must quit (don't know if it's a rule or something like that). Btw, why Shogi has a female and male rank? It's a mental game not physic so can't understand that \"real life\" situation.\\n\\n\r\nYaichi is boring bland character and both Ai (the 9/10 year old girls) really love him for some reason. There is also a Ginko who is a Tsundere.\\n\\n\r\nEvery trope of a harem is there. There isn't much romance because Ai (one of them) is always blocking the stuff... There are some other more mature (if you can call it that) situations where both Ginko and Keika (probably not totally serious way) try to understand what Yaichi thinks of her. Bear in mind that one is 14 and the other is 25 while Yaichi is 16/17.\\n\\n\r\nThe animation is quite alright I have no complains there.\\n\\n\r\nIf you are watching with some other people around you beware because a couple of episodes (I think it was the first or second) there is a situation that almost puts Eromanga Sensei to shame... Rest of the episodes are quite alright.",
            "date": "2018-03-27T08:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 275324,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4740367.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Paulo_Goncalves",
                "username": "Paulo_Goncalves"
            },
            "url": "https://myanimelist.net/reviews.php?id=275324"
        }
    ]
]