[
    [
        {
            "content": "To be honest I expected a lot from it and unfortunately the first 5 episodes didn&rsquo;t really grab me. However, after episode 5 things got better and the plot became more definite.\r\nSpeaking of the plot… So it&rsquo;s about Karin, a freak among vampires. She&rsquo;s probably what you would refer to as an anti-vampire. She doesn&rsquo;t suck blood as often as other vampires do, since she actually makes blood, she bathes in daylight with no problem whatsoever &ndash; The bottom line is that she can do what other vampires can&rsquo;t. Basically, the fact that Karin&rsquo;s not a normal vampire, is what the plot revolves on.\r\nShe wouldget into crazy situations such as preventing schoolmates and teachers from finding out about her true identity, having a vampire hunter as an admirer, keeping her grandma from sucking out her crush&rsquo;s blood and whatnot. These situations would usually end up with her as the victor and everyone (including me) will be laughing at the end. Anyway, situations like this would go on until the last episode, which I actually like. It wasn&rsquo;t expected, nor was it underwhelming, and I would say it ended on a high note.\\n\\n\r\nAs a comedy, I would say it&rsquo;s so-so. Sure it was funny, but it could have been funnier. It&rsquo;s probably because the comedic scenes are also chockfull of ecchi and fanservice, which I\\'m not really into. As a romantic comedy, I&rsquo;d give it an A. For some reason, the Karin-Kenta love match really works, they go so well together, and I&rsquo;m sticking to that opinion regardless of how creepy Usui Kenta may look compared to Karin. Plus there&rsquo;s always the love-hate relationship of Maki and Winner to back that up.\\n\\n\r\nCharacters are OK. I love everyone in Karin&rsquo;s family. The Maaka/Marker family is probably the dictionary definition of dysfunctional, and you know how funny dysfunctional families can be. My favorite Marker would probably be Ren, since he&rsquo;s such a bad boy. Usui Kenta is the stereotypical loser, and Maaka is the usual &ldquo;growing pains&rdquo; star of the show. Winner Sinclair is also funny, his dialogues are absolutely absurd, and it cracks me up whenever he speaks English. An outraged &ldquo;no&rdquo; from him already merits a laugh from me. Conversely, the villains are also quite interesting. Elda, who was a villain at first, was very convincing for her role. She really did annoy me, and what annoyed me more is the fact that she barely looks like Karin and yet everyone mistakes her for Karin. Doesn&rsquo;t anyone notice how her hair is much longer than Karin&rsquo;s and that it&rsquo;s light pink? Plus that Victor Sinclair guy kinda pissed me off too. He was unforgiving and heartless, like a true villain would be.\\n\\n\r\nI love the vibrant colors. I really prefer vibrant colors over subdued tones, but even with that said, I still like the water color backgrounds, plus the occasional water colored scenes such as the ones shown during the ending theme sequence. They were delicate, but it was done nicely and it suited to my slight fondness of water color backgrounds. Character design was OK, except maybe for Karin and Kenta. They looked bland and commonplace, especially for Karin. She&rsquo;s just the usual big headed anime girl with big boobs. There was also the use of CG, which at times made me a bit iffy. They used the CG for the weirdest things, and the last I remember CG was used to depict falling leaves in one of the last episodes.\\n\\n\r\nI wasn&rsquo;t happy with the huge amounts of fan service and 2-lady bath scenes. There was even a few seconds worth of Naked Karin that was shown during the opening sequence. I guess that&rsquo;s expected from Yuna Kagezaki, who&rsquo;s actually known for her &ldquo;H&rdquo; works.\\n\\n\r\nThe voice acting was also so-so for me. It&rsquo;s not entirely bad, but something&rsquo;s off. Props to Karin&rsquo;s seiyu, Sayuri Yahagi. From what I researched this is actually her debut role. And when I shamelessly say &ldquo;props&rdquo;, I meant A for effort. I can&rsquo;t quite put my finger on it, but I got a feeling it can be done better than that. Same thing for Winner&rsquo;s seiyu, Kouki Miyata. Winner&rsquo;s a funny guy, but his voice compared to his looks? Doesn&rsquo;t really go together, does it? I did like Kouki&rsquo;s work on Kyo Kara Maoh! where he played Ken Murata. The one that impressed me the most is Katsuyuki Konishi. I just finished watching Loveless and when I found out he was also Soubi&rsquo;s seiyu, I was awestruck since he didn&rsquo;t sound a thing like Soubi. Maki&rsquo;s seiyu, Mikako Takahashi, did an OK job. Even though she&rsquo;s played 2 similar characters, Maki in Karin and Ayu in Honey and Clover, I still would have liked it if she gave more intensity to Maki&rsquo;s character.\\n\\n\r\nThe BGM and sound effects was actually quite outstanding. I like the &ldquo;tell tale heart&rdquo; sound effect whenever Karin&rsquo;s blood would increase. There was a wide variety of BGM for Karin that can go from cheerful and upbeat to thrilling and intense. I actually prefer the more intense BGM compared to the &ldquo;it&rsquo;s such a nice day&rdquo; genre of BGM. The opening theme was OK, but I definitely liked the ending song better since it&rsquo;s more cutesy and catchy.\\n\\n\r\nI can&rsquo;t say it&rsquo;s one of my favorites, but it was a good watch. I might&rsquo;ve enjoyed it more if I was a guy, since it had a lot of nude scenes and fan service, but I as I&rsquo;ve said, I like it enough.",
            "date": "2007-07-02T09:55:00+00:00",
            "helpful_count": 135,
            "mal_id": 453,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=453"
        },
        {
            "content": "Karin is my favorite romantic comedy ever. I believe the reason for this is because I like vampire shows so this is a huge plus for me, there is also the fact that it had a real end unlike most romantic comedies. I love the characters in this show especially karin herself she is definitely unique. My biggest disclaimer to people about this show would be if you are looking for a show that is on the serious side this is not for you. so if you like things a little out of the norm then this may be a good fit for you.",
            "date": "2007-08-21T13:11:00+00:00",
            "helpful_count": 110,
            "mal_id": 748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/animemark35",
                "username": "animemark35"
            },
            "url": "https://myanimelist.net/reviews.php?id=748"
        },
        {
            "content": "Adding one anime only character apparently can completely change (Ruin) the entire story, this is NOT an over exaggeration.\r\nSTORY: This is the adaption of the manga Karin (AKA chibi vampire in the US, and by the way is my favorite romantic comedy manga) which is about a unique vampire girl who instead of drinking blood, shes injects her blood into her victims and the injecttee becomes hyper active for a while. \r\nBut if she doesn't, her blood literally explodes out of her nose (Which this and the concept itself is what the series is known for).\r\nThe anime only covers like 20 something chapters of thebeginning of the manga then goes about with completely different story than what the source material did.\\n\r\nWhich in truth I usually have no problem with that, many anime went this way, Fullmetal Alchemist ended up great, the second Negima anime was okay.\\n\\n\r\nAnd with like most adaptions  Karin, the anime adds in a new character, Winner Sinclair\\n\r\n........................................................................................................\\n\r\n..........................................................................................................huh?\\n\r\nOh I'm sorry I blacked out for a second there.\\n\r\nWhat was I talking about? Oh Winner................. \\n\r\nI'm sorry but, I really hated this character, his appearance, his voice (I'll get to that in a bit), his role!\\n\r\nHis role in the anime is to be the bishonen rival to Kenta Usui, the main male role of the series, for the affection of Karin (The main female role and titular character), but to me (And to hopefully everyone else) he is irritatingly annoying to the point of instant hatred, all this character does is get in the way 24/7, nearly every episode after episode 6.\\n\r\nI'm not going to lie, the story is okay, but pretty generic, for the most part and Winner's job is an interesting plot twist which allows an interesting story development, especially the last 4 episodes, but Winner's personality, his presence just ruin's so much of that, he is the annoying kid who hangs around the circle and just never wants to leave.\\n\\n\r\nBut at the very least winner is the only major headache in the anime, well in the japanese dub.\\n\\n\r\nANIMATION: Okay, not great but good enough.\\n\r\nThe character designs are true to the source material, but looks like a typical low budget shojo anime, and the opening animation makes the series look like a hentai or something, so it's unclear which audience this anime is made for.\\n\r\nKarin's nose bleeds are censored with... flowers... it's unique and a creative way to censor something, but only adds to my argument of who this series is intended for. \\n\\n\r\nSOUND: Both theme music are okay, six for both opening and ending songs.\\n\r\nOkay I'm going to get this strait, do NOT watch the english dub, stick to the subtitles only (Which gets about a seven)! \\n\r\nThe english is just terribly bland, typical no emotion script reading with voices that do fit the characters, but are performed so bad.\\n\r\nAnd of all of them, Winner has the most atrocious ear bleeding noise you will ever hear, this is no over exaggeration, no dub hating or trolling (I love english dubbed anime), I really really mean it.\\n\\n\r\nOVERALL: \\n\r\n+ Different story that has an okay plot\\n\r\n- Winner Sinclair \\n\r\n- English dub\\n\r\n- Unclear of who this anime is intended for\\n\\n\r\nAdaptions of manga are notorious for messing with the source material, but some end up just fine, while others are a disaster, and it's quite a feat for just one character to ruin an entire anime.",
            "date": "2011-01-13T02:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 33712,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=33712"
        },
        {
            "content": "\"Love is tainting the night deeply scarlet.\"\r\nKarin is an interesting show. At its heart, there is a clear, powerful romance. Add to it a supernatural backstory, and some hilarious comedy, you've got Karin.\r\nMeet Karin Maaka. She's a girl caught between two worlds. At first glance, she's just an ordinary, easily embarrassed high school girl. She has a couple of friends, and has a hard time juggling schoolwork and her part time job. But of course, there's a twist!\r\nKarin is a vampire. She lives in your stock creepy old haunted mansion on the hill with her vampire family. But, to this, there is another twist. Karinis not a true vampire. She is a blood maker, which means instead of needing to drink blood for her survival, she must inject it into someone else. Otherwise, she has a nosebleed. A very big nosebleed. This causes a rift between her and her family, who all function as normal, viewing her as a disgrace to their kind.\\n\\n\r\nThe main focus of the series is the relationship between Karin and her romantic interest, Kenta Usui. Although the series begins in a rather cliché fashion for a romantic comedy, the show's supernatural roots prevent it from being too much of a standard anime. One aspect of the relationship I can criticize is Usui. He is nowhere near as fleshed out as Karin, and although he fits the role of Karin's love interest well, we are not given enough to believe the rather convenient romance that seems one-sided. However, by the end of the series, I was forgetting my doubts about Usui, and although he had only changed minimally, the romance is very sweet and believable. Some say it's all about the journey, not the destination, but I believe it was in fact the opposite for Karin and Usui's love.\\n\\n\r\nOkay, I have admitted that the romance isn’t the strongest element of the anime. But you know what is? The characters. All of Karin's family and friends has their own distinct personality and role in the main plot. Plus, similar to the general idea of the series, you could view most characters on two levels: in the lighthearted, comedic times, and in the serious. For example, there’s the anime exclusive Winner Sinclair. He both fills the role of the girl crazy foreigner, and enemy of vampires. We witness both his never ending stream of humor and his emotional tackling of his family’s duty. This duality is an excellent example of how a dramedy can work, as I’ve never seen a show where the characters can both expertly fill comedy and dramatic roles.\\n\r\nIt's quite easy to get attached to the characters of Karin. One very positive aspect is that no one gets sidelined during the series as the plot moves on, which makes it easy to get to know all of the characters as the series goes through its various arcs.\\n\\n\r\nIn terms of art, the anime isn't particularly standout. The character designs are simple yet rather memorable. Some interesting aspects of the art style are some occasional stylizations. For example, due to censorship for broadcast, Karin's flowing nosebleeds had to be changed into flowers, but this gives the art a quirky feel. Especially considering we at first see a stream of blood-red flowers, which part to reveal a nightmarish bloody mess once it has settled. Yes, positive censorship! And another thing - this anime is quite ecchi. Fans of the manga may be shocked at the transformation, as the original source material had only some ecchi content. The opening of the anime begins with various shots of Karin posing naked.  Karin's breasts, already larger than average, have become much larger in the anime, even becoming somewhat of a plot point. Although this ecchi stuff didn't affect my enjoyment of the series in any way, it may deter some, considering the amount we are given.\\n\\n\r\nSound as well is also not hugely remarkable, utilizing a range of songs to suit the mood of the scene. The opening and ending themes are quite catchy: I know I'm not the only one who has been enamored by the simply indescribably fantastic ending theme \"Mou Hitotsu no Birthday\". Character voices suit the characters to their personality well. Special mention, however, should be given to the seiyu Sayuri Yahagi. Karin was her debut anime, and I feel she does a magnificent portrayal of the character.\\n\\n\r\nKarin doesn't try to overburden you with themes. It is simple in its declaration of true love between two people, which transcends species. Although the series takes a noticeable turn towards action towards the latter quarter of the series, the ending holds true the ideals of romance and comedy which have been sustained throughout the anime. While taking some deviations from the manga in order to make the transition to a half season anime while the manga still printed, these changes never really affected the heart of the series. I would recommend Karin for any fans of romantic comedies, and I promise that it's a breath of fresh air in an often unimaginative genre.",
            "date": "2010-07-11T22:10:00+00:00",
            "helpful_count": 21,
            "mal_id": 28285,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jda95",
                "username": "jda95"
            },
            "url": "https://myanimelist.net/reviews.php?id=28285"
        },
        {
            "content": "A refreshing romantic comedy that brings up a new concept to the table... reverse vampires.\r\nI thought it was silly at first but while I watched more and more episodes I realized it's not that silly as this concept is the basis for the humor. The story spins around Karin a high school girl with problems every teenager has as well as something more. She is an unvampire and eldest daughter of a family of regular vampires.\r\nThat triggers several reactions from her family members that lead to funny situations.\r\nWhats more about the story and is not a spoiler is that it has a little bit ofeverything, comedy tragedy romance and a little bit of action here and there with an ending that is a bit of a letdown.\\n\\n\r\nVampires have always been a subject of interest to people, be it books or cinematographic productions. Well then reverse vampires should have the same effect or trigger something revolting in you because you are an expert in vampire lores and it defies everything you knew.\\n\r\nI myself am pretty acquainted with vampire lore but still I said \"what the? Better check it out.\"",
            "date": "2013-04-04T03:10:00+00:00",
            "helpful_count": 13,
            "mal_id": 92345,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=92345"
        },
        {
            "content": "I absolutely loved the Karin series. I first read the manga and I really enjoyed that one so I decided to watch the anime not really expecting something much better. I like how they changed things up in the anime and especially Karin's grandmother Elda Marker.\r\nHonestly, I loved how Karin's and Kenta's relationship developed within the story and I'm glad they added Winner to the series. One of my favorite characters was Anju because of her devotion to her sister (Karin) and the inclusion of Ren's personal story which completely differs from what the manga told you.\r\nOverall, I would recommend this series for anyone wholikes a light hearted comedy with vampires. It had its funny moments, and the last episode was the best one of all. I won't give anything away, but for me it was definitely the best one and the most exciting and romantic one of them all. ^.^",
            "date": "2008-07-12T00:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 6201,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/52468.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/IcePrincess1513",
                "username": "IcePrincess1513"
            },
            "url": "https://myanimelist.net/reviews.php?id=6201"
        },
        {
            "content": "For a show about vampires, this is very fruity. I consider it almost like the Twilight of anime Vampires though I did enjoy it. It has an interesting feel to it even though it doesn’t go for a normal vampire storyline. \r\nThe characters are rather odd and are sometimes annoying. Karin is whinny, her friend Maki is a annoying little bitch that creates some of the trouble for Karin, her brother Ren is a womanizing whore, her father is a dotting father, and her mother is really abusive. It does make a lively bunch but sometimes a little two lively. It just doesn’t have muchstructure except for the fact that Karin’s family does care for her even though they don’t act like it. \\n\\n\r\nThe relationship between Karin and Kenta is pretty generic. Girl is in love with boy but clueless about it and same for boy even though everyone around them can tell that they are together. Even in the beginning, you can tell they were getting together.\\n\\n\r\nThe artwork is pretty standard for slice of life school life specials. It just doesn’t stand out. I can understand why they call it Chibi Vampire and that’s because it’s really cutesy. I’m surprised that Shinbo, the person that did Dance in the Vampire Bund, didn’t direct this. There is a lot of times that Karin is naked (Although most of the time it’s more in expression of something) and even a lot of other characters. The only thing different then his works is that for a high school student, Karin is pretty stacked. The characters don’t really have a good profile. It just looks off. The water color ending is really cute and pretty. \\n\\n\r\nThe English voices are alright, but one of the big let downs is how whinny Karin sounds. Everything she says sounds like whinning. Even Anju sounds more adult then Karin. Every word feels like an after school special for little kids. This does not work because of Ren’s little fun he does all the time.\\n",
            "date": "2012-08-24T02:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 70733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=70733"
        },
        {
            "content": "I have to say that to some extent, I was disappointed, as I expected far more from this anime. Of course, don't get me wrong as I simply love watching anime that has a supernatural theme, with a hint of romance in it as well. But this romance part, is a bit too cliched and typical, like it is with most shows. We see Karin as she falls in love with Usui, and how their relationship develops in an awkward teenage love setting, as Karin tries to deal with managing her nosebleeds. None the less, it's just your typical love story, but with an additionof the fact that Karin is a vampire that injects blood, and does the complete opposite of what you would expect from her character. Of course, the relationship is not in fact the strongest point of the anime. None the less, there are comedic moments, which in fact make up for this.\\n\\n\r\nOn the other hand though, I have to admit that what truly made the show, what it is, is Karin's family. From the quite, reserved yet influential Anju, is always there for Karin. I liked her character in particular, as unlike the rest of her family, she is the one who seems to keep her cool the most. Unlike Ren, who loves flirting, and often gets scolded by his mother. Whilst her parents are found to be very opposite to each other, with her father being the \"softie\" whilst Karin's mother is who keeps everyone, and everything in check. Of course, we can't forget Elda, Karin's grandmother who with her almost girly attitude when it comes to Karin, is truly one of a kind of a character on the show. Which I suppose, is why I really like her character, as she truly stands out, especially when she is around Karin. It's almost like she has a split personality. Overall, I feel like the divide on how the characters are, is what truly makes this show what it is.\\n\\n\r\nAs for the overall appearance of this show, it was interesting. From the colour pallets, to the art style of the characters, it was all fitting with the show. I have to say that, this art style has keep true to the original story, from the manga, even though it has strayed away the greater details, and it could have done so much better, if it kept more true to the manga story.  \\n\\n",
            "date": "2019-01-29T22:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 300368,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178075.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hime-han",
                "username": "Hime-han"
            },
            "url": "https://myanimelist.net/reviews.php?id=300368"
        },
        {
            "content": "Karin, not your typical vampire. She isn't really a blood-sucking vampire, I like to think of her as a blood-donor. I will tell you this, this anime isn't for everyone, and let me say this upfront, I didn't expect much from this in the beginning, like most people, I sat through the first 3 or 4 episodes just waiting for her to stop bolting away from Usui whenever he came into the scene, you know, something interesting. Luckily I started to enjoy it more and more after the first few episodes. It was funny, had an interesting story, good show overall.\r\nStory-wise, it doesn't fully unfolduntil after, I'd say episode 18 or 19. For the first 18 or 19 episodes though it's Maaka and Usui hanging out together, eating lunch together, falling in love with eachother, you know, like most romantic animes go. After those episodes though, it starts getting interesting, when vampire hunters come into the picture. Overall fairly interesting. Worth watching in all honesty.\\n\\n\r\nArtwork, I wasn't especially fond of the way some of the characters looked. Usui's eyes freaked me out, I felt like he was staring into my soul, Maaka's hair was kind of crazy, would have preferred it a little longer or straighter... but Anju... adorable. Her artwork was the best. Gotta love her!\\n\\n\r\nMaaka's voice got a little annoying at points, full of drama, even in the littlest things, like \"Oh no! Not another nosebleed!\". That kind of little, although in the show it might be a little bit larger of a problem then what you'd think. Usui's voice was kind of slow, but I liked the actor. Rest of the voices were pretty good. Some were also a little quiet though.\\n\\n\r\nCharacters, like I said, Anju is the best. She's the little sister anyone would want. She's cute, and she actually acts like a little sister would, she loves her siblings. Maaka was fine other then her dramatic personality, Usui was pretty cool, although if they make a remake of this show, you gotta fix his eyes. I can't go through the show without feeling like he's watching me. Other characters were funny, but good lord, how I hated Winter. He was the most annoying character I've seen in a long time, and that's saying a lot considering the fact that Renge from Ouran High School Host Club was pretty annoying. He was cool later on in the show, but get a new hobby man, vampire hunting is seriously uncool.\\n\\n\r\nDespite the few negative things I told you about before, I liked this show a lot, in fact I enjoyed it a lot. Once Usui and Maaka got closer I started liking the show more and more. Ending could have been better, but hey, at least it was better then some of the other endings to animes. Overall, a good series. Like I said before, not for everyone, but give it a shot. At least get passed the first 3 or 4 episodes, then see if you like it.\\n\\n\r\nI hope this review helped.",
            "date": "2012-10-27T22:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 76067,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=76067"
        },
        {
            "content": "oke to be honest, i really didn't expect much of this anime... when i started watching the first episodes it tottaly wrecked my picture of the whole vampire idea... i dropped it after the first episode because i didn't really thought it would become something better. But after a week or two i saw it in my list and i began to read the reviews of others. it made me want to watch it again and know i'm at episode 22. if it wasn't for the fact i have to learn for my pw i would finish it right away. \r\nchibi vampire karin is cute,lovely, great, unexpectedly interesting and there's a great plot. it's true that their are a lot of things that you see many in other schoollife anime's but it's in a unique way.\\n\r\ni won't tell annything about the story, you'll need to see for youself how wel-made this anime is. \\n\r\ni would reccomend everyone to watch farther than the first two episodes...\\n\\n\r\nbtw: first review sorry for bad englisch",
            "date": "2014-03-20T12:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 136211,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3571913.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Synkue_Amulate",
                "username": "Synkue_Amulate"
            },
            "url": "https://myanimelist.net/reviews.php?id=136211"
        },
        {
            "content": "Warning: I read the manga first, watched the anime second.\r\nStory: 6/10\r\nMaaka Karin comes from a family of vampires living in Japan, but she is not a normal vampire. Vampires are normally supposed to drink the blood of their victims...but Karin suffers from a condition that causes her body to produce excessive amounts of blood. About once a month, she has to get rid of the excess blood by giving it to her \"victims.\" But she somehow manages...she goes to school like everyone else her age.\r\nWell, things are about to get more complicated. When a new student, Usui Kenta transfers into Karin`s class, she starts producingunusually huge amounts of blood, almost as if in reaction to him. Worse, he happens upon Karin`s...true nature...\\n\\n\r\nThe story pretty much follows the manga up until Winner comes in Then it stops and turns into a whole new story. I liked it all the way until the last episode, then I was highly disappointed. It left with so many unanswered questions, so many things I wanted to happen didn't, unlike in the manga, where the ending was incredibly happy and sad at the same time. The anime seemed rushed, since they only had 26 episodes to work with, and an intricate manga plot to follow. \\n\\n\r\nI didn't hate it, but I didn't enjoy it as much as I expected I would. \\n\\n\r\nArt 10/10\\n\r\nI really like the art for Karin. Its pretty and very colorful. I loved how they used flowers for whenever Karin's blood increased too much and a bloody nose came on. The only problem for me was the size of Karin's breasts. She was only supposed to be a 2nd year high school student. \\n\r\nI find that for a shoujo anime, they were too big. but thats just me. XD;;;;\\n\\n\r\nSound 10/10\\n\r\nThe music wasnt to my taste but it fit the anime very well. The BGM was funny when needed and I liked it. the voice acting was amazing, though. Konishi-San played a great Kenta-Kun, I couldnt think of anyone better to play him! (BTW he's also America/Canada in APH) And Sayuri played Karin so well. I loved both of their voices. It makes me want a character song album. *searches that*\\n\\n\r\nCharacter 10/10\\n\r\nI was a fan of KARIN before I knew there was an anime. The manga was one of my favorites, and Im slowly catchign up on the Noel versions. However, the manga lacks my favorite character, who the anime provides. Winner Sinclair. He was NOT in the manga, and hen he came into the anime, he immediately became my favorite of the series. (And he's played by Kouki-San so thats a huge PLUS). Other than Winner, you have Karin and Kenta, who form the most perfect couple in the entire vampire series'. But dont expect much at the end. You wont get it if you wish for anything. lol\\n\\n\r\nOverall Enjoyment 9/10\\n\r\nI loved the anime, but I just wish there was more to it. Maybe a second season is needed. I highly doubt it though. Both males and females will enjoy this series. It has its ecchi-ness, romance and comedy~! Give it a try!! If you dont like it, try the manga, its more enjoyable! Promise! :D",
            "date": "2009-06-08T19:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 15596,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46299.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MoMo-Da-Gr8",
                "username": "MoMo-Da-Gr8"
            },
            "url": "https://myanimelist.net/reviews.php?id=15596"
        },
        {
            "content": "Who would have thought a romantic comedy could make me feel like I wasted so much time. This anime simply is not very good and drags on way too long. If it developed its poor story in the span of 13 episodes it might have received a higher score.\r\n    Lets start with a quick overview of the story. Karin is about a vampire named Karin. She of course has a secret. She isn't the usual kind of vampire, she creates blood, can go out in daylight, likes garlic, can touch crosses and sleeps at night. She accidentally showsher secret to a boy named Kenta who pledges to protect this secret and so our typical RomCom scenario begins. Not a bad start to the show.\\n\\n\r\n    The problem is that for the first 13 episodes nothing much happens that would bring these two characters together. Both Kenta and Karin both have family issues and both in the span of those episodes try to confront them. These issues sound really intense but, the way they are handled makes it feel like the writes didn't really care. You wont know hardly anything about anyone except for Karin's grandmother who actually received several episodes dedicated to her.\\n\\n\r\n     The last 11 episodes is where the story introduces some of the most aggravating situations, meaningless indecision, and meddling characters that one can imagine. Any time the story progress's a few steps with Karin and Kenta, side characters and conflicts come in to take multiple steps backwards. The last two episodes were plain stupid, forced drama which ended in nothing.\\n\\n\r\n    There isn't much to say about the characters. The Maaka family looked interesting but there is no depth to them outside of the grandmother. Kenta's mother had a few issues that they teased but never elaborated on. Kenta himself is only interesting because of his eyes, being poor, and his estranged father. which all sounds very interesting but nothing is developed. The father issues are solved with about 2 minutes of dialogue and the rest are not really even problems it seems.\\n\\n\r\n    The show really only has good points in the sound and art department. The art is well done, dated but really beautiful IMO. Karin is adorable and this is accentuated by her voice actress and the sound affects that coincide with he personality. This is the best part of the show and I love the moments when Karin is embarrassed and flaps her arms around.\\n\\n\r\n    Overall I would have like this show if it was shorter. It took me a few days longer than it should have to finish this because I was so bored and the ending frustrated me so much it landed itself below the 5 marker. I dont recommend this, watch any other RomCom and have a better time.\\n\\n",
            "date": "2015-12-11T19:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 205281,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=205281"
        },
        {
            "content": "This anime is one of my childhood favorites. I'm not sure what about it I am so drawn to, it could be the awesome artwork, the funny characters, or the overall romance and comedy. This anime has so much going for it, it's hard to choose one reason why I like it so much. Honestly, all I can say is that this anime is a 10 out of 10 and that I would recommend it to almost anyone. It is a bit bloody and a tiny bit perverted, but the story line is sweet despite this being an anime about vampires. The characters are hilarious,if you really just need a good laugh, pop up an episode of this show and it'll do just the trick.",
            "date": "2016-12-04T22:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 234912,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gworcester",
                "username": "gworcester"
            },
            "url": "https://myanimelist.net/reviews.php?id=234912"
        },
        {
            "content": "It is a trick as old as time, to flip conventions on their heads and have the reverse of a common idea play out. We´ve seen it time and time again, sometimes deep and tragically other times bubbly and funny. This element, that we call \"irony\" and in other cases \"parody\" is what the premise to \"Karin\" promises us. \r\nLike any good romance, the show takes a great focus onto it´s two main characters Usui Kenta and Karin Maaka. Setting aside the random detail of Usui´s stare, the story doesn´t really play into anything too unconventional. It´s plot and a lot of character interactions arepractically transcribed form the great book of clichés and the show seems to have little self awareness about it, as it takes such story elements far more seriously than an audience which is aware of them ever could. The usage of tropes doesn´t really make something bad, though, as it can be used as a platform to save time and focus on other things, but the way the plot takes itself so seriously in spit of the lack of attachment the characters have to it , makes it feel expendable and mostly just a way of parading the characters.\\n\\n\r\nBy no means, however, are the characters bad. In fact, I would argue they are the best aspect of the show, which is excellent considering this is a romance, a genre which relies on how much and in which way we want characters to interact. Every character, in both isolation and in their relationship with the other characters feels unique and develops organically, which in turns allow you to not only root for them and their progression as characters (even the psychopathic doll) but also look back and suddenly feels nostalgic about those previous moments that you understand better and better over time. As far as characters go, the show is definitely cohesive and through, contrasting with the plot in that the tropes it does use are meaningful, whereas in the plot the tropes fill like just filler.\\n\\n\r\nWith felt less cohesive was the mix of drama and humor in this show, which I think wasn´t handled too well. There was an intended progression into darker set ups as the show went along, and well, that much was accomplished, but the insistently repeated jokes that weren´t all that good to begin with (some jokes even being distinctly bad such as a certain Winner Sinclair) and the over the top reactions of pretty much every character to just about everything made the earlier goof feel exhausting and the usage of a plot saturated with cliché turns was enough to dismiss a lot of the drama for me. The first part did allow some contrast with Maaka´s sister, allowing her presence on screen to almost always feel like a breath of fresh air and while the drama wasn´t too effective as drama, it did make me think more deeply about the themes of the show: our nature as people. What makes you be you.\\n\\n\r\nThis surprisingly deep and even more surprisingly well-explored thematic grants the show a whole layer of new potential. Whether you allow yourself to go with the tide and can enjoy the humor and drama as they go along without concerning yourself with the disparity or you choose to swim deeper into the river and find the golden themes at the bottom, the show has something for you to taste and to help you immerse in what the characters are going through. Even the ending allows the relief for those that follow through with the drama and also resolves the issue in a way that is rather consistent with it´s worldbuilding that far instead of pulling a deus-ex-machina. The only complaint about this I would have is that the answers the show appears to present to it´s conflicts are vague and dreamy at best which could be rather disappointing.\\n\\n\r\nOverall, Karin is a very \"middle\" show, good enough to be watched and enjoyed by almost everyone, excelling in the middle but being a little rough on the beginning due to us not caring enough about the characters yet and in the end , due to the repetitive content (unless you have a particular taste for certain themes or the humor of the show). It´s not something I´d go out of my way to recommend to anyone, but it is not a waste of time either , providing and enjoyable twist on the vampire romance trope.",
            "date": "2016-09-30T03:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 230620,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5704686.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Animeprophet951",
                "username": "Animeprophet951"
            },
            "url": "https://myanimelist.net/reviews.php?id=230620"
        },
        {
            "content": "First few episode really got me worried about Karin's love life but after few episodes I felt relieved. Karin is a really kawaii and loving high school girl. She is really helpful and can do ANYTHING for people  she cares about. She is a well wisher and gets embarrassed easily especially near Usui-kun. Not to mention she is extremely dense(like when Maki told her that she likes W-kun, Karin couldn't guess W-kun was Winner-kun). Keeping these aside Karin is also a vampire-bood sucking one. So, naturally she is the odd one out in her family. Her mother hits her with slipper, her brothercalls her uselss and failure. Anju, her little sister and Karin's father love Karin a lot and they both can reach extreme heights to protect Karin.\\n\r\n All 4 people however, love Karin a seen in many episodes when Karin's mama doesn't have energy but she says 'I am fine. If it will be good for Karin, I am alright. If Karin will be a real vampire', Karin's brother, Ren even begs Usui to give Karin back to him, her father, Henry came to get her when she was taken to hospital even when he was burning from sunlight, Anju has shown most love for Karin in the show. She supported her and Usui throughout the series.She even woke up for 3-4 days to look after Karin.\\n\\n\r\nKarin was normal until Usui-kun's entry which started the show's romance and drama. At first Karin avoided Usui, she later decided to help him and finally fell in love with him. Kenta also firstly thought Karin to be odd person, he later became her nice friend and in the end of series fell head over heels for her.\\n\r\nWinner-kun came as a obstacle in their relationship as he was infatuated with Karin. He called her, his ideal woman. He challenged Usui for duels everyday for Karin's love. Maki(Karin's bestfriend) saw this and fell for him. He however rejected her saying he could only see Karin and cannot fall in love with Maki.\\n\r\nInstead of drama, romance, comedy and some creepiness, you will feel emotional in the last episode of the anime. Winner's grandfather, a vampire hunter stabs Karin's mother & father and shoots her brother right before Karin's eyes. Her mother speaks some sad lines such as 'Henry, take their care for me' and her brother tries to save Karin while he got shot(I literally cried for an hour after pausing the episode). I woudn't like an anime to end like this. In the end however, all members stand up and say 'Vampire's bodies are sturdy. Noway something like this would affect us', this left Karin and me in shock.\\n\r\nThe art is awesome too. I way Karin's jaw drops and the way her nosebleeds are shown like flower petals or pearls, it is really pretty. Karin's blush was kawaii too!!\\n\r\nIn characters, I think Karin did great job. Her mom who was strict, her dad who was over-protective regarding Karin and Usui's relationship, Anju, who I guess have sister complex and Ren-Karin's oh-so-hot-and-playboy brother(he might be a womanizer),Elda, Karin's grandmother who fell in love with Winner's ancestor but ended up believing humans and vampires cannot co-exist together,she later supported Karin with her and Usui's relationship,Maki-Karin's 24/7 available for help friend who at somepoint was jealous of Karin because Winner loved her. She later does everything she can to make Karin happy, Winner-a happy-go-lucky guy who is always thinking about Karin.\\n\r\nThe enjoyment started after few episodes. But it really was good. There was a regular suspense in the sory(like when Karin was goin to tell Usui she loves him but he suddenly told her to go back to her family and never see him again). It will continue you interest in th anime. It also told me that love is just love. You cannot help falling in love and when you do, you don't even care if the person is from a different species. Usui and Karin- I HOPE YOU GUYS HAVE A WONDERFUL FUTURE TOGETHER!!!!\\n\\n\r\nThank you and please watch the anime and read the manga. It's not time waste. If you don't watch it you might miss something which I think is really amazing!!",
            "date": "2018-02-11T08:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 271273,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962247.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/otakuAshu2812",
                "username": "otakuAshu2812"
            },
            "url": "https://myanimelist.net/reviews.php?id=271273"
        },
        {
            "content": "Ah, Karin chibi vampire, actually my second anime. \r\nWhat I have to say about it? \r\nFor the story there are two things that annoy me \"a bit\". First, why she had to be different from other vampires? That sounded so cliché, i would prefer Karin to be a normal vampire from the begginning.\r\nShe didn´t needed to be different from others, a romance between a vampire and a human is very commun but between a special vampire and a human gets even more commun afterall. \r\nSecond... I hated the ending. Unconsistent, fanservicing... and why that drama with the characters if in the end they... well... whosaw the anime knows what I am talking about. I was so wtf was that drama if they all were well? \\n\r\nElda romance story had a good concept that ended up not making too much sense. \\n\r\nAnd Karin and Usui are not much of a strong couple. \\n\r\nBut of course there were some good points on this anime. \\n\r\nThe fact that the vampires are addicted to traits of a person is very well thinked (example: Ren with stressed people). \\n\r\nLoved how the characters were all so different between them. \\n\r\nWinner was annoying but I really shipped him with Maka. \\n\r\nKarin`s voice was so annoying by the way... but I like the opening. \\n\r\nAnd the art style is good, not the best, but plain good.\\n\r\nMy favourite characters of the show were Ren an Anju, brothers of Karin. \\n\r\nI kinda crushed on Ren, I have to admit, and Anju was just adorable (lacks a little bit of personality but had the potencial).\\n\r\nI also loved the bite scenes.\\n\r\nOh, one last thing... that chapter with \"Yaoi fanservice\" was just there because... no reason. Totally unecessary. \\n\\n\r\nIn conclusion, it`s not a anime that I recommend, especially for people who have great padrons on vampire animes. \\n\r\nBut if you don`t mind a little fruity anime with chibi vampires you can try watch it and possibly you will enjoy. \\n\\n\r\nStory - 6 \\n\r\nArt - 7\\n\r\nSound - 6\\n\r\nCharacter - 5 \\n\r\nEnjoyment - 5 \\n\\n\r\nTotal score: 5,8\\n\\n",
            "date": "2016-07-05T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 223240,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5181252.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AppleIceCream",
                "username": "AppleIceCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=223240"
        },
        {
            "content": "The first few episodes were definitely not grabbing my attention. However.. around episode 6 everything became much more full, and enjoyable. If you want to see a nice romantic comedy, but warm at the same time, this is a very ncie episode!!!",
            "date": "2009-10-04T10:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 19391,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/240677.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LightofDarkness",
                "username": "LightofDarkness"
            },
            "url": "https://myanimelist.net/reviews.php?id=19391"
        },
        {
            "content": "Karin is truly a unique anime. It is definitely one of my favorites. \r\nSTORY- 10 - Usually I don't like things with vampires. Especially vampire romances. Vampires are usually the same, cliche thing, but this story is amazingly unique. I mean, what other vampire have you heard of who makes blood, and then gets rid of it through massive nosebleeds? I promise, it is a lot better than it sounds.\r\nART- 7 - This is a pretty old anime, so the art style isn't the best. It is definitely not bad, and I doubt, unless you're super big on art, you'll care.\r\nSOUND- 9 - The musicfrom this anime is really good, especially the opening. It is super catchy. \\n\\n\r\nCHARACTER- 9- The characters from this anime were amazing. I really liked Usui (the boy). He just wasn't the typical guy you'd see in anime, in my opinion. \\n\\n\r\nENJOYMENT- 10- I really liked this anime, and it definitely isn't your typical vampire romance! It does stray from this better manga, but it still quite a story! I enjoyed it quite fully!\\n\\n\r\nOVERALL- 10 - If you're looking for a romance, or even if you're not, I highly recommend this. It's pure gold.",
            "date": "2016-04-15T21:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 216465,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4992025.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/emojipiggie",
                "username": "emojipiggie"
            },
            "url": "https://myanimelist.net/reviews.php?id=216465"
        },
        {
            "content": "Karin (Chibi Vampire)\r\nBased on an original manga written & illustrated by Yuna Kagesaki.\r\nAnime produced by J C Staff, directed by Shinichiro Kimura.\r\nFirst aired on WOWOW, November 2005 to May 2006.\r\n24 episodes of  25 minutes each!\r\nSynopsis!\r\nA family of vampires have set up home in a Tokyo suburb. They live quietly, hidden away from their neighbours by a sort of psychic barrier, surrounded by their familiars. Their eldest daughter, Karin, has a problem. She doesn’t suck blood! \r\nShe is a “Blood Maker” A sort of reverse vampire, who injects the surplus blood that her body produces into her “victims”. As her blood levels increase every month,Karin wanders the local park seeking suitable humans to bite. At other times, she is a normal 16 year old school girl, who is prone to fainting.\\n\\n\r\nWhen Usui Kenta transfers into the school, her problems increase many fold. She gets an abnormally strong vampiric reaction to his presence, which in her case means her blood increases very quickly. Things get really complicated when Kenta comes to her aid during one of her fainting fits, and discovers her secret! Her brother determines that it is his aura of unhappiness that is affecting her, and so when avoiding him doesn’t work, she launches an assault to make him happy. \\n\\n\r\nThe two teenagers live out their strange lives, completely unaware that everybody else can see that they are falling in love. Then, another new transfer student declares his love for Karin. Only problem being, he is a student Vampire Hunter!\\n\\n\r\nCharacters!\\n\\n\r\nKarin. (Voiced by Sayuri Yahagi)\\n\\n\r\nKarin is a vampire with a difference. She can go out in sunlight. Enjoys eating good food, and has to work to earn money to pay the bills since she is virtually the only member of her family who needs heat and light. Her Mother, Father and Brother are all normal vampires. Her younger sister hasn’t yet “awakened” to her full vampire powers. Karin has non of these powers. She can’t leap over buildings, erase memories, or summon bats as “familiars”. She has to do well in school, as a home visit from the teacher is a no-no! Her friends can never come round for sleepovers, and her “time of the month” is more stressful than most!\\n\\n\r\nUsui Kenta. (Voiced by Katsuyuki Konishi)\\n\\n\r\nKenta is an only child in a single parent family. His father deserted him and his mother when he was little, and his mother said that he had died. Kenta knows the truth, as he saw his dad working around the corner from where they used to live. His mother tries hard, but keeps getting fired from any job she takes up. As a result, they have very little money. Kenta works as a waiter after school, and whenever else the Manager needs him, one of perks being free meals. He rarely eats during the day, in order to save money. A fact that Karin and her friend are quick to observe!\\n\\n\r\nWinner Sinclair (Voiced by Kouki Miyata)\\n\\n\r\nThe last in a long line of vampire hunters, Winner takes his responsibilities very seriously, going out after school to protect the neighbourhood. This frequently gets him into trouble. He has been sent to Japan by his Grandfather, who is seeking the Maaka Family. In reality, he is totally hopeless as a hunter. When he arrives in school, he falls completely in love with Karin, saying that she is the exact image of his dream girl. We later find out that Karin is indeed his dream girl, as he was the first person she ever bit! The memory wipe performed by her family left Winner with a dream sequence of the event (with no biting). Winner has some tough choices to make when his Grandfather arrives to eliminate Karin and all her family!\\n\\n\r\nMaki (Voiced by Mikako Takahashi)\\n\\n\r\nKarin’s best, and possibly only, friend. Attractive and intelligent, she supports Karin in all her efforts, without understanding why since she has absolutely no idea that Karin is a vampire. There is a priceless point when Karin invites her for a sleepover to finish the holiday study work, and Maki wonders why she has never been over before. The family are at full alert to prevent their secret being revealed, but since vampires don’t need to cook, and can see in the dark, things don’t go that well. Maki falls in love with Winner soon after his arrival, but all her efforts to draw his attention go for nothing as he only has eyes for Karin!\\n\\n\r\nWhat did I think?\\n\\n\r\nI was quickly drawn in to Karin’s world, and galloped through the series in a matter of a few weeks. The story line was inventive, and the characters developed well throughout the series. Just as the story line started to become a bit predictable, a little twist was thrown in that caused interest to pick up again. \\n\\n\r\nThe only jarring note was the character of Winner Sinclaire. Over dramatic, it became very apparent that he actually knew very little about vampires. His character seemed poorly developed, with no mention of his parents, or why he was living with his Grandfather. His voice really grated on me, and everything about him was just annoying. It came as no surprise to find out that he isn’t present in the original manga!\\n\\n\r\nOther than that, the series was a joy to watch. A gentle romance with plenty of humour. Despite the plethora of compromising situations, there is very little ecchi content. Karin’s nosebleeds are positively explosive, and her family’s reaction to their problem child underline their difference. They just can’t understand that she doesn’t enjoy biting people, and that she does it only as a last resort when her blood increases beyond her ability to control it.\\n\\n\r\nA great anime! 8/10",
            "date": "2009-07-13T15:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 16736,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174326.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/garrym",
                "username": "garrym"
            },
            "url": "https://myanimelist.net/reviews.php?id=16736"
        },
        {
            "content": "I think this is a really funny anime it has characters that fit and the parents you know the ones that are the awkward types. You have your over protective dad and you got a mom who likes to hit her husband the person i liked the most in the anime was the non vampire (karin) who would of guessed someone would make a anime of this but i think it could of done with a little more awkward moments but i really did like it i recommend this to kids 13+.",
            "date": "2011-11-08T10:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 47095,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/788505.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jahred",
                "username": "jahred"
            },
            "url": "https://myanimelist.net/reviews.php?id=47095"
        }
    ],
    [
        {
            "content": "To be honest I expected a lot from it and unfortunately the first 5 episodes didn&rsquo;t really grab me. However, after episode 5 things got better and the plot became more definite.\r\nSpeaking of the plot… So it&rsquo;s about Karin, a freak among vampires. She&rsquo;s probably what you would refer to as an anti-vampire. She doesn&rsquo;t suck blood as often as other vampires do, since she actually makes blood, she bathes in daylight with no problem whatsoever &ndash; The bottom line is that she can do what other vampires can&rsquo;t. Basically, the fact that Karin&rsquo;s not a normal vampire, is what the plot revolves on.\r\nShe wouldget into crazy situations such as preventing schoolmates and teachers from finding out about her true identity, having a vampire hunter as an admirer, keeping her grandma from sucking out her crush&rsquo;s blood and whatnot. These situations would usually end up with her as the victor and everyone (including me) will be laughing at the end. Anyway, situations like this would go on until the last episode, which I actually like. It wasn&rsquo;t expected, nor was it underwhelming, and I would say it ended on a high note.\\n\\n\r\nAs a comedy, I would say it&rsquo;s so-so. Sure it was funny, but it could have been funnier. It&rsquo;s probably because the comedic scenes are also chockfull of ecchi and fanservice, which I\\'m not really into. As a romantic comedy, I&rsquo;d give it an A. For some reason, the Karin-Kenta love match really works, they go so well together, and I&rsquo;m sticking to that opinion regardless of how creepy Usui Kenta may look compared to Karin. Plus there&rsquo;s always the love-hate relationship of Maki and Winner to back that up.\\n\\n\r\nCharacters are OK. I love everyone in Karin&rsquo;s family. The Maaka/Marker family is probably the dictionary definition of dysfunctional, and you know how funny dysfunctional families can be. My favorite Marker would probably be Ren, since he&rsquo;s such a bad boy. Usui Kenta is the stereotypical loser, and Maaka is the usual &ldquo;growing pains&rdquo; star of the show. Winner Sinclair is also funny, his dialogues are absolutely absurd, and it cracks me up whenever he speaks English. An outraged &ldquo;no&rdquo; from him already merits a laugh from me. Conversely, the villains are also quite interesting. Elda, who was a villain at first, was very convincing for her role. She really did annoy me, and what annoyed me more is the fact that she barely looks like Karin and yet everyone mistakes her for Karin. Doesn&rsquo;t anyone notice how her hair is much longer than Karin&rsquo;s and that it&rsquo;s light pink? Plus that Victor Sinclair guy kinda pissed me off too. He was unforgiving and heartless, like a true villain would be.\\n\\n\r\nI love the vibrant colors. I really prefer vibrant colors over subdued tones, but even with that said, I still like the water color backgrounds, plus the occasional water colored scenes such as the ones shown during the ending theme sequence. They were delicate, but it was done nicely and it suited to my slight fondness of water color backgrounds. Character design was OK, except maybe for Karin and Kenta. They looked bland and commonplace, especially for Karin. She&rsquo;s just the usual big headed anime girl with big boobs. There was also the use of CG, which at times made me a bit iffy. They used the CG for the weirdest things, and the last I remember CG was used to depict falling leaves in one of the last episodes.\\n\\n\r\nI wasn&rsquo;t happy with the huge amounts of fan service and 2-lady bath scenes. There was even a few seconds worth of Naked Karin that was shown during the opening sequence. I guess that&rsquo;s expected from Yuna Kagezaki, who&rsquo;s actually known for her &ldquo;H&rdquo; works.\\n\\n\r\nThe voice acting was also so-so for me. It&rsquo;s not entirely bad, but something&rsquo;s off. Props to Karin&rsquo;s seiyu, Sayuri Yahagi. From what I researched this is actually her debut role. And when I shamelessly say &ldquo;props&rdquo;, I meant A for effort. I can&rsquo;t quite put my finger on it, but I got a feeling it can be done better than that. Same thing for Winner&rsquo;s seiyu, Kouki Miyata. Winner&rsquo;s a funny guy, but his voice compared to his looks? Doesn&rsquo;t really go together, does it? I did like Kouki&rsquo;s work on Kyo Kara Maoh! where he played Ken Murata. The one that impressed me the most is Katsuyuki Konishi. I just finished watching Loveless and when I found out he was also Soubi&rsquo;s seiyu, I was awestruck since he didn&rsquo;t sound a thing like Soubi. Maki&rsquo;s seiyu, Mikako Takahashi, did an OK job. Even though she&rsquo;s played 2 similar characters, Maki in Karin and Ayu in Honey and Clover, I still would have liked it if she gave more intensity to Maki&rsquo;s character.\\n\\n\r\nThe BGM and sound effects was actually quite outstanding. I like the &ldquo;tell tale heart&rdquo; sound effect whenever Karin&rsquo;s blood would increase. There was a wide variety of BGM for Karin that can go from cheerful and upbeat to thrilling and intense. I actually prefer the more intense BGM compared to the &ldquo;it&rsquo;s such a nice day&rdquo; genre of BGM. The opening theme was OK, but I definitely liked the ending song better since it&rsquo;s more cutesy and catchy.\\n\\n\r\nI can&rsquo;t say it&rsquo;s one of my favorites, but it was a good watch. I might&rsquo;ve enjoyed it more if I was a guy, since it had a lot of nude scenes and fan service, but I as I&rsquo;ve said, I like it enough.",
            "date": "2007-07-02T09:55:00+00:00",
            "helpful_count": 135,
            "mal_id": 453,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=453"
        },
        {
            "content": "Karin is my favorite romantic comedy ever. I believe the reason for this is because I like vampire shows so this is a huge plus for me, there is also the fact that it had a real end unlike most romantic comedies. I love the characters in this show especially karin herself she is definitely unique. My biggest disclaimer to people about this show would be if you are looking for a show that is on the serious side this is not for you. so if you like things a little out of the norm then this may be a good fit for you.",
            "date": "2007-08-21T13:11:00+00:00",
            "helpful_count": 110,
            "mal_id": 748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/animemark35",
                "username": "animemark35"
            },
            "url": "https://myanimelist.net/reviews.php?id=748"
        },
        {
            "content": "Adding one anime only character apparently can completely change (Ruin) the entire story, this is NOT an over exaggeration.\r\nSTORY: This is the adaption of the manga Karin (AKA chibi vampire in the US, and by the way is my favorite romantic comedy manga) which is about a unique vampire girl who instead of drinking blood, shes injects her blood into her victims and the injecttee becomes hyper active for a while. \r\nBut if she doesn't, her blood literally explodes out of her nose (Which this and the concept itself is what the series is known for).\r\nThe anime only covers like 20 something chapters of thebeginning of the manga then goes about with completely different story than what the source material did.\\n\r\nWhich in truth I usually have no problem with that, many anime went this way, Fullmetal Alchemist ended up great, the second Negima anime was okay.\\n\\n\r\nAnd with like most adaptions  Karin, the anime adds in a new character, Winner Sinclair\\n\r\n........................................................................................................\\n\r\n..........................................................................................................huh?\\n\r\nOh I'm sorry I blacked out for a second there.\\n\r\nWhat was I talking about? Oh Winner................. \\n\r\nI'm sorry but, I really hated this character, his appearance, his voice (I'll get to that in a bit), his role!\\n\r\nHis role in the anime is to be the bishonen rival to Kenta Usui, the main male role of the series, for the affection of Karin (The main female role and titular character), but to me (And to hopefully everyone else) he is irritatingly annoying to the point of instant hatred, all this character does is get in the way 24/7, nearly every episode after episode 6.\\n\r\nI'm not going to lie, the story is okay, but pretty generic, for the most part and Winner's job is an interesting plot twist which allows an interesting story development, especially the last 4 episodes, but Winner's personality, his presence just ruin's so much of that, he is the annoying kid who hangs around the circle and just never wants to leave.\\n\\n\r\nBut at the very least winner is the only major headache in the anime, well in the japanese dub.\\n\\n\r\nANIMATION: Okay, not great but good enough.\\n\r\nThe character designs are true to the source material, but looks like a typical low budget shojo anime, and the opening animation makes the series look like a hentai or something, so it's unclear which audience this anime is made for.\\n\r\nKarin's nose bleeds are censored with... flowers... it's unique and a creative way to censor something, but only adds to my argument of who this series is intended for. \\n\\n\r\nSOUND: Both theme music are okay, six for both opening and ending songs.\\n\r\nOkay I'm going to get this strait, do NOT watch the english dub, stick to the subtitles only (Which gets about a seven)! \\n\r\nThe english is just terribly bland, typical no emotion script reading with voices that do fit the characters, but are performed so bad.\\n\r\nAnd of all of them, Winner has the most atrocious ear bleeding noise you will ever hear, this is no over exaggeration, no dub hating or trolling (I love english dubbed anime), I really really mean it.\\n\\n\r\nOVERALL: \\n\r\n+ Different story that has an okay plot\\n\r\n- Winner Sinclair \\n\r\n- English dub\\n\r\n- Unclear of who this anime is intended for\\n\\n\r\nAdaptions of manga are notorious for messing with the source material, but some end up just fine, while others are a disaster, and it's quite a feat for just one character to ruin an entire anime.",
            "date": "2011-01-13T02:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 33712,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=33712"
        },
        {
            "content": "\"Love is tainting the night deeply scarlet.\"\r\nKarin is an interesting show. At its heart, there is a clear, powerful romance. Add to it a supernatural backstory, and some hilarious comedy, you've got Karin.\r\nMeet Karin Maaka. She's a girl caught between two worlds. At first glance, she's just an ordinary, easily embarrassed high school girl. She has a couple of friends, and has a hard time juggling schoolwork and her part time job. But of course, there's a twist!\r\nKarin is a vampire. She lives in your stock creepy old haunted mansion on the hill with her vampire family. But, to this, there is another twist. Karinis not a true vampire. She is a blood maker, which means instead of needing to drink blood for her survival, she must inject it into someone else. Otherwise, she has a nosebleed. A very big nosebleed. This causes a rift between her and her family, who all function as normal, viewing her as a disgrace to their kind.\\n\\n\r\nThe main focus of the series is the relationship between Karin and her romantic interest, Kenta Usui. Although the series begins in a rather cliché fashion for a romantic comedy, the show's supernatural roots prevent it from being too much of a standard anime. One aspect of the relationship I can criticize is Usui. He is nowhere near as fleshed out as Karin, and although he fits the role of Karin's love interest well, we are not given enough to believe the rather convenient romance that seems one-sided. However, by the end of the series, I was forgetting my doubts about Usui, and although he had only changed minimally, the romance is very sweet and believable. Some say it's all about the journey, not the destination, but I believe it was in fact the opposite for Karin and Usui's love.\\n\\n\r\nOkay, I have admitted that the romance isn’t the strongest element of the anime. But you know what is? The characters. All of Karin's family and friends has their own distinct personality and role in the main plot. Plus, similar to the general idea of the series, you could view most characters on two levels: in the lighthearted, comedic times, and in the serious. For example, there’s the anime exclusive Winner Sinclair. He both fills the role of the girl crazy foreigner, and enemy of vampires. We witness both his never ending stream of humor and his emotional tackling of his family’s duty. This duality is an excellent example of how a dramedy can work, as I’ve never seen a show where the characters can both expertly fill comedy and dramatic roles.\\n\r\nIt's quite easy to get attached to the characters of Karin. One very positive aspect is that no one gets sidelined during the series as the plot moves on, which makes it easy to get to know all of the characters as the series goes through its various arcs.\\n\\n\r\nIn terms of art, the anime isn't particularly standout. The character designs are simple yet rather memorable. Some interesting aspects of the art style are some occasional stylizations. For example, due to censorship for broadcast, Karin's flowing nosebleeds had to be changed into flowers, but this gives the art a quirky feel. Especially considering we at first see a stream of blood-red flowers, which part to reveal a nightmarish bloody mess once it has settled. Yes, positive censorship! And another thing - this anime is quite ecchi. Fans of the manga may be shocked at the transformation, as the original source material had only some ecchi content. The opening of the anime begins with various shots of Karin posing naked.  Karin's breasts, already larger than average, have become much larger in the anime, even becoming somewhat of a plot point. Although this ecchi stuff didn't affect my enjoyment of the series in any way, it may deter some, considering the amount we are given.\\n\\n\r\nSound as well is also not hugely remarkable, utilizing a range of songs to suit the mood of the scene. The opening and ending themes are quite catchy: I know I'm not the only one who has been enamored by the simply indescribably fantastic ending theme \"Mou Hitotsu no Birthday\". Character voices suit the characters to their personality well. Special mention, however, should be given to the seiyu Sayuri Yahagi. Karin was her debut anime, and I feel she does a magnificent portrayal of the character.\\n\\n\r\nKarin doesn't try to overburden you with themes. It is simple in its declaration of true love between two people, which transcends species. Although the series takes a noticeable turn towards action towards the latter quarter of the series, the ending holds true the ideals of romance and comedy which have been sustained throughout the anime. While taking some deviations from the manga in order to make the transition to a half season anime while the manga still printed, these changes never really affected the heart of the series. I would recommend Karin for any fans of romantic comedies, and I promise that it's a breath of fresh air in an often unimaginative genre.",
            "date": "2010-07-11T22:10:00+00:00",
            "helpful_count": 21,
            "mal_id": 28285,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/314142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jda95",
                "username": "jda95"
            },
            "url": "https://myanimelist.net/reviews.php?id=28285"
        },
        {
            "content": "A refreshing romantic comedy that brings up a new concept to the table... reverse vampires.\r\nI thought it was silly at first but while I watched more and more episodes I realized it's not that silly as this concept is the basis for the humor. The story spins around Karin a high school girl with problems every teenager has as well as something more. She is an unvampire and eldest daughter of a family of regular vampires.\r\nThat triggers several reactions from her family members that lead to funny situations.\r\nWhats more about the story and is not a spoiler is that it has a little bit ofeverything, comedy tragedy romance and a little bit of action here and there with an ending that is a bit of a letdown.\\n\\n\r\nVampires have always been a subject of interest to people, be it books or cinematographic productions. Well then reverse vampires should have the same effect or trigger something revolting in you because you are an expert in vampire lores and it defies everything you knew.\\n\r\nI myself am pretty acquainted with vampire lore but still I said \"what the? Better check it out.\"",
            "date": "2013-04-04T03:10:00+00:00",
            "helpful_count": 13,
            "mal_id": 92345,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=92345"
        },
        {
            "content": "I absolutely loved the Karin series. I first read the manga and I really enjoyed that one so I decided to watch the anime not really expecting something much better. I like how they changed things up in the anime and especially Karin's grandmother Elda Marker.\r\nHonestly, I loved how Karin's and Kenta's relationship developed within the story and I'm glad they added Winner to the series. One of my favorite characters was Anju because of her devotion to her sister (Karin) and the inclusion of Ren's personal story which completely differs from what the manga told you.\r\nOverall, I would recommend this series for anyone wholikes a light hearted comedy with vampires. It had its funny moments, and the last episode was the best one of all. I won't give anything away, but for me it was definitely the best one and the most exciting and romantic one of them all. ^.^",
            "date": "2008-07-12T00:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 6201,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/52468.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/IcePrincess1513",
                "username": "IcePrincess1513"
            },
            "url": "https://myanimelist.net/reviews.php?id=6201"
        },
        {
            "content": "For a show about vampires, this is very fruity. I consider it almost like the Twilight of anime Vampires though I did enjoy it. It has an interesting feel to it even though it doesn’t go for a normal vampire storyline. \r\nThe characters are rather odd and are sometimes annoying. Karin is whinny, her friend Maki is a annoying little bitch that creates some of the trouble for Karin, her brother Ren is a womanizing whore, her father is a dotting father, and her mother is really abusive. It does make a lively bunch but sometimes a little two lively. It just doesn’t have muchstructure except for the fact that Karin’s family does care for her even though they don’t act like it. \\n\\n\r\nThe relationship between Karin and Kenta is pretty generic. Girl is in love with boy but clueless about it and same for boy even though everyone around them can tell that they are together. Even in the beginning, you can tell they were getting together.\\n\\n\r\nThe artwork is pretty standard for slice of life school life specials. It just doesn’t stand out. I can understand why they call it Chibi Vampire and that’s because it’s really cutesy. I’m surprised that Shinbo, the person that did Dance in the Vampire Bund, didn’t direct this. There is a lot of times that Karin is naked (Although most of the time it’s more in expression of something) and even a lot of other characters. The only thing different then his works is that for a high school student, Karin is pretty stacked. The characters don’t really have a good profile. It just looks off. The water color ending is really cute and pretty. \\n\\n\r\nThe English voices are alright, but one of the big let downs is how whinny Karin sounds. Everything she says sounds like whinning. Even Anju sounds more adult then Karin. Every word feels like an after school special for little kids. This does not work because of Ren’s little fun he does all the time.\\n",
            "date": "2012-08-24T02:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 70733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=70733"
        },
        {
            "content": "I have to say that to some extent, I was disappointed, as I expected far more from this anime. Of course, don't get me wrong as I simply love watching anime that has a supernatural theme, with a hint of romance in it as well. But this romance part, is a bit too cliched and typical, like it is with most shows. We see Karin as she falls in love with Usui, and how their relationship develops in an awkward teenage love setting, as Karin tries to deal with managing her nosebleeds. None the less, it's just your typical love story, but with an additionof the fact that Karin is a vampire that injects blood, and does the complete opposite of what you would expect from her character. Of course, the relationship is not in fact the strongest point of the anime. None the less, there are comedic moments, which in fact make up for this.\\n\\n\r\nOn the other hand though, I have to admit that what truly made the show, what it is, is Karin's family. From the quite, reserved yet influential Anju, is always there for Karin. I liked her character in particular, as unlike the rest of her family, she is the one who seems to keep her cool the most. Unlike Ren, who loves flirting, and often gets scolded by his mother. Whilst her parents are found to be very opposite to each other, with her father being the \"softie\" whilst Karin's mother is who keeps everyone, and everything in check. Of course, we can't forget Elda, Karin's grandmother who with her almost girly attitude when it comes to Karin, is truly one of a kind of a character on the show. Which I suppose, is why I really like her character, as she truly stands out, especially when she is around Karin. It's almost like she has a split personality. Overall, I feel like the divide on how the characters are, is what truly makes this show what it is.\\n\\n\r\nAs for the overall appearance of this show, it was interesting. From the colour pallets, to the art style of the characters, it was all fitting with the show. I have to say that, this art style has keep true to the original story, from the manga, even though it has strayed away the greater details, and it could have done so much better, if it kept more true to the manga story.  \\n\\n",
            "date": "2019-01-29T22:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 300368,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178075.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hime-han",
                "username": "Hime-han"
            },
            "url": "https://myanimelist.net/reviews.php?id=300368"
        },
        {
            "content": "Karin, not your typical vampire. She isn't really a blood-sucking vampire, I like to think of her as a blood-donor. I will tell you this, this anime isn't for everyone, and let me say this upfront, I didn't expect much from this in the beginning, like most people, I sat through the first 3 or 4 episodes just waiting for her to stop bolting away from Usui whenever he came into the scene, you know, something interesting. Luckily I started to enjoy it more and more after the first few episodes. It was funny, had an interesting story, good show overall.\r\nStory-wise, it doesn't fully unfolduntil after, I'd say episode 18 or 19. For the first 18 or 19 episodes though it's Maaka and Usui hanging out together, eating lunch together, falling in love with eachother, you know, like most romantic animes go. After those episodes though, it starts getting interesting, when vampire hunters come into the picture. Overall fairly interesting. Worth watching in all honesty.\\n\\n\r\nArtwork, I wasn't especially fond of the way some of the characters looked. Usui's eyes freaked me out, I felt like he was staring into my soul, Maaka's hair was kind of crazy, would have preferred it a little longer or straighter... but Anju... adorable. Her artwork was the best. Gotta love her!\\n\\n\r\nMaaka's voice got a little annoying at points, full of drama, even in the littlest things, like \"Oh no! Not another nosebleed!\". That kind of little, although in the show it might be a little bit larger of a problem then what you'd think. Usui's voice was kind of slow, but I liked the actor. Rest of the voices were pretty good. Some were also a little quiet though.\\n\\n\r\nCharacters, like I said, Anju is the best. She's the little sister anyone would want. She's cute, and she actually acts like a little sister would, she loves her siblings. Maaka was fine other then her dramatic personality, Usui was pretty cool, although if they make a remake of this show, you gotta fix his eyes. I can't go through the show without feeling like he's watching me. Other characters were funny, but good lord, how I hated Winter. He was the most annoying character I've seen in a long time, and that's saying a lot considering the fact that Renge from Ouran High School Host Club was pretty annoying. He was cool later on in the show, but get a new hobby man, vampire hunting is seriously uncool.\\n\\n\r\nDespite the few negative things I told you about before, I liked this show a lot, in fact I enjoyed it a lot. Once Usui and Maaka got closer I started liking the show more and more. Ending could have been better, but hey, at least it was better then some of the other endings to animes. Overall, a good series. Like I said before, not for everyone, but give it a shot. At least get passed the first 3 or 4 episodes, then see if you like it.\\n\\n\r\nI hope this review helped.",
            "date": "2012-10-27T22:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 76067,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=76067"
        },
        {
            "content": "oke to be honest, i really didn't expect much of this anime... when i started watching the first episodes it tottaly wrecked my picture of the whole vampire idea... i dropped it after the first episode because i didn't really thought it would become something better. But after a week or two i saw it in my list and i began to read the reviews of others. it made me want to watch it again and know i'm at episode 22. if it wasn't for the fact i have to learn for my pw i would finish it right away. \r\nchibi vampire karin is cute,lovely, great, unexpectedly interesting and there's a great plot. it's true that their are a lot of things that you see many in other schoollife anime's but it's in a unique way.\\n\r\ni won't tell annything about the story, you'll need to see for youself how wel-made this anime is. \\n\r\ni would reccomend everyone to watch farther than the first two episodes...\\n\\n\r\nbtw: first review sorry for bad englisch",
            "date": "2014-03-20T12:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 136211,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3571913.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Synkue_Amulate",
                "username": "Synkue_Amulate"
            },
            "url": "https://myanimelist.net/reviews.php?id=136211"
        },
        {
            "content": "Warning: I read the manga first, watched the anime second.\r\nStory: 6/10\r\nMaaka Karin comes from a family of vampires living in Japan, but she is not a normal vampire. Vampires are normally supposed to drink the blood of their victims...but Karin suffers from a condition that causes her body to produce excessive amounts of blood. About once a month, she has to get rid of the excess blood by giving it to her \"victims.\" But she somehow manages...she goes to school like everyone else her age.\r\nWell, things are about to get more complicated. When a new student, Usui Kenta transfers into Karin`s class, she starts producingunusually huge amounts of blood, almost as if in reaction to him. Worse, he happens upon Karin`s...true nature...\\n\\n\r\nThe story pretty much follows the manga up until Winner comes in Then it stops and turns into a whole new story. I liked it all the way until the last episode, then I was highly disappointed. It left with so many unanswered questions, so many things I wanted to happen didn't, unlike in the manga, where the ending was incredibly happy and sad at the same time. The anime seemed rushed, since they only had 26 episodes to work with, and an intricate manga plot to follow. \\n\\n\r\nI didn't hate it, but I didn't enjoy it as much as I expected I would. \\n\\n\r\nArt 10/10\\n\r\nI really like the art for Karin. Its pretty and very colorful. I loved how they used flowers for whenever Karin's blood increased too much and a bloody nose came on. The only problem for me was the size of Karin's breasts. She was only supposed to be a 2nd year high school student. \\n\r\nI find that for a shoujo anime, they were too big. but thats just me. XD;;;;\\n\\n\r\nSound 10/10\\n\r\nThe music wasnt to my taste but it fit the anime very well. The BGM was funny when needed and I liked it. the voice acting was amazing, though. Konishi-San played a great Kenta-Kun, I couldnt think of anyone better to play him! (BTW he's also America/Canada in APH) And Sayuri played Karin so well. I loved both of their voices. It makes me want a character song album. *searches that*\\n\\n\r\nCharacter 10/10\\n\r\nI was a fan of KARIN before I knew there was an anime. The manga was one of my favorites, and Im slowly catchign up on the Noel versions. However, the manga lacks my favorite character, who the anime provides. Winner Sinclair. He was NOT in the manga, and hen he came into the anime, he immediately became my favorite of the series. (And he's played by Kouki-San so thats a huge PLUS). Other than Winner, you have Karin and Kenta, who form the most perfect couple in the entire vampire series'. But dont expect much at the end. You wont get it if you wish for anything. lol\\n\\n\r\nOverall Enjoyment 9/10\\n\r\nI loved the anime, but I just wish there was more to it. Maybe a second season is needed. I highly doubt it though. Both males and females will enjoy this series. It has its ecchi-ness, romance and comedy~! Give it a try!! If you dont like it, try the manga, its more enjoyable! Promise! :D",
            "date": "2009-06-08T19:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 15596,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46299.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MoMo-Da-Gr8",
                "username": "MoMo-Da-Gr8"
            },
            "url": "https://myanimelist.net/reviews.php?id=15596"
        },
        {
            "content": "Who would have thought a romantic comedy could make me feel like I wasted so much time. This anime simply is not very good and drags on way too long. If it developed its poor story in the span of 13 episodes it might have received a higher score.\r\n    Lets start with a quick overview of the story. Karin is about a vampire named Karin. She of course has a secret. She isn't the usual kind of vampire, she creates blood, can go out in daylight, likes garlic, can touch crosses and sleeps at night. She accidentally showsher secret to a boy named Kenta who pledges to protect this secret and so our typical RomCom scenario begins. Not a bad start to the show.\\n\\n\r\n    The problem is that for the first 13 episodes nothing much happens that would bring these two characters together. Both Kenta and Karin both have family issues and both in the span of those episodes try to confront them. These issues sound really intense but, the way they are handled makes it feel like the writes didn't really care. You wont know hardly anything about anyone except for Karin's grandmother who actually received several episodes dedicated to her.\\n\\n\r\n     The last 11 episodes is where the story introduces some of the most aggravating situations, meaningless indecision, and meddling characters that one can imagine. Any time the story progress's a few steps with Karin and Kenta, side characters and conflicts come in to take multiple steps backwards. The last two episodes were plain stupid, forced drama which ended in nothing.\\n\\n\r\n    There isn't much to say about the characters. The Maaka family looked interesting but there is no depth to them outside of the grandmother. Kenta's mother had a few issues that they teased but never elaborated on. Kenta himself is only interesting because of his eyes, being poor, and his estranged father. which all sounds very interesting but nothing is developed. The father issues are solved with about 2 minutes of dialogue and the rest are not really even problems it seems.\\n\\n\r\n    The show really only has good points in the sound and art department. The art is well done, dated but really beautiful IMO. Karin is adorable and this is accentuated by her voice actress and the sound affects that coincide with he personality. This is the best part of the show and I love the moments when Karin is embarrassed and flaps her arms around.\\n\\n\r\n    Overall I would have like this show if it was shorter. It took me a few days longer than it should have to finish this because I was so bored and the ending frustrated me so much it landed itself below the 5 marker. I dont recommend this, watch any other RomCom and have a better time.\\n\\n",
            "date": "2015-12-11T19:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 205281,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=205281"
        },
        {
            "content": "This anime is one of my childhood favorites. I'm not sure what about it I am so drawn to, it could be the awesome artwork, the funny characters, or the overall romance and comedy. This anime has so much going for it, it's hard to choose one reason why I like it so much. Honestly, all I can say is that this anime is a 10 out of 10 and that I would recommend it to almost anyone. It is a bit bloody and a tiny bit perverted, but the story line is sweet despite this being an anime about vampires. The characters are hilarious,if you really just need a good laugh, pop up an episode of this show and it'll do just the trick.",
            "date": "2016-12-04T22:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 234912,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gworcester",
                "username": "gworcester"
            },
            "url": "https://myanimelist.net/reviews.php?id=234912"
        },
        {
            "content": "It is a trick as old as time, to flip conventions on their heads and have the reverse of a common idea play out. We´ve seen it time and time again, sometimes deep and tragically other times bubbly and funny. This element, that we call \"irony\" and in other cases \"parody\" is what the premise to \"Karin\" promises us. \r\nLike any good romance, the show takes a great focus onto it´s two main characters Usui Kenta and Karin Maaka. Setting aside the random detail of Usui´s stare, the story doesn´t really play into anything too unconventional. It´s plot and a lot of character interactions arepractically transcribed form the great book of clichés and the show seems to have little self awareness about it, as it takes such story elements far more seriously than an audience which is aware of them ever could. The usage of tropes doesn´t really make something bad, though, as it can be used as a platform to save time and focus on other things, but the way the plot takes itself so seriously in spit of the lack of attachment the characters have to it , makes it feel expendable and mostly just a way of parading the characters.\\n\\n\r\nBy no means, however, are the characters bad. In fact, I would argue they are the best aspect of the show, which is excellent considering this is a romance, a genre which relies on how much and in which way we want characters to interact. Every character, in both isolation and in their relationship with the other characters feels unique and develops organically, which in turns allow you to not only root for them and their progression as characters (even the psychopathic doll) but also look back and suddenly feels nostalgic about those previous moments that you understand better and better over time. As far as characters go, the show is definitely cohesive and through, contrasting with the plot in that the tropes it does use are meaningful, whereas in the plot the tropes fill like just filler.\\n\\n\r\nWith felt less cohesive was the mix of drama and humor in this show, which I think wasn´t handled too well. There was an intended progression into darker set ups as the show went along, and well, that much was accomplished, but the insistently repeated jokes that weren´t all that good to begin with (some jokes even being distinctly bad such as a certain Winner Sinclair) and the over the top reactions of pretty much every character to just about everything made the earlier goof feel exhausting and the usage of a plot saturated with cliché turns was enough to dismiss a lot of the drama for me. The first part did allow some contrast with Maaka´s sister, allowing her presence on screen to almost always feel like a breath of fresh air and while the drama wasn´t too effective as drama, it did make me think more deeply about the themes of the show: our nature as people. What makes you be you.\\n\\n\r\nThis surprisingly deep and even more surprisingly well-explored thematic grants the show a whole layer of new potential. Whether you allow yourself to go with the tide and can enjoy the humor and drama as they go along without concerning yourself with the disparity or you choose to swim deeper into the river and find the golden themes at the bottom, the show has something for you to taste and to help you immerse in what the characters are going through. Even the ending allows the relief for those that follow through with the drama and also resolves the issue in a way that is rather consistent with it´s worldbuilding that far instead of pulling a deus-ex-machina. The only complaint about this I would have is that the answers the show appears to present to it´s conflicts are vague and dreamy at best which could be rather disappointing.\\n\\n\r\nOverall, Karin is a very \"middle\" show, good enough to be watched and enjoyed by almost everyone, excelling in the middle but being a little rough on the beginning due to us not caring enough about the characters yet and in the end , due to the repetitive content (unless you have a particular taste for certain themes or the humor of the show). It´s not something I´d go out of my way to recommend to anyone, but it is not a waste of time either , providing and enjoyable twist on the vampire romance trope.",
            "date": "2016-09-30T03:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 230620,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5704686.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Animeprophet951",
                "username": "Animeprophet951"
            },
            "url": "https://myanimelist.net/reviews.php?id=230620"
        },
        {
            "content": "First few episode really got me worried about Karin's love life but after few episodes I felt relieved. Karin is a really kawaii and loving high school girl. She is really helpful and can do ANYTHING for people  she cares about. She is a well wisher and gets embarrassed easily especially near Usui-kun. Not to mention she is extremely dense(like when Maki told her that she likes W-kun, Karin couldn't guess W-kun was Winner-kun). Keeping these aside Karin is also a vampire-bood sucking one. So, naturally she is the odd one out in her family. Her mother hits her with slipper, her brothercalls her uselss and failure. Anju, her little sister and Karin's father love Karin a lot and they both can reach extreme heights to protect Karin.\\n\r\n All 4 people however, love Karin a seen in many episodes when Karin's mama doesn't have energy but she says 'I am fine. If it will be good for Karin, I am alright. If Karin will be a real vampire', Karin's brother, Ren even begs Usui to give Karin back to him, her father, Henry came to get her when she was taken to hospital even when he was burning from sunlight, Anju has shown most love for Karin in the show. She supported her and Usui throughout the series.She even woke up for 3-4 days to look after Karin.\\n\\n\r\nKarin was normal until Usui-kun's entry which started the show's romance and drama. At first Karin avoided Usui, she later decided to help him and finally fell in love with him. Kenta also firstly thought Karin to be odd person, he later became her nice friend and in the end of series fell head over heels for her.\\n\r\nWinner-kun came as a obstacle in their relationship as he was infatuated with Karin. He called her, his ideal woman. He challenged Usui for duels everyday for Karin's love. Maki(Karin's bestfriend) saw this and fell for him. He however rejected her saying he could only see Karin and cannot fall in love with Maki.\\n\r\nInstead of drama, romance, comedy and some creepiness, you will feel emotional in the last episode of the anime. Winner's grandfather, a vampire hunter stabs Karin's mother & father and shoots her brother right before Karin's eyes. Her mother speaks some sad lines such as 'Henry, take their care for me' and her brother tries to save Karin while he got shot(I literally cried for an hour after pausing the episode). I woudn't like an anime to end like this. In the end however, all members stand up and say 'Vampire's bodies are sturdy. Noway something like this would affect us', this left Karin and me in shock.\\n\r\nThe art is awesome too. I way Karin's jaw drops and the way her nosebleeds are shown like flower petals or pearls, it is really pretty. Karin's blush was kawaii too!!\\n\r\nIn characters, I think Karin did great job. Her mom who was strict, her dad who was over-protective regarding Karin and Usui's relationship, Anju, who I guess have sister complex and Ren-Karin's oh-so-hot-and-playboy brother(he might be a womanizer),Elda, Karin's grandmother who fell in love with Winner's ancestor but ended up believing humans and vampires cannot co-exist together,she later supported Karin with her and Usui's relationship,Maki-Karin's 24/7 available for help friend who at somepoint was jealous of Karin because Winner loved her. She later does everything she can to make Karin happy, Winner-a happy-go-lucky guy who is always thinking about Karin.\\n\r\nThe enjoyment started after few episodes. But it really was good. There was a regular suspense in the sory(like when Karin was goin to tell Usui she loves him but he suddenly told her to go back to her family and never see him again). It will continue you interest in th anime. It also told me that love is just love. You cannot help falling in love and when you do, you don't even care if the person is from a different species. Usui and Karin- I HOPE YOU GUYS HAVE A WONDERFUL FUTURE TOGETHER!!!!\\n\\n\r\nThank you and please watch the anime and read the manga. It's not time waste. If you don't watch it you might miss something which I think is really amazing!!",
            "date": "2018-02-11T08:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 271273,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962247.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/otakuAshu2812",
                "username": "otakuAshu2812"
            },
            "url": "https://myanimelist.net/reviews.php?id=271273"
        },
        {
            "content": "Ah, Karin chibi vampire, actually my second anime. \r\nWhat I have to say about it? \r\nFor the story there are two things that annoy me \"a bit\". First, why she had to be different from other vampires? That sounded so cliché, i would prefer Karin to be a normal vampire from the begginning.\r\nShe didn´t needed to be different from others, a romance between a vampire and a human is very commun but between a special vampire and a human gets even more commun afterall. \r\nSecond... I hated the ending. Unconsistent, fanservicing... and why that drama with the characters if in the end they... well... whosaw the anime knows what I am talking about. I was so wtf was that drama if they all were well? \\n\r\nElda romance story had a good concept that ended up not making too much sense. \\n\r\nAnd Karin and Usui are not much of a strong couple. \\n\r\nBut of course there were some good points on this anime. \\n\r\nThe fact that the vampires are addicted to traits of a person is very well thinked (example: Ren with stressed people). \\n\r\nLoved how the characters were all so different between them. \\n\r\nWinner was annoying but I really shipped him with Maka. \\n\r\nKarin`s voice was so annoying by the way... but I like the opening. \\n\r\nAnd the art style is good, not the best, but plain good.\\n\r\nMy favourite characters of the show were Ren an Anju, brothers of Karin. \\n\r\nI kinda crushed on Ren, I have to admit, and Anju was just adorable (lacks a little bit of personality but had the potencial).\\n\r\nI also loved the bite scenes.\\n\r\nOh, one last thing... that chapter with \"Yaoi fanservice\" was just there because... no reason. Totally unecessary. \\n\\n\r\nIn conclusion, it`s not a anime that I recommend, especially for people who have great padrons on vampire animes. \\n\r\nBut if you don`t mind a little fruity anime with chibi vampires you can try watch it and possibly you will enjoy. \\n\\n\r\nStory - 6 \\n\r\nArt - 7\\n\r\nSound - 6\\n\r\nCharacter - 5 \\n\r\nEnjoyment - 5 \\n\\n\r\nTotal score: 5,8\\n\\n",
            "date": "2016-07-05T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 223240,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5181252.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AppleIceCream",
                "username": "AppleIceCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=223240"
        },
        {
            "content": "The first few episodes were definitely not grabbing my attention. However.. around episode 6 everything became much more full, and enjoyable. If you want to see a nice romantic comedy, but warm at the same time, this is a very ncie episode!!!",
            "date": "2009-10-04T10:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 19391,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/240677.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LightofDarkness",
                "username": "LightofDarkness"
            },
            "url": "https://myanimelist.net/reviews.php?id=19391"
        },
        {
            "content": "Karin is truly a unique anime. It is definitely one of my favorites. \r\nSTORY- 10 - Usually I don't like things with vampires. Especially vampire romances. Vampires are usually the same, cliche thing, but this story is amazingly unique. I mean, what other vampire have you heard of who makes blood, and then gets rid of it through massive nosebleeds? I promise, it is a lot better than it sounds.\r\nART- 7 - This is a pretty old anime, so the art style isn't the best. It is definitely not bad, and I doubt, unless you're super big on art, you'll care.\r\nSOUND- 9 - The musicfrom this anime is really good, especially the opening. It is super catchy. \\n\\n\r\nCHARACTER- 9- The characters from this anime were amazing. I really liked Usui (the boy). He just wasn't the typical guy you'd see in anime, in my opinion. \\n\\n\r\nENJOYMENT- 10- I really liked this anime, and it definitely isn't your typical vampire romance! It does stray from this better manga, but it still quite a story! I enjoyed it quite fully!\\n\\n\r\nOVERALL- 10 - If you're looking for a romance, or even if you're not, I highly recommend this. It's pure gold.",
            "date": "2016-04-15T21:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 216465,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4992025.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/emojipiggie",
                "username": "emojipiggie"
            },
            "url": "https://myanimelist.net/reviews.php?id=216465"
        },
        {
            "content": "Karin (Chibi Vampire)\r\nBased on an original manga written & illustrated by Yuna Kagesaki.\r\nAnime produced by J C Staff, directed by Shinichiro Kimura.\r\nFirst aired on WOWOW, November 2005 to May 2006.\r\n24 episodes of  25 minutes each!\r\nSynopsis!\r\nA family of vampires have set up home in a Tokyo suburb. They live quietly, hidden away from their neighbours by a sort of psychic barrier, surrounded by their familiars. Their eldest daughter, Karin, has a problem. She doesn’t suck blood! \r\nShe is a “Blood Maker” A sort of reverse vampire, who injects the surplus blood that her body produces into her “victims”. As her blood levels increase every month,Karin wanders the local park seeking suitable humans to bite. At other times, she is a normal 16 year old school girl, who is prone to fainting.\\n\\n\r\nWhen Usui Kenta transfers into the school, her problems increase many fold. She gets an abnormally strong vampiric reaction to his presence, which in her case means her blood increases very quickly. Things get really complicated when Kenta comes to her aid during one of her fainting fits, and discovers her secret! Her brother determines that it is his aura of unhappiness that is affecting her, and so when avoiding him doesn’t work, she launches an assault to make him happy. \\n\\n\r\nThe two teenagers live out their strange lives, completely unaware that everybody else can see that they are falling in love. Then, another new transfer student declares his love for Karin. Only problem being, he is a student Vampire Hunter!\\n\\n\r\nCharacters!\\n\\n\r\nKarin. (Voiced by Sayuri Yahagi)\\n\\n\r\nKarin is a vampire with a difference. She can go out in sunlight. Enjoys eating good food, and has to work to earn money to pay the bills since she is virtually the only member of her family who needs heat and light. Her Mother, Father and Brother are all normal vampires. Her younger sister hasn’t yet “awakened” to her full vampire powers. Karin has non of these powers. She can’t leap over buildings, erase memories, or summon bats as “familiars”. She has to do well in school, as a home visit from the teacher is a no-no! Her friends can never come round for sleepovers, and her “time of the month” is more stressful than most!\\n\\n\r\nUsui Kenta. (Voiced by Katsuyuki Konishi)\\n\\n\r\nKenta is an only child in a single parent family. His father deserted him and his mother when he was little, and his mother said that he had died. Kenta knows the truth, as he saw his dad working around the corner from where they used to live. His mother tries hard, but keeps getting fired from any job she takes up. As a result, they have very little money. Kenta works as a waiter after school, and whenever else the Manager needs him, one of perks being free meals. He rarely eats during the day, in order to save money. A fact that Karin and her friend are quick to observe!\\n\\n\r\nWinner Sinclair (Voiced by Kouki Miyata)\\n\\n\r\nThe last in a long line of vampire hunters, Winner takes his responsibilities very seriously, going out after school to protect the neighbourhood. This frequently gets him into trouble. He has been sent to Japan by his Grandfather, who is seeking the Maaka Family. In reality, he is totally hopeless as a hunter. When he arrives in school, he falls completely in love with Karin, saying that she is the exact image of his dream girl. We later find out that Karin is indeed his dream girl, as he was the first person she ever bit! The memory wipe performed by her family left Winner with a dream sequence of the event (with no biting). Winner has some tough choices to make when his Grandfather arrives to eliminate Karin and all her family!\\n\\n\r\nMaki (Voiced by Mikako Takahashi)\\n\\n\r\nKarin’s best, and possibly only, friend. Attractive and intelligent, she supports Karin in all her efforts, without understanding why since she has absolutely no idea that Karin is a vampire. There is a priceless point when Karin invites her for a sleepover to finish the holiday study work, and Maki wonders why she has never been over before. The family are at full alert to prevent their secret being revealed, but since vampires don’t need to cook, and can see in the dark, things don’t go that well. Maki falls in love with Winner soon after his arrival, but all her efforts to draw his attention go for nothing as he only has eyes for Karin!\\n\\n\r\nWhat did I think?\\n\\n\r\nI was quickly drawn in to Karin’s world, and galloped through the series in a matter of a few weeks. The story line was inventive, and the characters developed well throughout the series. Just as the story line started to become a bit predictable, a little twist was thrown in that caused interest to pick up again. \\n\\n\r\nThe only jarring note was the character of Winner Sinclaire. Over dramatic, it became very apparent that he actually knew very little about vampires. His character seemed poorly developed, with no mention of his parents, or why he was living with his Grandfather. His voice really grated on me, and everything about him was just annoying. It came as no surprise to find out that he isn’t present in the original manga!\\n\\n\r\nOther than that, the series was a joy to watch. A gentle romance with plenty of humour. Despite the plethora of compromising situations, there is very little ecchi content. Karin’s nosebleeds are positively explosive, and her family’s reaction to their problem child underline their difference. They just can’t understand that she doesn’t enjoy biting people, and that she does it only as a last resort when her blood increases beyond her ability to control it.\\n\\n\r\nA great anime! 8/10",
            "date": "2009-07-13T15:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 16736,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174326.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/garrym",
                "username": "garrym"
            },
            "url": "https://myanimelist.net/reviews.php?id=16736"
        },
        {
            "content": "I think this is a really funny anime it has characters that fit and the parents you know the ones that are the awkward types. You have your over protective dad and you got a mom who likes to hit her husband the person i liked the most in the anime was the non vampire (karin) who would of guessed someone would make a anime of this but i think it could of done with a little more awkward moments but i really did like it i recommend this to kids 13+.",
            "date": "2011-11-08T10:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 47095,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/788505.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jahred",
                "username": "jahred"
            },
            "url": "https://myanimelist.net/reviews.php?id=47095"
        }
    ],
    [
        {
            "content": "I loved this anime! It was one of those animes that I was absolutely addicted to. When I wasnt watching Karin I wished Iwas watching Karin when I was sleeping I was dreaming that I was watching Karin and when I was watching Karin it was like I was in a trance and I had to force myself to occasionaly blink. Part of this was because I love vampires (not the ones that sparkle like off twilight) and this is the only vampire thing I have seen in a long time. And also because the anime and story are realy just that good. \r\nStory 10:The story was very original and deep. I mean come on an unvampire thats almost as epic as the person who thought the leaf blower should blow out instead of in. But on a more serious note this story portrayed how less gory people like mysef believe that vampires drink blood to survive and not to drain you. So if you like the more feely side of a vampire this is definitely one of those type of shows. ( One of my favs when it comes to vampires :-) )\\n\\n\r\nArt 9: The art was basic animestuff. I always struggle when it comes to this part of the review with realy good anime because no anime I have ever seen realy struggles when it comes to art.\\n\\n\r\nSound 10: Sound was very good and lacked nothing. \\n\\n\r\nCharacter 9: The characters were very good and all played into the plot well. I have to say Elda was my fav character even though she is pretty close on the list to Karins little sister whos name I cant spell.\\n\\n\r\nEnjoyment 10: Like I said before this is one of the best animes I have ever seen in my life. I havent watched a lot of anime that is true but I still think it highly up on the list of good anime. And its the first thing I reccomend to someone who is bored and looking for a good show to watch.\\n\\n\r\nOverall 10: If you like vampires and enjoy good anime then this is a need to watch for you.",
            "date": "2013-03-14T14:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 89755,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1766859.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/maddfish",
                "username": "maddfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=89755"
        },
        {
            "content": "Karin: Chibi Vampire was a great anime, and had potential in the beginning. I loved the inappropriate jokes that were slipped in periodically. However, sometimes they overdid it. Also, the title sequence is a little creepy. I loved Karin's family. However, it left me wanting more. \r\nThe characters didn't develop enough, and the last episode had a terrible ending. The ending just ticks me off. I feel like recommending this show but at the same time.. I don't want to. Karin, the main character, I thought her personality was solid. Due to her being the main character; her personality had a chance to develop. \r\nHowever,I really wish she wasn't an un-vampire. It made her seem pathetic because she acted like the most helpless girl in the world. Normal human girls can take care of themselves so, why couldn't Karin? Next, I'd like to discuss Karin's parents. Her mom Carrera, lacked a complete personality.\\n\\n\r\nMost of the time, she was hitting her family. However, when Karin truly needed her help; she was there to offer advice and protect her daughter at all costs. I really wish I could have seen more of Carrera. Henry seemed to be a loving father that would do anything for his children. I would have liked to see more than just the surface of him. He lacked a in-depth personality but, he showed potential as the sweet father he seemed to be. -unfinished-\\n\\n",
            "date": "2013-11-09T14:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 119761,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2487217.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dafauna",
                "username": "Dafauna"
            },
            "url": "https://myanimelist.net/reviews.php?id=119761"
        },
        {
            "content": "... Hmm... I liked it, but it as no comparation to the manga! The story is too poor compared to it! If you like the characters, read the manga instead of watching the anime ;)",
            "date": "2009-01-12T11:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 11390,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116601.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RitaC4",
                "username": "RitaC4"
            },
            "url": "https://myanimelist.net/reviews.php?id=11390"
        },
        {
            "content": "The anime is AWESOME! It is probably the best anime I've seen! It is perfect for anyone who just love comedy and romance. The characters are all different and unique. Overall the anime is just the right thing to keep it's veiwers laughing and smiling! It is also full of cool vampire power! The romace in the anime works just right and it balences well with the comedy so that everything in the series fits together perfectly. I loved the story as well as the cool vampire theme! It's truly a wonderfull anime and I'm sure many will come to love and enjoy it!",
            "date": "2009-04-30T17:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 14654,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/177116.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TrueVampire",
                "username": "TrueVampire"
            },
            "url": "https://myanimelist.net/reviews.php?id=14654"
        },
        {
            "content": "Summary: This one is a lot better than I thought. I planned on it being a straight forward ecchi/slice of life but it turned out to be a lot more than that. Each of the main characters gets a good amount of development, the concept of the \"unvampire\" is quite interesting and the romance is solid. Even though this feels like an overdone concept it had enough unique elements to make it stand out from the pack.\r\nYou will like Karin if:\r\nYou don't want excessive ecchi or any nudity.\r\nYou don't care for the love triangle thing; this is Usui and Karin, no harem nonsense in thisone.\\n\r\nYou enjoy a diverse cast of characters who are a bit stereotypical (loli soft spoken doting younger sister, rough and masculine older brother, weak and caring/effeminate father, overbearing and strict mother, etc).\\n\r\nYou don't mind a slow build up; this anime has 24 episodes and it builds up pretty slowly att he start and keeps building until almost the credits.\\n\r\nYou want a show that wraps up nicely but doesn't necessarily give you a picture perfect level of detail into the characters after stories, a good example would be Mia-Hime.\\n\r\nThis story gets dark at times, things will not necessarily wrap up into a perfect story.\\n\\n\r\nAll in all, if you want a nice romance/slice of life with a neat twist and a diverse set of characters you will enjoy this.\\n\\n\r\nStory 7 Art 8 Sound 7 Character 9 Enjoyment 8 Overall 8",
            "date": "2016-06-20T21:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 221356,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=221356"
        },
        {
            "content": "I didn't get that interested in the anime.I couldn't get to far into the story when I found out it was different from the manga. I think the manga was so much better. In the manga the romance was sooo good, the comedy was really funny(I guess the show didn't do bad in it's comedy either,it was probably on par with the manga's comedy), and plot.Things like dramatic moments were done so well in the manga. Overall the story in the manga felt like a good romcom and by the end I was completely satisfied,so if you didn't like the anime due to the itnot having enough couple type of romance, definitely DEFINITELY read the manga :)",
            "date": "2016-06-15T21:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 220849,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5144143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Shah_Studios",
                "username": "Shah_Studios"
            },
            "url": "https://myanimelist.net/reviews.php?id=220849"
        },
        {
            "content": "Wow, so I've never had a anime be so good for 20 episodes, then completely crash and burn as hard as the last 4 episodes did for me. I actually quit watching at episode 23 out of revolt at what was happening. The last episode is just a mockery of the whole series in my opinion and for nothing, it ends just as you would expect if the last 4 episodes didn't exist. \r\nThis to me is raising the stakes for the sense of drama, and the cost of everything else. It's a terrible way of handling a series and wrecks what otherwise was agreat series overall for me. I really did enjoy it before the last 4 episodes, to the point of which it might have been the best handling of vampire romance I had seen. \\n\\n\r\nI took the time to write my first review simply as a warning. It was a great series that crashed and burned amongst the hardest I've ever seen. And in the end for nothing, it accomplished nothing that wouldn't have happened if they had not tried to artificially raise the stakes by making all the character simultaneously become incompetent, idiotic, and pathetic all at the same time.",
            "date": "2013-01-16T16:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 83887,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gyro2death",
                "username": "gyro2death"
            },
            "url": "https://myanimelist.net/reviews.php?id=83887"
        },
        {
            "content": "I loved this anime and it loved me back, with hilarious scenarios and jokes that will have you rolling. The supernatural world of Karin gives the story a livelihood that can only be called humor genius. I loved how many vampire myths were dis-proven (or rather solved) in a funny matter, with even funnier explanations. Same goes for the eccentric characters.\r\nPlus the light action and Love romance allows for a sense of boundaries, not like a total random anime.\r\nI give this 8/10, but the romance could use just a lil' tweaking. =)",
            "date": "2009-03-31T23:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 13702,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13702"
        },
        {
            "content": "Ok, well normally I don't tend to write reviews, but as a fan of the manga, and after finally getting around to watching the anime I thought I'd take a moment to write this for two groups of people: Those who didn't read the manga and are curious about this as a general rom-com, and those who did who want to see the anime.\r\nI'll keep this short and spoiler free.  This is just going to be a quick insight for what both groups should expect to see, and my reasons as to why I think you should or shouldn't watch this.\r\nI'll start with theNON-manga readers.  \\n\r\nGiven how this is a somewhat old show, you probably clicked on Karin's page based on a recent review, recommendation, or some other link on MAL's page. \\n\\n\r\nLet me say that if you enjoy rom-coms and vampires you'll probably enjoy this.  If you don't mind, or even enjoy older art styles then that's a bonus.  There isn't anything that really stands out about the show.  This is something to watch if you enjoy the full spectrum of rom-coms.  If you've only dipped your toes into a few shows, you probably wont care for this.\\n\\n\r\nMy recommendation to all non-manga watchers is to go read the manga as soon as you're done this.  There are A LOT of differences and I truly believe you will find the manga to be much more interesting.\\n\\n\\n\r\nNow, this part is addressed for the manga readers. \\n\r\nIf you're like me, you most likely read the manga first, and then found out there was an anime adaptation made and decided to check it out.  Well let me warn you, it falls very short of the manga.  It starts out as very faithful, but eventually it starts to head downhill a bit; introducing some anime only characters, anime only scenes, and twisting around a lot of the character's backgrounds and development.  Is it a bad thing in itself? Not exactly, which is why I recommended it to non-manga readers.\\n\\n\r\nHowever, in my opinion, the fact that they decided to stray away from the manga and make this mostly anime original content made the story fall short on a lot of levels.  I believe the story in the manga was a lot more intense and captivating, while the anime story was basically a generic rom-com, with some forced plot and drama towards the end.  \\n\\n\r\nIf you were wanting to watch this because you expected to see a faithful adaptation of the manga, then avoid this at all costs.  You will be severely disappointed.  But, if you wanted to watch it just for the sake of being a fan of the franchise in its fullest, then go ahead and do so.",
            "date": "2015-01-13T20:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 177773,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3061641.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jonesy974",
                "username": "Jonesy974"
            },
            "url": "https://myanimelist.net/reviews.php?id=177773"
        },
        {
            "content": "The first episode didn't impress me: character design, story idea, and even the script. Still I found myself pushing  the \"next episode\" button. Something grabbed me. And I think it had to have been it's uniqueness. How many classic vampire romances can we watch? This one stands alone, so there's no need to compare them. Keeps you in great suspense about \"When is she gonne bite him?!\"",
            "date": "2012-07-23T20:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 67509,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1206059.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Turquoise87",
                "username": "Turquoise87"
            },
            "url": "https://myanimelist.net/reviews.php?id=67509"
        },
        {
            "content": "Karin is a very enjoyable, easy going anime.\r\ni loved all the characters and enjoyed the series throughout.\r\nif your looking for an incredible experience your probably better off with something else, but if you want an anime which is easy to follow with a decent range of characters this is perfect.",
            "date": "2010-09-30T02:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 30933,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/389552.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rider1928",
                "username": "rider1928"
            },
            "url": "https://myanimelist.net/reviews.php?id=30933"
        },
        {
            "content": "Karin was in my opinion a very good anime, I was hooked after a few episodes. To me, the story itself was unique because of Karin's condition. I honestly never would have thought of anything like that, so it gave the anime some origonality. I really enjoyed the develpoment of the relationship between Karin and Kenta throughout the anime. It had a nice pase that never felt like it was going ot fast or dragging on and being to slow, just a moderate pace that really added to the effect. I laughed out loud so many times while watching his anime,and I honestly don't dothat very often. It definatly had a big comical element along with the romance that overall made it rather enjoyable.\\n\r\nThe art was pretty good although I found it rather average. \"Kentas drawn kind of weird...\" was something that crossed my mind when he made his first apperence in the anime, but I learned later on that they way he was drawn was important to his role and certain scenes. One thing that in a way kind of bugged me was that Kain's grandmother looked younger then Karins parent's and to me that was a little odd, but other then that the art was good.\\n\r\nBut as for the sound, to me, was not as good as the rest of the show. I watched it dubbed and I personally found some of the characters voices kind of annoying. Aside from that the sound was ok.\\n\r\nI thought that the character development in this manga was very good. As I said, I liked the development of Karin and Kenta's relationship, but also I really liked the bond between Karin and her little sister. Although it was there from the begining of the anime, it was cute and her little sister ended up being a much bigger part in the anime then I thought she would have been. Also, as the anime progresses, Winner Saint Clair comes into the picture and the fact that he is a vampire hunter and loves Karin was very ironic. He ended up being quite important too, and the relationship development between him and Karin's friend, although minimal, was cute.\\n\r\nOveral I found this anime quite enjoyable and for anyone who wants to have a good laugh and see a nice romance anime, I would recomend you watch it ^.^",
            "date": "2013-07-23T22:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 106561,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1964064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/katlee8225",
                "username": "katlee8225"
            },
            "url": "https://myanimelist.net/reviews.php?id=106561"
        },
        {
            "content": "I really love this anime! *favv*\r\nI've seen it back begin 2007. I really like'd the idea of the girl being a un-vampire. And all the situations next to that ;3 Only it sounds like she is comming when her blood flows out xD *ORGY*\r\nThe animation is really great and looks beautifull! All the characters are original and to be honest, i would have love'd it if there where more episodes.\r\nLucky the manga is still here! ^^",
            "date": "2010-05-06T15:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 25794,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325422.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Puppy-Likes-You",
                "username": "Puppy-Likes-You"
            },
            "url": "https://myanimelist.net/reviews.php?id=25794"
        },
        {
            "content": "I watched Karin a while a go so I am a little shaky on the details, but hopefully this is accurate XD.\r\nWell I enjoyed the hell out of it. It follows a standard comedy romance progression but with the key differences thrown in from the Vampire/Reverse Vampire nature of Karin and her family. It is hilarious and definitely recommended, even if you happen not to be a huge fan of comedy romances (It was on of my first that I liked a lot). I am primarily a sub watcher, but I saw this in dub and still liked it so watch whichever is your preference.\r\nTheoverarching story is nothing particularly special for the genre, focusing on the growth of the relationship between Karin and Usui (who shares a name with another of my favourite male protagonists, from Maid-Sama) but of course the problems caused by Karin's reverse vampirism gives a twist that both helps and hinders the two main characters relationships, and towards the end with Karin's family. Part way through the introduction of a new character adds additional interest to make sure the show isn't repetitive before reaching it's satisfying end.",
            "date": "2015-11-16T15:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 203506,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4997029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jamattack",
                "username": "jamattack"
            },
            "url": "https://myanimelist.net/reviews.php?id=203506"
        },
        {
            "content": "I discovered this series from a google ad and decided it looked cute. It was hilarious, I didn't stop laughing from start to finsh. The animation was great for a comedy series(usually they skimp on them), the english voices, especially Karin's grated on my nerves after a while but the translation was pretty much on the spot(they didn't alter the storyline). Mind you though this series overran its manga so half way through they changed the storline and made up a character but it's still all good. The writing staff did a great job, it's still funny and believible for the tone of manga series.Though it seems a few parts that they rewrote, they rewrote to appeal to girls(i.e. the minor yaoi scene). It would have been cool though if they had waited until the manga had run it's course and then created the anime. Sadly this anime couldn't do its manga parent justice and if compared is actually a bit of a flop.",
            "date": "2009-06-04T16:39:00+00:00",
            "helpful_count": 0,
            "mal_id": 15487,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32539.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kuran_Yuki",
                "username": "Kuran_Yuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=15487"
        },
        {
            "content": "This series is pretty stereo typical to begin with. Girl meets boy, vampire meets human. Eventually boy finds out girls secret and the series continues with their relationship changing with lots of unexpected events happening around them. This starts out as a great romantic comedy, but suddenly takes a turn for the sad aspect of life and love. I really liked watching this, however, it did bring me to tears. My personal preference is Shojo School life romantic comedies, so the only sad anime series I watched was when I accidentally got hooked to Wolf Rain. It was amazing how fast everything went bad andsad and situations became horribly realistic, for a supernatural series anyway. Not that I don't think vampires don't exist, but that's beside the point.\\n\r\nThis anime actually gets you worked up. I found myself screaming at the screen: BAKA!! or KAWAII!!\\n\r\nIt was funny and silly, while at the same time sad, dreary, and infuriating. One good thing I observed about this, was that for once, it's the girl who has a nosebleed, and not the perverted guy. Although Karin's nosebleeds aren't because of perverse thinking, at least, not always ;) .",
            "date": "2011-01-05T10:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 33475,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/428183.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fario",
                "username": "Fario"
            },
            "url": "https://myanimelist.net/reviews.php?id=33475"
        },
        {
            "content": "This Anime show is my favorite anime ever! I loved this anime because it's really funny and romantic. It keeps you thinking what's going to happen. It's easy to understand and is not confusing. It can be really sad sometimes and touches you. If you love vampires and anime (like i do) then you should definetly watch this!! Best anime show ever!!!",
            "date": "2010-07-03T17:49:00+00:00",
            "helpful_count": 0,
            "mal_id": 27928,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/350125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BriannaVaniity",
                "username": "BriannaVaniity"
            },
            "url": "https://myanimelist.net/reviews.php?id=27928"
        }
    ]
]