[
    [
        {
            "content": "\"They call it Hundred because you've seen this show hundreds of times already.\" I don't remember the name of the original user who said this but I do like that part in your review.\r\nIf I had to say what Hundred's weakness is, its that the show lacks any uniqueness to help it stand out more from the rest of the magic school battle anime out there.  It appears as if there is a really bad cycle in Japan right now where so many.. school/harem/sci-fi anime are taking over and in my opinion not too many of them are doing so well. I mean we'vehad asterisk wars, chivalry of a failed knight and many more  similar every season and each title just leaves me with mixed feelings. Now the story is simple, straight-forward yet lacks uniqueness which I believe is something that is absolutely vital in every anime & manga. Hundred is literally copy & pasted meaning if you have watched at least 2 or three titles similar to this then you can already predict the upcoming events and the relationships between characters. In addition to that, prediction the plot along with the events that are going to take place for certain episodes is sort of like a walk in the park. Now I'm not really trying to criticize Jun Misaki because other authors obviously have this idea too. They want use the re-occurring themes found in other authors work and make their own unique novel based upon those theme. That's perfectly fine however it hurts both the story and the plot in  many ways because it is all too common. This is exactly why I brought up the \"bad cycle\" theory. If I didn't watch shows like these when they aired for a while and just got into hundred then perhaps I could've felt that the story was refreshing however, this simply was not the case.  There were no exciting story developments and plot development felt weak. Most importantly though it was pretty hard for me to get excited and engaged with such meritocracy. Overall I just was not impressed with the stories presentation nor plot because it's been done too many times to the point where I really wanted to drop it.\\n\\n\r\nThe art & animation is actually really great. The flow of the fighting and action scenes were  amazing to me. Although I could've done without the talking through most of the battles, I was, for the most part impressed seeing the duels between characters like Claire, Hayato, Emile etc.  The character designs were pretty good however I still prefer the illustrations done in the light novel by Nekosuke Ōkuma over designs made by the producers at Production IMS.\\n\\n\r\nSound was pretty decent for the most part. I didn't care for the soundtracks background music nor the opening and intro songs. I did like the sound effects I think those were pretty good. The singing done in the show , sort of like pre-game musical performances were annoying. It's like they tried to add Idols to the already unnecessarily convoluted show. I don't really have too much to say about the seiyuu's involved in the show. I think their performances were pretty good. They each delivered some pretty solid lines. Overall I was okay with the sound department not too many complaints nor praise to give it.\\n\\n\r\nCharacters are so forgettable that I'll probably never even remember them. Hayato Kisaragi is literally copy and pasted from every other show liked this. the childhood friend romance is overplayed. The girls start to fall for generic MC kun.  Fan service, fan service, Production IMS should have at least taken the time to make the fan service look good. I would love to delve more into the characters department however, because I've finished my review, I probably don't want to go back watch the show again and  then edit my review again to add more details. This is simply because I feel like my review based on the characters would be more like a rant rather than an actual review.  My impressions of the characters overall is that they simply needed more work to distinguish themselves from others.\\n\\n\r\nMy enjoyment for the series pretty low. I felt like this was a title I really should have dropped however, my goal is to see every show through regardless of how \"bad\" or \"Awful\" it is. Personally I do feel like if this show didn't rely mostly on overused  plot, story and characters found in similar titles then it really could have been better. compared to chivalry of a failed knight I liked it better because even though the titles shared somewhat similar stories,  failed  knight, even asterisk wars, remained unique, had likable characters, and a better story introduction along with finishes. I felt like there was a lack of effort put into the creation of the Hundred anime. It was sort of like the director said \"alright team, we are producing  a new show, go watch every show with similar story, plot, and characters and copy it asap.\" However! However, they forgot about crucial part \"making hundred unique.\" If I asked anyone whose scene this show \"Hey do you remember hundred\" I am roughly 92.5% sure they wouldn't remember it. Hundred fails to leave me with a memorable impression of it. Overall I wouldn't recommend hundred to anyone. I feel like there is too many imperfections to this series. Hundred is about 70% avoidable, I'd say there is a one in a \"Hundred\" chance of me watching this again.. I wanted to walk a Hundred miles away from my computer while watching this... okay, that last one didn't work but you get the point.. I didn't like hundred..\\n",
            "date": "2016-06-20T07:54:00+00:00",
            "helpful_count": 151,
            "mal_id": 221290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=221290"
        },
        {
            "content": "The last time I made a “review” of this, it was more like a first impressions… but this time, I’m going to make a full, spoiler free review of the show! \r\nThis show is another one of those battle action harem shows that we see every season at this point. It’s been touted as an “Infinite Stratos” clone. I personally haven’t seen Infinite Stratos so I won’t hold that against this show. Let’s see what this show has to offer.\r\nStory (3/10)\r\nIt’s hard to talk about the story of this show. Not because it’s a difficult story to wrap your head around, but because it takesa back seat to literally everything else in this show. Beach episode? More important! Idol performance? 3 times more important! We got 3 of them! Harem ecchi scenes? Again, more important.\\n\\n\r\nHere’s what little plot there is. Hayato transfers to a new school where he apparently scored the highest score on the school’s entrance exam in the history of that school. Because he tries to prevent a couple of students from getting expelled, he gets stuck battling the student council president of this school. \\n\\n\r\nShe’s the most experienced fighter at this school there’s no way she can los- Oh she lost. The main character is that mc that is overpowered mc that we see in so many shows nowadays, but at least in this show, there are formidable foes and there seems to be a little tension. It just gets stuck so far behind the fanservice of this show that it loses its purpose.\\n\\n\r\nSpeaking of the fanservice, it’s bland and overused. There are only a couple things this show does differently in terms of fanservice, and even then it’s just kind of me. The only thing enjoyed with the fanservice was in episode 10. I’m not going to say what happened, but I will give this show the fact that it was a little creative. \\n\\n\r\nMoving on from there, the show doesn’t have a clear antagonist. Every time there’s a conflict, it ends within one or 2 episodes. The only reason it takes more time is because of the slice of life fanservice. The main “conflict” is between the school’s fighters and Savages. Savages are these mechanized robots that came from who knows where and just cause havoc.\\n\\n\r\nThese high school students are the ones who fight these monsters instead of adults. This show makes me question a few things. How do they have the money to fight these savages? Where did savages come from? How are there more always coming? Who’s making these savages? Why are they allowing high schoolers to fight?\\n\\n\r\nIt doesn’t answer a lot of questions and that leads to wondering if they thought anything through. The show also presents a lot of ideas about its premise. Great! Possible themes that could be made for some semblance of a message to come out of this show. Too bad those ideas don’t really go anywhere. They just get thrown at you and then sit there and rot. \\n\\n\r\nThe ending actually DOESN'T leave me wanting more and left me feeling like this was ACTUALLY A COMPLETE STORY! This is something I can't say about many of the other shows like this. The one problem with the ending is that it ends a little TOO well with no consequences. That being said, it's better than a lot of other shows of the light novel genre.\\n\\n\r\nThe one way I can describe this show, from how I experienced it is that it’s so bad it’s good. It’s one of those sit back and turn your brain off kind of shows. If it tried to do more differently, I could go back and enjoy turning my brain off when watching this show, but I can’t. I laugh at this show’s attempts at being serious because it can’t keep a mood or tension.\\n\\n\r\nIt goes from serious to fanservice to comedic all within 2 minutes of an episode. It’s poorly executed and there’s nothing more to say about the story. \\n\\n\r\nCharacters (2/10)\\n\\n\r\nThe characters in this show are bland and forgettable. Most of them fall into archetypes and others just don’t have any purpose. The main character is the dense mc self-insert. The scientist is the loli of the series. \\n\\n\r\nThe only character to have any actual development is the student council president. This was actually surprising because she started off as the tsundere of the series, then turned into not a tsundere and a member of Hayato’s harem. \\n\\n\r\nThe character interactions range from forgettable to cringy. That’s because there’s so much bad writing in this series. Characters state the obvious, there are info dumps even though characters should know what’s going on, and the villains are one dimensional. \\n\\n\r\nThe show tries to show off the how the villains are the product of their environment, but it’s so poorly executed and only meant to redeem them that I just don’t care.\\n\\n\r\nThese characters are meant for this kind of series and this kind of series alone. You aren’t supposed to take them seriously and you’re just supposed to watch. This show clearly has a target audience, and I’m not part of it. \\n\\n\r\nMusic, Art, and Animation (2/10)\\n\\n\r\nFor an anime, I expect animation. For this anime, I got scenes of up to 3 minutes in an episode with just still frames and nothing more. How am I supposed to say this show has good animation when it uses an excess amount of still frames, establishing shots, and reuses animation? There are scenes from the show used in the OP and they don’t look impressive. \\n\\n\r\nThe art style is also generic and bland with nothing of note. The transformation segments are, just like any other show with transformation segments, reused. There’s little to movement a lot of the times and the lips don’t even get close to syncing up with the animation. \\n\\n\r\nProduction IMS must have saw the light novel, threw it in the animation room, and said “you have 2 months to make this even though it should take longer! Go!” This was the result. \\n\\n\r\nCharacter designs are lazy and forgettable. They look so similar to characters from other shows that I can’t tell them apart at points. I sometimes wonder if this is a bad knockoff anime to some other anime. The amount of fanservice with the character designs alone is annoying.\\n\\n\r\nThe music also ranges from forgettable to annoying. Much of the OST gets on my nerves at times because it doesn’t fit the mood or it ruins the mood of the moment. One track of note is the OP, but there are still better OP’s from this season alone. I’m personally just a sucker for shows having 2 singers singing back and forth. \\n\\n\r\nThe audio design also doesn’t sound good as, sometimes, I heard the echo from the recording room that the voice actors were performing in. It doesn’t sound good and got on my nerves. One performance was hilarious and annoying at the same time, and once you see it, you’ll know what I’m talking about. \\n\\n\r\nThere are 4 ED’s in this show and none of them really stand out. When they switch, I’m just like “Ok” and skip it. Some voices don’t fit the design of the character and others do. The action scenes don’t look very good, for the most part and I don’t get hyped up when one starts.\\n\\n\r\nFinal Verdict (2/10)\\n\\n\r\nThis show is a mess. It really is. It’s a hodgepodge of every cliché story line ever and it doesn’t do anything new. There are ideas presented that don’t go anywhere and conflicts that don’t have buildup. It’s a show out there for people who like this kind of show and that’s it. That’s why I give this show a 2/10 on a critical level. \\n\\n\r\nIt does a couple things right, but it’s so shrouded under the bad that I had to really dig to get the positives out of this show. On an enjoyment level, I give this a 1/10 from the show itself and a 5/10 from how much fun I had making fun of it while watching. If you want a so bad it’s good show, this is your show. \\n\\n\r\nIf you want a better harem show, just watch Monster Musume!",
            "date": "2016-06-29T11:33:00+00:00",
            "helpful_count": 127,
            "mal_id": 222350,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5132460.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Randy_Drews",
                "username": "Randy_Drews"
            },
            "url": "https://myanimelist.net/reviews.php?id=222350"
        },
        {
            "content": "Personally, I enjoyed this anime. It was nothing special, but I never expected it to rise above my expectations for a harem anime. I have always found guilty pleasure in watching \"magic battle school\" type anime, even though they are all so similar. If you enjoy watching school-battle harem anime, than you will enjoy watching Hundred. \r\nIf you hate watching the same tropes recycled season after season that this genre of anime uses, then take this one off your watch list and find something you will enjoy to watch instead (unless you are a masochist). Seriously. Too often have I seen negative reviews from peopleexpecting way more out of a harem anime than the genre ever promised to deliver.\\n\\n\r\nHundred is tagged as both \"school\" and \"harem\" in MAL, and these tags should let you know exactly what you are gonna see if you decide to watch. Because when you see the tags \"school\" and \"harem\" and read the description, you should know exactly what story will be unfolding. For those who are unaware, this is what happens EVERY time:\\n\\n\r\n1. MC-kun, a boy with a tragic back story, gets admitted to an exclusive academy for people skilled in one of the following: \\n\r\nA. Mecha's\\n\r\nB. Magic\\n\r\nC. ESP\\n\r\nD. other supernatural or quasi-scientific abilities\\n\\n\r\n2. MC-kun will be extremely skilled and powerful when it comes to his \"special\" abilities, though he might not be fully aware of his own power or how he became such a special snowflake. \\n\\n\r\n3. Beautiful women he encounters will become romantically and sexually attracted to MC-kun (though he probably won't notice), and the harem that forms around him will have 3 or more archetypes from this list:\\n\r\nA. Tsundere (often blond)\\n\r\nB. Kuudere \\n\r\nC. Friendly but not-so-smart airhead\\n\r\nD. Sexy transfer student\\n\r\nE. Overly attached imouto (often with a brocon)\\n\r\nF. Girl who has to dress like a boy\\n\r\nG. Top of class girl who gets beaten by MC-kun\\n\r\nH. Childhood friend\\n\r\nI. Loli\\n\\n\r\n4. Various problems will arise during the season as his harem competes for MC-kuns affections, and he will be 100% oblivious to the cause of the tensions. However, the girls will resolve these tensions and decide to compete peacefully as rivals with phrases such as \"I won't lose\".\\n\\n\r\n5. MC-kuns abilities will develop over the season and at the end he will tap into his power to overcome insurmountable odds, aided of course by his harem of beautiful ladies, and the power of friendship. \\n\\n\r\nThat is basically the formula. EVERY SINGLE TIME. Hundred is no exception. So if you are ready to jump into another school based harem adventure with MC-kun, then you should definitely watch hundred and enjoy the ride, knowing it will be a slightly different path through very familiar territory.  \\n\\n\r\nThe artwork is good, but not great. The soundtrack is acceptable, nothing special there. The characters are the same ones I would expect given the genre. However I still found this to be an enjoyable experience for what it is and would recommend to any fan of the genre.\\n\\n\r\nIf you are tired of the same old tropes and archetypes and don't find them enjoyable to watch, skip this one and watch something that you will really enjoy. \\n\\n\\n\r\nTL;DR - Watch Hundred if you are a fan or newcomer to the Action+School+Harem genre. You will enjoy it. If you hate the genre, this will not win you over, so watch something you may actually like instead.",
            "date": "2016-06-18T13:41:00+00:00",
            "helpful_count": 59,
            "mal_id": 221097,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4933051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ElSensei",
                "username": "ElSensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=221097"
        },
        {
            "content": "This is my second actual review so I am still new to this, so bare with me. \r\nHonestly the only reason I am writing this is because I was checking to make sure the series was only 12 episodes then saw that everyone apparently hates this show (which I laughed at because I thought it would have a really good rating).\r\nSo Hundred has 3 main genre to it: Ecchi, Romance, and Action. These will be assessed at the end. For now, the usual garbage:\r\n______________________________________________________________\r\nOverview:\r\nI was not expecting much when I cam into this anime. I saw the first episode and thought \"oh joy is me,another freakin harem anime.\" DAGA SHIKAAASHI, this was not the case. The anime was not like...Rakudai Kishi levels of good, but it also was not Kodomo no Jikan levels of bad. \\n\\n\r\nStory (7/10):\\n\r\nI know what you are thinking, \"for someone trying to tell me this anime is not bad, a C for story is not a good start.\" Well you know what they say, C's get degrees. But seriously, if you are looking for the next Clannad or DBZ in terms of original, great story, then move on buddy. \\n\\n\r\nThe story is not amazing, your typical shounen protagonist gets into typical shounen situations and exhibits typical shounen badassery. He is part of an academy of warriors which...honestly now that I really think about it is comprised of like 98% females...like even the staff...but anyway he fights the bad monsters. Yay! Shounen!\\n\\n\r\nI for one like to unwind with a good shounen anime every now and then and just watch the protagonist go through his hard life of being TOO awesome and TOO attractive and grope TOO MANY boobs by accident. It is hilarious and just...so excessive in the best way possible. But yeah the story is pretty basic, 7/10.\\n\\n\r\nArt 8/10:\\n\r\nNot gonna lie I am not exactly an Art major. \"It didn't suck,\" I guess would be my best analysis. Like what makes good art for anime? I did not get a headache watching it but I was not half chub every time a scenic landscape was shown. Didn't suck, 8/10.\\n\\n\r\nSound (8/10):\\n\r\nAgain, not an artsy guy. I said that in my Rakudai Kishi review and I will say it in every other review. The soundrtrack was fine, not out of palce in fight scenes. The opening was not bad either, but I swear I have heard it somewhere else and I just could not put my finger on it. Ears still intact, 8/10.\\n\\n\r\nCharacter (8/10):\\n\r\nOkay there are like 3 characters in this anime, and do not let anyone tell you otherwise. Everyone else is meaningless. THIS IS ALL ABOUT THE LOVE TRIANGLE BABY!!!\\n\\n\r\nThat's right, triangle. 2 chicks, one dude. Harem? I THINK NOT! Anyway, I am gonna assess the three characters separately:\\n\\n\r\nHayato (10/10):\\n\r\nDude fulfills his role flawlessly. He protects his friends, like every other shounen protag, and looks good doin it. Not to mention he is dense as all hell, which is of course a shounen prerequisite. But...he ain't no indecisive lil bitch when is comes to his kokoro. My man knows what he wants! Plus he loves his lil sis. It's touching really.\\n\\n\r\nEmilia/Emile (10/10):\\n\r\nHonestly I hated her in the first episode. My thoughts were basically \"Here she coooomes, Ms. First to join the haaarreeeemm (to the Ms. America song)\". But she was SO. MUCH. MORE! I am a man who likes his romance anime, and Emilia converts this would-be-harem anime into a purebred romance. She is funny, adorable, badass, and straightforward which is a lethal combination not seen since the almighty Stella of Rakudai Kishi. \\n\\n\r\nClaire (6/10):\\n\r\nFuckin...Claire...Harvwayey (Harvey, but nobody can pronounce the fuckin V because it's Engrish). Honestly she is a good addition to the love triangle. She is pretty much the opposite of Emilia in that she is shy about her feelings but really should not be because she is hot as fuuuuuuck. The only reason, and I mean the ONLY reason she has such a low rating is the fact that she calls everyone...EVERYONE...by their full name. Every. Time. Someone shows up, \"ah, Kisaragi Hayato\". Oh Emile is being close to Hayato, \"What are you doing, Emile Crossfode, Kisaragi Hayato???\" Seriously by the end of episode 1 I had everyone's name down fuckin pat. And the worst part is a lot of the names are European...not Japanese...SO SHE CANT SAY THEM PROPERLY. It is clearly a serious struggle on the part of the voice actress to pronounce the names that are not purely Japanese. \\n\\n\r\nOverall, good stuff, 8/10.\\n\\n\r\nEnjoyment (9/10):\\n\r\nHonestly I did not even enjoy this that much until the last few episodes. It was definitely good before that, but the last few episodes rounded the whole series out so beautifully. Not much else to say, I like my romance and this anime had it in spades. Boobs were nice too, 9/10.\\n\\n\r\nOverall (8/10):\\n\\n\r\nBreakdown time!\\n\\n\r\nRomance:\\n\r\nThe anime was surprisingly romance-based. Do not let the \"Harem\" tag on MAL confuse you, this dude has made up his mind by the end. The two main love interests (if you can even call one of them an interest) are both interesting and have their own advantages, and in the end Hayato chooses who he wants to be with, so the viewer gets closure, which is always great.\\n\\n\r\nScore: (9/10)\\n\r\nComposition: 50% (meaning I thought the anime was 50% romance)\\n\\n\r\nAction:\\n\r\nI mean it had action...so there is that. Honestly the action parts were not amazing. They had some really cool moments and Hayato started to be seriously BA by the end, but the fights were too short-lived for anything super badass to happen. The anime clearly wanted to focus on plot development which I was fine with. But if you are looking for a hardcore shootemup-killemup anime then go elsewhere.\\n\\n\r\nScore: (6.5/10)\\n\r\nComposition: 40%\\n\\n\r\nEcchi:\\n\r\nHonestly the ecchi was not really too prevalent, but what was there was the stuff you wanted to see. None of that \"Oh no I walked in on my classmate who looks like an 8-year-old girl while she was changing!\" Man I do not want to be confused about whether or not I should be aroused. The main focus of the ecchi was the big-breasted Claire Harvwayieeii, which was just... the correct decision, plain and simple. Like I said, not too prevalent and you do not even see full nudity, but it is funny and entertaining, so it does its job in my mind. \\n\\n\r\nScore: (9/10)\\n\r\nComposition: 10%\\n\\n\r\nFinal score:\\n\\n\r\n(9)(.6)+(6.5)(.4)= 8.0 \\n\r\noh hey right on the dot, what a coincidence. \\n\\n\r\nHope this review helped. Helped me put off homework that's for sure.",
            "date": "2016-06-23T15:06:00+00:00",
            "helpful_count": 46,
            "mal_id": 221639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kdbernie",
                "username": "kdbernie"
            },
            "url": "https://myanimelist.net/reviews.php?id=221639"
        },
        {
            "content": "Story: 3/10\r\nThere's not much of a story. It's basically about the characters protecting the ship.\r\nArt: 5/10\r\nThe art was okay, but I couldn't help but notice the glaring errors in the animation. Sometimes it was stilted and lazy. For example, there are times when someone is in 1 position in 1 frame, then they cut to someone right next to them, and then they cut to the person next to them in another position entirely. It's as if sometimes, they didn't want to put in the work of the character doing fluid animation or doing something in one frame. This is especially noticeable in the lastfew episodes.\\n\r\nSound: 6/10\\n\r\nThe music was good, especially the opening, but I didn't really like how they changed the ending song almost every episode. I think they should've just stuck to 1 song, especially since the series is only 12 episodes long.\\n\r\nCharacter: 6/10\\n\r\nThe characters are okay. Yes, most of them are cliché, but I didn't hate them. My favorite character was definitely Hayato. He wasn't your average harem anime character whose a pussy, afraid of girls, and dense. Most of the time when he was alone with a girl, he was confident and knew what to do or say. And my favorite thing about him was that he actually chose a girl.\\n\r\nEnjoyment: 6/10\\n\r\nI enjoyed the action and romantic scenes and there was a lot of kissing, but I can't ignore the times where they used harem/ecchi clichés that made me go *facepalm*.\\n\r\nFinal score: 6/10\\n\r\nIt's not good, but it's not bad either. The thing that kept this series from being good was the clichés. Otherwise, when the series did things that were good, it was GOOD. I mean REALLY GOOD. I'm giving them a pass on the lack of character backstory since the ending gave an indication that there might be a season 2. I think it'll be a hit or miss for people on whether or not they like the series. I would like for it to have a season 2 because the potential is there; It's just a matter of whether or not they capitalize on it.\\n\\n",
            "date": "2016-06-20T15:58:00+00:00",
            "helpful_count": 28,
            "mal_id": 221328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jdam5798",
                "username": "jdam5798"
            },
            "url": "https://myanimelist.net/reviews.php?id=221328"
        },
        {
            "content": "Hundred, more like Hundred % in to the trash it goes. \r\nWhen you make a fusion of Light novel adaptation and every single harem trope you get this kind of abomination.\r\nIt was painful to finish this series and I actually dropped it at episode 7 but one weekend I had this extreme hangover and decided to punish myself for it by finishing Hundred. During that day I actually enjoyed puking more than watching Hundred and that says a lot.\r\n+ It was only 12 episodes but it felt like a 2 cour\r\n+ It made puking seem like a nice activity\r\n+ I'm never going to drink thatmuch again\\n\\n\r\n-Everything else",
            "date": "2016-07-07T07:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 223389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4959871.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Jureon",
                "username": "Jureon"
            },
            "url": "https://myanimelist.net/reviews.php?id=223389"
        },
        {
            "content": "Hundred ON!!!!!!!! (The edited Repost)\r\nSo another harem, ci-fi, ecchi, mecha, romance with school genre has just been completed and quite frankly.........I don't have anything nice to say about it, for the following reason:\r\nStorywise, it was just the run of the mill plot were guy meets first girl, first meet up with guy , another girl comes to the scene and another and another. Also, the action is just a run of the mill thing where big monsters come and guy and harem members have the job to deal with them and in the end guy ends up with either any of the girls or noneat all . But in this case, it was the first girl gets the prize. The only thing tweak here is that first girl has to cross dress, were we weren't even sure as to why, don't you just hate that...so definitely, it's a 5 over 10. Since we are left wondering as to why first girl has to cross dress. \\n\\n\\n\r\nArt, I gave it a 7 over 10 since cu'z of the slutty attires of student council be it in uniform or in leotards, since those were the only consolations of this run of the mill anime, also, I may have given the art a \"good\" , but with the character's design made by Tanaka Kie about Emile or Emilie, it's a bit too hap hazard, considering that she can be easily identify as a girl , despite of being in a boy's uniform, thought at first I have some reservations about her, thought it maybe good it just not that good enough.\\n\\n\r\nSound, I just gave it a 4 over 10 since there isn't much for me to say, and I may not like this anime's musical theme, there is one closing theme that I like, which is \"EYES ON ME\" by Emilia and Sakura. Also for an anime that only runs for 12 episode, this probably that has the most ending theme .\\n\\n\r\nCharacter, Ok, it's a 3 over 10, reason:\\n\\n\r\nHayato Kisaragi: Maybe a typical harem guy in a shining armor, but basically a cheater, reason number 1 for the score.\\n\\n\r\nEmile or Emilie Crossfode: Original creator MIsaki Jun failed to defined if she is of Latin, Germanic, Normand or Saxon origin, also the latter was simply too indecisive of whether he should let the female character open up about her true gender early on or in later time, he also failed to provide with the reason as to the reason as to why she cross-dress as a guy in any episodes, so reason number 2 of the score.\\n\\n\r\nErica Candle, Lowetti Claudia and Liddy Strindberg: The annoying lesbian lackies , whom I love to hate, reason number 3 for the score. Even thought they provide a comic relief for this anime, they're just really lame.\\n\\n\r\nSakura and Karen, whom were the pretties and useless slayers around, reason number 4 for the score.\\n\\n\r\nClaire Harvey: basically a harem member that I would love to hate, one more reason for the score. But then again....or not, those melons are nice.\\n\\n\r\nNow the only characters I like here were them Hunters, since they really played their roles very well, of course there was also that pity effect that I felt when I saw them as to how they have to face such hardships in their lives.\\n\\n\r\nEnjoyment, pretty much a PTW,'s a 3 over 10, sorry guys, I'm just a bit disappointed about such run of the mill anime and I really won't suggest a 2nd season. Also my score itself for this anime's overall is the same, a 3 over 10, so view it at your own discretion.\\n\\n\\n\r\nBOOM!",
            "date": "2016-07-09T11:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 223574,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=223574"
        },
        {
            "content": "Well actually this is the first anime i've ever watched i think its hard to remember since i didnt like anime at first it was bad to me until a friend showed me da wae but srsly this anime wasss great. / The story was a 9 it was a tipical harem/ecchi anime it wasnt perfect but i liked the romance the side characters you would forget them sometimes.  / The art Was pretty decent a 8 not perfect but i like old artstyles like trigun's artstyle etc. / The sound on the subbed version was a 7 but in the dubbed one thevoices vere better so its a 10 for me the characters seemed soo mutch cooler on english even though i love subs more than dubs. / The drawing was good 10 from me some people may not like it but it had less computer animation whitch made it better to the eye some may not think so but its true. / Oh i enjoyed it a loooooooooooot it made me start the anime and cus of it i became a binge heh and ive watched over 2000 anime in the past 3,5 years heh. / Overall the anime is good it doesnt beat some of the anime most love but its a series i watched with grace xD only anime ive ever rewatched a whole wapping 4 times xD dont ask why.",
            "date": "2018-11-22T08:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 294530,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sleizo",
                "username": "Sleizo"
            },
            "url": "https://myanimelist.net/reviews.php?id=294530"
        },
        {
            "content": "TL;DR: Tbh give it a try, I enjoyed it and while it does struggle and the initial uptake it kinda slow, it comes to a nice season ending conclusion. (IMO hoping it isn't a anime ending conclusion but, who knows.)\r\nSo, if I'm honest I really like this show. Sure, people can say 'I've seen it a \"Hundred\" times before' or whatever, but to be honest I believe it does well and provides much needed originality to the 'mecha' category.\r\nTo summarize, while the start of the season was a bit slow on the uptake, it really pulled it together and I was impressed by the visualsand intentions/foreshadowing the director and artists were able to come up with. I'm very pleased watching this and I'd pay money to watch a second season.\\n\\n\r\nSo, I guess here is where I'll go down the list on the reasons why for the above ratings.\\n\\n\r\nStory: For me, the story started slow but after the first few shaky episodes it was off to the races. There isn't much attention to background information which disappointed me but at the same time, it's not as bad as other, more popular anime I've seen. I rate it 7/10 because I enjoyed it and thought that it could easily be elaborated on and brought forth in fruition.\\n\\n\r\nArt: The art was one of the most impressive aspects of this anime for me. The vision and design the director and those who worked on this anime had resulted in this, and in my opinion they should be proud. The visuals were great, there weren't any choppy issues or anything like that, and the graphics were up to date. 9/10 because I loved it.\\n\\n\r\nSound: So, I'm a bit torn on the sound. There was a lot of effort put into the songs used throughout this series and you could tell just by listening to it. However, I feel like aside from the concerts, and a few other scenes it was lacking majorly. So, this rank is more for the actual music and voice acting it's self, rather than the implementation of it. 8/10\\n\\n\r\nCharacter: For me, I really enjoyed the characters. The MC isn't a dense fuck-wit, nor is he a perversion driven maniac. The supporting female is portrayed and shown really well and to be honest I'm very glad with how the relationships ended in the end. That being said I still expect a second season because.. because. However, I won't say the characters were all perfect. I feel like more should've been done for, if nothing else, the main antagonist and the commander, as well as their friends. I feel like they focused more on daily routines and combat, with light or drastic undertoning of relations and development. So, overall I give the main characters 7.5/10 and I give the antagonists and other support characters 5/10\\n\\n\r\nOverall: Overall, I really enjoyed this show and I've enjoyed other ones similar, I even had my doubts with the set up of 'new transfer student immediately faces student president' at the beginning (Infinite Stratos was similar to this). However, as the season progress's and you learn more about the characters it becomes more enjoyable. I won't say it's perfect though, there's a lot of rough patches and ironing out that could be done. Details that were skipped that shouldn't be, and development that could've and should've happened. But, the ending satisfied my need of 'MC is dense af and the kisses always get interrupted in the end' and broke the streak that seemed to exist for some stupid reason. \\n\\n\r\n8/10 I personally enjoy it and recommend it. It's a fun watch.",
            "date": "2016-12-07T19:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 235053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5855729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Phatal",
                "username": "Phatal"
            },
            "url": "https://myanimelist.net/reviews.php?id=235053"
        },
        {
            "content": "NOTE: This anime contains SPOILERS!\r\nSTORY (7/10): The story of the anime was good. It was interesting to see how some of the main characters were in the beginning & how they evolved over the years prior to the series. There's a lot of scenes with backstories (so it's not difficult to follow). Plus, there are some moments where the cliff hangers that constantly keeps us on our toes. Don't forget guys -- I promise you that there is fan service ^_^. I also enjoy the explanation & how unique the crystals of hundred can be. Each crystal possesses various powers for the slayers to useduring their battle.\\n\\n\r\nCHARACTERS (8/10): ALL OF THE MAIN CHARACTERS ARE SLAYERS!\\n\\n\r\nHayato Kisaragi is one of the new students in the Little Garden. He gets into weird situation with other girls & at dangerous times, Hayato can turn into a variant.\\n\r\nKaren Kisaragi is the sister of Hayato & has close relationship with him. She is kind & soft-spoken, currently in a wheelchair, & her hundred enables her to walk normally.\\n\r\nEmile Crossford is Hayato's love interest. They knew each other in the past.. She gets kind of jealous & angry when it comes to Hayato & other girls.\\n\r\nClaire Harvey is one of popular & strongest slayers. She has a small, hidden crush on Hayato & has a dysfunctional family with a complicated past.\\n\r\nSakura Kirishima is a popular idol, has a crush on Hayato, & also gets kind of jealous & angry when it comes to Hayato. Her reputation has inspires her fans to follow their dreams.\\n\\n\r\nOVERALL ENJOYMENT (7/10): For those who have known me by watching the previous episodes of Average Anime Reviews -- I am a fan of slice of life. But after watching Hundred... I enjoy the anime that has brought the comedic moments, fan service & epic action-fighting scenes against the villains. If I were to compare it to another anime -- it would be Attack On Titan. Both animes share similar aspects of action-adventures where the main characters has to battle against the monsters that threaten humanity. For Hundred, it is the safe haven for students to feel safe for any incoming threats of savages.",
            "date": "2016-06-24T20:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 221813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=221813"
        },
        {
            "content": "The story centers on a guy who is secretly more powerful than he lets on and his harem of girls who use magical weapons to battle...wait, that describes three different shows from this season. This review is for Hundred but there will be some comparison to the other two shows, The Asterisk War & Anti-Magic Academy: The 35th Test Platoon. It's inevitable given all the similarities between all three shows. Of the three, Hundred has the best setting. The world they live in is explained, and the addition of the savages gives them a constant threat to face. What isn't really explained is the widerange of hundreds though. Why are no two the same? They mention something about different types of hundred but it's of no consequence. The art is great, it's a treat to look at in both moments of peace and violence. I do have two things that bugged me about this anime that kept me from truly enjoying it. First is the amount of screen time dedicated to Sakura and her singing. Mind you, I grew up listening to Minmay and Yellow Dancer so I know when a musical concert is needed for the story. Sakura's concerts seemed like filler which is odd in a series only 12 episodes long. Second is something that I've hated in anime since I first watched Tenchi Muyo. Three characters just throw their panties at Hayato (he's Ayato in the Asterisk War) but he just doesn't respond. It would be one thing if he was scared of girls, or had a crush on someone else or was gay. Anything but \"HUH?\" though. He could just pick one and we see how that works out or he could reject them all flat out and keep that as a running gag. But watching them throw themselves at him and not get a reaction one way or the other is tedious. I was gonna say watch The Asterisk War over this, but the fact that it ran twice as many episodes as Hundred is all the evidence one needs.\\n",
            "date": "2016-06-21T16:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 221439,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=221439"
        },
        {
            "content": "Hundred...huh huh...more like LA has seen HUNDREDS of these already...\r\nWe've all seen these kinds of animes, it's been quite the trend these few years, from the ones LA will take as an example that LA watched are ; Infinite Stratos (the anime that started it all), Itsuka Tenma no Kuro Usagi, Mahou Sensou, Black Bullet, Mahouka Koukou no Rettousei (where it REALY started to skyrocket into popularity LA thinks), Seikoku no Dragonar, Seirei Tsukai no Kenbu: Blade Dance, Inou-Battle wa Nichijou-kei no Naka de, Trinity Seven, Absolute Duo, Isuca, Juuou Mujin no Fafnir, Seiken Tsukai no World Break, Denpa Kyoushi, Gunslinger Stratos: TheAnimation, Triage X, Kuusen Madoushi Kouhosei no Kyoukan, Gakusen Toshi Asterisk, Taimadou Gakuen 35 Shiken Shoutai, Lance N'Masques and if you \"want\" to admit it or not Saijaku Muhai no Bahamut from last season are some of the animes that does this trend to it's genre doing nothing but oversaturate the market with these bare-boned ecchi harem supernatural \"main protagonist is OP\" as hell done to death, is Hundred any exception?...well time to find out.\\n\\n\r\nLA will say that you've read the synopsis of this anime, but this will bear repeating, LA thinks that this anime has gotten it's name not by it's signature weapon name, but for nearly outright using HUNDREDS of the typical tropes from this anime genre, let's go through this.\\n\\n\r\n*Humanity is invaded by monsters trying to kill us (Juuou Mujin Fafnir, Black Bullet)\\n\r\n*new main male protagonist who's OP than the rest of the cast (Juuou Mujin Fafnir, Black Bullet, Kuusen Madoshi, World Break, Blade Dance etc.) \\n\r\n**who is challenged by one of the best warriors of the school (Asterisk, Rakudai)\\n\r\n*main protagonist's childhood friend is a girl but he's too dense and thinks she's a he (Infinite Stratos)\\n\r\n*kissing in order either suppress the main protagonist's power or make him even more OP? (that's from Campione)\\n\r\n*little sister who's sick and the main male protagonist went to the school to pay for her medical expenses (shades of 35 Gakuen)\\n\r\n*a tug of war of the main protagonist with the main love interests (EVERY FRICKIN' HAREM ANIME EVER)\\n\r\n*mech-suits looks like it's from Infinite Stratos.\\n\r\n*Trace on (from Fate stay nigh- wait what the fu-????)\\n\\n\r\nSeriously, LA thinks this anime just threw whatever popular, cliched tropes from this anime genre and see what stuck...and by all standards it's cliched as hell, but with the MANY tropes it *ahem* stole from it's other previous anime genre animes, it does try to \"slightly\" play against the type but is blatantly obvious it's cliched as hell. \\n\\n\r\nIn terms of characters, almost the entire cast are cookie cutter and cliched very much like the plot, the only character that nearly felt fresh was Emile Crossfode voiced by Rumi Ookubo, she has shades of Char Dunois from Infinite Stratos and is probably one of the genre savvy character (though the main protagonist' little sister is the most genre savvy) and really because of that she was LA's favourite character of this cookie cutter checklisted cliched anime.\\n\\n\r\nThe animation by Production IMS is decent to nearly above average at best, from the battles to the character designs, the animation is at best decent and the battle animation are somewhat even better.\\n\\n\r\nThe fanservice of Hundred is there and is rather rampant typical with these kind of animes but it's \"ok\" as they don't fling fanservice everywhere the highest \"level\" of fanservice it goes is full nudity but covering up the \"naught bits\"...so the fanservice is hardly high.\\n\\n\r\nThe ending gives us an actually competent villain but squandered pretty quickly by changing who the true villain is, and like typical light visual novel anime cliches, the main protagonist saving his new home through friendship (no seriously) and harem hijinks ensues during the final scenes of anime. Overall the ending didn't help much though the build up to it was actually better than the ending it gave out.  \\n\\n\r\nOk, LA knows that you think that LA absolutely hates this anime all due to it being the typical \"supernatural battle harem anime with an OP protagonist\"...yes it has this cliche but at the very least it does try something new, sure with an idol subplot but still. LA really can't hate this anime even if it's cliche riddled as it still has something of a focus just with the typical battle harem cliches. What LA is really saying is, LA would rather watch a cliched riddled anime with tons of fanservice than an anime that is boring in all it's elements. Hundred maybe be cliche riddled, but it wasn't boring...just \"by the books\" at worst and clearly isn't LA\"s worst anime of Spring 2016...there's another anime that has LA's scorn on that title...",
            "date": "2016-06-20T17:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 221341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=221341"
        },
        {
            "content": "Welcome to the probably the most cancer show of the season. It is absolutely awful and is the most generic show that has ever existed. Hell, it’s so generic that they can’t even do anything original. It’s like the writer wanted to write a light novel about something good but then said, I have no ideas, hmm what are my favorite shows and what is popular? I know, let’s take the girls and setting of Infinite Stratos, get the sister from Oreimo, copy Emiya from Fate/ stay night but then change his gender and also make this the best harem ever with the most ridiculouslyoverpowered Kirito that has ever lived. It’s trash although props to this anime for once actually having the MC choose a girl. Yes, that actually happened.  \\n\\n\r\nStory: 1/10\\n\\n\r\n\tThis is quite literally the most generic harem anime in the history of history. Even more generic than Infinite Stratos and I don’t even know how that is possible. It basically follow this guy named Kisaragi Hayato as he goes to this giant ship in the water called “Little Garden” to train to defeat these things called Savages. Now the anime doesn’t tell you where these giant insect things come from nor does it tell you anything about them besides that they are attacking earth. It shows one scene with them coming from space but other than that, never explains their origins or anything like that. Everything else is so generic. Nothing is explained. It’s a stupid generic harem story and it sucks.\\n\\n\r\nArt: 2/10\\n\\n\r\n\tWell this shows looks like it was made in 2006. Literally it does. It looks bland, terrible and nothing amazing. The show could have used a lot better art direction. \\n\\n\r\nSound: 2/10\\n\\n\r\n\tWell I hate the Op and Eds for this show. There terrible in my opinion and the ost is nothing special at all. The insert songs didn’t fare any better.\\n\\n\r\nCharacters: 1/10\\n\\n\r\n\tThese are the blandest, generic, stupid, poorly written, and designed literally the same way as every other character in the harem genre. Hayato is your average MC that like every other MC, is dumb and is a chick magnet. Then we have a rip off of Charlotte from Infinite Stratos, your big boobs president (captain in this anime), the one with the big bro complex, and the one that falls in love with him for no reason. Every other character receives no development what so ever and they are all pretty bad. The villain doesn’t show up until like the last 2 episodes and she’s pretty stupid as well. Overall, these were god awful characters. \\n\\n\r\nEnjoyment: 1/10\\n\\n\r\n\tMan of man did I hate watching this anime. It was so generic and a show that people probably have seen a HUNDRED times already. It was a waste of my time to watch this and it was just a drag to watch this. Nothing could have saved this thing as it was already in the harem genre and with the generic characters that just added more to the fire that is this show. \\n\\n\r\nOverall: 1/10\\n\\n\r\n\tI’m sure you already know my opinion on this anime so I’ll stop talking about that. Here is why you want to or don’t want to watch this series for anyone who is looking to watch it. \\n\\n\r\nWatch if: \\n\r\n-\tYou like harem animes\\n\r\n-\tYou like Romance (bad romance btw)\\n\r\n-\tYou want to see the MC actually CHOOSE A GIRL\\n\r\n-\tDon’t mind god awful stories or characters\\n\r\n-\tCan stand looking at bad artwork and sound\\n\\n\r\nDon’t watch if:\\n\r\n-\tYou hate harem animes\\n\r\n-\tYou need good characters and stories\\n\r\n-\tYou need good artwork\\n\r\n-\tHated SAO (it’s worse than SAO for sure)\\n\r\n-\tLooking for a good show\\n\r\n-\tWanting to be entertained\\n",
            "date": "2016-06-20T17:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 221340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5132374.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GreyGaming",
                "username": "GreyGaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=221340"
        },
        {
            "content": "Honestly, nothing was all that unique in this one. It was a typical light novel adaptation and on top of that, one that has been done several times already. That being said, it entertained me, and that is what I think is the most important.\r\nIn all seriousness though, the characters weren't unique, the concept had been done before, and the story wasn't anything special. It's a typical harem/ecchi anime though, so what would you really expect from it? The fights became pretty decent after a while, and although it seems like the story could continue, the MC does appear to choose one of the girls,which is unusual for this kind of setting.",
            "date": "2016-06-27T21:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 222204,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheFinch",
                "username": "TheFinch"
            },
            "url": "https://myanimelist.net/reviews.php?id=222204"
        },
        {
            "content": "It'd be quite accurate and detailed review if I just wrote \"it's magic battle school harem\". But you surely know that much from synopsis. If you are reading this review that means you want to know how is Hundred any different from other shows of this type and if it's worth watching. I'll try to answer those questions.\r\nHundred's story is as basic and predictable as it gets. Normally it'd mean it's \"average\". Not in this case. You know why I watch ecchi harems? For girls and fanservice. Instead I got some space bugs attacking earth without any reason and school kids fighting them with powersthat were never seriously explained. My girls' screentime was wasted on story that was never fully developed and was predictable as hell. Nothing was explained and things happened just because story needed them to happen. Action scenes were simply \"meh\" and not exciting at all. Not to mention main villain that was just lame.\\n\r\nHonestly, I watched a lot harems, and it's one of the worst cases of story being simple waste of time. If there was no plot and they just sat on that damn ship all day in Slice of Life mode, this anime would be so much better.\\n\\n\r\nUnlike story, characters in Hundred were actually pretty nice. While they weren't that unique, I really enjoyed their interactions with Hayato and with each other. Sadly, they didn't get enough (any?) development - other than some backstory, nothing about them changed during anime. Their characters were rather simple, but I'd say they were ok for this kind of harem.\\n\r\nAs for the protagonist... he sucks. The \"generic harem MC\" might be hated character type, but at least it is some kind of character! Hayato Kisaragi on the other hand is some mannequin. He simply had no personality and was more forgettable than some mob characters.\\n\\n\r\nWhen it comes to art and sound it's on the usual level for battle harems. Looks and sounds good, but animation sometimes lacked. Generally nothing special.\\n\r\nHundred kinda lacked stronger ecchi scenes, so I can't write much about that aspect of visuals.\\n\r\nFor some reason this show got 4 endings songs. I don't understand why was that needed.\\n\\n\r\nEnjoyment? It was just painfully mediocre. I had fun when there were scenes with girls and was really bored or even annoyed when it got to serious moments. \\n\r\nIf you aren't here for harem then I'd strongly advise against watching Hundred.",
            "date": "2016-12-15T12:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 235494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=235494"
        },
        {
            "content": "Oh, yay! Another harem/school/sci-fi/fantasy/duel light novel based anime! People say this anime is called \"Hundred\" because there's a \"Hundred\" other anime like it. I disagree. There is at least 1,000 other anime and 10,000 other light/web novels like this one.\r\nStory: 3/10\r\nPrepare for an exciting adventure where the main character does ORIGINAL things and has an ORIGINAL plot line—not. Take the generic setting for this type of anime—school, some kind of colorful, sci-fi, laser weapon, and monsters threatening the world—and add a generic plot. Main character meets girl -> battle -> main character meets girl -> battle then rinse and repeat. Once the girl meeting isall done, add a generic villain to the mix, and you've got the anime known as Hundred.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art was what you'd expect from a somewhat popular anime for the season, not as good as stuff from KyoAni but much better than crap like Utsu Musume Sayuri or Pupa.\\n\\n\r\nSound: 8/10\\n\\n\r\nI liked the OP and ED, I might not be the best reviewer of songs, but both of the songs are in my top 20 anime songs. The background music fitted well, and there isn't much that's bad about the soundtrack.\\n\\n\r\nCharacters: 3/10\\n\\n\r\nWhen the author was thinking about these characters, he/she must of thought of his/her top 10 light novels/anime and of their main characters, and realized, \"Oh, my! All the character traits are the same!\" then decided to  use those traits to create this un-original, boring main character. As for the harem, just take a couple from the list of common harem members—the loli, the big-oppai, the blonde, the pink-haired, the grey/white-haired, the tsundere, etc—and put all those parts into a couple girls. \\n\\n\r\nComedy: 4/10\\n\\n\r\nNothing you haven't seen before, but I still got a laugh or too out of this, even though I'm fairly experienced in the realm of harem/ecchi. \\n\\n\r\nEnjoyment: 5/10\\n\\n\r\nI didn't mind re-watching Gakusen Toshi Asterisk.",
            "date": "2016-10-07T18:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 231287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4956373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LysUltima",
                "username": "LysUltima"
            },
            "url": "https://myanimelist.net/reviews.php?id=231287"
        },
        {
            "content": "I'm starting to see the appeal to the \"**** is like ****** but\" stamp, so I'll take a crack at it:\r\nHundred is like Infinite Stratos but better.\r\nLet's begin:\r\nStory:\r\n     No seriously, it's so similar! A guy that has high compatibility with his world's battle suits called \"Hundreds\", goes to an academy surrounded by water. There everyone's interested him, a snobby girl fight scene, a cross dresser, etc.\r\nDetails, details, details.\r\nBut Hundred seems to have a stronger story than Infinite Stratos, and also has elements from Strike Witches, Freeze, and Seraph of the End (believe it or not)\r\n     In aworld where destructive creatures called Savages wreck havoc all over the planet (from time to time), a special unit of people called Slayers are trained and sent out to fight these monsters.\\n\\n\r\nThere's a catch! Coming in contact with these monsters gives you the risk of being infected by a virus the creatures hold. Which can either kill you or turn you into a Variant. Which is like a Slayer but generates more energy into their weapons and combat abilities, and are likely to go into a murder frenzy! So their like a rival faction/race of sorts, and that's pretty cool.\\n\\n\r\nNow this happened to our main character (Kisaragi, Hayato) and his childhood friend(Crossfode, Emile), which explains the main character's edge or high compatibility to his Hundred.\\n\\n\r\nI like how the anime gave context to his abilities. He wasn't related to some legendary slayer, and he didn't need it in order to get into an academy. The only reason he's at the academy in the first place, is for the medical treatment he can get for his little sister.\\n\\n\r\nSo and we're off on our college-military life with the anime taps turned up a good amount.\\n\\n\\n\\n\r\n     Now where I feel the anime suffers, is how shifty the tone can get.\\n\\n\r\nAre we watching a main character suffering from the past where he and his childhood friend are almost killed by a monster that infects them with a virus they could have died from or lost their sanity to?\\n\\n\r\nNah, he's learned to deal with it pretty quickly, as opposed to crowds interested in him and women's flirtatious advances!\\n\\n\r\nAre we watching the main character try and come to terms with a virus that's slowly eating at his lust for the power to not lose a fight, or are we watching another wacky harem scenario?\\n\\n\r\nNah, he gets control of it rather quickly.\\n\\n\r\nAre we in a world where kids are purposefully subjected to the virus of Savages in order to manufacture super soldiers, then promptly dying or going insane if they don't have a role in the plot?\\n\\n\r\nYep, moving on~\\n\\n\r\nMaybe everyone's wearing a mask just to stay strong and turn life into a cliched anime, because the atmosphere has trouble staying consistent sometimes. It never broke my immersion, so that's good. But it's best to keep an eye on tone from now on.\\n\\n\\n\\n\r\nThe story does have a sliver of uniqueness as the anime goes on, but if thought Infinite Stratos was forgettable: this anime only slightly alleviates that. It does set up for another season nicely around the ending, so be on the look out for those hints or the anime will feel like their's too many loose ends.\\n\\n\r\nSuch examples being some lone talented scientist out for revenge, harsh environments for kids, people with high authority keeping secrets, cross dressing for a reason, you know the drill.\\n\\n\\n\\n\\n\\n\\n\\n\r\nArt:\\n\\n\r\n     \"Oh boy, an anime not CGing it's balls off~!\"\\n\\n\r\n*watches the last few episodes*\\n\\n\r\n     \"Spoke to freaking soon~!\"\\n\\n\\n\\n\r\nAm I the only one who finds 3d objects in a 2d environment jarring? And vice versa?\\n\\n\r\nNo?\\n\\n\r\nThen the CG popping in, and watching 2d characters fight said CG is jarring!\\n\\n\\n\r\nNot as bad as Infinite Stratos though. I guess the Chief Animation Directors must have been fighting with their own inner Variants. Having a strong enough will power to keep CG's greasy mitts off the characters using their mechanical Hundred parts in fights and CG's muddy feet off the environment, but not enough will power to resist using it on throw-away-enemies or helicopters around the end of the series!\\n\\n\r\nIt was jarring when the Prince of Egypt did it, it was jarring when Spiderman's animated series did it, and it's not about to change because it's an anime!\\n\\n\r\nThat said, when the anime behaves itself: the animations are pretty damned detailed. Not the art, the animations. The subtle movements of people interacting as opposed to standing stark still needs to be commended. I love anyone who thinks of the little things when making an anime.\\n\\n\r\nThe art style on the other hand, still does that fanservice bit where no matter what your wearing: if you have big tits or thick thighs, they're gonna reflect light off them like the military-school uniforms were oiled up.\\n\\n\r\nNow I'm no harrumphing prude; I hunted down a pervy comic the moment I finished the series. But it sure would be nice to see an anime save such glossy appearances for when your actually showing off fan service, and not make the pervy points of interest look saran wrapped. Save that for the body suits, like you have been.\\n\\n\r\nStill, the art style itself (or the character design) looks really good. Norie Tanaka did a swell job, to say he's mostly been an animator. You may recognize his handy work from that one episode in Fairy Tail and those few episodes from Magi: The Labyrinth of Magic.\\n\\n\\n\\n\\n\\n\\n\r\nSound:\\n\\n\r\n     The ambient music seems to be the only music I like. The opening theme's tone reminded me of Date A Live's opening theme, and not in a good way. It came off a bit misplaced, since the tone of the series itself is so shifty. What the opening seemed to be going for here, was how the characters were all struggling with something and the atmosphere always weighed down on everyone, but they had fight on and stay together to make a better tomorrow.\\n\\n\r\nAnd if the anime stuck with that, and not made a check box of pervy and romantic cliches, I'd be alright.\\n\\n\r\nSo the opening left me trying to skip past it sometimes.\\n\\n\r\nThe ending shifted between three different songs as the series progressed. This is what I enjoyed over the opening, as it did fit the tone a bit better. The clicks or groups within the series sang songs that fit their characters for the ending themes, and that vibes well with me. It feels as if the characters are growing are experiencing different things as time goes on, and that should be commended.\\n\\n\\n\\n\r\nAs for the voice actors, I loved them~\\n\\n\r\nEveryone fit their characters, except the rival Variant faction who had a kid who was voiced by someone quite older than the character's design suggested. He was skinnier and smaller than the main character, but spoke as if they were around the same age.\\n\\n\r\nIf it were intentional like in Black Butler: Book of Circus (you know the two characters I'm talking about), than I'd have no problem. But since I got no such vibe, it was surprising.\\n\\n\r\nOther than that, it was nice to recognize other character's voices. Like how the main character's voice sounds like Muneakira from Hyakka Ryōran Samurai Girls, but was the actor who played as the knight from Rage of Bahamut: Genesis. It helped keep me invested as these characters were kept alive in a way by the talented voice actors.\\n\\n\\n\\n\\n\\n\\n\r\nCharacter:\\n\\n\r\n     Girl One: \"We act so close because we've been together since we were kids. We're childhood friends.\"\\n\\n\r\n     Girl Two: *gasp* \"That means I'm childhood friends with him too~!\"\\n\\n\r\n     Girl One: Ha! No, you only spent a day with him as a child. It's not the same.\"\\n\\n\r\n     Me: \"Pfft, dayum!!!\"\\n\\n\\n\\n\r\nThat's how I experienced that moment between the two love interests competing. I get a kick out of the boldness everyone demonstrates towards the main character.\\n\\n\r\nThere's no CARDINAL SIN Tsundere whooping @$$ over the mistakes the main character makes. Nope, everyone must have realized this is an anime and so perversion is treated as a joke that everyone is in on.\\n\\n\r\nIt's like the cast is one big party, and everyone is invited. Giving me quite a good time. If I had to compare it anime cast wise: it's like Tokyo Ravens and Hyakka Ryōran Samurai Girls were dripped into the creation, and made everyone bold without being out of character.\\n\\n\r\n     While voice actors did their parts, the characters that were sided in late in the game came off pretty stale or generic. They had no soul; they were just their. I'll let you see what I'm talking about as you get further into the anime.\\n\\n\r\nBut yeah, thumbs up for the cast this time around!\\n\\n\\n\\n\\n\\n\r\nEnjoyment:\\n\\n\r\n     Here's what you're gonna enjoy. You're gonna like the bold characters, CG not detaching you from the action scenes, good characters, attentive animations here and there, and unique art style.\\n\\n\r\nWhat you're not gonna like is the CG coming out last minute as if it's a cop out, no new character types, heavily cliched, shifty tone, loose ended story elements, and fan service laid on thick.\\n\\n\r\nIn short, nothing new here. It rises above one of it's popular predecessors (Infinite Stratos), but not far enough to make it's own identity.\\n\\n\r\nIt seemed to have lost a bit of steam when crossing the 12 episode finish line due trying to hit a target audience and not trying anything new, but it shouldn't be a waste of time should you pick it up.\\n\\n\\n\\n\\n\\n\r\nOverall:\\n\\n\r\n     The final verdict for Hundred, is a 7 out of 10.\\n\\n\r\n     Overall, it's just another typical anime. It focused enough on it's elements  to not be average, but I felt it lost a lot of potential somewhere along the line. Maybe the visual novel has what the anime lacks, but at this point in time, after watching all 12 episodes, I'm just not thrilled. I'm not at the edge of my seats. I'm happy with the time I gave it and might rewatch the series in bursts, But not buy the disc sets.\\n\\n\r\nI hope you enjoyed my review, I know I don't put a lot of these out, but thanks for reading, and I'll see you all next time~",
            "date": "2016-08-31T08:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 227995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3833133.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RookieLove",
                "username": "RookieLove"
            },
            "url": "https://myanimelist.net/reviews.php?id=227995"
        },
        {
            "content": "Story: so the story pretty much start out with Hayato coming to the little graden also wont really spoil out the story that much also they can use this thing called a hundred which they can use too aid them for different abilities\r\nArt: art was very good nothing bad about it\r\nSound: again like art nothing bad about the sound with the characters or the music\r\nCharacter: now i personally loved the characters personally my fav were of course Hayato and Emile with everything that went on with them and what not also the other characters i did enjoy\r\nEnjoyment: now i hella enjoyed this anime for manyreasons the comedy and everything that would happen to hayato would just make me laugh like crazy and also everything that would happen with him and Emile\\n\\n\r\nOverall: i give this a 9 because of everything with this anime from the comedy to the action being pretty good but just because of the comedy being over the top funny too me",
            "date": "2016-08-27T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 227774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=227774"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\n“…98…99…100! Ready or not, here I come!”\r\nMy brother yelled out the warning, but he would never find me. I was small enough to fit in our laundry basket at home. It didn’t seem like a possible hiding spot, but I knew I could make it work.\r\nAnd I did. I remember holding my breath as my brother continuously walked by. It was humid and stifling in that cramped space, yet I had to prove that the second half of the game was irrelevant when I was playing.\r\nHundred might be related to that counting chant, but itdefinitely couldn’t hide the issues it contained.\\n\\n\r\nSTORY\\n\\n\r\nHundred begins just as Kisaragi Hayato boards the so called Little Garden, a city-on-a-ship which houses Slayers, the protectors of the world that defeat the evil Savages. His arrival makes waves when he demonstrates his uncanny Variant capability, causing the show to start from there.\\n\\n\r\nAnd it ends there, too.\\n\\n\r\nAll right, not really. But what comes after Kisaragi Hayato’s (one must always pronounce his full name) entrance is a narrative weaker than a puddle on the sidewalk.\\n\\n\r\nMuch of the anime tries its best to create harrowing situations centered on the Savages, these bug-like monsters whose only weakness happens to be the crystal jammed into the head of their carapaces. Already the anime starts to tumble since very little variety in the enemies exists, the fights themselves involve either giant lasers or the same set of moves, and the outcomes are rarely satisfying since they usually involve exploding a giant monster time and again.\\n\\n\r\nHundred continues to see problems on a general writing level. For instance, at one point, Claire’s brother Judal claims that Kisaragi Hayato is the key to waking Liza, Claire and Judal’s sister, up from her deep slumber. The anime even takes this chance to tease Claire’s obvious feelings towards Kisaragi Hayato by telling the man to kiss the sleeping sister.\\n\\n\r\nBut Kisaragi Hayato never becomes that key. Instead, Sakura’s singing rouses the dreaming girl, making one wonder why the show tried to push the original route in the first place.\\n\\n\r\nNow, to be fair, the reason Hundred introduces this “conflict” is to have some semblance of an end goal. Because for the entire anime, a final endpoint doesn’t exist. To put it differently, the anime has no overarching plot to speak of. Rather, multiple mini issues of the same type – a bunch of Savages have showed up – pop up. Meaning, not only is the narrative itself repetitive, but also the narrative isn’t working towards anything substantial.\\n\\n\r\nWorse still, as the anime nears its conclusion, it creates more and more problems for itself.\\n\\n\r\nA “new” brand of Savage appears called Replicants. They somehow live without those crystals in their skulls – presumably because they are robotic or just half-organic. Yet that doesn’t seem to make a difference since the characters just beat them up to a pulp to defeat them. Which is weird. The enemies were tough to defeat before because, according to the show’s rules, Savages had those crystals. So removing them somehow makes them simultaneously harder and easier to squash.\\n\\n\r\nAs the area starts to become dangerous, the people in the stadium are not evacuated with haste. In fact, they all just sit there as a huge Replicant knocks on their protective bubble.\\n\\n\r\nBut that has nothing on the gunfire battle held between Mei Mei and Vitaly. In the straight, narrow hallway leading up to Liza’s resting chamber, the cat-maid robot and the evil scientist shoot their guns at one another. Nearly thirty bullets are traded in total, but only Vitaly’s sonar device and her hair get hit whereas Mei Mei only gets shot in the leg. It’s a scene that practically defies logic.\\n\\n\r\nGoing back to that giant Replicant, it doesn’t even count as the final fight. Instead, the anime chooses to have the weapon-scanning girl become a mega-mutant monster that will (of course) blow up the whole place nuclear style if the cast don’t stop her. Naturally, Kisaragi Hayato is the man for the job – but only after two separate instances of psychological pick-me-up magic.\\n\\n\r\nTo give the anime has much leeway as possible, the concept of sound being both a hindrance and a help to the Slayers has a foundation both in Sakura’s character, the shown reaction Savages have to her voice, and the idea that music is something universal, an entity that knows no cultural or societal bounds.\\n\\n\r\nYet this theme is lost amid Vitaly’s quite convenient sonar device, the fact that the anime prioritizes its action, sex, and comedy over its heartfelt moments, and how songs and singing in general aren’t explored to any extent, existing simply as extra side content now and again.\\n\\n\r\nSpeaking of sex, Hundred manages to even fall flat here. And “fall” could not be a more appropriate way to phrase its ecchi material. For on not one. Not two. But on eight separate occasions, the anime employs the infamous fall-on-another-character-to-get-them-into-a-scandalous-ecchi-situation move. A list of them follows in the next paragraph.\\n\\n\r\nKisaragi Hayato falls on top of Claire during their initial duel. Kisaragi Hayato momentarily feels fatigue and thus falls on top of Emilia in their room (much to Claire’s chagrin). Then immediately after, Kisaragi Hayato falls onto Claire, both grabbing her chest and kissing her lips in the process. Emilia hugs Kisaragi Hayato as they bathe together, falling onto him as they plunge beneath the water. Liddy falls crotch-to-face on top of Kisaragi Hayato. Kisaragi Hayato tries to go for a volleyball at the beach, but he falls into Claire’s bikini-clad breasts instead. Claire, while naked, falls on top of Kisaragi Hayato shortly after finishing her lakeside bath. And Kisaragi Hayato, after being peer pressured, falls on top of Emilia while she wears a maid outfit.\\n\\n\r\nDespite all of the anime’s problems in its action and content and sexual appeal, its biggest misstep is literally just that: missing steps.\\n\\n\r\nSome explanation first. Karen is Kisaragi Hayato’s younger sister. She’s hospitalized due to an illness, forcing her to use a futuristic wheelchair to get around. Rather nicely, she receives her very own Hundred, giving her the strength enough to stand on her own two legs.\\n\\n\r\nThe catch? She doesn’t actually move. She stands up and looks around, sure. She even sings her own song. But does she get to walk around? No. All she gets is a few still-shots of her newfound self.\\n\\n\r\nThat’s right. Hundred doesn’t even have the common courtesy to let the poor, sick girl move her legs after finally getting them.\\n\\n\r\nThat’s just rude, man.\\n\\n\r\nANIMATION\\n\\n\r\nHundred sees further trouble in its art and animation.\\n\\n\r\nArtistically, the anime lacks creativity, especially for its many fight scenes. The characters do wield different weapons: Kisaragi Hayato’s sword, Liddy’s lance and shield, and so on. At the minimum, this variety helps to slightly break up the monotony the action regularly encounters.\\n\\n\r\nBut since the anime tends to use dull, “moving” background shots to give the illusion of movement, and since the anime does not seem to understand the word “choreography,” the fights are more or less visual duds.\\n\\n\r\nThe rest of the locations visited and detail in general are not all that appealing. Over-the-top attacks, lasers, and explosions at least keep the anime from feeling too static.\\n\\n\r\nTheir designs are a mixed offering.\\n\\n\r\nSakura’s long twin-tails, casual attire, and pink coloring give her a cute look. Emilia also pulls ahead: Her tomboyish clothes and silver hair help to give her a gender-neutral look when she so chooses.\\n\\n\r\nOn the opposite end sit Claire and Kisragi Hayato. Claire looks like a bug with wings after donning her Hundred. Plus, her ginormous cannon seems quite inconvenient given the fast-paced nature of the battles they take part in. Her massive, blonde twin drills on her head and her huge bust do coincide with her large, commanding presence, but, ultimately, they give her a silly look.\\n\\n\r\nAs for Kisaragi Hayato, he is as plain and as unassuming as can be. His all-black motif does make him cooler, but being cool does not fit his personality.\\n\\n\r\nCHARACTERS\\n\\n\r\nIt’s very difficult to beat an all-time low of “don’t let the younger sister walk with her new legs.” And, to be fair,Hundred does not reach those levels with its characters – but it came pretty darn close.\\n\\n\r\nSakura is the best the show has to offer. She’s a world-class vocalist, using her singing to bring joy and wonder to the masses. However, her past is anything but. From an early age, she was experimented on (along with many other kids) by Vitaly in order to discover more about the Savage virus.\\n\\n\r\nHer time with the other kids allowed her to realize that her voice had power beyond just technical proficiency, for it calmed them down, made them smile. Unfortunately, the others perished throughout the experimentation process. Sakura, however, lived, keeping the memories of those lost with her.\\n\\n\r\nWhen she meets Kisaragi Hayato, she becomes infatuated with him to say the least. And when she hums her special song, and he recounts the time he heard it oh so long ago, it is revealed that it was his uplifting words that first inspired Sakura to pursue singing. Naturally, she falls in love with him all over again.\\n\\n\r\nThat’s the extent of her character. She has a small moment later on where a Savage reacts to her voice, so she believes that her singing only connects to others because of the virus that courses through her and her listeners. As she calls it, it’s not singing but “deception.” Kisaragi Hayato immediately placates her fears, ending this minor conflict before it even officially began.\\n\\n\r\nClaire comes next. She’s initially perceived as an arrogant yet resolute leader. Expelling students without a second thought, challenging Kisaragi Hayato to a duel, and even declaring that she would refrain from going all-out (a statement she goes back on).\\n\\n\r\nHowever, she does have a more innocent side. She’s surprisingly naïve when it comes to romance – kissing, touching, and the like. She can be playful when she wants Kisaragi Hayato to put on a speedo. And she can be kind in helping and believing others.\\n\\n\r\nShe even has a more realistic side, giving her arguably the best character moment in the whole show. During her moonlit, lakeside bath, she tells Kisaragi Hayato that she is only the leader of the Little Garden because she wishes to keep tabs on her brother Judar in order to protect her sister Liza. Which was all started by her mother Linis. In other words, she “selfishly” fights not for others, but for her sister and for herself\\n\\n\r\nGranted, the anime does a very poor job at expounding on her relationships with her family (her mother never even appears in the show), and her characterization is even worse off than Sakura’s. But this small scene, at the very least, makes her feel like an actual person rather than just a beautiful woman to be admired.\\n\\n\r\nEmilia is even worse off. While she poses as “Emile” for roughly the first three episodes, it is not difficult to guess that she is, well, actually a she. Her backstory involves a Savage attack which consequently led to her and Kisaragi Hayato’s Variant mutation. Also, since he saved her, Emilia has loved Kisaragi Hayato ever since.\\n\\n\r\nShe’s very supportive of Kisaragi Hayato as a result, but she does not have much else. Her ability to transmute her Hundred into different forms is cool, and it even holds some symbolism when realizing that she, too, “transmutes” from being a girl to a boy and back again on a regular basis.\\n\\n\r\nMost of her on-screen time is spent being jealous of the other harem members getting close to Kisaragi Hayato, making her into more or less the comedic relief character.\\n\\n\r\nThe anime does drop a major character trait more than halfway through the season – that her true name is not Emilia Hermit (her first fake name being Emile Crossfode) but the royal princess Emilia Gudenburg. She kept it a secret from Kisaragi Hayato for ten years. Neither a friendly nor supportive move to be honest.\\n\\n\r\nRegardless, Emilia does manage to (more or less) win the harem-romance war – which, in this anime filled to the brim with way too many clichés, is nice to see given Emilia’s official childhood-friend status.\\n\\n\r\nThere’s also the three “evil” kids, but Hundred’s meager backstory for the trio is a shoddy, failed attempt at making these weak characters stronger.\\n\\n\r\nAs for Kisaragi Hayato, he is as plain as plain can be. Bland is another way to describe him. Boring is yet another.\\n\\n\r\nKisaragi Hayato miraculously has the highest Hundred capability rating, yet he has never actually used a Hundred device before. He joined the Little Garden on the condition that his little sister receive the best medical treatment on the planet. If nothing else, he’s quite the awesome big brother.\\n\\n\r\nAfter this detail, however, Kisaragi Hayato loses all credibility. He basically moves through the anime falling onto girls and saying nice words that make them fall for him in return. Even his major personal struggle – controlling his full-armament – is lame. At first, it’s controlled by Emilia needing to kiss him to counteract the effects. And then, just because he trained a bunch, his conflict goes away forever.\\n\\n\r\nHis main reason for fighting (besides for his little sister) is to put smiles on the faces of others. Commendable but it simply comes off as yet another plain characteristic for this already too bland, too boring person.\\n\\n\r\nIn other words, by episode three in this twelve-episode season, Kisaragi Hayato plateaus then plummets as a character.\\n\\n\r\nYet he’s not the worst in the cast. That honor goes to Vitaly, the “main antagonist.” She’s an intelligent woman capable of creating artificial Savages and other technology used to harm others. She also had a hand in Sakura’s suffering as well as Claire’s little sister Liza’s conception.\\n\\n\r\nBut Vitaly is not around for ten episodes, making only a brief appearance at the end of the ninth and officially making her entrance at the end of the tenth. Perhaps obviously, she has no backstory, no known motivation, and definitely no apparent characterization. She’s literally just a villain for the sake of being a villain.\\n\\n\r\nShe tries to explain the reasoning behind her attack as being revenge against Judar, a man that she may or may not have had a sincerer relationship with. It’s difficult to tell because, again, nothing was ever given about her. And it will be impossible to tell in the future because she dies, leaving that world with a goofy smile on her face.\\n\\n\r\nEvery single cast member has problems. Some more than others. But to be fair, almost all of them also have a theme connecting them: the notion of making people smile.\\n\\n\r\nFrom Sakura to Claire, from Emilia to Kisaragi Hayato, everyone just wants everyone else to be happy. While this theme is rather superficial and therefore not able to be explored to any reasonable depth, it is at least nice to see some semblance of parallelism between the cast.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track of Hundred shoots for a triumphant tone to match the overall sense of optimism and hope that fills the story and the characters. The piece itself is nothing special – some pacing changes and harmonizing exist – except for the longer English lyrics at both the beginning and end. It’s a passable piece; one of the only passable aspects of the entire anime.\\n\\n\r\nPerhaps due to the singing motif, multiple ending tracks are provided throughout the season. They feature different members, such as Emilia and Sakura for the first ED and Fritz and Reitia for the third ED. Again, none of them are particularly special, but, at the minimum, they do try to switch tones and overall compositions. Plus, it is a nice bout of variety – something that Hundred severely lacks.\\n\\n\r\nThe remainder of the original soundtrack is similar once again due to its low impact and memorability. However, the voice acting performances demonstrate that the anime is not without positives, for what’s given is definitely welcomed. Mao Ichimichi as Claire uses a mature, sultry voice for the upstanding student council president. Romi Ookubo as Emilia brings both happiness and playfulness. And Chinatsu Akasaki as Claudia is wonderfully overzealous in her commitment to Emilia.\\n\\n\r\nENJOYMENT\\n\\n\r\nDespite how much I have been harping on this one, I found it quite fun.\\n\\n\r\nThe vast majority of that fun is attributed to the myriad of romantic moments spread throughout the season. Claire watching Kisaragi Hayato and Emilia on security cameras and getting noticeably mad that she is not the one out on the date. Emilia acting defensive and jealous towards Sakura when the former notices the latter being too close to the harem lead. And Sakura claiming to be Kisaragi Hayato’s “private idol.” Many of these small, cute, and romantic moments exist, making me quite the happy person.\\n\\n\r\nAlso, it was nice to see some (miniscule and unreciprocated) yuri feelings from Erica and Liddy towards Claire. And Claudia was entertaining, too. Her constant lauding of Emilia and looking down on Kisaragi Hayato made her one of the more likable characters of the anime. It’s just a shame that she was introduced so late into the season.\\n\\n\r\nI can’t say I was a fan of much else, though. The battles and the enemies and the “drama” simply got in the way of those romantic or funny scenes. Still, with an unintentionally sarcastic “Thanks a lot” sign, this one saves itself from being a total disaster.\\n\\n\r\nHundred contains hundreds of problems. The story is awkward, the characters are poorly handled, and both the art and the music have their own respective troubles to contend with. In other words, this one definitely wasn’t ready.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, poor narrative choices, repetitive to the max ecchi content, and accidentally rude\\n\\n\r\nAnimation: Bad, boring artistic direction, below average actual animation, and okay character designs\\n\\n\r\nCharacters: Bad, Sakura is okay, Claire is bad, and the rest are horribly constructed, with only a couple of strengths spread out among them all\\n\\n\r\nSound: Fine, okay OP, okay ED’s, bad OST, above average VA performances\\n\\n\r\nEnjoyment: Fine, romance and silliness make for an entertaining time despite the lacking execution\\n\\n\r\nFinal Score: 3/10",
            "date": "2017-06-14T18:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 249926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249926"
        },
        {
            "content": "I lulled me by the cover, thinking it would be a series mecha with good red humor, but it is a copy of \"Infinite Stratos\". Its beginning is \"good\" but as they pass chapters, the plot becomes boring and predictable. the series has 4 3 chapters saga saga.\r\nspoilers\r\n: From Chapter 7 gets boring and slow, and you have an idea of what will happen with the characters, and from chapter 10, the outcome of anime becomes absurd and ridiculous, the typical message of love and friendship .\r\nThe spoilers ended: I give a rating of 6, because comedy is good to laugh a while and entrenertewith the relationship of the characters, and has some good moments of action, if not a very original idea because it can get any better series this. but there are 12 chapters and more to laugh and the little ecchi which to enjoy the action.",
            "date": "2016-07-29T16:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 225361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/igual1",
                "username": "igual1"
            },
            "url": "https://myanimelist.net/reviews.php?id=225361"
        }
    ],
    [
        {
            "content": "\"They call it Hundred because you've seen this show hundreds of times already.\" I don't remember the name of the original user who said this but I do like that part in your review.\r\nIf I had to say what Hundred's weakness is, its that the show lacks any uniqueness to help it stand out more from the rest of the magic school battle anime out there.  It appears as if there is a really bad cycle in Japan right now where so many.. school/harem/sci-fi anime are taking over and in my opinion not too many of them are doing so well. I mean we'vehad asterisk wars, chivalry of a failed knight and many more  similar every season and each title just leaves me with mixed feelings. Now the story is simple, straight-forward yet lacks uniqueness which I believe is something that is absolutely vital in every anime & manga. Hundred is literally copy & pasted meaning if you have watched at least 2 or three titles similar to this then you can already predict the upcoming events and the relationships between characters. In addition to that, prediction the plot along with the events that are going to take place for certain episodes is sort of like a walk in the park. Now I'm not really trying to criticize Jun Misaki because other authors obviously have this idea too. They want use the re-occurring themes found in other authors work and make their own unique novel based upon those theme. That's perfectly fine however it hurts both the story and the plot in  many ways because it is all too common. This is exactly why I brought up the \"bad cycle\" theory. If I didn't watch shows like these when they aired for a while and just got into hundred then perhaps I could've felt that the story was refreshing however, this simply was not the case.  There were no exciting story developments and plot development felt weak. Most importantly though it was pretty hard for me to get excited and engaged with such meritocracy. Overall I just was not impressed with the stories presentation nor plot because it's been done too many times to the point where I really wanted to drop it.\\n\\n\r\nThe art & animation is actually really great. The flow of the fighting and action scenes were  amazing to me. Although I could've done without the talking through most of the battles, I was, for the most part impressed seeing the duels between characters like Claire, Hayato, Emile etc.  The character designs were pretty good however I still prefer the illustrations done in the light novel by Nekosuke Ōkuma over designs made by the producers at Production IMS.\\n\\n\r\nSound was pretty decent for the most part. I didn't care for the soundtracks background music nor the opening and intro songs. I did like the sound effects I think those were pretty good. The singing done in the show , sort of like pre-game musical performances were annoying. It's like they tried to add Idols to the already unnecessarily convoluted show. I don't really have too much to say about the seiyuu's involved in the show. I think their performances were pretty good. They each delivered some pretty solid lines. Overall I was okay with the sound department not too many complaints nor praise to give it.\\n\\n\r\nCharacters are so forgettable that I'll probably never even remember them. Hayato Kisaragi is literally copy and pasted from every other show liked this. the childhood friend romance is overplayed. The girls start to fall for generic MC kun.  Fan service, fan service, Production IMS should have at least taken the time to make the fan service look good. I would love to delve more into the characters department however, because I've finished my review, I probably don't want to go back watch the show again and  then edit my review again to add more details. This is simply because I feel like my review based on the characters would be more like a rant rather than an actual review.  My impressions of the characters overall is that they simply needed more work to distinguish themselves from others.\\n\\n\r\nMy enjoyment for the series pretty low. I felt like this was a title I really should have dropped however, my goal is to see every show through regardless of how \"bad\" or \"Awful\" it is. Personally I do feel like if this show didn't rely mostly on overused  plot, story and characters found in similar titles then it really could have been better. compared to chivalry of a failed knight I liked it better because even though the titles shared somewhat similar stories,  failed  knight, even asterisk wars, remained unique, had likable characters, and a better story introduction along with finishes. I felt like there was a lack of effort put into the creation of the Hundred anime. It was sort of like the director said \"alright team, we are producing  a new show, go watch every show with similar story, plot, and characters and copy it asap.\" However! However, they forgot about crucial part \"making hundred unique.\" If I asked anyone whose scene this show \"Hey do you remember hundred\" I am roughly 92.5% sure they wouldn't remember it. Hundred fails to leave me with a memorable impression of it. Overall I wouldn't recommend hundred to anyone. I feel like there is too many imperfections to this series. Hundred is about 70% avoidable, I'd say there is a one in a \"Hundred\" chance of me watching this again.. I wanted to walk a Hundred miles away from my computer while watching this... okay, that last one didn't work but you get the point.. I didn't like hundred..\\n",
            "date": "2016-06-20T07:54:00+00:00",
            "helpful_count": 151,
            "mal_id": 221290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=221290"
        },
        {
            "content": "The last time I made a “review” of this, it was more like a first impressions… but this time, I’m going to make a full, spoiler free review of the show! \r\nThis show is another one of those battle action harem shows that we see every season at this point. It’s been touted as an “Infinite Stratos” clone. I personally haven’t seen Infinite Stratos so I won’t hold that against this show. Let’s see what this show has to offer.\r\nStory (3/10)\r\nIt’s hard to talk about the story of this show. Not because it’s a difficult story to wrap your head around, but because it takesa back seat to literally everything else in this show. Beach episode? More important! Idol performance? 3 times more important! We got 3 of them! Harem ecchi scenes? Again, more important.\\n\\n\r\nHere’s what little plot there is. Hayato transfers to a new school where he apparently scored the highest score on the school’s entrance exam in the history of that school. Because he tries to prevent a couple of students from getting expelled, he gets stuck battling the student council president of this school. \\n\\n\r\nShe’s the most experienced fighter at this school there’s no way she can los- Oh she lost. The main character is that mc that is overpowered mc that we see in so many shows nowadays, but at least in this show, there are formidable foes and there seems to be a little tension. It just gets stuck so far behind the fanservice of this show that it loses its purpose.\\n\\n\r\nSpeaking of the fanservice, it’s bland and overused. There are only a couple things this show does differently in terms of fanservice, and even then it’s just kind of me. The only thing enjoyed with the fanservice was in episode 10. I’m not going to say what happened, but I will give this show the fact that it was a little creative. \\n\\n\r\nMoving on from there, the show doesn’t have a clear antagonist. Every time there’s a conflict, it ends within one or 2 episodes. The only reason it takes more time is because of the slice of life fanservice. The main “conflict” is between the school’s fighters and Savages. Savages are these mechanized robots that came from who knows where and just cause havoc.\\n\\n\r\nThese high school students are the ones who fight these monsters instead of adults. This show makes me question a few things. How do they have the money to fight these savages? Where did savages come from? How are there more always coming? Who’s making these savages? Why are they allowing high schoolers to fight?\\n\\n\r\nIt doesn’t answer a lot of questions and that leads to wondering if they thought anything through. The show also presents a lot of ideas about its premise. Great! Possible themes that could be made for some semblance of a message to come out of this show. Too bad those ideas don’t really go anywhere. They just get thrown at you and then sit there and rot. \\n\\n\r\nThe ending actually DOESN'T leave me wanting more and left me feeling like this was ACTUALLY A COMPLETE STORY! This is something I can't say about many of the other shows like this. The one problem with the ending is that it ends a little TOO well with no consequences. That being said, it's better than a lot of other shows of the light novel genre.\\n\\n\r\nThe one way I can describe this show, from how I experienced it is that it’s so bad it’s good. It’s one of those sit back and turn your brain off kind of shows. If it tried to do more differently, I could go back and enjoy turning my brain off when watching this show, but I can’t. I laugh at this show’s attempts at being serious because it can’t keep a mood or tension.\\n\\n\r\nIt goes from serious to fanservice to comedic all within 2 minutes of an episode. It’s poorly executed and there’s nothing more to say about the story. \\n\\n\r\nCharacters (2/10)\\n\\n\r\nThe characters in this show are bland and forgettable. Most of them fall into archetypes and others just don’t have any purpose. The main character is the dense mc self-insert. The scientist is the loli of the series. \\n\\n\r\nThe only character to have any actual development is the student council president. This was actually surprising because she started off as the tsundere of the series, then turned into not a tsundere and a member of Hayato’s harem. \\n\\n\r\nThe character interactions range from forgettable to cringy. That’s because there’s so much bad writing in this series. Characters state the obvious, there are info dumps even though characters should know what’s going on, and the villains are one dimensional. \\n\\n\r\nThe show tries to show off the how the villains are the product of their environment, but it’s so poorly executed and only meant to redeem them that I just don’t care.\\n\\n\r\nThese characters are meant for this kind of series and this kind of series alone. You aren’t supposed to take them seriously and you’re just supposed to watch. This show clearly has a target audience, and I’m not part of it. \\n\\n\r\nMusic, Art, and Animation (2/10)\\n\\n\r\nFor an anime, I expect animation. For this anime, I got scenes of up to 3 minutes in an episode with just still frames and nothing more. How am I supposed to say this show has good animation when it uses an excess amount of still frames, establishing shots, and reuses animation? There are scenes from the show used in the OP and they don’t look impressive. \\n\\n\r\nThe art style is also generic and bland with nothing of note. The transformation segments are, just like any other show with transformation segments, reused. There’s little to movement a lot of the times and the lips don’t even get close to syncing up with the animation. \\n\\n\r\nProduction IMS must have saw the light novel, threw it in the animation room, and said “you have 2 months to make this even though it should take longer! Go!” This was the result. \\n\\n\r\nCharacter designs are lazy and forgettable. They look so similar to characters from other shows that I can’t tell them apart at points. I sometimes wonder if this is a bad knockoff anime to some other anime. The amount of fanservice with the character designs alone is annoying.\\n\\n\r\nThe music also ranges from forgettable to annoying. Much of the OST gets on my nerves at times because it doesn’t fit the mood or it ruins the mood of the moment. One track of note is the OP, but there are still better OP’s from this season alone. I’m personally just a sucker for shows having 2 singers singing back and forth. \\n\\n\r\nThe audio design also doesn’t sound good as, sometimes, I heard the echo from the recording room that the voice actors were performing in. It doesn’t sound good and got on my nerves. One performance was hilarious and annoying at the same time, and once you see it, you’ll know what I’m talking about. \\n\\n\r\nThere are 4 ED’s in this show and none of them really stand out. When they switch, I’m just like “Ok” and skip it. Some voices don’t fit the design of the character and others do. The action scenes don’t look very good, for the most part and I don’t get hyped up when one starts.\\n\\n\r\nFinal Verdict (2/10)\\n\\n\r\nThis show is a mess. It really is. It’s a hodgepodge of every cliché story line ever and it doesn’t do anything new. There are ideas presented that don’t go anywhere and conflicts that don’t have buildup. It’s a show out there for people who like this kind of show and that’s it. That’s why I give this show a 2/10 on a critical level. \\n\\n\r\nIt does a couple things right, but it’s so shrouded under the bad that I had to really dig to get the positives out of this show. On an enjoyment level, I give this a 1/10 from the show itself and a 5/10 from how much fun I had making fun of it while watching. If you want a so bad it’s good show, this is your show. \\n\\n\r\nIf you want a better harem show, just watch Monster Musume!",
            "date": "2016-06-29T11:33:00+00:00",
            "helpful_count": 127,
            "mal_id": 222350,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5132460.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Randy_Drews",
                "username": "Randy_Drews"
            },
            "url": "https://myanimelist.net/reviews.php?id=222350"
        },
        {
            "content": "Personally, I enjoyed this anime. It was nothing special, but I never expected it to rise above my expectations for a harem anime. I have always found guilty pleasure in watching \"magic battle school\" type anime, even though they are all so similar. If you enjoy watching school-battle harem anime, than you will enjoy watching Hundred. \r\nIf you hate watching the same tropes recycled season after season that this genre of anime uses, then take this one off your watch list and find something you will enjoy to watch instead (unless you are a masochist). Seriously. Too often have I seen negative reviews from peopleexpecting way more out of a harem anime than the genre ever promised to deliver.\\n\\n\r\nHundred is tagged as both \"school\" and \"harem\" in MAL, and these tags should let you know exactly what you are gonna see if you decide to watch. Because when you see the tags \"school\" and \"harem\" and read the description, you should know exactly what story will be unfolding. For those who are unaware, this is what happens EVERY time:\\n\\n\r\n1. MC-kun, a boy with a tragic back story, gets admitted to an exclusive academy for people skilled in one of the following: \\n\r\nA. Mecha's\\n\r\nB. Magic\\n\r\nC. ESP\\n\r\nD. other supernatural or quasi-scientific abilities\\n\\n\r\n2. MC-kun will be extremely skilled and powerful when it comes to his \"special\" abilities, though he might not be fully aware of his own power or how he became such a special snowflake. \\n\\n\r\n3. Beautiful women he encounters will become romantically and sexually attracted to MC-kun (though he probably won't notice), and the harem that forms around him will have 3 or more archetypes from this list:\\n\r\nA. Tsundere (often blond)\\n\r\nB. Kuudere \\n\r\nC. Friendly but not-so-smart airhead\\n\r\nD. Sexy transfer student\\n\r\nE. Overly attached imouto (often with a brocon)\\n\r\nF. Girl who has to dress like a boy\\n\r\nG. Top of class girl who gets beaten by MC-kun\\n\r\nH. Childhood friend\\n\r\nI. Loli\\n\\n\r\n4. Various problems will arise during the season as his harem competes for MC-kuns affections, and he will be 100% oblivious to the cause of the tensions. However, the girls will resolve these tensions and decide to compete peacefully as rivals with phrases such as \"I won't lose\".\\n\\n\r\n5. MC-kuns abilities will develop over the season and at the end he will tap into his power to overcome insurmountable odds, aided of course by his harem of beautiful ladies, and the power of friendship. \\n\\n\r\nThat is basically the formula. EVERY SINGLE TIME. Hundred is no exception. So if you are ready to jump into another school based harem adventure with MC-kun, then you should definitely watch hundred and enjoy the ride, knowing it will be a slightly different path through very familiar territory.  \\n\\n\r\nThe artwork is good, but not great. The soundtrack is acceptable, nothing special there. The characters are the same ones I would expect given the genre. However I still found this to be an enjoyable experience for what it is and would recommend to any fan of the genre.\\n\\n\r\nIf you are tired of the same old tropes and archetypes and don't find them enjoyable to watch, skip this one and watch something that you will really enjoy. \\n\\n\\n\r\nTL;DR - Watch Hundred if you are a fan or newcomer to the Action+School+Harem genre. You will enjoy it. If you hate the genre, this will not win you over, so watch something you may actually like instead.",
            "date": "2016-06-18T13:41:00+00:00",
            "helpful_count": 59,
            "mal_id": 221097,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4933051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ElSensei",
                "username": "ElSensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=221097"
        },
        {
            "content": "This is my second actual review so I am still new to this, so bare with me. \r\nHonestly the only reason I am writing this is because I was checking to make sure the series was only 12 episodes then saw that everyone apparently hates this show (which I laughed at because I thought it would have a really good rating).\r\nSo Hundred has 3 main genre to it: Ecchi, Romance, and Action. These will be assessed at the end. For now, the usual garbage:\r\n______________________________________________________________\r\nOverview:\r\nI was not expecting much when I cam into this anime. I saw the first episode and thought \"oh joy is me,another freakin harem anime.\" DAGA SHIKAAASHI, this was not the case. The anime was not like...Rakudai Kishi levels of good, but it also was not Kodomo no Jikan levels of bad. \\n\\n\r\nStory (7/10):\\n\r\nI know what you are thinking, \"for someone trying to tell me this anime is not bad, a C for story is not a good start.\" Well you know what they say, C's get degrees. But seriously, if you are looking for the next Clannad or DBZ in terms of original, great story, then move on buddy. \\n\\n\r\nThe story is not amazing, your typical shounen protagonist gets into typical shounen situations and exhibits typical shounen badassery. He is part of an academy of warriors which...honestly now that I really think about it is comprised of like 98% females...like even the staff...but anyway he fights the bad monsters. Yay! Shounen!\\n\\n\r\nI for one like to unwind with a good shounen anime every now and then and just watch the protagonist go through his hard life of being TOO awesome and TOO attractive and grope TOO MANY boobs by accident. It is hilarious and just...so excessive in the best way possible. But yeah the story is pretty basic, 7/10.\\n\\n\r\nArt 8/10:\\n\r\nNot gonna lie I am not exactly an Art major. \"It didn't suck,\" I guess would be my best analysis. Like what makes good art for anime? I did not get a headache watching it but I was not half chub every time a scenic landscape was shown. Didn't suck, 8/10.\\n\\n\r\nSound (8/10):\\n\r\nAgain, not an artsy guy. I said that in my Rakudai Kishi review and I will say it in every other review. The soundrtrack was fine, not out of palce in fight scenes. The opening was not bad either, but I swear I have heard it somewhere else and I just could not put my finger on it. Ears still intact, 8/10.\\n\\n\r\nCharacter (8/10):\\n\r\nOkay there are like 3 characters in this anime, and do not let anyone tell you otherwise. Everyone else is meaningless. THIS IS ALL ABOUT THE LOVE TRIANGLE BABY!!!\\n\\n\r\nThat's right, triangle. 2 chicks, one dude. Harem? I THINK NOT! Anyway, I am gonna assess the three characters separately:\\n\\n\r\nHayato (10/10):\\n\r\nDude fulfills his role flawlessly. He protects his friends, like every other shounen protag, and looks good doin it. Not to mention he is dense as all hell, which is of course a shounen prerequisite. But...he ain't no indecisive lil bitch when is comes to his kokoro. My man knows what he wants! Plus he loves his lil sis. It's touching really.\\n\\n\r\nEmilia/Emile (10/10):\\n\r\nHonestly I hated her in the first episode. My thoughts were basically \"Here she coooomes, Ms. First to join the haaarreeeemm (to the Ms. America song)\". But she was SO. MUCH. MORE! I am a man who likes his romance anime, and Emilia converts this would-be-harem anime into a purebred romance. She is funny, adorable, badass, and straightforward which is a lethal combination not seen since the almighty Stella of Rakudai Kishi. \\n\\n\r\nClaire (6/10):\\n\r\nFuckin...Claire...Harvwayey (Harvey, but nobody can pronounce the fuckin V because it's Engrish). Honestly she is a good addition to the love triangle. She is pretty much the opposite of Emilia in that she is shy about her feelings but really should not be because she is hot as fuuuuuuck. The only reason, and I mean the ONLY reason she has such a low rating is the fact that she calls everyone...EVERYONE...by their full name. Every. Time. Someone shows up, \"ah, Kisaragi Hayato\". Oh Emile is being close to Hayato, \"What are you doing, Emile Crossfode, Kisaragi Hayato???\" Seriously by the end of episode 1 I had everyone's name down fuckin pat. And the worst part is a lot of the names are European...not Japanese...SO SHE CANT SAY THEM PROPERLY. It is clearly a serious struggle on the part of the voice actress to pronounce the names that are not purely Japanese. \\n\\n\r\nOverall, good stuff, 8/10.\\n\\n\r\nEnjoyment (9/10):\\n\r\nHonestly I did not even enjoy this that much until the last few episodes. It was definitely good before that, but the last few episodes rounded the whole series out so beautifully. Not much else to say, I like my romance and this anime had it in spades. Boobs were nice too, 9/10.\\n\\n\r\nOverall (8/10):\\n\\n\r\nBreakdown time!\\n\\n\r\nRomance:\\n\r\nThe anime was surprisingly romance-based. Do not let the \"Harem\" tag on MAL confuse you, this dude has made up his mind by the end. The two main love interests (if you can even call one of them an interest) are both interesting and have their own advantages, and in the end Hayato chooses who he wants to be with, so the viewer gets closure, which is always great.\\n\\n\r\nScore: (9/10)\\n\r\nComposition: 50% (meaning I thought the anime was 50% romance)\\n\\n\r\nAction:\\n\r\nI mean it had action...so there is that. Honestly the action parts were not amazing. They had some really cool moments and Hayato started to be seriously BA by the end, but the fights were too short-lived for anything super badass to happen. The anime clearly wanted to focus on plot development which I was fine with. But if you are looking for a hardcore shootemup-killemup anime then go elsewhere.\\n\\n\r\nScore: (6.5/10)\\n\r\nComposition: 40%\\n\\n\r\nEcchi:\\n\r\nHonestly the ecchi was not really too prevalent, but what was there was the stuff you wanted to see. None of that \"Oh no I walked in on my classmate who looks like an 8-year-old girl while she was changing!\" Man I do not want to be confused about whether or not I should be aroused. The main focus of the ecchi was the big-breasted Claire Harvwayieeii, which was just... the correct decision, plain and simple. Like I said, not too prevalent and you do not even see full nudity, but it is funny and entertaining, so it does its job in my mind. \\n\\n\r\nScore: (9/10)\\n\r\nComposition: 10%\\n\\n\r\nFinal score:\\n\\n\r\n(9)(.6)+(6.5)(.4)= 8.0 \\n\r\noh hey right on the dot, what a coincidence. \\n\\n\r\nHope this review helped. Helped me put off homework that's for sure.",
            "date": "2016-06-23T15:06:00+00:00",
            "helpful_count": 46,
            "mal_id": 221639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kdbernie",
                "username": "kdbernie"
            },
            "url": "https://myanimelist.net/reviews.php?id=221639"
        },
        {
            "content": "Story: 3/10\r\nThere's not much of a story. It's basically about the characters protecting the ship.\r\nArt: 5/10\r\nThe art was okay, but I couldn't help but notice the glaring errors in the animation. Sometimes it was stilted and lazy. For example, there are times when someone is in 1 position in 1 frame, then they cut to someone right next to them, and then they cut to the person next to them in another position entirely. It's as if sometimes, they didn't want to put in the work of the character doing fluid animation or doing something in one frame. This is especially noticeable in the lastfew episodes.\\n\r\nSound: 6/10\\n\r\nThe music was good, especially the opening, but I didn't really like how they changed the ending song almost every episode. I think they should've just stuck to 1 song, especially since the series is only 12 episodes long.\\n\r\nCharacter: 6/10\\n\r\nThe characters are okay. Yes, most of them are cliché, but I didn't hate them. My favorite character was definitely Hayato. He wasn't your average harem anime character whose a pussy, afraid of girls, and dense. Most of the time when he was alone with a girl, he was confident and knew what to do or say. And my favorite thing about him was that he actually chose a girl.\\n\r\nEnjoyment: 6/10\\n\r\nI enjoyed the action and romantic scenes and there was a lot of kissing, but I can't ignore the times where they used harem/ecchi clichés that made me go *facepalm*.\\n\r\nFinal score: 6/10\\n\r\nIt's not good, but it's not bad either. The thing that kept this series from being good was the clichés. Otherwise, when the series did things that were good, it was GOOD. I mean REALLY GOOD. I'm giving them a pass on the lack of character backstory since the ending gave an indication that there might be a season 2. I think it'll be a hit or miss for people on whether or not they like the series. I would like for it to have a season 2 because the potential is there; It's just a matter of whether or not they capitalize on it.\\n\\n",
            "date": "2016-06-20T15:58:00+00:00",
            "helpful_count": 28,
            "mal_id": 221328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jdam5798",
                "username": "jdam5798"
            },
            "url": "https://myanimelist.net/reviews.php?id=221328"
        },
        {
            "content": "Hundred, more like Hundred % in to the trash it goes. \r\nWhen you make a fusion of Light novel adaptation and every single harem trope you get this kind of abomination.\r\nIt was painful to finish this series and I actually dropped it at episode 7 but one weekend I had this extreme hangover and decided to punish myself for it by finishing Hundred. During that day I actually enjoyed puking more than watching Hundred and that says a lot.\r\n+ It was only 12 episodes but it felt like a 2 cour\r\n+ It made puking seem like a nice activity\r\n+ I'm never going to drink thatmuch again\\n\\n\r\n-Everything else",
            "date": "2016-07-07T07:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 223389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4959871.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Jureon",
                "username": "Jureon"
            },
            "url": "https://myanimelist.net/reviews.php?id=223389"
        },
        {
            "content": "Hundred ON!!!!!!!! (The edited Repost)\r\nSo another harem, ci-fi, ecchi, mecha, romance with school genre has just been completed and quite frankly.........I don't have anything nice to say about it, for the following reason:\r\nStorywise, it was just the run of the mill plot were guy meets first girl, first meet up with guy , another girl comes to the scene and another and another. Also, the action is just a run of the mill thing where big monsters come and guy and harem members have the job to deal with them and in the end guy ends up with either any of the girls or noneat all . But in this case, it was the first girl gets the prize. The only thing tweak here is that first girl has to cross dress, were we weren't even sure as to why, don't you just hate that...so definitely, it's a 5 over 10. Since we are left wondering as to why first girl has to cross dress. \\n\\n\\n\r\nArt, I gave it a 7 over 10 since cu'z of the slutty attires of student council be it in uniform or in leotards, since those were the only consolations of this run of the mill anime, also, I may have given the art a \"good\" , but with the character's design made by Tanaka Kie about Emile or Emilie, it's a bit too hap hazard, considering that she can be easily identify as a girl , despite of being in a boy's uniform, thought at first I have some reservations about her, thought it maybe good it just not that good enough.\\n\\n\r\nSound, I just gave it a 4 over 10 since there isn't much for me to say, and I may not like this anime's musical theme, there is one closing theme that I like, which is \"EYES ON ME\" by Emilia and Sakura. Also for an anime that only runs for 12 episode, this probably that has the most ending theme .\\n\\n\r\nCharacter, Ok, it's a 3 over 10, reason:\\n\\n\r\nHayato Kisaragi: Maybe a typical harem guy in a shining armor, but basically a cheater, reason number 1 for the score.\\n\\n\r\nEmile or Emilie Crossfode: Original creator MIsaki Jun failed to defined if she is of Latin, Germanic, Normand or Saxon origin, also the latter was simply too indecisive of whether he should let the female character open up about her true gender early on or in later time, he also failed to provide with the reason as to the reason as to why she cross-dress as a guy in any episodes, so reason number 2 of the score.\\n\\n\r\nErica Candle, Lowetti Claudia and Liddy Strindberg: The annoying lesbian lackies , whom I love to hate, reason number 3 for the score. Even thought they provide a comic relief for this anime, they're just really lame.\\n\\n\r\nSakura and Karen, whom were the pretties and useless slayers around, reason number 4 for the score.\\n\\n\r\nClaire Harvey: basically a harem member that I would love to hate, one more reason for the score. But then again....or not, those melons are nice.\\n\\n\r\nNow the only characters I like here were them Hunters, since they really played their roles very well, of course there was also that pity effect that I felt when I saw them as to how they have to face such hardships in their lives.\\n\\n\r\nEnjoyment, pretty much a PTW,'s a 3 over 10, sorry guys, I'm just a bit disappointed about such run of the mill anime and I really won't suggest a 2nd season. Also my score itself for this anime's overall is the same, a 3 over 10, so view it at your own discretion.\\n\\n\\n\r\nBOOM!",
            "date": "2016-07-09T11:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 223574,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=223574"
        },
        {
            "content": "Well actually this is the first anime i've ever watched i think its hard to remember since i didnt like anime at first it was bad to me until a friend showed me da wae but srsly this anime wasss great. / The story was a 9 it was a tipical harem/ecchi anime it wasnt perfect but i liked the romance the side characters you would forget them sometimes.  / The art Was pretty decent a 8 not perfect but i like old artstyles like trigun's artstyle etc. / The sound on the subbed version was a 7 but in the dubbed one thevoices vere better so its a 10 for me the characters seemed soo mutch cooler on english even though i love subs more than dubs. / The drawing was good 10 from me some people may not like it but it had less computer animation whitch made it better to the eye some may not think so but its true. / Oh i enjoyed it a loooooooooooot it made me start the anime and cus of it i became a binge heh and ive watched over 2000 anime in the past 3,5 years heh. / Overall the anime is good it doesnt beat some of the anime most love but its a series i watched with grace xD only anime ive ever rewatched a whole wapping 4 times xD dont ask why.",
            "date": "2018-11-22T08:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 294530,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sleizo",
                "username": "Sleizo"
            },
            "url": "https://myanimelist.net/reviews.php?id=294530"
        },
        {
            "content": "TL;DR: Tbh give it a try, I enjoyed it and while it does struggle and the initial uptake it kinda slow, it comes to a nice season ending conclusion. (IMO hoping it isn't a anime ending conclusion but, who knows.)\r\nSo, if I'm honest I really like this show. Sure, people can say 'I've seen it a \"Hundred\" times before' or whatever, but to be honest I believe it does well and provides much needed originality to the 'mecha' category.\r\nTo summarize, while the start of the season was a bit slow on the uptake, it really pulled it together and I was impressed by the visualsand intentions/foreshadowing the director and artists were able to come up with. I'm very pleased watching this and I'd pay money to watch a second season.\\n\\n\r\nSo, I guess here is where I'll go down the list on the reasons why for the above ratings.\\n\\n\r\nStory: For me, the story started slow but after the first few shaky episodes it was off to the races. There isn't much attention to background information which disappointed me but at the same time, it's not as bad as other, more popular anime I've seen. I rate it 7/10 because I enjoyed it and thought that it could easily be elaborated on and brought forth in fruition.\\n\\n\r\nArt: The art was one of the most impressive aspects of this anime for me. The vision and design the director and those who worked on this anime had resulted in this, and in my opinion they should be proud. The visuals were great, there weren't any choppy issues or anything like that, and the graphics were up to date. 9/10 because I loved it.\\n\\n\r\nSound: So, I'm a bit torn on the sound. There was a lot of effort put into the songs used throughout this series and you could tell just by listening to it. However, I feel like aside from the concerts, and a few other scenes it was lacking majorly. So, this rank is more for the actual music and voice acting it's self, rather than the implementation of it. 8/10\\n\\n\r\nCharacter: For me, I really enjoyed the characters. The MC isn't a dense fuck-wit, nor is he a perversion driven maniac. The supporting female is portrayed and shown really well and to be honest I'm very glad with how the relationships ended in the end. That being said I still expect a second season because.. because. However, I won't say the characters were all perfect. I feel like more should've been done for, if nothing else, the main antagonist and the commander, as well as their friends. I feel like they focused more on daily routines and combat, with light or drastic undertoning of relations and development. So, overall I give the main characters 7.5/10 and I give the antagonists and other support characters 5/10\\n\\n\r\nOverall: Overall, I really enjoyed this show and I've enjoyed other ones similar, I even had my doubts with the set up of 'new transfer student immediately faces student president' at the beginning (Infinite Stratos was similar to this). However, as the season progress's and you learn more about the characters it becomes more enjoyable. I won't say it's perfect though, there's a lot of rough patches and ironing out that could be done. Details that were skipped that shouldn't be, and development that could've and should've happened. But, the ending satisfied my need of 'MC is dense af and the kisses always get interrupted in the end' and broke the streak that seemed to exist for some stupid reason. \\n\\n\r\n8/10 I personally enjoy it and recommend it. It's a fun watch.",
            "date": "2016-12-07T19:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 235053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5855729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Phatal",
                "username": "Phatal"
            },
            "url": "https://myanimelist.net/reviews.php?id=235053"
        },
        {
            "content": "NOTE: This anime contains SPOILERS!\r\nSTORY (7/10): The story of the anime was good. It was interesting to see how some of the main characters were in the beginning & how they evolved over the years prior to the series. There's a lot of scenes with backstories (so it's not difficult to follow). Plus, there are some moments where the cliff hangers that constantly keeps us on our toes. Don't forget guys -- I promise you that there is fan service ^_^. I also enjoy the explanation & how unique the crystals of hundred can be. Each crystal possesses various powers for the slayers to useduring their battle.\\n\\n\r\nCHARACTERS (8/10): ALL OF THE MAIN CHARACTERS ARE SLAYERS!\\n\\n\r\nHayato Kisaragi is one of the new students in the Little Garden. He gets into weird situation with other girls & at dangerous times, Hayato can turn into a variant.\\n\r\nKaren Kisaragi is the sister of Hayato & has close relationship with him. She is kind & soft-spoken, currently in a wheelchair, & her hundred enables her to walk normally.\\n\r\nEmile Crossford is Hayato's love interest. They knew each other in the past.. She gets kind of jealous & angry when it comes to Hayato & other girls.\\n\r\nClaire Harvey is one of popular & strongest slayers. She has a small, hidden crush on Hayato & has a dysfunctional family with a complicated past.\\n\r\nSakura Kirishima is a popular idol, has a crush on Hayato, & also gets kind of jealous & angry when it comes to Hayato. Her reputation has inspires her fans to follow their dreams.\\n\\n\r\nOVERALL ENJOYMENT (7/10): For those who have known me by watching the previous episodes of Average Anime Reviews -- I am a fan of slice of life. But after watching Hundred... I enjoy the anime that has brought the comedic moments, fan service & epic action-fighting scenes against the villains. If I were to compare it to another anime -- it would be Attack On Titan. Both animes share similar aspects of action-adventures where the main characters has to battle against the monsters that threaten humanity. For Hundred, it is the safe haven for students to feel safe for any incoming threats of savages.",
            "date": "2016-06-24T20:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 221813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=221813"
        },
        {
            "content": "The story centers on a guy who is secretly more powerful than he lets on and his harem of girls who use magical weapons to battle...wait, that describes three different shows from this season. This review is for Hundred but there will be some comparison to the other two shows, The Asterisk War & Anti-Magic Academy: The 35th Test Platoon. It's inevitable given all the similarities between all three shows. Of the three, Hundred has the best setting. The world they live in is explained, and the addition of the savages gives them a constant threat to face. What isn't really explained is the widerange of hundreds though. Why are no two the same? They mention something about different types of hundred but it's of no consequence. The art is great, it's a treat to look at in both moments of peace and violence. I do have two things that bugged me about this anime that kept me from truly enjoying it. First is the amount of screen time dedicated to Sakura and her singing. Mind you, I grew up listening to Minmay and Yellow Dancer so I know when a musical concert is needed for the story. Sakura's concerts seemed like filler which is odd in a series only 12 episodes long. Second is something that I've hated in anime since I first watched Tenchi Muyo. Three characters just throw their panties at Hayato (he's Ayato in the Asterisk War) but he just doesn't respond. It would be one thing if he was scared of girls, or had a crush on someone else or was gay. Anything but \"HUH?\" though. He could just pick one and we see how that works out or he could reject them all flat out and keep that as a running gag. But watching them throw themselves at him and not get a reaction one way or the other is tedious. I was gonna say watch The Asterisk War over this, but the fact that it ran twice as many episodes as Hundred is all the evidence one needs.\\n",
            "date": "2016-06-21T16:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 221439,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=221439"
        },
        {
            "content": "Hundred...huh huh...more like LA has seen HUNDREDS of these already...\r\nWe've all seen these kinds of animes, it's been quite the trend these few years, from the ones LA will take as an example that LA watched are ; Infinite Stratos (the anime that started it all), Itsuka Tenma no Kuro Usagi, Mahou Sensou, Black Bullet, Mahouka Koukou no Rettousei (where it REALY started to skyrocket into popularity LA thinks), Seikoku no Dragonar, Seirei Tsukai no Kenbu: Blade Dance, Inou-Battle wa Nichijou-kei no Naka de, Trinity Seven, Absolute Duo, Isuca, Juuou Mujin no Fafnir, Seiken Tsukai no World Break, Denpa Kyoushi, Gunslinger Stratos: TheAnimation, Triage X, Kuusen Madoushi Kouhosei no Kyoukan, Gakusen Toshi Asterisk, Taimadou Gakuen 35 Shiken Shoutai, Lance N'Masques and if you \"want\" to admit it or not Saijaku Muhai no Bahamut from last season are some of the animes that does this trend to it's genre doing nothing but oversaturate the market with these bare-boned ecchi harem supernatural \"main protagonist is OP\" as hell done to death, is Hundred any exception?...well time to find out.\\n\\n\r\nLA will say that you've read the synopsis of this anime, but this will bear repeating, LA thinks that this anime has gotten it's name not by it's signature weapon name, but for nearly outright using HUNDREDS of the typical tropes from this anime genre, let's go through this.\\n\\n\r\n*Humanity is invaded by monsters trying to kill us (Juuou Mujin Fafnir, Black Bullet)\\n\r\n*new main male protagonist who's OP than the rest of the cast (Juuou Mujin Fafnir, Black Bullet, Kuusen Madoshi, World Break, Blade Dance etc.) \\n\r\n**who is challenged by one of the best warriors of the school (Asterisk, Rakudai)\\n\r\n*main protagonist's childhood friend is a girl but he's too dense and thinks she's a he (Infinite Stratos)\\n\r\n*kissing in order either suppress the main protagonist's power or make him even more OP? (that's from Campione)\\n\r\n*little sister who's sick and the main male protagonist went to the school to pay for her medical expenses (shades of 35 Gakuen)\\n\r\n*a tug of war of the main protagonist with the main love interests (EVERY FRICKIN' HAREM ANIME EVER)\\n\r\n*mech-suits looks like it's from Infinite Stratos.\\n\r\n*Trace on (from Fate stay nigh- wait what the fu-????)\\n\\n\r\nSeriously, LA thinks this anime just threw whatever popular, cliched tropes from this anime genre and see what stuck...and by all standards it's cliched as hell, but with the MANY tropes it *ahem* stole from it's other previous anime genre animes, it does try to \"slightly\" play against the type but is blatantly obvious it's cliched as hell. \\n\\n\r\nIn terms of characters, almost the entire cast are cookie cutter and cliched very much like the plot, the only character that nearly felt fresh was Emile Crossfode voiced by Rumi Ookubo, she has shades of Char Dunois from Infinite Stratos and is probably one of the genre savvy character (though the main protagonist' little sister is the most genre savvy) and really because of that she was LA's favourite character of this cookie cutter checklisted cliched anime.\\n\\n\r\nThe animation by Production IMS is decent to nearly above average at best, from the battles to the character designs, the animation is at best decent and the battle animation are somewhat even better.\\n\\n\r\nThe fanservice of Hundred is there and is rather rampant typical with these kind of animes but it's \"ok\" as they don't fling fanservice everywhere the highest \"level\" of fanservice it goes is full nudity but covering up the \"naught bits\"...so the fanservice is hardly high.\\n\\n\r\nThe ending gives us an actually competent villain but squandered pretty quickly by changing who the true villain is, and like typical light visual novel anime cliches, the main protagonist saving his new home through friendship (no seriously) and harem hijinks ensues during the final scenes of anime. Overall the ending didn't help much though the build up to it was actually better than the ending it gave out.  \\n\\n\r\nOk, LA knows that you think that LA absolutely hates this anime all due to it being the typical \"supernatural battle harem anime with an OP protagonist\"...yes it has this cliche but at the very least it does try something new, sure with an idol subplot but still. LA really can't hate this anime even if it's cliche riddled as it still has something of a focus just with the typical battle harem cliches. What LA is really saying is, LA would rather watch a cliched riddled anime with tons of fanservice than an anime that is boring in all it's elements. Hundred maybe be cliche riddled, but it wasn't boring...just \"by the books\" at worst and clearly isn't LA\"s worst anime of Spring 2016...there's another anime that has LA's scorn on that title...",
            "date": "2016-06-20T17:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 221341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=221341"
        },
        {
            "content": "Welcome to the probably the most cancer show of the season. It is absolutely awful and is the most generic show that has ever existed. Hell, it’s so generic that they can’t even do anything original. It’s like the writer wanted to write a light novel about something good but then said, I have no ideas, hmm what are my favorite shows and what is popular? I know, let’s take the girls and setting of Infinite Stratos, get the sister from Oreimo, copy Emiya from Fate/ stay night but then change his gender and also make this the best harem ever with the most ridiculouslyoverpowered Kirito that has ever lived. It’s trash although props to this anime for once actually having the MC choose a girl. Yes, that actually happened.  \\n\\n\r\nStory: 1/10\\n\\n\r\n\tThis is quite literally the most generic harem anime in the history of history. Even more generic than Infinite Stratos and I don’t even know how that is possible. It basically follow this guy named Kisaragi Hayato as he goes to this giant ship in the water called “Little Garden” to train to defeat these things called Savages. Now the anime doesn’t tell you where these giant insect things come from nor does it tell you anything about them besides that they are attacking earth. It shows one scene with them coming from space but other than that, never explains their origins or anything like that. Everything else is so generic. Nothing is explained. It’s a stupid generic harem story and it sucks.\\n\\n\r\nArt: 2/10\\n\\n\r\n\tWell this shows looks like it was made in 2006. Literally it does. It looks bland, terrible and nothing amazing. The show could have used a lot better art direction. \\n\\n\r\nSound: 2/10\\n\\n\r\n\tWell I hate the Op and Eds for this show. There terrible in my opinion and the ost is nothing special at all. The insert songs didn’t fare any better.\\n\\n\r\nCharacters: 1/10\\n\\n\r\n\tThese are the blandest, generic, stupid, poorly written, and designed literally the same way as every other character in the harem genre. Hayato is your average MC that like every other MC, is dumb and is a chick magnet. Then we have a rip off of Charlotte from Infinite Stratos, your big boobs president (captain in this anime), the one with the big bro complex, and the one that falls in love with him for no reason. Every other character receives no development what so ever and they are all pretty bad. The villain doesn’t show up until like the last 2 episodes and she’s pretty stupid as well. Overall, these were god awful characters. \\n\\n\r\nEnjoyment: 1/10\\n\\n\r\n\tMan of man did I hate watching this anime. It was so generic and a show that people probably have seen a HUNDRED times already. It was a waste of my time to watch this and it was just a drag to watch this. Nothing could have saved this thing as it was already in the harem genre and with the generic characters that just added more to the fire that is this show. \\n\\n\r\nOverall: 1/10\\n\\n\r\n\tI’m sure you already know my opinion on this anime so I’ll stop talking about that. Here is why you want to or don’t want to watch this series for anyone who is looking to watch it. \\n\\n\r\nWatch if: \\n\r\n-\tYou like harem animes\\n\r\n-\tYou like Romance (bad romance btw)\\n\r\n-\tYou want to see the MC actually CHOOSE A GIRL\\n\r\n-\tDon’t mind god awful stories or characters\\n\r\n-\tCan stand looking at bad artwork and sound\\n\\n\r\nDon’t watch if:\\n\r\n-\tYou hate harem animes\\n\r\n-\tYou need good characters and stories\\n\r\n-\tYou need good artwork\\n\r\n-\tHated SAO (it’s worse than SAO for sure)\\n\r\n-\tLooking for a good show\\n\r\n-\tWanting to be entertained\\n",
            "date": "2016-06-20T17:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 221340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5132374.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GreyGaming",
                "username": "GreyGaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=221340"
        },
        {
            "content": "Honestly, nothing was all that unique in this one. It was a typical light novel adaptation and on top of that, one that has been done several times already. That being said, it entertained me, and that is what I think is the most important.\r\nIn all seriousness though, the characters weren't unique, the concept had been done before, and the story wasn't anything special. It's a typical harem/ecchi anime though, so what would you really expect from it? The fights became pretty decent after a while, and although it seems like the story could continue, the MC does appear to choose one of the girls,which is unusual for this kind of setting.",
            "date": "2016-06-27T21:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 222204,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheFinch",
                "username": "TheFinch"
            },
            "url": "https://myanimelist.net/reviews.php?id=222204"
        },
        {
            "content": "It'd be quite accurate and detailed review if I just wrote \"it's magic battle school harem\". But you surely know that much from synopsis. If you are reading this review that means you want to know how is Hundred any different from other shows of this type and if it's worth watching. I'll try to answer those questions.\r\nHundred's story is as basic and predictable as it gets. Normally it'd mean it's \"average\". Not in this case. You know why I watch ecchi harems? For girls and fanservice. Instead I got some space bugs attacking earth without any reason and school kids fighting them with powersthat were never seriously explained. My girls' screentime was wasted on story that was never fully developed and was predictable as hell. Nothing was explained and things happened just because story needed them to happen. Action scenes were simply \"meh\" and not exciting at all. Not to mention main villain that was just lame.\\n\r\nHonestly, I watched a lot harems, and it's one of the worst cases of story being simple waste of time. If there was no plot and they just sat on that damn ship all day in Slice of Life mode, this anime would be so much better.\\n\\n\r\nUnlike story, characters in Hundred were actually pretty nice. While they weren't that unique, I really enjoyed their interactions with Hayato and with each other. Sadly, they didn't get enough (any?) development - other than some backstory, nothing about them changed during anime. Their characters were rather simple, but I'd say they were ok for this kind of harem.\\n\r\nAs for the protagonist... he sucks. The \"generic harem MC\" might be hated character type, but at least it is some kind of character! Hayato Kisaragi on the other hand is some mannequin. He simply had no personality and was more forgettable than some mob characters.\\n\\n\r\nWhen it comes to art and sound it's on the usual level for battle harems. Looks and sounds good, but animation sometimes lacked. Generally nothing special.\\n\r\nHundred kinda lacked stronger ecchi scenes, so I can't write much about that aspect of visuals.\\n\r\nFor some reason this show got 4 endings songs. I don't understand why was that needed.\\n\\n\r\nEnjoyment? It was just painfully mediocre. I had fun when there were scenes with girls and was really bored or even annoyed when it got to serious moments. \\n\r\nIf you aren't here for harem then I'd strongly advise against watching Hundred.",
            "date": "2016-12-15T12:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 235494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=235494"
        },
        {
            "content": "Oh, yay! Another harem/school/sci-fi/fantasy/duel light novel based anime! People say this anime is called \"Hundred\" because there's a \"Hundred\" other anime like it. I disagree. There is at least 1,000 other anime and 10,000 other light/web novels like this one.\r\nStory: 3/10\r\nPrepare for an exciting adventure where the main character does ORIGINAL things and has an ORIGINAL plot line—not. Take the generic setting for this type of anime—school, some kind of colorful, sci-fi, laser weapon, and monsters threatening the world—and add a generic plot. Main character meets girl -> battle -> main character meets girl -> battle then rinse and repeat. Once the girl meeting isall done, add a generic villain to the mix, and you've got the anime known as Hundred.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art was what you'd expect from a somewhat popular anime for the season, not as good as stuff from KyoAni but much better than crap like Utsu Musume Sayuri or Pupa.\\n\\n\r\nSound: 8/10\\n\\n\r\nI liked the OP and ED, I might not be the best reviewer of songs, but both of the songs are in my top 20 anime songs. The background music fitted well, and there isn't much that's bad about the soundtrack.\\n\\n\r\nCharacters: 3/10\\n\\n\r\nWhen the author was thinking about these characters, he/she must of thought of his/her top 10 light novels/anime and of their main characters, and realized, \"Oh, my! All the character traits are the same!\" then decided to  use those traits to create this un-original, boring main character. As for the harem, just take a couple from the list of common harem members—the loli, the big-oppai, the blonde, the pink-haired, the grey/white-haired, the tsundere, etc—and put all those parts into a couple girls. \\n\\n\r\nComedy: 4/10\\n\\n\r\nNothing you haven't seen before, but I still got a laugh or too out of this, even though I'm fairly experienced in the realm of harem/ecchi. \\n\\n\r\nEnjoyment: 5/10\\n\\n\r\nI didn't mind re-watching Gakusen Toshi Asterisk.",
            "date": "2016-10-07T18:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 231287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4956373.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LysUltima",
                "username": "LysUltima"
            },
            "url": "https://myanimelist.net/reviews.php?id=231287"
        },
        {
            "content": "I'm starting to see the appeal to the \"**** is like ****** but\" stamp, so I'll take a crack at it:\r\nHundred is like Infinite Stratos but better.\r\nLet's begin:\r\nStory:\r\n     No seriously, it's so similar! A guy that has high compatibility with his world's battle suits called \"Hundreds\", goes to an academy surrounded by water. There everyone's interested him, a snobby girl fight scene, a cross dresser, etc.\r\nDetails, details, details.\r\nBut Hundred seems to have a stronger story than Infinite Stratos, and also has elements from Strike Witches, Freeze, and Seraph of the End (believe it or not)\r\n     In aworld where destructive creatures called Savages wreck havoc all over the planet (from time to time), a special unit of people called Slayers are trained and sent out to fight these monsters.\\n\\n\r\nThere's a catch! Coming in contact with these monsters gives you the risk of being infected by a virus the creatures hold. Which can either kill you or turn you into a Variant. Which is like a Slayer but generates more energy into their weapons and combat abilities, and are likely to go into a murder frenzy! So their like a rival faction/race of sorts, and that's pretty cool.\\n\\n\r\nNow this happened to our main character (Kisaragi, Hayato) and his childhood friend(Crossfode, Emile), which explains the main character's edge or high compatibility to his Hundred.\\n\\n\r\nI like how the anime gave context to his abilities. He wasn't related to some legendary slayer, and he didn't need it in order to get into an academy. The only reason he's at the academy in the first place, is for the medical treatment he can get for his little sister.\\n\\n\r\nSo and we're off on our college-military life with the anime taps turned up a good amount.\\n\\n\\n\\n\r\n     Now where I feel the anime suffers, is how shifty the tone can get.\\n\\n\r\nAre we watching a main character suffering from the past where he and his childhood friend are almost killed by a monster that infects them with a virus they could have died from or lost their sanity to?\\n\\n\r\nNah, he's learned to deal with it pretty quickly, as opposed to crowds interested in him and women's flirtatious advances!\\n\\n\r\nAre we watching the main character try and come to terms with a virus that's slowly eating at his lust for the power to not lose a fight, or are we watching another wacky harem scenario?\\n\\n\r\nNah, he gets control of it rather quickly.\\n\\n\r\nAre we in a world where kids are purposefully subjected to the virus of Savages in order to manufacture super soldiers, then promptly dying or going insane if they don't have a role in the plot?\\n\\n\r\nYep, moving on~\\n\\n\r\nMaybe everyone's wearing a mask just to stay strong and turn life into a cliched anime, because the atmosphere has trouble staying consistent sometimes. It never broke my immersion, so that's good. But it's best to keep an eye on tone from now on.\\n\\n\\n\\n\r\nThe story does have a sliver of uniqueness as the anime goes on, but if thought Infinite Stratos was forgettable: this anime only slightly alleviates that. It does set up for another season nicely around the ending, so be on the look out for those hints or the anime will feel like their's too many loose ends.\\n\\n\r\nSuch examples being some lone talented scientist out for revenge, harsh environments for kids, people with high authority keeping secrets, cross dressing for a reason, you know the drill.\\n\\n\\n\\n\\n\\n\\n\\n\r\nArt:\\n\\n\r\n     \"Oh boy, an anime not CGing it's balls off~!\"\\n\\n\r\n*watches the last few episodes*\\n\\n\r\n     \"Spoke to freaking soon~!\"\\n\\n\\n\\n\r\nAm I the only one who finds 3d objects in a 2d environment jarring? And vice versa?\\n\\n\r\nNo?\\n\\n\r\nThen the CG popping in, and watching 2d characters fight said CG is jarring!\\n\\n\\n\r\nNot as bad as Infinite Stratos though. I guess the Chief Animation Directors must have been fighting with their own inner Variants. Having a strong enough will power to keep CG's greasy mitts off the characters using their mechanical Hundred parts in fights and CG's muddy feet off the environment, but not enough will power to resist using it on throw-away-enemies or helicopters around the end of the series!\\n\\n\r\nIt was jarring when the Prince of Egypt did it, it was jarring when Spiderman's animated series did it, and it's not about to change because it's an anime!\\n\\n\r\nThat said, when the anime behaves itself: the animations are pretty damned detailed. Not the art, the animations. The subtle movements of people interacting as opposed to standing stark still needs to be commended. I love anyone who thinks of the little things when making an anime.\\n\\n\r\nThe art style on the other hand, still does that fanservice bit where no matter what your wearing: if you have big tits or thick thighs, they're gonna reflect light off them like the military-school uniforms were oiled up.\\n\\n\r\nNow I'm no harrumphing prude; I hunted down a pervy comic the moment I finished the series. But it sure would be nice to see an anime save such glossy appearances for when your actually showing off fan service, and not make the pervy points of interest look saran wrapped. Save that for the body suits, like you have been.\\n\\n\r\nStill, the art style itself (or the character design) looks really good. Norie Tanaka did a swell job, to say he's mostly been an animator. You may recognize his handy work from that one episode in Fairy Tail and those few episodes from Magi: The Labyrinth of Magic.\\n\\n\\n\\n\\n\\n\\n\r\nSound:\\n\\n\r\n     The ambient music seems to be the only music I like. The opening theme's tone reminded me of Date A Live's opening theme, and not in a good way. It came off a bit misplaced, since the tone of the series itself is so shifty. What the opening seemed to be going for here, was how the characters were all struggling with something and the atmosphere always weighed down on everyone, but they had fight on and stay together to make a better tomorrow.\\n\\n\r\nAnd if the anime stuck with that, and not made a check box of pervy and romantic cliches, I'd be alright.\\n\\n\r\nSo the opening left me trying to skip past it sometimes.\\n\\n\r\nThe ending shifted between three different songs as the series progressed. This is what I enjoyed over the opening, as it did fit the tone a bit better. The clicks or groups within the series sang songs that fit their characters for the ending themes, and that vibes well with me. It feels as if the characters are growing are experiencing different things as time goes on, and that should be commended.\\n\\n\\n\\n\r\nAs for the voice actors, I loved them~\\n\\n\r\nEveryone fit their characters, except the rival Variant faction who had a kid who was voiced by someone quite older than the character's design suggested. He was skinnier and smaller than the main character, but spoke as if they were around the same age.\\n\\n\r\nIf it were intentional like in Black Butler: Book of Circus (you know the two characters I'm talking about), than I'd have no problem. But since I got no such vibe, it was surprising.\\n\\n\r\nOther than that, it was nice to recognize other character's voices. Like how the main character's voice sounds like Muneakira from Hyakka Ryōran Samurai Girls, but was the actor who played as the knight from Rage of Bahamut: Genesis. It helped keep me invested as these characters were kept alive in a way by the talented voice actors.\\n\\n\\n\\n\\n\\n\\n\r\nCharacter:\\n\\n\r\n     Girl One: \"We act so close because we've been together since we were kids. We're childhood friends.\"\\n\\n\r\n     Girl Two: *gasp* \"That means I'm childhood friends with him too~!\"\\n\\n\r\n     Girl One: Ha! No, you only spent a day with him as a child. It's not the same.\"\\n\\n\r\n     Me: \"Pfft, dayum!!!\"\\n\\n\\n\\n\r\nThat's how I experienced that moment between the two love interests competing. I get a kick out of the boldness everyone demonstrates towards the main character.\\n\\n\r\nThere's no CARDINAL SIN Tsundere whooping @$$ over the mistakes the main character makes. Nope, everyone must have realized this is an anime and so perversion is treated as a joke that everyone is in on.\\n\\n\r\nIt's like the cast is one big party, and everyone is invited. Giving me quite a good time. If I had to compare it anime cast wise: it's like Tokyo Ravens and Hyakka Ryōran Samurai Girls were dripped into the creation, and made everyone bold without being out of character.\\n\\n\r\n     While voice actors did their parts, the characters that were sided in late in the game came off pretty stale or generic. They had no soul; they were just their. I'll let you see what I'm talking about as you get further into the anime.\\n\\n\r\nBut yeah, thumbs up for the cast this time around!\\n\\n\\n\\n\\n\\n\r\nEnjoyment:\\n\\n\r\n     Here's what you're gonna enjoy. You're gonna like the bold characters, CG not detaching you from the action scenes, good characters, attentive animations here and there, and unique art style.\\n\\n\r\nWhat you're not gonna like is the CG coming out last minute as if it's a cop out, no new character types, heavily cliched, shifty tone, loose ended story elements, and fan service laid on thick.\\n\\n\r\nIn short, nothing new here. It rises above one of it's popular predecessors (Infinite Stratos), but not far enough to make it's own identity.\\n\\n\r\nIt seemed to have lost a bit of steam when crossing the 12 episode finish line due trying to hit a target audience and not trying anything new, but it shouldn't be a waste of time should you pick it up.\\n\\n\\n\\n\\n\\n\r\nOverall:\\n\\n\r\n     The final verdict for Hundred, is a 7 out of 10.\\n\\n\r\n     Overall, it's just another typical anime. It focused enough on it's elements  to not be average, but I felt it lost a lot of potential somewhere along the line. Maybe the visual novel has what the anime lacks, but at this point in time, after watching all 12 episodes, I'm just not thrilled. I'm not at the edge of my seats. I'm happy with the time I gave it and might rewatch the series in bursts, But not buy the disc sets.\\n\\n\r\nI hope you enjoyed my review, I know I don't put a lot of these out, but thanks for reading, and I'll see you all next time~",
            "date": "2016-08-31T08:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 227995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3833133.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RookieLove",
                "username": "RookieLove"
            },
            "url": "https://myanimelist.net/reviews.php?id=227995"
        },
        {
            "content": "Story: so the story pretty much start out with Hayato coming to the little graden also wont really spoil out the story that much also they can use this thing called a hundred which they can use too aid them for different abilities\r\nArt: art was very good nothing bad about it\r\nSound: again like art nothing bad about the sound with the characters or the music\r\nCharacter: now i personally loved the characters personally my fav were of course Hayato and Emile with everything that went on with them and what not also the other characters i did enjoy\r\nEnjoyment: now i hella enjoyed this anime for manyreasons the comedy and everything that would happen to hayato would just make me laugh like crazy and also everything that would happen with him and Emile\\n\\n\r\nOverall: i give this a 9 because of everything with this anime from the comedy to the action being pretty good but just because of the comedy being over the top funny too me",
            "date": "2016-08-27T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 227774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=227774"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\n“…98…99…100! Ready or not, here I come!”\r\nMy brother yelled out the warning, but he would never find me. I was small enough to fit in our laundry basket at home. It didn’t seem like a possible hiding spot, but I knew I could make it work.\r\nAnd I did. I remember holding my breath as my brother continuously walked by. It was humid and stifling in that cramped space, yet I had to prove that the second half of the game was irrelevant when I was playing.\r\nHundred might be related to that counting chant, but itdefinitely couldn’t hide the issues it contained.\\n\\n\r\nSTORY\\n\\n\r\nHundred begins just as Kisaragi Hayato boards the so called Little Garden, a city-on-a-ship which houses Slayers, the protectors of the world that defeat the evil Savages. His arrival makes waves when he demonstrates his uncanny Variant capability, causing the show to start from there.\\n\\n\r\nAnd it ends there, too.\\n\\n\r\nAll right, not really. But what comes after Kisaragi Hayato’s (one must always pronounce his full name) entrance is a narrative weaker than a puddle on the sidewalk.\\n\\n\r\nMuch of the anime tries its best to create harrowing situations centered on the Savages, these bug-like monsters whose only weakness happens to be the crystal jammed into the head of their carapaces. Already the anime starts to tumble since very little variety in the enemies exists, the fights themselves involve either giant lasers or the same set of moves, and the outcomes are rarely satisfying since they usually involve exploding a giant monster time and again.\\n\\n\r\nHundred continues to see problems on a general writing level. For instance, at one point, Claire’s brother Judal claims that Kisaragi Hayato is the key to waking Liza, Claire and Judal’s sister, up from her deep slumber. The anime even takes this chance to tease Claire’s obvious feelings towards Kisaragi Hayato by telling the man to kiss the sleeping sister.\\n\\n\r\nBut Kisaragi Hayato never becomes that key. Instead, Sakura’s singing rouses the dreaming girl, making one wonder why the show tried to push the original route in the first place.\\n\\n\r\nNow, to be fair, the reason Hundred introduces this “conflict” is to have some semblance of an end goal. Because for the entire anime, a final endpoint doesn’t exist. To put it differently, the anime has no overarching plot to speak of. Rather, multiple mini issues of the same type – a bunch of Savages have showed up – pop up. Meaning, not only is the narrative itself repetitive, but also the narrative isn’t working towards anything substantial.\\n\\n\r\nWorse still, as the anime nears its conclusion, it creates more and more problems for itself.\\n\\n\r\nA “new” brand of Savage appears called Replicants. They somehow live without those crystals in their skulls – presumably because they are robotic or just half-organic. Yet that doesn’t seem to make a difference since the characters just beat them up to a pulp to defeat them. Which is weird. The enemies were tough to defeat before because, according to the show’s rules, Savages had those crystals. So removing them somehow makes them simultaneously harder and easier to squash.\\n\\n\r\nAs the area starts to become dangerous, the people in the stadium are not evacuated with haste. In fact, they all just sit there as a huge Replicant knocks on their protective bubble.\\n\\n\r\nBut that has nothing on the gunfire battle held between Mei Mei and Vitaly. In the straight, narrow hallway leading up to Liza’s resting chamber, the cat-maid robot and the evil scientist shoot their guns at one another. Nearly thirty bullets are traded in total, but only Vitaly’s sonar device and her hair get hit whereas Mei Mei only gets shot in the leg. It’s a scene that practically defies logic.\\n\\n\r\nGoing back to that giant Replicant, it doesn’t even count as the final fight. Instead, the anime chooses to have the weapon-scanning girl become a mega-mutant monster that will (of course) blow up the whole place nuclear style if the cast don’t stop her. Naturally, Kisaragi Hayato is the man for the job – but only after two separate instances of psychological pick-me-up magic.\\n\\n\r\nTo give the anime has much leeway as possible, the concept of sound being both a hindrance and a help to the Slayers has a foundation both in Sakura’s character, the shown reaction Savages have to her voice, and the idea that music is something universal, an entity that knows no cultural or societal bounds.\\n\\n\r\nYet this theme is lost amid Vitaly’s quite convenient sonar device, the fact that the anime prioritizes its action, sex, and comedy over its heartfelt moments, and how songs and singing in general aren’t explored to any extent, existing simply as extra side content now and again.\\n\\n\r\nSpeaking of sex, Hundred manages to even fall flat here. And “fall” could not be a more appropriate way to phrase its ecchi material. For on not one. Not two. But on eight separate occasions, the anime employs the infamous fall-on-another-character-to-get-them-into-a-scandalous-ecchi-situation move. A list of them follows in the next paragraph.\\n\\n\r\nKisaragi Hayato falls on top of Claire during their initial duel. Kisaragi Hayato momentarily feels fatigue and thus falls on top of Emilia in their room (much to Claire’s chagrin). Then immediately after, Kisaragi Hayato falls onto Claire, both grabbing her chest and kissing her lips in the process. Emilia hugs Kisaragi Hayato as they bathe together, falling onto him as they plunge beneath the water. Liddy falls crotch-to-face on top of Kisaragi Hayato. Kisaragi Hayato tries to go for a volleyball at the beach, but he falls into Claire’s bikini-clad breasts instead. Claire, while naked, falls on top of Kisaragi Hayato shortly after finishing her lakeside bath. And Kisaragi Hayato, after being peer pressured, falls on top of Emilia while she wears a maid outfit.\\n\\n\r\nDespite all of the anime’s problems in its action and content and sexual appeal, its biggest misstep is literally just that: missing steps.\\n\\n\r\nSome explanation first. Karen is Kisaragi Hayato’s younger sister. She’s hospitalized due to an illness, forcing her to use a futuristic wheelchair to get around. Rather nicely, she receives her very own Hundred, giving her the strength enough to stand on her own two legs.\\n\\n\r\nThe catch? She doesn’t actually move. She stands up and looks around, sure. She even sings her own song. But does she get to walk around? No. All she gets is a few still-shots of her newfound self.\\n\\n\r\nThat’s right. Hundred doesn’t even have the common courtesy to let the poor, sick girl move her legs after finally getting them.\\n\\n\r\nThat’s just rude, man.\\n\\n\r\nANIMATION\\n\\n\r\nHundred sees further trouble in its art and animation.\\n\\n\r\nArtistically, the anime lacks creativity, especially for its many fight scenes. The characters do wield different weapons: Kisaragi Hayato’s sword, Liddy’s lance and shield, and so on. At the minimum, this variety helps to slightly break up the monotony the action regularly encounters.\\n\\n\r\nBut since the anime tends to use dull, “moving” background shots to give the illusion of movement, and since the anime does not seem to understand the word “choreography,” the fights are more or less visual duds.\\n\\n\r\nThe rest of the locations visited and detail in general are not all that appealing. Over-the-top attacks, lasers, and explosions at least keep the anime from feeling too static.\\n\\n\r\nTheir designs are a mixed offering.\\n\\n\r\nSakura’s long twin-tails, casual attire, and pink coloring give her a cute look. Emilia also pulls ahead: Her tomboyish clothes and silver hair help to give her a gender-neutral look when she so chooses.\\n\\n\r\nOn the opposite end sit Claire and Kisragi Hayato. Claire looks like a bug with wings after donning her Hundred. Plus, her ginormous cannon seems quite inconvenient given the fast-paced nature of the battles they take part in. Her massive, blonde twin drills on her head and her huge bust do coincide with her large, commanding presence, but, ultimately, they give her a silly look.\\n\\n\r\nAs for Kisaragi Hayato, he is as plain and as unassuming as can be. His all-black motif does make him cooler, but being cool does not fit his personality.\\n\\n\r\nCHARACTERS\\n\\n\r\nIt’s very difficult to beat an all-time low of “don’t let the younger sister walk with her new legs.” And, to be fair,Hundred does not reach those levels with its characters – but it came pretty darn close.\\n\\n\r\nSakura is the best the show has to offer. She’s a world-class vocalist, using her singing to bring joy and wonder to the masses. However, her past is anything but. From an early age, she was experimented on (along with many other kids) by Vitaly in order to discover more about the Savage virus.\\n\\n\r\nHer time with the other kids allowed her to realize that her voice had power beyond just technical proficiency, for it calmed them down, made them smile. Unfortunately, the others perished throughout the experimentation process. Sakura, however, lived, keeping the memories of those lost with her.\\n\\n\r\nWhen she meets Kisaragi Hayato, she becomes infatuated with him to say the least. And when she hums her special song, and he recounts the time he heard it oh so long ago, it is revealed that it was his uplifting words that first inspired Sakura to pursue singing. Naturally, she falls in love with him all over again.\\n\\n\r\nThat’s the extent of her character. She has a small moment later on where a Savage reacts to her voice, so she believes that her singing only connects to others because of the virus that courses through her and her listeners. As she calls it, it’s not singing but “deception.” Kisaragi Hayato immediately placates her fears, ending this minor conflict before it even officially began.\\n\\n\r\nClaire comes next. She’s initially perceived as an arrogant yet resolute leader. Expelling students without a second thought, challenging Kisaragi Hayato to a duel, and even declaring that she would refrain from going all-out (a statement she goes back on).\\n\\n\r\nHowever, she does have a more innocent side. She’s surprisingly naïve when it comes to romance – kissing, touching, and the like. She can be playful when she wants Kisaragi Hayato to put on a speedo. And she can be kind in helping and believing others.\\n\\n\r\nShe even has a more realistic side, giving her arguably the best character moment in the whole show. During her moonlit, lakeside bath, she tells Kisaragi Hayato that she is only the leader of the Little Garden because she wishes to keep tabs on her brother Judar in order to protect her sister Liza. Which was all started by her mother Linis. In other words, she “selfishly” fights not for others, but for her sister and for herself\\n\\n\r\nGranted, the anime does a very poor job at expounding on her relationships with her family (her mother never even appears in the show), and her characterization is even worse off than Sakura’s. But this small scene, at the very least, makes her feel like an actual person rather than just a beautiful woman to be admired.\\n\\n\r\nEmilia is even worse off. While she poses as “Emile” for roughly the first three episodes, it is not difficult to guess that she is, well, actually a she. Her backstory involves a Savage attack which consequently led to her and Kisaragi Hayato’s Variant mutation. Also, since he saved her, Emilia has loved Kisaragi Hayato ever since.\\n\\n\r\nShe’s very supportive of Kisaragi Hayato as a result, but she does not have much else. Her ability to transmute her Hundred into different forms is cool, and it even holds some symbolism when realizing that she, too, “transmutes” from being a girl to a boy and back again on a regular basis.\\n\\n\r\nMost of her on-screen time is spent being jealous of the other harem members getting close to Kisaragi Hayato, making her into more or less the comedic relief character.\\n\\n\r\nThe anime does drop a major character trait more than halfway through the season – that her true name is not Emilia Hermit (her first fake name being Emile Crossfode) but the royal princess Emilia Gudenburg. She kept it a secret from Kisaragi Hayato for ten years. Neither a friendly nor supportive move to be honest.\\n\\n\r\nRegardless, Emilia does manage to (more or less) win the harem-romance war – which, in this anime filled to the brim with way too many clichés, is nice to see given Emilia’s official childhood-friend status.\\n\\n\r\nThere’s also the three “evil” kids, but Hundred’s meager backstory for the trio is a shoddy, failed attempt at making these weak characters stronger.\\n\\n\r\nAs for Kisaragi Hayato, he is as plain as plain can be. Bland is another way to describe him. Boring is yet another.\\n\\n\r\nKisaragi Hayato miraculously has the highest Hundred capability rating, yet he has never actually used a Hundred device before. He joined the Little Garden on the condition that his little sister receive the best medical treatment on the planet. If nothing else, he’s quite the awesome big brother.\\n\\n\r\nAfter this detail, however, Kisaragi Hayato loses all credibility. He basically moves through the anime falling onto girls and saying nice words that make them fall for him in return. Even his major personal struggle – controlling his full-armament – is lame. At first, it’s controlled by Emilia needing to kiss him to counteract the effects. And then, just because he trained a bunch, his conflict goes away forever.\\n\\n\r\nHis main reason for fighting (besides for his little sister) is to put smiles on the faces of others. Commendable but it simply comes off as yet another plain characteristic for this already too bland, too boring person.\\n\\n\r\nIn other words, by episode three in this twelve-episode season, Kisaragi Hayato plateaus then plummets as a character.\\n\\n\r\nYet he’s not the worst in the cast. That honor goes to Vitaly, the “main antagonist.” She’s an intelligent woman capable of creating artificial Savages and other technology used to harm others. She also had a hand in Sakura’s suffering as well as Claire’s little sister Liza’s conception.\\n\\n\r\nBut Vitaly is not around for ten episodes, making only a brief appearance at the end of the ninth and officially making her entrance at the end of the tenth. Perhaps obviously, she has no backstory, no known motivation, and definitely no apparent characterization. She’s literally just a villain for the sake of being a villain.\\n\\n\r\nShe tries to explain the reasoning behind her attack as being revenge against Judar, a man that she may or may not have had a sincerer relationship with. It’s difficult to tell because, again, nothing was ever given about her. And it will be impossible to tell in the future because she dies, leaving that world with a goofy smile on her face.\\n\\n\r\nEvery single cast member has problems. Some more than others. But to be fair, almost all of them also have a theme connecting them: the notion of making people smile.\\n\\n\r\nFrom Sakura to Claire, from Emilia to Kisaragi Hayato, everyone just wants everyone else to be happy. While this theme is rather superficial and therefore not able to be explored to any reasonable depth, it is at least nice to see some semblance of parallelism between the cast.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track of Hundred shoots for a triumphant tone to match the overall sense of optimism and hope that fills the story and the characters. The piece itself is nothing special – some pacing changes and harmonizing exist – except for the longer English lyrics at both the beginning and end. It’s a passable piece; one of the only passable aspects of the entire anime.\\n\\n\r\nPerhaps due to the singing motif, multiple ending tracks are provided throughout the season. They feature different members, such as Emilia and Sakura for the first ED and Fritz and Reitia for the third ED. Again, none of them are particularly special, but, at the minimum, they do try to switch tones and overall compositions. Plus, it is a nice bout of variety – something that Hundred severely lacks.\\n\\n\r\nThe remainder of the original soundtrack is similar once again due to its low impact and memorability. However, the voice acting performances demonstrate that the anime is not without positives, for what’s given is definitely welcomed. Mao Ichimichi as Claire uses a mature, sultry voice for the upstanding student council president. Romi Ookubo as Emilia brings both happiness and playfulness. And Chinatsu Akasaki as Claudia is wonderfully overzealous in her commitment to Emilia.\\n\\n\r\nENJOYMENT\\n\\n\r\nDespite how much I have been harping on this one, I found it quite fun.\\n\\n\r\nThe vast majority of that fun is attributed to the myriad of romantic moments spread throughout the season. Claire watching Kisaragi Hayato and Emilia on security cameras and getting noticeably mad that she is not the one out on the date. Emilia acting defensive and jealous towards Sakura when the former notices the latter being too close to the harem lead. And Sakura claiming to be Kisaragi Hayato’s “private idol.” Many of these small, cute, and romantic moments exist, making me quite the happy person.\\n\\n\r\nAlso, it was nice to see some (miniscule and unreciprocated) yuri feelings from Erica and Liddy towards Claire. And Claudia was entertaining, too. Her constant lauding of Emilia and looking down on Kisaragi Hayato made her one of the more likable characters of the anime. It’s just a shame that she was introduced so late into the season.\\n\\n\r\nI can’t say I was a fan of much else, though. The battles and the enemies and the “drama” simply got in the way of those romantic or funny scenes. Still, with an unintentionally sarcastic “Thanks a lot” sign, this one saves itself from being a total disaster.\\n\\n\r\nHundred contains hundreds of problems. The story is awkward, the characters are poorly handled, and both the art and the music have their own respective troubles to contend with. In other words, this one definitely wasn’t ready.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, poor narrative choices, repetitive to the max ecchi content, and accidentally rude\\n\\n\r\nAnimation: Bad, boring artistic direction, below average actual animation, and okay character designs\\n\\n\r\nCharacters: Bad, Sakura is okay, Claire is bad, and the rest are horribly constructed, with only a couple of strengths spread out among them all\\n\\n\r\nSound: Fine, okay OP, okay ED’s, bad OST, above average VA performances\\n\\n\r\nEnjoyment: Fine, romance and silliness make for an entertaining time despite the lacking execution\\n\\n\r\nFinal Score: 3/10",
            "date": "2017-06-14T18:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 249926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249926"
        },
        {
            "content": "I lulled me by the cover, thinking it would be a series mecha with good red humor, but it is a copy of \"Infinite Stratos\". Its beginning is \"good\" but as they pass chapters, the plot becomes boring and predictable. the series has 4 3 chapters saga saga.\r\nspoilers\r\n: From Chapter 7 gets boring and slow, and you have an idea of what will happen with the characters, and from chapter 10, the outcome of anime becomes absurd and ridiculous, the typical message of love and friendship .\r\nThe spoilers ended: I give a rating of 6, because comedy is good to laugh a while and entrenertewith the relationship of the characters, and has some good moments of action, if not a very original idea because it can get any better series this. but there are 12 chapters and more to laugh and the little ecchi which to enjoy the action.",
            "date": "2016-07-29T16:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 225361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/igual1",
                "username": "igual1"
            },
            "url": "https://myanimelist.net/reviews.php?id=225361"
        }
    ],
    [
        {
            "content": "Well, that was interesting.\r\nSee, this anime shares similarities with many other animes of this type - where a bunch of characters (a guy with several girls in tow) fight some sort of alien force. Basically harem + drama + comedy + romance. Infinite Stratos, Hagure Yuusha no Esthetica, heck even Masou Gakuen HxH, and what was that one Ommyoji-centered anime? Probably Tokyo Ravens. Anyway! What sets this one apart is that it doesn't focus too much on \"fighting the monsters\" aspect, it isn't incredibly ecchi, and it is surprisingly sweet or even romantic at times. The whole \"fight monsters\" thing looks like some sort ofunimportant backdrop, and relationships between characters take the front stage. And those relationships, albeit they're not infcredibly convoluted, and even though characters are not incredibly unique - those relationships are interesting too watch. The downside of this is... when this anime tries to be serious, everything falls apart. Still... I liked it.\\n\\n\r\nDetailed breakdown:\\n\\n\r\nStory: 5/10:\\n\r\nRomantic aspect is interesting, but the whole \"we must fight creatures\" thing is largely ignored. They do fight monsters on occasion, but those scenes don't seem to hold much weight. So it looks like a small harem anime with actual focus on relationship and not an the new amazing way to get into risque position. To be honest, the anime does this \"accidentally fall on someone else\" thing a lot, but it is different to what you'd get in To Love Ru (which takes Rito's ability to accidentally slip to ridiculous level), and does not look too ecchi. As I mentioned before, when this anime tries to be serious, it falls apart, and looks very unconvincing. Still, the whole interpersonal thing is interesting to watch.\\n\\n\r\nArt 6/10:\\n\r\nDecent low detail modern art, very well executed. It is actually quite hard to spot CG in this anime (it is there), and though character faces have relatively small amount of detail (it is not lucky star, but it is comparable to Mahouka in visual quality), visually it looks fairly good. I liked it.\\n\\n\r\nSound 6/10:\\n\r\nSome interesting soundtracks there, and there was a variety in ending music:\\n\\n\r\nCharacter: 4/10:\\n\r\nMain character looks generic to the point where it resembles a clone of protagonist from some other series. Thankfully he is not a bespectacled spineless otaku, and has some backbone, though he is annoyingly clueless in the beginning. One of heroines is a classic tsundere, though not an insane one, and personality of another heroine is not , say... very well defined. So, lots of stereotypical cliched characters. I found some of the side characters (Reitia Saint-Emilion and groupies of Claire) almost as interesting as protagonist, even though they barely get a chance to say or act on screen. Still they're highly cliched, though not to the point of being annoying.\\n\\n\r\nEnjoyment: 6/10:\\n\r\nI actually liked it. It was not exactly what i expected, but romantic scenes left positive impression, and this anime did not concentrate on Dramatic moments long enough to ruin this impression. \\n\\n\r\nOverall: 6/10:\\n\r\nI'd say it is worth a watch, mostly for romantic part and comedy elements. Some characters have somewhat cute designs. The \"serious\" part of the story is poorly explained, haphazard and doesn't make much sense, but if you wanted a some sort of harem-y somewhat romantic somewhat lighthearted anime that doesn't dwell in despair for several episodes for no reason, that's the one to watch.",
            "date": "2017-04-27T21:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 246453,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=246453"
        },
        {
            "content": "A show about a group of high school kids called \"slayers\" with special powers who must battle mysterious alien creatures called \"savages\" that keep popping up all over the earth.  Eventually, the Savages try to destroy the giant ship that holds the school the \"Slayer\" students live on.\r\nI could have copied this description from a hundred other shows that have come before.  There is very little here that is new and unique.  I would compare the plot with \"RWBY\" or \"Mai Otome\" or ... really quite a long list could be made.\r\nI did enjoy what character development there was in the series,especially with Emile Crossfode and to a lesser extent, the Class President Claire Harvey.  \\n\r\nCriticisms: This show had the potential to be so much better, a lot of interesting characters were involved in the show but we learn precious little about most of them.  The worst lapse in character development involved the evil villain mastermind Vitaly Tinyanof.  She wants to destroy the ship and all its inhabitants, oh -- and the world too, presumably over a breakup?  Really??",
            "date": "2016-07-16T15:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 224185,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075337.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bearvarine",
                "username": "bearvarine"
            },
            "url": "https://myanimelist.net/reviews.php?id=224185"
        },
        {
            "content": "Apparently as a person who like harem and romance it drew me to this anime but I also need to make sense of what is happening which in this anime the story went from good going downhill but its not totally unbearably bad.\r\n(be aware that even if the type of plot(any plot) is overused if used properly makes an anime great which in this case they made it in the safe line)\r\nI can't guarantee if you love harem that yo might like this one because IMHO the harem in Infinite stratos(with a not so good but still ok MC) is better but the MC hereis a bit better than IS.\\n\\n\r\nwell I could compare it to more harem like saijaku no bahamut, rakudai, Gakusen asterisk, TLR, Serei tsukai, seitokai ichizon, machine doll etc. but IS is the most similar one to this one(or Saijaku)\\n\\n\r\nWell here is my review:\\n\\n\r\nStory-4 it was not original but at least it was still decent ; well it was good at the start but got boring not the cliche type boring but just plain boring which made me just focus on the harem part.\\n\\n\r\nCharacters- 7 gotta admit there are some pretty good characters with kinda uniqueness if i may say that i think it might be an 8 but there some who are just not good.\\n\\n\r\nArt- 7 the art is good but there are times the fight scenes look sloppy but It's still pretty good overall one of the strongpoints of this show\\n\\n\r\nsound- 6 the op is not that good but not that bad either and ed just feels like it fits the show\\n\\n\r\nenjoyment: 4 the story did not enhance the harem in this show which is what I want where the harem fits the story but it's kinda okay on how the girls gather to the MC but it's not that good and not that bad. its just decent\\n\\n\r\nRecommend: if you like Infinte stratos, saijaku no bahamut,serei tsukai, machine doll; you might like this :)",
            "date": "2016-06-29T07:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 222342,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4203571.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Malgedion",
                "username": "Malgedion"
            },
            "url": "https://myanimelist.net/reviews.php?id=222342"
        },
        {
            "content": "If you're reading this you are most likely familiar with shows in the sci-fi / romance / harem genre like IS: Infinite Stratos, Radukai Kishi no Cavalry, or Date A Live. This show is literally just a cut and paste of those shows (and it doesn't cut the good bits out either). The plot is incredibly predictable and the I wasn't surprised at all, or really had much of a reason to keep watching because it was so bland. To be honest, if you're looking for a show that is better than this, but fairly similar in content, I'd recommend IS: Infinite Stratos because it'sbasically the same as this show apart from it's done better in almost all aspects.\\n\\n\r\nThe story was pretty mediocre in my opinion, it really didn't stick out from all of the other anime in this genre and the plot is really generic. Hero with cool powers, some girls who are relatively uninteresting and not important, and a group of bad guys which have a grudge.\\n\\n\r\nThe thing is, this show looked promising in the early episodes, it had a relatively interesting concept  and if it was executed correctly, it would have been a fairly decent show. However the lack of plot development and some useless romance episodes just made the main story feel tacked on. Hell, you don't even get to see the main villain properly up until episode 11, before then they are pretty much not mentioned apart from the odd name. \\n\\n\r\nThe art was fairly decent, there was not much to complain about but it didn't stand out much from other shows. The fight scenes were pretty good and drawn nicely but there wasn't many of them and instead just some mindless harem crap for most of the time.\\n\\n\r\nThe sound was also pretty good, most of the time I didn't really notice the background music or the music during fights but the OP and EP were fairly decent.\\n\\n\r\nThe characters also were pretty lacklustre. The protagonist just seems like the generic hero you've seen in about every other harem / sci-fi show and he is quite bland. The female characters are also generic, you've got the main girl, the rich powerful girl and the idol, generic characters with pretty minimal development during the show. Even the 'main' girl is left in the shadow a bit and you don't really learn much about her. The plot leaves you guessing on characters for the most part and it really should have done a better job at character development.\\n\\n\r\nThe show was a little bit boring most of the time and there wasn't really much plot development so I didn't really enjoy this show much. Most shows in this genre rely on fanservice to make up for their lacklustre plot and characters but this show didn't have much of it either. \\n\\n\r\nOverall, i'd give it a 6/10 purely because it's not a terrible show, but it sure as hell can be a boring one. Shows like the first season of IS: Infinite Stratos just seem to be really similar to this show plot-wise but also much better executed and a lot more interesting.",
            "date": "2016-06-28T15:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 222284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2319031.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SammD",
                "username": "SammD"
            },
            "url": "https://myanimelist.net/reviews.php?id=222284"
        },
        {
            "content": "The most common criticism I see of this show is \"seen it before\" in terms of the story; This is very true (to the point where it seemed like the writers were following a template even), but I tend to look past that with most shows because of course that's going to happen. Most peoples' favorite show is probably a ripoff from some other show; what's important is that different portrayals of the same story reach everyone differently.\r\nThat being said, this was not necessarily one that reached me. I won't say I regret watching it, it was a nice show to pass the time with.It felt like they combined Buso Renkin and Kill la Kill, but rather than a complete combination of the two, it would be apt to say that it was as if Dr. Frankenstein had put the show together using the two as material.\\n\\n\r\nI love when a show can have variety with powers (or weapons in this case), so Hundred has that going for it, except they didn't explore it as well as they could have (if the weapon can have over 100 different forms, then at least throw in background characters to show us some more of them). This is half of why I gave it a low score on characters, because they introduce the concept of Full-Body Armament -weapons taking their ultimate form- from episode 2, but only two characters ever achieve it (and we see those two right in that same episode); it left the other characters really lacking. The other half of the poor character score is because they all remain the same throughout the entire series: no real development from when they were introduced; no amazing insight into who they are; no heart changing moments about characters that could be considered \"problematic\" (except slightly for the hunters).\\n\\n\r\nWhen I watch an action anime, I like there to be at least one goosebump inducing speech, or perhaps a nice feel-good moment (even Kill la Kill gave me that), but I can honestly say that Hundred couldn't do it for me",
            "date": "2016-06-25T20:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 221948,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5499371.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Prof_Telperion",
                "username": "Prof_Telperion"
            },
            "url": "https://myanimelist.net/reviews.php?id=221948"
        },
        {
            "content": "Note: The bottom of the review contains spoilers. There's a spoiler tag and everything but best to warn early. \r\nSometimes when watching a really amazing anime, I feel the need to watch something truly dreadful to remind myself what the alternative is. For this purpose, Hundred is ok. For any other purpose, Hundred is awful. \r\nStory: 1/10\r\nSome animes can get away with not having a plot. Lucky Star, for example, doesn't need to have a story, since it's a silly little slice of life anime. Hundred, however, is not. Hundred tries to have a plot sort of, with evil alien robot-like creatures invading the earthand a virus? The characters are called Slayers and the show seems undecided on whether or not all of them are infected with the alien virus or only some of them. Concepts are brought up but not explored at all at random, like the N-Shield which shows up in the second episode but is never really explained or anything. \\n\\n\r\nArt/Sound: 1/10\\n\r\nNothing memorable, there's not really anything I can say about this. The characters look ok but not really much different from standard anime characters. Even the robot aliens, fight scenes, and transformation sequences are visually unimpressive. \\n\\n\r\nCharacters: 1/10\\n\r\nEvery character is a trope. Generic anime protagonist, blonde drill-haired tsundere rich girl, childhood friend love interest, hospitalized little sister whose body is weak because of an unidentified illness, pop idol with a thing for the main character, etc. Hundred introduces a bunch of characters and only really expands on three of them. Of those three, only one goes through any character development and it's a problem that's introduced and then fixed in the span of a couple minutes, which is, incidentally, how the anime deals with the majority of the problems that crop up. Even the main villain is only ever mentioned until the final episode, and her motivations are laughably pointless. With only 12 episodes to its name, Hundred can't possibly work through all the characters it foolishly throws out. \\n\\n\r\nEnjoyment: 2/10 \\n\r\nI laughed a few times, though most of the time when that happened, it was immediately followed by a shake of the head, a sigh, and a \"my god this anime is awful.\" \\n\\n\r\nOverall: 2/10\\n\r\nOverall, Hundred is a slog, barely even fit for what I wanted out of it. It succeeded at reminding me what a bad anime looks like so I can better appreciate the good ones, but looking back I realize there are other bad anime out there that would fulfill the job better. The main character is so remarkably forgettable that I think I've already forgotten his name as I write this. I actually had to look at the synopsis to remember that his name is Hayato. Near the end I wanted so badly to drop the show but I didn't for the sake of this review. Hundred is terrible. \\n\\n\r\nFinal Episode: 1/10\\n\r\nI think in this particular instance the final episode deserves its own section because it is truly baffling. I don't think I can do this section without spoilers, so I'll put this large \\n\r\n[SPOILER ALERT}\\n\r\nright there. \\n\r\nAnyway, the finale has a number of oddities. The main villain invades the school, but is killed by a background character who was supposedly using her, even though his plan seems to have been able to work regardless of her presence. He vaguely mentions that he has some plans but he never shows up again after this scene, so on the off chance that this travesty gets a second season, I suppose we'll see what that was about. As it stands, it's weird and irrelevant. So while the villain herself didn't actually do anything before getting killed, she did apparently activate a bunch of robots to turn into exploding bees, who try to latch onto power stations and explode. They do so but nothing really happens, the ship keeps its power, there's still a barrier up, and all the civilians are safe. There doesn't seem to be any reason for the exploding bees to exist. Seriously they supposedly put on the auxiliary power, which turns all the lights red to indicate that they're on backup power, but then the lights go back to normal in the next scene and it's never mentioned again. Later on, a magical super powered girl shows up and cures the main character's sister of her illness by touching her. Yep. Lastly, the final, climactic moment was between the main character and some girl he had no interaction with beforehand. He introduced himself to her in that scene with his full name. I think the writers were just as tired of this series as I was by this point because nothing makes sense and it seems to just wrap up because it was the time to do so. The villain introduces super alien robots with no weak points but then the main characters just beat them back as easily as they do the other ones while exclaiming \"wow it's really hard without weak points.\" What was the point of introducing these enemies if all they're going to do is change the dialogue a bit? \\n\r\n[SPOILERS END]\\n\r\nSo that's the final episode of Hundred. If you can sit through the first 11 episodes, I recommend watching this thing just so you can experience the weirdness that is this finale. Of course, it's not a good anime by any stretch of the imagination, it's not even a good trainwreck anime like Big Order, but it's... uh... something.",
            "date": "2016-06-25T12:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 221885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4699058.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/NotAnElk",
                "username": "NotAnElk"
            },
            "url": "https://myanimelist.net/reviews.php?id=221885"
        },
        {
            "content": "I was mildly intrigued when I saw the trailer for this show. It looked like pretty standard fare, but I decided to give it a chance anyway. And it fit with one of my 2017 Anime Watching Challenge goals, so I pushed through it. Honestly, if it hadn't been for that, I probably would have dropped it. I found the show to be kind of boring and a little all over the place.\r\nSTORY - 5/10:\r\nI'm still trying to figure out what the story was. The OP main character decides to go to some school (supposedly? Although I can't remember many classes) for slayers - aslayer is a human infused with some kind of virus (I think?) from the savages, which are some sort of big, alien-looking monster things. I'm not really sure, because the show doesn't do a very good job of setting things up. I mean, I'm not looking for an exposition-laced info dump, but they could have done a better job of explaining the basic mythology of the world.\\n\\n\r\nThere's an obvious love triangle (or love square, maybe) going on, as is common in shows like this. That, in and of itself, isn't an issue. But they didn't sell the relationships well at all. Emile/Emilia is immediately in love with the protagonist because they knew each other briefly as kids and shared some traumatic experience. Claire seems to be into him primarily because he showed off how strong he was in their duel. I guess that makes some sense, since she seems pretty OP herself, and someone holding their own against her is probably impressive. Then there's the diva chick, who likes him because he saved the island. \\n\\n\r\nI know I'm not talking much about the story here, but that's the problem. There isn't really a plot for the first half of the show, it's just us following the team around in an almost-slice-of-life type of storytelling, despite the giant monsters and crazy hundred-infused weapons. The plot is a mess, jumping around, disjointed, however you want to describe it. I give it a few points because it starts to coalesce a bit later in the season, but my interest had long since waned by then.\\n\\n\r\nART - 7/10:\\n\\n\r\nThis might be a generous score, but I did like the character models. They all looked nice, and I guess I'm a sucker for pretty blondes - Claire is quite fetching. \\n\\n\r\nBut the reality is that the animation is lacking. Tons of still shots, and the fight scenes are pretty lame. I was impressed with the first duel between the protagonist and Claire, but it was downhill from there. Pretty much every fight with the monsters was the same - the main dude just jumps in the air and slams his big sword down. There was fertile ground for very nice animation given the setting, but I guess they didn't have a big budget? I don't know, it was just disappointing.\\n\\n\r\nSOUND - 7/10:\\n\\n\r\nVoices seemed fine. The music wasn't great, especially considering one of the characters is a world famous diva. \\n\\n\r\nCHARACTER - 4/10:\\n\\n\r\nThe characters were pretty weak. Outside of their love interest in the main guy, I'm not even sure I could tell you much about the girls. Emile/Emilia seemed almost defined by her infatuation. Claire at least had a bit more depth, given the responsibility of being in charge of the Little Garden, and the sorrow she feels for her sister. But the writers didn't go deep enough for it to really resonate. More missed opportunities.\\n\\n\r\nMost of the side characters were pretty peripheral. The main guy and his sister, Karen, did seem to have a touching relationship, but that was about the only ounce of emotion I got from any of the main pairings.\\n\\n\r\nThe two characters that actually seemed like there might be something interesting going on were Claire's big brother and the eventual big bad, Vitaly. Apparently they were once lovers and he betrayed her, starting her on a quest for revenge. You could sense the conflicting feelings, right up to the end. I feel pretty confident in saying that I would rather have been watching their story than the one I was forced to watch instead - it seemed like there was something real there. Too bad it only comes to light in the very last episode.\\n\\n\r\nENJOYMENT - 5/10:\\n\\n\r\nThere wasn't much positive to say about this show from a critical standpoint. It's just not well done. I'm not sure if the source material is better, but this adaptation leaves much to be desired. I was constantly bored, and I probably would have dropped it after a few episodes if not for the anime watching challenge. \\n\\n\r\nThere were some good laughs mixed in, and a lot of fanservice - but even the fanservice felt disappointing, as it doesn't go all the way. There was enough boob grabbing in this show that they really could have just gone with full nudity and it would have at least added a touch of excitement. The plot and the characters sure weren't adding much.\\n\\n\r\nOVERALL - 5/10:\\n\\n\r\nI know I just pretty much trashed every aspect of this show, and I'm still giving it a 5/10. For reference, that's a bad score for me. It takes a lot for me to give something a failing grade. I have a great deal of respect for the creative process and the amount of energy that goes into crafting art, so if someone can put something together that gives me even a bit of entertainment, it gets a pass from me. I would have to be openly offended or disgusted by what I'm watching to give something lower than a 5. Hundred isn't a good show, but it's passable entertainment. I wouldn't begrudge someone for finding something in there that they like and enjoy - in fact, I think there's a half-decent story in there somewhere. The plot is just too much of a mess to pull it out. A defter hand at the wheel might have been able to turn this into something better.",
            "date": "2017-03-11T12:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 242335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2664111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/elrond99",
                "username": "elrond99"
            },
            "url": "https://myanimelist.net/reviews.php?id=242335"
        },
        {
            "content": "This is my first review of a show. I don't usually do these, but I do normally read reviews before watching the show. Personally, I like watching Ecchi anime, regardless of seeing rated R (close to Hentai) anime, or perverted anime like this one. But this isn't really perverted, it's just that \"unplanned\" ecchi things that happen to or from the MC. \r\nThis show is another one of those battle action harem shows that we see every season at this point. Mind you, this review will have spoilers, so read at your own peril.\r\nStory (7/10)\r\nBasically, the story is set in a Earth where there isthis technology called \"Hundred\", where the stone takes the form of the holder's imagination. There are different types, like dragoon, chevalier, etc. Offensive and Defensive holders. It starts out with the Main Character having a flashback to when he was a child and was in the middle of being attacked by the monsters that are called, Savages. He saw blood and fire everywhere and the girl he was holding bleeding out. He wakes to find himself at his new 'home'/school. Little Garden. He evades the welcoming committee and seems to be rather famous. Although, he escapes the majority of the new class, he can't evade his new roommate, Emile Crossford, who he feels a familiar connection with. Like with most Main Characters, he doesn't remember his tragic past all that well, just bits and pieces. On top of all that, when he goes to his freshman seminary, a few necessary but uneccessary things happen, and he's challenged by the Student Council President, aka the Queen of the school. The school's Most Powerful Slayer, Claire Harvey.\\n\\n\r\nObviously, the most powerful student in the school has to teach the new kid a lesson, so she challenges him to a duel. On his third day at the academy, they fight. She boasts about not using certain bits of her power, yet is cornered when the MC is given all this power. Power he later understands how he received. Although, he has this power, he needs to learn to control it before it controls him. Now, the story goes on as a usual harem story would. Two women in his life seem to be part of his 'tragic' past. He learns how he's different. Why he has this huge power that most others don't have. \\n\\n\r\nLike with most anime, this one is no different. It likes to go into a bit of a backstory, not as fillers though. It does tie in with the main story of it all. The main story of the MC and the antagonists who are the Savages and the ones who are 'rogue' slayers.\\n\\n\\n\r\nCharacters (9/10)\\n\\n\r\nI believe each character is moved forward in  way that they can be remembered. The main character, Kisaragi Hayato, obviously knows three of the characters due to this past. His sister, Kisaragi Karen and two of the others that you meet later on. Emile Crossford is one of them. They go through a couple episodes before Hayato actually remembers more of what happened to him as a child. But each character has a back story that flows with the episodes. It's not some random filler, but a way to move the story forward. To help the viewer understand a bit more. As said in the story bit, Hayato is challenged by the \"Queen\", Claire Harvey. She's like the usual Tsundere that most people are fond of, others are annoyed by. But soon after, she even falls for Hayato. The only characters that aren't really looked into, or shared about much are the supporting characters like Liddy and Erica or Fritz and Reitia. But the basis of each character in the show is understandable and comprehendable.\\n\\n\r\nEven the antagonist, although, by the end it's a bit confusing as to who is the real main antagonist. Possibly because the second season (if there was to be one) would go into more depth about that part of the story. I see how many people would think that it's a Harem, since multiple girls fall for Hayato, but honestly, I don't see Hayato falling for the multiple women. In fact, I see his feelings towards one woman in particular grow and grow, more than the others. He's just socially awkward around women, and is pushed into unavoidable situations that most Ecchi Main Characters are.\\n\\n\r\nTheir dialogue is that of a mecha show. But when they're not business-like, then they're how a normal dialogue between two (or more) people would be. WIth the added comedy for fans. The \"Ecchi\" part of it, is mostly for laughs and giggles, not for hentai purposes. The furthest the ecchi-ness goes is honestly groping or carefully censored breasts. Not revealing anything too...dirty. \\n\\n\r\nHonestly, I do believe the characters deserve more episodes to dive into far more. To understand better and to have a better story. But all in all, they're believable characters and their development was good.\\n\\n\r\nMusic, Art, and Animation (9/10)\\n\\n\r\nFor the animation bit of this, I'm not a huge nerd when it comes to it, so I don't really know much about it. But for me, I thought the fight scenes, and all were actually pretty good. I found them not as cringy as other shows, and the graphics weren't bad. But then again, I'm just an avid anime watcher, not a graphics kind of person. \\n\\n\r\nThe art style wasn't unique but it wasn't bothersome either. In fact, I enjoyed the style of the art, and it was enjoyable to watch. The scenery, the sets, everything. I found it quite enjoyable personally. Honestly, I don't put much emphasis on it, it's not major as the Character aspect of it or the Story aspect of it. \\n\\n\r\nThe designs matched their personality, they weren't overly powerful (except the main character) nor were they really lazy. The audio, the voice actors I thought were spot on. Although, I have admit the sound tracks for this series were pretty good. One in particular, called, \"Smile Flowers\". I'm personally not a huge fan of Opening or Closing, but this particular soundtrack was actually part of the show, it had a time and place which I enjoyed. \\n\\n\r\nEnjoyment (9/10)\\n\r\nPersonally, I enjoyed the show. It was funny at times, majority of the times when the \"unfortunate\" and unplanned bits happened. Or the clichés of the women waking the male up, and him acting up on it. The jealousy between the female characters while the MC was shown too much attention from another female. I found it funny. The reactions and whatnot. The fight scenes were also enjoyable from my stand point. \\n\\n\r\nAt the end of the day, Anime is exactly that. A source of entertainment. If you're expecting so much more, most of the time you'll be disappointed. But if you watch for the sake of being entertained, you could find even the most suckiest anime interesting. In my case, this wasn't the suckiest, I enjoyed it to the fullest. So for enjoyment of this anime and thoughts, I give it an 9/10. Personally I hope to see a second season, but hey that's just my take on it. \\n",
            "date": "2018-12-03T03:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 295178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/katherinewulf",
                "username": "katherinewulf"
            },
            "url": "https://myanimelist.net/reviews.php?id=295178"
        },
        {
            "content": "This one was bad... seriously bad.  Let's try to unpack how and why.\r\nStory\r\nFirst thing is first, the story: It's a mess that doesn't really go anywhere.  We're introduced to this world, menaced by a (presumably, nothing is ever confirmed) alien life-form called Savages.  The opening scene is actually a rather gruesome attack on a city by a giant monster.  Nothing ever really lives up to this again.  We see a survivor of that attack attending a military school for using super-power tech to fight said monsters.  That's alright so far, but... We have the amazing “special” who hasn't doneanything yet, and quickly find out that the inmates here are running the asylum with a student council president able to expel students and willing to resolve disputes with a duel.  Ouch.  We also meet our girl-disguised-as-a-boy and the other survivor of the opening scene so obvious winner of the harem to be and I'm so glad this bit has a running time beyond two seconds of tolerance.  They don't even really try to fake us out, anyone with two brain cells to rub together could know what's going on.  But OK, let's say you take all this in stride.  They're chucking the dark atmosphere and potential intensity suggested by the opening, but that leaves a Super-powered high school antics show, right?\\n\\n\r\nWell, it sort of drops the school aspect (no one ever attends class or spends time in a school-like environment; it's just an excuse for all the characters to be improbably young), and while you might find some of the initial mission fighting promising (I didn't – the action in this show isn't anywhere above par) for just... harem nonsense with a side of fighting the same exact monster in different size categories repeatedly?  That's not compelling, though they spend some of this time introducing the show's “best” character (an easily won superlative) in its “most effective” (again...) moments, so maybe you think that's OK?  It's not good though, surely there must be more.\\n\\n\r\nThe show helpfully introduces (by reputation) a figure who seems like she could be a decent villain, and a bad guy team on the same side.  So, OK, it sucks that we're not really doing anything with the Savages, but at least these jokers will actually do some plot lifting?  Unfortunately, they kind of don't: more time is devoted to spouting exposition and accidental-boob-grab humor than on actually forming a coherent plot or generating real investment.  If the show was better done I guess team black-and-yellow could have seemed mysterious, but I have no reason to want to solve their mystery.  We're told they're looting valuable stuff and that they're working for a mad scientist sort of figure, but without motivation or investment in the characters (the show's biggest fault) you can't really get involved with the mystery because there are no stakes for the viewer.\\n\\n\r\nWhat follows are two more arcs of junk: Bad action sequences, lackluster humor, and talking solely about 'what' rather than 'who' or 'why' doesn't string together into anything coherent.  The final arc is really emblematic of the show's problems, since nothing is built up or set up well.  The Mad Scientist Villain from before is finally revealed and does things, but we aren't clued in on what she's doing or why she's doing it before hand, so the damage from her attacks just seems senseless... as little of it as there is.  Nobody gets really hurt throughout this show (except maybe one guard who in one shot seemed very dead, but later there was no blood anymore so who knows?) and few enough people are legitimately imperiled that you don't really get a sense of danger or consequences that carry the action on.  You can have your characters get through their battles and be alright, but you need to sell up their foes so the audience can suspend disbelief and feel like maybe this is the time they're going to really suffer or die.  Hundred never gives enough effort to let that drama exist outside of, again, that opening flashback.\\n\\n\r\nEventually we do get a motive for the villain... that was never set up and thus didn't have any emotional impact since it relies on spouting facts about characters we've barely met rather than expressing the emotions of those we know.  And then the Villain is unceremoniously disposed of with a lot of the final episode left just cleaning up minions.  The big climax doesn't even (directly) involve her at all, but rather the emotional turmoil of a tertiary character we never really got to know as addressed by the main character who shared maybe two lines on screen with said tertiary character.  Oh, yeah, that's enough to form a strong bond with both each other and the audience that legitimizes a “power of friendship saves the day” moment.\\n\\n\r\nLong story short, the story is horrible.  It never once lands its moments or justifies its existence.  It could have gone a lot of ways – it could have been a grim battlefield like Attack on Titan, an emotional roller coaster like Darling in the Franxx, or a slice of over the top insanity like Kill la Kill, but instead it did... Absolutely nothing worth doing.\\n\\n\\n\r\nArt\\n\\n\r\nThe animation is... OK at best.  Most of the designs look fine, though the “Basic Savage” is heavily reused and some of the characters seem far too exaggerated for the show to take itself fully seriously without ever utilizing or acknowledging the fanservice aspects like Kill la Kill or Darling in the Franxx did.  There are a lot of cut corners, especially as the show reaches towards its climax, so either they didn't have the budget to execute their vision or, seeing how little of a vision there seems to be in the scenes that try, they just didn't care.  Most damningly, the action isn't fluid or engaging.  Good action especially, and good animation in general, is predicated on a certain level of dynamism.  You need shots that sell the events on screen as being meaningful or having weight to them, and you need shots that provide enough of a rush with their speed and clarity that the viewer can get sucked into what's going on and actually experience it.  Hundred managed, once or twice, to actually sell an event (like someone crashing into a wall selling the monster's strength), but it never managed to actually be engaging.  The best fight scenes in the show were sharp and choppy, where the strikes were too sudden to really follow in a meaningful fashion or too consumed by bright light to actually see what's going on.  It's a cop-out, in my mind, to avoid having to come up with actual good choreography.  More fight scenes relied on slow pans over still images of an attack or impact, maybe with something in the scene spinning or fluttering to give the illusion of motion.  It would be pretty terrible if this was just the battles, but other important scenes, that should be sweeping but could afford to be slower and more controlled (like a big and plot-critical concert) use the same technique.  For heaven's sake they repeatedly use pans over character art for those characters singing, and their mouths don't even move, it's transparently still.  Even if the concept art looks alright, I'd like a little more animation in my animation, please.  I remember other shows, like Fullmetal Alchemist (2003) and Record of Lodoss War getting cheap in similar ways, but typically they actually had a few spectacles they were saving their budget for (or had blown it on).  Hundred, again, never really does anything worth doing.\\n\\n\r\nEven the art, while potentially on the good edge of bog standard, suffers for the show's lack of vision: even when it's pretty, there's no creativity to it.  Let's take the Hundreds themselves as an example.  Here, the show has a good setup to impress visually, since every character who uses a Hundred has at least two, potentially three 'forms' they can work with: the basic character (in their fancy Zero Suit), the character transformed by their Hundred, and for some characters a second level of transformation into a truly unique and overpowered form.  Hundred puts two of its main characters through their paces in the second episode and... wow it's not impressive.  I can kind of forgive the first level of transformation being gaining a couple metal plates and a weapon – the show wants to maintain its fanservice to some degree and while the designs aren't creative or intricate I accept that there's a reason for that.  Not a good reason, but a reason.  But then the second level transformations kick in, and this should really be a chance to wow us – this step is built up as rare and powerful, so it ought to look amazing.  What happens?  The main character gets a visor and a slightly bigger weapon.  The female character pulling out the same technique gets slightly fancier boots and a moderately bigger weapon.  They aren't even different weapons that are bigger than the original, they're just scaled up slightly.  A chance to do something amazing was practically gift-wrapped for this show and... nothing.\\n\\n\\n\r\nSound\\n\\n\r\nI can't complain too much about the sound.  It's not good, and while at times I feel the voice actors were poorly directed for the scenes I'd cover that more in character.  I do kind of want to knock it down for sprouting a music theme (this show throws a lot of stuff at the wall, and none of it sticks because I think they treated it as a competition for how many cliches they could cram into 12 episodes) and then not delivering actually impressive music, but what they do deliver isn't bad.  It's mediocre all around, but I can't really say any of the performances were godawful and the sound effects and background music never really distracted or detracted from the show.\\n\\n\\n\r\nCharacter\\n\\n\r\nThen we come to the biggest failing of this show, worse even than the plot: its characters.  At its heart, Hundred is a harem anime (or at least that's what's left when it already failed at action and mystery), and for anyone who's at least a little discerning and doesn't just want to ogle the drawings, a show with harem elements lives and dies on how good or bad its characters are.  Good shows that are harem-types or have a decent amount of harem in them have memorable, creative characters with distinctive personalities.  Yamada-kun and the Seven Witches, Steins;Gate, and KonoSuba could all be classified as at least partially Harem, and they all take their time developing their leading ladies and getting the viewer to know them as people so, even in the cases where the “winner” is a foregone conclusion (Which, by the way, it didn't have to be in Hundred, despite them choosing the obvious lazy route in the end), you can like all the contenders and maybe even root for an off-route.\\n\\n\r\nHundred has three main “heroines” and none of them ever really land.\\n\\n\r\nFirst is Emile (or, Emilia), a the girl-disguised-as-a-boy from the opening flashback.  And... that's about it.  She's generically affectionate, clingy, and jealous.  There's really nothing else to her, she's got the personality of damp cardboard.  There's no comedy potential in the character once her one gag has worn out its brief welcome because she doesn't act in a manner that's consistent enough to either use or subvert, there's no drama potential in the character because the only facts about her are played for 'humor', and she doesn't even have any connection to the plot.  In terms of story, you could cut this character, probably the character who gets the second most screen time (though the three leading ladies are closer than you'd expect out of such a sloppy production, to the point of being given nearly equal weight so that 'resolving' the harem feels like a cop-out at the end), and nothing of value would be lost.  Seriously, replace her with an otherwise inanimate scarecrow that possesses equivalent combat abilities, and that at least would be a little funny because hey, this character is an inanimate scarecrow and no one seems to be noticing.  Most damningly, despite theoretically having this powerful background with the main character (enough to blow your opening scene on) they have literally no chemistry.  It's actually kind of amazing, they're like Helium and Neon, just incapable of reacting.  Other than her acting kind of like a clingy girlfriend (despite the fact that she should be taking her “pretend to be a boy” ruse that exists for basically no reason seriously) she shares nothing with the main character.  They never talk about anything or express what makes them happy, they never bond over current events, even the history they theoretically share from that first scene is mentioned maybe once, and then only to explain how they both became “special” tier fighters, not to build any emotional connection between them as characters.  Did I mention she's also a princess?  Yeah, I guess you could classify that a spoiler but it's given about as much weight in show as I just gave it right now, and doesn't help her character in the least.  We still have no reason why she and main character should feel each other to be more than passing acquaintances, which is the worst possible result for the supposed romantic winner.\\n\\n\r\nSecond we have Claire, the Student Council President/Boss of Everything.  She's generically tsundere (just a little), clingy, and jealous.  She's got a little more going for her than Emile did, since she at least has a personality (even if it's not a good one) and one or two scenes where she actually talks to the main character like they're human beings (though it takes to episode 8 to see), as well as a connection (however weak) to what passes for a plot in this show.  She mostly seems to exist for fanservice shots, but I'll grant her that she at least pretends to have more than breasts and spouting exposition to her.\\n\\n\r\nSakura, the third and final serious contender, is the only character who made a connection predicated on emotion and character, on WHO she is rather than WHAT she is.  The fact that she's alone in this is a really damning truth for the show.  Like Emile, she has history with the Main Character (in fact, dating to the same event), but unlike Emile this actually leaves an impact on both of them as people: Sakura is a big-time singer, and got her love of singing from having spent time with the Main Character and his little sister when they were in a bad situation together, and the fact that she could make people happy.  Meanwhile, Main Character is able to connect better with his sister in part over that memory.  She's still generically affectionate, clingy, and jealous for most of her run time, but she actually does have motivation and emotion leading her to do what she does in the show and with her life in the background.  She manages to be the instigating actor for the second of the show's four arcs, which is more relevance than even Claire really had in the end, and along with the previously mentioned little sister (who idolized her without knowing it was the girl she met years ago) is the vehicle for delivering the music theme.  She also has some pretty heavy background with the villain, having been used as a guinea pig for mad science experiments by said baddie.  And when her history comes out, the scene with the Main Character is actually given a little weight and meaning.  Why the hell was this show not about her? She has wants and desires, she has strong ties to both the heroic and villainous side of the plot, she's core to one of the show's way too many themes... Emile could vanish and Sakura could fairly effortlessly take over her sad excuse for a role (minus the “pretending to be a boy” stupidity) entirely.  No one would miss Emile.  Before it seems like I'm praising her too much, let me be clear: Sakura stands out in this show not because she's a good character in her own right, but because she's the only character here who hits basic competence for any sort of character writing.  Like I mentioned, she's fairly generic, and while her connection to the little sister actually gets built on, her connection to the villain is the first mention of the villain and then... never comes up in the climax.\\n\\n\r\nIn my mind, Hundred wouldn't have been saved by retooling to present Sakura as the female lead, but it sure as hell would have been a step in the right direction: she has the better used history with the main character, she and the main character get along as people in the present even without that, she has decent plot magnetism at multiple stages, and she could even be used in the ending: when the main character has to use the power of friendship to reach a former guinea pig of the sadly disposed of villain, that could have been the power of love for Sakura instead, having used her past as a mad science experiment to generate a real threat.  Then, at least, the character in jeopardy would have been one we actually felt for, and the bond that needed to be utilized in order to reach a positive resolution is one we could actually believe existed.\\n\\n\\n\r\nEnjoyment\\n\r\nSo how much did I enjoy Hundred, then?  I didn't.  There was nothing to enjoy here.  Weirdly, I'm not even mad, the show didn't make me feel enough to actually get worked up about it.  Forcing myself to think it through for this review I find that its problem isn't that it did anything insultingly wrong, but that it never provided anything worthwhile.  The action is lame, the plot is a failure, the characters are lifeless... there's just nothing here.  This show had no ambition and no creativity, none at all.  I feel like I should apologize to other shows I've had harsh words for.  Clockwork Planet may have been guilty of most of the same failings as Hundred, but at least Clockwork Planet had a creative premise to squander: Hundred is happy having no premise at all: the Savage, the monsters theoretically menacing humanity, are never addressed, the villain's downfall is almost insultingly not germane to anything in the story... there is nothing.\\n\\n\r\nStory: 1\\n\r\nArt: 4\\n\r\nSound: 5\\n\r\nCharacter: 1\\n\r\nEnjoyment: 1\\n\r\nTotal: 2\\n\\n\r\nFinal Verdict\\n\r\nDo yourself a favor and don't watch Hundred.  You'll be missing out on nothing.",
            "date": "2018-08-17T15:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 286733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069462.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TevishSzat",
                "username": "TevishSzat"
            },
            "url": "https://myanimelist.net/reviews.php?id=286733"
        },
        {
            "content": "I really don't write reviews at all but I wanted to this time, this anime not only has a good story/plot but coexists with the fan service and I think the writers blended the 2 perfectly.\r\nThe fan service isn't the plot but an added bonus and truly adds to the anime rather than takes away because most of the time the creators of animes don't know how to blend ecchi and the plot without the ecchi being the plot but that's not the case here they blended perfectly. The only reason that it doesn't get a perfect score his because the MCs backstory lacked justa bit because they didn't really give an extensive backstory. I would highly recommend this anime give it a try.",
            "date": "2018-04-08T09:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 277386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6093209.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PokemonMasterRe",
                "username": "PokemonMasterRe"
            },
            "url": "https://myanimelist.net/reviews.php?id=277386"
        },
        {
            "content": "NEW REVIEW:\r\n(Looking back at my old review, I felt that I may have been too harsh and didn't provide enough important details. As a result, I will write a completely new review. My old review will be at the bottom in case I or anyone wants to view it.)\r\nI think every anime has potential. I've seen an ecchi harem anime where one of its OVA episodes was so much better than the actual anime, because in that one episode, they actually took time and focused on proper storytelling and character interactions instead of making sacrifices for the sake of fanservice. In that one OVA episode,the heroine actually felt like a character, not just some shell of a cut and paste harem character like in the actual anime. Sadly, Hundred decided to take the same road as the other hundred or so mediocre harem anime, and they did a pretty bland job at it too. \\n\\n\r\nStory 3/10\\n\\n\r\nIf you've seen a lot of ecchi harem anime, you'll notice that a lot of them follow a generic pattern, and this anime happens to follow that pattern. If they want to be unoriginal, fine. But unless they do it properly, the anime will be mediocre at most. \\n\\n\r\nThe story was extremely basic, as if they only put enough effort so that a story would exist, but nothing more. As a result, the story was very predictable and bland. There were also parts where the story was forced to go a certain direction. This made the characters seem dumb and irrational, and left me facepalming in disbelief even though I predicted exactly what was going to happen. \\n\\n\r\nIf you've seen lots of harem anime and are looking for one with a good story, I suggest you watch season 1 of High School DxD. If you feel like a zombie, want to relax, and have nothing else to do, I guess you could give this a try. \\(` -`)/\\n\\n\r\nCharacter 3/10\\n\\n\r\nLike the story, the characters in this anime also follow a generic pattern. Again, like the story, it's as if minimal effort was put into the characters.\\n\\n\r\nFirst off, we have the generic harem MC: Kisaragi Hayato. Normally, generic harem MCs are as dense as rocks. In other words, when a girl confesses their love to his face, he won't notice. If you throw a coconut at his face, he won't notice. But fortunately, Kisaragi Hayato doesn't seem to be dense, so I applaud him for that. But everything else is pretty straightforward. \\n\\n\r\nLike almost every generic harem MC, the script forces him to accidentally trip onto girls in such an unrealistically convenient way that his hand is grabbing her breast. On top of that, without realizing, they all squeeze the breast like fucking dumbasses. Most of the time, the girls being squeezed scream and blame the MCs even if it's not their fault. Apparently, this is supposed to be funny and stimulating. \\n\\n\r\nIn addition to the breast grabbing, the generic harem MC attempts to give emotional speeches during times of crisis, is a complete goody two-shoes, thinks it's a burden when girls are fighting over him, etc. The list goes on and it'd be a waste of time talking about it. If you've seen a few mediocre harem animes, you'll know.\\n\\n\r\nThe other important characters are also pretty generic. Tsundere, idol, little sister, someone you met at childhood, etc. Like the MC, these girls have been dumbed down for the sake of fan service and poor comedy. and their actions are predictable.\\n\\n\r\nThere's also this one kid who sounds and acts extremely annoying: Olfred Korvanh. You'll know when you see him.\\n\\n\r\nMost of the characters don't really stand out. Like the story, they are just there. \\n\\n\r\nAt 6/10\\n\\n\r\nThe art seems okay for the most part. It's up to date for its generation of anime, but it doesn't really stand out. The action scenes aren't that exciting. The characters fall unconscious without blood or wounds. Lighthearted animations for a lighthearted anime. They will use some blood and gore on the very beginning to draw you in, but that is all you will see.\\n\\n\r\nThere was this scene where a girl with small tits had bigger tits for like 30 seconds for the sake of fanservice. I mean come on... \\( '- ')/\\n\\n\r\nConclusion\\n\\n\r\nThere may be enjoyment to be had from this. If you're not looking for much of a story, feel like a zombie and want to relax, or have nothing else to do, I guess you could give it a try (\\( ` o`)/)\\n\\n\\n\\n\\n\r\nOLD REVIEW:\\n\r\nThis review may contain spoilers, but I don't care, because this anime has already been spoiled by countless other harem anime.\\n\\n\\n\r\n--Story--\\n\r\nThe story is about a harem MC who enrolls in a school that trains its students to protect humanity from gigantic monsters called \"savage\". (v 'o')b\\n\\n\r\nThe anime starts off with an interesting flashback. The flashback does an \"okay\" job of introducing the savages using a tiny bit of horror and gore. But sadly, when it's done, we get introduced into the generic harem world; any horror they built up at the very beginning is lost throughout the anime. Rather than building up with the gore and horror elements, they turn the savage into a pathetic sideshow for the harem. It's like no one is really in danger whenever the savage appear. Then again it's a lighthearted shonen, so whatever \\( `-`)/\\n\\n\r\nThe rest of the story is pretty straightforward. Harem-style duel at school, harem style conclusion after each arc, harem MC tripping onto girls and grabbing their boobs. \\n\r\nYou name it, they harem it (v `-`)b\\n\\n\\n\r\n--Characters--\\n\r\nMost of the characters are pretty generic. We got a harem MC who gives generic harem speeches, the tsundere, the idol, the little sister, etc. Some of the scripting sucked balls. Here is an example:\\n\\n\r\n*spoiler alert*\\n\r\nSome students were late for the entrance ceremony and the captain wanted to expel them. HOWEVER, when students fight among themselves, -doesn't give a shit-. When someone isn't taking the dangerous missions seriously, -doesn't give a shit-.\\n\r\n*spoiler alert over*\\n\\n\\n\r\n--Animation--\\n\r\nThe animation was okay. Some fights had still frames. People falling unconscious without bruising or bleeding. Some boob physics for the harem MC.\\n\\n\\n\r\n--Comedy--\\n\r\nThe comedy in the anime is the typical harem comedy. The harem MC gets bombarded by girls and they fight over him. ha ha ha ha ha ha ha... (v 'O').\\n\\n\\n\r\n--Conclusion--\\n\r\nI wouldn't say the anime is bad, but it's not good either. It didn't really have much to distinguish itself from the other harem anime. The scripting was pretty basic and bland. Likewise with the animations and sound.",
            "date": "2016-08-10T18:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 226437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4281679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/WrenchMan",
                "username": "WrenchMan"
            },
            "url": "https://myanimelist.net/reviews.php?id=226437"
        },
        {
            "content": "\"Awesome.\" is what I would say if this series were any good, however the best I can come up with to describe this train wreck, well it's one that cannot be used in polite company. \r\nThe concept behind the series is one that has been done before yes, and not necessarily a bad choice as the foundation for the story itself. However the execution of it was a complete and utter disaster. \r\nThe writer seems to be struggling with creating anything new and exciting while using the genre they chose. Their dialogue and character development relied too heavily on existing characters taken from other stories.\\n\\n\r\nWithout breaking through to the next level and using their own ideas about the story and about the characters embroiled within it,  the entire story falls flat on its face, leaving the viewer with a bad taste in their mouth, much like eating crap while being told that it was delicious fare. \\n\\n\r\nAll told even the production values from the studio were questionable at best. While some ecchi comedy contained within the series can add a little something, this story took it to a whole new level by shoveling it down the viewer's throat. \\n\\n\r\nThe first four episodes were a conglomeration of boob grabs and fan service which weren't limited there, thus in exchange for that slop the backbone of the story was sacrificed. None of the ideas or character presented were given any growth and development in lieu of the excessive fan service and ecchi elements. \\n\\n\r\nBecause the story ended up being a hack job of harem and fanservice attributes focusing in on female body parts what was left was predictable and boring, thus leading up to a less than mediocre presentation. \\n\\n\r\nWhat was done well however was the art as the characterizations were crisp and clean and very enjoyable to watch, even though again, the female character proportions were over exaggerated. The use of deep and rich colors added a pleasant appeal as well. \\n\\n\r\nOverall a painted turd is still a turd and this piece of crap should be avoided. If someone recommends this to you claiming that its a genius work of art, they're definitely lying and are having a laugh at your expense as your eyes bleed while watching this infantile garbage, or they lack a sense of taste and intelligence. \\n\\n\r\nEither way, this series should have never been produced, and the writer should have taken some time to come up with their own original work rather than ripping off everyone else's ideas. \\n\\n\\n",
            "date": "2017-12-08T16:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 264794,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4824095.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Kage_Okami",
                "username": "Kage_Okami"
            },
            "url": "https://myanimelist.net/reviews.php?id=264794"
        },
        {
            "content": "Story: 1/10\r\nFirst of all, I’m giving a 1 because I think this has the potential to get better. The main problem with this anime is that… it actually doesn’t have a story. It just has a universe which is way too underdeveloped. I guess the only enjoyable part, for those who are into it, are the extremely cliché ecchi scenes (I personally don’t like it).\r\nWhat I have to say is that the show feels like a big bunch of fillers in a bigger setting. It’s very painful to watch, especially the last episode since the ending is really disappointing to me. Nothing about the worldis explained and the villain’s motivations are… questionable. Though it reveals that there may be a second season. However, it’s a light novel adaptation so we can’t know for sure I guess?\\n\\n\r\nArt: 2/10\\n\r\nI really dislike the art style but it’s personal tastes. It’s generic and feels kind of old school but in a bad way. At least they didn’t try to throw in some CGI and the fight scenes were decent. The backgrounds didn’t strike me as beautiful either.\\n\r\nI didn’t like a lot of the character designs too, though they are at least really different from one another so there’s effort here.\\n\\n\r\nSound: 3/10\\n\r\nThere are some songs as one of the characters is a singer. I don’t really like these songs but the singer has a pretty voice so it’s ok. Other than that, I can’t say any track of the soundtrack really stuck in my head, I barely noticed any of them.\\n\r\nVoice acting is okay but I can remember some times where it didn’t match the animation.\\n\\n\r\nCharacters: 5/10\\n\r\nI didn’t feel no hatred for any of the characters but no love either. The MC is a typical get-stronger shounen hero and his harem is a bunch of cliché girls thrown together. I feel like the girls didn’t have real interactions between one another, except for two of them, so they just felt kind of dumb. They also don’t change throughout the series.\\n\r\nAs I said earlier, the villain’s motivation is questionable and it actually reduced my overall enjoyment by at least one point. This is what made the show feel useless.\\n\r\nWhat I like about this harem anime is that the MC actually choses a girl at the end: this felt very satisfying!\\n\\n\r\nEnjoyment: 4/10\\n\r\nI knew this show was bad since the first 2 episodes but continued to watch it anyway because at least, it was funny because the clichés were so laughable.\\n\\n\r\nOverall rating: 4/10\\n\r\nI really don’t recommend it to anyone since it doesn’t bring anything new and can be very boring at times.",
            "date": "2016-06-21T00:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 221368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5157323.jpg",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ailhou",
                "username": "Ailhou"
            },
            "url": "https://myanimelist.net/reviews.php?id=221368"
        },
        {
            "content": "So Hundred overall was a great Anime to watch. The Overall plot was relatively good.The only problem i had was the fact that he was playing a few of the girls feelings but other wise it was great. But the ending was a bit lackluster it seemed thrown together and rushed. Personly i loved the options the Mc had. but sadly he went for the princess at the end. The Main characters personalty seemed a bit weird but it was played out really well so that fact covers up a bunch of downs for him. The plot of the show ( wink wink) was greatthe options where varied so i gave the over all show a 9. \\n\r\nHope you read other of my reviews \\n\\n\r\n        Zechariah",
            "date": "2017-09-17T19:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 257850,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6563174.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheHoeflicker",
                "username": "TheHoeflicker"
            },
            "url": "https://myanimelist.net/reviews.php?id=257850"
        },
        {
            "content": "This is a show that gets Anime right. Anime should be whimsical, sexy, absurd and be the kind of fun that makes you smile. Hundred does all of that and more. It's the formula of a clumsy guy who is completely untalented and ordinary in every way, but because of seemingly benign events of his childhood he can go into \"berserk mode\" and kick some serious butt when cornered. This makes him popular with the ladies, and he often has long stumbles and trips into squeezing the breasts of women who abhor him, melting away the ice around their tsundere hearts! It's every young man'sdream come to life. From there his inane childhood full of \"hello\" \"hey ya\" and \"your singing is alright\" to random girls has been remembered by now gorgeous women who now want to nibble his earlobes. Inexplicable magic, fawning hot babes, monsters, trip-gropes. Hundred has it all! It's exceptionally well drawn, well written with characters you will genuinely care about and you will end up rooting for no matter how jaded you are.\\n\\n\r\nIs it for anime-snobs and the uptight? Absolutely. Everyone should loosen up and watch Hundred. It's what Anime is all about!",
            "date": "2017-09-13T14:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 257445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6554107.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mankikubo",
                "username": "mankikubo"
            },
            "url": "https://myanimelist.net/reviews.php?id=257445"
        },
        {
            "content": "This anime is your typical harem\r\n1) Transfer student - check\r\n2) Duel on first episode - check\r\n3) Main character is superior - check\r\n4) Guy : Girl ratio is 2:5 - check\r\n5) Accidental boob grab - check\r\n6) Mysterious flashback of girl - check\r\n7) Boobs - check\r\nand of course the best grill is a trap.\r\nThe main reason that i did not really enjoy this anime much is probably because of the characters and the amount of repetition to the point that it has become boring.\r\nEvery episode review - MC take one of (the big bewb grill)'s first , accidental boob grab , fighting for le mc , etcetc\\n\r\nI had to force myself to continue the anime to actually finish an episode , and ended up procastinating on watching it to the point that i have completely dropped it.(I've only survived to episode 4)\\n\r\nAs much as i'd love to say that this anime was shit , but it is just my personal opinion and not everybody may view it the same way.\\n\r\nSo to conclude , Hundred , more like TheOnlyGoodThingAboutThisAnimeIsEmile",
            "date": "2016-12-18T02:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 235724,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5909490.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kijugh",
                "username": "Kijugh"
            },
            "url": "https://myanimelist.net/reviews.php?id=235724"
        },
        {
            "content": "If you aren’t already aware, this is yet another mecha/school/harem anime. It is the standard plot of guy who has an aptitude for a new military device goes to school where he assembles a harem. More specifically, Hundred blatantly rips off Infinite Stratos down to minute details. Why did I keep watching it if it is something I have already seen? Well, Infinite Stratos had some problems(such as the main character being spineless and clueless, a lack of an overarching conflict, one dimensional love interests, filler, and too much focus on the harem). Initially, it looked like all of these problems were fixed and Icould now enjoy its full potential. \\n\\n\r\nI was disappointed. While some of the problems were fixed, there were so many other problems that it actually manages to be worse than the source material. Granted the main character is better but little else is fixed. All the problems stem from the fact that around the midpoint the show completely shifts. The original conflict is replaced by one that seems relatively unimportant when compared to the first. The tone switches from “humanity’s struggle against alien invaders” to a high school drama. The show becomes filler until the two-episode finale. Finally, the show is really boring. The fights are dull and short. The weapons used are dumb and frustratingly uninteresting. \\n\\n\r\nIn summary, the first part of this show lays the foundation for what could have been a great show. The second destroys this foundation and gives us another tedious, generic time-waster. Don’t even bother with this.    \\n",
            "date": "2016-07-06T23:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 223359,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MadHatter90",
                "username": "MadHatter90"
            },
            "url": "https://myanimelist.net/reviews.php?id=223359"
        },
        {
            "content": "To start off, I give this anime a 9. Actually, five 9s.\r\nAs in NEIN NEIN NEIN NEIN NEIN.\r\nNow that we got the offensive reference out of the way, let me go and actually \"review\" the anime!\r\nSTORY! (1)\r\nOkay. I think anyone who watched IS noticed that it's pretty much a carbon copy. It wears the \"generic\" stamp on its forehead. There's literally nothing good about it. Maybe it could be used as a torture method. Oh well. \r\nART! (1)\r\nMeh. I've seen some anime with worse animation. That doesn't change the fact that the animation is drab and awful. It's like it's trying to alienate itself fromthe other animes of this season, which are *mostly* good. \\n\\n\r\nSOUND! (1)\\n\\n\r\nOh god. My ears ruptured almost at one point, I don't think I should review this part much. Especially because of the possible bias due to health issues caused by it. I do not know how does one manage to make an anime sound like a vuvuzela attached to an elephant dying of flatulence. \\n\\n\r\nCHARACTER! (-infinity)\\n\\n\r\nOh god. I'm not even gonna try to list all the cliches with the characters. Incest imoutos, tsunderes, childhood friend that has a crush on MC, retarded main who can't read the bloody situation, dark past... and that's just scratching the surface of this turd. It's not even a turd, it's a shit show of shits, playing \"singing in the rain\" in a pile of boogers. \\n\\n\r\nENJOYMENT! (10/10)\\n\\n\r\nOf course, I'm being sarcastic, in that lovably misanthropic way of mine. Seriously tho, I'd rather get water tortured, have my nails pulled out and my balls set on fire than watch this a 2nd time. But me, being a pro reviewer in not so much my prime as much as I won't be bothered later, will watch this till end, and you better bloody appreciate it. Because hanging yourself on christmas is slightly less depressing than watching this.\\n\r\nEither way, I watched it just to keep my edge as a reviewer. Reasons why I heavily dislike the anime is everything listed above.\\n\\n\r\nOVERALL! (1)\\n\\n\r\nIf this anime had an original idea in its head, it would've thought it's a tumor. Ironically, the anime itself is the tumor, so please, if you like your brain matter, SKIP IT. \\n\\n\r\nAgain, there is NOTHING good about this anime. You can belch the facts that this is a harem, and it might not fit my tastes, but god damn, I've watched harem, ecchi, and all kind of cancer genres, and some were done fairly good (see Rakudai Kishi no Eiyuutan for a good ecchi/harem anime).\\n",
            "date": "2016-07-01T17:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 222664,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ThunderClap448",
                "username": "ThunderClap448"
            },
            "url": "https://myanimelist.net/reviews.php?id=222664"
        },
        {
            "content": "The best part about watching an anime is being able to dive into the show and explore its world and characters. It is very hard to do anything like that when the anime in question isn't able to distinguish itself from countless other shows. Basically there is no reason for this show to exist or for people to watch it because there are many other shows that do the exact same thing that this show aims to do but 30 times better. \r\n Getting on to the \"story\", we have a generic protagonist with a generic harem going a generic monster hunting school. The storyis god awful as it doesn't know where it is going, it is uninteresting, its boring, its dull, and its just full of plot convince. It has been done before and done better.\\n\r\n 1/10 plot \\n\\n\r\n The art isn't too bad but I would say it goes to waste with terrible action direction and directing. The character designs are okay but what brings them down from being visually appealing is their outfits. \\n\r\n 4/10\\n\\n\r\n The sound is just like the art and its not too bad but it doesn't stick out or make any impact in the show. The voice acting can range from pretty good to just plain annoying.\\n\r\n 4/10\\n\\n\r\n The worst part of the show is the characters due to pandering and wish fulfillment. This show makes the characters do stupid things just to pander to the audience. all of the characters love the main character to pander. This doesn't help with the characters and the \"tense\" scenes. Also, the character development is nearly non-existent. When they do give character development, its often in a confusing and boring. \\n\r\n 1/10\\n\\n\r\n I think I didn't enjoy one scene in this show. I think I just want to pretend I haven't seen this show. \\n\r\n 1/10",
            "date": "2016-06-29T11:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 222352,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4815967.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/arrays",
                "username": "arrays"
            },
            "url": "https://myanimelist.net/reviews.php?id=222352"
        },
        {
            "content": "[this is my first review. There are some minor spoilers from the first episode]\r\nOh boy... You know, there are 4 kinds of anime: \r\n1- there are great animes that make you so depressed because you just finished watching it and there's nothing more left to watch; \r\n2- there are good anime that are enjoyable and worth your precious time; \r\n3- there are bad anime that even though they may have not been enjoyable, they had something going on for them;\r\n4- and then there are... \"Things\"... Anime so terrible that makes one question if quality control is even a thing in Japan, or if the otakuculture will buy anything as long there are cute girls in the show.\\n\\n\r\nAnd you see, Hundred is the 4th kind. When I saw the trailer, it immediately reminded me of Infinite Stratos (another anime I'm not very fond off). Jokingly, I said in the comments \"Welp, it must be a retake on the IS idea, so it can't be worse\".\\n\\n\r\nIt managed to prove me wrong.\\n\\n\r\nStory: 1/10 - Absolutely pathetic. The only story here is the prologue, the events that set up the world and environment for the MC. As soon as the anime finishes explaining what happened prior to the present events, the plot stops, literally. This show is pure fan-service where everything was set up so the MC can enjoy school life as a mecha pilot. Everything that happened in the past will not be mentioned again in the anime or used for plot development.\\n\\n\r\nSo basically, it did the same thing as IS. Problem is, when I say \"it did the same thing\", I mean it did everything IS did. I repeat, this show managed to copy another generic show and be even more generic.\\n\\n\r\nThe writer either was pressured to cook something in one hour, or he is absolutely incompetent and should find a new line of work.\\n\\n\r\nArt/animation: 5/10 - Not much to say here. I'm not picky with art so I admit I'm not the best judge, but I can honestly say it's not bad or good. It's average. \\n\\n\r\nSound: 5/10 - Again, average. There was no song or background soundtrack that got my atention, and there was also no terrible OST that made me wish to tear off my ears. So average.\\n\\n\r\nCharacter: 1/10 - Like the story, pathetic. Every single character is bland and one sided. You see a tsundere? Well, that's that. No secret personality, no personal objectives or wishes. It's a marionette that talks, nothing else.\\n\\n\r\nEvery-single-one is retarded. Everyone. Why? Well, one of the first examples is no one being able to notice that \"Emile\" is a girl (don't worry, it's not a spoiler, you can clearly see at first glance that he's a girl (if you can't... I don't really know what to tell you without sounding rude dude......)). One could argue that Emile aspect is just poor design from the artists, but the problem is that in many moments, Emile talks and acts like a girl in front of everyone, and they STILL think he's a guy! I'm not kidding when I say that in latter episodes it reaches to a point that he would have to undress in front of everyone if he wanted to prove he's a girl.\\n\\n\r\nThe prez (another heroine) is equally retarded (she's supposed to be intelligent btw). Supposedly, pilots are rare and valuable, and what does she do when 2 pilots are late for the ceremony? Warn them or give them some kind of punishment? Nope, expel them. Valuable pilots that are rare, for being late (let that sink in for a bit). Oh, and to put the cherry on top of the cake? She's challenges the MC for no real reason and use those 2 pilots as the prize.\\n\\n\r\nAnd what irks me the most is that the main heroine is an obvious copy-paste of Charlotte from Infinite Stratos. Charlotte, for me, was literally the only nice thing IS had going for itself (for 1 or 2 episodes, after that she joined the flock of bland characters), and even then Hundred wasn't able to copy her right. Why? Well, Charlotte sadly wasn't explored as a character, but at least for one episode she sparked the idea that she could be interesting, she was promising. The main heroine in Hundred is basically Charlotte after losing her status as promising.\\n\\n\r\nOh, and do you know how in some animes the bad guys don't move or attack while the good guys talk with each other? Well, this anime takes it to the extremes, where the enemies literally stay put for several minutes while our main characters talk with each other. They could literally bring a tea set with them and drink some tea in front of the enemies.\\n\\n\r\nEnjoyment: 1/10 - Honestly? Idk how or why I watched 10 episodes. Well, not really tbh, at some point I started skipping the episodes. Once a boring dialogue started, I just skipped 3 or 4 minutes.\\n\\n\r\nOverall: 2/10- Stay away. No I mean, seriously. If you want boobs or ecchi, there are much better options, go look for them. Don't be a masochist like me and watch this \"thing\".\\n",
            "date": "2016-06-26T20:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 222114,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3740445.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JCAPER",
                "username": "JCAPER"
            },
            "url": "https://myanimelist.net/reviews.php?id=222114"
        }
    ]
]