[
    [
        {
            "content": "Pokémon Diamond and Pearl. Another continuation of the Pokémon franchise, but, believe me, don't get your hopes up - if you haven't tried to watch it already. Let's face it: THe Pokémon anime isn't great. It's not good. It's bad. D&P has its improvements over its predecessors, sure, but it's still worse. \r\nSo, if yo usat a group of people inside a clsoed room, with monitoers covering the walls, showing nostop pokémon, what would the result be? Eyes clawed out? Ears bit off? Or maybe everyone would believe that if they just went on a journey by foot, every day they would meet a newperson or creature, undoubtedly befriending them, only to leave them in the evening - for good. And of course, only after fighting off bad guys who does the same day after day, after day. After day. \\n\\n\r\nYup, that's pokémon D&P in a nutshell. Horrible writing, the same three or four formulas used over and over again (gym battle/training, rival episode, character of the day, contest/training), the same running gags (Fukamaru hitting Pochama with Draco Meteor, Team Rocket's neverending appearances, and. so. on.) If lather, rinse, repeat didn't sit in your head before, it will after watching pokémon.\\n\\n\r\nOf course, for the long-time-fans, here's always soalce to find in its improvements. The very subpar animation is a little less subpar (well, with the raised standards of \"par\" oveer the last century, maybe it's not really any less subpar), the battles are more entertaining to watch, the characters are, well, a little less flat and annoying (I'm among those who abhored Kasumi's existence), and the contests, tween girl-appealing as they might be, offers a, uh, more aesthetic variant of pokémon battles.\\n\\n\r\nIf you don't look in comparison however, there's no light at the end of the tunnel. Characters, flat (but no Kasumi!). Plot, horrible, repetitive and everything's way too long (180 episodes and counting in Sinnoh alone, compared to the 80 episodes of Kanto). Animation, bad (God, I wish it'd look a lot more like Bleach at its peak). Music, -- oh, that I didn't discuss.\\n\\n\r\nThe soundtrack is a mixed boat, same for voice acting. To specify, the mix doesn't stem from one character's seiyuu being better than another, but the difference between original and dub. The dub is so substantial in the pokémon franchise that I can't really omit that part in a review, even though I don't really watch it. But anyway! The seiyuu do a fair enough job of the characters. Nothing outstanding though. The English VA's however, oh God. That's Star Wars Holiday Special-bad. And that's almost where the soundtrack in the dub is, too. Iffy themes which you've heard over and over for 600+ episodes of pokémon. But that's where the Japanese version is good; the music, although much from the video games, sound better, fits better and doesn't sound as old and repeated as the dub's themes.\\n\\n\r\nFor me, and probably many, one of the few things (aside nostalgia, devotion and fanboy/girl-sim) that really keeps them watching is Team Rocket. The chemistry between them is really amusing, and while their plots and introduction themes are as boring as ever, their speech and mannerism are quite funny still. Aside that, it's all for the kids, this one. Yup, it keeps them hooked, and does it well. Pokémon is, after all, a kids' show, so I'm not that annoyed by its lack of, well, anything. For what it's worth, its persistent themes of friendship, hard work and trust does appeal to kids in a good way, and parents can rest assured that Satoshi, Pikachu and the gang will take their kids through a friendly and safe thirty minutes of action.",
            "date": "2010-05-16T06:13:00+00:00",
            "helpful_count": 59,
            "mal_id": 26104,
            "reviewer": {
                "episodes_seen": 159,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11081.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheLlama",
                "username": "TheLlama"
            },
            "url": "https://myanimelist.net/reviews.php?id=26104"
        },
        {
            "content": "Let's talk about art first. I watched pokemon from the first episode when it came out all those years ago. Compared to the art back then, DP (diamond and pearl...as im sure you know) is amazing. I remember one episode where the screen just flashed red and blue for about ten minutes and pikachu's thunderbolt was just two dull yellow zigzags...i think it was the seizure one in the first few seasons; but now it's improved so much in so many areas, too many infact, so i'm not going to list them all.\r\nI don't really think I should comment on sound since I watched thedubbed version and not the subbed/raw but I will anyway, just a little bit. I thought the voices have deteriorate since pokemon switched companies when May, or Haruka, was still around. But i think everyone had gotten used to the new deeper voice of Ash, or Satoshi. The music, both japanese and english, for DP is quite catchy too and the OST used are used in jus the right places. I hate Staravia's cry though...no offence to the person who does the voice but it just irritates me.\\n\\n\r\nThe characters for pokemon are a little bit hard to rate. We still have Ash and Brock, or Takashi, but we have a new female prtangonist: Dawn, Hikari(I think...check synopsis). Ash is still the competitive type and Brock is still flocking to every beautiful woman's side to propose a date. Dawn is...very hard to describe without giving away spoilers, but she gives a sort of fresh sensation to the group which neither May or Misty(I hav not idea what she's called in japanese and i'm not googling it) gave.\\n\\n\r\nThe storyline's pretty much the same as any other pokemon series so not much there...and Ash has new pokemons except (big shock?no). I think he kept Pikachu plus another one this time though...intereesting...\\n\\n\r\nIf you liked the other pokemon series you're sure to like this one...unless you're a strong believer in the Ash and May love things that are going around on the internet. But even you guys, advanceshippers get a pleasant surprise in Diamond and Pearl.",
            "date": "2009-02-03T07:24:00+00:00",
            "helpful_count": 39,
            "mal_id": 12087,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Etopenguin",
                "username": "Etopenguin"
            },
            "url": "https://myanimelist.net/reviews.php?id=12087"
        },
        {
            "content": "I'm not very good at writing professional looking reviews. But I like this season because this is the season that made me get into Pokemon again. When I was very young. I like many kids watched Pokemon. But over the years, I didn't watch it anymore. At age 21 or 22, I decided to look up Pokemon online. One of the 1st eps I watched was from Diamond & Pearl. I did get confused cause I saw Dawn. And I knew that I missed alot. So I started from ep 1 of the Pokemon series. And watched every show and movie. And ever since Ivebeen hooked!",
            "date": "2012-01-03T20:40:00+00:00",
            "helpful_count": 17,
            "mal_id": 50889,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1087403.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/princessdawn982",
                "username": "princessdawn982"
            },
            "url": "https://myanimelist.net/reviews.php?id=50889"
        },
        {
            "content": "I'm going to start off my review by stating that I will treat Pokemon D&P as a full flege anime and negate from the games and other chilhood influences. At this point it should be noted that Pokemon D&P is apart of the long running Pokemon FRANCHISE. A franchise that has a basic formula. That formula is aimed towards kids so there will be a lot childlike situations and themes. It just so happens that that formula continues to be reused time after time again. Its old to a lot of veteran viewers but new to the younger and newer generations. However, despite D&P beinga \"rehash\", it still finds it's place amongst the other series. \\n\\n\r\nStory: Satoshi or Ash for us American viewers is traveling by himself as he makes his way to the Sinnoh region. He eventully meets up with his long time traveling friend Takeshi/Brock and a new friend Hikari/Dawn. Like the other series, Ash along with his friends explore the area they are currently in while seeing and capturing new Pokemon, participate in Gym battles, make new friends and rivals, battle Team Rocket all while learning about growing up, friendship and other themes of such nature. \\n\\n\r\nArt: Compared to the older series, D&P is a step up in the art department. Of course the original has a nostalgic touch to it and Advance Generation has that sequal value but D&P is very vibrant in color. The environment is abosulutely beautiful and the way that some of the attcks look are perfect! It appears as if some of the attacks have texture to them.  Somthing the recent series have picked up and started doing. the characters are drawn well. Although Ash and Dawn are 10 they very well look like they are at least 13 giving off a more mature appeal.\\n\\n\r\nSound: The music is good. It's not \"rock your socks off\" good but for its target audience, it gets the job done. A lot of the battle and travel music returns from the previous shows so if your a fan of those, you're in for a treat. The sound effects are good like the colision of attacks or something simple like the characters walking.\\n\\n\r\nCharacter: Out of all the catergories in this review, the character catergory got the lowest rate. Ash and Brock are pretty much the same. They don't develop much however the introduction of the Sinnoh rival Shinji/Paul does add a bit of flare to something that was very well missing in Ash's life after the absence of Gary. Paul did in fact challenge Ash. I won't say that he helped Ash develop his style of battling. That actually came over the course of the series but Paul was serious about his job as a trainer. He was a tad bit cliche with the whole \"pokemon are tools\" outlook but nonetheless he gave Ash a run for his money. I was a bit disappointed with Dawn. Despite being the female lead to level out the male ratio, she didn't do much for team development and was a bit of a wasted character. Like her previous female lead, Haruka/May, Dawn is a Pokemon Coordinator. The main difference is that Dawn starts off as a coordinator while May grew into it. Also Dawn is the child of a famous coordinator. But that's really it. Dawn isn't that great at coordinating (at first) and the series introduces her as a rookie. She pretty much was in the same spot as May.  When it comes to the overall character of Dawn, she felt forced. Forced to be liked because she was a good guy. Forced because she had a dream to be a coordinator. Forced because when she felt sad, the viewers ahd to feel sad as well. Honestly, I would've liked Dawn more if she was already somewhat advanced in her craft similar to Misty. The dynamic would've changed greatly if Dawn wasn't your avergae Pokemon rookie. The coordinator thing has already been done and it doesn't help that the previous female lead was more profound in the skill than the current. The rest of the characters were either short lived or not memorable. Did I mention that Team Rocket is still trying to capture Pikachu?\\n\\n\r\nEnjoyment: I enjoyed D&P fairly well. As expected, things have changed but it's a new enviornment with the same fundamentals.\\n\\n\r\nOverall: Pokemon D&P is an upgrade in the battle sequences, the story and is overall is visually stunning. Unfortunately the characters were lacking. Paul was an interesting add to the series but Dawn was a step backwards from the other two female leads especailly since she gave no reason to be liked or rooted for other than the fact that the audience is SUPPOSE to like and root for her. However if you've been riding the Pokemon train this long, why stop here? It's a decent addition to the series and it came at a good time where things were getting stale. Pokemon D&P defintely holds a place in the Pokemon family tree and is sure to be liked by the younger generations and the veterans who know how the Pokemon formula goes.\\n",
            "date": "2014-06-22T15:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 148079,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3859435.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JordiTaylor",
                "username": "JordiTaylor"
            },
            "url": "https://myanimelist.net/reviews.php?id=148079"
        },
        {
            "content": "Right, to start off with, im 18, i think thats a pretty huge clue as to why i rated this anime so low, as a child pokemon was the best thing on TV, probably because when your 7, you dont really watch something and question each characters intergrity, like how ash has so many good pokemon in his PC yet he continually chooses to shun them in a box and start again from scratch, i mean come on, as a fellow pokemon player it really pisses me off watching someone continually losing to emotionally unstable emos as he tries to make his way to theelite four, kinda ironic that Ash's whole ethos is to raise pokemon through love and affection yet hes got about 100 neglected pokemon at home...someone dropped the ball there ¬_¬  but i digress, pokemon can be quite enjoyable at times but its not really an anime you would sit down and watch expecting it to go somewhere. Its not a terrible show, and im sure that the child in you might like it, but thats as far as it goes.\\n\\n\r\nA SIDENOTE:\\n\r\nOne of the most annoying things about the entire anime is whats the deal with pikachu!?! i mean common, why the fuck is he so goddamn shit!?!? if you've played pokemon yellow then ud know that pikachu really isnt going to lose against some lvl 15 some kid caught 2 days ago, i mean, is he on crack? does he have some disability that we dont know about? Theoretically, pikachu should be such a high level by now that he can afford to retire from being a pokemon, buy some pokeballs, catch some pokemon and become a trainer himself because when you think about it, the whole things just a complete mind fuck.\\n\\n",
            "date": "2011-09-08T10:41:00+00:00",
            "helpful_count": 13,
            "mal_id": 42963,
            "reviewer": {
                "episodes_seen": 30,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501732.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/deadlysoups",
                "username": "deadlysoups"
            },
            "url": "https://myanimelist.net/reviews.php?id=42963"
        },
        {
            "content": "Pokemon: Diamond and Pearl anime was definitely an enjoyable series for me. I liked all the new Pokemon introduced in Sinnoh with appearances from some of the more classics too. This is the one series where I felt Ash/Satoshi did his best battling wise. A great aspect to this was his rival, Paul/Shinji. The two had completely different views on how they were training their Pokemon and battling. It led to a great strong rivalry and was the main reason he did so well. The gym battles were great, team rocket was still funny as ever although i wish they didn't always appear in everyepisode. The plot with Team Galactic was entertaining. Now for my favorite part, the Sinnoh league. This was by far the best league Ash battled well in, and it's also the first league where most of his Pokemon team was fully evolved with the exception of Buizel and Gibble but they were still awesome. The strategies used were amazing especially on Ash's part. The final battle with Paul was simply great! the one thing I didn't like was how the league ended. In my opinion, I believe the anime should have ended with this series because of good things were with it. Overall an enjoyable series for me.",
            "date": "2015-08-22T15:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 196780,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4760905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/terminador_2397",
                "username": "terminador_2397"
            },
            "url": "https://myanimelist.net/reviews.php?id=196780"
        },
        {
            "content": "A repeated plot but a more serious tone has been added in DP.  Some 'violence' has been added, the new villain for example doesn't seem to care to much what happens to Ash (main character)\r\nThe art is sometimes very good (movies, special episodes etc.) but it can also really suck. It just depends what team does the episode (check bulbapedia)\r\nSounds alright, good background music in japanese version. \r\nThe characters are more developped and they're not all 'black and white' like they used to be.\r\nNice anime to watch, not too serious but can be when needed to.\r\nOverall nice, no real action, the plot is spreadover 200+ episodes with mostly fillers. Art's not always the best but major episodes are mostly done nicely. Pokemon USA doesn't edit episodes any more so there isn't that much difference in dialogue and plot.\\n\\n\r\nI personally watch mostly the more serious episodes but the fillers are more humourous. Give it a try, it's worth it.\\n\\n\\n\\n",
            "date": "2008-12-19T06:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 10484,
            "reviewer": {
                "episodes_seen": 500,
                "image_url": "https://cdn.myanimelist.net/images/userimages/113107.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/abridgedgirly",
                "username": "abridgedgirly"
            },
            "url": "https://myanimelist.net/reviews.php?id=10484"
        },
        {
            "content": "First of all, here are two rules to understand the Pokemon anime :\r\n1) If you watched the dub, you did NOT truly watch the anime.\r\n2) Each Pokemon \"cycle\" is a different style of anime : different narrative, and different art style.\r\nPokemon Diamond&Pearl is an excellent anime. It has deep stories, it has great fights, and it has even less fillers than Naruto or Bleach.\r\nSTORY\r\nDP starts by introducing Hikari, who wants to become a Top Coordinator as her mother was. But as she starts her journey, she'll realize she may not have the guts to succeed. Indeed, she will often fail, which will make her wonderif she is fit to be a Coordinator.\\n\\n\r\nAsh and Pikachu, of course, come back as the MCs. Ash still aims to win a Pokemon League, only this time, he has a lot of experience: in this series, Ash does feel strong. He knows what he's doing, doesn't do much mistakes, knows how to raise his Pokemon.\\n\r\nHowever, he will be facing someone even more skilled as him: Shinji, who quickly appears to be an utter assh*le, even with his own Pokemon. Through the whole season, Ash and Shinji will fight whenever they come across each other. But everytime they clash, they learn from each other, and with time they learn to respect each other despite each's flaws.\\n\\n\r\nAside from that, the story has a perfect narrative: it has a lot of different stories (Ash's League, Hikari's Contests, Team Galactic's plot, and plenty others), and each story progresses constantly, which makes them interesting to follow.\\n\\n\r\nBut more importantly, the series is deep. It develops a very philosophical theme : the question of identity. Yes, you heard right.\\n\\n\r\nBecause all the characters (including human AND Pokemon) have a story that revolves around the idea of discovering one's self. Ash and Shinji wonder what a true Trainer is ; Hikari wonders if she's fit for the role of Coordinator ; Brock (finally) wonders what job he should take ; Pikachu is once again faced with the idea of evolving to become stronger ; ...\\n\r\nALL the characters' stories go in the same direction: they are all faced with an identity crisis.\\n\\n\\n\\n\r\nART\\n\r\nPokemon DP didn't start really good. It was better than the previous Pokemon anime, but still not very good. Luckily, in the middle, they went HD ; starting from then, it became way more amazing.\\n\\n\r\nThe animation was cool, although not excellent. At least it was dynamic, which made for very good fights.\\n\\n\\n\\n\r\nSOUND\\n\r\nThe OST in the original version is awesome. It takes the themes of the games, but make an orchestral version of them, which sounds way better.\\n\r\nIt also creates its own themes, which are very cool.\\n\\n\r\nThe openings are also great, especially the first one, which I can't even describe, it's just... unique.\\n\\n\\n\\n\r\nCHARACTERS\\n\r\nThe characters are what makes this series stand out.\\n\r\nAsh has finally become an expert in Pokemon. While he does do some mistakes, they are now very rare, and he makes up for it with brillant and creative tactics.\\n\\n\r\nShinji was an absolute delight, as he is a complete assh*le, which makes him really stand out as a character in this show. He is also god damn powerful, which makes him the perfect rival.\\n\\n\r\nWhile Ash makes friendship a priority, Shinji only cares about winning and doesn't care about his Pokemon. Two opposite philosophies. Of course, Shinji will learn that he is wrong, right?\\n\r\nWELL, NO! Ash and Shinji's relationship is called a DUALITY: their visions, although opposite, are actually complementary.\\n\r\nWhile they can't stand each other because of their opposite points of view, each will learn from the other and each will grow stronger thanks to the other.\\n\r\nLong story short, their relationship was so damn interesting to follow!\\n\\n\r\nAside from these two, I also loved Hikari. The fact that she keeps losing in Contests makes her really interesting, as she has a lot of room for progress (and she does progress across this series).\\n\\n\\n\r\nENJOYMENT\\n\r\nPokemon DP is an absolute delight. This show is deep (RIP to all those who couldn't even understand that), the characters are very interesting (especially Shinji and his relationship with Ash), the fights were very cool (the Sinnoh League is full of memorable battles), the show is very serious and not that cheesy.",
            "date": "2018-12-06T07:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 295346,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7223606.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dante012",
                "username": "Dante012"
            },
            "url": "https://myanimelist.net/reviews.php?id=295346"
        },
        {
            "content": "There is so much wrong with the Pokemon Diamond & Pearl anime in every general way. Such cringe worthy dialogue and an awful attempt to make Pokemon's fan base even more childish then ever before. While also repeating the same formula over and over... The original Pokemon anime did so much for me as a child. Now we already know the video games were a perfect match made in heaven for both adults and children. While some people thought the Pokemon anime was take it or leave for many of us who did watch it, We enjoyed it to death. It had a lot ofgreat moments, some awesome character growth and of course seeing Ash mature even more. Also I watched the Pokemon anime for a good solid 9 years. Until this came out...\\n\\n\r\nPokemon Diamond and Pearl attempt to continue the anime even more is just painful for me. Ash still continues his own quest to become a Pokemon master... Something we have been seeing for nearly 10 Years at that point when this arc was new. He's joined by Brock once again and the newcomer Dawn. But all 3 characters are quite annoying to me. The growth and character development is so lackluster it's not even funny. The first 3 anime arcs did so much better for growth when it came to it's characters. I feel like Ash is back at square one once again despite the new region. Also some of the new characters thrown in the anime are just so unlikeable. The storyline is almost non existent at the point in time. Pokemon never had the deepest amount of story but this is just lazy.\\n\\n\r\nThe only thing in my opinion that saves Pokemon Diamond and Pearl is the art style. Seriously it is the best Pokemon has ever looked in so long. Really everything looks so well in the anime and the art style might have been the best at the time. Also the battles look great but sometimes you'll see the same thing over and over the deeper you dig into the anime. Music is also very bland as nothing sticks in your head. Most of the original voice actors have also been replaced but this happened in the Battle Frontier arc before it. Very poor voice acting and I must say it's dialogue is very cringe worthy most of the part. Also it's seems that the 4Kids voice actors fitted their roles more then the Pokemon USA dub. But this is just my opinion. \\n\\n\r\nBut also here's how a typical episode goes. Ash and Co wander through the area, A Person needs help, They tell some story that the audience doesn't care about, They go help the person, Team Rocket gets involved, They battle Team Rocket, BLASTING OFF AGAIN!!!!!  Stupid Conclusion. Rinse and Repeat asides from some of the gym battles and the final Pokemon league. Seriously this has gone on too much... It's also an attempt to drag on the anime even more which makes this filler so painful.\\n\\n\r\nThere was only one villain in the anime I also found interesting BTW. She was a Pokemon Hunter named J who shows no remorse for any Pokemon. It was the only thing that got me interested in Diamond and Pearl. As she actually tries to kill Ash at one point. The sad part is she is killed off about Midway through the anime. Destroying any promise for that the rest of the anime would be enjoyable. Seriously it's the only thing I found worthwhile in Diamond and Pearl. But other then that the rest of the villains in the Pokemon anime are typical. The other villains are Team Galactic and they are typical. Just a bunch of evil people trying to \"Make The World Better\"! Also of course the Team Rocket trio makes multiple attempts to make Diamond and Pearl funny but whatever... They are just there for stupid attempt at humor or of course breaking the fourth wall... Once again putting Pokemon into it's kiddy stigma that it's always gotten.\\n\\n\r\nOverall Pokemon Diamond & Pearl is just something I should have stopped watching. Seriously this is just a painful way to show off the Pokemon anime. The anime reached it's peak but this is a sad showing. The non existent storyline, awful character development and lack of anything enjoyable make this hard to stomach. Asides from one villain Pokemon Diamond and Pearl has lost so much from me. But the more the  Pokemon anime continues the worse it will go on in my opinion.",
            "date": "2014-04-14T21:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 139963,
            "reviewer": {
                "episodes_seen": 73,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3701995.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/3rdStrikeFreak",
                "username": "3rdStrikeFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=139963"
        },
        {
            "content": "For starters, as a Pokemon series, it had a lot to live up to. It had to be more developed than the previous two series that came before it. It had to have its own identity. It also had to have its own look. To be honest, this series did the most right. In fact, I would go and say THIS is the series to study if you're going to make subsequent shows. AVOID BEST WISHES LIKE THE PLAGUE! (Okay, watch the highlights, but that's all, to get some continuity.)\r\nDespite a dash of forced mascot syndrome, see Piplup for that, the characters chosen for thecast were overall very charming and lovable. \\n\\n\r\nTwo established characters of the series got very satisfying character development, new characters proved their worth on many occasions, and EVERY significant human character in the games were showcased here with the exception of Lucas and key Frontier Brains.\\n\\n\r\nAsh and Dawn - our stars this time - in this particular iteration demonstrate a connection that benefit the other almost symbiotically where in the other series it was one-sided (May) or not at all (Iris).\\n\\n\r\nThe pokemon of the show had their share of nuanced character development as well which some had extraordinary results (Chimchar, without a doubt) and some not so much (a certain Grass type which will not be named). You'll have to see for yourself. \\n\\n\r\nSo as for my scores, I gave this show a 9 in story because of its consistency and polish, though I'm not happy that some pokemon got the shaft in the long run. The obstacles in the story and the battles were all top notch though. The first gym battle was actually pretty awesome for starters and each of the contests have merit in their own right. The fact this series ties BEAUTIFULLY into a narrative for a Johto reunion of sorts is also pretty awesome.\\n\r\nIt got 9 in art because the battles are gorgeous! But the animation can be inconsistent at times.\\n\r\n9, if you're watching the Sub, for the music - it's fantastic! The dub's music, however, is rather cumbersome considering how some tracks just don't mesh well in the overall scene. \\n\r\nThe characters got a 9, because their representation on screen were VERY faithful to the in-game counterparts if they had one. Plus, they were not completely annoying like in other generations. Some characters were enhanced like Gligar and Plusle/Minun who had incredible spirit and flexibility. I can say that each pokemon got a fair and just amount of screen time.\\n\r\nMy enjoyment was a 9, because of how everything just fit together so nicely and how memorable the battles were as a whole.\\n\r\nMy overall was a 9, you'll never see a Pokemon series that used what its games had to this degree possibly ever again.",
            "date": "2015-02-17T03:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 180605,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2868235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/realar",
                "username": "realar"
            },
            "url": "https://myanimelist.net/reviews.php?id=180605"
        },
        {
            "content": "It's another sequel to the pokemon story but again new pokemon and new people to meet...\r\nI might be a little too old for it, but it never bores...\r\nPokemon is still a great standing anime and has a huge world..\r\nI love anime and fantasy elements and these elements are in pokemon.\r\nAlso since the first season pokemon has improved a lot.\r\nI still like it and I hope you do 2^^",
            "date": "2010-11-15T02:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 32066,
            "reviewer": {
                "episodes_seen": 123,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395820.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jelmpi",
                "username": "jelmpi"
            },
            "url": "https://myanimelist.net/reviews.php?id=32066"
        },
        {
            "content": "Alright, let me start off by saying, the Diamond and Pearl Saga, with full honesty, was the best developed and most promising series of all of its previous titles. Don't really depend on those nostalgic views of \"the original being best\" and all, all Pokemon Sagas were awesome, all in different ways. For me however, Diamond and Pearl ranks #1. \r\nFor the story element, Pokemon still sticks with the repetitive pattern except for some minor diversions. That is to say, if I would rate the story, I would down rate it for the repetition BUT I would still over rate it for the enjoyment. Imean, everyone else is demanding the same old classic Pokemon...and well...it is still here, and still delivers. It is still enjoyable and never gets old (to certain extents. So, 8/10 its pretty decent backed up with furthermore awesome elements.\\n\\n\r\nI didn't notice A HUGE and Dramatic difference in the art since the advanced generation, but that doesn't mean the art is bad. In the contrary, it's just perfect as always. Pokemons look great and so does the characters and that is a 10\\n\\n\r\nSounds as well never lets you down. I don't see getting rid of the 4Kids Dub as a wrong approach. In fact, the new dubbing group are doing pretty well, the sounds were just great and so were the music. Rating it 9 though since some Pokemon voices...were really disturbing... \\n\\n\r\nCharacters are definitely the reason I am urging people to watch the DP saga over all the others. The characters were well made. We finally get to see a well developed Ash, just look at him at the Sinnoh League! He has never done better. He might have been notched down a bit but he recovered very soon and went on as a really cool experienced trainer. Besides Ash we have his female companion Dawn. And trust me, she is one of the most lovable characters you are gonna meet. She receives a huge spot light and she gets tons of development. The interaction between both Ash and Dawn is what makes their character quite lively. Brock thankfully stuck with Ash with his usual funny thoughts. Never gets old, in fact, he always gets new ways of being handled by the girls. Team Rocket were funny as hell as well so..can't really comment more on these guys. But most importantly, we get to witness a ferocious rival. And extremely well handled rival. Basically, a meanie, he is a skilled trainer who gained much of experience. His background story also is revealed, allowing us to witness more of his depth. He was literary the toughest and thorough of all rivals. Pure excellence, and the best rivalry ever.\\n\\n\r\nAs for the Enjoyment: I personally couldn't wait to watch every single episode of the series. I loved every single one of them and juiced out all the enjoyment out of them. Such an Enjoyable show backed up amazing characters and decent storyboard. Never seen better.\\n\\n\r\nAs overall, I give it 9/10, however I am probably rating this relative to all Pokemon Generations rather than Animes in general. Diamond and Pearl, a good story, EXCELLENT characters, Great sounds as always..and the result: Another promising generation with a different flavor, Huge thanks to the developers of this series and for the effort they have put on it.",
            "date": "2012-03-28T01:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 57207,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1121463.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Charicific",
                "username": "Charicific"
            },
            "url": "https://myanimelist.net/reviews.php?id=57207"
        },
        {
            "content": "let me be frank, this is the ONLY anime of the pokemon series that comes close to the spirit of the games its the definitive series as far 8 gym badges a rival you want to beat. it is everything the first 3 series's should have been Ash'es ideaology combining with paul's calculative ideaology is delightful Paul is a utalitarian in every sense of the word which conflicts with the gary stu -ness of ash which i cant stand i fucking hate ash \r\nDawn i like tho pipplup is an excellent character im admitdely bias but as some one who had been watching the seriesand playing the games since 1997 i NEVER thought we were gonna get an adaptation that even remotley resembled a what i would consider to be an authentic and genuine pokemon quest through a region. \\n\\n\r\nthis is the closest they ever come to fufilling that traditional formula and yes you still have to deal with BS you would never see in the game yes team rocket is there being team rocket yes its flawed but it is the best representation of pokemon imho pre Pokemon Sun and moon which changeed up the formula consideribly",
            "date": "2018-08-09T20:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 286053,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7061267.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kyoualter",
                "username": "kyoualter"
            },
            "url": "https://myanimelist.net/reviews.php?id=286053"
        },
        {
            "content": "A little late for the review for this series? No?\r\n\"When every life meets another lifes, something will be born\"\r\nTbh, I watched this one occasionally when it was just released, mostly only for the league. Now I watched the whole series and tried to watch the filler too. Before, I like this series because of Paul (Shinji) and Ash (Satoshi)'s chemistry, but now I like it more and more. And the quote above is really the whole plot of this series.\r\nI am a Pokemon fan for a long time, frankly speaking it would be my whole life, I'm now 18 and I watched it when Iwas 3. When I grow up I meet lots of friends thanks to this, but a bit lonely since I'm the only girl in the group, ha ha.\\n\\n\r\nDiamond and Pearl surely has improment in the art, but probably nothing compare to other series that time. I watched the sub so the musis is really brilliant, not because of the Op and Ed but because they offen used songs from past series in battle, in training, and it gets you really hyped! I'm not even kidding, the battle with Volkner or Paul, they were so beautifully done with the music. However, the one scene I like was when Grotel just evolved and the song \"because the sky was there\" started playing when it crying, like, I was almost crying for it too.\\n\\n\r\nI think the more interesting and makes DP unique is Ash and Paul' rivalry. While Gary is also really strong and a jerk, Paul is helly strong and a complete nemesis of Ash. In fact, Paul is a representation of all the gamers who release weak pokemon and catches the strong one, considering IVs and Moves, etc. Paul is trong, but the most interesting thing is his ideal clashes with Ash's. Ironically, his Japanese name means \"believe\", haha. This is not the battle between weak and strong like Gary and Ash, but a battle of ideals. Also, the fact that Shirona (Cynthia) and Reiji (Paul's brother) comments on their relationship with the phase I quoted makes it even more meaningful. Until now, even with XY, I still love their rivalry the most.\\n\\n\r\nThe fillers are also fun, I really like Brock and his Croagust, and LOL at them many times. People say those gags and cliche and boring, but I pwrsonally still like them, though I really hate how Team Rocket just interfere in the battle and stuff, though they make me laugh. And Dawn, oh boy she is the best, I like her even more than Misty - whole existence is for nothing, or May - who sometimes too emotional. Dawn tries her best, and even fight outside the contest many times. I also like how they portrayed Brock as a brother figure, he takes care of the group. Remember the Pachirisu episode? He went to buy medicine and Dawn together with Ash didn't know how to cure the fever and realized they were too dependent on Brock. That was lacking in the recent series with Dento and Clemont.\\n\\n\r\nAlso, Ash has so many powerhouses in this series! All of his pokemon evolved except Pikachu and Buizel! I almost thought Buizel would also evolve, but it already breaks the record! That was his most powerful team in the history until now. And with that he meets the plot device Tobia, but who cares? He makes it to the semi final for the first time! \\n\\n\r\nAsh is the most mature in this series with all the interesting strategies. There is also a little plot with Galactic Team with better build up than AquaMagma thing back then, but the ending is kinda unsatisfied.\\n\\n\r\nOverall, as a Pokemon fans I like it the best.\\n\\n\\n",
            "date": "2015-09-06T16:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 197974,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320833.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/glaceon_cute",
                "username": "glaceon_cute"
            },
            "url": "https://myanimelist.net/reviews.php?id=197974"
        },
        {
            "content": "I can say this for Pokémon, at least. It has gotten continually better with each season. I have no qualms about calling Diamond and Pearl my favorite season of Pokémon thus far. \r\nTo get my main concern going into it out of the way... The voice acting has improved since Battle Frontier. There were still a few instances where he sounded a little off-- particularly wherever laughter was required-- but Ash sounded perfectly listenable for the duration of Diamond and Pearl. But the improvements I really took note of had nothing to do with the voice acting...\r\nMy main praise for Advanced was the writers' timemanagement skills. Having a main character participating in contests on top of Ash competing for his gym badges did a lot to keep me invested. I understand that early on, each Pokémon got its own feature episode as a way to show them off to the fans, but frankly, mini plot after mini plot with only the rare gym battle or serious competition scattered in between got boring really quickly. I want the anime to be able to stand on its own and have its own goals, not serve as a functional Pokedex. I understand that this hasn't exactly changed in Diamond and Pearl, but they had a more creative way of doing it most of the time, weaving new Pokémon into plots or conflicts that were already important for other reasons. Along those lines, I think they did a great job with incorporating Team Galactic into the story. Their organization's goals somehow managed to be more extreme and less ridiculous than the Hoenn villains. And the episodes where that conflict reaches its climax were great. Honestly, they almost felt like a movie rather than just another string of episodes in the middle of the series. \\n\\n\r\nAt the end of 191 episodes, I'm left feeling like there's just so much to discuss, but Diamond and Pearl tried to do it all. Correcting all my complaints about the original series, it would seem. There were contests and gym battles and more actual legendaries and faux-legendary Pokémon than I could count. But most of all, there are so many characters in this season. And they may be minor characters, but they all recur often enough to feel important, and I really liked that. (As well as bringing back plenty of characters from past seasons, which helped to give some of those little mini adventure episodes more to feel invested in.) The Grand Festival and the Sinnoh League felt like full-fledged tournament arcs. (Very brief tournament arcs, but all the same.) I liked that our protagonists' major opponents were all people that we already knew and cared about. We already know Ash isn't going to go all the way, (because where is the story going to go if he ever succeeds in becoming a master?) but it was great to see him come out on top against all these other trainers that we've watched grow over the course of the series. Though I will say that his fight against his final opponent was bullshit... I don't mind that Ash lost, but Tobias was overpowered to hell and back, and it just wasn't satisfying to watch. \\n\\n\r\nBut speaking of satisfying victories... Paul was their next great improvement on the series. I have something to admit... I love Gary Oak as a character, but I was never able to take their 'rivalry' seriously, for a lot of reasons. For one... what reason did Ash really have to set his sights on Gary? Gary was the spoiled, arrogant jerk from his hometown. I get that... But, even though Gary does recur quite a bit throughout the original series, he doesn't often do much of importance. It kind of just felt like a reminder that his character was still there. And then, by the time Ash and Gary do finally face off, Gary already seems resigned to the idea that he might lose. And that it won't be a major thing if he does. I loved seeing Gary's character progress throughout the series, but he never felt like much of a rival. \\n\r\nWhich is not something I had to worry about with Paul. He and Ash had a very clear conflict-- two trainers with differing ideologies about how best to train their Pokémon and constantly going at each other to try and prove that their way is best. That's a proper rivalry to me. And, as frustrating as it was to see Ash repeatedly lose his head during their battles, I did like that they battled more than once before the final conflict in the Sinnoh League. I wish we got to see even more of Paul than we did... He grew a lot near the end too, and it's never exactly spelled out what really changed his mind. (After all, he still won all of his fights against Ash before that, and remained comfortably ahead throughout their respective journeys.) But if it wasn't clear in the little things-- no longer insulting his Pokémon when they failed-- it became obvious to me that he'd grown up a lot when he thanked Barry for a good battle. Considering Barry lost, that's something early-season Paul never would have acknowledged. \\n\\n\r\nWhich I guess leaves us with Dawn. I found the newest edition to Ash's traveling companions to be perfectly likable... She just didn't really bring anything new to the table. We've seen the journey of a contest coordinator before, although Dawn is competing for different reasons-- wanting to follow in her mother's footsteps. Personality-wise, Dawn felt like a female Ash. A perfectly likeable protagonist... she just doesn't really add anything to the group. She was, at least, the most active of all of Ash's friends so far-- always right there in the middle of the action with him, so I'll give her that. \\n\r\nAnd finally Brock who, if I remember correctly, has finally left the series for good. All I have to say... is that he better get a damn good replacement. It occurred to me somewhere around the middle of the season that Brock is in charge of literally all the practical aspects of traveling. He's their navigator, their chef, their doctor whenever one of the Pokémon gets sick, and it's implied that a lot of their everyday care is left up to him in general. I know even less about the next season and the new characters than I did going into this one, but I'm looking forward to seeing how Ash manages to function without him. \\n\\n\r\nHuh. Never thought I'd leave a Pokémon review as a string of gushing praises. But, as far as shows that I use to kill time go, Diamond and Pearl was really good. I can only hope Best Wishes (which feels really out of place as the name of a Pokémon season...) can keep this train moving along.",
            "date": "2017-08-17T13:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 255676,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5131864.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Duckielover151",
                "username": "Duckielover151"
            },
            "url": "https://myanimelist.net/reviews.php?id=255676"
        },
        {
            "content": "***This is a spoiler free review***\r\nIf any series has been done to death, Pokemon is usually one to come up. While I grew up watching the original Pokemon as a kid and have dabbed in Pokemon Advanced, I found myself wondering if anyone still likes the series for what it made its name for. I enjoyed Pokemon as a kid because it offered something I inspired; adventure. Ash as a main protagonist is not very appealing except for the fact that he never gives up and he can be too kind to others. That being said, someone told me that Diamond and Pearl is muchdifferent than the previous installments and that I should give it a try. So join me for a review that will help you figure out if Pokemon really needs to die.\\n\\n\r\nStory: 7/10\\n\\n\r\nSo as I stated before Pokemon has been around for a very long time and with time comes boredom if not done correctly. Pokemon Diamond and Pearl like the other series takes place in a whole new region with different Pokemon monsters and a new addition to the cast. With returning characters Ash and Brock, we see our first new character, Dawn who I surprisingly take a liking to. Put the characters off to side for now, the story is structured very similarly to the previous installments. The main goal for Ash is to get all the gym badges and challenge the Pokemon League. Dawn provides us with her goal of become a top coordinator in the Pokemon Contests which I actually liked watching. There is one very annoying thing that Pokemon unfortunately carries with itself at the start of every series. Ash always becomes and seems very week even though he emerges from the previous season a very strong trainer and with Pikachu at an unparallelled power level. He for some reason always gets owned by someone in the beginning of every season (Gary and Paul in this case) and becomes very weak. Thank god he soon gets his balls back and starts on his journey with Dawn and Brock. I am going to skip over all the gym and contest stuff as they are somewhat the same from previous series. The story (as in what is affecting the Pokemon world as a whole) is actually interesting as the new \"Bad Guys\" are Team Galactic. Unlike Team Rocket they harm others and have truly evil goals. The Team Rocket trio return with their comic relieve that I am to be honest a little bored of. The overall conflict between Ash and company versus Team Galactic is interesting when it happens and it doesn't affect the overall pace of the show. There is also the back and forth battles between Paul (the new rival) and Ash which become interesting as it shows the drastic difference between the personalities of Paul and Ash. We see Paul change due to his time around Ash as well as become a better person.\\n\\n\r\nAnimation: 6/10\\n\\n\r\nAlthough the animation has become better than the previous installments, it's still nothing to brag about. There are some beautiful scenes and spectacular battles but in some areas of the show its just barely passable. It's enough to keep you interested in the characters and the show but it won't pull over gorgeous scenes like in Final Fantasy: The Spirits Within. It does what it's supposed to do, get the point across and help progress the series.\\n\\n\r\n Sound: 7/10\\n\\n\r\n*Reviewed watching the English Dub*\\n\r\nSound is very important in the Pokemon series as each Pokemon has a distinctive cry and vocal mannerisms. The new Pokemon sound decent but some variations between different Pokemon of the same species would of been nice as every Pidgy sounds like every other Pidgy. The main characters are voiced by pretty good voice actors epically Dawn. The dialog matches the mood of the scenes quite well and provides a good experience.\\n\\n\r\nCharacters: 9/10\\n\\n\r\nWhat has every Pokemon series done right especially in this series? The characters have always been spot on for Pokemon and it doesn't disappoint here. Ash is still rash and doesn't let up for any challenges. Brock is still his pervy self and when needed, provides help and inspiration. Dawn is a lot like Ash in the sense that she doesn't back down and conquers everything she faces. One reason why the characters had such an impact on me is because I started to noticed that there was a very strong connection between Ash and Dawn. Not so much in a romantic sense but in many scenes there are sparks between them that make for some amazing moments. Dawn and Ash work so well with each other that at the moment at the end of the series where Ash and Brock leave to go back to Kanto, I genuinely felt sad for Dawn. Out of all the main female leads for Pokemon, I had the strongest liking for Dawn (even more so than May). Where Dawn shines the most is the movies related to this series as the same connection you see in the show translate to the movies. \\n\\n\r\nOverall: 7.3/10\\n\\n\r\nSo Pokemon has been going on FOREVER and all I see from people on various forums is that it needs to end soon. I haven't watched the newest season (biased off of the Black and White games) but what I can tell you about Diamond and Pearl is that it does not disappoint in the slightest. It keeps the same formula of 'gotta catch 'em all' while showing us some great character connection. The story between Ash and Team Galactic was interesting and fulfilling. Dawn surprises us with some spectacular character progression to become top coordinator while giving Ash some great memories. The series in some ways cuts back on the concept of battling and focuses on the relationship between the main characters. I cannot recommend Pokemon as a whole to everyone but I can without a doubt say that if you invest some time into this series, you might find yourself eating up your free time. This is one exciting, long, and fun to watch series that everyone should give a shot.\\n\\n\r\nEnjoyment: 7.3/10\\n\\n\r\n**To Pokemon Lovers: If you are craving a different take on Pokemon, I strongly encourage you start reading the manga Pokemon Adventures as it follows the games and has a very different view of the Pokemon Universe. The manga faithfully follow the games and at the moment has +500 chapters to enjoy.**\\n\\n\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-14T22:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 247695,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247695"
        }
    ],
    [
        {
            "content": "Pokémon Diamond and Pearl. Another continuation of the Pokémon franchise, but, believe me, don't get your hopes up - if you haven't tried to watch it already. Let's face it: THe Pokémon anime isn't great. It's not good. It's bad. D&P has its improvements over its predecessors, sure, but it's still worse. \r\nSo, if yo usat a group of people inside a clsoed room, with monitoers covering the walls, showing nostop pokémon, what would the result be? Eyes clawed out? Ears bit off? Or maybe everyone would believe that if they just went on a journey by foot, every day they would meet a newperson or creature, undoubtedly befriending them, only to leave them in the evening - for good. And of course, only after fighting off bad guys who does the same day after day, after day. After day. \\n\\n\r\nYup, that's pokémon D&P in a nutshell. Horrible writing, the same three or four formulas used over and over again (gym battle/training, rival episode, character of the day, contest/training), the same running gags (Fukamaru hitting Pochama with Draco Meteor, Team Rocket's neverending appearances, and. so. on.) If lather, rinse, repeat didn't sit in your head before, it will after watching pokémon.\\n\\n\r\nOf course, for the long-time-fans, here's always soalce to find in its improvements. The very subpar animation is a little less subpar (well, with the raised standards of \"par\" oveer the last century, maybe it's not really any less subpar), the battles are more entertaining to watch, the characters are, well, a little less flat and annoying (I'm among those who abhored Kasumi's existence), and the contests, tween girl-appealing as they might be, offers a, uh, more aesthetic variant of pokémon battles.\\n\\n\r\nIf you don't look in comparison however, there's no light at the end of the tunnel. Characters, flat (but no Kasumi!). Plot, horrible, repetitive and everything's way too long (180 episodes and counting in Sinnoh alone, compared to the 80 episodes of Kanto). Animation, bad (God, I wish it'd look a lot more like Bleach at its peak). Music, -- oh, that I didn't discuss.\\n\\n\r\nThe soundtrack is a mixed boat, same for voice acting. To specify, the mix doesn't stem from one character's seiyuu being better than another, but the difference between original and dub. The dub is so substantial in the pokémon franchise that I can't really omit that part in a review, even though I don't really watch it. But anyway! The seiyuu do a fair enough job of the characters. Nothing outstanding though. The English VA's however, oh God. That's Star Wars Holiday Special-bad. And that's almost where the soundtrack in the dub is, too. Iffy themes which you've heard over and over for 600+ episodes of pokémon. But that's where the Japanese version is good; the music, although much from the video games, sound better, fits better and doesn't sound as old and repeated as the dub's themes.\\n\\n\r\nFor me, and probably many, one of the few things (aside nostalgia, devotion and fanboy/girl-sim) that really keeps them watching is Team Rocket. The chemistry between them is really amusing, and while their plots and introduction themes are as boring as ever, their speech and mannerism are quite funny still. Aside that, it's all for the kids, this one. Yup, it keeps them hooked, and does it well. Pokémon is, after all, a kids' show, so I'm not that annoyed by its lack of, well, anything. For what it's worth, its persistent themes of friendship, hard work and trust does appeal to kids in a good way, and parents can rest assured that Satoshi, Pikachu and the gang will take their kids through a friendly and safe thirty minutes of action.",
            "date": "2010-05-16T06:13:00+00:00",
            "helpful_count": 59,
            "mal_id": 26104,
            "reviewer": {
                "episodes_seen": 159,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11081.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheLlama",
                "username": "TheLlama"
            },
            "url": "https://myanimelist.net/reviews.php?id=26104"
        },
        {
            "content": "Let's talk about art first. I watched pokemon from the first episode when it came out all those years ago. Compared to the art back then, DP (diamond and pearl...as im sure you know) is amazing. I remember one episode where the screen just flashed red and blue for about ten minutes and pikachu's thunderbolt was just two dull yellow zigzags...i think it was the seizure one in the first few seasons; but now it's improved so much in so many areas, too many infact, so i'm not going to list them all.\r\nI don't really think I should comment on sound since I watched thedubbed version and not the subbed/raw but I will anyway, just a little bit. I thought the voices have deteriorate since pokemon switched companies when May, or Haruka, was still around. But i think everyone had gotten used to the new deeper voice of Ash, or Satoshi. The music, both japanese and english, for DP is quite catchy too and the OST used are used in jus the right places. I hate Staravia's cry though...no offence to the person who does the voice but it just irritates me.\\n\\n\r\nThe characters for pokemon are a little bit hard to rate. We still have Ash and Brock, or Takashi, but we have a new female prtangonist: Dawn, Hikari(I think...check synopsis). Ash is still the competitive type and Brock is still flocking to every beautiful woman's side to propose a date. Dawn is...very hard to describe without giving away spoilers, but she gives a sort of fresh sensation to the group which neither May or Misty(I hav not idea what she's called in japanese and i'm not googling it) gave.\\n\\n\r\nThe storyline's pretty much the same as any other pokemon series so not much there...and Ash has new pokemons except (big shock?no). I think he kept Pikachu plus another one this time though...intereesting...\\n\\n\r\nIf you liked the other pokemon series you're sure to like this one...unless you're a strong believer in the Ash and May love things that are going around on the internet. But even you guys, advanceshippers get a pleasant surprise in Diamond and Pearl.",
            "date": "2009-02-03T07:24:00+00:00",
            "helpful_count": 39,
            "mal_id": 12087,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Etopenguin",
                "username": "Etopenguin"
            },
            "url": "https://myanimelist.net/reviews.php?id=12087"
        },
        {
            "content": "I'm not very good at writing professional looking reviews. But I like this season because this is the season that made me get into Pokemon again. When I was very young. I like many kids watched Pokemon. But over the years, I didn't watch it anymore. At age 21 or 22, I decided to look up Pokemon online. One of the 1st eps I watched was from Diamond & Pearl. I did get confused cause I saw Dawn. And I knew that I missed alot. So I started from ep 1 of the Pokemon series. And watched every show and movie. And ever since Ivebeen hooked!",
            "date": "2012-01-03T20:40:00+00:00",
            "helpful_count": 17,
            "mal_id": 50889,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1087403.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/princessdawn982",
                "username": "princessdawn982"
            },
            "url": "https://myanimelist.net/reviews.php?id=50889"
        },
        {
            "content": "I'm going to start off my review by stating that I will treat Pokemon D&P as a full flege anime and negate from the games and other chilhood influences. At this point it should be noted that Pokemon D&P is apart of the long running Pokemon FRANCHISE. A franchise that has a basic formula. That formula is aimed towards kids so there will be a lot childlike situations and themes. It just so happens that that formula continues to be reused time after time again. Its old to a lot of veteran viewers but new to the younger and newer generations. However, despite D&P beinga \"rehash\", it still finds it's place amongst the other series. \\n\\n\r\nStory: Satoshi or Ash for us American viewers is traveling by himself as he makes his way to the Sinnoh region. He eventully meets up with his long time traveling friend Takeshi/Brock and a new friend Hikari/Dawn. Like the other series, Ash along with his friends explore the area they are currently in while seeing and capturing new Pokemon, participate in Gym battles, make new friends and rivals, battle Team Rocket all while learning about growing up, friendship and other themes of such nature. \\n\\n\r\nArt: Compared to the older series, D&P is a step up in the art department. Of course the original has a nostalgic touch to it and Advance Generation has that sequal value but D&P is very vibrant in color. The environment is abosulutely beautiful and the way that some of the attcks look are perfect! It appears as if some of the attacks have texture to them.  Somthing the recent series have picked up and started doing. the characters are drawn well. Although Ash and Dawn are 10 they very well look like they are at least 13 giving off a more mature appeal.\\n\\n\r\nSound: The music is good. It's not \"rock your socks off\" good but for its target audience, it gets the job done. A lot of the battle and travel music returns from the previous shows so if your a fan of those, you're in for a treat. The sound effects are good like the colision of attacks or something simple like the characters walking.\\n\\n\r\nCharacter: Out of all the catergories in this review, the character catergory got the lowest rate. Ash and Brock are pretty much the same. They don't develop much however the introduction of the Sinnoh rival Shinji/Paul does add a bit of flare to something that was very well missing in Ash's life after the absence of Gary. Paul did in fact challenge Ash. I won't say that he helped Ash develop his style of battling. That actually came over the course of the series but Paul was serious about his job as a trainer. He was a tad bit cliche with the whole \"pokemon are tools\" outlook but nonetheless he gave Ash a run for his money. I was a bit disappointed with Dawn. Despite being the female lead to level out the male ratio, she didn't do much for team development and was a bit of a wasted character. Like her previous female lead, Haruka/May, Dawn is a Pokemon Coordinator. The main difference is that Dawn starts off as a coordinator while May grew into it. Also Dawn is the child of a famous coordinator. But that's really it. Dawn isn't that great at coordinating (at first) and the series introduces her as a rookie. She pretty much was in the same spot as May.  When it comes to the overall character of Dawn, she felt forced. Forced to be liked because she was a good guy. Forced because she had a dream to be a coordinator. Forced because when she felt sad, the viewers ahd to feel sad as well. Honestly, I would've liked Dawn more if she was already somewhat advanced in her craft similar to Misty. The dynamic would've changed greatly if Dawn wasn't your avergae Pokemon rookie. The coordinator thing has already been done and it doesn't help that the previous female lead was more profound in the skill than the current. The rest of the characters were either short lived or not memorable. Did I mention that Team Rocket is still trying to capture Pikachu?\\n\\n\r\nEnjoyment: I enjoyed D&P fairly well. As expected, things have changed but it's a new enviornment with the same fundamentals.\\n\\n\r\nOverall: Pokemon D&P is an upgrade in the battle sequences, the story and is overall is visually stunning. Unfortunately the characters were lacking. Paul was an interesting add to the series but Dawn was a step backwards from the other two female leads especailly since she gave no reason to be liked or rooted for other than the fact that the audience is SUPPOSE to like and root for her. However if you've been riding the Pokemon train this long, why stop here? It's a decent addition to the series and it came at a good time where things were getting stale. Pokemon D&P defintely holds a place in the Pokemon family tree and is sure to be liked by the younger generations and the veterans who know how the Pokemon formula goes.\\n",
            "date": "2014-06-22T15:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 148079,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3859435.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JordiTaylor",
                "username": "JordiTaylor"
            },
            "url": "https://myanimelist.net/reviews.php?id=148079"
        },
        {
            "content": "Right, to start off with, im 18, i think thats a pretty huge clue as to why i rated this anime so low, as a child pokemon was the best thing on TV, probably because when your 7, you dont really watch something and question each characters intergrity, like how ash has so many good pokemon in his PC yet he continually chooses to shun them in a box and start again from scratch, i mean come on, as a fellow pokemon player it really pisses me off watching someone continually losing to emotionally unstable emos as he tries to make his way to theelite four, kinda ironic that Ash's whole ethos is to raise pokemon through love and affection yet hes got about 100 neglected pokemon at home...someone dropped the ball there ¬_¬  but i digress, pokemon can be quite enjoyable at times but its not really an anime you would sit down and watch expecting it to go somewhere. Its not a terrible show, and im sure that the child in you might like it, but thats as far as it goes.\\n\\n\r\nA SIDENOTE:\\n\r\nOne of the most annoying things about the entire anime is whats the deal with pikachu!?! i mean common, why the fuck is he so goddamn shit!?!? if you've played pokemon yellow then ud know that pikachu really isnt going to lose against some lvl 15 some kid caught 2 days ago, i mean, is he on crack? does he have some disability that we dont know about? Theoretically, pikachu should be such a high level by now that he can afford to retire from being a pokemon, buy some pokeballs, catch some pokemon and become a trainer himself because when you think about it, the whole things just a complete mind fuck.\\n\\n",
            "date": "2011-09-08T10:41:00+00:00",
            "helpful_count": 13,
            "mal_id": 42963,
            "reviewer": {
                "episodes_seen": 30,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501732.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/deadlysoups",
                "username": "deadlysoups"
            },
            "url": "https://myanimelist.net/reviews.php?id=42963"
        },
        {
            "content": "Pokemon: Diamond and Pearl anime was definitely an enjoyable series for me. I liked all the new Pokemon introduced in Sinnoh with appearances from some of the more classics too. This is the one series where I felt Ash/Satoshi did his best battling wise. A great aspect to this was his rival, Paul/Shinji. The two had completely different views on how they were training their Pokemon and battling. It led to a great strong rivalry and was the main reason he did so well. The gym battles were great, team rocket was still funny as ever although i wish they didn't always appear in everyepisode. The plot with Team Galactic was entertaining. Now for my favorite part, the Sinnoh league. This was by far the best league Ash battled well in, and it's also the first league where most of his Pokemon team was fully evolved with the exception of Buizel and Gibble but they were still awesome. The strategies used were amazing especially on Ash's part. The final battle with Paul was simply great! the one thing I didn't like was how the league ended. In my opinion, I believe the anime should have ended with this series because of good things were with it. Overall an enjoyable series for me.",
            "date": "2015-08-22T15:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 196780,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4760905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/terminador_2397",
                "username": "terminador_2397"
            },
            "url": "https://myanimelist.net/reviews.php?id=196780"
        },
        {
            "content": "A repeated plot but a more serious tone has been added in DP.  Some 'violence' has been added, the new villain for example doesn't seem to care to much what happens to Ash (main character)\r\nThe art is sometimes very good (movies, special episodes etc.) but it can also really suck. It just depends what team does the episode (check bulbapedia)\r\nSounds alright, good background music in japanese version. \r\nThe characters are more developped and they're not all 'black and white' like they used to be.\r\nNice anime to watch, not too serious but can be when needed to.\r\nOverall nice, no real action, the plot is spreadover 200+ episodes with mostly fillers. Art's not always the best but major episodes are mostly done nicely. Pokemon USA doesn't edit episodes any more so there isn't that much difference in dialogue and plot.\\n\\n\r\nI personally watch mostly the more serious episodes but the fillers are more humourous. Give it a try, it's worth it.\\n\\n\\n\\n",
            "date": "2008-12-19T06:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 10484,
            "reviewer": {
                "episodes_seen": 500,
                "image_url": "https://cdn.myanimelist.net/images/userimages/113107.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/abridgedgirly",
                "username": "abridgedgirly"
            },
            "url": "https://myanimelist.net/reviews.php?id=10484"
        },
        {
            "content": "First of all, here are two rules to understand the Pokemon anime :\r\n1) If you watched the dub, you did NOT truly watch the anime.\r\n2) Each Pokemon \"cycle\" is a different style of anime : different narrative, and different art style.\r\nPokemon Diamond&Pearl is an excellent anime. It has deep stories, it has great fights, and it has even less fillers than Naruto or Bleach.\r\nSTORY\r\nDP starts by introducing Hikari, who wants to become a Top Coordinator as her mother was. But as she starts her journey, she'll realize she may not have the guts to succeed. Indeed, she will often fail, which will make her wonderif she is fit to be a Coordinator.\\n\\n\r\nAsh and Pikachu, of course, come back as the MCs. Ash still aims to win a Pokemon League, only this time, he has a lot of experience: in this series, Ash does feel strong. He knows what he's doing, doesn't do much mistakes, knows how to raise his Pokemon.\\n\r\nHowever, he will be facing someone even more skilled as him: Shinji, who quickly appears to be an utter assh*le, even with his own Pokemon. Through the whole season, Ash and Shinji will fight whenever they come across each other. But everytime they clash, they learn from each other, and with time they learn to respect each other despite each's flaws.\\n\\n\r\nAside from that, the story has a perfect narrative: it has a lot of different stories (Ash's League, Hikari's Contests, Team Galactic's plot, and plenty others), and each story progresses constantly, which makes them interesting to follow.\\n\\n\r\nBut more importantly, the series is deep. It develops a very philosophical theme : the question of identity. Yes, you heard right.\\n\\n\r\nBecause all the characters (including human AND Pokemon) have a story that revolves around the idea of discovering one's self. Ash and Shinji wonder what a true Trainer is ; Hikari wonders if she's fit for the role of Coordinator ; Brock (finally) wonders what job he should take ; Pikachu is once again faced with the idea of evolving to become stronger ; ...\\n\r\nALL the characters' stories go in the same direction: they are all faced with an identity crisis.\\n\\n\\n\\n\r\nART\\n\r\nPokemon DP didn't start really good. It was better than the previous Pokemon anime, but still not very good. Luckily, in the middle, they went HD ; starting from then, it became way more amazing.\\n\\n\r\nThe animation was cool, although not excellent. At least it was dynamic, which made for very good fights.\\n\\n\\n\\n\r\nSOUND\\n\r\nThe OST in the original version is awesome. It takes the themes of the games, but make an orchestral version of them, which sounds way better.\\n\r\nIt also creates its own themes, which are very cool.\\n\\n\r\nThe openings are also great, especially the first one, which I can't even describe, it's just... unique.\\n\\n\\n\\n\r\nCHARACTERS\\n\r\nThe characters are what makes this series stand out.\\n\r\nAsh has finally become an expert in Pokemon. While he does do some mistakes, they are now very rare, and he makes up for it with brillant and creative tactics.\\n\\n\r\nShinji was an absolute delight, as he is a complete assh*le, which makes him really stand out as a character in this show. He is also god damn powerful, which makes him the perfect rival.\\n\\n\r\nWhile Ash makes friendship a priority, Shinji only cares about winning and doesn't care about his Pokemon. Two opposite philosophies. Of course, Shinji will learn that he is wrong, right?\\n\r\nWELL, NO! Ash and Shinji's relationship is called a DUALITY: their visions, although opposite, are actually complementary.\\n\r\nWhile they can't stand each other because of their opposite points of view, each will learn from the other and each will grow stronger thanks to the other.\\n\r\nLong story short, their relationship was so damn interesting to follow!\\n\\n\r\nAside from these two, I also loved Hikari. The fact that she keeps losing in Contests makes her really interesting, as she has a lot of room for progress (and she does progress across this series).\\n\\n\\n\r\nENJOYMENT\\n\r\nPokemon DP is an absolute delight. This show is deep (RIP to all those who couldn't even understand that), the characters are very interesting (especially Shinji and his relationship with Ash), the fights were very cool (the Sinnoh League is full of memorable battles), the show is very serious and not that cheesy.",
            "date": "2018-12-06T07:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 295346,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7223606.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dante012",
                "username": "Dante012"
            },
            "url": "https://myanimelist.net/reviews.php?id=295346"
        },
        {
            "content": "There is so much wrong with the Pokemon Diamond & Pearl anime in every general way. Such cringe worthy dialogue and an awful attempt to make Pokemon's fan base even more childish then ever before. While also repeating the same formula over and over... The original Pokemon anime did so much for me as a child. Now we already know the video games were a perfect match made in heaven for both adults and children. While some people thought the Pokemon anime was take it or leave for many of us who did watch it, We enjoyed it to death. It had a lot ofgreat moments, some awesome character growth and of course seeing Ash mature even more. Also I watched the Pokemon anime for a good solid 9 years. Until this came out...\\n\\n\r\nPokemon Diamond and Pearl attempt to continue the anime even more is just painful for me. Ash still continues his own quest to become a Pokemon master... Something we have been seeing for nearly 10 Years at that point when this arc was new. He's joined by Brock once again and the newcomer Dawn. But all 3 characters are quite annoying to me. The growth and character development is so lackluster it's not even funny. The first 3 anime arcs did so much better for growth when it came to it's characters. I feel like Ash is back at square one once again despite the new region. Also some of the new characters thrown in the anime are just so unlikeable. The storyline is almost non existent at the point in time. Pokemon never had the deepest amount of story but this is just lazy.\\n\\n\r\nThe only thing in my opinion that saves Pokemon Diamond and Pearl is the art style. Seriously it is the best Pokemon has ever looked in so long. Really everything looks so well in the anime and the art style might have been the best at the time. Also the battles look great but sometimes you'll see the same thing over and over the deeper you dig into the anime. Music is also very bland as nothing sticks in your head. Most of the original voice actors have also been replaced but this happened in the Battle Frontier arc before it. Very poor voice acting and I must say it's dialogue is very cringe worthy most of the part. Also it's seems that the 4Kids voice actors fitted their roles more then the Pokemon USA dub. But this is just my opinion. \\n\\n\r\nBut also here's how a typical episode goes. Ash and Co wander through the area, A Person needs help, They tell some story that the audience doesn't care about, They go help the person, Team Rocket gets involved, They battle Team Rocket, BLASTING OFF AGAIN!!!!!  Stupid Conclusion. Rinse and Repeat asides from some of the gym battles and the final Pokemon league. Seriously this has gone on too much... It's also an attempt to drag on the anime even more which makes this filler so painful.\\n\\n\r\nThere was only one villain in the anime I also found interesting BTW. She was a Pokemon Hunter named J who shows no remorse for any Pokemon. It was the only thing that got me interested in Diamond and Pearl. As she actually tries to kill Ash at one point. The sad part is she is killed off about Midway through the anime. Destroying any promise for that the rest of the anime would be enjoyable. Seriously it's the only thing I found worthwhile in Diamond and Pearl. But other then that the rest of the villains in the Pokemon anime are typical. The other villains are Team Galactic and they are typical. Just a bunch of evil people trying to \"Make The World Better\"! Also of course the Team Rocket trio makes multiple attempts to make Diamond and Pearl funny but whatever... They are just there for stupid attempt at humor or of course breaking the fourth wall... Once again putting Pokemon into it's kiddy stigma that it's always gotten.\\n\\n\r\nOverall Pokemon Diamond & Pearl is just something I should have stopped watching. Seriously this is just a painful way to show off the Pokemon anime. The anime reached it's peak but this is a sad showing. The non existent storyline, awful character development and lack of anything enjoyable make this hard to stomach. Asides from one villain Pokemon Diamond and Pearl has lost so much from me. But the more the  Pokemon anime continues the worse it will go on in my opinion.",
            "date": "2014-04-14T21:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 139963,
            "reviewer": {
                "episodes_seen": 73,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3701995.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/3rdStrikeFreak",
                "username": "3rdStrikeFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=139963"
        },
        {
            "content": "For starters, as a Pokemon series, it had a lot to live up to. It had to be more developed than the previous two series that came before it. It had to have its own identity. It also had to have its own look. To be honest, this series did the most right. In fact, I would go and say THIS is the series to study if you're going to make subsequent shows. AVOID BEST WISHES LIKE THE PLAGUE! (Okay, watch the highlights, but that's all, to get some continuity.)\r\nDespite a dash of forced mascot syndrome, see Piplup for that, the characters chosen for thecast were overall very charming and lovable. \\n\\n\r\nTwo established characters of the series got very satisfying character development, new characters proved their worth on many occasions, and EVERY significant human character in the games were showcased here with the exception of Lucas and key Frontier Brains.\\n\\n\r\nAsh and Dawn - our stars this time - in this particular iteration demonstrate a connection that benefit the other almost symbiotically where in the other series it was one-sided (May) or not at all (Iris).\\n\\n\r\nThe pokemon of the show had their share of nuanced character development as well which some had extraordinary results (Chimchar, without a doubt) and some not so much (a certain Grass type which will not be named). You'll have to see for yourself. \\n\\n\r\nSo as for my scores, I gave this show a 9 in story because of its consistency and polish, though I'm not happy that some pokemon got the shaft in the long run. The obstacles in the story and the battles were all top notch though. The first gym battle was actually pretty awesome for starters and each of the contests have merit in their own right. The fact this series ties BEAUTIFULLY into a narrative for a Johto reunion of sorts is also pretty awesome.\\n\r\nIt got 9 in art because the battles are gorgeous! But the animation can be inconsistent at times.\\n\r\n9, if you're watching the Sub, for the music - it's fantastic! The dub's music, however, is rather cumbersome considering how some tracks just don't mesh well in the overall scene. \\n\r\nThe characters got a 9, because their representation on screen were VERY faithful to the in-game counterparts if they had one. Plus, they were not completely annoying like in other generations. Some characters were enhanced like Gligar and Plusle/Minun who had incredible spirit and flexibility. I can say that each pokemon got a fair and just amount of screen time.\\n\r\nMy enjoyment was a 9, because of how everything just fit together so nicely and how memorable the battles were as a whole.\\n\r\nMy overall was a 9, you'll never see a Pokemon series that used what its games had to this degree possibly ever again.",
            "date": "2015-02-17T03:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 180605,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2868235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/realar",
                "username": "realar"
            },
            "url": "https://myanimelist.net/reviews.php?id=180605"
        },
        {
            "content": "It's another sequel to the pokemon story but again new pokemon and new people to meet...\r\nI might be a little too old for it, but it never bores...\r\nPokemon is still a great standing anime and has a huge world..\r\nI love anime and fantasy elements and these elements are in pokemon.\r\nAlso since the first season pokemon has improved a lot.\r\nI still like it and I hope you do 2^^",
            "date": "2010-11-15T02:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 32066,
            "reviewer": {
                "episodes_seen": 123,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395820.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jelmpi",
                "username": "jelmpi"
            },
            "url": "https://myanimelist.net/reviews.php?id=32066"
        },
        {
            "content": "Alright, let me start off by saying, the Diamond and Pearl Saga, with full honesty, was the best developed and most promising series of all of its previous titles. Don't really depend on those nostalgic views of \"the original being best\" and all, all Pokemon Sagas were awesome, all in different ways. For me however, Diamond and Pearl ranks #1. \r\nFor the story element, Pokemon still sticks with the repetitive pattern except for some minor diversions. That is to say, if I would rate the story, I would down rate it for the repetition BUT I would still over rate it for the enjoyment. Imean, everyone else is demanding the same old classic Pokemon...and well...it is still here, and still delivers. It is still enjoyable and never gets old (to certain extents. So, 8/10 its pretty decent backed up with furthermore awesome elements.\\n\\n\r\nI didn't notice A HUGE and Dramatic difference in the art since the advanced generation, but that doesn't mean the art is bad. In the contrary, it's just perfect as always. Pokemons look great and so does the characters and that is a 10\\n\\n\r\nSounds as well never lets you down. I don't see getting rid of the 4Kids Dub as a wrong approach. In fact, the new dubbing group are doing pretty well, the sounds were just great and so were the music. Rating it 9 though since some Pokemon voices...were really disturbing... \\n\\n\r\nCharacters are definitely the reason I am urging people to watch the DP saga over all the others. The characters were well made. We finally get to see a well developed Ash, just look at him at the Sinnoh League! He has never done better. He might have been notched down a bit but he recovered very soon and went on as a really cool experienced trainer. Besides Ash we have his female companion Dawn. And trust me, she is one of the most lovable characters you are gonna meet. She receives a huge spot light and she gets tons of development. The interaction between both Ash and Dawn is what makes their character quite lively. Brock thankfully stuck with Ash with his usual funny thoughts. Never gets old, in fact, he always gets new ways of being handled by the girls. Team Rocket were funny as hell as well so..can't really comment more on these guys. But most importantly, we get to witness a ferocious rival. And extremely well handled rival. Basically, a meanie, he is a skilled trainer who gained much of experience. His background story also is revealed, allowing us to witness more of his depth. He was literary the toughest and thorough of all rivals. Pure excellence, and the best rivalry ever.\\n\\n\r\nAs for the Enjoyment: I personally couldn't wait to watch every single episode of the series. I loved every single one of them and juiced out all the enjoyment out of them. Such an Enjoyable show backed up amazing characters and decent storyboard. Never seen better.\\n\\n\r\nAs overall, I give it 9/10, however I am probably rating this relative to all Pokemon Generations rather than Animes in general. Diamond and Pearl, a good story, EXCELLENT characters, Great sounds as always..and the result: Another promising generation with a different flavor, Huge thanks to the developers of this series and for the effort they have put on it.",
            "date": "2012-03-28T01:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 57207,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1121463.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Charicific",
                "username": "Charicific"
            },
            "url": "https://myanimelist.net/reviews.php?id=57207"
        },
        {
            "content": "let me be frank, this is the ONLY anime of the pokemon series that comes close to the spirit of the games its the definitive series as far 8 gym badges a rival you want to beat. it is everything the first 3 series's should have been Ash'es ideaology combining with paul's calculative ideaology is delightful Paul is a utalitarian in every sense of the word which conflicts with the gary stu -ness of ash which i cant stand i fucking hate ash \r\nDawn i like tho pipplup is an excellent character im admitdely bias but as some one who had been watching the seriesand playing the games since 1997 i NEVER thought we were gonna get an adaptation that even remotley resembled a what i would consider to be an authentic and genuine pokemon quest through a region. \\n\\n\r\nthis is the closest they ever come to fufilling that traditional formula and yes you still have to deal with BS you would never see in the game yes team rocket is there being team rocket yes its flawed but it is the best representation of pokemon imho pre Pokemon Sun and moon which changeed up the formula consideribly",
            "date": "2018-08-09T20:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 286053,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7061267.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kyoualter",
                "username": "kyoualter"
            },
            "url": "https://myanimelist.net/reviews.php?id=286053"
        },
        {
            "content": "A little late for the review for this series? No?\r\n\"When every life meets another lifes, something will be born\"\r\nTbh, I watched this one occasionally when it was just released, mostly only for the league. Now I watched the whole series and tried to watch the filler too. Before, I like this series because of Paul (Shinji) and Ash (Satoshi)'s chemistry, but now I like it more and more. And the quote above is really the whole plot of this series.\r\nI am a Pokemon fan for a long time, frankly speaking it would be my whole life, I'm now 18 and I watched it when Iwas 3. When I grow up I meet lots of friends thanks to this, but a bit lonely since I'm the only girl in the group, ha ha.\\n\\n\r\nDiamond and Pearl surely has improment in the art, but probably nothing compare to other series that time. I watched the sub so the musis is really brilliant, not because of the Op and Ed but because they offen used songs from past series in battle, in training, and it gets you really hyped! I'm not even kidding, the battle with Volkner or Paul, they were so beautifully done with the music. However, the one scene I like was when Grotel just evolved and the song \"because the sky was there\" started playing when it crying, like, I was almost crying for it too.\\n\\n\r\nI think the more interesting and makes DP unique is Ash and Paul' rivalry. While Gary is also really strong and a jerk, Paul is helly strong and a complete nemesis of Ash. In fact, Paul is a representation of all the gamers who release weak pokemon and catches the strong one, considering IVs and Moves, etc. Paul is trong, but the most interesting thing is his ideal clashes with Ash's. Ironically, his Japanese name means \"believe\", haha. This is not the battle between weak and strong like Gary and Ash, but a battle of ideals. Also, the fact that Shirona (Cynthia) and Reiji (Paul's brother) comments on their relationship with the phase I quoted makes it even more meaningful. Until now, even with XY, I still love their rivalry the most.\\n\\n\r\nThe fillers are also fun, I really like Brock and his Croagust, and LOL at them many times. People say those gags and cliche and boring, but I pwrsonally still like them, though I really hate how Team Rocket just interfere in the battle and stuff, though they make me laugh. And Dawn, oh boy she is the best, I like her even more than Misty - whole existence is for nothing, or May - who sometimes too emotional. Dawn tries her best, and even fight outside the contest many times. I also like how they portrayed Brock as a brother figure, he takes care of the group. Remember the Pachirisu episode? He went to buy medicine and Dawn together with Ash didn't know how to cure the fever and realized they were too dependent on Brock. That was lacking in the recent series with Dento and Clemont.\\n\\n\r\nAlso, Ash has so many powerhouses in this series! All of his pokemon evolved except Pikachu and Buizel! I almost thought Buizel would also evolve, but it already breaks the record! That was his most powerful team in the history until now. And with that he meets the plot device Tobia, but who cares? He makes it to the semi final for the first time! \\n\\n\r\nAsh is the most mature in this series with all the interesting strategies. There is also a little plot with Galactic Team with better build up than AquaMagma thing back then, but the ending is kinda unsatisfied.\\n\\n\r\nOverall, as a Pokemon fans I like it the best.\\n\\n\\n",
            "date": "2015-09-06T16:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 197974,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320833.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/glaceon_cute",
                "username": "glaceon_cute"
            },
            "url": "https://myanimelist.net/reviews.php?id=197974"
        },
        {
            "content": "I can say this for Pokémon, at least. It has gotten continually better with each season. I have no qualms about calling Diamond and Pearl my favorite season of Pokémon thus far. \r\nTo get my main concern going into it out of the way... The voice acting has improved since Battle Frontier. There were still a few instances where he sounded a little off-- particularly wherever laughter was required-- but Ash sounded perfectly listenable for the duration of Diamond and Pearl. But the improvements I really took note of had nothing to do with the voice acting...\r\nMy main praise for Advanced was the writers' timemanagement skills. Having a main character participating in contests on top of Ash competing for his gym badges did a lot to keep me invested. I understand that early on, each Pokémon got its own feature episode as a way to show them off to the fans, but frankly, mini plot after mini plot with only the rare gym battle or serious competition scattered in between got boring really quickly. I want the anime to be able to stand on its own and have its own goals, not serve as a functional Pokedex. I understand that this hasn't exactly changed in Diamond and Pearl, but they had a more creative way of doing it most of the time, weaving new Pokémon into plots or conflicts that were already important for other reasons. Along those lines, I think they did a great job with incorporating Team Galactic into the story. Their organization's goals somehow managed to be more extreme and less ridiculous than the Hoenn villains. And the episodes where that conflict reaches its climax were great. Honestly, they almost felt like a movie rather than just another string of episodes in the middle of the series. \\n\\n\r\nAt the end of 191 episodes, I'm left feeling like there's just so much to discuss, but Diamond and Pearl tried to do it all. Correcting all my complaints about the original series, it would seem. There were contests and gym battles and more actual legendaries and faux-legendary Pokémon than I could count. But most of all, there are so many characters in this season. And they may be minor characters, but they all recur often enough to feel important, and I really liked that. (As well as bringing back plenty of characters from past seasons, which helped to give some of those little mini adventure episodes more to feel invested in.) The Grand Festival and the Sinnoh League felt like full-fledged tournament arcs. (Very brief tournament arcs, but all the same.) I liked that our protagonists' major opponents were all people that we already knew and cared about. We already know Ash isn't going to go all the way, (because where is the story going to go if he ever succeeds in becoming a master?) but it was great to see him come out on top against all these other trainers that we've watched grow over the course of the series. Though I will say that his fight against his final opponent was bullshit... I don't mind that Ash lost, but Tobias was overpowered to hell and back, and it just wasn't satisfying to watch. \\n\\n\r\nBut speaking of satisfying victories... Paul was their next great improvement on the series. I have something to admit... I love Gary Oak as a character, but I was never able to take their 'rivalry' seriously, for a lot of reasons. For one... what reason did Ash really have to set his sights on Gary? Gary was the spoiled, arrogant jerk from his hometown. I get that... But, even though Gary does recur quite a bit throughout the original series, he doesn't often do much of importance. It kind of just felt like a reminder that his character was still there. And then, by the time Ash and Gary do finally face off, Gary already seems resigned to the idea that he might lose. And that it won't be a major thing if he does. I loved seeing Gary's character progress throughout the series, but he never felt like much of a rival. \\n\r\nWhich is not something I had to worry about with Paul. He and Ash had a very clear conflict-- two trainers with differing ideologies about how best to train their Pokémon and constantly going at each other to try and prove that their way is best. That's a proper rivalry to me. And, as frustrating as it was to see Ash repeatedly lose his head during their battles, I did like that they battled more than once before the final conflict in the Sinnoh League. I wish we got to see even more of Paul than we did... He grew a lot near the end too, and it's never exactly spelled out what really changed his mind. (After all, he still won all of his fights against Ash before that, and remained comfortably ahead throughout their respective journeys.) But if it wasn't clear in the little things-- no longer insulting his Pokémon when they failed-- it became obvious to me that he'd grown up a lot when he thanked Barry for a good battle. Considering Barry lost, that's something early-season Paul never would have acknowledged. \\n\\n\r\nWhich I guess leaves us with Dawn. I found the newest edition to Ash's traveling companions to be perfectly likable... She just didn't really bring anything new to the table. We've seen the journey of a contest coordinator before, although Dawn is competing for different reasons-- wanting to follow in her mother's footsteps. Personality-wise, Dawn felt like a female Ash. A perfectly likeable protagonist... she just doesn't really add anything to the group. She was, at least, the most active of all of Ash's friends so far-- always right there in the middle of the action with him, so I'll give her that. \\n\r\nAnd finally Brock who, if I remember correctly, has finally left the series for good. All I have to say... is that he better get a damn good replacement. It occurred to me somewhere around the middle of the season that Brock is in charge of literally all the practical aspects of traveling. He's their navigator, their chef, their doctor whenever one of the Pokémon gets sick, and it's implied that a lot of their everyday care is left up to him in general. I know even less about the next season and the new characters than I did going into this one, but I'm looking forward to seeing how Ash manages to function without him. \\n\\n\r\nHuh. Never thought I'd leave a Pokémon review as a string of gushing praises. But, as far as shows that I use to kill time go, Diamond and Pearl was really good. I can only hope Best Wishes (which feels really out of place as the name of a Pokémon season...) can keep this train moving along.",
            "date": "2017-08-17T13:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 255676,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5131864.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Duckielover151",
                "username": "Duckielover151"
            },
            "url": "https://myanimelist.net/reviews.php?id=255676"
        },
        {
            "content": "***This is a spoiler free review***\r\nIf any series has been done to death, Pokemon is usually one to come up. While I grew up watching the original Pokemon as a kid and have dabbed in Pokemon Advanced, I found myself wondering if anyone still likes the series for what it made its name for. I enjoyed Pokemon as a kid because it offered something I inspired; adventure. Ash as a main protagonist is not very appealing except for the fact that he never gives up and he can be too kind to others. That being said, someone told me that Diamond and Pearl is muchdifferent than the previous installments and that I should give it a try. So join me for a review that will help you figure out if Pokemon really needs to die.\\n\\n\r\nStory: 7/10\\n\\n\r\nSo as I stated before Pokemon has been around for a very long time and with time comes boredom if not done correctly. Pokemon Diamond and Pearl like the other series takes place in a whole new region with different Pokemon monsters and a new addition to the cast. With returning characters Ash and Brock, we see our first new character, Dawn who I surprisingly take a liking to. Put the characters off to side for now, the story is structured very similarly to the previous installments. The main goal for Ash is to get all the gym badges and challenge the Pokemon League. Dawn provides us with her goal of become a top coordinator in the Pokemon Contests which I actually liked watching. There is one very annoying thing that Pokemon unfortunately carries with itself at the start of every series. Ash always becomes and seems very week even though he emerges from the previous season a very strong trainer and with Pikachu at an unparallelled power level. He for some reason always gets owned by someone in the beginning of every season (Gary and Paul in this case) and becomes very weak. Thank god he soon gets his balls back and starts on his journey with Dawn and Brock. I am going to skip over all the gym and contest stuff as they are somewhat the same from previous series. The story (as in what is affecting the Pokemon world as a whole) is actually interesting as the new \"Bad Guys\" are Team Galactic. Unlike Team Rocket they harm others and have truly evil goals. The Team Rocket trio return with their comic relieve that I am to be honest a little bored of. The overall conflict between Ash and company versus Team Galactic is interesting when it happens and it doesn't affect the overall pace of the show. There is also the back and forth battles between Paul (the new rival) and Ash which become interesting as it shows the drastic difference between the personalities of Paul and Ash. We see Paul change due to his time around Ash as well as become a better person.\\n\\n\r\nAnimation: 6/10\\n\\n\r\nAlthough the animation has become better than the previous installments, it's still nothing to brag about. There are some beautiful scenes and spectacular battles but in some areas of the show its just barely passable. It's enough to keep you interested in the characters and the show but it won't pull over gorgeous scenes like in Final Fantasy: The Spirits Within. It does what it's supposed to do, get the point across and help progress the series.\\n\\n\r\n Sound: 7/10\\n\\n\r\n*Reviewed watching the English Dub*\\n\r\nSound is very important in the Pokemon series as each Pokemon has a distinctive cry and vocal mannerisms. The new Pokemon sound decent but some variations between different Pokemon of the same species would of been nice as every Pidgy sounds like every other Pidgy. The main characters are voiced by pretty good voice actors epically Dawn. The dialog matches the mood of the scenes quite well and provides a good experience.\\n\\n\r\nCharacters: 9/10\\n\\n\r\nWhat has every Pokemon series done right especially in this series? The characters have always been spot on for Pokemon and it doesn't disappoint here. Ash is still rash and doesn't let up for any challenges. Brock is still his pervy self and when needed, provides help and inspiration. Dawn is a lot like Ash in the sense that she doesn't back down and conquers everything she faces. One reason why the characters had such an impact on me is because I started to noticed that there was a very strong connection between Ash and Dawn. Not so much in a romantic sense but in many scenes there are sparks between them that make for some amazing moments. Dawn and Ash work so well with each other that at the moment at the end of the series where Ash and Brock leave to go back to Kanto, I genuinely felt sad for Dawn. Out of all the main female leads for Pokemon, I had the strongest liking for Dawn (even more so than May). Where Dawn shines the most is the movies related to this series as the same connection you see in the show translate to the movies. \\n\\n\r\nOverall: 7.3/10\\n\\n\r\nSo Pokemon has been going on FOREVER and all I see from people on various forums is that it needs to end soon. I haven't watched the newest season (biased off of the Black and White games) but what I can tell you about Diamond and Pearl is that it does not disappoint in the slightest. It keeps the same formula of 'gotta catch 'em all' while showing us some great character connection. The story between Ash and Team Galactic was interesting and fulfilling. Dawn surprises us with some spectacular character progression to become top coordinator while giving Ash some great memories. The series in some ways cuts back on the concept of battling and focuses on the relationship between the main characters. I cannot recommend Pokemon as a whole to everyone but I can without a doubt say that if you invest some time into this series, you might find yourself eating up your free time. This is one exciting, long, and fun to watch series that everyone should give a shot.\\n\\n\r\nEnjoyment: 7.3/10\\n\\n\r\n**To Pokemon Lovers: If you are craving a different take on Pokemon, I strongly encourage you start reading the manga Pokemon Adventures as it follows the games and has a very different view of the Pokemon Universe. The manga faithfully follow the games and at the moment has +500 chapters to enjoy.**\\n\\n\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-14T22:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 247695,
            "reviewer": {
                "episodes_seen": 191,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247695"
        }
    ]
]