[
    [
        {
            "content": "&ldquo;Hanbun no Tsuki ga Noboru Sora&rdquo; or &ldquo;Hantsuki&rdquo;, as I will call it from now on, is yet another drama and romance anime. It&rsquo;s a really happy and sad anime at the same time, which spans over only 6 episodes. That paradox feeling one gets is quite unique to this series.\r\nStory:\r\nThough Hantsuki is limited to only 6 episodes, its still a wonderful story which leaves no questions open. The story is about a boy, Yuichi, who is hospitalized due to hepatitis over the winter. He&rsquo;s really just bored having to stay in this hospital the whole time and keeps on trying to escape, thus havingto run away from and deal with the nurse. While in the hospital he encounters a girl called Rika. Amazed by her beauty he kind of falls for her, but she keeps on acting very selfish. After Yuichi figures out why Rika is in the hospital, he begins to understand and feel sorry for her - she doesn&rsquo;t have very long to live.\\n\r\nThat said, the story goes through how the doctor of Yuichi had a similar relationship with a girl quite some time ago and gets mad at Yuichi because he sees himself in him. It even gets to the point where he lashes out and beats him up. Other then that, the story is all about Yuichi and Rika finding their love. It&rsquo;s really interesting though how, although Rika is acting really mean and selfish towards Yuichi, you still begin to like her character.\\n\r\nThe story ends both very happy and very tragic, which makes the perfect ending for this show, though it is very short.\\n\r\nBTW: Be careful to watch past the ending of the last show.\\n\\n\r\nAnimation:\\n\r\nThe animation is very well done. I found the characters to be designed in a very &ldquo;realistic&rdquo; way, making it easier to identify with them. I don&rsquo;t really now what else to say, except the animation at no point bothered me.\\n\\n\r\nSound:\\n\r\nThe sound, as in most romance/ drama anime, is made to fit the mood perfectly and make the experience more immersive. This show succeeds in doing so.\\n\\n\r\nCharacters:\\n\r\nAll but 1 character (the friend of the nurse) are very easy to sympathize with. At the end of the show you don&rsquo;t really hold a grudge against any character, since they all had their reasons for doing what they had done.\\n\r\nI found the characters to be very well fleshed out, especially Rika. The show also does a good job showing the situation Rika is in - already ready to die, but yet falling in love.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this show very much. I think that 6 episodes is the perfect length for this series, since it is really fast paced and doesn&rsquo;t &ldquo;dick around&rdquo; as many other senseless romance/ drama anime do. I&rsquo;d maybe only like to see an OVA showing how life is after the hospital or after Rikas death. Still, I highly recommend this show!\\n\\n",
            "date": "2008-05-19T13:36:00+00:00",
            "helpful_count": 112,
            "mal_id": 4836,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/makushimirian",
                "username": "makushimirian"
            },
            "url": "https://myanimelist.net/reviews.php?id=4836"
        },
        {
            "content": "5 WORDS OR LESS REVIEW: BITTERSWEET\r\nThe simplest way I could described Hanbun no Tsuki ga Noboru Sora (or simply HanTsuki) is by saying that it&rsquo;s bittersweet. I&rsquo;m sure that the people who have watched this would have a similar opinion.\r\nThe reason why it&rsquo;s so bittersweet for me is that even with the fun, happy comedic moments (a stack of porn and zebra man), I still get the feeling that something will go wrong, and it does happen. Even if it&rsquo;s like that, I still think it couldn&rsquo;t have gone in the better way, because if things went the way you wanted it to, wouldn&rsquo;t thatbe boring (hey this applies to real life too, huh)? It doesn&rsquo;t sugarcoat anything (specifically Rika&rsquo;s condition) and I guess in that way, it&rsquo;s realistic.\\n\\n\r\nAs for the two main characters, I have to say Yuichi and Rika is the best anime couple I&rsquo;ve ever seen. They have chemistry, and I love their individual characters. They&rsquo;re both so different, but they go well with each other. Akiko the nurse was also hilarious, and I hated Doctor Natsume at first, thinking he was some sort of lolicon, but in the end I understood why he was so protective of Rika.\\n\\n\r\nFrom one shonen romance to another, Kenichi Suzumara (Kyoichi Kanzaki from Boys Be&hellip;) played the male protagonist of HanTsuki very well. I thought his voice was gentle, yet it had a hint of mischief in it, which is perfect for Yuichi&rsquo;s character. Mikako Takahashi (Rika) is another familiar name for me, but her voice was different this time. Her voice was tinier (but resilient). Maybe it&rsquo;s because of Rika&rsquo;s loli and slight tsundere character.\\n\\n\r\nVisuals were okay. There wasn&rsquo;t really anything that I haven&rsquo;t seen before in other series, except maybe for the shiny (possibly oily) faces. It kind of bothered me that the characters looked chubby though, but I guess that&rsquo;s part of the cute look they were going for.\\n\\n\r\nThe music was okay too. It&rsquo;s your typical shoujo music, except this time it&rsquo;s for a shonen romance. I&rsquo;m not a fan of mellow music, but it wasn&rsquo;t really that mellow.\\n\\n\r\nThe greatest strength of this anime is its story and the character interactions. I overlooked all the other details and focused on the relationship of Yuichi and Rika, and the circumstances around them. That is why I was entertained from beginning to finish.",
            "date": "2007-10-30T07:43:00+00:00",
            "helpful_count": 101,
            "mal_id": 1173,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=1173"
        },
        {
            "content": "I'm really glad I actually sat down and watched this one fully. It only took a day, but what a day it was worth. I've watched many popular romance animes such as Clannad and Konan and can say nicely that, if it wanted to, this anime could have been on their level IF not greater.\r\nThere are a few things holding it back, though, which makes an unsatisfied feeling. I'll fully explain that through this review.\r\n~ WARNING: possible spoilers ~\r\n~ Story 8/10 ~\r\nThe story is nice and not over the top. It's realistic which blends well for it's dramatic feeling. Our main character is sick withHepatitis A. Not dangerous but he will be relaxing at the hospital for some time. Quickly we learn our main character is the adventurous type and tries to leave the hospital numerous times for self enjoyment if the nurse doesn't catch him and tosses him back into the hospital bed.\\n\r\nAlthough Yuuichi Ezaki spends time talking to his nurse and a couple of the hospital residents, he seems a bit bored at his bed-resting lifestyle even if his school friends visit him.\\n\r\nThis seems to change when the nurse brings up a girl from East Ward:\\n\r\nRika Akiba.\\n\r\nYuuichi goes to visit Rika and they slowly grow attached to one another.\\n\r\nHowever, Yuuichi doesn't have too much to worry about.\\n\r\nOn the other hand, Rika is in a different situation and suffers from heart complications that will keep her from living not too long.\\n\r\nThe story revolves mostly around the evolving relationship of both these characters as they deal with each others' emotions, pasts, and illnesses.\\n\r\nIt all comes down to Yuuichi to decide for himself on what he should do if Rika will die soon.\\n\r\nIt follows a realistic pattern without things getting too hectic from the story. You will greatly enjoy the small comedy and laid-back feeling you get watching this as light drama comes in. You will ESPECIALLY enjoy the sudden random bits of huge drama out of nowhere happens, changing your view of the story or characters as soon as you find out.\\n\r\nDialogue and personality mostly makes this anime what it is which would be a must watch.\\n\\n\r\n~ Art 8/10 ~\\n\r\nThe art is lovely. It's not overly done and is greatly nice. Sure, you may not find breath-taking animations or art, but that's not the appeal of the anime. There isn't a need to focus on that. Even so, it does well to add in little bits and extras to atleast make it look pretty nice. Character designs are nice and background designs are also done well.\\n\\n\r\n~ Sound 8/10 ~\\n\r\nAs the mood changes quite often, so will the music. Although not major, it's small and fits greatly with the mood. It starts at the right moments, not too early or late and displays the current atmosphere of the scene. Is it playful, sad, shocking? The soundtrack goes quite well to display these emotions.\\n\r\nThe opening and ending themes are also quite enjoyable. They both fit the overall vibe of the anime and were great choices.\\n\\n\r\n~ Character 9/10 ~\\n\r\nCharacters are lovable and easy to grow attached to. Yuuichi is an average high school kid with a kind heart. He's pretty easy going and a bit of a trouble maker. You grow to like his role more and more as you learn about him and see what he does. You'll laugh, you might sympathize with him, and you might even get pissed off. However, he doesn't let down the viewer when it comes down to being his role of a nice, heroic character type.\\n\r\nRika is someone with the slightly stereotypical tsundere personality. Although, it isn't a self defense like most. Rika is naturally socially awkward because of her illness which causes her to act out. She can be slightly mean, judging, and harsh. However, she can be kind, intelligent, understands the idea of justice, and even honest. Her character isn't annoying and quite easy to enjoy.\\n\r\nOther characters you will meet and sadly due to the shortness of the anime, wont grow to know too well. However, you will begin to love their roles as you like the nurse's personality, get aggravated at the doctor, root for 'Zebra Mask', and other characters. Sadly, it seems like the story doesn't dwell hard enough to get to the bigger roots of everyone so you can feel attached with every character. Some character don't even seem important at all. With that said, though, most the characters are lovable and hard to forget about.\\n\\n\r\n ~ Enjoyment 10/10 ~\\n\r\nI can't find one thing that I didn't enjoy about this anime. Everything was great. Each episode was great and the story progressed so well. Most focus will be on the characters which the story greatly works hard to display great traits of. It seems each detail, story, information, and everything else in this anime is not only important, but it's tender and loving. The comedy isn't too heavy but noticeable. The drama is consistently existent whether it's light and subtle or heavy and heart breaking. The romance isn't always there, but implied quite well. It's not extremely heavy and greatly focused on the entire time. Although, when it shows, the romance counts greatly. Everything about it doesn't feel too extreme and can grow to moments of on-the-edge suspense when things get hectic. This anime feels unique and without a doubt not feeling like a romantic cliche'. It's touching from start to finish and leaves you with a good feeling of happiness and satisfaction. You'll be constantly surprised and not expecting what will happen and what will be said which is mostly what makes this anime a must watch.\\n\\n\r\nOverall:\\n\r\nHanbun no Tsuki ga Noboru Sora is such a great anime. I didn't know what to expect when watching it. In fact, I was thinking the anime was going to be an average drama/romance. Quickly, however, I was proved wrong. It was well made and well written. Each aspect was taken well care of. What really kept this from getting a higher score you ask?\\n\r\nIt's potential.\\n\r\nThis anime has something where it could be great and offer so much but seems to be cut short from time. It was an anime that was squished into only six episodes. Now, yes, not much happens in the anime you'd think as the entire series mostly takes place in the hospital. However, seasons and time passes as you watch and characters change as they speak with one another. Things happen. It feels so....rushed, though. I felt like the anime ended before it even began. One minute, I'm developing into the beginning of a beautiful romance and then it was just over. It was a tasty dish but just too small to enjoy enough. I wanted more from the story, more development, I wanted to learn more about the characters, and just improvement all around. Not because I'm picky, but because there was SSOOOOOOO much to offer. \\n\r\nEven though you'll watch this and feel like you didn't get enough, it's still a great anime.\\n\r\nIf you want a good romance and story, this one is worth checking out\\n\r\nIf you have any intention to watch this, give the first episode a chance. You've already finished one/sixth of the series. It's not that long. I'm sure the first episode will already have you wanting more.",
            "date": "2013-05-14T20:24:00+00:00",
            "helpful_count": 79,
            "mal_id": 97209,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2567377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shinzo_Hensen",
                "username": "Shinzo_Hensen"
            },
            "url": "https://myanimelist.net/reviews.php?id=97209"
        },
        {
            "content": "When I first was recommended Hanbun by a friend of mine, I didn't expect much. I thought this would be your run-of-the-mill, unoriginal, stereotypical romance anime. \r\nAfter watching just the first episode, however, I realized that I was wrong.\r\nStory - 10\r\nEven though the anime is a mere six episodes, the storyline and plot was very well done. What I liked about it the most was that there was not a boring, or unneeded moment; everything was there for a particular purpose. Allthough this kind of story may seem typical to some viewers, I found it to be more than that. At times it could bevery depressing, seeming that there would be no room for any happiness or comedic value whatsoever. But then I would be surprised when they could throw in funny comments or situations, while still keeping the plot intact and staying true to the original concept.\\n\r\nAnother wonderful thing about the storyline was the ending - it was both a happy and sad moment, but fitting. It answered all the questions that the viewer needed to know, and it was executed very well. \\n\\n\r\nArt - 10\\n\r\nI really enjoyed the artwork in this anime as well. It wasn't the over-dramatic, big-eyed, crazy style that you might usually see, but a more realistic, simplistic style that fitted the storyline quite well. The scenery was also well done, and as said before, was in a more &quot;realistic&quot; style.\\n\\n\r\nSound - 9\\n\r\nNot much to say about it, but the important thing is that it fit. The OP and ED were touching, and were relaxing and easy to watch. Allthough the background music was nothing groundbreaking, it had its moments, and fit the anime's concept quite well.\\n\\n\r\nCharacter - 9\\n\r\nEvery character was likeable in his/her own way - whether it be Tanizaki the crazy but caring nurse for the more upbeat, comedic moments, or the wonderful chemistry between the somewhat shy Yūichi, and the stubborn, but loving, Rika. The only character that I had trouble connecting at first was Natsume, but by the end of the show you realize that he had reasons for his actions.\\n\\n\r\nEnjoyment - 10\\n\r\nObviously, I enjoyed this anime very much, or I wouldn't have given it such a high rating. There were times when I laughed, and there were times when I cryed. Allthough I felt this anime was very depressing at times, it was still very enjoyable to watch.\\n\\n\r\nOverall, this was a great romance/drama. It didn't have any excessive crap that you see in some romance anime's now-a-days, and it kept me interested until the very end (and when I mean the VERY end, I mean it. Make sure to stick around after the credits ;) ).\\n\r\nSo, if you are looking for a good romance/drama anime with no frills attached, then watch this. You won't be disappointed.",
            "date": "2008-07-18T23:01:00+00:00",
            "helpful_count": 50,
            "mal_id": 6415,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29517.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Adam-Kun",
                "username": "Adam-Kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=6415"
        },
        {
            "content": "For those who are familiar with Clannad/Clannad After Story (for those who aren't, it is a fantastic romance anime) this anime in my opinion is at its level, yes it is and I am not being sarcastic or joking or f**king with you. If you doubt my opinion, its fine, if you agree that's great.\r\nStory: (10/10)\r\n-Hanbun no Tsuki ga Noboru Sora (Looking Up At The Half-Moon), you will understand what this beautiful tittle entails by watching the show, it has more to it than you might think.\r\nThis anime portrayed and executed beautiful bitter sweetness and made me realize what is more important, your happiness oryour loved one's happiness. The story takes place in a small town where the protagonist and heroine are both hospitalized for some illness, there is comedy, romance with the main casts and of course the tragic/sad/bittersweet moments. At the end of the show, I have concluded that this couple maybe one of the best/best in all the anime I have seen.\\n\\n\r\nArt: (9/10)\\n\r\n-The art was great nothing to spectacular but just right for this show. The characters were well drawn which brings out the show's beautifulness.\\n\\n\r\nSound: (9/10)\\n\r\n-There wasn't any amazing soundtracks or openings, but, the ending song was so beautiful, it added to the bitter sweetness and was a pleasure to listen\\n\\n\r\nCharacter: (10/10)\\n\r\n-The relationship between the main characters was refreshing and enjoying to watch throughout the series, there was beautiful romance development and they were executed as more realistic characters. The supporting casts was also enjoyable and played helped you sympathize with the main casts.\\n\\n\r\nEnjoyment/Overall: (9.5/10) or Mal score: (9/10)\\n\\n\r\nI can only say one thing at this point, for those who want an anime with comedy/romance/tragic, watch this hybrid anime. I guarantee you will not waste your time.\\n\r\nKeep in mind this is six(6) episodes but regardless it is still amazing.\\n\\n",
            "date": "2013-05-03T03:58:00+00:00",
            "helpful_count": 37,
            "mal_id": 95813,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1518973.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bobby_S",
                "username": "Bobby_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=95813"
        },
        {
            "content": "Have you ever been in a hospital for a certain period of time? I haven’t. I would imagine a hospital being a somewhat orderly establishment—a place where the sick patients can relax (unless we’re talking about a psychiatric ward… which we aren’t). A hospital would most likely be quiet, monotone, and serious, with a somewhat melancholic vibe for obvious reasons.\r\nWhat does this have to do with Hantsuki? Well, this anime mostly takes place in what seems to be a small, local hospital. By the way, this hospital breaks every single rule that can be broken. Even factoring in that this hospital is small (meaning thatit’s bound to be a little weird) and that this is a six episode long anime (meaning that it’s bound to be a little weird), the things that happen are somewhat over the top. Occasionally, it’s funny; other times, the occurrences end up more than a little weird for reasons that I will go over later. For now, let’s just say that the latter take themselves seriously and expect us to take them seriously. The reason why this fails is because there’s a thin line between knowing it would never happen but not minding and knowing that it would never happen so deeply that you find yourself distracted by that fact while watching the anime. There’s a difference between your eyes glittering with an otaku’s delight (ahem, harem, ahem) and finding a frown on your face that resembles the expression of painful constipation. I don’t think Hanbun Sora is that bad, though, and I’m speaking from experience. Do not fret—the only thing related to my personal life that we’ll be talking about today is this anime that I spent my time on.\\n\\n\r\nThe last three words of the previous statement tie into what Hantsuki is all about. It’s about time—savoring it, using it wisely, cherishing what you had—and even our main character Yuuichi is bound by this philosophy. He is an active teenager who believes more in using his time wisely; even if he is ill, having contracted hepatitis A, he resists recovering quietly in the hospital and treats his boredom by sneaking out. First of all, he does so with ease by just hiding a bit and walking slowly, which isn’t something that I can comprehend. In a hospital, the patients absolutely would not be allowed to wander around the hospital without supervision, and there’s no way that the security would be so light that anyone would sneak out that easily, even with the rebel nurse in charge. Yuuichi does this repeatedly, even taking out another sick patient, Rika, and is never punished except by the nurse, who gives him a bit of a beating that can be chalked up to comic relief. Everything is viewed with such a nonchalant attitude, devoid of reality or logic, until obviously written and somewhat cheap twists come in, and we’re forced to think, “Oh, they meant for this to be important? I see.”\\n\\n\r\nIn six episodes, we all know that Hantsuki won’t be able to tell what something like Clannad might, but at the same time, the story is simple and shouldn’t have been complicated. It’s about a boy named Yuuichi, who meets an enigmatic girl named Rika. She has a disease but they care about one another, meaning conflict. Twists are expected and even welcomed to spice up the story, but in this amount of time, such an anime should not try so hard at something it won’t be able to achieve. They cram melodrama, love, patient abuse, two people to complicate things, grief, and yearning into six episodes; a melancholic, deep atmosphere is attempted and a cheesy, dramatic, immature one is created. Why? The anime can’t keep up with itself. One episode, something that it seems was meant to be serious happens, but by the beginning of the next scene, that atmosphere is gone or just not well handled, leaving a particularly sour taste because of poor writing.\\n\\n\r\nThe reason why the twists weren’t well handled of Hantsuki is somewhat attributed to the sound and animation, as, while the art or music in itself isn’t bad, the way that it’s used isn’t all that amazing. There are times when errors can be seen in the art, sure, but the largest downside is the animation in itself. A character does something like, for example, punching a wall in frustration and thanks to the angle, the jarring impact that could have been achieved comes across as dull. This isn’t helped by the voice acting, which I think occasionally came across as emotionless when the emotion was supposed to be at the highest point. Even the expressions are simple. Sometimes the music, which is good by itself, doesn’t fit the scene or an obvious sound is placed in to emphasize that something happened, making the atmosphere fall flat. This is not helped by the cast.\\n\\n\r\nEvery character has his or her place, every character seems to have a story, and every character moves along the plot, but that’s it. The supporting characters are much more intriguing than the main characters, though they unfortunately get little meaningful screen time or development. The mains, Yuuichi and Rika, have no “in between”—no underlying development. Rika is a brat one second and is sweet the next, as though permanently on PMS. Yuuichi ranges from pushover to “brave” in his stupidity, as though testosterone is being experienced for the first time. He was tolerable until one of his worst moments, where he had absolutely no backbone simply because of depression (and was over it by the next day). The relationship between these two is just there, as though they mutually agreed one day that they loved each other, and we’re forced to think, “Oh? Looks like they like each other. Huh.”\\n\\n\r\nIt is the sad truth that I found Hantsuki overwhelmingly disappointing. It didn’t fit. It didn’t piece together. I can see why people would like Hantsuki, but the best anime calms the part of my personality that scrutinizes deeply while I am watching. If you enjoy somewhat cheesy, melodramatic love stories, you might just have an opinion that greatly differs from mine. On the other hand, I think too much to enjoy something that is so obviously trying to make conflict and, like a slap in the face, does it in cheap, unimaginative ways.\\n\\n\r\nIf I could tell Hantsuki one thing, I’d say, “Your audience is not dumb.”",
            "date": "2014-03-30T01:29:00+00:00",
            "helpful_count": 31,
            "mal_id": 137851,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/2SugoiToActSugoi",
                "username": "2SugoiToActSugoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=137851"
        },
        {
            "content": "Before I start, I would like to take this time to implore that this is my first time writing a review. Please bare with me because I don't expect a lot comming from this review. I am also proud to be writing my first review on this anime because I personally thought this anime was well done.\r\nStory\r\nHanbun no Tsuki ga Noboru Sora had a simple story with no real twists to it. A boy meets a girl but both are very ill.The relationship between the two beings to change both of their lives. Something we have not heard before in romance animes unless you donot watch a lot of this genre. \\n\\n\r\nSince the story was short, I thought the change from one mood to another was too sudden. That gives away from the previous mood making the viewer uncomfortable. However, this anime did a good job conveying one mood to another. There was a purpose for all the events and obviously no fillers (Yay).  The ending of the anime was also very good. One could expect a open cheap ending for such a short anime but I thought it was very satisfying.\\n\\n\r\nArt \\n\r\nOverall i thought the art was well made. The character design was ok, not great nor was it bad. Nothing original about the character designs. The hair styles were a bit more thicker than normal but I saw this in one other anime. There was also some minor defects in that anime. Since they are minor, it did not have a big impact. The only noticeable thing about the art in this anime was the  scenery, which looked more realistic the further one gets into the anime\\n\\n\r\nSound\\n\r\nThe sound effects effectively and beautifully amplifies the mood of the movie. The theme songs was not too outstanding. It felt like just another theme song one can find from another anime. It was hard for me not to skip it, unfortunately i ended up skipping the intros. The closing song was much more noticeable than the intro. The songs played in the end had a nice feel to it and smoothly matched the ideas of the anime. The voice acting was decent although there were some moments where it felt like the show is skipping scenes due to the voices. Maybe it might the the video I was watching, well I can't be 100% sure at the moment. \\n\\n\r\nCharacter\\n\r\nI think the main characters, Akiba, Rika and Ezaki, Yuuichi characters were nicely developed. All the characters had their own unique problems which applied each others problems making the story more deep in meaning. Natsume, Goro played a huge role in this anime supporting the thesis. Although he might sometimes be portrayed as the antagonist, he is a necessity in making the ending the way it is. The The Third degree characters such as Miyuki Mizutani were very poorly developed even for third degree characters. It would be nice to learn more about them and examine their relation with the main characters. I blame it on the producers for making this anime so short. \\n\\n\r\nEnjoyment \\n\r\nThis anime was quite enjoying from start to finish. There was sad moods, happy moods, ecchi moods and moods that make you reminisce. I highly doubt there would be a second season with the current amount of people happy with the overall outcome. The ending gives out a bundle of emotions at once. There was no \"I want more\" or \"emptiness\" in the ending.  The anime made me want to watch one after the other due to lack of dullness. Watching this anime felt shorter than it actually was  because of how entertaining it was.\\n\\n\r\nOverall\\n\r\nThis anime was nicely done for a 6 episode anime. I think it could use one or two more episodes but it was good non the less. I would say this anime would get a higher rank if supporting characters were also developed more deeply but i guess this anime did not intend on doing that from the start. Hanbun no Tsuki ga Noboru Sora would be highly recommended for ages 13+ who is just thinking of starting to watch animes.",
            "date": "2009-12-19T06:29:00+00:00",
            "helpful_count": 28,
            "mal_id": 21512,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210544.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LaevusII",
                "username": "LaevusII"
            },
            "url": "https://myanimelist.net/reviews.php?id=21512"
        },
        {
            "content": "Looking at all those reviews of this anime I thought I was going to see something amazing. Something that will make me cry waterfalls, seeing as most of the reviewers compared this story to Clannad or other great drama series. Oh boy, was I wrong. Not only I haven't watched something good, but I haven't watched an anime as horrible as this one before. Judging by the series rank you thought that would be impossible, but bear with me for a while while I explain why I have rated this as I have.\r\nFirst of all: the story. \r\nActually let's start with it's premise. This isa story about a boy that has hepatitis, he stays at hospital all the time because of that and doesn't go to school. In hospital, he meets a girl named Rika. Ezaki (boy's name) starts spending more time with her and learns that she has a heart disease because of which she probably won't live long, and she needs an operation which chances are pretty low as well. Now the synopsis of the story sounded like i was going in for a very good story if not a brilliant one, as some reviews stated. I was hoping to see a very interesting characters and an amazingly developed storyline which wouldn't probably end well seeing how high it's rated. Well, wrong again. \\n\\n\r\nThis story has absolutely nothing interesting in it. The characters feel like they have no connection at all and honestly the most interesting part of the anime was its opening. There is too much comedy in this, which would be forgivable, if it was perfectly executed with a very delicate manner, but this comedy was far too exaggerated and out-of-place at any time. I honestly felt offended of all the joking about death and there was even a scene when the last wishes of a dying old man was to give porn magazines to the main character which stayed in the same hospital. This is just too much. Or a random scenes when guy dresses as zebra and fights people, main character hanging from a rooftop by a rope to get to Rika's room (was those scenes even supposed to be funny), i didn't smile even once during this and honestly i don't know how anyone possibly could. Further examples involve beating a patient on the rooftop of a hospital, nurse driving in a race car at full speed in town, nurse's friend trying to sleep with Ezaki and quotes of almost every character.\\n\\n\r\nBecause of this failed comedy and exaggerated drama, the show didn't feel believable at all. Every action any character took was painful to watch and by the time i got to episode 6 i felt like i was in Rika's condition, because of the writing. Nothing was in place, nothing fit in the anime. This was suppose to be a drama about a dying girl and a boy falling in love with her, instead, i just didn't know what i saw at the end, it was ridiculous. \\n\r\nThis is very, very surprising considering that the script writer and creator of the series is the same guy who worked on an anime EF, to which i gave a 10. Guess he only used source material in Ef anyway so that should explain it.\\n\\n\r\nThe story is undoubtedly the weakest point of this show and seeing how i judge almost every anime by it's story, this had to have gotten a score that it got. It truly deserved it. I thought that maybe the ending was so good that it convinced people to change their opinions of this show, but it was horrible as well.\\n\\n\r\nIf I could name only one thing this story lacked it would be subtlety. Is it too much to ask for a mature drama anime? I guess so.\\n\\n\r\nCharacters :\\n\\n\r\nOne of the weakest characters in terms of emotional connection i had the pleasure to see. They didn't feel like characters at all. Every action that any character took was out of place and i think that's mostly why it happened. I didn't care for them at all, especially for what will happen to Rika which is the worst thing to say when the anime is based on her condition.\\n\r\nMaybe if the show focused more on her and showed more of her story, this could've look different. The show however skipped very important subjects focusing on horrible comedy and background characters too much. \\n\\n\r\nRika is a quiet girl that reads books all the time. She has no intention of making any friends in the beginning and when she finally makes friends with Ezaki, when she finds those magazines she starts to hate him just like that. She quickly forgets what he's done for her and hates him one day, while being friends with him the other. She also tries to occasionally quote something from one of her favorite books, which almost always seems out of place. Despite that, she is probably the best written character on the show, which just shows how terrible it is.\\n\r\nEzaki is a normal boy that stays in the same hospital. The nurse tells him about Rika one day and orders him to go talk to her, which he does. The biggest issue i had with him is that i couldn't find any emotional connection between the two. He always did what he was ordered to do. It's like he didn't have any emotions at all. He just didn't seem believable at all to me. He was also the most boring character in the anime so there isn't really much to talk about.\\n\\n\r\nThe background characters include:\\n\r\n- The nurse which always yells at her patients or hits them (seriously who even hired her to do this)\\n\r\n- The doctor who beats Ezaki at the rooftop for no apparent reason and is also a heavy smoker and has a drinking problem (wow, what a nice hospital it is)\\n\r\n- Tsukasa, Ezaki's friend who occasionally dresses as a zebra and fights with people (very creative)\\n\r\nOther characters aren't even worth mentioning. The don't bring anything to this anime and i have no idea why they were even featured at all.\\n\\n\r\nThere isn't much to talk about in terms of music in this anime. There just wasn't any good. OP and ED both are very average one's in terms of text and music, they're not horrible and are, for me, the best part of this anime but they're just not much to talk about. The instrumental tracks weren't really disturbing but weren't memorable either.\\n\\n\r\nI have to say i liked characters designs. They weren't anything special but they felt nicely done. Also background designs were very nice as well although they could've been a little more detailed. What i didn't like was the animation of the moving vehicles. Absolutely horrid. But that was the only negative thing that stood out so it was good overall.\\n\\n\r\nEnjoyment? I'm just going to skip this part. Absolutely none.\\n\\n\\n\\n\r\nOverall thoughts:\\n\\n\r\nThis is the worst anime i have seen so far. While the first episodes was promising something average at least, with every episode it just got worse in every possible way. \\n\r\nAt the end it was so painful to watch i had to turn on some good music and just watch it muted with subtitles. Comedy sucked from the very beginning, overuse of drama could be seen all the time and the characters didn't feel believable at all as every action they took made absolutely no sense. But the most interesting this are all the good reviews that were written. Maybe I just don't have any kind of good taste when it comes to anime. All I'm sure of is that i honestly hated it as much as i have stated in this review. \\n\\n\r\nI think this was a complete waste of time and a dissaster of an anime. (1/10)",
            "date": "2013-07-16T08:38:00+00:00",
            "helpful_count": 24,
            "mal_id": 105581,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1546313.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/goldenmane",
                "username": "goldenmane"
            },
            "url": "https://myanimelist.net/reviews.php?id=105581"
        },
        {
            "content": "To be completely honest, this didn't feel realistic at all.\r\nThe concept was good if you like slice of life and drama or whatnot, but I didn't like the way it was executed. \r\nPart of the problem is probably due to the shortness of it. In only short 6 episodes, it's hard to care about the characters. However, its length wouldn't be a problem if they hadn't tried to add so much information in every episode. For instance, in the first episode alone, Yuuichi is already practically professing his love for this girl who's acted like a brat for the previous 20 minutes of screening. Itjust didn't feel believable.\\n\\n\r\nThe characters and their actions felt forced, too. I can't decide if Rika is a major tsundere or just really bratty. Hell, even if she IS a tsundere - which I usually love - I don't like her at all, and I honestly don't know what Yuuichi saw in her in the first place. In turn, Yuuichi needs to grow a backbone. My favourite character was Sekoguchi, and seeing he's got such a minor role, that's just sad.\\n\\n\r\nThe art was good, the soundtrack decent, but the animation definitively could've been better. There were scenes where the characters' movements looked really unnatural.\\n\\n\r\nOverall, I found this somewhat enjoyable. Maybe if this were a full length series - with better character development and an unrushed plot - I'd give it a rating higher than fair.",
            "date": "2011-12-14T08:40:00+00:00",
            "helpful_count": 21,
            "mal_id": 49171,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/798627.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mandi92",
                "username": "mandi92"
            },
            "url": "https://myanimelist.net/reviews.php?id=49171"
        },
        {
            "content": "Hanbun no Tsuki ga Noboru Sora (HanTsuki) is a simple story of two high school students that fall in love at a hospital, one of whom is going to die.  This was the first synopsis I&rsquo;ve read about Hantsuki a few years ago and was immediately excited.  After reading this synopsis one can already tell what the story is like as well as learn of my masochistic tendencies.\r\nHantsuki does sound and play out like a stereotypical Asian drama.  In fact, I hear that there was a live action adaptation of Hantsuki.  However, what makes Hantsuki is the execution of the storyand the short run.  This anime title was only 6 episodes long so they had to focus on the main story of Rika and Yuuichi.  Very little is wasted and everything seems to push the story forward.  Even Natsume&rsquo;s story is related to the main story of Rika and Yuuichi.  On the other hand, Hantsuki suffers from several &lsquo;extremes.&rsquo;  Hantsuki lacks subtly, many of the things the characters do push the borders of reality.  For example, Yuuichi&rsquo;s friend zebra mask, the crazy nurse, and various other events.       \\n\\n\r\nAs for the characters, here where things start to get interesting.  The interactions between Rika and Yuuichi are quite nice to watch as they grow closer to one another.  Rika is a tsundere however, her &lsquo;tsun&rsquo; was too pronounced, especially for the first 2 episodes.  The things she does borders on abuse and can be very uncomfortable to watch.  This is primarily why I stopped watching Zero no Tsukaima II.  I don&rsquo;t find anything funny when one character abuses another in a realistic fashion (think of this, what if the genders were reversed?).  Yes, she has her reasons but, her actions were way too much for me.  Thankfully, she gets better after the 2nd episodes.  In addition, Natsume also does similar things to Yuuichi.  Once again he has is reason but, the things he does are quite extreme\\n\\n\r\nMuch of my enjoyment of Hantsuki comes from the 2nd half, when the drama hits.  In particular, I enjoyed the scene with the book and Natsume&rsquo;s own story overlapping.  However, Hantsuki isn&rsquo;t completely sad as there are plenty of comedic moments to lighten up the mood (although its a bit much sometimes).  Hantsuki doesn&rsquo;t fall for the trap of going straight to the drama, as many stories do.  The first half did its job to build up the characters to make the 2nd half, when the drama hits, have more impact.               \\n\\n\r\nI rather enjoyed the music in Hantsuki.  There are typical violin and piano pieces however, there are a good about of guitar pieces.  In particular, the OP really stood out for me.  The simple use of character stills, minimal animation, symbolism, and music really worked for a series like this.  In addition, a series like this doesn&rsquo;t need the highest budget for animation.  Never the less, I would have liked it if they had spent more money on the animation.  Art/character design is another story, while it doesn&rsquo;t need a very high animation budget the art/character designs should at least be good.  Sadly the art and character designs for Hantsuki were very simplistic.  Overall, Hantsuki had mediocre animation/art.\\n\\n\r\nHantsuki is a well executed romance/drama that does feel like your typical Asian live action drama.  There are times where the characters and the situations feel a bit too over-the-top, thus lose a bit of the realism.   Although, the story may be short, 6 episodes, they use this time effectively and very little is wasted.",
            "date": "2008-03-25T09:24:00+00:00",
            "helpful_count": 15,
            "mal_id": 3390,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42620.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/slpless",
                "username": "slpless"
            },
            "url": "https://myanimelist.net/reviews.php?id=3390"
        },
        {
            "content": "What to expect: Heartwarming romance without unnecasary fanservice and a dramaturgic touch\r\nStory: ( 7/10)\r\nThe premise and plot for this short series are simple: A boy has to stay in a hospital where he meets a girl with a serious illness. He tries his best to make her happy and has to face few obstacles on the long way.   \r\nCharacters:  ( 9/10)\r\nThe main characters are the sick girl Rika and the protagonist of the series Yuuichi. They are fairly fleshed out, believable and likeable, although  I sometimes got a tsundere vibe from Rika . While they get enough development to justify itas good for a 6 episode series, it isnt groundbreaking. the strongest point would be the interaction of these two. The side characters are mostly there for plot purposes or sometimes comedic relief and arent worth mentioning. Overall the selling point would be the relatability of the main cast. \\n\\n\\n\r\nArt and Sound:   ( 10/10)\\n\\n\r\nPerhaps what I liked most about this show despite the main characters was the music, especially the opening. It fits well and catches the theme of the series very well. The Art is fitting, animation might not be the best but it is fine for a show such as this one. All in all it looks very good.\\n\\n\r\nEnjoyment: ( 10/10)\\n\\n\r\nIf you want something a little bit more dramatic than your typical romance and dont need any fanservice then go ahead and check this one out.",
            "date": "2015-08-12T12:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 195933,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4262783.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Greenixx",
                "username": "Greenixx"
            },
            "url": "https://myanimelist.net/reviews.php?id=195933"
        },
        {
            "content": "A short romance/drama OVA series, \"Hanbun no Tsuki ga Noboru Sora\" is an anime has its moments, but is guilty of trying too hard to create drama. It's supposed to be set in a hospital, but patients are allowed to wander around at their leisure... or even go off on the occasional mountain climbing trip if they feel like it. If they're well enough to do that, why the hell are they taking up space in the hospital? Not only that, everyone seem to be able to do whatever they want without any consequences. Locking ill patient outside in the cold? No problem! Abusive Doctors?That's okay too. It takes a hell of a lot just to get anyone to raise an eyebrow in this \"loving and caring\" hospital.\\n\\n\r\nOther inexplicable elements include the random actions of the nurse's friend, who seem to have a touch of madness in her, and the random appearance of this Zebra mask character... but, if you can manage to sweep all these unrealistic elements into a dusty corner of your mind and ignore it, the rest of the drama elements aren't too bad, as there are some rather touching moments. Despite the show's tendency to resort to the usage of cheap plot devices in order to conjure up melodrama, it's during the quiet periods of melancholy when not much is happening that the anime is at its best. Thinking back on it, I think I actually enjoyed \"Hanbun no Tsuki ga Noboru Sora\" more than I should, considering all the contrived plot \"twists\", but what can I say, I guess I'm just a sucker for those melancholic moments.",
            "date": "2010-07-23T06:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 28796,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302826.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kajia",
                "username": "kajia"
            },
            "url": "https://myanimelist.net/reviews.php?id=28796"
        },
        {
            "content": "Lets start off saying that i give every romance genre anime a trial period. I watch the first 2 episodes, and if i dont like either the story of animation, i scrap it. Although this anime is 6 episodes long, DONT SCRAP IT!. i would usually have not watched it because i dont watch any anime shorter than 12 episodes, but i gave this one a chance.\r\nI dont regret it at all.\r\nWithin six episodes, the characters develop around each other so intensely that you feel like Hanbun no Tsuki ga Noboru Sora has been running for ages. It may seem like a run-of-the-mill romance, butit has its originality. Its set in a hospital, and outside forces are seeing to it that romance is always put to the test.\\n\\n\r\nI recommend this anime to any who like romance anime. I laughed, i cried, and now im depressed that i finished it. It reminds me of other top-class romance anime like toradora and clannad. Only 6 episodes long, but there are no regrets from me.",
            "date": "2010-04-21T00:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 25269,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/319186.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RomanceisAlright",
                "username": "RomanceisAlright"
            },
            "url": "https://myanimelist.net/reviews.php?id=25269"
        },
        {
            "content": "The story is about a 17 year old boy name Yuuichi.  He sneaks out of the hospital every night, and due to his sickness and sneaking out everytime, he has to stay in the hospital longer.\r\nThis nurse that beats on him for sneaking out ask him help her with this patient that has no friends and always lonely.  He falls in love with her, one way to get a girl, and is willing to do anything for her.\r\nFor an anime for only 6 episodes, it is a wonderful peace of work.  A boy that is willing to help her and completes herwishes.  But the story builds up to the story about the girl, Rika's sickness.  Sad and is good.  The ending is good and is worth to watch, if you like to watch romance and tragic anime like this.",
            "date": "2009-03-16T18:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 13250,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shadow_Night",
                "username": "Shadow_Night"
            },
            "url": "https://myanimelist.net/reviews.php?id=13250"
        },
        {
            "content": "Length: 6 episodes\r\nOriginal Airdates: 1/06 - 2/06\r\nDemographic: Seinen\r\nGenres: Drama, Romance\r\nAlso known as: Looking up at the half-moon, Hantsuki\r\nOne sentence description: \"Boy meets a girl who probably has less than a year to live\"\r\nPlot Synopsis\r\nDuring the winter, Yuichi was hospitalized due to hepatitis. Randomly he would try to escape from the hospital but would get beat up by the nurse. One day, he happened to meet Rika, a girl of his age, in the next building. He was fascinated by her beauty, but she was very selfish girl. Although she led him by the nose, he began to be attracted by her. However, when Rika toldhim about her illness, he knew why she acted so selfish; she didn't have long to live.\\n\r\n(From Anime News Network)\\n\\n\r\nPersonal Opinion\\n\r\nThis was the next anime I saw after completing &quot;ef - a tale of memories&quot;... so my expectations were somewhat inflated.\\n\r\nBesides that... this was your run-of-the-mill romantic drama.  On that note... it wasn't bad... but it wasn't good either.\\n\r\nFirst off... the anime length almost felt tooo short.  With 6 episodes, I can't care about the characters, and from that, i can't really understand the emotions that the characters have to deal with. \\n\r\nAlso plot developments were somewhat awkward and felt forced.  Again probably from the fact that the anime was only 6 episodes\\n\r\nActually when i think about it now... all my problems w/ this anime can be traced down to it's shortness\\n\r\nI mean besides that... the anime was decent... it had good characters... just not enough time to develop them\\n\\n\r\nRating: 7/10\\n\\n\r\nSimilar to...\\n\r\n- Air\\n\r\nGuy falls for a girl who's death is imminent.\\n\\n",
            "date": "2008-03-14T19:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 3121,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28549.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tekky99",
                "username": "Tekky99"
            },
            "url": "https://myanimelist.net/reviews.php?id=3121"
        },
        {
            "content": "What is the most precious treasure? Your own happiness? Or the happiness of the person you love the most? \r\n\t\"Hanbun no Tsuki ga Noboru Sora\" or simply \"HanTsuki\", is an anime that I truly don't regret watching and experiencing. In general, without any spoilers, it's about a seventeen-year old boy named Ezaki Yuiichi that gets affected by hepatitis A, thus he had to reside in his small town hospital for a period of time. During his stay, he usually gets bored and goes out to console his boredom, but when he comes back to the hospital, he will occasionally get beaten up by his assignednurse, Tanizaki Akiko. One day, Ezaki Yuuichi meets a girl his age at the eastern side of the hospital, where most serious cases reside. Her name is Akiba Rika and Yuuichi eventually finds out that she's suffering from a critical heart disease that will eventually end her life. Over time, Rika and Yuuichi get to know each other and fall in love. There are some melancholy and dramatic parts, but it gets evened out with a little bit of comedy that somewhat eases the mood. Even though there are only six episodes in the whole anime, it feels more complete than other animes I've watched. The ending had left no other remaining questions I may have, although it may be pleasant yet sorrowful at the same time. \\n\\n\r\nAnimation/Art: \\n\r\n\tI felt that the animation of HanTsuki was very well done. I thoroughly enjoyed their unique, geniune looks and I felt that the voice actors did a fine job. Overall, I had no accusations about the animation or the art.\\n\\n\r\nSound/Music:\\n\r\n\tThe soundtracks fit the feelings and the meaning of the anime fairly well. It made the experience more tragic yet hopeful. The opening song of HanTsuki did a great job in emphasizing the main, overall theme/idea of the story, and the ending song was peaceful and relaxing.\\n\\n\r\nCharacters:\\n\r\n\tThe main characters, Yuuichi and Rika are obviously my favourite characters because of their personalities and the situation they're in. But, some of the secondary characters, such as Yuuichi's school friends aren't as memorable. Probably because the anime didn't give any further background knowledge about them. If they included that, then the anime would have been more interesting. But of course, the anime only had six episodes to begin with, so that must be the reason why they mainly focused on Yuuichi and Rika's relationship. Overall, I felt that the characters (especially Yuuichi and Rika) were really thought out and the anime did an exceptional job in developing their fragile bond.\\n\\n\r\nEnjoyment:\\n\r\n\tI had really enjoyed this anime a lot, not only because it's touching and well done, but because it's a rare story that connects and truly shows the meaning and the impact it has on someone that's wavering between life and death. All in all, I hugely recommend this anime if you're interested in mainly romance and drama. \\n\\n\r\n*At the risk of my life, I will be yours.* - Les Thibault\\n\\n",
            "date": "2012-05-10T18:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 60987,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1297109.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/StarFall",
                "username": "StarFall"
            },
            "url": "https://myanimelist.net/reviews.php?id=60987"
        },
        {
            "content": "Hanbun no Tsuki ga Noboru Sora (Hantsuki), is a 6-episode-long, anime series with its share of comedy, drama, misunderstandings, and romance. It follows the story of Yuuichi Ezaki, a high schooler who has been hospitalized for hepatitis A.  During his stay he meets Rika Akiba, a self-centered girl who has lived in the hospital for a majority of her life due to a serious heart condition.  Without a surgery (with a low success rate), she will surely die.  \r\nStory:  Although not a stereotypical romance anime, it was nothing that blew me away.  Many parts of the story I found useless;the time used for these excess things should have been spent focusing on Yuuchi and Rika's relationship.  I wouldn't have minded the additional parts if the anime was longer and it had more time expand on things. The first episode really got me into it, but the way the anime didn't concentrate on the actual story when they were limited 6 episodes, bothered me. Not putting enough focus and time on the relationship caused me to feel emotionless at parts where I shouldn't have been.\\n\\n\r\nArt: The animation is very clean and neat, but nothing special. The character's looks are unique, almost like a breath of fresh air.  My one complaint is the colors used; they were always very bold.  At times they worked,  at others they seemed almost obnoxious. \\n\\n\r\nSound: Hantsuki has a wonderful opening song that fits the series well, and a pleasant, calm ending.  But the background music during episodes was seriously lacking: very plain and boring.\\n\\n\r\nCharacter: Every character was very realistic. Nothing spectacular, but they did a good job at developing everyone just enough for having only 6 episodes.\\n\\n\r\nEnjoyment: Hantsuki was pleasant to watch and there was never a time where I simply didn't want to watch the next episode.  The way they paced the story bothered me a great deal, and it was hard for me to feel any emotion.",
            "date": "2009-01-27T16:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 11884,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60762.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fizzybubblespop",
                "username": "Fizzybubblespop"
            },
            "url": "https://myanimelist.net/reviews.php?id=11884"
        },
        {
            "content": "An anime who is guaranted to make you tearful even if you are not a person who usually cries in animes. This anime has it all. The perfect plot, Forbidden Love, Abuse and Drama. \r\nWe follow life through Yuuichi’s eyes when the storyline takes place in the hospital. One day he sees a girl almost to beautiful and wishes to get to know her.. When He goes to meet the girl after finding out her name was Rika he finds out that there is more behind her than just her looks.. She is pretty yet also lonely as few, Due to this she is rudeand mean to him.\\n\\n\r\nable to see through her actions Yuuichi stands by Rika’s side and eventually they fall in love.. Forbidden love through, they face their many obstacles…\\n\\n\r\nThis anime is an absolute if you are into sad animes.. \\n\\n",
            "date": "2010-12-28T05:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 33144,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MonjaElisa",
                "username": "MonjaElisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=33144"
        },
        {
            "content": "A history(story) full of charm and joy of life  in spite of its theme, even thanks to its theme, and magnificently served by picturesque but original characters at the same time, audacious humor but neither black nor simpleton, often surprising scenario and characters very successful designs... Furthermore, livens up him is really realistic, and when we know that stories) like that really take place, that hurts, and it is what produces livens up (it) even more fascinating. Especially that the suspense is maintained until her() any end, and we are oppressed by the weight which carries) the central figure the shoulders.\r\nAlthough diagrammatically, him benot very beautiful, without being unpleasant necessarily to look, what we shall have held of this series, it is the beauty of the context, the (story), who, although the characters are ordinary, original rest with regard to(compared with) most of the others liven up( plays.\\n\r\nFrom a personal point of view, I shall note this series 10/10, because it really marked me, and I think that it deserves him, if we stay in the dramatic kind(genre).",
            "date": "2013-03-09T11:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 89171,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1919926.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/suganthan",
                "username": "suganthan"
            },
            "url": "https://myanimelist.net/reviews.php?id=89171"
        },
        {
            "content": "\"The One Minute Which Has Been Stopped\"\r\nHanbun no Tsuki ga Noboru Sora (Looking Up at the Half-Moon) is an anime that unusually has a hospital setting for the most part. When I found this, I was looking for recommendations to Kimi ga Nozomu Eien (The Eternity You Wish for) (I think, or it must have been Ef - a Tale of Memories/Melodies.), hoping to find a tragic story (which is hard to do), and this seemed to fit the bill. Though I thought it was a pretty good series, I was actually disappointed by how it ended (I will leave it at that to avoidspoilers) and, to a lesser degree, the artwork in some areas (more on that later).\\n\\n\r\nEzaki Yuuichi has hepatitis (liver infection caused by a virus) and has to skip school to remain hospitalized for a while. He likes to sneak out sometimes, only to be caught and beaten up by his nurse, Tanizaki Akiko. One day, he sees a new girl in the east wing, which is reserved for serious cases. Akiko tells Yuuichi that there is nothing wrong with the girl, but he should go talk to her. He does, but accidentally lies by pretending to read the same book she, Akiba Rika, reads. When Rika finds out, she makes Yuuichi do her bidding to make up for it, and thus begins their bossy relationship. However, when Yuuichi decides to take Rika to Fortress Mountain, where the latter wishes to go, they have a fight, and he collapses on the ground while trying to say something . . .\\n\\n\r\nAs you would expect from six episodes, the development is quite fast, but not too much. There is time for both comedy and drama, with no fillers. In every episode, important events happen and, at least in most of them, new characters are introduced who affect the plot in one way or another. What is admirable is Yuuichi's perseverance despite being sick himself, putting Rika always ahead. This is how a man should act. \\n\\n\r\nWhat is good about this show is the characters who you will grow to love (except for two that you will hate). The protagonist, Ezaki Yuuichi, is a kind-hearted man who wants to leave his small town for possibly Toukyou. On the other hand, the heroine, Akiba Rika, is a hard-to-please girl who has spent her entire life in hospitals, is always angry and bottles up her emotions (except in front of Ezaki). One of my other disappointments with this anime is Mizutani Miyuki, Yuuichi's childhood friend, who could have been a rival to Rika for the former's affection, but unfortunately never develops to be one; she only appears in the fourth episode and beyond, but it is never explained why she had not visited sooner, despite Yuuichi's other friends frequently showing up. Natsume Gorou has been Rika's doctor for years, and can be quite cunning; he always remembers someone when he looks at his lighter, and is known for being a very good physician, even among his older peers. The nurse, Tanizaki Akiko, is a young, tough woman that smokes and does not like to take crap from anyone; she has a good heart, though. A perverted old man, called Tada Yoshizou, roams around the hospital, and is on good terms with Ezaki; he has a large collection of pornography books. Another good friend of Yuuichi's is Sekoguchi Tsukasa, who can turn into \"Zebra Man,\" which consists of just wearing a mask to conceal his identity in dangerous situations; Yuuichi thinks that the moment they became friends is when he saw Tsukasa searching for a home to some stray cats in a rainy day, and the former offered to help, in spite of not being able to keep them in his place, but Sekoguchi thinks they have been friends ever since they met. Lastly, Yuuichi has one more classmate that visits him sometimes, Yamanishi Tamotsu, but quintessentially has ulterior motives, bothering Ezaki. \\n\\n\r\nLike I said before, the art is actually at a high level, yet there are noticeable errors. When Natsume cries (I think it happens in episode three), I could see that one of his eyebrows is missing at the lower camera angle. Even more annoying is the fact that they flashback that very same scene with the very same mistake. Also, a number of times when Ezaki looks at Akiba while they are talking, it feels like his pupils are not really focused on her and he has \"Itou-Makoto-on-School-Days\" slow reactions to important events. I also do not like how Sekoguchi Tsukasa and his brother's eyes are drawn similar to a straight line. Other than that, everything is fine.\\n\\n\r\nStill, the seiyuu here are pretty annoying. The heroine in particular, Rika, has the same voice actor as Machi, Ayane's older sister from Nagasarete Airantou, which I have seen first, who barely speaks, mostly in a very low monotone, so that killed Rika, who is energetic and talks more frequently, for me. Moreover, One Piece fans should recognize Natsume Gorou's seiyuu, the same as Sanji's (ironically, they both smoke and have a similar personality (i.e., they are realistic; Gorou is not perverted like Sanji (then again, the former is older)), who I have seen first, too. Maybe they was supposed to, but Tsukasa's sounds weak and Akiko's sounds muscular. They still could do a lot worse, though.\\n\\n\r\nHowever, the soundtrack is brilliant. More so with the opening sequence, but the ending sequence as well, it is one of those songs you want to listen, and watch, over and over again. They are both quiet, sad, soothing and simply beautiful. They hint a sorrowful finale.\\n\\n\r\nDespite its flaws, Hanbun no Tsuki ga Noboru Sora is an anime I am glad I watched. There are a few (albeit important) loose ends, but the show still manages to provide a somewhat-satisfactory conclusion. I intend to read the manga (as I do with all great anime and vice versa) because I felt some things are left out here. If you are looking for a short, young drama, you will not regret watching this.\\n\\n\\n\\n\\n\\n\r\n\"Our Hands\"",
            "date": "2011-08-01T15:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 40561,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seijurou",
                "username": "Seijurou"
            },
            "url": "https://myanimelist.net/reviews.php?id=40561"
        }
    ],
    [
        {
            "content": "&ldquo;Hanbun no Tsuki ga Noboru Sora&rdquo; or &ldquo;Hantsuki&rdquo;, as I will call it from now on, is yet another drama and romance anime. It&rsquo;s a really happy and sad anime at the same time, which spans over only 6 episodes. That paradox feeling one gets is quite unique to this series.\r\nStory:\r\nThough Hantsuki is limited to only 6 episodes, its still a wonderful story which leaves no questions open. The story is about a boy, Yuichi, who is hospitalized due to hepatitis over the winter. He&rsquo;s really just bored having to stay in this hospital the whole time and keeps on trying to escape, thus havingto run away from and deal with the nurse. While in the hospital he encounters a girl called Rika. Amazed by her beauty he kind of falls for her, but she keeps on acting very selfish. After Yuichi figures out why Rika is in the hospital, he begins to understand and feel sorry for her - she doesn&rsquo;t have very long to live.\\n\r\nThat said, the story goes through how the doctor of Yuichi had a similar relationship with a girl quite some time ago and gets mad at Yuichi because he sees himself in him. It even gets to the point where he lashes out and beats him up. Other then that, the story is all about Yuichi and Rika finding their love. It&rsquo;s really interesting though how, although Rika is acting really mean and selfish towards Yuichi, you still begin to like her character.\\n\r\nThe story ends both very happy and very tragic, which makes the perfect ending for this show, though it is very short.\\n\r\nBTW: Be careful to watch past the ending of the last show.\\n\\n\r\nAnimation:\\n\r\nThe animation is very well done. I found the characters to be designed in a very &ldquo;realistic&rdquo; way, making it easier to identify with them. I don&rsquo;t really now what else to say, except the animation at no point bothered me.\\n\\n\r\nSound:\\n\r\nThe sound, as in most romance/ drama anime, is made to fit the mood perfectly and make the experience more immersive. This show succeeds in doing so.\\n\\n\r\nCharacters:\\n\r\nAll but 1 character (the friend of the nurse) are very easy to sympathize with. At the end of the show you don&rsquo;t really hold a grudge against any character, since they all had their reasons for doing what they had done.\\n\r\nI found the characters to be very well fleshed out, especially Rika. The show also does a good job showing the situation Rika is in - already ready to die, but yet falling in love.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this show very much. I think that 6 episodes is the perfect length for this series, since it is really fast paced and doesn&rsquo;t &ldquo;dick around&rdquo; as many other senseless romance/ drama anime do. I&rsquo;d maybe only like to see an OVA showing how life is after the hospital or after Rikas death. Still, I highly recommend this show!\\n\\n",
            "date": "2008-05-19T13:36:00+00:00",
            "helpful_count": 112,
            "mal_id": 4836,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/makushimirian",
                "username": "makushimirian"
            },
            "url": "https://myanimelist.net/reviews.php?id=4836"
        },
        {
            "content": "5 WORDS OR LESS REVIEW: BITTERSWEET\r\nThe simplest way I could described Hanbun no Tsuki ga Noboru Sora (or simply HanTsuki) is by saying that it&rsquo;s bittersweet. I&rsquo;m sure that the people who have watched this would have a similar opinion.\r\nThe reason why it&rsquo;s so bittersweet for me is that even with the fun, happy comedic moments (a stack of porn and zebra man), I still get the feeling that something will go wrong, and it does happen. Even if it&rsquo;s like that, I still think it couldn&rsquo;t have gone in the better way, because if things went the way you wanted it to, wouldn&rsquo;t thatbe boring (hey this applies to real life too, huh)? It doesn&rsquo;t sugarcoat anything (specifically Rika&rsquo;s condition) and I guess in that way, it&rsquo;s realistic.\\n\\n\r\nAs for the two main characters, I have to say Yuichi and Rika is the best anime couple I&rsquo;ve ever seen. They have chemistry, and I love their individual characters. They&rsquo;re both so different, but they go well with each other. Akiko the nurse was also hilarious, and I hated Doctor Natsume at first, thinking he was some sort of lolicon, but in the end I understood why he was so protective of Rika.\\n\\n\r\nFrom one shonen romance to another, Kenichi Suzumara (Kyoichi Kanzaki from Boys Be&hellip;) played the male protagonist of HanTsuki very well. I thought his voice was gentle, yet it had a hint of mischief in it, which is perfect for Yuichi&rsquo;s character. Mikako Takahashi (Rika) is another familiar name for me, but her voice was different this time. Her voice was tinier (but resilient). Maybe it&rsquo;s because of Rika&rsquo;s loli and slight tsundere character.\\n\\n\r\nVisuals were okay. There wasn&rsquo;t really anything that I haven&rsquo;t seen before in other series, except maybe for the shiny (possibly oily) faces. It kind of bothered me that the characters looked chubby though, but I guess that&rsquo;s part of the cute look they were going for.\\n\\n\r\nThe music was okay too. It&rsquo;s your typical shoujo music, except this time it&rsquo;s for a shonen romance. I&rsquo;m not a fan of mellow music, but it wasn&rsquo;t really that mellow.\\n\\n\r\nThe greatest strength of this anime is its story and the character interactions. I overlooked all the other details and focused on the relationship of Yuichi and Rika, and the circumstances around them. That is why I was entertained from beginning to finish.",
            "date": "2007-10-30T07:43:00+00:00",
            "helpful_count": 101,
            "mal_id": 1173,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=1173"
        },
        {
            "content": "I'm really glad I actually sat down and watched this one fully. It only took a day, but what a day it was worth. I've watched many popular romance animes such as Clannad and Konan and can say nicely that, if it wanted to, this anime could have been on their level IF not greater.\r\nThere are a few things holding it back, though, which makes an unsatisfied feeling. I'll fully explain that through this review.\r\n~ WARNING: possible spoilers ~\r\n~ Story 8/10 ~\r\nThe story is nice and not over the top. It's realistic which blends well for it's dramatic feeling. Our main character is sick withHepatitis A. Not dangerous but he will be relaxing at the hospital for some time. Quickly we learn our main character is the adventurous type and tries to leave the hospital numerous times for self enjoyment if the nurse doesn't catch him and tosses him back into the hospital bed.\\n\r\nAlthough Yuuichi Ezaki spends time talking to his nurse and a couple of the hospital residents, he seems a bit bored at his bed-resting lifestyle even if his school friends visit him.\\n\r\nThis seems to change when the nurse brings up a girl from East Ward:\\n\r\nRika Akiba.\\n\r\nYuuichi goes to visit Rika and they slowly grow attached to one another.\\n\r\nHowever, Yuuichi doesn't have too much to worry about.\\n\r\nOn the other hand, Rika is in a different situation and suffers from heart complications that will keep her from living not too long.\\n\r\nThe story revolves mostly around the evolving relationship of both these characters as they deal with each others' emotions, pasts, and illnesses.\\n\r\nIt all comes down to Yuuichi to decide for himself on what he should do if Rika will die soon.\\n\r\nIt follows a realistic pattern without things getting too hectic from the story. You will greatly enjoy the small comedy and laid-back feeling you get watching this as light drama comes in. You will ESPECIALLY enjoy the sudden random bits of huge drama out of nowhere happens, changing your view of the story or characters as soon as you find out.\\n\r\nDialogue and personality mostly makes this anime what it is which would be a must watch.\\n\\n\r\n~ Art 8/10 ~\\n\r\nThe art is lovely. It's not overly done and is greatly nice. Sure, you may not find breath-taking animations or art, but that's not the appeal of the anime. There isn't a need to focus on that. Even so, it does well to add in little bits and extras to atleast make it look pretty nice. Character designs are nice and background designs are also done well.\\n\\n\r\n~ Sound 8/10 ~\\n\r\nAs the mood changes quite often, so will the music. Although not major, it's small and fits greatly with the mood. It starts at the right moments, not too early or late and displays the current atmosphere of the scene. Is it playful, sad, shocking? The soundtrack goes quite well to display these emotions.\\n\r\nThe opening and ending themes are also quite enjoyable. They both fit the overall vibe of the anime and were great choices.\\n\\n\r\n~ Character 9/10 ~\\n\r\nCharacters are lovable and easy to grow attached to. Yuuichi is an average high school kid with a kind heart. He's pretty easy going and a bit of a trouble maker. You grow to like his role more and more as you learn about him and see what he does. You'll laugh, you might sympathize with him, and you might even get pissed off. However, he doesn't let down the viewer when it comes down to being his role of a nice, heroic character type.\\n\r\nRika is someone with the slightly stereotypical tsundere personality. Although, it isn't a self defense like most. Rika is naturally socially awkward because of her illness which causes her to act out. She can be slightly mean, judging, and harsh. However, she can be kind, intelligent, understands the idea of justice, and even honest. Her character isn't annoying and quite easy to enjoy.\\n\r\nOther characters you will meet and sadly due to the shortness of the anime, wont grow to know too well. However, you will begin to love their roles as you like the nurse's personality, get aggravated at the doctor, root for 'Zebra Mask', and other characters. Sadly, it seems like the story doesn't dwell hard enough to get to the bigger roots of everyone so you can feel attached with every character. Some character don't even seem important at all. With that said, though, most the characters are lovable and hard to forget about.\\n\\n\r\n ~ Enjoyment 10/10 ~\\n\r\nI can't find one thing that I didn't enjoy about this anime. Everything was great. Each episode was great and the story progressed so well. Most focus will be on the characters which the story greatly works hard to display great traits of. It seems each detail, story, information, and everything else in this anime is not only important, but it's tender and loving. The comedy isn't too heavy but noticeable. The drama is consistently existent whether it's light and subtle or heavy and heart breaking. The romance isn't always there, but implied quite well. It's not extremely heavy and greatly focused on the entire time. Although, when it shows, the romance counts greatly. Everything about it doesn't feel too extreme and can grow to moments of on-the-edge suspense when things get hectic. This anime feels unique and without a doubt not feeling like a romantic cliche'. It's touching from start to finish and leaves you with a good feeling of happiness and satisfaction. You'll be constantly surprised and not expecting what will happen and what will be said which is mostly what makes this anime a must watch.\\n\\n\r\nOverall:\\n\r\nHanbun no Tsuki ga Noboru Sora is such a great anime. I didn't know what to expect when watching it. In fact, I was thinking the anime was going to be an average drama/romance. Quickly, however, I was proved wrong. It was well made and well written. Each aspect was taken well care of. What really kept this from getting a higher score you ask?\\n\r\nIt's potential.\\n\r\nThis anime has something where it could be great and offer so much but seems to be cut short from time. It was an anime that was squished into only six episodes. Now, yes, not much happens in the anime you'd think as the entire series mostly takes place in the hospital. However, seasons and time passes as you watch and characters change as they speak with one another. Things happen. It feels so....rushed, though. I felt like the anime ended before it even began. One minute, I'm developing into the beginning of a beautiful romance and then it was just over. It was a tasty dish but just too small to enjoy enough. I wanted more from the story, more development, I wanted to learn more about the characters, and just improvement all around. Not because I'm picky, but because there was SSOOOOOOO much to offer. \\n\r\nEven though you'll watch this and feel like you didn't get enough, it's still a great anime.\\n\r\nIf you want a good romance and story, this one is worth checking out\\n\r\nIf you have any intention to watch this, give the first episode a chance. You've already finished one/sixth of the series. It's not that long. I'm sure the first episode will already have you wanting more.",
            "date": "2013-05-14T20:24:00+00:00",
            "helpful_count": 79,
            "mal_id": 97209,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2567377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shinzo_Hensen",
                "username": "Shinzo_Hensen"
            },
            "url": "https://myanimelist.net/reviews.php?id=97209"
        },
        {
            "content": "When I first was recommended Hanbun by a friend of mine, I didn't expect much. I thought this would be your run-of-the-mill, unoriginal, stereotypical romance anime. \r\nAfter watching just the first episode, however, I realized that I was wrong.\r\nStory - 10\r\nEven though the anime is a mere six episodes, the storyline and plot was very well done. What I liked about it the most was that there was not a boring, or unneeded moment; everything was there for a particular purpose. Allthough this kind of story may seem typical to some viewers, I found it to be more than that. At times it could bevery depressing, seeming that there would be no room for any happiness or comedic value whatsoever. But then I would be surprised when they could throw in funny comments or situations, while still keeping the plot intact and staying true to the original concept.\\n\r\nAnother wonderful thing about the storyline was the ending - it was both a happy and sad moment, but fitting. It answered all the questions that the viewer needed to know, and it was executed very well. \\n\\n\r\nArt - 10\\n\r\nI really enjoyed the artwork in this anime as well. It wasn't the over-dramatic, big-eyed, crazy style that you might usually see, but a more realistic, simplistic style that fitted the storyline quite well. The scenery was also well done, and as said before, was in a more &quot;realistic&quot; style.\\n\\n\r\nSound - 9\\n\r\nNot much to say about it, but the important thing is that it fit. The OP and ED were touching, and were relaxing and easy to watch. Allthough the background music was nothing groundbreaking, it had its moments, and fit the anime's concept quite well.\\n\\n\r\nCharacter - 9\\n\r\nEvery character was likeable in his/her own way - whether it be Tanizaki the crazy but caring nurse for the more upbeat, comedic moments, or the wonderful chemistry between the somewhat shy Yūichi, and the stubborn, but loving, Rika. The only character that I had trouble connecting at first was Natsume, but by the end of the show you realize that he had reasons for his actions.\\n\\n\r\nEnjoyment - 10\\n\r\nObviously, I enjoyed this anime very much, or I wouldn't have given it such a high rating. There were times when I laughed, and there were times when I cryed. Allthough I felt this anime was very depressing at times, it was still very enjoyable to watch.\\n\\n\r\nOverall, this was a great romance/drama. It didn't have any excessive crap that you see in some romance anime's now-a-days, and it kept me interested until the very end (and when I mean the VERY end, I mean it. Make sure to stick around after the credits ;) ).\\n\r\nSo, if you are looking for a good romance/drama anime with no frills attached, then watch this. You won't be disappointed.",
            "date": "2008-07-18T23:01:00+00:00",
            "helpful_count": 50,
            "mal_id": 6415,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29517.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Adam-Kun",
                "username": "Adam-Kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=6415"
        },
        {
            "content": "For those who are familiar with Clannad/Clannad After Story (for those who aren't, it is a fantastic romance anime) this anime in my opinion is at its level, yes it is and I am not being sarcastic or joking or f**king with you. If you doubt my opinion, its fine, if you agree that's great.\r\nStory: (10/10)\r\n-Hanbun no Tsuki ga Noboru Sora (Looking Up At The Half-Moon), you will understand what this beautiful tittle entails by watching the show, it has more to it than you might think.\r\nThis anime portrayed and executed beautiful bitter sweetness and made me realize what is more important, your happiness oryour loved one's happiness. The story takes place in a small town where the protagonist and heroine are both hospitalized for some illness, there is comedy, romance with the main casts and of course the tragic/sad/bittersweet moments. At the end of the show, I have concluded that this couple maybe one of the best/best in all the anime I have seen.\\n\\n\r\nArt: (9/10)\\n\r\n-The art was great nothing to spectacular but just right for this show. The characters were well drawn which brings out the show's beautifulness.\\n\\n\r\nSound: (9/10)\\n\r\n-There wasn't any amazing soundtracks or openings, but, the ending song was so beautiful, it added to the bitter sweetness and was a pleasure to listen\\n\\n\r\nCharacter: (10/10)\\n\r\n-The relationship between the main characters was refreshing and enjoying to watch throughout the series, there was beautiful romance development and they were executed as more realistic characters. The supporting casts was also enjoyable and played helped you sympathize with the main casts.\\n\\n\r\nEnjoyment/Overall: (9.5/10) or Mal score: (9/10)\\n\\n\r\nI can only say one thing at this point, for those who want an anime with comedy/romance/tragic, watch this hybrid anime. I guarantee you will not waste your time.\\n\r\nKeep in mind this is six(6) episodes but regardless it is still amazing.\\n\\n",
            "date": "2013-05-03T03:58:00+00:00",
            "helpful_count": 37,
            "mal_id": 95813,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1518973.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bobby_S",
                "username": "Bobby_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=95813"
        },
        {
            "content": "Have you ever been in a hospital for a certain period of time? I haven’t. I would imagine a hospital being a somewhat orderly establishment—a place where the sick patients can relax (unless we’re talking about a psychiatric ward… which we aren’t). A hospital would most likely be quiet, monotone, and serious, with a somewhat melancholic vibe for obvious reasons.\r\nWhat does this have to do with Hantsuki? Well, this anime mostly takes place in what seems to be a small, local hospital. By the way, this hospital breaks every single rule that can be broken. Even factoring in that this hospital is small (meaning thatit’s bound to be a little weird) and that this is a six episode long anime (meaning that it’s bound to be a little weird), the things that happen are somewhat over the top. Occasionally, it’s funny; other times, the occurrences end up more than a little weird for reasons that I will go over later. For now, let’s just say that the latter take themselves seriously and expect us to take them seriously. The reason why this fails is because there’s a thin line between knowing it would never happen but not minding and knowing that it would never happen so deeply that you find yourself distracted by that fact while watching the anime. There’s a difference between your eyes glittering with an otaku’s delight (ahem, harem, ahem) and finding a frown on your face that resembles the expression of painful constipation. I don’t think Hanbun Sora is that bad, though, and I’m speaking from experience. Do not fret—the only thing related to my personal life that we’ll be talking about today is this anime that I spent my time on.\\n\\n\r\nThe last three words of the previous statement tie into what Hantsuki is all about. It’s about time—savoring it, using it wisely, cherishing what you had—and even our main character Yuuichi is bound by this philosophy. He is an active teenager who believes more in using his time wisely; even if he is ill, having contracted hepatitis A, he resists recovering quietly in the hospital and treats his boredom by sneaking out. First of all, he does so with ease by just hiding a bit and walking slowly, which isn’t something that I can comprehend. In a hospital, the patients absolutely would not be allowed to wander around the hospital without supervision, and there’s no way that the security would be so light that anyone would sneak out that easily, even with the rebel nurse in charge. Yuuichi does this repeatedly, even taking out another sick patient, Rika, and is never punished except by the nurse, who gives him a bit of a beating that can be chalked up to comic relief. Everything is viewed with such a nonchalant attitude, devoid of reality or logic, until obviously written and somewhat cheap twists come in, and we’re forced to think, “Oh, they meant for this to be important? I see.”\\n\\n\r\nIn six episodes, we all know that Hantsuki won’t be able to tell what something like Clannad might, but at the same time, the story is simple and shouldn’t have been complicated. It’s about a boy named Yuuichi, who meets an enigmatic girl named Rika. She has a disease but they care about one another, meaning conflict. Twists are expected and even welcomed to spice up the story, but in this amount of time, such an anime should not try so hard at something it won’t be able to achieve. They cram melodrama, love, patient abuse, two people to complicate things, grief, and yearning into six episodes; a melancholic, deep atmosphere is attempted and a cheesy, dramatic, immature one is created. Why? The anime can’t keep up with itself. One episode, something that it seems was meant to be serious happens, but by the beginning of the next scene, that atmosphere is gone or just not well handled, leaving a particularly sour taste because of poor writing.\\n\\n\r\nThe reason why the twists weren’t well handled of Hantsuki is somewhat attributed to the sound and animation, as, while the art or music in itself isn’t bad, the way that it’s used isn’t all that amazing. There are times when errors can be seen in the art, sure, but the largest downside is the animation in itself. A character does something like, for example, punching a wall in frustration and thanks to the angle, the jarring impact that could have been achieved comes across as dull. This isn’t helped by the voice acting, which I think occasionally came across as emotionless when the emotion was supposed to be at the highest point. Even the expressions are simple. Sometimes the music, which is good by itself, doesn’t fit the scene or an obvious sound is placed in to emphasize that something happened, making the atmosphere fall flat. This is not helped by the cast.\\n\\n\r\nEvery character has his or her place, every character seems to have a story, and every character moves along the plot, but that’s it. The supporting characters are much more intriguing than the main characters, though they unfortunately get little meaningful screen time or development. The mains, Yuuichi and Rika, have no “in between”—no underlying development. Rika is a brat one second and is sweet the next, as though permanently on PMS. Yuuichi ranges from pushover to “brave” in his stupidity, as though testosterone is being experienced for the first time. He was tolerable until one of his worst moments, where he had absolutely no backbone simply because of depression (and was over it by the next day). The relationship between these two is just there, as though they mutually agreed one day that they loved each other, and we’re forced to think, “Oh? Looks like they like each other. Huh.”\\n\\n\r\nIt is the sad truth that I found Hantsuki overwhelmingly disappointing. It didn’t fit. It didn’t piece together. I can see why people would like Hantsuki, but the best anime calms the part of my personality that scrutinizes deeply while I am watching. If you enjoy somewhat cheesy, melodramatic love stories, you might just have an opinion that greatly differs from mine. On the other hand, I think too much to enjoy something that is so obviously trying to make conflict and, like a slap in the face, does it in cheap, unimaginative ways.\\n\\n\r\nIf I could tell Hantsuki one thing, I’d say, “Your audience is not dumb.”",
            "date": "2014-03-30T01:29:00+00:00",
            "helpful_count": 31,
            "mal_id": 137851,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/2SugoiToActSugoi",
                "username": "2SugoiToActSugoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=137851"
        },
        {
            "content": "Before I start, I would like to take this time to implore that this is my first time writing a review. Please bare with me because I don't expect a lot comming from this review. I am also proud to be writing my first review on this anime because I personally thought this anime was well done.\r\nStory\r\nHanbun no Tsuki ga Noboru Sora had a simple story with no real twists to it. A boy meets a girl but both are very ill.The relationship between the two beings to change both of their lives. Something we have not heard before in romance animes unless you donot watch a lot of this genre. \\n\\n\r\nSince the story was short, I thought the change from one mood to another was too sudden. That gives away from the previous mood making the viewer uncomfortable. However, this anime did a good job conveying one mood to another. There was a purpose for all the events and obviously no fillers (Yay).  The ending of the anime was also very good. One could expect a open cheap ending for such a short anime but I thought it was very satisfying.\\n\\n\r\nArt \\n\r\nOverall i thought the art was well made. The character design was ok, not great nor was it bad. Nothing original about the character designs. The hair styles were a bit more thicker than normal but I saw this in one other anime. There was also some minor defects in that anime. Since they are minor, it did not have a big impact. The only noticeable thing about the art in this anime was the  scenery, which looked more realistic the further one gets into the anime\\n\\n\r\nSound\\n\r\nThe sound effects effectively and beautifully amplifies the mood of the movie. The theme songs was not too outstanding. It felt like just another theme song one can find from another anime. It was hard for me not to skip it, unfortunately i ended up skipping the intros. The closing song was much more noticeable than the intro. The songs played in the end had a nice feel to it and smoothly matched the ideas of the anime. The voice acting was decent although there were some moments where it felt like the show is skipping scenes due to the voices. Maybe it might the the video I was watching, well I can't be 100% sure at the moment. \\n\\n\r\nCharacter\\n\r\nI think the main characters, Akiba, Rika and Ezaki, Yuuichi characters were nicely developed. All the characters had their own unique problems which applied each others problems making the story more deep in meaning. Natsume, Goro played a huge role in this anime supporting the thesis. Although he might sometimes be portrayed as the antagonist, he is a necessity in making the ending the way it is. The The Third degree characters such as Miyuki Mizutani were very poorly developed even for third degree characters. It would be nice to learn more about them and examine their relation with the main characters. I blame it on the producers for making this anime so short. \\n\\n\r\nEnjoyment \\n\r\nThis anime was quite enjoying from start to finish. There was sad moods, happy moods, ecchi moods and moods that make you reminisce. I highly doubt there would be a second season with the current amount of people happy with the overall outcome. The ending gives out a bundle of emotions at once. There was no \"I want more\" or \"emptiness\" in the ending.  The anime made me want to watch one after the other due to lack of dullness. Watching this anime felt shorter than it actually was  because of how entertaining it was.\\n\\n\r\nOverall\\n\r\nThis anime was nicely done for a 6 episode anime. I think it could use one or two more episodes but it was good non the less. I would say this anime would get a higher rank if supporting characters were also developed more deeply but i guess this anime did not intend on doing that from the start. Hanbun no Tsuki ga Noboru Sora would be highly recommended for ages 13+ who is just thinking of starting to watch animes.",
            "date": "2009-12-19T06:29:00+00:00",
            "helpful_count": 28,
            "mal_id": 21512,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210544.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LaevusII",
                "username": "LaevusII"
            },
            "url": "https://myanimelist.net/reviews.php?id=21512"
        },
        {
            "content": "Looking at all those reviews of this anime I thought I was going to see something amazing. Something that will make me cry waterfalls, seeing as most of the reviewers compared this story to Clannad or other great drama series. Oh boy, was I wrong. Not only I haven't watched something good, but I haven't watched an anime as horrible as this one before. Judging by the series rank you thought that would be impossible, but bear with me for a while while I explain why I have rated this as I have.\r\nFirst of all: the story. \r\nActually let's start with it's premise. This isa story about a boy that has hepatitis, he stays at hospital all the time because of that and doesn't go to school. In hospital, he meets a girl named Rika. Ezaki (boy's name) starts spending more time with her and learns that she has a heart disease because of which she probably won't live long, and she needs an operation which chances are pretty low as well. Now the synopsis of the story sounded like i was going in for a very good story if not a brilliant one, as some reviews stated. I was hoping to see a very interesting characters and an amazingly developed storyline which wouldn't probably end well seeing how high it's rated. Well, wrong again. \\n\\n\r\nThis story has absolutely nothing interesting in it. The characters feel like they have no connection at all and honestly the most interesting part of the anime was its opening. There is too much comedy in this, which would be forgivable, if it was perfectly executed with a very delicate manner, but this comedy was far too exaggerated and out-of-place at any time. I honestly felt offended of all the joking about death and there was even a scene when the last wishes of a dying old man was to give porn magazines to the main character which stayed in the same hospital. This is just too much. Or a random scenes when guy dresses as zebra and fights people, main character hanging from a rooftop by a rope to get to Rika's room (was those scenes even supposed to be funny), i didn't smile even once during this and honestly i don't know how anyone possibly could. Further examples involve beating a patient on the rooftop of a hospital, nurse driving in a race car at full speed in town, nurse's friend trying to sleep with Ezaki and quotes of almost every character.\\n\\n\r\nBecause of this failed comedy and exaggerated drama, the show didn't feel believable at all. Every action any character took was painful to watch and by the time i got to episode 6 i felt like i was in Rika's condition, because of the writing. Nothing was in place, nothing fit in the anime. This was suppose to be a drama about a dying girl and a boy falling in love with her, instead, i just didn't know what i saw at the end, it was ridiculous. \\n\r\nThis is very, very surprising considering that the script writer and creator of the series is the same guy who worked on an anime EF, to which i gave a 10. Guess he only used source material in Ef anyway so that should explain it.\\n\\n\r\nThe story is undoubtedly the weakest point of this show and seeing how i judge almost every anime by it's story, this had to have gotten a score that it got. It truly deserved it. I thought that maybe the ending was so good that it convinced people to change their opinions of this show, but it was horrible as well.\\n\\n\r\nIf I could name only one thing this story lacked it would be subtlety. Is it too much to ask for a mature drama anime? I guess so.\\n\\n\r\nCharacters :\\n\\n\r\nOne of the weakest characters in terms of emotional connection i had the pleasure to see. They didn't feel like characters at all. Every action that any character took was out of place and i think that's mostly why it happened. I didn't care for them at all, especially for what will happen to Rika which is the worst thing to say when the anime is based on her condition.\\n\r\nMaybe if the show focused more on her and showed more of her story, this could've look different. The show however skipped very important subjects focusing on horrible comedy and background characters too much. \\n\\n\r\nRika is a quiet girl that reads books all the time. She has no intention of making any friends in the beginning and when she finally makes friends with Ezaki, when she finds those magazines she starts to hate him just like that. She quickly forgets what he's done for her and hates him one day, while being friends with him the other. She also tries to occasionally quote something from one of her favorite books, which almost always seems out of place. Despite that, she is probably the best written character on the show, which just shows how terrible it is.\\n\r\nEzaki is a normal boy that stays in the same hospital. The nurse tells him about Rika one day and orders him to go talk to her, which he does. The biggest issue i had with him is that i couldn't find any emotional connection between the two. He always did what he was ordered to do. It's like he didn't have any emotions at all. He just didn't seem believable at all to me. He was also the most boring character in the anime so there isn't really much to talk about.\\n\\n\r\nThe background characters include:\\n\r\n- The nurse which always yells at her patients or hits them (seriously who even hired her to do this)\\n\r\n- The doctor who beats Ezaki at the rooftop for no apparent reason and is also a heavy smoker and has a drinking problem (wow, what a nice hospital it is)\\n\r\n- Tsukasa, Ezaki's friend who occasionally dresses as a zebra and fights with people (very creative)\\n\r\nOther characters aren't even worth mentioning. The don't bring anything to this anime and i have no idea why they were even featured at all.\\n\\n\r\nThere isn't much to talk about in terms of music in this anime. There just wasn't any good. OP and ED both are very average one's in terms of text and music, they're not horrible and are, for me, the best part of this anime but they're just not much to talk about. The instrumental tracks weren't really disturbing but weren't memorable either.\\n\\n\r\nI have to say i liked characters designs. They weren't anything special but they felt nicely done. Also background designs were very nice as well although they could've been a little more detailed. What i didn't like was the animation of the moving vehicles. Absolutely horrid. But that was the only negative thing that stood out so it was good overall.\\n\\n\r\nEnjoyment? I'm just going to skip this part. Absolutely none.\\n\\n\\n\\n\r\nOverall thoughts:\\n\\n\r\nThis is the worst anime i have seen so far. While the first episodes was promising something average at least, with every episode it just got worse in every possible way. \\n\r\nAt the end it was so painful to watch i had to turn on some good music and just watch it muted with subtitles. Comedy sucked from the very beginning, overuse of drama could be seen all the time and the characters didn't feel believable at all as every action they took made absolutely no sense. But the most interesting this are all the good reviews that were written. Maybe I just don't have any kind of good taste when it comes to anime. All I'm sure of is that i honestly hated it as much as i have stated in this review. \\n\\n\r\nI think this was a complete waste of time and a dissaster of an anime. (1/10)",
            "date": "2013-07-16T08:38:00+00:00",
            "helpful_count": 24,
            "mal_id": 105581,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1546313.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/goldenmane",
                "username": "goldenmane"
            },
            "url": "https://myanimelist.net/reviews.php?id=105581"
        },
        {
            "content": "To be completely honest, this didn't feel realistic at all.\r\nThe concept was good if you like slice of life and drama or whatnot, but I didn't like the way it was executed. \r\nPart of the problem is probably due to the shortness of it. In only short 6 episodes, it's hard to care about the characters. However, its length wouldn't be a problem if they hadn't tried to add so much information in every episode. For instance, in the first episode alone, Yuuichi is already practically professing his love for this girl who's acted like a brat for the previous 20 minutes of screening. Itjust didn't feel believable.\\n\\n\r\nThe characters and their actions felt forced, too. I can't decide if Rika is a major tsundere or just really bratty. Hell, even if she IS a tsundere - which I usually love - I don't like her at all, and I honestly don't know what Yuuichi saw in her in the first place. In turn, Yuuichi needs to grow a backbone. My favourite character was Sekoguchi, and seeing he's got such a minor role, that's just sad.\\n\\n\r\nThe art was good, the soundtrack decent, but the animation definitively could've been better. There were scenes where the characters' movements looked really unnatural.\\n\\n\r\nOverall, I found this somewhat enjoyable. Maybe if this were a full length series - with better character development and an unrushed plot - I'd give it a rating higher than fair.",
            "date": "2011-12-14T08:40:00+00:00",
            "helpful_count": 21,
            "mal_id": 49171,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/798627.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mandi92",
                "username": "mandi92"
            },
            "url": "https://myanimelist.net/reviews.php?id=49171"
        },
        {
            "content": "Hanbun no Tsuki ga Noboru Sora (HanTsuki) is a simple story of two high school students that fall in love at a hospital, one of whom is going to die.  This was the first synopsis I&rsquo;ve read about Hantsuki a few years ago and was immediately excited.  After reading this synopsis one can already tell what the story is like as well as learn of my masochistic tendencies.\r\nHantsuki does sound and play out like a stereotypical Asian drama.  In fact, I hear that there was a live action adaptation of Hantsuki.  However, what makes Hantsuki is the execution of the storyand the short run.  This anime title was only 6 episodes long so they had to focus on the main story of Rika and Yuuichi.  Very little is wasted and everything seems to push the story forward.  Even Natsume&rsquo;s story is related to the main story of Rika and Yuuichi.  On the other hand, Hantsuki suffers from several &lsquo;extremes.&rsquo;  Hantsuki lacks subtly, many of the things the characters do push the borders of reality.  For example, Yuuichi&rsquo;s friend zebra mask, the crazy nurse, and various other events.       \\n\\n\r\nAs for the characters, here where things start to get interesting.  The interactions between Rika and Yuuichi are quite nice to watch as they grow closer to one another.  Rika is a tsundere however, her &lsquo;tsun&rsquo; was too pronounced, especially for the first 2 episodes.  The things she does borders on abuse and can be very uncomfortable to watch.  This is primarily why I stopped watching Zero no Tsukaima II.  I don&rsquo;t find anything funny when one character abuses another in a realistic fashion (think of this, what if the genders were reversed?).  Yes, she has her reasons but, her actions were way too much for me.  Thankfully, she gets better after the 2nd episodes.  In addition, Natsume also does similar things to Yuuichi.  Once again he has is reason but, the things he does are quite extreme\\n\\n\r\nMuch of my enjoyment of Hantsuki comes from the 2nd half, when the drama hits.  In particular, I enjoyed the scene with the book and Natsume&rsquo;s own story overlapping.  However, Hantsuki isn&rsquo;t completely sad as there are plenty of comedic moments to lighten up the mood (although its a bit much sometimes).  Hantsuki doesn&rsquo;t fall for the trap of going straight to the drama, as many stories do.  The first half did its job to build up the characters to make the 2nd half, when the drama hits, have more impact.               \\n\\n\r\nI rather enjoyed the music in Hantsuki.  There are typical violin and piano pieces however, there are a good about of guitar pieces.  In particular, the OP really stood out for me.  The simple use of character stills, minimal animation, symbolism, and music really worked for a series like this.  In addition, a series like this doesn&rsquo;t need the highest budget for animation.  Never the less, I would have liked it if they had spent more money on the animation.  Art/character design is another story, while it doesn&rsquo;t need a very high animation budget the art/character designs should at least be good.  Sadly the art and character designs for Hantsuki were very simplistic.  Overall, Hantsuki had mediocre animation/art.\\n\\n\r\nHantsuki is a well executed romance/drama that does feel like your typical Asian live action drama.  There are times where the characters and the situations feel a bit too over-the-top, thus lose a bit of the realism.   Although, the story may be short, 6 episodes, they use this time effectively and very little is wasted.",
            "date": "2008-03-25T09:24:00+00:00",
            "helpful_count": 15,
            "mal_id": 3390,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42620.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/slpless",
                "username": "slpless"
            },
            "url": "https://myanimelist.net/reviews.php?id=3390"
        },
        {
            "content": "What to expect: Heartwarming romance without unnecasary fanservice and a dramaturgic touch\r\nStory: ( 7/10)\r\nThe premise and plot for this short series are simple: A boy has to stay in a hospital where he meets a girl with a serious illness. He tries his best to make her happy and has to face few obstacles on the long way.   \r\nCharacters:  ( 9/10)\r\nThe main characters are the sick girl Rika and the protagonist of the series Yuuichi. They are fairly fleshed out, believable and likeable, although  I sometimes got a tsundere vibe from Rika . While they get enough development to justify itas good for a 6 episode series, it isnt groundbreaking. the strongest point would be the interaction of these two. The side characters are mostly there for plot purposes or sometimes comedic relief and arent worth mentioning. Overall the selling point would be the relatability of the main cast. \\n\\n\\n\r\nArt and Sound:   ( 10/10)\\n\\n\r\nPerhaps what I liked most about this show despite the main characters was the music, especially the opening. It fits well and catches the theme of the series very well. The Art is fitting, animation might not be the best but it is fine for a show such as this one. All in all it looks very good.\\n\\n\r\nEnjoyment: ( 10/10)\\n\\n\r\nIf you want something a little bit more dramatic than your typical romance and dont need any fanservice then go ahead and check this one out.",
            "date": "2015-08-12T12:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 195933,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4262783.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Greenixx",
                "username": "Greenixx"
            },
            "url": "https://myanimelist.net/reviews.php?id=195933"
        },
        {
            "content": "A short romance/drama OVA series, \"Hanbun no Tsuki ga Noboru Sora\" is an anime has its moments, but is guilty of trying too hard to create drama. It's supposed to be set in a hospital, but patients are allowed to wander around at their leisure... or even go off on the occasional mountain climbing trip if they feel like it. If they're well enough to do that, why the hell are they taking up space in the hospital? Not only that, everyone seem to be able to do whatever they want without any consequences. Locking ill patient outside in the cold? No problem! Abusive Doctors?That's okay too. It takes a hell of a lot just to get anyone to raise an eyebrow in this \"loving and caring\" hospital.\\n\\n\r\nOther inexplicable elements include the random actions of the nurse's friend, who seem to have a touch of madness in her, and the random appearance of this Zebra mask character... but, if you can manage to sweep all these unrealistic elements into a dusty corner of your mind and ignore it, the rest of the drama elements aren't too bad, as there are some rather touching moments. Despite the show's tendency to resort to the usage of cheap plot devices in order to conjure up melodrama, it's during the quiet periods of melancholy when not much is happening that the anime is at its best. Thinking back on it, I think I actually enjoyed \"Hanbun no Tsuki ga Noboru Sora\" more than I should, considering all the contrived plot \"twists\", but what can I say, I guess I'm just a sucker for those melancholic moments.",
            "date": "2010-07-23T06:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 28796,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302826.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kajia",
                "username": "kajia"
            },
            "url": "https://myanimelist.net/reviews.php?id=28796"
        },
        {
            "content": "Lets start off saying that i give every romance genre anime a trial period. I watch the first 2 episodes, and if i dont like either the story of animation, i scrap it. Although this anime is 6 episodes long, DONT SCRAP IT!. i would usually have not watched it because i dont watch any anime shorter than 12 episodes, but i gave this one a chance.\r\nI dont regret it at all.\r\nWithin six episodes, the characters develop around each other so intensely that you feel like Hanbun no Tsuki ga Noboru Sora has been running for ages. It may seem like a run-of-the-mill romance, butit has its originality. Its set in a hospital, and outside forces are seeing to it that romance is always put to the test.\\n\\n\r\nI recommend this anime to any who like romance anime. I laughed, i cried, and now im depressed that i finished it. It reminds me of other top-class romance anime like toradora and clannad. Only 6 episodes long, but there are no regrets from me.",
            "date": "2010-04-21T00:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 25269,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/319186.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RomanceisAlright",
                "username": "RomanceisAlright"
            },
            "url": "https://myanimelist.net/reviews.php?id=25269"
        },
        {
            "content": "The story is about a 17 year old boy name Yuuichi.  He sneaks out of the hospital every night, and due to his sickness and sneaking out everytime, he has to stay in the hospital longer.\r\nThis nurse that beats on him for sneaking out ask him help her with this patient that has no friends and always lonely.  He falls in love with her, one way to get a girl, and is willing to do anything for her.\r\nFor an anime for only 6 episodes, it is a wonderful peace of work.  A boy that is willing to help her and completes herwishes.  But the story builds up to the story about the girl, Rika's sickness.  Sad and is good.  The ending is good and is worth to watch, if you like to watch romance and tragic anime like this.",
            "date": "2009-03-16T18:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 13250,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shadow_Night",
                "username": "Shadow_Night"
            },
            "url": "https://myanimelist.net/reviews.php?id=13250"
        },
        {
            "content": "Length: 6 episodes\r\nOriginal Airdates: 1/06 - 2/06\r\nDemographic: Seinen\r\nGenres: Drama, Romance\r\nAlso known as: Looking up at the half-moon, Hantsuki\r\nOne sentence description: \"Boy meets a girl who probably has less than a year to live\"\r\nPlot Synopsis\r\nDuring the winter, Yuichi was hospitalized due to hepatitis. Randomly he would try to escape from the hospital but would get beat up by the nurse. One day, he happened to meet Rika, a girl of his age, in the next building. He was fascinated by her beauty, but she was very selfish girl. Although she led him by the nose, he began to be attracted by her. However, when Rika toldhim about her illness, he knew why she acted so selfish; she didn't have long to live.\\n\r\n(From Anime News Network)\\n\\n\r\nPersonal Opinion\\n\r\nThis was the next anime I saw after completing &quot;ef - a tale of memories&quot;... so my expectations were somewhat inflated.\\n\r\nBesides that... this was your run-of-the-mill romantic drama.  On that note... it wasn't bad... but it wasn't good either.\\n\r\nFirst off... the anime length almost felt tooo short.  With 6 episodes, I can't care about the characters, and from that, i can't really understand the emotions that the characters have to deal with. \\n\r\nAlso plot developments were somewhat awkward and felt forced.  Again probably from the fact that the anime was only 6 episodes\\n\r\nActually when i think about it now... all my problems w/ this anime can be traced down to it's shortness\\n\r\nI mean besides that... the anime was decent... it had good characters... just not enough time to develop them\\n\\n\r\nRating: 7/10\\n\\n\r\nSimilar to...\\n\r\n- Air\\n\r\nGuy falls for a girl who's death is imminent.\\n\\n",
            "date": "2008-03-14T19:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 3121,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28549.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tekky99",
                "username": "Tekky99"
            },
            "url": "https://myanimelist.net/reviews.php?id=3121"
        },
        {
            "content": "What is the most precious treasure? Your own happiness? Or the happiness of the person you love the most? \r\n\t\"Hanbun no Tsuki ga Noboru Sora\" or simply \"HanTsuki\", is an anime that I truly don't regret watching and experiencing. In general, without any spoilers, it's about a seventeen-year old boy named Ezaki Yuiichi that gets affected by hepatitis A, thus he had to reside in his small town hospital for a period of time. During his stay, he usually gets bored and goes out to console his boredom, but when he comes back to the hospital, he will occasionally get beaten up by his assignednurse, Tanizaki Akiko. One day, Ezaki Yuuichi meets a girl his age at the eastern side of the hospital, where most serious cases reside. Her name is Akiba Rika and Yuuichi eventually finds out that she's suffering from a critical heart disease that will eventually end her life. Over time, Rika and Yuuichi get to know each other and fall in love. There are some melancholy and dramatic parts, but it gets evened out with a little bit of comedy that somewhat eases the mood. Even though there are only six episodes in the whole anime, it feels more complete than other animes I've watched. The ending had left no other remaining questions I may have, although it may be pleasant yet sorrowful at the same time. \\n\\n\r\nAnimation/Art: \\n\r\n\tI felt that the animation of HanTsuki was very well done. I thoroughly enjoyed their unique, geniune looks and I felt that the voice actors did a fine job. Overall, I had no accusations about the animation or the art.\\n\\n\r\nSound/Music:\\n\r\n\tThe soundtracks fit the feelings and the meaning of the anime fairly well. It made the experience more tragic yet hopeful. The opening song of HanTsuki did a great job in emphasizing the main, overall theme/idea of the story, and the ending song was peaceful and relaxing.\\n\\n\r\nCharacters:\\n\r\n\tThe main characters, Yuuichi and Rika are obviously my favourite characters because of their personalities and the situation they're in. But, some of the secondary characters, such as Yuuichi's school friends aren't as memorable. Probably because the anime didn't give any further background knowledge about them. If they included that, then the anime would have been more interesting. But of course, the anime only had six episodes to begin with, so that must be the reason why they mainly focused on Yuuichi and Rika's relationship. Overall, I felt that the characters (especially Yuuichi and Rika) were really thought out and the anime did an exceptional job in developing their fragile bond.\\n\\n\r\nEnjoyment:\\n\r\n\tI had really enjoyed this anime a lot, not only because it's touching and well done, but because it's a rare story that connects and truly shows the meaning and the impact it has on someone that's wavering between life and death. All in all, I hugely recommend this anime if you're interested in mainly romance and drama. \\n\\n\r\n*At the risk of my life, I will be yours.* - Les Thibault\\n\\n",
            "date": "2012-05-10T18:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 60987,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1297109.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/StarFall",
                "username": "StarFall"
            },
            "url": "https://myanimelist.net/reviews.php?id=60987"
        },
        {
            "content": "Hanbun no Tsuki ga Noboru Sora (Hantsuki), is a 6-episode-long, anime series with its share of comedy, drama, misunderstandings, and romance. It follows the story of Yuuichi Ezaki, a high schooler who has been hospitalized for hepatitis A.  During his stay he meets Rika Akiba, a self-centered girl who has lived in the hospital for a majority of her life due to a serious heart condition.  Without a surgery (with a low success rate), she will surely die.  \r\nStory:  Although not a stereotypical romance anime, it was nothing that blew me away.  Many parts of the story I found useless;the time used for these excess things should have been spent focusing on Yuuchi and Rika's relationship.  I wouldn't have minded the additional parts if the anime was longer and it had more time expand on things. The first episode really got me into it, but the way the anime didn't concentrate on the actual story when they were limited 6 episodes, bothered me. Not putting enough focus and time on the relationship caused me to feel emotionless at parts where I shouldn't have been.\\n\\n\r\nArt: The animation is very clean and neat, but nothing special. The character's looks are unique, almost like a breath of fresh air.  My one complaint is the colors used; they were always very bold.  At times they worked,  at others they seemed almost obnoxious. \\n\\n\r\nSound: Hantsuki has a wonderful opening song that fits the series well, and a pleasant, calm ending.  But the background music during episodes was seriously lacking: very plain and boring.\\n\\n\r\nCharacter: Every character was very realistic. Nothing spectacular, but they did a good job at developing everyone just enough for having only 6 episodes.\\n\\n\r\nEnjoyment: Hantsuki was pleasant to watch and there was never a time where I simply didn't want to watch the next episode.  The way they paced the story bothered me a great deal, and it was hard for me to feel any emotion.",
            "date": "2009-01-27T16:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 11884,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60762.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fizzybubblespop",
                "username": "Fizzybubblespop"
            },
            "url": "https://myanimelist.net/reviews.php?id=11884"
        },
        {
            "content": "An anime who is guaranted to make you tearful even if you are not a person who usually cries in animes. This anime has it all. The perfect plot, Forbidden Love, Abuse and Drama. \r\nWe follow life through Yuuichi’s eyes when the storyline takes place in the hospital. One day he sees a girl almost to beautiful and wishes to get to know her.. When He goes to meet the girl after finding out her name was Rika he finds out that there is more behind her than just her looks.. She is pretty yet also lonely as few, Due to this she is rudeand mean to him.\\n\\n\r\nable to see through her actions Yuuichi stands by Rika’s side and eventually they fall in love.. Forbidden love through, they face their many obstacles…\\n\\n\r\nThis anime is an absolute if you are into sad animes.. \\n\\n",
            "date": "2010-12-28T05:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 33144,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MonjaElisa",
                "username": "MonjaElisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=33144"
        },
        {
            "content": "A history(story) full of charm and joy of life  in spite of its theme, even thanks to its theme, and magnificently served by picturesque but original characters at the same time, audacious humor but neither black nor simpleton, often surprising scenario and characters very successful designs... Furthermore, livens up him is really realistic, and when we know that stories) like that really take place, that hurts, and it is what produces livens up (it) even more fascinating. Especially that the suspense is maintained until her() any end, and we are oppressed by the weight which carries) the central figure the shoulders.\r\nAlthough diagrammatically, him benot very beautiful, without being unpleasant necessarily to look, what we shall have held of this series, it is the beauty of the context, the (story), who, although the characters are ordinary, original rest with regard to(compared with) most of the others liven up( plays.\\n\r\nFrom a personal point of view, I shall note this series 10/10, because it really marked me, and I think that it deserves him, if we stay in the dramatic kind(genre).",
            "date": "2013-03-09T11:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 89171,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1919926.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/suganthan",
                "username": "suganthan"
            },
            "url": "https://myanimelist.net/reviews.php?id=89171"
        },
        {
            "content": "\"The One Minute Which Has Been Stopped\"\r\nHanbun no Tsuki ga Noboru Sora (Looking Up at the Half-Moon) is an anime that unusually has a hospital setting for the most part. When I found this, I was looking for recommendations to Kimi ga Nozomu Eien (The Eternity You Wish for) (I think, or it must have been Ef - a Tale of Memories/Melodies.), hoping to find a tragic story (which is hard to do), and this seemed to fit the bill. Though I thought it was a pretty good series, I was actually disappointed by how it ended (I will leave it at that to avoidspoilers) and, to a lesser degree, the artwork in some areas (more on that later).\\n\\n\r\nEzaki Yuuichi has hepatitis (liver infection caused by a virus) and has to skip school to remain hospitalized for a while. He likes to sneak out sometimes, only to be caught and beaten up by his nurse, Tanizaki Akiko. One day, he sees a new girl in the east wing, which is reserved for serious cases. Akiko tells Yuuichi that there is nothing wrong with the girl, but he should go talk to her. He does, but accidentally lies by pretending to read the same book she, Akiba Rika, reads. When Rika finds out, she makes Yuuichi do her bidding to make up for it, and thus begins their bossy relationship. However, when Yuuichi decides to take Rika to Fortress Mountain, where the latter wishes to go, they have a fight, and he collapses on the ground while trying to say something . . .\\n\\n\r\nAs you would expect from six episodes, the development is quite fast, but not too much. There is time for both comedy and drama, with no fillers. In every episode, important events happen and, at least in most of them, new characters are introduced who affect the plot in one way or another. What is admirable is Yuuichi's perseverance despite being sick himself, putting Rika always ahead. This is how a man should act. \\n\\n\r\nWhat is good about this show is the characters who you will grow to love (except for two that you will hate). The protagonist, Ezaki Yuuichi, is a kind-hearted man who wants to leave his small town for possibly Toukyou. On the other hand, the heroine, Akiba Rika, is a hard-to-please girl who has spent her entire life in hospitals, is always angry and bottles up her emotions (except in front of Ezaki). One of my other disappointments with this anime is Mizutani Miyuki, Yuuichi's childhood friend, who could have been a rival to Rika for the former's affection, but unfortunately never develops to be one; she only appears in the fourth episode and beyond, but it is never explained why she had not visited sooner, despite Yuuichi's other friends frequently showing up. Natsume Gorou has been Rika's doctor for years, and can be quite cunning; he always remembers someone when he looks at his lighter, and is known for being a very good physician, even among his older peers. The nurse, Tanizaki Akiko, is a young, tough woman that smokes and does not like to take crap from anyone; she has a good heart, though. A perverted old man, called Tada Yoshizou, roams around the hospital, and is on good terms with Ezaki; he has a large collection of pornography books. Another good friend of Yuuichi's is Sekoguchi Tsukasa, who can turn into \"Zebra Man,\" which consists of just wearing a mask to conceal his identity in dangerous situations; Yuuichi thinks that the moment they became friends is when he saw Tsukasa searching for a home to some stray cats in a rainy day, and the former offered to help, in spite of not being able to keep them in his place, but Sekoguchi thinks they have been friends ever since they met. Lastly, Yuuichi has one more classmate that visits him sometimes, Yamanishi Tamotsu, but quintessentially has ulterior motives, bothering Ezaki. \\n\\n\r\nLike I said before, the art is actually at a high level, yet there are noticeable errors. When Natsume cries (I think it happens in episode three), I could see that one of his eyebrows is missing at the lower camera angle. Even more annoying is the fact that they flashback that very same scene with the very same mistake. Also, a number of times when Ezaki looks at Akiba while they are talking, it feels like his pupils are not really focused on her and he has \"Itou-Makoto-on-School-Days\" slow reactions to important events. I also do not like how Sekoguchi Tsukasa and his brother's eyes are drawn similar to a straight line. Other than that, everything is fine.\\n\\n\r\nStill, the seiyuu here are pretty annoying. The heroine in particular, Rika, has the same voice actor as Machi, Ayane's older sister from Nagasarete Airantou, which I have seen first, who barely speaks, mostly in a very low monotone, so that killed Rika, who is energetic and talks more frequently, for me. Moreover, One Piece fans should recognize Natsume Gorou's seiyuu, the same as Sanji's (ironically, they both smoke and have a similar personality (i.e., they are realistic; Gorou is not perverted like Sanji (then again, the former is older)), who I have seen first, too. Maybe they was supposed to, but Tsukasa's sounds weak and Akiko's sounds muscular. They still could do a lot worse, though.\\n\\n\r\nHowever, the soundtrack is brilliant. More so with the opening sequence, but the ending sequence as well, it is one of those songs you want to listen, and watch, over and over again. They are both quiet, sad, soothing and simply beautiful. They hint a sorrowful finale.\\n\\n\r\nDespite its flaws, Hanbun no Tsuki ga Noboru Sora is an anime I am glad I watched. There are a few (albeit important) loose ends, but the show still manages to provide a somewhat-satisfactory conclusion. I intend to read the manga (as I do with all great anime and vice versa) because I felt some things are left out here. If you are looking for a short, young drama, you will not regret watching this.\\n\\n\\n\\n\\n\\n\r\n\"Our Hands\"",
            "date": "2011-08-01T15:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 40561,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seijurou",
                "username": "Seijurou"
            },
            "url": "https://myanimelist.net/reviews.php?id=40561"
        }
    ],
    [
        {
            "content": "Want a romance anime that doesnt have to much episodes ? You want below 24 episodes or 12 ? F**k that i can give an anime that only have 6 episodes plus its a romance anime plus mc and heroine ended up as a couple plus also they will ended up together . Well , this anime does have potential and it show how they use those potential in a good way . Story plot are okay for an anime thats as 6 episode and the arts are kinda okay but maybe it can be better . Sounds are okay and characters are so-so .For the enjoyment , its very good despite 6 episode only . Overall , its a good romance anime that have a happy ending . How i love happy ending ~",
            "date": "2015-02-02T10:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 179506,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179506"
        },
        {
            "content": "That was a beautiful story. I never knew that it would be possible to really show the sweet romance and pure love that those two had in 6 epiosdes.  I wished i could see their future together. But i dont mind the ending was perfect. That kiss. That timing. That place. It was all so perfect. I wished he proposed to her on the spot. \r\nIts the perfect love story between lovers who dont have a long time left. If you watch this your eyes will be filled with tears of joy and tears of sorrow. If you truly pay attention and understand andemphasise with them this story is full of emotion. \\n\r\nEvery character in the end you will accept and feel that they fit in well with the story. Even the friend of the nurse helped portray what kind of relationship problems he faces.",
            "date": "2013-03-21T20:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 90419,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1910208.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dipz158",
                "username": "dipz158"
            },
            "url": "https://myanimelist.net/reviews.php?id=90419"
        },
        {
            "content": "Firstly Overall I wouldn't rate this anime at all, I feel bad rating something below a 9 but for the sake of this review I have given it a 5 Overall (Reason being is someone put effort into making it, I shouldn't have to scold someone for that). This will all be explained in the upcoming paragraphs. \r\nStory - The story had so much potential but it was ruined by rushed episodes and weird plot, even after finding out more little details about different characters some of the stuff that happened to the main character didn't make perfect sense in my head. \r\nThe Comedy wasnot that great and was sort of placed in as a filler whereas we could have had more development in those sections,  The Romance seemed quite stale due to many forced encounters between the two main protagonists.\\n\r\nThe story in general was just very rushed which made me feel overwhelmed, to many situations just happened and as a viewer it was difficult for me to react to. \\n\r\nThe ending in my opinion was very predictable, but that isn't a bad thing, in many ways it was a good thing, but I just didn't see the ending they picked being the appropriate one (My guess is they were going for a sort of 'love conquers all' ending, but what it seemed to me was more of a 'This needed to happen now' ending.\\n\\n\r\nArt - The Art was rather well made and displayed, especially most of the night scenes, due to it being based in a hospital however a lot of the scenes where based in the same bland places (which is find I wouldn't expect a hospital to be all happy and such).\\n\r\nThe characters all had different uniqueness's about them which corresponded to there personalities rather well.\\n\\n\r\nSound - The Sound is not something I really notice that often, if I can hear it well it is good. Each characters chosen voice actor worked well for them and every voice actor was able to portray different emotions very well. During some scenes the music definitely enhanced what you felt during that chosen moment. \\n\\n\r\nCharacter - Each character has there strengths and weaknesses, however I felt some characters were a little over exaggerated to add an extra weird feel to the whole anime (In my opinion the anime was meant to feel more realistic, but a lot of the anime points towards the abnormal). \\n\r\nThe 'Villain' is not as such a villain but the characters motives for what they do are terrible and to me it doesn't really suffice what they did during some scenes (However this character was most likely made it be disliked by everyone, but that doesn't mean they should do weird things such as in this anime).\\n\\n\r\nEnjoyment - Ah. This part. I enjoyed some parts of this anime, but it was definitely to rushed  for my liking, however everybody has there own tastes which means other most likely will enjoy this. I don't think it has much re watch value, especially since it is only six episodes long, you can get the jist of what is happening fairly easy, I don't think I need to re watch the series at all as I genuinely do not believe it would open my eyes to something I missed (Maybe I am being to stubborn but I believe that what I saw was the finished product and I for one didn't enjoy it.)  I have quite a good memory so I will remember this series quite profoundly, It was rather unique for what it was, but still, not a fan.",
            "date": "2014-09-17T11:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 160705,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4045661.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mr_Gingee",
                "username": "Mr_Gingee"
            },
            "url": "https://myanimelist.net/reviews.php?id=160705"
        },
        {
            "content": "\"Hanbun no Tsuki ga Noboru Sora\" or \"Looking Up At The Half-Moon\" got better with every episode. I hope this review helps you decide if this is something you'll want to watch.\r\nI watched this anime subbed.\r\nThe story follows two main characters, Yuuichi and Rika. After both meeting each other at the same hospital they currently are checked into, their relationship begins. The story, for the most part focuses on them, their past, and what their illnesses will mean for their future together. This anime is character driven, so don't expect a deep or complex plot. This anime gives us a quick look into their lives,nothing more or less.  I do think sometimes there is some unnecessary drama which can make the story feel quite childish. Other than that though, I have no other major complaints.\\n\\n\r\nThe art of Hanbun simply works. It isn't terrible, nor is it incredible. It is a bit of an older series so it will look somewhat dated. The animation is function, its fine for what it is. In some scenes, the animation can look a little strange in motion. It may sound all bad, but the art is consistently well drawn. I can't think of a single poorly drawn frame that made me look twice.  Overall, its a little rough around the edges but never to the point where it distracted me from the story.\\n\\n\r\nThe sound in this anime makes me feel conflicted. On one side, the soundtrack is quite varied with music that fits almost every scene needed. On the other, while the voice actors for the most part are good, there are some lines that were delivered awkwardly. The sound effects, while sounding dated, are still functional. Overall, the sound quality is good, with some of the voice actor delivering some lazy lines.\\n\\n\r\nThe characters of a character driven story had better be good. Thankfully, Hanbun delivers most of the time. First, Yuuichi and Rika are the stars of the show. Their relationship is paced very well, which surprises me as I thought it was going to feel very rushed since it was only 6 episodes long. By the end of the anime, you'll probably be feeling multiple different feelings towards them,both individually and combined. \\n\r\nThere are many side characters as well. For the most part, they are well developed and entertaining characters. However, few of them do feel very throw away to the point where I wondered why they were actually involved. Some characters you'll start off hating. But by the end of it, you'll be looking at them in a different light. I think that marks well written, and well developed characters.  \\n\\n\r\nI do have one somewhat major complaint with this series though. This series is listed as a comedy, which it is. There is some humor here sprinkled in, which is fine... until it starts seeping into the more dramatic and depressing moments. I think this anime could've done a better job at separating the comedy from scenes that should be very depressing. It just tonally didn't sit well with me. It doesn't happen often, but enough to warrant this criticism.\\n\\n\r\nSTORY: 7\\n\r\nART: 6\\n\r\nSOUND: 6\\n\r\nCHARACTER: 8\\n\r\nENJOYMENT: 7\\n\\n\\n\r\nTo end this review, I will state that I was surprised I enjoyed this anime as much as I did. It has somewhat of an average and slow start, but as time continued, my enjoyment went up. I do think this series is worth watching as it is very short, and you could watch it all in one sitting. I also really liked the mixed emotions it gave me. Its both so happy yet so depressing, and it just gels together perfectly into an enjoyable experience. If you are looking for an anime that'll make you feel and think about life circumstances, this one is for you.\\n\\n\r\nThank you for reading this review. If you have any comments, please feel free to message me.\\n\\n",
            "date": "2018-03-26T21:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 275270,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5268743.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/The_LoliLord",
                "username": "The_LoliLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=275270"
        },
        {
            "content": "Kind of disappointed and kind of satisfied. \r\nBiggest problem i have to say is that 6 episodes is way to short for only 23 minutes episode. We get stuff that seems rushed and undeveloped. Such as the first episode. So much stuff happens.\r\n~~Spoilers~~\r\nWe also have stuff like a Doctor that acts comically evil at times. A nonsensical scene where a chick tries to sleep with the MC.\r\nThat scene where the MC almost has sex is so out of left field. It doesn't even make sense. We are only shown the girl character once before but now she is trying to sleep with this dude. \r\nAlsojust how some characters react or act. Example being the Female MC's mother. She is for some reason a really big douche to the MC and not even letting the MC visit the Female MC after she came out of surgery.\\n\\n\r\nI do like how the show didn't give the Female MC something as cliched as the character having Cancer. She actually has something that tends to be overlooked. \\n\\n\r\nAlso the art at times can seem eh. It's what i expect from a show from 2006. It's just you can notice some issues with it. Also not a big fan of the Male MC character design.\\n\\n\r\nI did actually have my heart pounding wondering if the Female MC will die. If she did then i think this probably would have a 6 or 7 rating from me.\\n\\n\r\nI feel that this show would'v been better if they removed a lot of the unneeded scenes. Use those to develop the story while ending it maybe at episode 5. Then have tell episode 9 or so the two MC's going to school together with the Male MC helping the Female MC around and doing work. Have the 10 episode them graduating and starting to live together then have the rest be the MC proposing and getting married with maybe both of them having a child or so. End on a happy note and not that she will most likely die in 5 years or so. I feel that this would have made the show a lot better and memorable. As it stands now it's a pretty good show that will be forgotten in time for me at least.",
            "date": "2017-12-13T10:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 265119,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=265119"
        },
        {
            "content": "\"Hanbun no Tsuki ga Noboru Sora\" (or Hanbun no Tsuki for short) is probably the best anime adaption of having an actual 2 hour long painful seizure I've seen all year.\r\nThere aren't many words to describe this show, the only ones that come to mind are: fuck, shit, ass, whatever and bullshit. It was produced by a no-name studio called TAC and features many very talented people who have all done much better stuff in the past.\r\nThe story follows a 17 year old boy named Yuuichi Ezaki who is put into the worst hospital in the country of Japan. He learns that there is agirl in the opposite wing of the hospital who is suffering from an unspecified deadly heart disease. After invading into her room, he learns that her name is Rika Akiba and that she really likes reading books(nerd). Together they take part in a lot of booking around, mucking around but no fucking around. They start to converse with eachother and Ezaki learns about the truth of her father and the mystery disease. \\n\r\nOh and they also fall in love for some reason.\\n\\n\r\nSOUND\\n\r\nThe sound was god awful. There were many times when after a long monologue there'd just be about 3 seconds of silence. If you're a professional sound designer and you do something like that you should be fired. It will ruin your immersion in the story. Luckily for this sound designer there wasn't much dialogue to get immersed in. Another thing he constantly fucked up though was audio mixing. A lot of scenes (prime ex. the racecar scene) suffered from the music levels being way high and the dialogue being so low. \\n\r\nAnd of course the voice acting... yeah, \"acting\". I'm not blaming the voice actors for any of it though. It was clear they didn't have much to work with using the scripts they were given. Amazing voice actor Hiroaki Hirata, voice actor of Goro Natsume, delivered some of the most dullest lines I've ever heard from him. And the soundtrack was just boring and awful and boring and awful and so on. I swear, the audio in this anime is the most abuse I've done to my ears since listening to the new Linkin Park album. And that says a lot.\\n\\n\\n\r\nART\\n\r\nEwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww. That's the review, thank you.\\n\\n\r\nI've seen flash animations with better visuals then this. It looks like wet ass. I really don't know what to say more about it other than childish insults. I guess those 4 years of animations school really went to waste huh...\\n\\n\\n\r\nSTORY\\n\r\nThis script was not written by someone who 1) has any dignity or selfesteem 2) was also in a hospital bed while writing it, most likely in the middle of brain surgery 3) is lazy. Honestly, I don't know where to start. Maybe I should start with the fact that the writer has no idea how a hospital works and who work there. In his hospital, patients (who are minors, let me remind you) with grave diseases can just walk out whenever they want willy nilly. Ezaki and Rika must have left the hospital on their own at least 6 times and nobody gave a flying fuck. Any patient can just go up to the roof and swing about on the walls. And the staff physically and mentally abuse their patients. This paints a pretty nice picture of how much the author didn't give a- I mean how creative the author was to think of such a whacky hospital.\\n\r\nFor the first couple of episodes nothing important really happens aside from some \"\"\"\"\"\"\"\"\"\"funny\"\"\"\"\"\"\"\"\"\" gags. A ballsy move considering they only have 6 episodes to tell a tragic story. Why, the ending must be a surefire masterpiece! (spoiler alert: It wasn't...). \\n\r\nThere isn't really much I can talk about without getting into spoiler territory, so you’ll have to take my word that the ending is definitely not worth it.\\n\\n\\n\r\nCHARACTERS\\n\r\nProbably the root of all evil for this show were the characters. All of them were lackluster and the horrible voice acting and art did not help. I think it would be best for us to examine these characters one by one to see where the biggest problems really lie. Characters will be listed in order of importance to the plot.\\n\\n\r\nThe MC: Yuuichi Ezaki\\n\r\nProbably the best character in the series depth wise, but that doesn't mean he was any good. He falls in love with Rika even though she only acted like a bitch to him, so I guess hes a masochist? We don't really know that. In fact, we know fuck all about Yuu(nickname for Yuuichi) other than he's a troublemaking pervert. He might have been the only one with a comprehensive character development. But that doesn't really matter since he lacks all charisma and is way too boring for an MC. He's also an absolute cuck who let's women step over him.\\n\\n\r\nRika Akiba\\n\r\nOh god. She is one of the main reasons I hated this show so much. She has no consistent character and none of her actions ever make any sense. She got incredibly upset when she found out that Yuu had massive amounts of porn and just didn't speak with him for a week. Nobody really knew why that  upset her, so we just had to make something up like \"she thinks porn is disgusting and can't express her feelings\". She constantly pulls shit out of her ass and does the most senseless things which led me to do something else whenever she was speaking.\\n\\n\r\nGoro Natsume\\n\r\nThis man does not have a PhD. Unless by PhD you mean \"pretty horrible douche\", that he certainly is. One of the first things he does in the show is beat up a minor for seemingly no reason. We later learn that it was all for a good cause (Spoiler alert: It wassn’t). Because of a tragic event that happened in his past, he decides to abuse the two MCs so that Ezaki wouldn’t end up like him, a psychopath not fit for his profession.  It turns out all right though, as by the end of the show he has grown into a slightly less sociopathic bastard who’s whole life had been a lie.\\n\\n\r\nAkiko Tanizaki\\n\r\nShe was supposed to be a „comic relief“ character in this show since other than introducing the two main characters she had almost no major role in the plot, other than yelling at people sometimes. She also helped her bed ridden patients escape the hospital multiple times. Was it so that they could get some ancient medicine that can cure her disease? Was it to defeat an evil warlord set to destroy the hospital? No, it was just so Yuu could go get his polaroid camera for the next time they snuck out of the hospital.\\n\r\nSide characters\\n\r\nThe side characters had no character. They couldn’t bother, they were too busy making jokes about old man’s porn mags. Isn’t it funny that an old man had many porn mags? Hilarious.\\n\\n\r\nENJOYMENT\\n\r\nFor the first couple of episodes I wasn’t really sure if this was supposed to be a comedy or a drama. The setting was calling for sadness so I thought it might be a drama but none of the characters were well written enough to care for. There were a lot of failed attempts at humor that had no place in the mood of the story. What I did appreciate however was the tiger mask reference and one scene very scene in the show, the latter for a very wrong reason. Don’t get your hopes up, it was only entertaining because of how stupid it made the writers look. It was of course the scene where Akiko’s friend randomly picks Yuu up on the street and takes him to her place. Jokingly, I thought „here comes a sex scene“. Never in a million years did I think that this would happen between 17 year old MC and 20 something sidecharacter who we know nothing about. I could not imagine anyone, no matter how gullible, to put something like that in your story.\\n\r\nAnd I shit you not, they did.\\n\\n\\n\r\nIn conclusion, I say that watching Hanbun no Tsuki feels like putting your genitals in the sharps container in a hospital. If you’re lucky, you might just prick yourself on a needle filled with heroin and have yourself a jolly time. However, it is definitely not worth the 30 other needles stabbing you in the shaft.\\n\r\n(ps. Dont actually try doing that in a hospital. They will kick you out.)\\n\\n\r\nHanbun no Tsuki ga Noboru Sora gets a generous 4/10",
            "date": "2017-08-19T13:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 255825,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5282630.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MDLegs",
                "username": "MDLegs"
            },
            "url": "https://myanimelist.net/reviews.php?id=255825"
        },
        {
            "content": "Story 8/10\r\n     So the story in this anime is a tear jerker. It’s about a boy who is admitted to a hospital and befriends a girl who is also in the hospital. As they become closer their feeling grow closer and closer, however the girl has a fatal disease and does not have much longer to live. So they make the best out of what remaining time she has left. \r\n     The story is really good and I really wanted to give this a 10/10 but the show is just too short and while the story doesan amazing job of pulling you in, it’s just too short for it to elaborate on a few topics. I.e. the relation between the doctor and Rika (female main character). \\n\\n\r\nArt 9/10\\n\r\n     The art is very well done for how old the show is. While I do think it could be much better if it was remade with current art style it does a great job at portraying every detail?\\n\\n\r\nSound 7/10\\n\r\n     The sound is only getting this rating because there wasn’t much of it to set the mood. The mood was set by just the story and character design so sound didn’t really play that much of a role.\\n\\n\r\nCharacter 9/10\\n\r\n     As much as I wanted to give the characters a 10/10 it suffers from the same issue as the story does and that is it’s just too short of a show to really develop any attachment to anyone but the main characters, and even they don’t show the same attachment as they should in this kind of show. that being said in the 6 episodes that the show ran it did an amazing job in emotionally attaching me to the main characters (just not as much as it should, but still well done).\\n\\n\r\nEnjoyment 10/10 \\n\r\n     I did enjoy this show very much and while it does have its flaws it is an amazing show with a lot to offer in terms of enjoyment.\\n\\n\r\nOverall 9/10 \\n\r\n     I loved this show and while it does feel to short and could use a little more depth in the characters other than the 2 main characters it was an amazing show and am glad I watched it. \\n\\n",
            "date": "2016-08-21T01:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 227242,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028135.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jackfat87",
                "username": "jackfat87"
            },
            "url": "https://myanimelist.net/reviews.php?id=227242"
        },
        {
            "content": "One word to describe this anime: AWESOMESS!\r\nBoth of the main characters are different, but they have also things that are similiar to each other, they are both sick, they've been staying for a while in the hospital.\r\nBut the bond they create with each other is very strong and can't be broken, no matter what happens.\r\nYuuichi is willing to give up everything for Rika, just to stay by here side.\r\nThat also proves that there feelings to each other are pure.\r\nFirst I actually hated the docter (Natsume) because in the beginning he played that awfull trick on Yuuichi so that Rika gets the wrong idea of Yuuichiand that he's only reading porn in free time. But when we get further in the story it already makes itself clear why Natsume whas a bastard sometimes, because he did experience it in the past, and the same thing happened to Yuuichi.\\n\\n\r\nBut luckily it went well with Rika after the operation, and that was a big relief for me, because I don't really like \"bad or open endings\". (that's just my opinion though)\\n\\n\r\nSo in short, this is an anime you won't regret watching it, and I guarentee you will enjoy this serie from the beginning to the end.\\n\\n\r\n-perforM",
            "date": "2009-12-29T08:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 21826,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218943.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/perform",
                "username": "perform"
            },
            "url": "https://myanimelist.net/reviews.php?id=21826"
        },
        {
            "content": "While not a wholly original story, Hanbun no Tsuki ga Noboru Sora accomplishes something unique in its succinct but powerful execution of tired tear-jerking themes. Although short at 6 episodes, it manages to tell a surprisingly deep and somber story about romance with a caveat, backed up by a very small but entertaining cast of characters that help to give the story more meaning and provide the unique execution that this anime presents.\r\nHowever, I come away from watching this in a strange \"half-satisfied half-disappointed\" state. While the anime does manage to tell its entire story with 6 episodes with good development of character and relativelydecent progression of events, the pacing suffered due to it length, particularly in the last episode when it was wrapping up. While nigh-tearjerking, it felt cut off before it could really finish what it wanted to say, tying up the themes and core impact on the world of the show. What I mean by this is that we didn't get to see the aftermath of certain events and how characters reacted to them, we are told this through a very short montage overlaid by the credits. It presented a simple narrative that slowly built up, but the ending didn't really offer the payoff to the buildup that was being made. Also, while this may be obvious, certain characters received very little to no development, but that was clearly to be expected of an anime of this length that wanted to tell a story and was set on doing just that and nothing else.\\n\\n\r\nThat doesn't stop this short anime from being very good, however. Character interactions were done in a satisfying and entertaining way and as we learn more about them, we come to understand their prior actions that seemingly weren't justified. I think this is a tremendous feat for having a very constrained time limit to present these characters and the situation they're in. I don't want to spoil the story, but it felt like every event had a purpose when you really thought about it and there was no unnecessary side-elements to pad the already very short runtime if it didn't have a reason to be there. This includes the drama, which are present in very satisfying and understandable amounts that aren't left going on for way too long and thus souring the rest of the story. Our two leads, Yuuichi and Rika, had excellent chemistry and had understandable emotional reactions to events in the plot despite it not initially seeming so. \\n\\n\r\nIf you're a fan of love stories that are clear on the kind of story they want to tell and don't stray away from that, which treat their few important characters with the quality of development they deserve, you should definitely give this one a shot. Any fan of the genre will find something to enjoy here, whether it be the heartwarming moments between the two protagonists or the healthy and deserved amount of drama woven into the narrative. At 6 episodes, it's an easy yet heavy watch when you come to a realization about how certain things will inevitably end, or begin.",
            "date": "2018-07-06T02:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 283107,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4272639.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fire",
                "username": "Fire"
            },
            "url": "https://myanimelist.net/reviews.php?id=283107"
        },
        {
            "content": "According to the synopsis I read on this website, I thought that this would be a sweet, touching story. After watching the first episode, my hopeful expectations were shredded. In short, Hanbun no Tsuki ga Noboru Sora had a lot of potential, but due to ridiculous characters, tropes, and moments, I found it to be disappointing.\r\nStory (8):\r\nTo begin with, I am actually fond of the story. The premise is pretty original as far as anime series go. It's a slice of life, drama, and romance (with awful comedy bits thrown in the mix). It's only six episodes long, so if watching with minimal breaks, itcan be viewed in its entirety in under three hours.\\n\\n\r\nThe story follows Yuuichi, a seventeen-year-old male who is infected with Hepatitis A, and therefore is currently residing in a hospital room. Despite his illness, Yuuichi sneaks out almost every night, and is often caught by his physically abusive nurse. He has hope knowing that it won't be too long until he is released and can return to his normal life.\\n\\n\r\nOne day when looking out the window he sees a girl his age name Rika. Rika has been hospitalized for most of her life and is aware that it won't be long before her disease claims her life.\\n\\n\r\nUpon receiving encouragement from his nurse, Yuuichi visits Rika's room. He is told beforehand about her tastes in literature and lies about having the same interests. Rika is upset with his deceit and refuses to see him, causing Yuuichi to come up with creative ways to get her to forgive him.\\n\\n\r\nBy spending time together they become friends and eventually fall in love. However, their health proves to be a major obstacle time and again.\\n\\n\r\nThe basic story line is intriguing. It had a great setup for a marvelous love story. However there are too many unrealistic moments that occur within the six episodes that made me roll my eyes too often. For instance, I find it hard to believe that the hospital personnel would just let an underage patient leave whenever he wants, and if this is a nightly routine, why is there no one on guard to stop him? \\n\\n\r\nI do like that this is a romance that does not take place inside a school setting. High school romances are so overdone in anime, and even though the two main characters are technically high school age, the change of setting does win this one some originality points.\\n\\n\r\nCharacters (3):\\n\\n\r\nThe characters are one of the major flaws in this anime. On the whole, I think I may only like two characters out of the whole cast, and one of them receives less than a minute of screen time.\\n\\n\r\nThe main problem with the characters is that there are so many cliches here it's ridiculous. You have your tsundere with a tragic past; you have your tough woman in a role of authority, who's lack of ethics would get her fired in reality; there's the perverted old man; there's the best friend who is there for comic relief; and then there is the pointless fan service character. I haven't even mentioned my least favorite character yet.\\n\\n\r\nTo begin with, there is the protagonist: Yuuichi. This character has been seen so many times in anime past and present. Yuuichi has compassion for others. However, he is too passive and lets everyone (literally) beat up on him. He follows the orders of a girl he has an interest in. When she is being abusive to him, he just takes it and apologizes for every single little thing that causes her temper to flare. I kept waiting for him to stand up to her at least once, but never. However, the move he pulls in the last episode does win him some awesome points.\\n\\n\r\nNext in line is our female lead: Rika. I did not like her from her introduction. This is another character that has been seen countless times. She is rude, emotional, and lets her temper get the best of her. She gets upset over stupid things and blows them out of proportion--for instance she gets furious with Yuuichi for reading an adult magazine, even though they're not a couple at the time. I remember thinking to myself, \"Why is she getting so upset? That's not even her boyfriend.\" Her tragic backstory of being chronically ill is used as a way to excuse her behavior, which I feel is poor writing. Then later it is mentioned she's had this personality since childhood. To her credit, she does undergo some character development by the last two episodes.\\n\\n\r\nNext, is the primary nurse Akiko.  In the first episode I was wondering how someone like this managed to be hired as a registered nurse. She's physically abusive to her patients and colleagues. I felt that this character's personality (even though I know it's a common character type in anime) ruined some of the realism, knowing that someone who behaved this way would not keep her job in a hospital. However, I think it's clear she does care about her charges, even if she has an unorthodox way of showing it.\\n\\n\r\nNow onto my least favorite character in the entire series--the surgeon, Natsume. I just found him to be overall unpleasant. Like Akiko, I don't understand how he hadn't been fired by the end of the third episode.  As we see with Rika, his tragic backstory is used as a way to explain his inappropriate behavior. Even if he did have reasons, I found them too weak to justify his actions.\\n\\n\r\nThe only character that I actually liked all the way through was Yuuichi's best friend Tsukasa. He is genuinely nice and willing to help out his friends without question. In fact Yuuichi mentions that it was him witnessing Tsukasa's kindness that prompted them to be friends. Sadly, he is a minor character and gets minimal screen time. The good news is when he is on screen he is entertaining.\\n\\n\r\nLastly, there is Akiko's childhood friend, Misako, who is there for no reason but fan service, and an awkward, unnecessary subplot. (I'm not kidding, this subplot just happens, has no effect on the overall story, and is never mentioned again.)  \\n\\n\r\nPretty much all the other characters in this anime are pointless.\\n\\n\r\nI feel that the characters can make or break a story, and the ones in Hanbun no Tsuki ga Noboru Sora, for the most part, are lacking.\\n\\n\r\nArt (5):\\n\\n\r\nI was not too impressed with the art in this anime. There is nothing that really stands out about any of these characters that would make them memorable. They look like any ordinary anime character. Sure Rika is designed to look cute, but even she wouldn't stand out among a lineup of ten or twenty other random anime females.\\n\\n\r\nThe settings are not that interesting to look at either. When Yuuichi and friends are taking Rika to school, I believe only a hallway, a locker room, and a classroom are seen, and not much of the location is used. In the hospital you see little of the character's rooms, or the rooftop. With the rooftop scenes, there are a few instances of seeing the view of the other buildings or nature, but that's one of the few exceptions.\\n\\n\r\nThe animation is minimal. The art itself is nothing breathtaking.\\n\\n\r\nMusic/Sound (8):\\n\\n\r\nThe opening and ending theme songs are calming. It's a nice mood setter for the story. Even if it is a drama, there isn't a lot of action, and for the most part the pacing is mellow. \\n\\n\r\nThe few times I noticed background music during the actual show, it was decent. Both songs I can remember are instrumental. One sounded like elevator music, so it wasn't too enticing. The second was guitar music during a more crucial moment, so it did add to the excitement, without being overbearing, which I feel matched the moment.\\n\\n\r\nI believe that the music, while it doesn't necessarily stand out among amazing anime soundtracks, it does work for the scenes in which they are used. I feel that it is better to have less dramatic, but fitting music than excellent music that clashes with the scene at hand.\\n\\n\r\nOverall, I have no complaints with the soundtrack.\\n\\n\r\nConclusion (5):\\n\\n\r\nIn all, I feel that the story itself could have been great, for it is original. Had it focused more on keeping that originality, instead of relying on tired tropes, I would have enjoyed it better. Also, the characters were too unlikable in my opinion.\\n\\n\r\nThe art is mediocre. While the sound is good, it couldn't make up for what all this series lacked.\\n\\n\r\n5/10.",
            "date": "2015-11-29T21:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 204489,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3897697.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmberAmethyst",
                "username": "AmberAmethyst"
            },
            "url": "https://myanimelist.net/reviews.php?id=204489"
        },
        {
            "content": "This has been the first anime to inspire me to write a review on it. In my opinion, it definitely defeats CLANNAD, Air, and (possibly) Kanon.\r\nStory: 10/10. It contains a decent amount of realism, but definitely not to the point where the anime gets dull. The story is also short, but yet it feels like it's well paced, never feels rushed or dragged on, and I would not have lengthened the series at all. \r\nArt: 10/10 I don't know. I never failed my Art class, but I wasn't godly at it either. Don't expect any critique from me, as it is basically invalid. All Ican say is that I enjoyed the animation and art style.\\n\r\nSound: 10/10 The songs throughout the series made the dramatic scenes much more dramatic, made the comedic scenes and overall improved the entire show. The OP accurately conveys the emotions and romantic development that you should expect, and the ED is just as calming and relaxing as the OP.\\n\r\nCharacter: 9/10. The main problem with the characters are the doctors. The nurse, a typical tsundere that smokes in the hospital as well as Natsume, the lead physician for Rika. While they were dislikeable at first (mainly Natsume) their motives were made clear, and showed quite a large amount of character development. All the characters in the series were likeable and the end, and Natsume had been forgiven by me. Unfortunately, Natsume pissed me off so much it had led to me yelling at the monitor, \"YOU SICK BASTARD, YOU DON'T DESERVE TO BE A DOCTOR!\" Regardless, the characters were still enjoyable.\\n\r\nOverall: 10/10. While if you check my ratings, they all are really high, it is because I cannot rate them a \".5\" or some anything in between, and even if there is a method, the scores are what the series deserves. This anime had been outstanding for such a short time, amazing pacing, and enough comedy as well as drama to the point when they both synergized with each other, and made for an outstanding series. The basic premise may not be original, but the story and development is, creating what I believe to be one of the best animes I have ever watched (definitely in top 3)",
            "date": "2013-07-22T20:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 106419,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2774099.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Makishanuto",
                "username": "Makishanuto"
            },
            "url": "https://myanimelist.net/reviews.php?id=106419"
        },
        {
            "content": "{This is my first, bear with me}\r\n\"Hanbun no Tsuki ga Noboru Sora\".   Both the male and female main characters have illnesses and are subject to hospital.  They meet.  One has a very severe illness and may die any time.  The anime really encourages me to  cherish the things that I have.  Cherish time.  Use it carefully.  And with that, be happy.  The memories will last an eternity.  \r\nEven though the anime is only six episodes long, it felt longer.  I felt like I knew the characters rather well by the end, and itfelt like a lot has happened.  \\n\\n\r\nThe storyline itself seems to  [unless I am mistaken] parallel a volume of novels called \"Les Thibault\"  In fact, I might actually grab a set from my local library.  \\n\\n\r\nIs it cliché?  Possibly.  I haven't watched many animes to state that fact, but nonetheless, enjoyable.",
            "date": "2010-10-29T21:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 31701,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GenesisX",
                "username": "GenesisX"
            },
            "url": "https://myanimelist.net/reviews.php?id=31701"
        }
    ]
]