[
    [
        {
            "content": "This review will contain significant spoilers to illustrate several lapses of logic within the show.\r\nI thought I'd put in my two cents to this show to help contrast some of the more positive views. Zero kara Hajimeru Mahou no Sho (or GoZ as I'll refer to it) is in every sense a mediocre fantasy show. It does very little to distinguish itself from it's peers of the fantasy genre and has multiple lapses in logic and commonsense.\r\nGoZ is a action magic fantasy that follows the story of three characters. Two witches, named Zero and Albus as well as a unnamed mercenary. Zero is a somewhatspecial witch as she is the author of the titular Grimoire of Zero that has spread magic into the kingdom in which the GoZ is set. Zero is searching for 13, (and her grimoire) we do not know her reasons for searching for him, who then comes Albus, who is as far as we know is a fairly average young witch who originally was seeking the mercenary's head as he is a beastfallen, who's bodies apparently hold special and useful properties for witches. Zero resolves the issues and hires the mercenary as her guard. Doesn't sound to bad at first. It goes to shit later in the show, when you start asking questions.\\n\\n\r\nWe learn Albus is apart of a coven or witch group called the Sorcerers of Zero, who we later learn, who's members have all signed a blood contract with a mysterious man only referred to as \"Him\". What does that contract entail? Death, if you threaten his safety, you will die. Pretty hefty contract for people to make with a person they've never seen nor met. Lapse in logic: 1, bad writing: 1. So the Sorcerers of Zero are idiots, that much is certain. At least they're nice idiots? Not really, the Sorcerers burned a village to the ground for the unjust murder of a kind witch, named Sorena, who you will later learn of. They ignored all innocents and indiscriminately murdered an entire village. Though this has happened in history so I won't deduct any points from it, I just thought it'd nicely illustrate the sort of characters in the Sorcerers Of Zero.\\n\\n\r\nAnyways, onto the next issue. Throughout their journey, the trio grows closer. At one point Zero is giving the mercenary a bath, how cute. At that point she takes it upon herself to cast a spell on the mercenary's body that will redirect all damages he takes unto her. Yes, she decided all injuries the man / creature she hired to protect her safety shall be redirect to her. Seems a little ironic and counter intuitive. Lapse in logic: 2, bad writing: 2. Sure you can say that it's sweet and all, that she cares for him, but frankly it's a stupid move, driven by bad writing.\\n\\n\r\nNext issue. We learn Thirteen is Zero's enemy and throughout the trio's encounters we learn Thirteen's motive for doing what he's doing. Which is indiscriminately murdering witch's. He's doing it for Zero, but he won't listen to Zero who tells him she doesn't want this. Until like the third time she verbalizes this in which he magically decides 'oh she was serious. Guess I'll stop murdering witches and shack up with Zero and her mercenary.\" Lapse in logic: 3, bad writing: 3.\\n\\n\r\nAnd again, next issue. We later learn Albus (which is a man's name if you ask me) is actually a girl, and not just any girl, the granddaughter of that good witch who was unjustly murdered. Why is this relevant? Throughout the trio's journey Zero reveals she's looking for her grimoire and 13. Albus says that the sorcerers have it, and when they arrive to the sorcerers hometown, which has been freshly massacred, says that perhaps Soreana's granddaughter had escaped with it. Wait what? That's her. Why would she lie to the hero which her group named herself after? Lapse in logic: 4, bad writing: 4.\\n\\n\r\nSecond to last issue. The world itself. We have plenty of witches in the story who apparently all learned their magic from \"Him\" and the Grimoire of Zero, and if that is the case, why are there witches that predate Zero, such as Sorena. Sure you can just say she popularized or modernized magic, but near the climax of the anime the trio plan to eliminate magic from the kingdom because Zero apparently has the ability to cancel out magic. Talk about plot armor. This also leaves more questions asked. Can Zero cancel all magic? Or just magic based on the Grimoire of Zero? Why can she do this? Can other witches do it? Frankly these things  left the viewer confused. Confused and with unanswered questions Bad Writing: 5.\\n\\n\r\nMy last major complaint is one that is simply cliche. Throughout the first half of the show we learn that there are two important characters, whom we haven't seen. The aforementioned 13, and \"Him\". 13 was a peer and teacher of Zero. \"Him\" is the founder of the Sorcerers of Zero. \"Him\" slaughtered everyone in Zero's previous abode to steal the Grimoire of Zero, and followed up by creating basically a cult named the Sorcerers of Zero. If you hadn't already figured it out. \"Him\" is 13. I won't detail his frankly idiotic master plan, but the fact that \"Him\" and 13 are the same person is comically bad writing: 6. It was visible from not miles away, but light years.\\n\\n\r\nThose are my major issues with the story, as for my other issues, let's dive into them.\\n\\n\r\nThe characters. The character's are not particularly bad or good, they're fairly average. What is however bad about them is their interactions. Almost every dialogue between the major, minor or extra characters fits one of three descriptions. Stupid. Cliche. Contrived. Those three words adequately describe this series' characters, and story.\\n\\n\r\nThe story. Routinely leaves questions asked but unanswered. Has several plot holes and previously mentioned fallacies. And to be blunt, is frankly average. Or it would be without all those glaring issues.\\n\\n\r\nArt. Average, nothing good, nothing bad. Utterly mediocre.\\n\\n\r\nSound. Same.\\n\\n\r\nOverall Zero kara Hajimeru Mahou no Sho is a bad anime. A very bad anime, with countless issues, more than I've likely identified. If you're new to anime or not someone who dives to deeply into things, perhaps this show will be for you, but anyone who likes to dissect content, anyone who is notices little details, or any person who has watched a decent amount of anime. Avoid this flaming pile of shit like the plague.",
            "date": "2017-06-26T12:59:00+00:00",
            "helpful_count": 89,
            "mal_id": 251117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4457183.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yautja",
                "username": "Yautja"
            },
            "url": "https://myanimelist.net/reviews.php?id=251117"
        },
        {
            "content": "Like many shows relating to fantasy, magic, and witchcraft, I can’t say that Zero kara hajimeru Mahou no Sho looks any unique compared to the rest at first glance. I mean, if you look at it carefully, the show’s premise is pretty standard that involves a conflict between human and witches. The additional aspect of beastfallen (cursed humans with animalistic appearances) adds some slight intrigue to the story. But is this show really worth investing time in? Or is it just a show that panders to fans that wants a dose of fantasy in their life?\r\nAdapting the light novel of the same name, Zero karahajimeru Mahou no Sho (Grimoire of Zero) takes a very high fantasy approach with both its characters and story. The most noticeable character is a beastfallen dubbed as “Mercenary” by the witch Zero. They travel together with Albus, another magician and throughout their journey, they learn much more about each other. Still, the primary goal of their journey is to find the Grimoire of Zero, a very powerful spellbook that has potential to change the world. Now wait a minute. Witches? Magical artifacts? Journey? If anyone has seen enough anime, it wouldn’t be surprising if this show reminds them of fantasy adventures like Hitsugi no Chaika, Spice and Wolf, or even to an extent, Berserk. The fact is, this show appeals to a fantasy adventure while it tries to be a show that stands on its own feet.\\n\\n\r\nThe first few episodes of the series establishes the formation of the main trio. Zero encounters the beastfallen and is enlisted as her bodyguard. On the other hand, Mercenary shows fear for Zero because of her status as a witch. Throughout the journey, he also learns that she’s much more different than appears to be. Then, there’s Albus, the third member of the group and we learn much more about this young magician’s past. In the meantime, I think what can hook the audience into this show is the character chemistry. At its core, Zero and Mercenary always gets me curious as the two are so different. Yet at the same time, it’s really fun to see how far their relationship develop as they are put into compromising positions. For Albus, the character’s past is explored through the eyes of another character named Holdem. From first glance, I disliked the way his character is portrayed with his arrogance. As time went on however, the show reveals a different side of him that I thought as very appreciating. So in essence, characters in this series shouldn’t be judged on what they appear to be on the surface until we understand them better. If there’s one character that I genuinely dislike though, it would be Thirteen. Trouble always seems to follow with this guy and he stands as a dangerous obstacle during our main characters’ journey. His persona fits within the stereotypical type of antagonist that gives a sour taste. Not to mention, I really can’t stand some of his dialogues as they sound very forced.\\n\\n\r\nNow if you’re wondering about the main story, the core of the show still involves the characters’ journey in this fantasy adventure. To be honest, the first half of the show feels like it suffers from pacing problems. I don’t mean that by adaptation standards but just in general as some episodes focuses too much on the characters’ lives. It can actually cause less interest for viewers as by the time I finished watching the 5th episode, it seems far less focused on finding the Grimoire. Still, I would also say that the story does improve later on as some episodes got me much more invested into characters such as Mercenary and Albus. The background story told by Holdem in particular felt like a highlight in this show as it not only gave insight about Albus’ past but also how the world viewed witches in general. While I dislike Thirteen as a character, I do find his role in this show to be very thrilling. The way he plays mind games with Zero and Mercenary adds a different dimension of drama that builds more and more. So in essence, the general flow of the storytelling has slow start but gradually develops as more episodes progresses. It will test the patience of the viewers especially those who are less interested in the characters and more invested into the plot.\\n\\n\r\nAdapted by White Fox, it’s not unusual to see that the artwork has some resemblance to other fantasy series. Re:Zero is the first show that comes to mind as Zero has some resemblance to Emilia. However, I would say that Zero is like a dynamite that comes in little packages. She is short but has enormous potential as a witch. Mercenary has the animalistic look with his tiger-like face but barbaric human body. Similarly, Holdem looks like a generic wolf guy you’d expect to see in most fantasy anime. Albus is designed to look fragile and it’s sad to say, but the young magician really doesn’t stand out compared to the other cast members. Still, artwork of the show looks visually appealing if you watch it with a fantasy mindset. On the other hand, I’m not very impressed by the general world building as many places our adventurers’ wanders looks too dull and unoriginal. \\n\\n\r\nFor a show about fantasy adventure, it occasionally lacks the mystical feel but thankfully with the soundtrack, it retains its credibility on most parts. From my viewpoint, both the OP and ED theme songs are quite colorfully decorated. The ED theme in particular delivers a more charming presence of the main characters between Zero and Mercenary. I’m also impressed by the voice acting of nonhuman characters such as Mercenary and Holdem. In many ways, they sound very human.\\n\\n\r\nAh, Grimoire of Zero. This is a show that some people mistook it for Re:Zero’s second coming at first glance. On paper, it’s a fantasy adventure and one that mixes in humans, witches, and beasts. By storytelling standards, it’s nothing impressive to write home about. However, once I got invested into the characters, the show felt more special at heart. It’s not a golden egg in a treasure chest by any means but is still a fun ride if you’re feeling the will to take.\\n",
            "date": "2017-06-26T07:54:00+00:00",
            "helpful_count": 54,
            "mal_id": 251094,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=251094"
        },
        {
            "content": "What starts out as a typical quest to right her own wrongs turns into a more complicated anime after she loses her soup, we are introduced to the initial characters and are shown different parts of the world's state and history. With themes that are similar to Junketsu no Maria, the anime as it is right now is slowly expanding our knowledge of the state of the world. Whilst the story is not unique in any way it is not by any means bad (I'm sure some of the other reviews will beg to differ), meaning it will be more than enough to keep youinterested. The recent few episodes have started to show a bit of the characters changing as people which is nice (I have qualms with how slow durarara/baccano was despite being a huge fan)\\n\\n\r\nAs for the art, pretty standard, it looks good but compared to most other Japanese anime  it doesn't stand out, expect fluid animations and effects. The one bit that I do think they did well for art is probably the characters which are relatively detailed.\\n\\n\r\nMusic is great, I love the opening. The ending is calm and relaxing (though not exactly my sort of thing) and the bgm is more than capable of sending the mood. That being said due to the lack of action/emotional scenes so far it hasn't had a really good chance to stand out.\\n\\n\r\nCharacters are your typical op + knowledgeable MC (or heroine depending on how you look at it), your character that isn't happy with the world as it is and is seeking the ability to change himself. You have the loyal little magician who may or may not become an antagonist further down the road, which will be interesting to see how it plays out. As I mentioned the characters are drawn in great detail and the MC seems to have some sort of backstory we haven't fully explored yet so I am looking forward to it.\\n\\n\r\nAll in all its a 9 for me, this anime doesn't seem to have made a lot of mistakes but at the same time isn't taking enough risks to really stand out and get a 10 (masterpiece), that being said its more than enjoyable and doesn't let the recent few seasons (which have been great mind you) down.",
            "date": "2017-05-01T08:28:00+00:00",
            "helpful_count": 52,
            "mal_id": 246727,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3647167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/generalcdj",
                "username": "generalcdj"
            },
            "url": "https://myanimelist.net/reviews.php?id=246727"
        },
        {
            "content": "I'm kind of mad because I had my review started and than I accidentally closed the browser.  I guess I'll be writing it again.  Luckily, I wasn't that far.\r\nGrimoire of Zero certainly has brought out mixed feelings among the viewers.  Many people really like or even love the show, while many others, like myself, just like it.  There are also the people who just don't care for it that much.  It's good either way, but it does have its ups and downs.\r\nThe story is simple.  Zero and Mercenary meet unexpectedly after Mercenary falls from a hill top above whereZero was camping out when he was being chased by witches, I believe (I actually forget the details concerning his fall from weeks ago).  She forms a contract with him than and promises to turn him into a human, as long as he helps her find the Grimoire of Zero, which is a book she created that is filled with tons of magic spells and has spread far throughout the land.  The book was stolen from her and she want sit back before it falls into the wrong hands.  The two also meet Albus,a young witch in the group, the sorcerers of Zero.  The three of them start their adventure and ht some of their initial walls.  The first half of the show is a lot more character driven, which was a little dull at times because the anime seemed to be concentrating on simple stuff like that instead of on finding the grimoire of Zero and advancing the story.  Luckily, the second half shows more of the conflict surrounding the war that is close to breaking out between humans and witches, and has many plot twists throughout the scenes.  It could be a better story, but at least it was satisfying and ended on a really good note.  The best part about it is that it feels like an old time fantasy adventure due to how the spells are cast and the backgrounds shown. The beastfallen designs make a nice touch though. I'd give a story a 7 since the quality rounds out nicely despite the ups and downs in the story.\\n\\n\r\nThe art is kind of like the story.  It really makes the show feel like an older style fantasy adventure.  The character designs, backgrounds, and other art pieces are not always the greatest out there, but the category as whole is good.  A few of the background are done really well, especially some that I noticed in the final episode, while some others are just ok.  The clothing is definitely of some typical fantasy designing, but it helps show the character's personalities really well and it is still designed nicely.  The animation is pretty fluid too.  Overall, a 7/10 in deserved.\\n\\n\r\nThe sound is my favorite part of the show.  I expect a fantasy to have some really good music and Grimoire of Zero doesn't disappoint much in this department.   The opening them is quite good, while sounding silly at the same time; it fits very nicely though with a few of the overall simple themes of the show, and it does have nice visuals.  The background music is more fierce during the battle scenes and the more conflict based scenes.  Other times, it is just some good music that compliments the mood in a good way.  I'll give the category a 7/10.\\n\\n\r\nThe characters are kind of a difficult area to talk about.  They are not the most special, but they leave an impact.  Thirteen is kind of a basic antagonist and trouble is always around him, but he does a good job at being part of each side of the war he basically started, which is not something many antagonists can pull off.  Zero is a young magician who might easily be the most powerful magician in the world of the show, seeing as how she made the spell book and that action lead to many people throughout the land learning how to use magic.  She doesn't try to control people with force and enormous strength though and she is more kind hearted and it doesn't take a whole lot to please her.  She is kind of cunning though and she interacts very well with Mercenary.  Mercenary is more a tough and rather stern individual until he grows more acquainted with his master, Zero, and breaks out of his shell.  He is different from other beastfallen since he doesn't use his look and or position as a soldier to get what he wants.  He has a simple dream of wanting to open his tavern.  Albus is an ok character, but she doesn't have as much of an impact as the three I mentioned above, and she just kind of seemed to be present at many times without there being a need for her.  I don't think she needed to be incorporated into the main traveling crew as often the way she is, but would fit better if there was more of a use for her early in the story.  The other characters are not really main people so I'll leave out.  Overall, the characters are rather fun to watch and stand out in their own way, despite not being the best out there, so 7/10 it is.\\n\\n\r\nMy enjoyment earns a 7/10.  I didn't always like every episode as much as another, but overall, I had a fun time watching the anime and some of the scenes were really good.  It has a very satisfying ending too, even though the show has a short run time.  There is more to be discovered in the world, but every main conflict brought about is solved before it ends.",
            "date": "2017-06-27T08:36:00+00:00",
            "helpful_count": 34,
            "mal_id": 251215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=251215"
        },
        {
            "content": "-- This review contains spoilers. Only read if you have finished the series. --\r\nStory:\r\nRegrettably, I had initially believed this show to be a dark horse of the season. However, what I received was not what I had hoped for. Instead of a clever take on the magical fantasy setting, it was a walking stereotype with little to no depth. \r\nIt has a decent start with the mentioning of beastfallen and witches but quickly goes downhill with the very predictable direction. From the unoriginal yet \"overpowered\" main character, to the useless side character, to the boring villain, to the damsel in distress trope, to the lackof exploration on magic, to the obvious and highly convenient \"plot twists\" ...\\n\\n\r\nDiving into the lack of exploration on magc, it has always been something that piqued my interest as far as I can remember. I just find the subject of \"magic\" to be interesting and limitless in terms of potential with story progression. Combine that with adventure, fantasy, and even witches, then it's natural to assume you would see it pretty often, right? I mean, considering its importance to the story, then why is it so little explored in this show? That is not using your strengths to your advantage, and it shows the lack of thought or small preparation in writing. To bring my point full circle, the incompetency in writing continues to be evident due to the poor characterization - which leaves the viewer to become apathetic towards said characters - and the terrible \"plot twists\" - which just ends up feeling anticlimactic to an already unimpressive show. For example, when it was revealed that Albus was a female, it felt as if though they were trying to store value into a character that was otherwise useless and dragging the story down with it.\\n\\n\r\nArt:\\n\r\nHonestly, it could be better, but this is pretty standard in today's times with some relatively low dips in quality here and there. However, that's not necessarily a compliment. With numerous anime per season competing against each other, it should be common sense that having \"better than standard art\" be a necessity for relevancy. If not, then it's safe to assume proper care wasn't given to other aspects of that show as well. With nothing to really capture the attention, then did it have impact in the first place? We, as humans, tend to forget the things in life that are seen as daily routine or events that don't make us remember it afterwards, because in the end it becomes just that - irrelevant. I can say with certainty that Grimoire of Zero is not something I will look back on in the future.\\n\\n\r\nSound:\\n\r\nMuch like the art, the sound was dull and forgettable. Admittedly, the show gave me no reason to listen its soundtracks. In fact, I'm quite happy to not spend time bothering to do so.\\n\\n\r\nCharacters:\\n\r\nThe ultimate sin of a writer is to neglect its characters, which makes sense from my perspective. Why would you bother investing time into a story where you can't stand the characters to begin with? Or if the characters do not grow? The person you are going to spend most time with is the character, after all.\\n\\n\r\nI will acknowledge the fact that the characters do grow in this anime, but it loses overall impact if I did not care for them at any given time. If the cons outweigh the pros, then it would be deemed as a liability and not an asset; an inconvenience or weakness, not a strength. From the get-go, the poor characterization, as previously stated, left an underwhelming first impression that was never really serious at fixing itself. At what point would you cross the line? Maybe the sudden tone shift where it was time to eat in the middle of a supposedly high-tension fight? It's absolutely ridiculous how bad that scene was, in particular. Why should I take it seriously if it refuses to do so? To add insult to injury, 13, specifically, had a questionable motive. Quite frankly, Zero, Albus, and even 13 were poorly written. That's 3/4 characters with the most screen time. 25% of that was decent with Youhei, our mercenary beastfallen. His struggle with society and lack of communication with others was notable, but his backstory needed further looking at.\\n\\n\r\nTo summarize, Zero, Albus, and 13 were liabilities, in my opinion. Rather than bringing something unique to the table, I received unoriginal content with poor excuses of reasoning behind it to boot. \\n\\n\r\nThe show somehow felt incredibly rushed and could have greatly improved had it taken the time to explore more of its own history, the inner workings of magic itself, and fleshed out its characters more. Also, if it just had better writing in general. \\n\\n\r\nLong story short, this was a huge letdown with no redeemable qualities whatsoever. It is quite literally the very definition of \"meh.\" With that being said, it still isn't the worst of the worst.\\n\\n\r\nFinal score: 3/10.",
            "date": "2017-06-27T09:46:00+00:00",
            "helpful_count": 27,
            "mal_id": 251220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3498079.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zelev",
                "username": "Zelev"
            },
            "url": "https://myanimelist.net/reviews.php?id=251220"
        },
        {
            "content": "This is obviously not related to Re:Zero in any way. You probably already know that but i'm just gonna throw it out there. Zero Kara Hajimeru Mahou No Sho is an anime that has been on my \"plan to watch\" list for a long time. In fact, it didn't even have a synopsis at that time if I recall.\r\nStory 6/10: Story's honestly not that great. The beast, Youhei, meets a witch, Zero, and despite his so-called hate for witches, he decides to embark on a quest with her. For a price of course, that being he could finally be turned into a human. \r\nAs ofnow, the pacing is slow. At the end of episode 4, it gets more interesting but the first 3 episodes are basically the building blocks of character development. There is also a bit of action here and there but it doesn't last very long. \\n\\n\r\nCharacter 8/10: A unique MC because of him being a beast. You don't see those too often. I liked him though. He can be tsundere-ish at times and he seems like someone who is good but chooses to be distant and cold towards others due to the fact that he is aware beasts like him aren't treated so well do to their bad history (which is explained throughout the series). Overall, he seems like someone who isn't annoying. Thank god.\\n\\n\r\nBut there is one character who could be annoying at times. And it comes to no surprise that the culprit is the yellow haired kid. Honestly, I would prefer him to not be around but he's part of the reason of the MC's character development and he isn't bad all the time. \\n\\n\r\nMoving on to another important character, Zero. She doesn't seem unique at all. Naive about the world and somewhat overpowered in combat. But still knows whats up when things go tough. I also find it confusing when some people act perverted at her (something you'll find obvious) because she honestly looks like a kid at first glance. Anyways, despite her lack of uniqueness, I didn't dislike her at all. But that could change when we get to see more episodes but I hope it doesn't. This applies to the rest of the characters too.\\n\\n\r\nI also like to mention the relationship between Youhei (beast) and Zero. It isn't forced and it just grows smoothly. That is what I like. Romance done right. Rather interesting too.\\n\\n\r\nAnimation 7/10: Good for 2017. Nothing that felt out of place. Average. Normal. No flaws. No complaints here.\\n\\n\r\nSound 8/10: OP with an adventure tune that we see in alot of action anime and an ED with a calm and relaxing atmosphere that reflects on the relationship between the MC and heroine. I love it.\\n\\n\r\nOverall 7/10: I hope this anime keeps sticking with what it is now with maybe a few minor improvements. Overall, I enjoyed watching it and I'll definitely not drop this.",
            "date": "2017-05-07T18:15:00+00:00",
            "helpful_count": 16,
            "mal_id": 247172,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5522521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zecis",
                "username": "Zecis"
            },
            "url": "https://myanimelist.net/reviews.php?id=247172"
        },
        {
            "content": "Preliminary thoughts on Grimoire of Zero:\r\nI really want to like this show. I want to be able to sing its praises to all who'll listen, letting everyone know how worth their time it is to sit down and enjoy it. But I can't do that right now. I hope by the end of its run, I can at least say it was a memorable experience.\r\nPart of this desire probably stems from Grimoire's resemblance to one of my favorite anime of all time, Spice and Wolf. With a similar atmosphere and general vibe, setting (medieval, Europe), and the same dynamic of two travelling companions (which becomesthree in this case, infuriating but I'll touch on that in the next segment), on a mutual journey, its first episode left me extremely hopeful for its future. Unfortunately, the crossovers end there.\\n\\n\r\nThese types of shows rely almost entirely on the two main characters and the interplay between them. Spice and Wolf's Holo and Lawrence were such a witty and naturally compatible duo, and played off of one another so well, that entire minutes-long sequences of dialogue felt as ensnaring to watch as any expertly choreographed and explosive fight scene. That level of crisp writing and dialogue is simply not apparent in Grimoire of Zero. Most of our character's interactions are trivial in nature and execution, yet the progress in their relationship, and in turn the things they're willing to do for one another, speeds up at a disorienting and bizarre pace. All in order to meet the demands of the plot. Strike 1.\\n\\n\r\nTo make matters worse, Grimoire introduces a practically irrelevant third character into the equation. This addition only serves to cripple the pair's ambiance generally, and to this point I simply cannot deduce the value of the decision. One could argue this character brings to us important information about the world of Zero, but I argue that that isn't reason enough to introduce him as a mainstay which completely derails any and all flow of the main duo. At most, he should have been a character that departed in the span of an episode after giving us the info we needed. Perhaps if this character was at all interesting, I would let this point go without much contention, but alas. Strike 2.\\n\\n\r\nMy main gripe with this show, though, is the way in which it handled its very first *real* conflict. Without spoiling, Grimoire set itself up with, intentionally or not, a grand opportunity to introduce some amazing drama in the second half of its cour. We simply didn't know enough about our characters true motivations and desires at the time of this conflict, which would have given us as the viewer the awesome experience of sharing the main lead's (who is as left in the dark as us) suspicions and doubts as they uncovered the truth. I was extremely excited, thinking back to my excitement after finishing the first episode, \"This is what I've been waiting for!\" Gears turning in my mind, thinking of all the possible permutations available, all leading us to an epic climax. Unfortunately though, Grimoire sinks the ship that hasn't even had the opportunity to set sail, by telling us, within 2 minutes of introducing the conflict and in no uncertain terms, who exactly the villain is and who we should be rooting for. This is simply a failure of good writing, especially egregious when the set pieces have fallen into place so nicely. Strike 3.\\n\\n\r\nGrimoire has potential. It seems to have all the ingredients needed to make a memorable anime, if only its execution were more refined. In fact, even with all of its downfalls, this is still an enjoyable show. I'm determined to see it through, not just in hopes of it proving me wrong, but also because I'm simply having fun watching. And there is something to be said for that.",
            "date": "2017-05-25T18:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 248533,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4851067.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Devorantem",
                "username": "Devorantem"
            },
            "url": "https://myanimelist.net/reviews.php?id=248533"
        },
        {
            "content": "So, the first (wrong) thing this show did was to overestimate the capacity of people to make the difference between Mahō(魔法) - Magic and Majutsu(魔術) - Sorcery. While they are kind of synonyms they have the same difference as normal Alchemy and Alchemy with a Philosopher's Stone. The top review of this series makes this (retarded in my opinion) mistake and makes a lot of comments on the fact that the series is stupid because \"how could witches exist before magic if magic was invented by a witch only recently\" (Jaden Smith anyone? No?). Well, it is stated, SEVERAL TIMES, that they used sorcery, notmagic. Damn, the white tiger (I'm bad with names) even says: \"This magic is very convenient because until now you had to draw circles and make sacrifices\". Also,(this is not a spoiler) regarding Zero's ability to negate magic, (now this is a spoiler) SHE GODDAMN SAYS she made mistakes in the Grimoire on purpose in order to be able to be stronger than any other magic user.\\n\\n\r\nAnyway, I felt the need to clear that up. Now the review:\\n\\n\r\nZero kara Hajimeru Mahou no Sho (Grimoire of Zero) is a fantasy anime. It's set in a world where a civil war between witches and normal humans has created countless victims and it's currently destroying the nation. The series is centered on Zero, a young witch that revolutionized witchcraft by giving birth to magic and Mercenary, a beastfallen (humans with the appearance and strength of animals), and it follows their adventures to find (the stolen) Zero's Grimoire that holds the secrets to magic. \\n\\n\r\nThe series is sweet, short, and the only complaint I have is that they seemed to go out of their way to produce a loli-ish character (must find a way to appeal to those otakus, amiright?) when the girl needs to be over 15 for the story to make sense. The art isn't amazing but I'm more of a story guy so it didn't impact my enjoyment too much. The sound though, it's lacking. A good soundtrack would've made this anime A LOT better. \\n\\n\r\nAll in all, Zero kara Hajimeru Mahou no Sho is in no way an innovative, never-seen-before anime. The whole fantasy setting has been done so many times it's almost impossible to come up with something new. But who cares? Do you never eat the same food twice? I like binge watching fantasy anime with an accent on magic and I feel like this hit the right spot. It doesn't even need a second season, it's fine as it is! If you like magic and fantasy, this anime is a nice thing to watch.\\n\\n",
            "date": "2017-08-19T05:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 255804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426849.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mike98",
                "username": "Mike98"
            },
            "url": "https://myanimelist.net/reviews.php?id=255804"
        },
        {
            "content": "These days, witches are regarded as practitioners of magic and act as the female equivalent of wizards in what would be considered as the pop culture norm for magic.  While their original existence no longer has any place in society today, the history of evil witches, people who have made deals with the devil and practice witchcraft still lingers in the ugly recesses of history.  With that said, what would happen if you put both of them together?  To create a world where in a sense, both the meaning of witches in history and pop culture come together?\r\nStory: The Grimoire of Zerostory starts us off in the land of Wenias, a place plagued by those who practice magic known as witches and men who born as animal known as Beastfallen.  It is here where we meet a certain beastfallen simply known as ‘Mercenary’ for the entire series (and for the sake of simplification), a self-explanatory character that does the mercenary work of killing witches for hire.  On one trip through the woods, he comes in contact with a little witch by the name of ‘Zero’, who tells him that she is on a journey to find what has been stolen, her book of spells, the Grimoire of Zero.\\n\\n\r\nTaking up all twelve episodes of the series to cover just the first book of the original LN series, the adaptation becomes an intriguing story with many facets to its characters, as its main duo of large tiger man and tiny witch protagonists act as a faction-less duo that do practically whatever they want so long as it benefits them and their goals.  We’re given a realistic depiction of the reaction to witches in our own history put into a fantasy setting, which to me is a good way to shape up the main conflict.  As a result, the show allows the audience to view both sides of the main conflict, testing many of the other characters’ morals and actions while providing a good blend of action and humorous character interactions to aid in filling out holes that the main plot leaves behind.  \\n\\n\r\nAdding to that is characterization.  Personally I feel as though the show does have some imbalance with how it chose to develop its characters.  Due to the nature of the show having two ostracized groups of characters in its society (Beastfallen and Witches), the show primarily focused on the witch characters and the witches’ struggles in society rather than the Beastfallen.  Our main protagonist doesn’t really get the time of day aside from a couple choice moments in order to be ‘developed’.  Aside from that, the rest of the series is devoted to the problems that the witches in Wenias face and their on-going war for freedom from oppression.  \\n\\n\r\nDespite that problem, the show is one of the most well paced series that I’ve seen in a long while.  Taking account as many details as they could, White Fox managed to create a series that neither felt boring nor too rushed to watch, letting things continue as they went along at an even pace so that every moment felt engaging.  Many times, I felt as though the episodes were too short because I was so engrossed in watching it.  \\n\\n\r\nWhile less eventful than the climax and many other sections of the story, the ending manages to cap off the first main arc of the series that acts both as an ending to the entire series while being open-ended enough to welcome a second season if White Fox so chooses to do so.  Not really a big fan of how many things were thrown into exposition, but I guess to develop the whole scope of the story’s events, they had to make a couple things via time skip to make things a lot easier.  \\n\\n\r\nOverall, despite its imbalance with who and what it chooses to characterize, Grimoire of Zero was a show that was gripping from start to finish.  Having a simple plot that was explored to almost its full extent, the show managed to be both engaging and entertaining to the end while providing good world building that mixed in the central conflict of the series.  Every episode felt too short for me to fully appreciate, and it left me wanting more.  My only complaint really is that there is no second season.  Please White Fox.  Do it.  \\n\\n\r\nOverview:\\n\r\n+ Well-paced story\\n\r\n+ Simple, yet effective plot\\n\r\n-  Who they characterized was imbalance  \\n\r\n-  Ending is a bit…uneventful comparatively\\n\\n\r\nCharacters:  As mentioned before, the show’s plethora of characters act as members of one side or one motive while our main characters act as a ‘third’ or ‘faction-less’ group that gets involved with their own sets of goals in mind.\\n\\n\r\nThe first is Mercenary; the giant fluffy tiger man that despite having a giant FFVII-esque sword, is actually quite soft and fluffy on the inside with a pension for cooking.  Being a Beastfallen, Mercenary is a character that despises witches and dreams of one day curing him of his beast curse and opening up a pub once he’s human.  As a character, Mercenary is very much a character that sits in his own morals but doesn’t act outside of what he isn’t involved in.  As such, he’s less of a by the numbers fantasy protagonist, and more of a ‘does whatever he wants’ kind of guy, which fits into the story perfectly.  He acts as the more grounded character of the duo and gets some significant change once the series starts picking up and his more ‘lone wolf’ demeanor softens up.   \\n\\n\r\nThen there’s Zero, the tiny white-haired witch who enjoys the simple things in life: food.  Comparatively, Zero is the freer, more airheaded member of the main duo, as she had spent her life in a cave up until her book was stolen, and lacks any kind of basic knowledge of the outside world.  Rather than being a ditzy klutz (mostly), Zero is a calm airhead simply because she doesn’t know anything aside from the intricacies of magic, leading to a majority of the show’s comedic and enjoyable moments due to her hilariously blunt nature and lack of what would widely be considered as ‘common sense’.  As such, she has something of a unique identity that when mixed with her mercenary, creates fun character interactions between two quite likeable characters.  \\n\\n\r\nFor the supporting cast, we’re treated to a myriad of characters who act as players to the bigger stage of the kingdom of Wenias, as most if not all of them have some kind of affiliation to one faction or another in the war for magic.  As such, characters like Albus and the Sorcerers of Zero are clearly defined to think one way while the royal kingdom and its citizens think the other in order to give clear definition on their opinion of the matter and thus easily explain the overall conflict of the scenario.  While less interesting than our main protagonists, the majority of them play their part as the background scenario well, which is the most you could ask for in a series featuring two clearly defined sides.  The only one of the supporting cast that differs from this rule is ‘Thirteen’; a character similar to our main protagonists as he only does what he believes is right/based in his own goals and a compatriot of Zero.  \\n\\n\r\nOverview:\\n\r\n+ Very intriguing main protagonists\\n\r\n+ Fitting and clearly defined side cast\\n\\n\r\nArt: Produced by White Fox, Grimoire of Zero has the clear fantasy look that the studio has used for previous projects in the past (such as Re:Zero, for example)  More or less standard fare in terms of the quality of this day and age, the animation and art quality for the show is good, but not overly amazing or budget breaking.  \\n\\n\r\nI do however want to bring attention to the various forms of magic used in the show, as the intricate circles and various effects of the spells enhance the art quality to truly feel like a fantasy/magic show.  Additionally, and this is more personal than anything, the character design for Zero is amazing.  It’s the right amount of complexity and really fits with the overall aesthetic of the show.  \\n\\n\r\nOverview:\\n\r\n+ Nice touch on the magic usage\\n\r\n+/- Standard art\\n\\n\r\nSound: “Hakkensha wa Watashi”, the OP for Grimoire of Zero is a whimsical rock song that helps provide an adventurous tone to the travels of our main characters and contrasts the more serious tone of the magic war in the series.  Personally, I feel like the song itself isn’t all that memorable, but it is a good track that’s been on a few of my own song loops.  \\n\\n\r\nTo contrast, the ED, \"Hajimari no Shirushi” is a laid back piece that relies more on strings and light piano to elevate a sense of wonder in our characters’ journey.  Accompanied by a children’s book graphic, the ED feels a lot better than its OP counterpart, as it has a nice style to it that gives us a nice contrast everything that the show has given us up until this point.\\n\\n\r\nOverview:\\n\r\n+ Good tracks\\n\r\n+ Memorable ED\\n\\n\r\nPersonal Enjoyment: At the start of the season, I always handpick about a dozen shows to watch/review for the season.  Some are ‘obligatory’ as I watched and reviewed a previous season of it so it’s only natural that I do the same for subsequent seasons, and others are those that I personally find intriguing.  As a fan of fantasy, I found Grimoire of Zero to be interesting at first glance.  Before I knew it, it had become my most anticipated show of the season.  The overall plot had more to offer than just a simple magic-based story and had a lot of aspects that meshed well with each other to culminate into what we have.  I was so sucked into it that I was left wanting more, and I really, really want a second season of this because I really want to see more of Mercenary and Zero’s travels throughout the world plagued by magic.  \\n\\n\r\nDid I enjoy this series?\\n\\n\r\nI think I may have enjoyed it a bit too much, but you can’t really blame a guy for having a preference, right?  Personally I found Zero to be the highlight of the series.  Her character was always such a joy to have on-screen, and I always appreciate a unique character to help tell the story.\\n\\n\r\nWhat didn’t I like about his series?\\n\\n\r\nAlbus was really the big stickler for me.  They admittedly do play a big part in the series, but I just kinda found them annoying with their constant, constant preaching for their look on everything while I just sat there wanting to see something else involving Zero.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you’re a fan of fantasy of magic, I would highly recommend watching this.  It has a unique enough identity large enough to completely separate itself from a majority of the cookie-cutter magic-based shows, showing that original ideas really can be successful.  The main characters are interesting, the entire plot is fleshed out, and it has such nice pacing that it feels almost like magic that this kind of even pacing can even exist in this era of rushed adaptations.",
            "date": "2017-06-27T14:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 251244,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=251244"
        },
        {
            "content": "Once again this is an anime that gave the vibe of a light novel adaptation. Light novel adaptations give a much slower pace in terms of character development, plot, and amusement. Because of such attributes, such anime fails to quickly grab the viewer's amusement when it starts off. However, I do not regret watching this anime, because by about episode 7 or so it becomes interesting.\r\nThe story is considerably well-planned. I can see that the author tried hard to give plot twists, foreshadowing, and such. After having watched 11 episodes, with only the final one to watch, it was certainly worth watching and adding tomy anime list.\\n\r\nStory: 10\\n\\n\r\nThe art was great. I don't remember seeing any lazy parts of the animation, but the style of the drawings in generally was one of those commonly drawn styles. Because of the commonly drawn style of drawing, one would not particularly watch this anime solely for the art style. For some reason, this art style feels so redundant.\\n\r\nArt: 8\\n\\n\r\nThe voice actresses fit with all of the characters. The tiger sounds like a heavy man, Zero (the girl) sounds like how it should be and such. The OP, ED and OSTs all sound like they are on the good side. Perhaps the voice actors could have put more emotion to their acting, because that is the impression that this anime seems to lack, much like that of other average-looking anime.\\n\r\nSound: 9\\n\\n\r\nNone of the characters really stuck with me in the first few episodes, but I can see how the author tried to make them feel like relatable characters by the conversations between Zero and the tiger and such. The character development feels slow, so only after a while, the characters started to stick with me. Also, the relationship between the Zero and the mercenary was quite relatable. Towards the end of the anime, all of the characters will be relatable, because they all have some kind of impact towards the entertainment of the anime.\\n\r\nCharacter: 10\\n\\n\r\nOverall, this anime was enjoyable because it was worth watching. The theme anime seem to focus on the hierarchy of society and the oppressed. The moral and such is something to watch out for because I guess that is what makes the plot of this anime worth watching and interesting. \\n\r\nEnjoyment: 9\\n\\n\r\nThere were relatable characters, good story, nice voice actors, good art. Thus I give this anime a 9. If the voice acting and the art gave more of a deeper impression, I would give this anime a 10. \\n",
            "date": "2017-06-19T18:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 250383,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/eeasuper",
                "username": "eeasuper"
            },
            "url": "https://myanimelist.net/reviews.php?id=250383"
        },
        {
            "content": "So this series is nice and it is kinda great to see a new anime series with races like beauty and the beast\r\nMy complain is just this anime is too pushed and eventhough it takes 1 novel in 1 anime which is freakin slow, they should have been more detailed\r\nI mean like when that wolf and 13 turned into super ally and kind after doing horrible things like mass killing & slaving(btw I still hate that wolf for slaving womens) \r\nAlso what is the reason for albus to like mercenary? Why she kiss mercenary?\r\nAh btw for me mercenary x Alb... *cough* I mean MERCENARY XZERO FTW!! XD\\n\r\nWe do really need some more romance if there any season 2 :3",
            "date": "2017-06-28T07:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 251321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020384.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seadragongamv",
                "username": "Seadragongamv"
            },
            "url": "https://myanimelist.net/reviews.php?id=251321"
        },
        {
            "content": "In short note:\r\nBeauty and the Beast, Fantasy anime version\r\nStory: 8\r\nIt seems like a typical fantasy world adventure at first, but the plot thickens in the middle with several twists behind another twist. Although it feels a bit off in the end, this may or may not be the best point of the show.\r\nArt: 7\r\nStandard LN adaptation art style, and Character Design. But the city in medieval age portrayal , Beastmen model and landscapes was looks nice too. The battle scenes and the spellworks were decent even without that spectacular movement. This is a show about mage after all and mage doesn't move that much. Thespinning bottle scene was hilariously real.\\n\\n\r\nSound: 6\\n\r\nStandard BGM during fights, nice ED. Nothing much to say in here.\\n\\n\r\nCharacter: 6\\n\r\nAside from MC and Main Heroine, all other Character are so plain. The villain was especially have a bad writing that it doesn't even qualify as a villain. The only person that notable was that one dead character that keeps getting mentioned every time along the show, without even met the MC. If only this show has better writings, this show could be much better.\\n\\n\r\nEnjoyment:7\\n\r\nI got hooked for a while in the middle part, but may put off some people in the last bit. If you can bare the lame part with the curiosity alone, you might as well enjoy this to the end.\\n\\n\r\nOverall:7\\n\r\nFantasy world full of mages, with some nice city and background art. Have a decent story with good pacing, with the most lame villain ever. Have some potential in the middle, but falls of in the last part.\\n",
            "date": "2017-07-29T04:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 254119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4671138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NickSpringfield",
                "username": "NickSpringfield"
            },
            "url": "https://myanimelist.net/reviews.php?id=254119"
        },
        {
            "content": "Initially, I enjoyed this series since it portrayed a \"godly\" character and there was undoubtedly a lot of potential, but the last 2 episodes were, if anything, reversing its potential in the earlier episodes.\r\nStory:4\r\nWell, the story had a few twists along the way, but it's along the way of an adventure and trying to resolve a conflict. Basically it's about a war going on between sorcerors and non-sorcerors and how Zero wishes to find her book, but really, it's kinda cliched and predictable at times.\r\nArt:8\r\nKinda standard but smooth animation.\r\nSound:8\r\nKinda standard as well.\r\nCharacter:3\r\nThis is the category that is really subpar. Apart from really scant character developmentand background along the way, some of the characters seem to be inconsistent in their behaviour, thus making the whole storyline hard to understand at times. Especially Thirteen.\\n\\n\r\nEnjoyment:8\\n\\n\r\nOverall:6\\n\r\nGenerally below average especially near the end of the series. The resolution is kinda anti-climatic and strange. Gotta say this is one of the more anti-climatic endings out there. Great potential but poor execution.",
            "date": "2017-07-01T08:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 251642,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=251642"
        },
        {
            "content": "*** Spoilers ahead****\r\nStory:\r\nThis show started out very promising when Zero and Mercenary first met.\r\nThey are both very likeable and they have great chemistry together.\r\nTheir goal was clear: Mercenary helps her to find the Grimoire of Zero and she turns him back into a human.\r\nNow if this show would've just been these two going on a journey to find the Grimoire of Zero, if this would've been an adventure anime, then I would've loved this.\r\nHowever, this was not the case.\r\nThe first warning I got was when Albus joined the crew. \r\nI didn't like him from the very beginning because he was just the typical brat andhe really got in the way of Mercenary and Zero's adventure.\\n\\n\r\nBut over time he grew on me and I learned to accept him and I really liked this show, besides AoT S2 it was my favourite show this season.\\n\\n\r\nBut then the villain, 13, was introduced into the story. \\n\r\nAnd that's where this show went downhill for me.\\n\r\nThey split up Mercenary and Zero for a couple of episodes and shifted the focus to 13 and Zero's relationship.\\n\\n\r\nMercenary and Zero are great together but mediocre when alone.\\n\r\n13 is just your typical villain who claims he does it all for his live for the girl.\\n\r\nNothing special about him at all. (Besides him being voiced by Dio's VA)\\n\\n\r\nThis really brought down this anime for me. Zero needed to be rescued and we also had the typical misunderstanding between the main characters that you get in so, so many stories and that is just annoying because you know how this is going to end.\\n\\n\r\nArt:\\n\\n\r\nIt was done by White Fox and it looks just like Re: Zero, nothing special, nothing fancy but decent.\\n\r\nThough it's missing some highlights which Re: zero had.\\n\\n\r\nSound:\\n\\n\r\nOpening is decent but forgettable, same with the OST.\\n\\n\\n\r\nCharacters:\\n\\n\r\nAs mentioned before Zero and Mercenary are great together but mediocre when alone.\\n\r\nAlbus started as the typical brat in anime but he got better over time.\\n\r\n13 is just bad and ruined this anime for me.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nWhile I was rather harsh on this anime, I still enjoyed it in the beginning.\\n\r\nThe main reason for my harshness is that I was so disappointed after the villain was introduced after liking it so much in the beginning.\\n\\n\r\n6.5/10",
            "date": "2017-06-18T07:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 250240,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4721276.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raycont",
                "username": "Raycont"
            },
            "url": "https://myanimelist.net/reviews.php?id=250240"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI hope to one day write my own novel.\r\nWhile writing reviews, analyses, and essays is my forte, I have always had a keen interest in fiction. Whether completely imaginary like the Harry Potter series or closer to realism like 1984, the approach involves a different mindset that is fun to indulge. Creating witty dialogue. Describing scenery. Forming logical plotlines. It’s much different than articulating how an anime accomplished its goals or basing events off a personal set of ideas.\r\nZero kara Hajimeru Mahou no Sho features a novel of sorts – the Grimoire of Zero –written by one of its characters. In some sense, it contains the purely fictional (to us at any rate). Sadly, it doesn’t contain the solution for the show’s lagging performance.\\n\\n\r\nSTORY\\n\\n\r\nZero kara opens with witches at the stake and a huge white tiger-man fending off a few bounty hunters. After escaping the city, he, by chance, encounters a powerful female sorcerer just trying to enjoy some soup. She offers him the miracle he has always dreamed of: to turn back into a human. He must only act as her bodyguard while they search for her all-important book that, in the wrong hands, could destroy the world. After a finger-blood oath between the two, the witch-hating Mercenary and the “wagahai”-saying Zero begin their adventure in earnest.\\n\\n\r\nSaid adventure certainly contains the right elements to achieve narrative strength. The fantasy setting. The writing chops. The noticeable themes. Unfortunately for Zero kara, it takes these elements, attempts to form some magic with them, and ultimately summons a lackluster tale despite its many possibilities.\\n\\n\r\nLacking begins when it tackles the fantasy that drives the setting. The anime takes place in a world that resembles Medieval times with an extra helping of magic and beast men (known as “beastfallen”). To the show’s credit, it does try to build its world at times. For instance, as the characters investigate the carnage following the sacking of the village of Latette, Zero describes some of the spells used and what they can do. The anime also highlights the tensions between the different political and warring factions, including beastfallen, sorcerers, and regular humans.\\n\\n\r\nYet the show’s delivery of this information isn’t always sound. For the first three episodes (and never again afterwards), a narrator spews out relevant details to get the audience up to speed rather than letting them learn of it through more natural means. Then, in episode six, the characters do almost nothing but talk with and at each other about the current situation. Again, this info is necessary to create a believable, connected world, but the method behind its creation doesn’t go for anything enticing.\\n\\n\r\nFurthermore, Zero kara doesn’t deliver enough. Despite everything going on, the anime never really goes out of its way to build a finer, more nuanced world for its characters to run around in. The knights hardly interact with the sorcerers, losing out on potential quarrels and insight. Minimal exploration of different areas keeps the kingdom itself either too isolated or too disparate as well.\\n\\n\r\nBeyond the fantasy setting, Zero kara also has some clout with its writing chops. Quite regularly, the anime demonstrates a clear grasp of creating plot points and following through on them in a logical, fair manner.\\n\\n\r\nTake the magic potion that Thirteen gives to Mercenary to nullify his beastfallen self. It not only symbolizes his conviction to stay true to the quest that got him here but also it becomes the item that frees Zero from her magical prison later on.\\n\\n\r\nOr how about those blood contracts near the very beginning of the season. They form the basis for Thirteen’s scheme when he reveals that his death as “Him” will kill every Sorcerer of Zero and rogue witch out there presently.\\n\\n\r\nZero’s tattered robe that she trades for a better set of stylish clothes counts, too. It gets used as part of a tracking spell that was in turn introduced back in the second episode of the season with Mercenary’s fur and the undercover witch.\\n\\n\r\nCan’t forget about the “curse” placed upon Mercenary by Zero either, for it pops up in quadruple fashion. Once when Mercenary is shot with an arrow. Once when Thirteen stops the guards from attacking him. Once when the giant dude bites Mercenary’s arm. Once when Mercenary blocks Zero’s mega attack to stop her from accidentally killing Thirteen and subsequently herself.\\n\\n\r\nNot to mention the cool idea of Zero purposefully writing the spells in the Grimoire of Zero incorrectly, a detail that the audience can potentially catch onto when noticing her chants during her duel with Thirteen.\\n\\n\r\nTruth be told, none of these examples stand out as exceptional in terms of impact or intrigue. But they no doubt stand as evidence for the anime’s respectable writing choices.\\n\\n\r\nHowever, it must be noted that several of Zero kara’s story beats belittle the progression made instead. Biggest among them? The entire plot predicated by the fact that Thirteen essentially didn’t talk with and ask Zero about what she really wants. Plus, the tension involved throughout the last conflict lacks weight. Thirteen already used his rat familiar to coerce his followers to fight, yet he apparently cannot undo his decree despite their devoutness.\\n\\n\r\nSmaller writing oddities affect the show as well. The convenient forced-teleportation spell after triggering a specific word seems too easy to push things where they need to go. A strange decision to cut the dramatic scene following Zero’s near death has no place. The group managing to traverse the entire kingdom in a strangely timely manner when placing the five mega-magic circles raises an eyebrow. With all the respect the writing deserves, it still foregoes some of it of its own accord when it commits to these weirder, weaker choices.\\n\\n\r\nAfter the setting and the writing, the themes also try their hand. They dabble in morality through perspectives on racism and mindsets. One of the best scenes from the season follows these throughputs well. In episode seven, a young lady humors Mercenary, tricking him to have him help drive away other beastfallen at their establishment (or, as she and he put it, “It is what it is”).\\n\\n\r\nThese moments are few and far between, though. Indeed, Zero kara often misses out on a more balanced view of these topics, portraying each group involved as mostly negative rather than reaching for a middle ground. Serena was a kind sorcerer as was that old man who let Holdem walk free. Yet the constant misbehavior of the beastfallen. The current sorcerers almost never using their powers for good. The on-the-nose lines yelled by various villagers about the witches and their evil ways. Everything adds up to misbalance the anime’s thematic presence.\\n\\n\r\nAltogether, the setting, writing, and themes are all there for the show to capitalize on. Unfortunately, that doesn’t exactly happen even with its best efforts, leaving the narrative without an option to summon further refinement.\\n\\n\r\nART & ANIMATION\\n\\n\r\nFor the most part, Zero kara gets the job done with its visuals. On an artistic level, the locations do little else besides fit where the characters are and what they are doing. E.g., traveling through a forest, visiting a busy city. They aren’t explored to any large degree, and the details present do not invite anything of interest to look at. Most likely a byproduct of the anime’s lack of world-building drive.\\n\\n\r\nNevertheless, the show displays at a semi-infrequent rate key shots that argue a lot more in its favor. A faraway view of the kingdom’s capital with a mountainous backdrop. The crew’s bonfire illuminates their lonely spot during the forest’s dark night; it eventually gives way to them overlooking a section of the forest as a rainbow arcs overhead. A somewhat top-down shot of Zero’s cavernous “home” as ominous red lighting fills the air. Again, these shots are by no means around all the time let alone to a noticeable extent. But, when they do appear, one has to at least appreciate their detail.\\n\\n\r\nFor the rest of the anime’s production and animation, it goes back to that serviceable state. It rarely tries for anything fancy in its scene composition or techniques in general. The most adventurous it gets is in episode six. Thirteen and Mercenary hold a private conversation, and a neat rotating-camera trick simulates the former’s hypnosis of the latter. All the while, the centralized glass vial housing the magic potion he desires reflects their faces.\\n\\n\r\nOtherwise, a couple of rotated frames here and a few magic uses there counteract the weird charging close-ups of Holdem in his duel with Mercenary and the disregard for any interesting imagery overall.\\n\\n\r\nThe character designs likewise follow suit. Albus is designed to look like a teenage boy, so her looks do conceal her true nature, but the tradeoff is extreme plainness. Thirteen’s black cloak, dark purple eyes, unkempt hair, and angled face translate well into an evil aura, but his demeanor and slowness strip away any intimidation. Mercenary and Zero do fair a bit better, though. Mercenary’s large build, rogue outfit, and white fur both mirror and complement Zero’s small build, sorcery attire, and white hair, making their designs a fun, dichotomous duo.\\n\\n\r\nIn all, the visuals remain consistent in their meager delivery. Not that that hurts the anime, but it doesn’t help it out either.\\n\\n\r\nCHARACTERS\\n\\n\r\nMercenary, Zero, Albus, and Thirteen. As the four main characters of Zero kara, they contribute to this anime in various ways. They also vary in their efficacy, too, putting their group in a questionable spot right alongside most of the other parts to this anime.\\n\\n\r\nMercenary stands the tallest among the group both within the show and in an analytical sense. With fangs, fur, and ferocity, he embodies the beastfallen moniker. His white coat coats his fervent dislike for witches, and his big build and even bigger sword makes him a force during any fight. Yet beneath his rough exterior, a softness of heart guides his path.\\n\\n\r\nFor, while he may frown upon Zero and Albus for their sorcery and their actions, he looks out for their well-being. He makes them soup. He finds them lodgings. He protects them to the best of his ability. He’s no saint, but he clearly strives for what is at least morally good. A statement reinforced by his honesty when dealing with Zero’s priceless gems in episode three.\\n\\n\r\nAlthough, his kindness towards them is somewhat out of a desire of his own: to be a full-fledged human. This conflict arises out of a few interspersed scenes. In a flashback, he attacks and kills a gang of bandits who were terrorizing his village to obtain his head. Another occurs in his arrested freefall where he remembers how he and other beastfallen were mainly expendable losses in war, and his prowess and violence earned him the nickname “The Black Beast of Death” as well as jeers for his demise.\\n\\n\r\nSo, when Zero crosses that path of his, and her sincere words match those of his mother’s from when he was a kid, he accepts her offer with his own style of oath. What follows, then, is his journey alongside that which (and witch) he hates, experiencing troubles of a physical and mental nature as he fends off baddies and learns more about the magical world (and people) around him.\\n\\n\r\nCome the end of episode six, however, it is clear that the seeds of doubt still stir in his soul. He (unwillingly) raises his blade against Zero, forcing their separation and his contemplation. Nevertheless, she keeps him alive thanks to her powers and keeps him sane thanks to her reaffirmation of the softness within him. The latter especially, for he nearly succumbs to the beastfallen desire of eating flesh that the show alludes to a few times throughout the season. Thankfully, his memories (albeit neither extensive nor moving) of their time together stay his fangs.\\n\\n\r\nNow with a clearer mind, he knows what he must do. He works with Holdem to save Albus from her untimely fate. He scales the side of a cliff and climbs the outside of a castle to reach Zero and to tell her that what little brains he has were enough to convince himself that he had to be there for her despite his doubts. He even takes part in the final magic ritual (but not before a playful prod), indicating that, by this point, he has overcome his disdain for those arts to at least some miniscule extent.\\n\\n\r\nZero kara gives Mercenary a rather appreciable arc to his character – except it flubs his finale. With his journey complete, he doesn’t receive his desire to become a human. He doesn’t get to settle down as an inn proprietor like he wanted to either. The audience doesn’t even get to learn his real name, missing out on a neat full-circle writing chance right at the end.\\n\\n\r\nRather, the anime doubles down thrice. One, the beast part of soul is fused even tighter to him after the ritual. Two, he continues traveling with Zero. And three, he actively refuses to give his true name or learn Zero’s, saying, “Well, maybe it won’t be so bad if I’m a beastfallen a little while longer,” a statement that contradicts his base motivations. In short, this open-endedness to his arc stops him from being a solid character and closer to barely a competent one.\\n\\n\r\nArguably, his line there follows a theme on being comfortable in one’s skin (or, in this case, fur). But that was never really a talking point of the show. Instead, what it focused on most was that of indirect loneliness. The audience sees it handily with Mercenary. As a beastfallen, he’s ostracized to some extent, he is belittled, and he cannot get along with humans or witches.\\n\\n\r\nZero experiences such indirect loneliness as well. In fact, almost her entire character stems from this idea. It’s obvious from her interactions in the city and with Mercenary that, despite her skills, she doesn’t have a grasp on how regular life and normal society works. Seemingly because she has been kept in a cave for most of her life, knowing only faded pages for friends and an occasional peeking sun to keep her company. She explains as such periodically, too.\\n\\n\r\nAs such, her connection to Mercenary means a lot to her since he’s one of the only people – beastfallen or otherwise – that she has ever bonded with. Unfortunately, Zero kara does not go too out of its way to build their relationship.\\n\\n\r\nThat’s partly because of Albus, a necessary evil in this show. She basically represents the “other side,” the counterpoint to much of the plot’s discussion about the warring factions. She either introduces or says a line of thinking that relates to the sorcerers’ camp, and the anime proceeds to highlight why her naïve worldview isn’t as black-and-white as she may believe. Furthermore, without Serena around anymore, and realizing that her newfound friends do not necessarily agree with her stances, she as well goes through that same indirect loneliness.\\n\\n\r\nHowever, with her inclusion, she severely detracts from that key component of Zero kara: Zero and Mercenary’s relationship. With this third wheel constantly around and spinning, the two main characters of the anime hardly have any scenes just together to make their connection worthwhile.\\n\\n\r\nNot to mention that Zero is simply not a compelling character on her own, and the anime itself sidelines her for a sizable chunk of the last half of the season. This sidelining mirrors her time in the caves and coincides with that indirect loneliness, so it does make sense on a writing level. However, the anime spends very little time addressing her thoughts and her actions while in captivity to make it worth the time. So, when her climactic scene with Mercenary in the castle tower arrives, it’s nice in concept, but the foundation for it doesn’t exist or at the minimum doesn’t have the support required to elevate it to a strong level.\\n\\n\r\nThen there’s Thirteen, the weakest of the four. He appears roughly halfway through the season as a quasi-evil dude. Simultaneously, he acts as Zero’s caretaker and teacher (or to her, “brother”) during her cave times and, after his leave, a zealot to the cause of granting her the world that (he thought) she desires. Where she viewed magic as a tool that would benefit everyone, Thirteen saw that it would be nothing else besides a weapon for the common simpleton.\\n\\n\r\nHis thinking somewhat comes true when his secret ploy upholds the inevitable abuse and misuse of this magic. As for his actual character, it does not uphold as well. Because of the mystery that surrounds him on a plot level, he never receives enough attention. There’s no tangible context to his rise as “Him.” His admiration of Serena has little to no basis. His feuds with Albus and Holdem do not have the necessary room to grow. He doesn’t relate to that indirect loneliness as well as the others. Just a weak character all in all.\\n\\n\r\nOverall, on the total execution scale, Mercenary rises above Zero, Albus, and Thirteen. But when Mercenary does not attain anything higher than competency, the cast here do not deserve much praise whatsoever.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nAlthough last in order, the ending track wins first. Titled “Hajimari no Shirushi,” delicate piano keys and light acoustic strings calm the audience in their simple, gentle flow. Soft vocals accompany the instrumentals, upping the calmness of the piece that much more. The melodic pace moves the song along in a nice way, and the rise in tone changes its structure without taking anything away from that calming feel.\\n\\n\r\nOpposite the ED, the opening track heads for the back of the pact. Immediately, the sound of this piece is entirely unfitting. It would be appropriate for a story aimed at something slightly whimsical rather than serious like Zero kara. The vocals aren’t shabby, and the beat has a catchiness to it, but the punk-rock body of the song simply detracts from the established direction of the content itself.\\n\\n\r\nTsuyoshi Koyama as Mercenary likewise hurts the show’s chances. To start, his voice for the white-furred beastfallen does not go deep enough to match his build. The delivery of his lines lacks emotion, too. And roars sound less like a ferocious tiger and more like a guy frustrated from stubbing his toe on a nearby table. Not that his performance is a total failure – it just didn’t embody the main character in full.\\n\\n\r\nLess frustrating is the rest of the original soundtrack. While it has lively songs like the one that plays when the group enter Formicum, the OST mostly sticks with mystery vibes and everyday tunes instead. Deliberate piano keys. Calm trumpets. Reminiscent wind instruments. Wild yet reserved violin strings. These tracks are all rather simple in design, but they support the anime well enough throughout the season.\\n\\n\r\nWith the ED and the OST on one side, and the OP and the VA performances on the other side, “split” just about sums up Zero kara’s audio outing.\\n\\n\r\nENJOYMENT\\n\\n\r\nMy initial impression of this anime was not favorable. I hardly liked anything that it set out to do: the bland characters, the plot direction, the different details at each turn. Just a whole lot of me shaking my head at its repeated, failed attempts to pull me in.\\n\\n\r\nLo and behold, revisiting the show anew with fresh eyes and a fresh mind did not change my thoughts.\\n\\n\r\nThose characters? Mercenary is not funny or cool or interesting or nuanced. The best he can do is take up a lot of space on-screen as he complains out loud. Zero says “Wagahai” a lot, but her formality cannot distract from the fact that the pebbles on the sidewalk have more intrigue about them than she does. Thirteen is thirteen times too boring. And don’t even get me started on Albus, for I only need one simple word to describe her: annoying.\\n\\n\r\nThat plot? Let’s just let Thirteen live as an innocent among us despite him literally prolonging a war that killed hundreds if not thousands of beastfallen, witches, and humans. Holdem kept a bunch of women as slaves, but we’ll forget about that whole aside I suppose. I couldn’t care less about the twist that Albus is Sorena’s granddaughter because I couldn’t care less about her.\\n\\n\r\nThese extra details? Magic battles and usage were not entertaining. Mercenary and Holdem run through a crowd of people that somehow grows in size the longer they sprint. That one guy who got attacked at the secret hideout for the Sorcerers of Zero needlessly died because they stood around and did not bother to heal him.\\n\\n\r\nAdmittedly, I’m being rather harsh right now on the anime. To its credit, it never really gets worse as each episode rolls along. Nothing that it presents is outright horrible or ill-conceived, and I can tell effort exists within this project. Yet because it remains consistent in a mired, mediocre state for nearly its entire run, the small grievances I have just pile up to the point that I cannot personally perceive it in a positive position.\\n\\n\r\nZero kara Hajimeru Mahou no Sho does have something to show for itself, but so many of its decisions drag it down. The story and characters include a lot of that pushback, but the serviceable and questionable audiovisual elements don’t do a whole lot in return. Fiction or no, it writes out a lagging novel all the same.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, the setting, the writing, and the themes have definite clout, but they each have a bunch of problems regarding exploration, nuance, and balance that ultimately affect the narrative’s execution\\n\\n\r\nArt & Animation: Fine, the visuals involved get the job done, nothing more and nothing less\\n\\n\r\nCharacters: Bad, Mercenary’s open-ended arc leaves him as competent rather than solid, Zero is neither compelling nor connected, Albus is a necessary evil, Thirteen misses the mark, but at least a theme on indirect loneliness can be found among them\\n\\n\r\nMusic & Sound: Fine, an unfitting OP counteracts a nice ED, not all the VA performances pass, and the OST works, albeit in a very simple fashion\\n\\n\r\nEnjoyment: Terrible, boring characters, lame plot, and uninteresting details\\n\\n\r\nFinal Score: 3/10",
            "date": "2018-03-18T10:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 274199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274199"
        },
        {
            "content": "Spoiler free!!\r\nThis anime is kind of well what should i say (kind a cute!!) has lots of kawii!! moments ...well has a decent plot so...if your looking for a fantasy anime it fits the bill...and might get a bit plain in the middle and in the end so dont expect too much from it the chemistry between MC(the tiger )  and zero is nice some thing very similar to beauty and the beast .....but with different bonds. So if your having a hard time finding a decent anime you should watch it...dont expect to much...has fine not too good action ...and sometimes things goway to positive..",
            "date": "2017-07-18T23:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 253193,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5647903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/D27",
                "username": "D27"
            },
            "url": "https://myanimelist.net/reviews.php?id=253193"
        },
        {
            "content": "My first thoughts were: \"Oh, seems like someone is short of ideas how to name shows\". \r\nThe story takes us to a magic world filled with witches... and beastfallen. Okay, from the very beginning it doesn't proclaims itself as something totally new. The setting is meh. The show manages to convey world's history in a poor way. How many times did you see a world with witches (magicians, special ability users, ninjas, gamers, hamsters) and those who hunt them? One way or another... I've encountered it myself dozens times. Overused troops are present here in quite a number. I had a vague sensation of secondarinessin everything. \\n\r\nIt begins with an union of the beast and the girl. I have to admit this part is quite cute and pleasant to observe. The anime should have concentrate on a relationship of Mercenary and Zero more on my opinion. I think everything else was unwanted. Every time the anime would turn to some action part or to some other storylines, I'd found myself rather bored. It would turn out even more interesting if it were a slice of life anime within a fantasy world. Unfortunately, it's not. Honestly, sometimes I had to endure watching it. Reaching the end, it becomes more and more dull. \\n\\n\r\nVisual part is just okay... But again, fight scenes are just not good. It wasn't properly explained in the show how they use magic. I often questioned myself what are those circles and stripes around them when they cast powerful spells, for example. Why they change colors etc.\\n\r\nI don't like they way they were drawn. It's unsystematic. \\n\r\nOn the other hand ordinary scenes are quite decent. \\n\\n\r\nI liked the op and the ed. I can't say anything more about OST-s probably because they were quite ordinary to remember them. \\n\r\nVoices of Zero and Mercenary make a good match to their characters. Dialogue parts between them were truly good. \\n\\n\r\nPersonally, I'm prone to like characters which interact with each other like the beast and the witch did. That's cocky and nice. \\n\r\nHowever... there were another useless characters to my greatest pity. Albus is way too commonplace type of character. Furthermore, it's the type which annoys me. \\n\r\nThe antagonist here made me even more irritated. I can't even find proper words to express my \"facepalmness' of him. It's not like I had some hopes for him. But I didn't expect him to turn out \"a villain because of circumstances with good intentions\" type. Stupid. \\n\\n\r\nDon't you dare to complain it to Spice and Wolf. I'm a bit surprised there are people who compare them. It's on completely different levels. \\n\r\nAs a conclusion, I can say Zero kara Hajimeru Mahou no Sho sure had some potential. But it decided to choose a path of mediocre anime which is to be watched and to be forgotten. \\n",
            "date": "2017-07-03T10:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 251845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4915440.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Leegf",
                "username": "Leegf"
            },
            "url": "https://myanimelist.net/reviews.php?id=251845"
        },
        {
            "content": "This is just based on my likes, and since I've not watched many other fantasy anime shows, that'll influct in this review.\r\n(Also, I'm not and expert on English-language, sorry).\r\nIn the therms of story, this is not such unique, since souds like a story that any fantasy-themed story would have, but that doesn't have to be bad, actually I liked it, since it makes this show feels like some kind of Midaged Novel, the story about witches against humans, with beastfallens added is something that anyone who wrote a midaged fantasy would make, but that doesn't make the story bad.\r\nThe artstyle is something I really enjoyed,character desings and the scenarios are very well done for my taste, maybe some anime I've never watched has better art, but I really like this artstyle, specially the main cast desings, which are very pretty, and I feel they feet very well with them.\\n\\n\r\nMusic is good, and kinda reminds me an RPG game, maybe not Final Fantasy, but Fire Emblem or Dragon Quest (haven't played so much games of thouse franchies anyway), but it fits the stage.\\n\\n\r\nCharacters are very likeable, specially the main characters, Zero and Youhei make a very funny and cute pair (have to admit I ship them, they'd make a very strange-yet-cutie couple), but have to say that character development on some of the main cast as Holdem and 13 is rushed, in that way, the anime should've had more chapters to develop them (and I feel should be overall longer).\\n\\n\r\nEnjoyment is very well done, since when we see jokes, they're very funny and well done, a very good example are the first three chapters, that play with the Zero's rough and a little bit prissy personality, as well as her ignorance of the world's common rules, also taking Youhei in a very fun way (if you haven't noticed it, I really like them as characters, they're amazing), also, fights are overall well done, and the series doesn't fear to show blood, not a gore-level, but it's the fair amount of it.\\n\\n\r\nOverall, I enjoyed this series at all, but mostly because I like mideged fantasies and kemono-like characters, also, Zero and Youhei's relationship is one of the most spectal-keeping part of the show, I recomend, but know that many people will feel this as a generic fantasy anime, which I don't care, I just enjoyed it and that's all.",
            "date": "2017-12-28T13:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 266664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6014594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Luis-Adolfo-Wolf",
                "username": "Luis-Adolfo-Wolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=266664"
        },
        {
            "content": "I think many reviews didn't do justice to this piece of work. Hence I created an account to write for this review.\r\nMy first thought after I finished the show was : It makes me remember Spice and Wolf.\r\n-------------\r\nThere is a reason why this show has a rating 7.2 or above 7 while the reviews has mixed feelings about it.\r\n1) The plot and characters are standard and nothing special. (Rating : 7 standard)\r\n----- True , but it doesn't mean is has no depth. The whole story has a simple and VERY BASIC background settings..... \r\nbut the depth is there hence you don't see shitty rating of6.9 and below.\\n\\n\r\n*** Trust me , you will find similarities between this show and other big names simply because it has good basics. Just like how all good romance genres has certain similarities with each other.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n2) Depth (Rating : 8 Good)\\n\r\n----- This is NOT a show that tells you \"For some and no reason people can use magic and conflict arises from it and blah blah blah\". \\n\\n\r\nIt(magic) has a profound reason behind it to exist and took years of effort and studies to took hold yet despite what it seems , conflict still arise regardless. \\n\\n\r\nThroughout the series , the settings explanation is done in a well eloquent manners and THE BEST OF ALL : It tells the tale in a very very heartwarming tone like a mother's love.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n3) Plot Progression (Rating : 8 Good)\\n\r\n----- At every turning point , the decision making is being made clear. There is no ambiguous decisions that was made half-hearted , every turning point has a good reason.\\n\\n\r\n** Well , except the way some or if not most characters' introduction scene that is.... but otherwise the story flows well.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n4) Character (Rating : 7 Standard)\\n\r\n----- There is no stupid and spoiled brats throughout. Although some characters changing heart might have been paced too fast , but it can't be helped.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n5) Art and sound (Rating : 7.5 Standard+) \\n\r\n----- Personally I have nothing to complain over it. Medieval time Bgm setting is usually soothing to my ear in a natural way without flashy sound effects, like birds chirping in a garden just the way it is. \\n\\n\r\nAs for why I gave it extra 0.5 instead of 7........ \\n\r\nbecause the heartwarming scenes are nicely done even though its nothing flashy/extravagant...... its just.... warm....\\n\\n\r\n--------------------\\n\r\nOverall : 7.5 ( Good+ )\\n\r\nIts a well done show , it wraps up nicely without any huge plot hole.\\n\\n\r\nBy well done , I mean it has the very basic and standard aspect of Magical Fantasy genre just the same as any other higher rating Magical Fantasy anime like Shakugan no Shana or The Irregular at Magic High School.\\n\\n\r\nAll 3 of them shares similar characteristic of giving its magical power a good background explanation and progresses without over relying on overpowered strength alone.\\n\\n\r\nExcept it is presented it in a simple yet profound setting. \\n\\n\r\nA standard heartwarming masterpiece for casual viewing indeed.",
            "date": "2017-09-01T20:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 256702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RnckO",
                "username": "RnckO"
            },
            "url": "https://myanimelist.net/reviews.php?id=256702"
        },
        {
            "content": "I really wanted to give this show a better review because I was loving it...for the first 3/4. I think it suffers from the same things a lot of the 12 episode series out there do. Basically, the world was fairly well developed, the characters seemed interesting and had room to fill out their history. The plot was intriguing, with mysteries to solve. Then you get to the last couple episodes, and the whole thing kind of vomits up all of the answers and exposition you never wanted, combined with a rushed ending that magically ties up all of the loose ends but really leavesa lot of holes in logic. It even feels like the writing takes a hit in those last couple episodes, like they either didn't have time to polish the script, or they were too rushed to cram in exposition and it hurt the dialogue. Ah well, it's still an enjoyable watch, it's just too bad it didn't have more time to flesh out the story and let it wrap up at a natural pace.",
            "date": "2017-08-02T20:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 254550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4722136.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/scottishrob13",
                "username": "scottishrob13"
            },
            "url": "https://myanimelist.net/reviews.php?id=254550"
        }
    ],
    [
        {
            "content": "This review will contain significant spoilers to illustrate several lapses of logic within the show.\r\nI thought I'd put in my two cents to this show to help contrast some of the more positive views. Zero kara Hajimeru Mahou no Sho (or GoZ as I'll refer to it) is in every sense a mediocre fantasy show. It does very little to distinguish itself from it's peers of the fantasy genre and has multiple lapses in logic and commonsense.\r\nGoZ is a action magic fantasy that follows the story of three characters. Two witches, named Zero and Albus as well as a unnamed mercenary. Zero is a somewhatspecial witch as she is the author of the titular Grimoire of Zero that has spread magic into the kingdom in which the GoZ is set. Zero is searching for 13, (and her grimoire) we do not know her reasons for searching for him, who then comes Albus, who is as far as we know is a fairly average young witch who originally was seeking the mercenary's head as he is a beastfallen, who's bodies apparently hold special and useful properties for witches. Zero resolves the issues and hires the mercenary as her guard. Doesn't sound to bad at first. It goes to shit later in the show, when you start asking questions.\\n\\n\r\nWe learn Albus is apart of a coven or witch group called the Sorcerers of Zero, who we later learn, who's members have all signed a blood contract with a mysterious man only referred to as \"Him\". What does that contract entail? Death, if you threaten his safety, you will die. Pretty hefty contract for people to make with a person they've never seen nor met. Lapse in logic: 1, bad writing: 1. So the Sorcerers of Zero are idiots, that much is certain. At least they're nice idiots? Not really, the Sorcerers burned a village to the ground for the unjust murder of a kind witch, named Sorena, who you will later learn of. They ignored all innocents and indiscriminately murdered an entire village. Though this has happened in history so I won't deduct any points from it, I just thought it'd nicely illustrate the sort of characters in the Sorcerers Of Zero.\\n\\n\r\nAnyways, onto the next issue. Throughout their journey, the trio grows closer. At one point Zero is giving the mercenary a bath, how cute. At that point she takes it upon herself to cast a spell on the mercenary's body that will redirect all damages he takes unto her. Yes, she decided all injuries the man / creature she hired to protect her safety shall be redirect to her. Seems a little ironic and counter intuitive. Lapse in logic: 2, bad writing: 2. Sure you can say that it's sweet and all, that she cares for him, but frankly it's a stupid move, driven by bad writing.\\n\\n\r\nNext issue. We learn Thirteen is Zero's enemy and throughout the trio's encounters we learn Thirteen's motive for doing what he's doing. Which is indiscriminately murdering witch's. He's doing it for Zero, but he won't listen to Zero who tells him she doesn't want this. Until like the third time she verbalizes this in which he magically decides 'oh she was serious. Guess I'll stop murdering witches and shack up with Zero and her mercenary.\" Lapse in logic: 3, bad writing: 3.\\n\\n\r\nAnd again, next issue. We later learn Albus (which is a man's name if you ask me) is actually a girl, and not just any girl, the granddaughter of that good witch who was unjustly murdered. Why is this relevant? Throughout the trio's journey Zero reveals she's looking for her grimoire and 13. Albus says that the sorcerers have it, and when they arrive to the sorcerers hometown, which has been freshly massacred, says that perhaps Soreana's granddaughter had escaped with it. Wait what? That's her. Why would she lie to the hero which her group named herself after? Lapse in logic: 4, bad writing: 4.\\n\\n\r\nSecond to last issue. The world itself. We have plenty of witches in the story who apparently all learned their magic from \"Him\" and the Grimoire of Zero, and if that is the case, why are there witches that predate Zero, such as Sorena. Sure you can just say she popularized or modernized magic, but near the climax of the anime the trio plan to eliminate magic from the kingdom because Zero apparently has the ability to cancel out magic. Talk about plot armor. This also leaves more questions asked. Can Zero cancel all magic? Or just magic based on the Grimoire of Zero? Why can she do this? Can other witches do it? Frankly these things  left the viewer confused. Confused and with unanswered questions Bad Writing: 5.\\n\\n\r\nMy last major complaint is one that is simply cliche. Throughout the first half of the show we learn that there are two important characters, whom we haven't seen. The aforementioned 13, and \"Him\". 13 was a peer and teacher of Zero. \"Him\" is the founder of the Sorcerers of Zero. \"Him\" slaughtered everyone in Zero's previous abode to steal the Grimoire of Zero, and followed up by creating basically a cult named the Sorcerers of Zero. If you hadn't already figured it out. \"Him\" is 13. I won't detail his frankly idiotic master plan, but the fact that \"Him\" and 13 are the same person is comically bad writing: 6. It was visible from not miles away, but light years.\\n\\n\r\nThose are my major issues with the story, as for my other issues, let's dive into them.\\n\\n\r\nThe characters. The character's are not particularly bad or good, they're fairly average. What is however bad about them is their interactions. Almost every dialogue between the major, minor or extra characters fits one of three descriptions. Stupid. Cliche. Contrived. Those three words adequately describe this series' characters, and story.\\n\\n\r\nThe story. Routinely leaves questions asked but unanswered. Has several plot holes and previously mentioned fallacies. And to be blunt, is frankly average. Or it would be without all those glaring issues.\\n\\n\r\nArt. Average, nothing good, nothing bad. Utterly mediocre.\\n\\n\r\nSound. Same.\\n\\n\r\nOverall Zero kara Hajimeru Mahou no Sho is a bad anime. A very bad anime, with countless issues, more than I've likely identified. If you're new to anime or not someone who dives to deeply into things, perhaps this show will be for you, but anyone who likes to dissect content, anyone who is notices little details, or any person who has watched a decent amount of anime. Avoid this flaming pile of shit like the plague.",
            "date": "2017-06-26T12:59:00+00:00",
            "helpful_count": 89,
            "mal_id": 251117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4457183.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yautja",
                "username": "Yautja"
            },
            "url": "https://myanimelist.net/reviews.php?id=251117"
        },
        {
            "content": "Like many shows relating to fantasy, magic, and witchcraft, I can’t say that Zero kara hajimeru Mahou no Sho looks any unique compared to the rest at first glance. I mean, if you look at it carefully, the show’s premise is pretty standard that involves a conflict between human and witches. The additional aspect of beastfallen (cursed humans with animalistic appearances) adds some slight intrigue to the story. But is this show really worth investing time in? Or is it just a show that panders to fans that wants a dose of fantasy in their life?\r\nAdapting the light novel of the same name, Zero karahajimeru Mahou no Sho (Grimoire of Zero) takes a very high fantasy approach with both its characters and story. The most noticeable character is a beastfallen dubbed as “Mercenary” by the witch Zero. They travel together with Albus, another magician and throughout their journey, they learn much more about each other. Still, the primary goal of their journey is to find the Grimoire of Zero, a very powerful spellbook that has potential to change the world. Now wait a minute. Witches? Magical artifacts? Journey? If anyone has seen enough anime, it wouldn’t be surprising if this show reminds them of fantasy adventures like Hitsugi no Chaika, Spice and Wolf, or even to an extent, Berserk. The fact is, this show appeals to a fantasy adventure while it tries to be a show that stands on its own feet.\\n\\n\r\nThe first few episodes of the series establishes the formation of the main trio. Zero encounters the beastfallen and is enlisted as her bodyguard. On the other hand, Mercenary shows fear for Zero because of her status as a witch. Throughout the journey, he also learns that she’s much more different than appears to be. Then, there’s Albus, the third member of the group and we learn much more about this young magician’s past. In the meantime, I think what can hook the audience into this show is the character chemistry. At its core, Zero and Mercenary always gets me curious as the two are so different. Yet at the same time, it’s really fun to see how far their relationship develop as they are put into compromising positions. For Albus, the character’s past is explored through the eyes of another character named Holdem. From first glance, I disliked the way his character is portrayed with his arrogance. As time went on however, the show reveals a different side of him that I thought as very appreciating. So in essence, characters in this series shouldn’t be judged on what they appear to be on the surface until we understand them better. If there’s one character that I genuinely dislike though, it would be Thirteen. Trouble always seems to follow with this guy and he stands as a dangerous obstacle during our main characters’ journey. His persona fits within the stereotypical type of antagonist that gives a sour taste. Not to mention, I really can’t stand some of his dialogues as they sound very forced.\\n\\n\r\nNow if you’re wondering about the main story, the core of the show still involves the characters’ journey in this fantasy adventure. To be honest, the first half of the show feels like it suffers from pacing problems. I don’t mean that by adaptation standards but just in general as some episodes focuses too much on the characters’ lives. It can actually cause less interest for viewers as by the time I finished watching the 5th episode, it seems far less focused on finding the Grimoire. Still, I would also say that the story does improve later on as some episodes got me much more invested into characters such as Mercenary and Albus. The background story told by Holdem in particular felt like a highlight in this show as it not only gave insight about Albus’ past but also how the world viewed witches in general. While I dislike Thirteen as a character, I do find his role in this show to be very thrilling. The way he plays mind games with Zero and Mercenary adds a different dimension of drama that builds more and more. So in essence, the general flow of the storytelling has slow start but gradually develops as more episodes progresses. It will test the patience of the viewers especially those who are less interested in the characters and more invested into the plot.\\n\\n\r\nAdapted by White Fox, it’s not unusual to see that the artwork has some resemblance to other fantasy series. Re:Zero is the first show that comes to mind as Zero has some resemblance to Emilia. However, I would say that Zero is like a dynamite that comes in little packages. She is short but has enormous potential as a witch. Mercenary has the animalistic look with his tiger-like face but barbaric human body. Similarly, Holdem looks like a generic wolf guy you’d expect to see in most fantasy anime. Albus is designed to look fragile and it’s sad to say, but the young magician really doesn’t stand out compared to the other cast members. Still, artwork of the show looks visually appealing if you watch it with a fantasy mindset. On the other hand, I’m not very impressed by the general world building as many places our adventurers’ wanders looks too dull and unoriginal. \\n\\n\r\nFor a show about fantasy adventure, it occasionally lacks the mystical feel but thankfully with the soundtrack, it retains its credibility on most parts. From my viewpoint, both the OP and ED theme songs are quite colorfully decorated. The ED theme in particular delivers a more charming presence of the main characters between Zero and Mercenary. I’m also impressed by the voice acting of nonhuman characters such as Mercenary and Holdem. In many ways, they sound very human.\\n\\n\r\nAh, Grimoire of Zero. This is a show that some people mistook it for Re:Zero’s second coming at first glance. On paper, it’s a fantasy adventure and one that mixes in humans, witches, and beasts. By storytelling standards, it’s nothing impressive to write home about. However, once I got invested into the characters, the show felt more special at heart. It’s not a golden egg in a treasure chest by any means but is still a fun ride if you’re feeling the will to take.\\n",
            "date": "2017-06-26T07:54:00+00:00",
            "helpful_count": 54,
            "mal_id": 251094,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=251094"
        },
        {
            "content": "What starts out as a typical quest to right her own wrongs turns into a more complicated anime after she loses her soup, we are introduced to the initial characters and are shown different parts of the world's state and history. With themes that are similar to Junketsu no Maria, the anime as it is right now is slowly expanding our knowledge of the state of the world. Whilst the story is not unique in any way it is not by any means bad (I'm sure some of the other reviews will beg to differ), meaning it will be more than enough to keep youinterested. The recent few episodes have started to show a bit of the characters changing as people which is nice (I have qualms with how slow durarara/baccano was despite being a huge fan)\\n\\n\r\nAs for the art, pretty standard, it looks good but compared to most other Japanese anime  it doesn't stand out, expect fluid animations and effects. The one bit that I do think they did well for art is probably the characters which are relatively detailed.\\n\\n\r\nMusic is great, I love the opening. The ending is calm and relaxing (though not exactly my sort of thing) and the bgm is more than capable of sending the mood. That being said due to the lack of action/emotional scenes so far it hasn't had a really good chance to stand out.\\n\\n\r\nCharacters are your typical op + knowledgeable MC (or heroine depending on how you look at it), your character that isn't happy with the world as it is and is seeking the ability to change himself. You have the loyal little magician who may or may not become an antagonist further down the road, which will be interesting to see how it plays out. As I mentioned the characters are drawn in great detail and the MC seems to have some sort of backstory we haven't fully explored yet so I am looking forward to it.\\n\\n\r\nAll in all its a 9 for me, this anime doesn't seem to have made a lot of mistakes but at the same time isn't taking enough risks to really stand out and get a 10 (masterpiece), that being said its more than enjoyable and doesn't let the recent few seasons (which have been great mind you) down.",
            "date": "2017-05-01T08:28:00+00:00",
            "helpful_count": 52,
            "mal_id": 246727,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3647167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/generalcdj",
                "username": "generalcdj"
            },
            "url": "https://myanimelist.net/reviews.php?id=246727"
        },
        {
            "content": "I'm kind of mad because I had my review started and than I accidentally closed the browser.  I guess I'll be writing it again.  Luckily, I wasn't that far.\r\nGrimoire of Zero certainly has brought out mixed feelings among the viewers.  Many people really like or even love the show, while many others, like myself, just like it.  There are also the people who just don't care for it that much.  It's good either way, but it does have its ups and downs.\r\nThe story is simple.  Zero and Mercenary meet unexpectedly after Mercenary falls from a hill top above whereZero was camping out when he was being chased by witches, I believe (I actually forget the details concerning his fall from weeks ago).  She forms a contract with him than and promises to turn him into a human, as long as he helps her find the Grimoire of Zero, which is a book she created that is filled with tons of magic spells and has spread far throughout the land.  The book was stolen from her and she want sit back before it falls into the wrong hands.  The two also meet Albus,a young witch in the group, the sorcerers of Zero.  The three of them start their adventure and ht some of their initial walls.  The first half of the show is a lot more character driven, which was a little dull at times because the anime seemed to be concentrating on simple stuff like that instead of on finding the grimoire of Zero and advancing the story.  Luckily, the second half shows more of the conflict surrounding the war that is close to breaking out between humans and witches, and has many plot twists throughout the scenes.  It could be a better story, but at least it was satisfying and ended on a really good note.  The best part about it is that it feels like an old time fantasy adventure due to how the spells are cast and the backgrounds shown. The beastfallen designs make a nice touch though. I'd give a story a 7 since the quality rounds out nicely despite the ups and downs in the story.\\n\\n\r\nThe art is kind of like the story.  It really makes the show feel like an older style fantasy adventure.  The character designs, backgrounds, and other art pieces are not always the greatest out there, but the category as whole is good.  A few of the background are done really well, especially some that I noticed in the final episode, while some others are just ok.  The clothing is definitely of some typical fantasy designing, but it helps show the character's personalities really well and it is still designed nicely.  The animation is pretty fluid too.  Overall, a 7/10 in deserved.\\n\\n\r\nThe sound is my favorite part of the show.  I expect a fantasy to have some really good music and Grimoire of Zero doesn't disappoint much in this department.   The opening them is quite good, while sounding silly at the same time; it fits very nicely though with a few of the overall simple themes of the show, and it does have nice visuals.  The background music is more fierce during the battle scenes and the more conflict based scenes.  Other times, it is just some good music that compliments the mood in a good way.  I'll give the category a 7/10.\\n\\n\r\nThe characters are kind of a difficult area to talk about.  They are not the most special, but they leave an impact.  Thirteen is kind of a basic antagonist and trouble is always around him, but he does a good job at being part of each side of the war he basically started, which is not something many antagonists can pull off.  Zero is a young magician who might easily be the most powerful magician in the world of the show, seeing as how she made the spell book and that action lead to many people throughout the land learning how to use magic.  She doesn't try to control people with force and enormous strength though and she is more kind hearted and it doesn't take a whole lot to please her.  She is kind of cunning though and she interacts very well with Mercenary.  Mercenary is more a tough and rather stern individual until he grows more acquainted with his master, Zero, and breaks out of his shell.  He is different from other beastfallen since he doesn't use his look and or position as a soldier to get what he wants.  He has a simple dream of wanting to open his tavern.  Albus is an ok character, but she doesn't have as much of an impact as the three I mentioned above, and she just kind of seemed to be present at many times without there being a need for her.  I don't think she needed to be incorporated into the main traveling crew as often the way she is, but would fit better if there was more of a use for her early in the story.  The other characters are not really main people so I'll leave out.  Overall, the characters are rather fun to watch and stand out in their own way, despite not being the best out there, so 7/10 it is.\\n\\n\r\nMy enjoyment earns a 7/10.  I didn't always like every episode as much as another, but overall, I had a fun time watching the anime and some of the scenes were really good.  It has a very satisfying ending too, even though the show has a short run time.  There is more to be discovered in the world, but every main conflict brought about is solved before it ends.",
            "date": "2017-06-27T08:36:00+00:00",
            "helpful_count": 34,
            "mal_id": 251215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=251215"
        },
        {
            "content": "-- This review contains spoilers. Only read if you have finished the series. --\r\nStory:\r\nRegrettably, I had initially believed this show to be a dark horse of the season. However, what I received was not what I had hoped for. Instead of a clever take on the magical fantasy setting, it was a walking stereotype with little to no depth. \r\nIt has a decent start with the mentioning of beastfallen and witches but quickly goes downhill with the very predictable direction. From the unoriginal yet \"overpowered\" main character, to the useless side character, to the boring villain, to the damsel in distress trope, to the lackof exploration on magic, to the obvious and highly convenient \"plot twists\" ...\\n\\n\r\nDiving into the lack of exploration on magc, it has always been something that piqued my interest as far as I can remember. I just find the subject of \"magic\" to be interesting and limitless in terms of potential with story progression. Combine that with adventure, fantasy, and even witches, then it's natural to assume you would see it pretty often, right? I mean, considering its importance to the story, then why is it so little explored in this show? That is not using your strengths to your advantage, and it shows the lack of thought or small preparation in writing. To bring my point full circle, the incompetency in writing continues to be evident due to the poor characterization - which leaves the viewer to become apathetic towards said characters - and the terrible \"plot twists\" - which just ends up feeling anticlimactic to an already unimpressive show. For example, when it was revealed that Albus was a female, it felt as if though they were trying to store value into a character that was otherwise useless and dragging the story down with it.\\n\\n\r\nArt:\\n\r\nHonestly, it could be better, but this is pretty standard in today's times with some relatively low dips in quality here and there. However, that's not necessarily a compliment. With numerous anime per season competing against each other, it should be common sense that having \"better than standard art\" be a necessity for relevancy. If not, then it's safe to assume proper care wasn't given to other aspects of that show as well. With nothing to really capture the attention, then did it have impact in the first place? We, as humans, tend to forget the things in life that are seen as daily routine or events that don't make us remember it afterwards, because in the end it becomes just that - irrelevant. I can say with certainty that Grimoire of Zero is not something I will look back on in the future.\\n\\n\r\nSound:\\n\r\nMuch like the art, the sound was dull and forgettable. Admittedly, the show gave me no reason to listen its soundtracks. In fact, I'm quite happy to not spend time bothering to do so.\\n\\n\r\nCharacters:\\n\r\nThe ultimate sin of a writer is to neglect its characters, which makes sense from my perspective. Why would you bother investing time into a story where you can't stand the characters to begin with? Or if the characters do not grow? The person you are going to spend most time with is the character, after all.\\n\\n\r\nI will acknowledge the fact that the characters do grow in this anime, but it loses overall impact if I did not care for them at any given time. If the cons outweigh the pros, then it would be deemed as a liability and not an asset; an inconvenience or weakness, not a strength. From the get-go, the poor characterization, as previously stated, left an underwhelming first impression that was never really serious at fixing itself. At what point would you cross the line? Maybe the sudden tone shift where it was time to eat in the middle of a supposedly high-tension fight? It's absolutely ridiculous how bad that scene was, in particular. Why should I take it seriously if it refuses to do so? To add insult to injury, 13, specifically, had a questionable motive. Quite frankly, Zero, Albus, and even 13 were poorly written. That's 3/4 characters with the most screen time. 25% of that was decent with Youhei, our mercenary beastfallen. His struggle with society and lack of communication with others was notable, but his backstory needed further looking at.\\n\\n\r\nTo summarize, Zero, Albus, and 13 were liabilities, in my opinion. Rather than bringing something unique to the table, I received unoriginal content with poor excuses of reasoning behind it to boot. \\n\\n\r\nThe show somehow felt incredibly rushed and could have greatly improved had it taken the time to explore more of its own history, the inner workings of magic itself, and fleshed out its characters more. Also, if it just had better writing in general. \\n\\n\r\nLong story short, this was a huge letdown with no redeemable qualities whatsoever. It is quite literally the very definition of \"meh.\" With that being said, it still isn't the worst of the worst.\\n\\n\r\nFinal score: 3/10.",
            "date": "2017-06-27T09:46:00+00:00",
            "helpful_count": 27,
            "mal_id": 251220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3498079.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zelev",
                "username": "Zelev"
            },
            "url": "https://myanimelist.net/reviews.php?id=251220"
        },
        {
            "content": "This is obviously not related to Re:Zero in any way. You probably already know that but i'm just gonna throw it out there. Zero Kara Hajimeru Mahou No Sho is an anime that has been on my \"plan to watch\" list for a long time. In fact, it didn't even have a synopsis at that time if I recall.\r\nStory 6/10: Story's honestly not that great. The beast, Youhei, meets a witch, Zero, and despite his so-called hate for witches, he decides to embark on a quest with her. For a price of course, that being he could finally be turned into a human. \r\nAs ofnow, the pacing is slow. At the end of episode 4, it gets more interesting but the first 3 episodes are basically the building blocks of character development. There is also a bit of action here and there but it doesn't last very long. \\n\\n\r\nCharacter 8/10: A unique MC because of him being a beast. You don't see those too often. I liked him though. He can be tsundere-ish at times and he seems like someone who is good but chooses to be distant and cold towards others due to the fact that he is aware beasts like him aren't treated so well do to their bad history (which is explained throughout the series). Overall, he seems like someone who isn't annoying. Thank god.\\n\\n\r\nBut there is one character who could be annoying at times. And it comes to no surprise that the culprit is the yellow haired kid. Honestly, I would prefer him to not be around but he's part of the reason of the MC's character development and he isn't bad all the time. \\n\\n\r\nMoving on to another important character, Zero. She doesn't seem unique at all. Naive about the world and somewhat overpowered in combat. But still knows whats up when things go tough. I also find it confusing when some people act perverted at her (something you'll find obvious) because she honestly looks like a kid at first glance. Anyways, despite her lack of uniqueness, I didn't dislike her at all. But that could change when we get to see more episodes but I hope it doesn't. This applies to the rest of the characters too.\\n\\n\r\nI also like to mention the relationship between Youhei (beast) and Zero. It isn't forced and it just grows smoothly. That is what I like. Romance done right. Rather interesting too.\\n\\n\r\nAnimation 7/10: Good for 2017. Nothing that felt out of place. Average. Normal. No flaws. No complaints here.\\n\\n\r\nSound 8/10: OP with an adventure tune that we see in alot of action anime and an ED with a calm and relaxing atmosphere that reflects on the relationship between the MC and heroine. I love it.\\n\\n\r\nOverall 7/10: I hope this anime keeps sticking with what it is now with maybe a few minor improvements. Overall, I enjoyed watching it and I'll definitely not drop this.",
            "date": "2017-05-07T18:15:00+00:00",
            "helpful_count": 16,
            "mal_id": 247172,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5522521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zecis",
                "username": "Zecis"
            },
            "url": "https://myanimelist.net/reviews.php?id=247172"
        },
        {
            "content": "Preliminary thoughts on Grimoire of Zero:\r\nI really want to like this show. I want to be able to sing its praises to all who'll listen, letting everyone know how worth their time it is to sit down and enjoy it. But I can't do that right now. I hope by the end of its run, I can at least say it was a memorable experience.\r\nPart of this desire probably stems from Grimoire's resemblance to one of my favorite anime of all time, Spice and Wolf. With a similar atmosphere and general vibe, setting (medieval, Europe), and the same dynamic of two travelling companions (which becomesthree in this case, infuriating but I'll touch on that in the next segment), on a mutual journey, its first episode left me extremely hopeful for its future. Unfortunately, the crossovers end there.\\n\\n\r\nThese types of shows rely almost entirely on the two main characters and the interplay between them. Spice and Wolf's Holo and Lawrence were such a witty and naturally compatible duo, and played off of one another so well, that entire minutes-long sequences of dialogue felt as ensnaring to watch as any expertly choreographed and explosive fight scene. That level of crisp writing and dialogue is simply not apparent in Grimoire of Zero. Most of our character's interactions are trivial in nature and execution, yet the progress in their relationship, and in turn the things they're willing to do for one another, speeds up at a disorienting and bizarre pace. All in order to meet the demands of the plot. Strike 1.\\n\\n\r\nTo make matters worse, Grimoire introduces a practically irrelevant third character into the equation. This addition only serves to cripple the pair's ambiance generally, and to this point I simply cannot deduce the value of the decision. One could argue this character brings to us important information about the world of Zero, but I argue that that isn't reason enough to introduce him as a mainstay which completely derails any and all flow of the main duo. At most, he should have been a character that departed in the span of an episode after giving us the info we needed. Perhaps if this character was at all interesting, I would let this point go without much contention, but alas. Strike 2.\\n\\n\r\nMy main gripe with this show, though, is the way in which it handled its very first *real* conflict. Without spoiling, Grimoire set itself up with, intentionally or not, a grand opportunity to introduce some amazing drama in the second half of its cour. We simply didn't know enough about our characters true motivations and desires at the time of this conflict, which would have given us as the viewer the awesome experience of sharing the main lead's (who is as left in the dark as us) suspicions and doubts as they uncovered the truth. I was extremely excited, thinking back to my excitement after finishing the first episode, \"This is what I've been waiting for!\" Gears turning in my mind, thinking of all the possible permutations available, all leading us to an epic climax. Unfortunately though, Grimoire sinks the ship that hasn't even had the opportunity to set sail, by telling us, within 2 minutes of introducing the conflict and in no uncertain terms, who exactly the villain is and who we should be rooting for. This is simply a failure of good writing, especially egregious when the set pieces have fallen into place so nicely. Strike 3.\\n\\n\r\nGrimoire has potential. It seems to have all the ingredients needed to make a memorable anime, if only its execution were more refined. In fact, even with all of its downfalls, this is still an enjoyable show. I'm determined to see it through, not just in hopes of it proving me wrong, but also because I'm simply having fun watching. And there is something to be said for that.",
            "date": "2017-05-25T18:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 248533,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4851067.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Devorantem",
                "username": "Devorantem"
            },
            "url": "https://myanimelist.net/reviews.php?id=248533"
        },
        {
            "content": "So, the first (wrong) thing this show did was to overestimate the capacity of people to make the difference between Mahō(魔法) - Magic and Majutsu(魔術) - Sorcery. While they are kind of synonyms they have the same difference as normal Alchemy and Alchemy with a Philosopher's Stone. The top review of this series makes this (retarded in my opinion) mistake and makes a lot of comments on the fact that the series is stupid because \"how could witches exist before magic if magic was invented by a witch only recently\" (Jaden Smith anyone? No?). Well, it is stated, SEVERAL TIMES, that they used sorcery, notmagic. Damn, the white tiger (I'm bad with names) even says: \"This magic is very convenient because until now you had to draw circles and make sacrifices\". Also,(this is not a spoiler) regarding Zero's ability to negate magic, (now this is a spoiler) SHE GODDAMN SAYS she made mistakes in the Grimoire on purpose in order to be able to be stronger than any other magic user.\\n\\n\r\nAnyway, I felt the need to clear that up. Now the review:\\n\\n\r\nZero kara Hajimeru Mahou no Sho (Grimoire of Zero) is a fantasy anime. It's set in a world where a civil war between witches and normal humans has created countless victims and it's currently destroying the nation. The series is centered on Zero, a young witch that revolutionized witchcraft by giving birth to magic and Mercenary, a beastfallen (humans with the appearance and strength of animals), and it follows their adventures to find (the stolen) Zero's Grimoire that holds the secrets to magic. \\n\\n\r\nThe series is sweet, short, and the only complaint I have is that they seemed to go out of their way to produce a loli-ish character (must find a way to appeal to those otakus, amiright?) when the girl needs to be over 15 for the story to make sense. The art isn't amazing but I'm more of a story guy so it didn't impact my enjoyment too much. The sound though, it's lacking. A good soundtrack would've made this anime A LOT better. \\n\\n\r\nAll in all, Zero kara Hajimeru Mahou no Sho is in no way an innovative, never-seen-before anime. The whole fantasy setting has been done so many times it's almost impossible to come up with something new. But who cares? Do you never eat the same food twice? I like binge watching fantasy anime with an accent on magic and I feel like this hit the right spot. It doesn't even need a second season, it's fine as it is! If you like magic and fantasy, this anime is a nice thing to watch.\\n\\n",
            "date": "2017-08-19T05:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 255804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426849.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mike98",
                "username": "Mike98"
            },
            "url": "https://myanimelist.net/reviews.php?id=255804"
        },
        {
            "content": "These days, witches are regarded as practitioners of magic and act as the female equivalent of wizards in what would be considered as the pop culture norm for magic.  While their original existence no longer has any place in society today, the history of evil witches, people who have made deals with the devil and practice witchcraft still lingers in the ugly recesses of history.  With that said, what would happen if you put both of them together?  To create a world where in a sense, both the meaning of witches in history and pop culture come together?\r\nStory: The Grimoire of Zerostory starts us off in the land of Wenias, a place plagued by those who practice magic known as witches and men who born as animal known as Beastfallen.  It is here where we meet a certain beastfallen simply known as ‘Mercenary’ for the entire series (and for the sake of simplification), a self-explanatory character that does the mercenary work of killing witches for hire.  On one trip through the woods, he comes in contact with a little witch by the name of ‘Zero’, who tells him that she is on a journey to find what has been stolen, her book of spells, the Grimoire of Zero.\\n\\n\r\nTaking up all twelve episodes of the series to cover just the first book of the original LN series, the adaptation becomes an intriguing story with many facets to its characters, as its main duo of large tiger man and tiny witch protagonists act as a faction-less duo that do practically whatever they want so long as it benefits them and their goals.  We’re given a realistic depiction of the reaction to witches in our own history put into a fantasy setting, which to me is a good way to shape up the main conflict.  As a result, the show allows the audience to view both sides of the main conflict, testing many of the other characters’ morals and actions while providing a good blend of action and humorous character interactions to aid in filling out holes that the main plot leaves behind.  \\n\\n\r\nAdding to that is characterization.  Personally I feel as though the show does have some imbalance with how it chose to develop its characters.  Due to the nature of the show having two ostracized groups of characters in its society (Beastfallen and Witches), the show primarily focused on the witch characters and the witches’ struggles in society rather than the Beastfallen.  Our main protagonist doesn’t really get the time of day aside from a couple choice moments in order to be ‘developed’.  Aside from that, the rest of the series is devoted to the problems that the witches in Wenias face and their on-going war for freedom from oppression.  \\n\\n\r\nDespite that problem, the show is one of the most well paced series that I’ve seen in a long while.  Taking account as many details as they could, White Fox managed to create a series that neither felt boring nor too rushed to watch, letting things continue as they went along at an even pace so that every moment felt engaging.  Many times, I felt as though the episodes were too short because I was so engrossed in watching it.  \\n\\n\r\nWhile less eventful than the climax and many other sections of the story, the ending manages to cap off the first main arc of the series that acts both as an ending to the entire series while being open-ended enough to welcome a second season if White Fox so chooses to do so.  Not really a big fan of how many things were thrown into exposition, but I guess to develop the whole scope of the story’s events, they had to make a couple things via time skip to make things a lot easier.  \\n\\n\r\nOverall, despite its imbalance with who and what it chooses to characterize, Grimoire of Zero was a show that was gripping from start to finish.  Having a simple plot that was explored to almost its full extent, the show managed to be both engaging and entertaining to the end while providing good world building that mixed in the central conflict of the series.  Every episode felt too short for me to fully appreciate, and it left me wanting more.  My only complaint really is that there is no second season.  Please White Fox.  Do it.  \\n\\n\r\nOverview:\\n\r\n+ Well-paced story\\n\r\n+ Simple, yet effective plot\\n\r\n-  Who they characterized was imbalance  \\n\r\n-  Ending is a bit…uneventful comparatively\\n\\n\r\nCharacters:  As mentioned before, the show’s plethora of characters act as members of one side or one motive while our main characters act as a ‘third’ or ‘faction-less’ group that gets involved with their own sets of goals in mind.\\n\\n\r\nThe first is Mercenary; the giant fluffy tiger man that despite having a giant FFVII-esque sword, is actually quite soft and fluffy on the inside with a pension for cooking.  Being a Beastfallen, Mercenary is a character that despises witches and dreams of one day curing him of his beast curse and opening up a pub once he’s human.  As a character, Mercenary is very much a character that sits in his own morals but doesn’t act outside of what he isn’t involved in.  As such, he’s less of a by the numbers fantasy protagonist, and more of a ‘does whatever he wants’ kind of guy, which fits into the story perfectly.  He acts as the more grounded character of the duo and gets some significant change once the series starts picking up and his more ‘lone wolf’ demeanor softens up.   \\n\\n\r\nThen there’s Zero, the tiny white-haired witch who enjoys the simple things in life: food.  Comparatively, Zero is the freer, more airheaded member of the main duo, as she had spent her life in a cave up until her book was stolen, and lacks any kind of basic knowledge of the outside world.  Rather than being a ditzy klutz (mostly), Zero is a calm airhead simply because she doesn’t know anything aside from the intricacies of magic, leading to a majority of the show’s comedic and enjoyable moments due to her hilariously blunt nature and lack of what would widely be considered as ‘common sense’.  As such, she has something of a unique identity that when mixed with her mercenary, creates fun character interactions between two quite likeable characters.  \\n\\n\r\nFor the supporting cast, we’re treated to a myriad of characters who act as players to the bigger stage of the kingdom of Wenias, as most if not all of them have some kind of affiliation to one faction or another in the war for magic.  As such, characters like Albus and the Sorcerers of Zero are clearly defined to think one way while the royal kingdom and its citizens think the other in order to give clear definition on their opinion of the matter and thus easily explain the overall conflict of the scenario.  While less interesting than our main protagonists, the majority of them play their part as the background scenario well, which is the most you could ask for in a series featuring two clearly defined sides.  The only one of the supporting cast that differs from this rule is ‘Thirteen’; a character similar to our main protagonists as he only does what he believes is right/based in his own goals and a compatriot of Zero.  \\n\\n\r\nOverview:\\n\r\n+ Very intriguing main protagonists\\n\r\n+ Fitting and clearly defined side cast\\n\\n\r\nArt: Produced by White Fox, Grimoire of Zero has the clear fantasy look that the studio has used for previous projects in the past (such as Re:Zero, for example)  More or less standard fare in terms of the quality of this day and age, the animation and art quality for the show is good, but not overly amazing or budget breaking.  \\n\\n\r\nI do however want to bring attention to the various forms of magic used in the show, as the intricate circles and various effects of the spells enhance the art quality to truly feel like a fantasy/magic show.  Additionally, and this is more personal than anything, the character design for Zero is amazing.  It’s the right amount of complexity and really fits with the overall aesthetic of the show.  \\n\\n\r\nOverview:\\n\r\n+ Nice touch on the magic usage\\n\r\n+/- Standard art\\n\\n\r\nSound: “Hakkensha wa Watashi”, the OP for Grimoire of Zero is a whimsical rock song that helps provide an adventurous tone to the travels of our main characters and contrasts the more serious tone of the magic war in the series.  Personally, I feel like the song itself isn’t all that memorable, but it is a good track that’s been on a few of my own song loops.  \\n\\n\r\nTo contrast, the ED, \"Hajimari no Shirushi” is a laid back piece that relies more on strings and light piano to elevate a sense of wonder in our characters’ journey.  Accompanied by a children’s book graphic, the ED feels a lot better than its OP counterpart, as it has a nice style to it that gives us a nice contrast everything that the show has given us up until this point.\\n\\n\r\nOverview:\\n\r\n+ Good tracks\\n\r\n+ Memorable ED\\n\\n\r\nPersonal Enjoyment: At the start of the season, I always handpick about a dozen shows to watch/review for the season.  Some are ‘obligatory’ as I watched and reviewed a previous season of it so it’s only natural that I do the same for subsequent seasons, and others are those that I personally find intriguing.  As a fan of fantasy, I found Grimoire of Zero to be interesting at first glance.  Before I knew it, it had become my most anticipated show of the season.  The overall plot had more to offer than just a simple magic-based story and had a lot of aspects that meshed well with each other to culminate into what we have.  I was so sucked into it that I was left wanting more, and I really, really want a second season of this because I really want to see more of Mercenary and Zero’s travels throughout the world plagued by magic.  \\n\\n\r\nDid I enjoy this series?\\n\\n\r\nI think I may have enjoyed it a bit too much, but you can’t really blame a guy for having a preference, right?  Personally I found Zero to be the highlight of the series.  Her character was always such a joy to have on-screen, and I always appreciate a unique character to help tell the story.\\n\\n\r\nWhat didn’t I like about his series?\\n\\n\r\nAlbus was really the big stickler for me.  They admittedly do play a big part in the series, but I just kinda found them annoying with their constant, constant preaching for their look on everything while I just sat there wanting to see something else involving Zero.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you’re a fan of fantasy of magic, I would highly recommend watching this.  It has a unique enough identity large enough to completely separate itself from a majority of the cookie-cutter magic-based shows, showing that original ideas really can be successful.  The main characters are interesting, the entire plot is fleshed out, and it has such nice pacing that it feels almost like magic that this kind of even pacing can even exist in this era of rushed adaptations.",
            "date": "2017-06-27T14:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 251244,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=251244"
        },
        {
            "content": "Once again this is an anime that gave the vibe of a light novel adaptation. Light novel adaptations give a much slower pace in terms of character development, plot, and amusement. Because of such attributes, such anime fails to quickly grab the viewer's amusement when it starts off. However, I do not regret watching this anime, because by about episode 7 or so it becomes interesting.\r\nThe story is considerably well-planned. I can see that the author tried hard to give plot twists, foreshadowing, and such. After having watched 11 episodes, with only the final one to watch, it was certainly worth watching and adding tomy anime list.\\n\r\nStory: 10\\n\\n\r\nThe art was great. I don't remember seeing any lazy parts of the animation, but the style of the drawings in generally was one of those commonly drawn styles. Because of the commonly drawn style of drawing, one would not particularly watch this anime solely for the art style. For some reason, this art style feels so redundant.\\n\r\nArt: 8\\n\\n\r\nThe voice actresses fit with all of the characters. The tiger sounds like a heavy man, Zero (the girl) sounds like how it should be and such. The OP, ED and OSTs all sound like they are on the good side. Perhaps the voice actors could have put more emotion to their acting, because that is the impression that this anime seems to lack, much like that of other average-looking anime.\\n\r\nSound: 9\\n\\n\r\nNone of the characters really stuck with me in the first few episodes, but I can see how the author tried to make them feel like relatable characters by the conversations between Zero and the tiger and such. The character development feels slow, so only after a while, the characters started to stick with me. Also, the relationship between the Zero and the mercenary was quite relatable. Towards the end of the anime, all of the characters will be relatable, because they all have some kind of impact towards the entertainment of the anime.\\n\r\nCharacter: 10\\n\\n\r\nOverall, this anime was enjoyable because it was worth watching. The theme anime seem to focus on the hierarchy of society and the oppressed. The moral and such is something to watch out for because I guess that is what makes the plot of this anime worth watching and interesting. \\n\r\nEnjoyment: 9\\n\\n\r\nThere were relatable characters, good story, nice voice actors, good art. Thus I give this anime a 9. If the voice acting and the art gave more of a deeper impression, I would give this anime a 10. \\n",
            "date": "2017-06-19T18:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 250383,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/eeasuper",
                "username": "eeasuper"
            },
            "url": "https://myanimelist.net/reviews.php?id=250383"
        },
        {
            "content": "So this series is nice and it is kinda great to see a new anime series with races like beauty and the beast\r\nMy complain is just this anime is too pushed and eventhough it takes 1 novel in 1 anime which is freakin slow, they should have been more detailed\r\nI mean like when that wolf and 13 turned into super ally and kind after doing horrible things like mass killing & slaving(btw I still hate that wolf for slaving womens) \r\nAlso what is the reason for albus to like mercenary? Why she kiss mercenary?\r\nAh btw for me mercenary x Alb... *cough* I mean MERCENARY XZERO FTW!! XD\\n\r\nWe do really need some more romance if there any season 2 :3",
            "date": "2017-06-28T07:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 251321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020384.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seadragongamv",
                "username": "Seadragongamv"
            },
            "url": "https://myanimelist.net/reviews.php?id=251321"
        },
        {
            "content": "In short note:\r\nBeauty and the Beast, Fantasy anime version\r\nStory: 8\r\nIt seems like a typical fantasy world adventure at first, but the plot thickens in the middle with several twists behind another twist. Although it feels a bit off in the end, this may or may not be the best point of the show.\r\nArt: 7\r\nStandard LN adaptation art style, and Character Design. But the city in medieval age portrayal , Beastmen model and landscapes was looks nice too. The battle scenes and the spellworks were decent even without that spectacular movement. This is a show about mage after all and mage doesn't move that much. Thespinning bottle scene was hilariously real.\\n\\n\r\nSound: 6\\n\r\nStandard BGM during fights, nice ED. Nothing much to say in here.\\n\\n\r\nCharacter: 6\\n\r\nAside from MC and Main Heroine, all other Character are so plain. The villain was especially have a bad writing that it doesn't even qualify as a villain. The only person that notable was that one dead character that keeps getting mentioned every time along the show, without even met the MC. If only this show has better writings, this show could be much better.\\n\\n\r\nEnjoyment:7\\n\r\nI got hooked for a while in the middle part, but may put off some people in the last bit. If you can bare the lame part with the curiosity alone, you might as well enjoy this to the end.\\n\\n\r\nOverall:7\\n\r\nFantasy world full of mages, with some nice city and background art. Have a decent story with good pacing, with the most lame villain ever. Have some potential in the middle, but falls of in the last part.\\n",
            "date": "2017-07-29T04:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 254119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4671138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NickSpringfield",
                "username": "NickSpringfield"
            },
            "url": "https://myanimelist.net/reviews.php?id=254119"
        },
        {
            "content": "Initially, I enjoyed this series since it portrayed a \"godly\" character and there was undoubtedly a lot of potential, but the last 2 episodes were, if anything, reversing its potential in the earlier episodes.\r\nStory:4\r\nWell, the story had a few twists along the way, but it's along the way of an adventure and trying to resolve a conflict. Basically it's about a war going on between sorcerors and non-sorcerors and how Zero wishes to find her book, but really, it's kinda cliched and predictable at times.\r\nArt:8\r\nKinda standard but smooth animation.\r\nSound:8\r\nKinda standard as well.\r\nCharacter:3\r\nThis is the category that is really subpar. Apart from really scant character developmentand background along the way, some of the characters seem to be inconsistent in their behaviour, thus making the whole storyline hard to understand at times. Especially Thirteen.\\n\\n\r\nEnjoyment:8\\n\\n\r\nOverall:6\\n\r\nGenerally below average especially near the end of the series. The resolution is kinda anti-climatic and strange. Gotta say this is one of the more anti-climatic endings out there. Great potential but poor execution.",
            "date": "2017-07-01T08:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 251642,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=251642"
        },
        {
            "content": "*** Spoilers ahead****\r\nStory:\r\nThis show started out very promising when Zero and Mercenary first met.\r\nThey are both very likeable and they have great chemistry together.\r\nTheir goal was clear: Mercenary helps her to find the Grimoire of Zero and she turns him back into a human.\r\nNow if this show would've just been these two going on a journey to find the Grimoire of Zero, if this would've been an adventure anime, then I would've loved this.\r\nHowever, this was not the case.\r\nThe first warning I got was when Albus joined the crew. \r\nI didn't like him from the very beginning because he was just the typical brat andhe really got in the way of Mercenary and Zero's adventure.\\n\\n\r\nBut over time he grew on me and I learned to accept him and I really liked this show, besides AoT S2 it was my favourite show this season.\\n\\n\r\nBut then the villain, 13, was introduced into the story. \\n\r\nAnd that's where this show went downhill for me.\\n\r\nThey split up Mercenary and Zero for a couple of episodes and shifted the focus to 13 and Zero's relationship.\\n\\n\r\nMercenary and Zero are great together but mediocre when alone.\\n\r\n13 is just your typical villain who claims he does it all for his live for the girl.\\n\r\nNothing special about him at all. (Besides him being voiced by Dio's VA)\\n\\n\r\nThis really brought down this anime for me. Zero needed to be rescued and we also had the typical misunderstanding between the main characters that you get in so, so many stories and that is just annoying because you know how this is going to end.\\n\\n\r\nArt:\\n\\n\r\nIt was done by White Fox and it looks just like Re: Zero, nothing special, nothing fancy but decent.\\n\r\nThough it's missing some highlights which Re: zero had.\\n\\n\r\nSound:\\n\\n\r\nOpening is decent but forgettable, same with the OST.\\n\\n\\n\r\nCharacters:\\n\\n\r\nAs mentioned before Zero and Mercenary are great together but mediocre when alone.\\n\r\nAlbus started as the typical brat in anime but he got better over time.\\n\r\n13 is just bad and ruined this anime for me.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nWhile I was rather harsh on this anime, I still enjoyed it in the beginning.\\n\r\nThe main reason for my harshness is that I was so disappointed after the villain was introduced after liking it so much in the beginning.\\n\\n\r\n6.5/10",
            "date": "2017-06-18T07:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 250240,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4721276.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raycont",
                "username": "Raycont"
            },
            "url": "https://myanimelist.net/reviews.php?id=250240"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI hope to one day write my own novel.\r\nWhile writing reviews, analyses, and essays is my forte, I have always had a keen interest in fiction. Whether completely imaginary like the Harry Potter series or closer to realism like 1984, the approach involves a different mindset that is fun to indulge. Creating witty dialogue. Describing scenery. Forming logical plotlines. It’s much different than articulating how an anime accomplished its goals or basing events off a personal set of ideas.\r\nZero kara Hajimeru Mahou no Sho features a novel of sorts – the Grimoire of Zero –written by one of its characters. In some sense, it contains the purely fictional (to us at any rate). Sadly, it doesn’t contain the solution for the show’s lagging performance.\\n\\n\r\nSTORY\\n\\n\r\nZero kara opens with witches at the stake and a huge white tiger-man fending off a few bounty hunters. After escaping the city, he, by chance, encounters a powerful female sorcerer just trying to enjoy some soup. She offers him the miracle he has always dreamed of: to turn back into a human. He must only act as her bodyguard while they search for her all-important book that, in the wrong hands, could destroy the world. After a finger-blood oath between the two, the witch-hating Mercenary and the “wagahai”-saying Zero begin their adventure in earnest.\\n\\n\r\nSaid adventure certainly contains the right elements to achieve narrative strength. The fantasy setting. The writing chops. The noticeable themes. Unfortunately for Zero kara, it takes these elements, attempts to form some magic with them, and ultimately summons a lackluster tale despite its many possibilities.\\n\\n\r\nLacking begins when it tackles the fantasy that drives the setting. The anime takes place in a world that resembles Medieval times with an extra helping of magic and beast men (known as “beastfallen”). To the show’s credit, it does try to build its world at times. For instance, as the characters investigate the carnage following the sacking of the village of Latette, Zero describes some of the spells used and what they can do. The anime also highlights the tensions between the different political and warring factions, including beastfallen, sorcerers, and regular humans.\\n\\n\r\nYet the show’s delivery of this information isn’t always sound. For the first three episodes (and never again afterwards), a narrator spews out relevant details to get the audience up to speed rather than letting them learn of it through more natural means. Then, in episode six, the characters do almost nothing but talk with and at each other about the current situation. Again, this info is necessary to create a believable, connected world, but the method behind its creation doesn’t go for anything enticing.\\n\\n\r\nFurthermore, Zero kara doesn’t deliver enough. Despite everything going on, the anime never really goes out of its way to build a finer, more nuanced world for its characters to run around in. The knights hardly interact with the sorcerers, losing out on potential quarrels and insight. Minimal exploration of different areas keeps the kingdom itself either too isolated or too disparate as well.\\n\\n\r\nBeyond the fantasy setting, Zero kara also has some clout with its writing chops. Quite regularly, the anime demonstrates a clear grasp of creating plot points and following through on them in a logical, fair manner.\\n\\n\r\nTake the magic potion that Thirteen gives to Mercenary to nullify his beastfallen self. It not only symbolizes his conviction to stay true to the quest that got him here but also it becomes the item that frees Zero from her magical prison later on.\\n\\n\r\nOr how about those blood contracts near the very beginning of the season. They form the basis for Thirteen’s scheme when he reveals that his death as “Him” will kill every Sorcerer of Zero and rogue witch out there presently.\\n\\n\r\nZero’s tattered robe that she trades for a better set of stylish clothes counts, too. It gets used as part of a tracking spell that was in turn introduced back in the second episode of the season with Mercenary’s fur and the undercover witch.\\n\\n\r\nCan’t forget about the “curse” placed upon Mercenary by Zero either, for it pops up in quadruple fashion. Once when Mercenary is shot with an arrow. Once when Thirteen stops the guards from attacking him. Once when the giant dude bites Mercenary’s arm. Once when Mercenary blocks Zero’s mega attack to stop her from accidentally killing Thirteen and subsequently herself.\\n\\n\r\nNot to mention the cool idea of Zero purposefully writing the spells in the Grimoire of Zero incorrectly, a detail that the audience can potentially catch onto when noticing her chants during her duel with Thirteen.\\n\\n\r\nTruth be told, none of these examples stand out as exceptional in terms of impact or intrigue. But they no doubt stand as evidence for the anime’s respectable writing choices.\\n\\n\r\nHowever, it must be noted that several of Zero kara’s story beats belittle the progression made instead. Biggest among them? The entire plot predicated by the fact that Thirteen essentially didn’t talk with and ask Zero about what she really wants. Plus, the tension involved throughout the last conflict lacks weight. Thirteen already used his rat familiar to coerce his followers to fight, yet he apparently cannot undo his decree despite their devoutness.\\n\\n\r\nSmaller writing oddities affect the show as well. The convenient forced-teleportation spell after triggering a specific word seems too easy to push things where they need to go. A strange decision to cut the dramatic scene following Zero’s near death has no place. The group managing to traverse the entire kingdom in a strangely timely manner when placing the five mega-magic circles raises an eyebrow. With all the respect the writing deserves, it still foregoes some of it of its own accord when it commits to these weirder, weaker choices.\\n\\n\r\nAfter the setting and the writing, the themes also try their hand. They dabble in morality through perspectives on racism and mindsets. One of the best scenes from the season follows these throughputs well. In episode seven, a young lady humors Mercenary, tricking him to have him help drive away other beastfallen at their establishment (or, as she and he put it, “It is what it is”).\\n\\n\r\nThese moments are few and far between, though. Indeed, Zero kara often misses out on a more balanced view of these topics, portraying each group involved as mostly negative rather than reaching for a middle ground. Serena was a kind sorcerer as was that old man who let Holdem walk free. Yet the constant misbehavior of the beastfallen. The current sorcerers almost never using their powers for good. The on-the-nose lines yelled by various villagers about the witches and their evil ways. Everything adds up to misbalance the anime’s thematic presence.\\n\\n\r\nAltogether, the setting, writing, and themes are all there for the show to capitalize on. Unfortunately, that doesn’t exactly happen even with its best efforts, leaving the narrative without an option to summon further refinement.\\n\\n\r\nART & ANIMATION\\n\\n\r\nFor the most part, Zero kara gets the job done with its visuals. On an artistic level, the locations do little else besides fit where the characters are and what they are doing. E.g., traveling through a forest, visiting a busy city. They aren’t explored to any large degree, and the details present do not invite anything of interest to look at. Most likely a byproduct of the anime’s lack of world-building drive.\\n\\n\r\nNevertheless, the show displays at a semi-infrequent rate key shots that argue a lot more in its favor. A faraway view of the kingdom’s capital with a mountainous backdrop. The crew’s bonfire illuminates their lonely spot during the forest’s dark night; it eventually gives way to them overlooking a section of the forest as a rainbow arcs overhead. A somewhat top-down shot of Zero’s cavernous “home” as ominous red lighting fills the air. Again, these shots are by no means around all the time let alone to a noticeable extent. But, when they do appear, one has to at least appreciate their detail.\\n\\n\r\nFor the rest of the anime’s production and animation, it goes back to that serviceable state. It rarely tries for anything fancy in its scene composition or techniques in general. The most adventurous it gets is in episode six. Thirteen and Mercenary hold a private conversation, and a neat rotating-camera trick simulates the former’s hypnosis of the latter. All the while, the centralized glass vial housing the magic potion he desires reflects their faces.\\n\\n\r\nOtherwise, a couple of rotated frames here and a few magic uses there counteract the weird charging close-ups of Holdem in his duel with Mercenary and the disregard for any interesting imagery overall.\\n\\n\r\nThe character designs likewise follow suit. Albus is designed to look like a teenage boy, so her looks do conceal her true nature, but the tradeoff is extreme plainness. Thirteen’s black cloak, dark purple eyes, unkempt hair, and angled face translate well into an evil aura, but his demeanor and slowness strip away any intimidation. Mercenary and Zero do fair a bit better, though. Mercenary’s large build, rogue outfit, and white fur both mirror and complement Zero’s small build, sorcery attire, and white hair, making their designs a fun, dichotomous duo.\\n\\n\r\nIn all, the visuals remain consistent in their meager delivery. Not that that hurts the anime, but it doesn’t help it out either.\\n\\n\r\nCHARACTERS\\n\\n\r\nMercenary, Zero, Albus, and Thirteen. As the four main characters of Zero kara, they contribute to this anime in various ways. They also vary in their efficacy, too, putting their group in a questionable spot right alongside most of the other parts to this anime.\\n\\n\r\nMercenary stands the tallest among the group both within the show and in an analytical sense. With fangs, fur, and ferocity, he embodies the beastfallen moniker. His white coat coats his fervent dislike for witches, and his big build and even bigger sword makes him a force during any fight. Yet beneath his rough exterior, a softness of heart guides his path.\\n\\n\r\nFor, while he may frown upon Zero and Albus for their sorcery and their actions, he looks out for their well-being. He makes them soup. He finds them lodgings. He protects them to the best of his ability. He’s no saint, but he clearly strives for what is at least morally good. A statement reinforced by his honesty when dealing with Zero’s priceless gems in episode three.\\n\\n\r\nAlthough, his kindness towards them is somewhat out of a desire of his own: to be a full-fledged human. This conflict arises out of a few interspersed scenes. In a flashback, he attacks and kills a gang of bandits who were terrorizing his village to obtain his head. Another occurs in his arrested freefall where he remembers how he and other beastfallen were mainly expendable losses in war, and his prowess and violence earned him the nickname “The Black Beast of Death” as well as jeers for his demise.\\n\\n\r\nSo, when Zero crosses that path of his, and her sincere words match those of his mother’s from when he was a kid, he accepts her offer with his own style of oath. What follows, then, is his journey alongside that which (and witch) he hates, experiencing troubles of a physical and mental nature as he fends off baddies and learns more about the magical world (and people) around him.\\n\\n\r\nCome the end of episode six, however, it is clear that the seeds of doubt still stir in his soul. He (unwillingly) raises his blade against Zero, forcing their separation and his contemplation. Nevertheless, she keeps him alive thanks to her powers and keeps him sane thanks to her reaffirmation of the softness within him. The latter especially, for he nearly succumbs to the beastfallen desire of eating flesh that the show alludes to a few times throughout the season. Thankfully, his memories (albeit neither extensive nor moving) of their time together stay his fangs.\\n\\n\r\nNow with a clearer mind, he knows what he must do. He works with Holdem to save Albus from her untimely fate. He scales the side of a cliff and climbs the outside of a castle to reach Zero and to tell her that what little brains he has were enough to convince himself that he had to be there for her despite his doubts. He even takes part in the final magic ritual (but not before a playful prod), indicating that, by this point, he has overcome his disdain for those arts to at least some miniscule extent.\\n\\n\r\nZero kara gives Mercenary a rather appreciable arc to his character – except it flubs his finale. With his journey complete, he doesn’t receive his desire to become a human. He doesn’t get to settle down as an inn proprietor like he wanted to either. The audience doesn’t even get to learn his real name, missing out on a neat full-circle writing chance right at the end.\\n\\n\r\nRather, the anime doubles down thrice. One, the beast part of soul is fused even tighter to him after the ritual. Two, he continues traveling with Zero. And three, he actively refuses to give his true name or learn Zero’s, saying, “Well, maybe it won’t be so bad if I’m a beastfallen a little while longer,” a statement that contradicts his base motivations. In short, this open-endedness to his arc stops him from being a solid character and closer to barely a competent one.\\n\\n\r\nArguably, his line there follows a theme on being comfortable in one’s skin (or, in this case, fur). But that was never really a talking point of the show. Instead, what it focused on most was that of indirect loneliness. The audience sees it handily with Mercenary. As a beastfallen, he’s ostracized to some extent, he is belittled, and he cannot get along with humans or witches.\\n\\n\r\nZero experiences such indirect loneliness as well. In fact, almost her entire character stems from this idea. It’s obvious from her interactions in the city and with Mercenary that, despite her skills, she doesn’t have a grasp on how regular life and normal society works. Seemingly because she has been kept in a cave for most of her life, knowing only faded pages for friends and an occasional peeking sun to keep her company. She explains as such periodically, too.\\n\\n\r\nAs such, her connection to Mercenary means a lot to her since he’s one of the only people – beastfallen or otherwise – that she has ever bonded with. Unfortunately, Zero kara does not go too out of its way to build their relationship.\\n\\n\r\nThat’s partly because of Albus, a necessary evil in this show. She basically represents the “other side,” the counterpoint to much of the plot’s discussion about the warring factions. She either introduces or says a line of thinking that relates to the sorcerers’ camp, and the anime proceeds to highlight why her naïve worldview isn’t as black-and-white as she may believe. Furthermore, without Serena around anymore, and realizing that her newfound friends do not necessarily agree with her stances, she as well goes through that same indirect loneliness.\\n\\n\r\nHowever, with her inclusion, she severely detracts from that key component of Zero kara: Zero and Mercenary’s relationship. With this third wheel constantly around and spinning, the two main characters of the anime hardly have any scenes just together to make their connection worthwhile.\\n\\n\r\nNot to mention that Zero is simply not a compelling character on her own, and the anime itself sidelines her for a sizable chunk of the last half of the season. This sidelining mirrors her time in the caves and coincides with that indirect loneliness, so it does make sense on a writing level. However, the anime spends very little time addressing her thoughts and her actions while in captivity to make it worth the time. So, when her climactic scene with Mercenary in the castle tower arrives, it’s nice in concept, but the foundation for it doesn’t exist or at the minimum doesn’t have the support required to elevate it to a strong level.\\n\\n\r\nThen there’s Thirteen, the weakest of the four. He appears roughly halfway through the season as a quasi-evil dude. Simultaneously, he acts as Zero’s caretaker and teacher (or to her, “brother”) during her cave times and, after his leave, a zealot to the cause of granting her the world that (he thought) she desires. Where she viewed magic as a tool that would benefit everyone, Thirteen saw that it would be nothing else besides a weapon for the common simpleton.\\n\\n\r\nHis thinking somewhat comes true when his secret ploy upholds the inevitable abuse and misuse of this magic. As for his actual character, it does not uphold as well. Because of the mystery that surrounds him on a plot level, he never receives enough attention. There’s no tangible context to his rise as “Him.” His admiration of Serena has little to no basis. His feuds with Albus and Holdem do not have the necessary room to grow. He doesn’t relate to that indirect loneliness as well as the others. Just a weak character all in all.\\n\\n\r\nOverall, on the total execution scale, Mercenary rises above Zero, Albus, and Thirteen. But when Mercenary does not attain anything higher than competency, the cast here do not deserve much praise whatsoever.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nAlthough last in order, the ending track wins first. Titled “Hajimari no Shirushi,” delicate piano keys and light acoustic strings calm the audience in their simple, gentle flow. Soft vocals accompany the instrumentals, upping the calmness of the piece that much more. The melodic pace moves the song along in a nice way, and the rise in tone changes its structure without taking anything away from that calming feel.\\n\\n\r\nOpposite the ED, the opening track heads for the back of the pact. Immediately, the sound of this piece is entirely unfitting. It would be appropriate for a story aimed at something slightly whimsical rather than serious like Zero kara. The vocals aren’t shabby, and the beat has a catchiness to it, but the punk-rock body of the song simply detracts from the established direction of the content itself.\\n\\n\r\nTsuyoshi Koyama as Mercenary likewise hurts the show’s chances. To start, his voice for the white-furred beastfallen does not go deep enough to match his build. The delivery of his lines lacks emotion, too. And roars sound less like a ferocious tiger and more like a guy frustrated from stubbing his toe on a nearby table. Not that his performance is a total failure – it just didn’t embody the main character in full.\\n\\n\r\nLess frustrating is the rest of the original soundtrack. While it has lively songs like the one that plays when the group enter Formicum, the OST mostly sticks with mystery vibes and everyday tunes instead. Deliberate piano keys. Calm trumpets. Reminiscent wind instruments. Wild yet reserved violin strings. These tracks are all rather simple in design, but they support the anime well enough throughout the season.\\n\\n\r\nWith the ED and the OST on one side, and the OP and the VA performances on the other side, “split” just about sums up Zero kara’s audio outing.\\n\\n\r\nENJOYMENT\\n\\n\r\nMy initial impression of this anime was not favorable. I hardly liked anything that it set out to do: the bland characters, the plot direction, the different details at each turn. Just a whole lot of me shaking my head at its repeated, failed attempts to pull me in.\\n\\n\r\nLo and behold, revisiting the show anew with fresh eyes and a fresh mind did not change my thoughts.\\n\\n\r\nThose characters? Mercenary is not funny or cool or interesting or nuanced. The best he can do is take up a lot of space on-screen as he complains out loud. Zero says “Wagahai” a lot, but her formality cannot distract from the fact that the pebbles on the sidewalk have more intrigue about them than she does. Thirteen is thirteen times too boring. And don’t even get me started on Albus, for I only need one simple word to describe her: annoying.\\n\\n\r\nThat plot? Let’s just let Thirteen live as an innocent among us despite him literally prolonging a war that killed hundreds if not thousands of beastfallen, witches, and humans. Holdem kept a bunch of women as slaves, but we’ll forget about that whole aside I suppose. I couldn’t care less about the twist that Albus is Sorena’s granddaughter because I couldn’t care less about her.\\n\\n\r\nThese extra details? Magic battles and usage were not entertaining. Mercenary and Holdem run through a crowd of people that somehow grows in size the longer they sprint. That one guy who got attacked at the secret hideout for the Sorcerers of Zero needlessly died because they stood around and did not bother to heal him.\\n\\n\r\nAdmittedly, I’m being rather harsh right now on the anime. To its credit, it never really gets worse as each episode rolls along. Nothing that it presents is outright horrible or ill-conceived, and I can tell effort exists within this project. Yet because it remains consistent in a mired, mediocre state for nearly its entire run, the small grievances I have just pile up to the point that I cannot personally perceive it in a positive position.\\n\\n\r\nZero kara Hajimeru Mahou no Sho does have something to show for itself, but so many of its decisions drag it down. The story and characters include a lot of that pushback, but the serviceable and questionable audiovisual elements don’t do a whole lot in return. Fiction or no, it writes out a lagging novel all the same.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, the setting, the writing, and the themes have definite clout, but they each have a bunch of problems regarding exploration, nuance, and balance that ultimately affect the narrative’s execution\\n\\n\r\nArt & Animation: Fine, the visuals involved get the job done, nothing more and nothing less\\n\\n\r\nCharacters: Bad, Mercenary’s open-ended arc leaves him as competent rather than solid, Zero is neither compelling nor connected, Albus is a necessary evil, Thirteen misses the mark, but at least a theme on indirect loneliness can be found among them\\n\\n\r\nMusic & Sound: Fine, an unfitting OP counteracts a nice ED, not all the VA performances pass, and the OST works, albeit in a very simple fashion\\n\\n\r\nEnjoyment: Terrible, boring characters, lame plot, and uninteresting details\\n\\n\r\nFinal Score: 3/10",
            "date": "2018-03-18T10:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 274199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274199"
        },
        {
            "content": "Spoiler free!!\r\nThis anime is kind of well what should i say (kind a cute!!) has lots of kawii!! moments ...well has a decent plot so...if your looking for a fantasy anime it fits the bill...and might get a bit plain in the middle and in the end so dont expect too much from it the chemistry between MC(the tiger )  and zero is nice some thing very similar to beauty and the beast .....but with different bonds. So if your having a hard time finding a decent anime you should watch it...dont expect to much...has fine not too good action ...and sometimes things goway to positive..",
            "date": "2017-07-18T23:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 253193,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5647903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/D27",
                "username": "D27"
            },
            "url": "https://myanimelist.net/reviews.php?id=253193"
        },
        {
            "content": "My first thoughts were: \"Oh, seems like someone is short of ideas how to name shows\". \r\nThe story takes us to a magic world filled with witches... and beastfallen. Okay, from the very beginning it doesn't proclaims itself as something totally new. The setting is meh. The show manages to convey world's history in a poor way. How many times did you see a world with witches (magicians, special ability users, ninjas, gamers, hamsters) and those who hunt them? One way or another... I've encountered it myself dozens times. Overused troops are present here in quite a number. I had a vague sensation of secondarinessin everything. \\n\r\nIt begins with an union of the beast and the girl. I have to admit this part is quite cute and pleasant to observe. The anime should have concentrate on a relationship of Mercenary and Zero more on my opinion. I think everything else was unwanted. Every time the anime would turn to some action part or to some other storylines, I'd found myself rather bored. It would turn out even more interesting if it were a slice of life anime within a fantasy world. Unfortunately, it's not. Honestly, sometimes I had to endure watching it. Reaching the end, it becomes more and more dull. \\n\\n\r\nVisual part is just okay... But again, fight scenes are just not good. It wasn't properly explained in the show how they use magic. I often questioned myself what are those circles and stripes around them when they cast powerful spells, for example. Why they change colors etc.\\n\r\nI don't like they way they were drawn. It's unsystematic. \\n\r\nOn the other hand ordinary scenes are quite decent. \\n\\n\r\nI liked the op and the ed. I can't say anything more about OST-s probably because they were quite ordinary to remember them. \\n\r\nVoices of Zero and Mercenary make a good match to their characters. Dialogue parts between them were truly good. \\n\\n\r\nPersonally, I'm prone to like characters which interact with each other like the beast and the witch did. That's cocky and nice. \\n\r\nHowever... there were another useless characters to my greatest pity. Albus is way too commonplace type of character. Furthermore, it's the type which annoys me. \\n\r\nThe antagonist here made me even more irritated. I can't even find proper words to express my \"facepalmness' of him. It's not like I had some hopes for him. But I didn't expect him to turn out \"a villain because of circumstances with good intentions\" type. Stupid. \\n\\n\r\nDon't you dare to complain it to Spice and Wolf. I'm a bit surprised there are people who compare them. It's on completely different levels. \\n\r\nAs a conclusion, I can say Zero kara Hajimeru Mahou no Sho sure had some potential. But it decided to choose a path of mediocre anime which is to be watched and to be forgotten. \\n",
            "date": "2017-07-03T10:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 251845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4915440.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Leegf",
                "username": "Leegf"
            },
            "url": "https://myanimelist.net/reviews.php?id=251845"
        },
        {
            "content": "This is just based on my likes, and since I've not watched many other fantasy anime shows, that'll influct in this review.\r\n(Also, I'm not and expert on English-language, sorry).\r\nIn the therms of story, this is not such unique, since souds like a story that any fantasy-themed story would have, but that doesn't have to be bad, actually I liked it, since it makes this show feels like some kind of Midaged Novel, the story about witches against humans, with beastfallens added is something that anyone who wrote a midaged fantasy would make, but that doesn't make the story bad.\r\nThe artstyle is something I really enjoyed,character desings and the scenarios are very well done for my taste, maybe some anime I've never watched has better art, but I really like this artstyle, specially the main cast desings, which are very pretty, and I feel they feet very well with them.\\n\\n\r\nMusic is good, and kinda reminds me an RPG game, maybe not Final Fantasy, but Fire Emblem or Dragon Quest (haven't played so much games of thouse franchies anyway), but it fits the stage.\\n\\n\r\nCharacters are very likeable, specially the main characters, Zero and Youhei make a very funny and cute pair (have to admit I ship them, they'd make a very strange-yet-cutie couple), but have to say that character development on some of the main cast as Holdem and 13 is rushed, in that way, the anime should've had more chapters to develop them (and I feel should be overall longer).\\n\\n\r\nEnjoyment is very well done, since when we see jokes, they're very funny and well done, a very good example are the first three chapters, that play with the Zero's rough and a little bit prissy personality, as well as her ignorance of the world's common rules, also taking Youhei in a very fun way (if you haven't noticed it, I really like them as characters, they're amazing), also, fights are overall well done, and the series doesn't fear to show blood, not a gore-level, but it's the fair amount of it.\\n\\n\r\nOverall, I enjoyed this series at all, but mostly because I like mideged fantasies and kemono-like characters, also, Zero and Youhei's relationship is one of the most spectal-keeping part of the show, I recomend, but know that many people will feel this as a generic fantasy anime, which I don't care, I just enjoyed it and that's all.",
            "date": "2017-12-28T13:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 266664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6014594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Luis-Adolfo-Wolf",
                "username": "Luis-Adolfo-Wolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=266664"
        },
        {
            "content": "I think many reviews didn't do justice to this piece of work. Hence I created an account to write for this review.\r\nMy first thought after I finished the show was : It makes me remember Spice and Wolf.\r\n-------------\r\nThere is a reason why this show has a rating 7.2 or above 7 while the reviews has mixed feelings about it.\r\n1) The plot and characters are standard and nothing special. (Rating : 7 standard)\r\n----- True , but it doesn't mean is has no depth. The whole story has a simple and VERY BASIC background settings..... \r\nbut the depth is there hence you don't see shitty rating of6.9 and below.\\n\\n\r\n*** Trust me , you will find similarities between this show and other big names simply because it has good basics. Just like how all good romance genres has certain similarities with each other.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n2) Depth (Rating : 8 Good)\\n\r\n----- This is NOT a show that tells you \"For some and no reason people can use magic and conflict arises from it and blah blah blah\". \\n\\n\r\nIt(magic) has a profound reason behind it to exist and took years of effort and studies to took hold yet despite what it seems , conflict still arise regardless. \\n\\n\r\nThroughout the series , the settings explanation is done in a well eloquent manners and THE BEST OF ALL : It tells the tale in a very very heartwarming tone like a mother's love.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n3) Plot Progression (Rating : 8 Good)\\n\r\n----- At every turning point , the decision making is being made clear. There is no ambiguous decisions that was made half-hearted , every turning point has a good reason.\\n\\n\r\n** Well , except the way some or if not most characters' introduction scene that is.... but otherwise the story flows well.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n4) Character (Rating : 7 Standard)\\n\r\n----- There is no stupid and spoiled brats throughout. Although some characters changing heart might have been paced too fast , but it can't be helped.\\n\\n\\n\r\n~~~~~~~~~~~~~~~~~~\\n\\n\r\n5) Art and sound (Rating : 7.5 Standard+) \\n\r\n----- Personally I have nothing to complain over it. Medieval time Bgm setting is usually soothing to my ear in a natural way without flashy sound effects, like birds chirping in a garden just the way it is. \\n\\n\r\nAs for why I gave it extra 0.5 instead of 7........ \\n\r\nbecause the heartwarming scenes are nicely done even though its nothing flashy/extravagant...... its just.... warm....\\n\\n\r\n--------------------\\n\r\nOverall : 7.5 ( Good+ )\\n\r\nIts a well done show , it wraps up nicely without any huge plot hole.\\n\\n\r\nBy well done , I mean it has the very basic and standard aspect of Magical Fantasy genre just the same as any other higher rating Magical Fantasy anime like Shakugan no Shana or The Irregular at Magic High School.\\n\\n\r\nAll 3 of them shares similar characteristic of giving its magical power a good background explanation and progresses without over relying on overpowered strength alone.\\n\\n\r\nExcept it is presented it in a simple yet profound setting. \\n\\n\r\nA standard heartwarming masterpiece for casual viewing indeed.",
            "date": "2017-09-01T20:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 256702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RnckO",
                "username": "RnckO"
            },
            "url": "https://myanimelist.net/reviews.php?id=256702"
        },
        {
            "content": "I really wanted to give this show a better review because I was loving it...for the first 3/4. I think it suffers from the same things a lot of the 12 episode series out there do. Basically, the world was fairly well developed, the characters seemed interesting and had room to fill out their history. The plot was intriguing, with mysteries to solve. Then you get to the last couple episodes, and the whole thing kind of vomits up all of the answers and exposition you never wanted, combined with a rushed ending that magically ties up all of the loose ends but really leavesa lot of holes in logic. It even feels like the writing takes a hit in those last couple episodes, like they either didn't have time to polish the script, or they were too rushed to cram in exposition and it hurt the dialogue. Ah well, it's still an enjoyable watch, it's just too bad it didn't have more time to flesh out the story and let it wrap up at a natural pace.",
            "date": "2017-08-02T20:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 254550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4722136.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/scottishrob13",
                "username": "scottishrob13"
            },
            "url": "https://myanimelist.net/reviews.php?id=254550"
        }
    ],
    [
        {
            "content": "Judging by Zero kara Hajimeru Mahou no Sho's low rating and reviews, it is easy to assume that it's an irredeemable show. While it is not good, it did have a few things in it that at least made it enjoyable (bearable for others) at times to watch. \r\nStory: 5\r\nThe sorest disappointment of this show is its story. As a huge fantasy fan, I was drawn in by the witch versus humans plot; but alas, the writers failed to pull it off. Their two biggest sins being a lack of focus and plenty of plot holes. Such as how long the war has been goingon, the nature of witches as a species, why did the story move in that direction, minimal effort was put into world building, etc. A lot of this could be forgiven as long as it didn't inhibit how the audience felt towards the show - which it did. The story distorted which side to root for without achieving an effective grey area. It's like the writers were trying to make the story morally ambiguous at times but they did it in such a sloppy way that they just confused the audience about how they should feel. Luckily, the story didn't do anything that made me livid (such as constant misunderstandings)- mainly wasted potential due to mediocre ideas and slopping execution of good ones. However, the traveling and subdued parts of the story were enjoyable. These moments felt a lot like Spice and Wolf at times and provided the most entertainment in the show. \\n\\n\r\nArt: 7\\n\\n\r\nThe art was pleasant enough. Nothing fantastic or distracting, but the character designs were nice to look at. Thankfully, there were no still shots. My chief complaint though would be the lack of magical action scenes. I'm fine if the anime is not meant to be a fighting anime. But when the story dictates that the characters will have to fight at times and the world has magic, then how come I can count on one hand how many fight scenes involved the protagonists using magic? A magic show without magic fight scenes is wasted potential. However, when they do have these scenes, the magic looks really nice. \\n\\n\r\nSound: 7\\n\\n\r\nThe OP and ED were not obnoxious and they fit the show well. The OST was not stand-alone fantastic but it served its purpose well. Other than Zero, the seiyuu were average but fit their characters. Zero's seiyuu I thought did an above average job. \\n\\n\r\nCharacter: 6\\n\\n\r\nZero was the best character out of the cast so it was enjoyable to watch her interact with her Mercenary. Her teasing nature and noble air stood out to me. But like the other characters, the writers don't develop her much. As for the rest, they weren't terrible but not memorable characters. They had to potential to be memorable, but the writers just got lazy and didn't develop them much. I would have scored it higher if they didn't use the \"introduced as a corrupt villain but is actually a good guy at heart\" cliche. \\n\\n\r\nEnjoyment: 8\\n\\n\r\nSince I'm a Spice and Wolf fan, I enjoyed some of the banter and fantasy-feel in this show. This is chiefly because I liked Zero's character though. I was disappointed by the lack of follow through, but nothing made me hate the show. It was short and story-driven enough to avoid boredom (even though the storytelling made it hard for me to care about what was happening) so I found fulfillment in watching it. \\n\\n\r\nOverall: 6\\n\\n\r\nI would have given it a higher score, but the story really hurt my impression of this show (especially in the second half.) It just kinda feels average. There's nothing in this show that another anime has done better. But if you just have some time to kill or don't want to think while you watch, you might enjoy this show.",
            "date": "2017-07-01T22:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 251716,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2477287.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jinneverland",
                "username": "jinneverland"
            },
            "url": "https://myanimelist.net/reviews.php?id=251716"
        },
        {
            "content": "Alright, so this is fresh just finished the last episode. With the way it ended, I won't be surprised if there's more, although I don't know how long the manga is either so I could be wrong, but even then I wouldn't be surprised if the manga has more coming. Anyway, this anime had a pretty good story, I did feel due to the shortness it was a little underwhelming, but I'm counting on another season coming. This anime was pretty funny throughout and had some good references in it. The story overall was a little bit confusing, but that's alright anime does that sometimesand it doesn't always make it bad where you have to watch it again to fully grasp everything, other parts were kinda cute too. The one negative thing I'd say about this anime is there simply wasn't much action in it, I was hoping this would be a more action filled adult anime. Surprisingly the dialogue was somewhat mature, but there was pretty much no blood, conflicts were minimal. A bit too much story centric for my liking. I was kind of tempted to give it a 6, but I'm conflicted. I'd probably give this anime a 6.5 in total. That said keep an eye out for the possibility for a season 2.",
            "date": "2017-06-29T05:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 251404,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5333608.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnthraxHierarchy",
                "username": "AnthraxHierarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=251404"
        },
        {
            "content": "I am sorry but for this review I am going to give some spoilers....  I cannot fully reveal WHY the 5 rating (which to me is not mediocre but fair) without giving some spoilers.. You have been warned :D \r\nOh,english is not my native language. I am sorry for all grammatical or syntax errors.\r\nFirst read the synopsis..\r\nAhh… it really felt like this anime had a great scope and world building but it really felt short in the end. Basically we follow three main characters – Mercenary (a beastfallen); Zero (a witch) and Albus (another witch who was hunting the Mercenary – we all knowthat beastfall hate witches).  \\n\\n\r\nWhat were their goals?\\n\r\n-\tZero, is a witch (not affliated with anyone) that wrote a book – Grimoire of Zero – that was used to spread magic throughout the land. Btw first plot-hole Magic already was used before??\\n\r\n-\tMercenary was going throughout the land killing witches\\n\r\n-\tAlbus (a regular guy who was part of Sorcerers of Zero)\\n\\n\\n\r\nThere is a war going on – In one side we have the Empire who abhors Magic; in the other we have the Sorcerers of Zero (witches) who started a war after the Empire killed Sorena (a witch accused of starting a plague) and then we’ve got some Rogue Witches (who basically are against them all but we never see them...)\\n\\n\r\nWe also have some mysterious character called \"Him\" that teach the Sorcerers of Zero magic (through the Grimoire of Zero) and we also have a guy called Thirteen who is a witch but fights for the Empire.\\n\\n\r\nIn the beginning of the anime we’ve got Zero - a young teen who is trying to find the book she created. She finds a beastfallen that she calls Mercenary and employ him as a bodyguard. Later we meet Albus who is hunting the Mercenary Albus is later captured by the Mercenary and Zero but  then becomes their companion rather than prisoner.  \\n\\n\r\nAs they travel throughout the land they arrive at a city where Albus says it’s the residence of the Grimoire of Zero. They found everyone dead and Albus says that maybe Sorena’s Grandaughter escape with it – well SPOILER ALERT – She is Sorena’s granddaughter SO why would she say that??\\n\\n\r\nThis some plot hole but there are so many of them… the all 13 and Him plot is rather bad.... Any normal person would immediatally knew that 13 was Him. After all it is said that 13 stole the Grimoire of Zero, but it was \"Him\" that teaches the Sorcerers of Zero with the book 13 stole (yeah right...) Oh... And \"Him\" ask that each sorcerer of zero to commit their souls to him – (so if they try to kill him or if he dies they all died) \\n\\n\r\nThen we've got the actions by 13? Well in the end we learn that 13 is killing all witches because he wants Zero to rule the land. What? So why did he first kill everyone with whom they live with, then teach people magic,  created a coven called the sorcerers of Zero and then join the other side to start a war? I really didn’t understand that… this is some bad writing right there…. And why is not Zero upset that 13 killed all her friends where she lived with?\\n\\n\\n\r\nThen there are other inconsistencies – Zero hires Mercenary to help him and then in some episode she makes a curse on him that says that everything that happens to him will get back to her – Why? If she loves him or cares for him and he being a tank is not a idiotic move? There is no real purpose for this… Who was the bodyguard of who?\\n\\n\r\nThen we've got Holden - another beastfallen. They first fight with him in the city because he had some woman captured. Later on we learn that he was the bodyguard of Albus - SO WHY THE HECK WAS HE DOING THAT? Were these woman related in any way to Albus disappearance? It made no purpose or sense...\\n\\n\r\n\"Characters\" \\n\r\n- Well, the Mercenary is the only one with redeeming qualities. We learn more about his drama and conflicts because beastfallen are not well receive within the human world; but they also hunt witches because they blame them for their curse state. It's like an outcast...\\n\\n\r\nZero – Well a young girl that creates the Grimoire of Zero and is searching for it in the open world where she had never gone before.  She doesn’t evolve that much in terms of characters – except – in terms of connecting to people. She has some comic reliefs throughout the season. But is she a good girl? She knows 13 killed all her friends from beneath the mountain but she is not even upset. She doesn't try to punish 13 after he started a war in her name...\\n\\n\r\nAlbus – A boy who turns out to be a girl and Sorena’s granddaughter and the leader of the pack called Sorcerers of Zero. Yeah that's it...\\n\\n\r\nThirteen – the main antagonist who basically kill thousands of people, so Zero could rule the land. He fought for both sides and play some seriously mind tricks on everyone (except when Zero tells him in the last episode that when she wrote the Grimoire of Zero she made some mistakes on purpose so no-one could beat her – what?) Another plot hole – So Thirteen only knows magic because of the Grimoire of Zero? Does he not knew before?\\n\\n\r\nThen in the end how do they resolve everything? Well basically Albus has eliminating magic throughout the land. In the beginning he starts doing just that – so my question is – every magician could do that or just him/her? \\n\\n\r\nAfterwards it’s Zero, the Mercenary, Albus, Holdem (Albus bodyguard) and Thirteen (now a good guy) do that thing and Zero eliminates magic. Could she do that as well? And to all magic or only the magic  based on Grimoire of Zero?\\n\\n\r\nEnfin, I cannot say what to I think about his... I try to love the world but it felt short. It was badly written with some plot holes I cannot forgive. \\n\\n\r\nWill there be a second season? I doubt it. There is room for that but I don't think it will get it. \\n\\n\r\nBtw, in the beginning I had put a rating of 7 but as I watch the last three episodes I got so disappointed.\\n",
            "date": "2017-06-29T04:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 251402,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4740367.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Paulo_Goncalves",
                "username": "Paulo_Goncalves"
            },
            "url": "https://myanimelist.net/reviews.php?id=251402"
        },
        {
            "content": "This is a quick review of the whole series and should be spoiler free.\r\nUpon finishing this anime I felt underwhelmed I had been watching this anime every week for 12 weeks when each episode was released and have felt a significant slump in it's quality.\r\nThe first three or so episodes were great, an interesting premise was established, there was some surprisingly good humour and the characters felt somewhat unique. However these 3 episodes of quality were ruined by a few things.\r\n1) The lack of anymore character development.\r\n2) A somewhat predictable plot. (Some \"twists\" were so obvious I became unsure if it was even supposed tobe a plot twist).\\n\r\n3) A plot that feels flawed. (Time continuity issues)\\n\r\n4) Stupid, cringe worthy dialogue. (Especially towards the end between the 2 \"beast fallen\" with the manure thing.)\\n\r\n5) Characters acting idiotically\\n\\n\r\nUltimately I just feel disappointed as I felt that this anime had a lot of potential that it failed to deliver. Despite all this however the anime itself was very watchable, so if you have nothing better to watch and you feel like a quick brainless anime to plough through, this is it.\\n\\n\\n",
            "date": "2017-06-27T12:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 251234,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jab1907",
                "username": "jab1907"
            },
            "url": "https://myanimelist.net/reviews.php?id=251234"
        },
        {
            "content": "Zero kara Hajimeru Mahou no Sho felt like a show that was going somewhere with it's uniquely different main characters of Zero voiced by Yumiri Hanamori and Mercenary voiced by Tsuyoshi Koyama as well as it's themes of \"fantastic racism\" permeating through it's characters...however somewhere down the line it just was forgotten.\r\nZero kara Hajimeru Mahou no Sho was something of an early dark horse of the Spring 2017, with it having the aforementioned unique main characters of Mercenary who is a beastfallen (as in half-human, half-animal..in this case a white tiger) at birth and hates witches because witches created beastfallen and society's stigma towards beastfallenis extremely apparent and Zero, a recluse witch in which Mercenary stumbles upon to begin their journey to find the titular \"Grimoire of Zero\". The opening premise in itself as well as it's main duo was what grabbed LA's attention for the anime and even then Zero and Mercenary's relationship (not-so romantic more like master and bodyguard) does develop ALOT in this anime be it through their trials and tribulations in their journey or their relationship being hindered by third parties. The other characters that have focus are Holdem voiced by Masayuki Katou who has beef with Mercenary and Albus voiced by You Taichi (a female seiyuu...HMMMMMMMMMMMMMMMMMMMMM) who tags along with Mercenary and Zero who too wants to find the Grimoire of Zero. If anything the more interesting of the two is Holdem from his evolution from jerk who won't leave Mercenary alone to a quite noble person by the end of it, Albus on the other hand does become an important piece in the plot but quite early on, he's nothing but an annoyance in Zero and Mercenary's travels. Zero kara Hajimeru Mahou no Sho also has the added benefit of giving us world-building from all the subjects of fantastic racism as well as how the magic works given us through Zero and you know that LA loves when an anime does go into it's lore and how some spells work...however like it's edge on it's racism issues, the lore of magics in Zero kara Hajimeru Mahou no Sho also gets forgotten over time.\\n\\n\r\nSo as much as LA is praising (kinda?) Zero kara Hajimeru Mahou no Sho, there are some obvious flaws LA purposely left out and some becomes vastly apparent. For one, you'd think the anime would take a more action-orientated approach however for the first half it's more mystery and slice of life of all things that mixes in into this anime and to it's defence, the slice of life elements helps grow Zero and Mercenary (as well as Albus) both individually and their master and bodyguard relationship and explores a bit of world-building here and there, but aside from a few key points within those times...it just \"almost\" feels like filler until the major arc kicks it into high gear. Next is the more apparent one of plot holes and some plot twist within Zero kara Hajimeru Mahou no Sho not making sense in a ways (this revolves around Albus for one and our boring major villain) to the point it feels like the anime is making it up on the spot and covering it's tracks just for surprise value. Lastly is our boring major villain 13 voiced by Takehito Koyasu who is pretty much at the centre of the problems in this anime. From his quite confusing motivations (especially towards Zero) to his grand plan being utterly foiled by Zero by the end of it in a such an anti-climactic way, on that note, because of Zero's importance, she is essentially an extremely OP main character facading as a weak witch. 13 is probably the reason also for shifting focus from it's fantastic racism (from both fronts of the witches and beastfallen) to the more typical good vs. bad routine we've seen time and again and again LA will mention that 13's \"defeat\" is anticlimactic to say the least.\\n\\n\r\nIn terms of animation by White Fox, the animation is quite decent all things considered with some animation derps or dips in quality (though rare or blink before you miss it type), LA did like the character designs but was more favourable to Zero's attire by her end costume of the anime. The backgrounding was typical fair for a fantasy anime, but overall decent enough animation but not much praiseworthy.\\n\\n\r\nHowever in the voice acting department, LA will honestly say that LA was NOT expecting Yumiri Hanamori to sound like she did as Zero, for those who don't know, LA first noticed Yumiri Hanamori as the ditzy moe main lead Tsumujikaze Koyori from Shakunetsu no Takkyuu Musume to another ditzy moe main lead An Hanakoizumi from Anne Happy to have vocals like this as Zero!, seriously LA was surprised it was Yumiri Hanamori. To that the minor voice cast (however minimal) was decent but quite obviously...Yumiri Hanamori was a definite highlight in terms of voice acting in Zero kara Hajimeru Mahou no Sho.\\n\\n\r\nZero kara Hajimeru Mahou no Sho is one of those shows where yes it does have some major flaws at hand especially concerning it's tone and plot but does outweighing it's strengths of character interactions, unique main characters and it's edge on it's take on fantastic racism balance things out?.......for LA. No, ok trust LA this is an \"ok\" anime but it's flaws just outweigh strengths for LA to say it's a show to invest in, if only the first quarter. Zero kara Hajimeru Mahou no Sho is ok, but collapsed in on itself when it was trying to get serious and anticlimaxes and plot holes arose as a result. Zero kara Hajimeru Mahou no Sho is the dark horse of the Spring 2017 that pretty much fell and tripped even by it's halfway point and it pains LA to even say that...",
            "date": "2017-06-27T15:46:00+00:00",
            "helpful_count": 0,
            "mal_id": 251252,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=251252"
        }
    ]
]