[
    [
        {
            "content": "Peer pressure often prevents us from being the person we want to be. The teenage years entail a necessity for conformity and a fear of change. Physical appearance, grades, money and social status are used to determine someone's value in society. Or so it seems.\r\nFor Onoda Sakamichi, he finds his place by pedalling and pedalling forward.\r\nYowamushi Pedal is a story of a weak-willed, unattractive and friendless otaku finding joy in life through the sweat of sport. Nobody, including himself, thinks him capable of more than shopping for manga and singing embarrassing anime songs. He rides his cheap bicycle from school to Akihabara once a weekand the dismal cycle begins anew. But through a series of fortunate coincidences he finds untapped talent and a place in his school's cycling club. \\n\\n\r\nUnlike most protagonists in sports anime, Onoda is not a hot-blooded maniac with a craving for victory. He is timid, weak-- but earnest. He pedals on not out of proud, but because his aching muscles and the wind beating against him makes him feel alive. In a race he does not need to worry that he is shy or awkward; all that matters is that he pedal forward and dominate the asphalt. While Onoda may not be likeable in the traditional sense (his timidness can occasionally reach the point of frustration), much like Mihashi from \"Big Windup\", you can't help but root for the poor guy.\\n\\n\r\nThe other members of Souhoku's cycling club are fairly exciting, though most of them are nothing you haven't already seen before in a sports anime. There's Onoda's rival, Imaizumi, but the rivalry seemingly vanishes into thin air as the Interhigh tournament approaches. Naruko represents the life and energy of the club, while the three seniors unsurprisingly serve as mentors to the first-years. The most interesting of all the characters (sans Onoda) is Makishima. His long, green hair, lanky body, molester-like smile and spider-like cycling manoeuvre has him come across as a creepy little bastard, but gradually he develops and adds a distinct personality to the show. Souhoku will certainly feel the loss once he graduates. \\n\\n\r\nThe rival cyclists are, well... they have quite a personality. One of them is a muscle freak who names his pecks (Andy & Frank, in case you were curious) and regularly screams \"Abs!\" while riding with his jersey unzipped, exposing his bulging, twitching muscles. Yes. Yowamushi Pedal is a very strange show.\\n\\n\r\nOthers are more conservative in their personality, with the unbeatable Hakone High serving as the second main cast of characters. Their rivalry with Souhoku feels genuine as a result of a number of flashbacks, and these scenes fortunately are handled gracefully, only ever shown when pertinent to the story. The individual members of Hakone High are all fleshed-out, too. Even Muscle Dude.\\n\\n\r\nThe one blemish in an otherwise fun cast of characters is Midousuji of Kyoto Fushimi. He takes ridiculous to a level that I don't believe I have seen before in a sports anime. He does not stop at simply being the arrogant antagonist; he is a goddamn animal masquerading as human. He slurps with his long, lizard-like tongue, bends his body in positions impossible for the human body, loudly grinds his skeleton-like teeth in front of his opponents, strangles his team-mates and leaves death shrieks like a complete lunatic. Okay, I understand that the show wanted to create conflict by having a villain that the entire audience can despise and root against, but he did not need to be exaggerated to such an extent. His character simply creates a pervasive, ceaseless sense of imbalance within the show. And he does not ever stop frustrating the viewer. By the power of God, Jesus, Allah, those Hindu deities that I can't remember the name of, my mom and every other person in the history of mankind, won't somebody please please please beat the fool senseless? \\n\\n\r\nMidosuji aside, Yowamushi Pedal does an excellent job of being accessible to those who have no prior experience or interest in the sport of cycling. Basic terminology is concisely conveyed to the viewer without being condescending, and it focuses more on the abilities of the cyclists rather than the intricacies of some obscure technique they are using. It does occasionally stray from realism during the Interhigh tournament, though. Every main character seems to have some sort of superpower. And you have to wonder how the characters don't lose their breath from talking so much while cycling.\\n\\n\r\nYowamushi Pedal is a visual feast. It is easily one of the best-looking sports anime produced to date. In the thirty-eight episodes produced thus far, there has not been one where the animation quality has dipped to any noticeable extent. The amount of CG used is thankfully minimal (usually limited to the scenery and the legs of the cyclists), though to be fair, it does skip many of the expensive shots by focusing more on the faces of the cyclists, with said faces given extra prominence by the blurring of the backgrounds. However, the best part of the visuals is the most basic: colour. Too many shows forget the importance of colour. Grey and brown is not fun for the eyeballs. \\n\\n\r\nThe musical score is great, but the real beauty is in how well-timed it is. All the tracks start and end at the perfect moment; a final dash towards the finish line being accompanied by a hot-blooded orchestral piece with guitars riffing in the background, or a tense 'eleventh hour' piece playing as the characters run out of strength and fall behind. One of the best moments in the entire show occurs in the thirty-first episode, with Onoda motivating his teammate by forcing him to sing along to a cheesy anime song (the way he's always encouraged himself), it later switching into a guitar solo of the song before finally crescendoing into the show's main background piece. Even if there's no particular stand-out track, the excellent usage of these tracks makes every episode a joy to watch. It's also pretty damn motivational, to boot. \\n\\n\r\nHowever, it should be noted that the first season (should they even be considered separate seasons?) does not have a conclusion. It ends in the middle of the Interhigh tournament during one of its climaxes, the final sprint of the second day with no 'to be continued' to assuage the viewer. Watching the second season is an absolute necessity, so you will have to prepare yourself for a fairly long ride.  \\n\\n\r\nYowamushi Pedal is first and foremost an inspirational story of the weak surpassing the odds and triumphing over the strong. It will not leave you with something you haven't already seen before, and while it is most certainly not deep or philosophical, it excels at doing what matters most: leaving a smile on the viewer's face.",
            "date": "2014-08-12T02:04:00+00:00",
            "helpful_count": 285,
            "mal_id": 156279,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=156279"
        },
        {
            "content": "Hobbies. Everyone has them whether when you were just a kid, during high school, or as an adolescent. But everyone’s hobbies vary. Hobbies pique interest and interest can lead into an obsession. For Sakamichi Onoda, his hobby is watching anime to the point of obsession. You remember that one time when you forgot to record your favorite show that airs late at night? Well for Sakamichi, that could be a catastrophe. But little does Sakamichi know that his hobby will lead him to an encounter with destiny. That encounter leads him to ride the winds and steer the Yowamushi Pedal.\r\nA tour with Yowamushi Pedal willquickly reveal the essence of this show surrounding the sport of cycling. It’s not just the promotional picture but rather the way the characters are designed. Besides Sakamichi, almost every supporting and major character has a degree of athletic form. It’s their passion, their desire, and love for bicycles that drives them to become the best in the world of cycling. But for Sakamichi, he is still riding a mamachari, or better known as the “mommy bike”. It doesn’t take a genius to figure out that he’s a beginner. Yet, there’s something that makes Sakamichi draw attention with his wit. And by that means, I mean potential. That potential leads him to join the Souhoku High Bicycle Club, the core group of the series starring individuals of all angles.\\n\\n\r\nThe show builds paths for our characters to take. For Sakamichi, his journey to stardom begins with his meeting with Shōkichi Naruko at Akihabara. The encounter isn’t anything mind crushing but strikes a bit of curiosity. After all, the two seems nothing alike based on their personalities and appearances. Naruko, the boy with red hair, has a fiery passion with a competitive nature in sports. Sakamichi is the boy with otaku passion with an obsessive nature in anime. Get the picture now? Nonetheless, the episode detailing their meeting highlights a potential for Sakamachi. He is able to ride through the winds and break forth his timid nature. In retrospect, Sakamichi creates an impression that some people might of not originally anticipated. While the show does not warp itself with mind games, Yowamushi Pedal does offer plot twists viewers will be surprised by. Sakamichi’s first step to becoming an elite cyclist is one of those surprises.\\n\\n\r\nHowever, the real question remains if Sakamichi can talk the talk, but also walk the walk. Comparing to characters such as Shunsuke Imaizumi, this seems to be overkill. Shunsuke is like the professor of cycling, knowing the nature of the game and presented as logical thinker. His competitiveness and dream has no boundary. In fact, the rivalry between him and Naruko is quite intimidating like tiger vs. dragon. Drawing from rivalries usually brings out the best of a character. In this series, it does that easily with the way characters compete whether it’d be friendly competitions or a battle of pride. At the paramount of the story, Sakamichi also shines with brilliance with how much he improves. For a show like this, character building is important and the focus is adamant to draw interest. The competitive atmosphere brings out that focus with obstacles the characters must overcome both physically and mentally. These obstacles ranges from a simple steep slope to catastrophic bike accidents that can lead to potential death for the characters. This is expanded to supporting characters as well and rivals of the Souhku High Bicycle Club. The success here is that the show embraces characterization on them with clever flashbacks and well-timed scenarios. It clearly makes its point across to show what the character wants and desire to achieve. Characterization becomes an important aspect of this show and I am thoroughly impressed by its aspects.\\n\\n\r\nThere’s also a niche for sports series that doesn’t need to be unique to set itself apart. The catch for this show is that it can transform cycling into a form of art. Characters brings their skills artistically during competitions with their unique styles of skills. These include a variety of signature moves like Naruko’s rocket sprint, Makishima’s spider climb, Midousuji’s leaning style, Tadokoro’s human bullet train, among others. Even Sakamichi develops his own signature move that truly shows how far he comes across. He might not be a prodigy but potential is one word that draws in people’s attention. As a member of Souhoku High Bicycle Club along with some of the main characters, Sakamichi sets himself as a journeyman. His interaction with characters brings out his potential especially during training camp. When he rides up that slope, Sakamachi is building character with his spirit. We’d like to appreciate his development as he takes on challenges that are seemingly impossible. He has to figure out solutions to difficult problems where they are real, not like the ones in the anime world he came to embrace.\\n\\n\r\nIt’s also said that competition often draws out the best of a person. After all, competition has rewards, tests, and strives to make us accomplish and achieve. Despite playing roles of supporting characters, some of them really tests the Souhoku High Bicycle Club. A few of them even have dynamics focused on their characters through clever usage of flashbacks. It ties directly with the story to bring forth development. It’s not just their gimmicks but their nature that will draw out interests for viewers. This interest leads to both friendships and rivalries to bring out the best of the best.\\n\\n\r\nThere are also other ways to look at this show. One is from the realistic angle with the mechanics of cycling. There are fundamentals explained that draws in techniques of cycling from the real world. Brand names are also featured to bring credibility with the competitions. From another angle is the comedy that sometimes will feel unrealistic. Characters such as Izumida will draw attention with his signature phrase “ABS, ABS, ABS” or Akira Midousuji’s nightmarish face. At the same time, some of the feats these cyclists performs can seem superhuman and unreal. There’s a boundary that blurs in between fiction and reality as the competitions gets tougher and heated each episode. And don’t forget the ending after the credit song. There’s a little gimmicky afterwards that offer laughs for nearly everyone.\\n\\n\r\nA philosophy to get used to for sports series is generally development and training. Perhaps this show focuses a bit too much on the latter. The training session can feel repetitive and dragged. In fact, the first half exclusively focuses on this with appealing image but will take patience to get through. Furthermore, Sakamichi isn’t exactly a model to look on firsthand. His blend design and obsessive hobby isn’t something to write home about. The crux of the series focuses on his development but this could come as a mixed bags for viewers. The weaknesses also comes forth with his biking style that doesn’t bring impression at first glance. Furthermore, there’s a lack of this show’s style itself when it comes to competitions. Some bits can be predictable while others will feel like a repetitive cycle. And when it comes to destinations, there are times when you might not like what you see. Season 1 is also noticeable for cliffhangers and the endgame isn’t far from that.\\n\\n\r\nArtwork is attractive on most parts of the series. The backgrounds feels natural with the mountain fields and rural roads. Although the characters doesn’t all look cutting edge, they do have a well-built presence. Each character has a design style that matches their persona whether it’s Naruko’s fiery hair to make his equally intense personality, Makashima’s long green hair, captain Shingo’s trademark sunglasses, or Midousuji’s malevolent expressions. It’s silly to say but Sakamichi is probably the most normal looking main character we see. Luckily, there’s limited fan service. (unless of you count Izumida’s friends nicknamed by him as “Andy” and “Frank”) What you get is characters that looks real, competitive fields that look consistently natural, and a respect for the nature of the game.\\n\\n\r\nWith an intense sport such as cycling, you’d expect soundtrack as a major backbone for support. The hype is real and the soundtrack does not disappoint with its well-coordinated orchestra. The OST is a strength that is fierce, adamant, and vigorous to the core. Incoming climatic scenes are set up well with thanks to the OST. Along with pacing, we get what fans deserve – high caliber races of integrity and well-timed music. The OP and ED songs also demonstrate degrees of such integrity. Character voicing is also respectable with their voice mannerisms that matches their personalities.  There’s also a silly gimmick with the infamous “Hime Song” that will knock your socks off. If you’re not ready for each episode, the soundtrack will get you fired up.\\n\\n\r\nIt’s admirable that such an exercising hobby such as cycling can be turned into such a competitive sport. For Sakamichi, he never thought of going from a mommy bike to riding the glorious winds of a national competition. Just note that season 1 serves more as a built-up (for the first half) and execution with the remaining course. The ultimate conclusion isn’t exactly what should be designated as a suitable ending. Still, the experience you gain out of this show will also feel like a journey after you watch the rivalries, the characters’ creativeness, and a story about so much more than just riding a bike to burn calories.\\n",
            "date": "2014-09-07T23:24:00+00:00",
            "helpful_count": 45,
            "mal_id": 159591,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159591"
        },
        {
            "content": "Yowamushi Pedal is not a good show. It's a standard, predictable shounen sports series that does nothing memorable or exciting. Every conflict in the story is caused by not having enough pride in your team, and every conflict is resolved by having more pride in your team. The characters all fit neatly into their pre-determined stereotypes, and nothing really changes between the start of the show and the last end card. But this show does excel in one area, and that is copious amounts of balls-to-the-wall MANSERVICE.\r\nNow, I don't claim to be an expert on the admiration of the male physique. I like my ladiesmore than I like my guys, which is why I lean towards shows like Highschool DxD more than Free. But I started this show with no idea what I was getting myself into, and for the first, oh, 10 episodes it was a so-so show about bicycles. Then it started happening. The outfits got tighter, the shorts got shorter, and the amount of screen real estate taken up by sweaty butts increased dramatically. I was bewildered by this sudden turn. “Truly,” thought I, “these camera angles are those reserved for fanservice shots, but there is nary a panty to be seen!” It wasn't until 2 episodes before the show ended that I finally had a complete conception of what I was seeing. It was a shot of two cyclists crossing the finish line, one positioned triumphantly behind the other with his arms held to the sky, hips thrust proudly into the rear of the one in front. The loser was wide-eyed at this sudden shock, overcome with the realization that the winner had completely taken him by surprise. It was then that I knew just how far from home I had come.\\n\\n\r\nYowamushi Pedal is a show built entirely on a foundation of manliness. You're apt to see so many sweaty, panting men with their firm butts thrust high in the air, grasping at each other and fighting for dominance, that you'll never want for another slash fic again. There is a veritable smorgasbord of masculinity on display for any tastes you might have. Do you fancy the stoic leader type? Take your pick from any of the team leaders. Do you prefer a foul-mouthed lone wolf who secretly cares deeply for his friends? You got it. Want a tall, awkward guy with a big heart? Well, you're getting one anyway.  The dogged nice guy with a dark and troubled past even makes an appearance. Like your guys with a more bishounen appeal? Here's a fun activity: count all the female cyclists you see on the character page. Done? Those are all guys. Do you love big beefy bros? There's not one, but TWO massive mountains of man-meat here, one of which even names his muscles for easy reference in fan fics. “Oh Arakita-san, please rub lotion on my Andy...” Like long, spindly guys with no bones and a sociopathic hatred of humans? You may want to talk to someone about that, but in the meantime, enjoy Yowamushi Pedal! No matter your preference, this show's got you covered.\\n\\n\r\nShould you watch Yowamushi Pedal? If you've read this far, you should already know the answer to that. If you like men's butts and you cannot lie, pick this one up and tough out the first two arcs. You will be richly rewarded. If you just want to watch a by-the-numbers shounen then by all means, pick this up as well. But if you're not in the mood for manservice and you don't want to see something that insults your intelligence, then give Yowamushi Pedal a pass. Now if you'll excuse me, I have to go marathon Seikon no Qwaser to reaffirm my sexuality.",
            "date": "2014-07-06T13:23:00+00:00",
            "helpful_count": 44,
            "mal_id": 150719,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1283401.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Solid_Cow",
                "username": "Solid_Cow"
            },
            "url": "https://myanimelist.net/reviews.php?id=150719"
        },
        {
            "content": "At one point or another, one faces a metaphorical wall, and no matter how much effort one puts into breaking it, it is futile. What does one do, then? Give up? Wait? Have the willpower to try again and again?\r\nThis, essentially, is what Yowamushi Pedal is about.\r\nYowamushi Pedal, Weak Pedals in English and Yowapeda for short, follows Onoda Sakamichi and his journey to have fun with friends he never had, as well as his struggles in the world of road racing he gets dragged into. It’s, of course, not a unique concept by any means – after all, many sports shows follow the scheme ofa rookie exploring the sport in question. But instead of giving the viewer what they want – Onoda, and the bicycle team he’s in – Sohoku – to be at the top after hard work, Yowamushi Pedal rather makes the members suffer through one obstacle to the other.\\n\\n\r\nBut let’s start from the beginning.\\n\\n\r\nOnoda’s biggest wish when entering high school is to join the anime club and to gain some friends with similar interests, since he was mostly alone in middle school. But this is going to change in high school, he tells himself, and it does indeed, as he doesn’t join the anime club as intended, but the bicycle club instead, after meeting the tall, serious Imaizumi and the flashy, short Naruko, to test his own potential. And Onoda does show lots of potential, especially at climbing hills (true to his name, which means “hill” in Japanese), and at catching up to opponents, eventually determined to help the Sohoku bicycle club in any way possible to gain overall victory. \\n\\n\r\nWhile the story per se is not particularly good – especially paired with pacing problems in the second half of the show, unnecessary time extensions as well as the ending – its themes are very heartwarming and realistic. For one can’t say that they can’t identify with the theme of failing, and the constant struggle of overcoming obstacles, and Yowapeda has it in all facets and angles. Every character looks for ways to overcome their struggles, and for ways to motivate themselves. And in the middle of all that, there are comedical slice-of-life moments that strengthen the interactions between the characters after every ending song. The world of road racing is explained well, as the viewer has just as much of an idea of it as Onoda does, bit by bit so that it doesn’t come off as a boring info-dump, especially with every piece of information almost directly demonstrated in the scene.\\n\\n\r\nThe cast is certainly an odd mix. It never really fits any archetype, though it is close to, but that doesn’t exactly mean they’re very unique, either. Onoda fits in the otaku archetype, but is more presented as a timid, shy person who tries to give his best. Imaizumi fits in the serious, arrogant boy archetype, but there are moments where he is simply very awkward, and the list continues. The Sohoku team, save the green-haired third-year Makishima, who is an “irregularity” as he refers to himself and grows to be a distinct personality in the team, is very conventional with nothing new. But Makishima is by far not the only one who develops over the course of 38 episodes; the previously mentioned Imaizumi and third-year Kinjou are some examples as well. Of course, Yowapeda doesn’t only focus on Sohoku only (even though the first half does invest on the team); the rival team and champions Hakone is worth mentioning as well. They’re a lot odder than Sohoku – there’s the aggressive Arakita, the eccentric Toudou, laid-back Shinkai, muscle-freak Izumida and Onoda’s rival Manami. And despite being such an odd bunch, they get their flashbacks and development as well, even their stone-faced captain Fukutomi. The rivalry between Sohoku and Hakone feels real, too. Last but not least, there’s the antagonist Midousuji with his team Kyoto Fushimi. He’s the oddest of the cast, disturbingly so, and most of the time Kyoto Fushimi serves as a shock factor to Sohoku and Hakone. While not everyone’s past is revealed and not everyone is developed, a lot of them are, and they help making the characters seem very human with their faults and motivations. Indeed, the characters are Yowamushi Pedal’s strongest point.\\n\\n\r\nThe animation is average, sometimes even cringeworthy, but at least consistent. The CGI is not very annoying nor very remarkable. As for the sound, it certainly never feels out of place, always suiting the current mood. The problem is though that it is very repetitive, as certain tracks for racing or dramatic moments are used over and over again. The opening and ending themes deserve a special mention as well – almost all of the song fit the mood to the corresponding arc, the best of them being the second opening (Dirty Old Men’s “Yowamushi na Honoo”) and the best ending the third, “Glory Road”, sung by the voice actors of the Hakone members. Speaking of voice acting, it is certainly well-done. Many of them are B-list voice actors, and still pulled off the character they’re voicing without effort, especially the performances for Onoda and Toudou.\\n\\n\r\nSo in conclusion, Yowamushi Pedal is not the most unique, but a very touching tale about friendship and overcoming obstacles. Even though it has pacing issues at times as well as a non-existent end, it makes up for it with loveable characters and intense matches, as well as the great opening and ending themes. It does not rely on “pseudo-homo” moments, nor on magically winning because it’s the main character, but rather on the strength of willpower and how actually motivating friendship is. Should you watch Yowamushi Pedal? Yes.\\n",
            "date": "2014-10-02T06:59:00+00:00",
            "helpful_count": 34,
            "mal_id": 163273,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3190265.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elleyonce",
                "username": "elleyonce"
            },
            "url": "https://myanimelist.net/reviews.php?id=163273"
        },
        {
            "content": "This review has grown big enough, so I'll cut the chase and let you jump right into it:\r\n -Story-\r\n 7/10\r\n I'll go right ahead and say that I'm not usually \"into\" sports manga and/or anime, mainly because I'm not into sports in general. Thus, I can't really say how clichéd or not clichéd the story is compared to other titles in the genre. I do know a few things about shōnen though, and seriously - this is so shōnen.\r\n A lot of determined faces, seemingly impossible odds, close failures that get solved in the nick of time by the power of some good ol' JapaneseSpirit(TM), speeches about friendship and teamwork, and homo-eroticism. My god, is there a lot of that last one (this is excellent fujoshi-bait, so keep that in mind fellas).\\n\r\n Anyway; yeah, as far as shōnen goes, this story probably has seen the light of day more times than can be counted. And honestly? I don't mind.\\n\r\n The characters tries, works hard, support each other, fails and then tries some more. The competitions are exciting, the friendships are touching and the funny moments are genuinely funny.\\n\r\n Have we seen it before? Yes, definitely. Does it matter? No, I don't think so.\\n\r\n (It's also nice to be able to truthfully say that I actually learn something new when watching it; Watanabe, the mangaka, is a cyclist himself and all the facts and techniques that show up are real, if sometimes exaggerated.)\\n\\n\r\n -Art & Animation-\\n\r\n 8/10\\n\r\n Nothing really special. There are shots that linger a teensy bit too long, many close-ups of the eyes, looped footage, CGI in a few places (though it's not as jarring as you might think; I for the most part didn't think about it) and probably some other tricks to make the animation seem not-as-cheap-as-it-most-likely-is. At the same time, the art still looks nice. The art in the manga is at best stylistic and at worst sloppy, but the anime makes a good job of cleaning it up and giving the character designs a little bit more consistency. The result is polished, if slightly generic.\\n\r\n (I'm also happy to tell that there's a considerable lack of side-mouths or \"fish-faces\", which is always a welcomed virtue.)\\n\\n\r\n -Sound-\\n\r\n 9/10\\n\r\n Absolutely lovely. If the music wants to get you pumped, you'll get pumped. If it wants to break your heart, reach for the tissues. If it wants to make your heart grow three sizes and fill it with fluff, don't fight it - embrace it. It will get you, sooner or later. All of the opening and endings fit very well with the concept and are pretty damn good songs on their own to boot.\\n\r\n The voice acting is equally satisfying; among the cast there are some known and some less known, but all of them are doing a great job and every voice fits their character superbly.\\n\\n\r\n -Character-\\n\r\n 10/10\\n\r\n The trump card of the show. These characters are WONDERFUL and I love every single one of them. Each and every one have their own special blend of talent and eccentricity that makes them stand out and be charming both by themselves and when paired with another character. Perfect since much of the humour comes from the guys' personalities playing off each other. Like probably many other sports anime and practically every shōnen anime there are rivalries in abundance, but so far only one of them is actually malicious, which is a nice change of pace. It's safe to say that the characters alone are reason enough to check YowaPeda out.\\n\\n\r\n -Enjoyment-\\n\r\n 10/10\\n\r\n If you haven't realised it already, I enjoy this show immensely, both in a written and animated format. It's fun, exciting and at times incredibly sweet. I was amazed at how something as simple as racing up a hill could pull me into the action and struggles of the characters. Sports anime and manga might not have been my thing before and, hell, maybe it still isn't, but after watching Yowamushi Pedal I'm at least willing to give the genre a try.\\n\\n\r\n Overall, a 9/10 - lowered only because of the art and story which we've unquestionably seen before. Still, I cannot stress enough how worthy this show is of your time and attention.\\n\r\n And about the fujoshi-thing I said before? It's actually not that bad, so please - don't let it be a deterrent (just stay away from certain forums and art sites and you should be fine).",
            "date": "2014-07-08T19:58:00+00:00",
            "helpful_count": 26,
            "mal_id": 151125,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1164545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TooBadForU",
                "username": "TooBadForU"
            },
            "url": "https://myanimelist.net/reviews.php?id=151125"
        },
        {
            "content": "\"Sometimes, things that you dont consider as a good thing for you is probably the most good things for you\"\r\nThats what i learned from Yowamushi Pedal.\r\nYowamushi Pedal is an anime that i pick randomly just because some people talking about it, honestly i dont have any expectation for this anime and i am not even a fan of cycling. For me, cycling is just a boring sport you just have to pedal your bicycle as fast as you can and thats it. But seems my arrogance must be paid, this anime gives you a new perspective about cycling and makes you think cycling is notalways ride a bike but also the fun behind ride it.\\n\\n\r\nThe story will begin about Onoda Sakamichi, an otaku who loves to go to Akiba using his mama bikes once a week. When he entered into Sohoku high school, he already planned to join anime club but unfortunately anime club is already disbanded and need new members to revive the club. While he tried to find a new member, he realize his talents in cycling especially in climbing which he got from his journey to Akiba each week. Then, he ended up to join Sohoku cycling club.\\n\\n\r\nWhat makes Yowamushi Pedal interesting is the way how the bring the story.  As we know, cycling is not really popular and even boring sport for some people –me, especially- they bring out the tension and drawing out some “action” scenes. Basically, Yowamushi Pedal  is a modern sports konjo (meaning sports and will-power). They providing us each of the character’s thoughts carefully while taking careful time to illustrate the action and the reason behind each characters the action.\\n\\n\r\nNot just that, Yowamushi Pedal explains perfectly all things about cycling. Like how i said before this anime give you a new perspective about cycling and they really did it. I always thought cycling race (like tour de france) is simple, you just need ride the bike and quickly reach the finish line but i was wrong. It is more complicated. Like did you know there is two type road bicycle racer, climber or sprinter? Or did you know the pack leader is the most exhausting parts because they must drafting the pack?\\n\\n\r\nAs i said before, sports konjo is focussing on will-power. Its pretty much genre that quite essentially from japanese and easily reflects an important mentality within the culture: no matter how tough it gets, it’s possible to improve by the power of will and this what makes Yowamushi interesting. Our main character, Onoda is not a talented person in cycling but his will what makes him through all the obstacles and we, as viewer cant be helped to not to root for him.\\n\\n\r\nYowamushi Pedal is surely quite eyecandy for a people who looking for visual quality. It surely have the best art in sport anime. They mixed well between 2D animation and 3D animation especially when every riding scenes, they use 3D animation from the legs to the bottom  while  in the face they using 2D in face section. I must say the art is really superb and almost flawless. Not just that, the background is also looks vivid and colorful, its surely visual feast for the viewers.\\n\\n\r\nThe music is also pleasant to hear. All the opening song which are rock songs is really suitable with the themes, which is sport and determination. The one thing i really memorize is from Dirty Old Men, Yowamushi na Honoo (弱虫な炎) is really a catchy rock song, the fast beat drum and catchy tune makes this anime looks epic. The BGM or soundtrack is also amazing, they really hyped the atmosphere like when the racer nearly reach the finish line, the BGM that they use is an orchestra music which makes the atmosphere looks glorius and epic.\\n\\n\r\nWhat makes Yowamushi interesting to watch is the characters. Almost all the characters in this anime have unique side and personality. You can easily knowing them by the differences, like Naruko , which he is hot blooded character or Izumida, the rival cyclist who is always flaunting his chiseled abs. Its important to make the characters prominent to others because by doing it you can easily remembering them and make them is not like a forgettable 2D character and become a wasted character.\\n\\n\r\nFinally, after all the things i have said, i can surely saying this “this is a great anime that i would recommend to you guys”. This is one of good sports anime, because it can turn the topic of a sport you’ve never had interest into entertainment, and Yowamushi Pedal is just like that",
            "date": "2014-12-18T06:29:00+00:00",
            "helpful_count": 24,
            "mal_id": 172825,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=172825"
        },
        {
            "content": "Oh gosh, the things to say about this show.\r\nI really, really loved this show. When I first found out about it, I was a bit confused because: Bikes? Why? \r\nBut then I fell in love with every single character in the series and it was one hell of a ride.\r\nThe story is simple and easy to follow. Looking at the story dryly, it may seem a bit boring, but it really isn't. It's the characters and their amazing development that make this series awesome.\r\nThis cast is hugely diverse in looks and personality. You've got chubby characters, extremely thin characters, muscly characters, tall characters, short characters,characters with birthmarks, and each character's face looks different and unique. Oh, I just love this cast! Their diversity makes them seem so real and loveable, not to mention they all have their strengths and weaknesses, each and every character's backstory being touched on, making you love these characters more. Each character had something they were carrying, some initiative to win and fight and carry on. These characters had their own demons to fight, a character with PTSD that overcame his stress, characters that suffered loss (races, and family) and characters that had to gain confidence along the way, like our protagonist, the first year Onoda.\\n\\n\r\nOnoda started off the show with no friends and planned to just simply have an anime club and make friends there. With his unplanned decision to join the bike racing club and in which he finds his love and passion for bikes. There are parts in this series that will warm your heart and make you tear up a little, and parts that will make you mad and keep you at the edge of your seats. It made you want to get up and cheer on for these characters like you were watching a real live race. At points, you will think you know who will win, and then there are points where your mind changes and this is an even bigger reason why this show will keep you at the edge of your chairs in suspense!\\n\\n\r\nThe animation and sound were both very good, I enjoyed the openings especially. I definitely did not focus on those factors much while watching the show, but Ii did enjoy the animation and how bright and colorful everything was.\\n\\n\r\nOverall, I highly recommend this anime for those who want a story of friendship, hardship, challenge, and most importantly bikes. I was most definitely not expecting such a heartwarming and passionate story like this to be about bikes, but it was and I wouldn't have it any other way. This series was great, and for more be sure to read the manga!",
            "date": "2014-07-23T12:47:00+00:00",
            "helpful_count": 17,
            "mal_id": 153395,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/freemums",
                "username": "freemums"
            },
            "url": "https://myanimelist.net/reviews.php?id=153395"
        },
        {
            "content": "This review only applies for the first 10 episodes of the series, it does not constitute for the overall experience of the anime itself and it will be comprised of what I liked/disliked about the anime and the reason I have had dropped it for.\r\nMy reasoning for dropping Yowamushi Pedal is fairly simple. It has no element that is unique to itself and presents only themes that have presented in a lot of other sports anime. As a result of such, you have an underdog that finds friendship and determination by getting entranced in a sport, cherishing the friendships he made along the way, beingentranced in the competitive nature of the sport. He doesn't look impressive to the average person, but unlike them, he has a lot of determination, despite doubting his capability, but he has x trait that really shows off how talented they are. Follow the adventures of 和名 as he finds friends and proves his worth.\\n\\n\\n\r\nThis is the exact setting. The sport is cycling. The protagonist is an otaku with no friends that kept riding to Akihabara which was 90 kilometers away and was sad because he has no friends, literally. He wished to get friends and noticed he actually had potential in something, so he started developing a passion for the said something. The sport itself isn't particularly interesting, not because cycling itself can't be entertaining, but because it can't be written in a way in which you can measure the skill of the participants, so every time it just showcases the characters constantly reiterating the fact that they're determined, and then they speed up. It does explain cycling techniques and how to cycle more efficiently, but watching a battle of endurance/determination is just not something I consider fun, when there isn't really anything else to it other than that. It's just like lighting up a couple of candles and watching which one melts the fastest. Can't contain that excitement. At the very least, the candles can't say cringy things such as \"He's one with the bike.\" \"He won because his feelings WERE THE STRONGEST!!!\" \"I'm only good at talking... with my pedals.\" and there's plenty more that I don't remember. \\n\\n\r\nThe characters aren't particularly interesting, and are merely safe archetypes that worked before in the setting. Like the reserved introverted guy, that is really passionate for the sport, or the guy that wants to stand out and be in the spotlight, with the colored hair and the short height, or a goof that wants to brag about how good he is, despite the fact he's mediocre, or a tall guy that is intimidating due to his height and because he is socially awkward, or a guy that learns about the power of friendship. I mean, their entire character can be boiled down in a few single words, like  otaku wants friends, i'm muscular, i'm short but i can pedal and so forth, you don't see any depth. They're just a blend of bare minimum character traits with singular motivations. Frankly I watched for 3 hours and 20 minutes, and this is the impression the characters left on me, and I think that that is more than enough time to display at least one out of the ordinary element in your story or characters. There is no such thing to the point that I got in Yowamushi Pedal.\\n\\n\r\nThere wasn't really anything I particularly enjoyed about Yowamushi Pedal. I appreciated some of the information about cycling, but everything else was not really noteworthy, and this is what I think Yowamushi Pedal is, not noteworthy. It doesn't try to do something inherently unique in any measure and presents a story that was done to death, without altering the formula in any way. It simply banks on the audience reaction of \"cheer for the underdog because they're the underdog.\" There wasn't anything unique about it and I noticed how it went with safe formulas that were used before, as well as its focus on a theme that has been done to death. There isn't really anything about the sport through which you can measure the skill of the participant, and it mostly comes down to determination and endurance, which are all decided by the narrator at his own leasure, which eliminates all of the tension. Yowamushi Pedal tells the story of an underdog's journey of developing friends and getting better at a sport. If that's what you're seeking, this is a good choice for you. But if you want more than a repeat, or have prior knowledge of series of the sort, I would steer clear of this series. But I think a good underdog story is a story where you can understand how the underdog changes in order to overcome the odds. And I just can't see this not going into a direction that is settled by \"I wanted it more/You didn't want it enough.\" Which is a required element at the basis, but one that needs to be largely built on to stand out, and not be constantly said on screen. That is how Yowamushi Pedal failed me.",
            "date": "2017-01-21T13:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 238770,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=238770"
        },
        {
            "content": "This was an enjoyable anime that gives one a great glimpse into cycling and its peculiarities. While giving you information about the sport you also get a pretty common but well build story that is, in its format, quite often used. The main character find a new passion and happens to have a talent because of something he had to do up until now. (This is similar to Initial D and others.)\r\nSo the story isn't a deep masterpiece but fits perfectly for the theme of cycling and allows for exposition.\r\nThe art and sound design are fine and allow for easy watching and support the actionwell.\\n\\n\r\nMy verdict: Nice Anime, solidly build and well made about a topic that is interesting and known to many. If you want an anime thats fun to watch, you don't want a deep story but would like to know more about cycling this is a great anime for you.",
            "date": "2015-03-30T15:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 184137,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/acclrtr",
                "username": "acclrtr"
            },
            "url": "https://myanimelist.net/reviews.php?id=184137"
        },
        {
            "content": "With the announcement of the 3rd season, I decided to check out Yowamushi Pedal and see whether the ride was worth it (pun intended). I wasn't exactly expecting anything special out of it, so I can with a heart full of love say that Yowamushi Pedal is everything I thought it would be before I watched it. In a nutshell, it's just another sports anime...\r\nIf you're a newcomer to either the world of anime or the sports genre, you may get far more out of YP than I did. It has everything that enticed me into this genre at first: over the top animation, plethoraof characters with special abilities, rivalries, etc. It's entertainment in its purest form, and I can't fault it for that alone. In reality, I enjoyed my time with Yowamushi Pedal quite a lot. That is, if I ignore the fact that I've skipped at least 6-7 episodes altogether. \\n\\n\r\nAs for the main reason, I can only blame the story. You won't find a sports anime nowadays with good story - you simply cannot. They rotate the same cliches as if they're playing 'Wheel of Fortune', and you can practically see the entire 1st season from the very 1st episode of the show (okay, maybe 2nd). A guy who can barely, if at all, play a certain sport joins a team which would under no circumstances accept him in real life, but he has that one, unique thing about him that makes others want to teach him. Raise your hand if you've ever heard of  that kind of a story. \\n\\n\r\nThe reason I why I graded the story as such is because it's practically a carbon copy of every popular sports anime out there. Imagine if KnB or DnA were converted into cycling, and you have it. However, whereas KnB, DnA and so on merely have cliche and predictable stories, they at least try to break the mold here and there. YP? Never. Not throughout 62 episodes of the first and second season did I even notice an attempt at something new or different. \\n\\n\r\nHowever, I can't say that's truly a bad thing. The author merely followed the formula of 'if it ain't broke, don't fix it', and decided to just roll with it. Problem arises though if you're someone like me, someone who has seen his fair share of sports anime. Because, starting with episode 1, you gain the ability to see into anime's future. And, as fun and awesome as that sounds, it is not. Same backstories of the minor characters that are neither interesting nor fun, same 'unexpected' twists, same rivalries, same sequences of random power-ups... I can go on listing cliches till sun freezes over, but I think I got my point across. \\n\\n\r\nOne thing, though, I can praise the story for is the pace. At least it doesn't take 70 fucking episodes for the MC do be kind of, sort of, somewhat fucking useful to the team. \\n\\n\r\nAnime even falls behind others in the genre in production values. While sound and music should be applauded, alongside voice actors, I always felt that animation was lacking that 'wow' factor that other shows have. Unlike with others, I cannot remember a single moment, save for perhaps one, as THE moment, where MC does something truly badass. Everything, animation wise, simply felt... average. I mean, I see the effort, and fluidity, at least to a certain degree, is there, but the animation lacks that final punch. At some of the more important moments, I always felt as if the animation, and anime in extension, failed to convey the sense of speed (which is hugely important for this sort of an anime) to the viewer. If you've ever seen some episodes of Major, Eyeshield, Kuruko, hell, even Diamond, you can remember that you felt the sense of massive speed being conveyed by animation. Yowamushi simply fails to deliver that. \\n\\n\r\nWhen it comes to the characters, there isn't really much to say. It's your standard set of sports anime characters, but Onoda reminded me far more of Eyeshield MC rather than most others as he was extremely timid. He's probably the best and the worst character in the entire series, and that 'worstness' boils down to two things:\\n\\n\r\nFirst, he lacks any sort of individuality. For the entire run of the anime, he never did anything out of his own will. He joined the club because he was basically told to. He trained hard because he was told to. He participated in the race because he was asked to. He did his best in the race because he was ordered to. He lacks any sort of a backbone and that's just terrible writing for your main character, especially in sports anime. \\n\\n\r\nSecond, his reactions... I mean, fucking overreactions to ABSOLUTELY EVERYTHING. Each time some of the characters would say something that's mildly outside his comfort zone, or each time something \"\"\"\"ODD\"\"\"\"\" (all the quotation marks intended) would happen, the dude would freak out as if a random chick pulled him off the street and told him she's carrying his kid. I fucking had nightmares feautirng that face of his, and it is present in EVERY SINGLE GODDAMN EPISODE. No, seriously. I strongly believe that if someone had said \"SKY EXISTS\" he'd make the same :OOOOOO face. Brutal. \\n\\n\r\nFor all my ranting, I can honestly say I enjoyed Yowamushi Pedal. That's mainly, though, since i had low expectations to begin with, and I mostly knew what I was getting myself into. It has the similar feeling that all sports anime share - they're rather easy to watch, and even easier to binge watch. Although I did skip most of the 'character development' scenes and backstories of the characters that are there for like 2 episodes, I feel like that actually helped the factor of enjoyment. I sure as hell couldn't have sat through yet another story of a freaking thug being converted over to the sports by the sport junkie or whatever. \\n\\n\r\nOverall, this is... just another sports anime, really. If you enjoy sports genre, go for it, you'll love it. If you're like me, though, and are looking for something that's at least slightly different, then yeah, keep looking mate. This ain't a ride you wanna ride. (omg...)",
            "date": "2016-12-18T07:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 235739,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=235739"
        },
        {
            "content": "This is a SPOILER FREE review. This is my opinion and you dont have to agree!\r\nI just watched Yowamush Pedal and I have very mixed opinions about it. \r\nFor starters people that dont like slowpaced anime or just can`t stick through the whole anime shoudn´t even give this a try beacuse this is one of the most slowpaced anime that I have seen ever.\r\nStory: (7/10) This is an anime about an otaku name Onoda Sakamichi. He is a plain looking guy with glasses the regular guy. In middle school he didn`t have anyone to talk about anime beacuse no one watched it in hisschool  neither did he have friends and no one knew he was into anime. Thats why  road alone to Akiba everyday on his bicycle which was many kilometers away from his house. He was excited for highschool beacuse his plan was to join the anime club and make lots and lots of friends. But it doesn`t go the way he thinks. \\n\\n\r\nThe pacing had alot of problems like :\\n\\n\r\n1. It takes them like 3 or 4 episodes to introduce the main protaganists in the anime.  \\n\\n\r\n2. There are lots and lots of inner dialogs in every episode. \\n\\n\r\n3. Flashbacks... good god there are so flashbacks it drove me crazy. Almost every character that had a role in the anime had atleast 1 flashback. Even if it was a non important character that gets to be in the anime for like 4 episodes he had to have a flashback\\n\\n\r\nThe story is good I didn`t like the pacing it was way too slow and made the anime feel boring but other wise it was nice. The main character is tested both physically and mentaly. The other characters supported Onoda and Onoda supported the others. Honestly I thought that is was a waste that they didnt add little romance in the anime there was this girl that I could see being in love with Onoda and Onoda fall in love with her but they didnt do anything with it so I thought it was a waste of a good looking character just saying. Like there are many wasted things in the anime that I could see being good but they didnt do anything of it which was a little disapointing.\\n\\n\r\nArt:(8/10) The art is good it fits the characters. The art is modern and done well but it isnt anything special that I don`t see in other anime.\\n\\n\r\nSound: (8/10) The sound track was nice i changed from when the characters are fighting (with bicycles) too music when the characters were happy. The opening were okey.\\n\\n\r\nCharacters: (9/10) All of the characters have different personalitys that are very refreshing and keep the anime interesting despite it being slow paced. The characters delvelope during the anime alot at the end you can see the difference.\\n\\n\r\nEnjoyment: (7/10) I didnt really enjoy the whole anime I only felt like I wanted to watch more near the end beacuse it was then it got more exciting. I feel as though it would have been way more exciting if they didn`t have so many flashbacks and inner dialogs.\\n\\n\r\nOverall (8/10) The anime was good and an average anime that managed to keep my interest even if it wasn`t very enjoyable. I would reccomend this anime if you don`t really know what to watch or if you love sports anime.\\n\\n\r\nStuff unrealated to the review : My favourite character in this anime was Midosuji he was one of the reasons why I thought it was worth watching. He's a great character with alot of depth.\\n\\n\\n\\n\\n\\n",
            "date": "2015-08-25T09:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 197018,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515662.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CookieFudge",
                "username": "CookieFudge"
            },
            "url": "https://myanimelist.net/reviews.php?id=197018"
        },
        {
            "content": "High school is sort of that akward time for us all where we try to find out place in the world and try to make friends that have similar interests as us. For some it can be worse trying to accomplish this seemingly impossible feat. The main take away for Yowamushi Pedal is this:\r\nYou can conquer any challenge.\r\nStory 8/10\r\nThe story is about Onoda Sakamichi, a friendless Otaku who goes into high school with the hopes of joining the anime club to finally make friends. His hopes are crushed though when he finds that the club has been cancelled due to a lack of members. Ashe tried to revive the club he runs into Imaizumi and Naruko--first years like him who joined the bycicle racing club, and managed to convince him to do the same despite his fears that he really had no place in the world of sports. Here he meets the third years, who mentor them all to become the strongest, fastest, and best that they can be.\\n\\n\r\nMany can argue that Yowamushi Pedal is just a copy of Over Drive (because the plot is very very similar), but to me Yowapeda brings something a little different to the table, a weak character. Most sports anime/manga have the MC be really good, and kind of know it too. Since Onoda is weak and self concious of himself there is a very realistic feeling to the story--mainly the struggles and determination to become something great. It inspires me, and it makes me more involved with Onoda.\\n\\n\r\nThe anime pretty much follows the anime to a T--which brings up a major flaw--The pacing. The bulk of this anime is taken up by the Inter-High competition. You would think that with 38 episodes you could get through a relatively big chunk of this 3 day race out of the way. Well....sorry to say, but there is a reason why there is a second season. The last episode was left on a major cliff hanger, and for many who watched the series right as it was coming out found themselves to be severly disappointed and upset when the season ended in July and they found out that they had to wait until early October to continue the series.\\n\\n\r\nAnimation 9/10\\n\\n\r\nNow I definitely didn't get into Yowapeda for the art. The manga is rather brash with its art style and the characters often look disfigured when they are riding their bikes (Midosuji is a prime example). So I was really impressed with how well the animators did with cleaning it up. All of the characters are unique, with few characters being drawn to fit a particular stereotype (the three Sohoku first years are about it). My only complaint is that Imaizumi and Arakita are so similar looking that I had trouble distinguishing them in the manga.\\n\\n\r\nThe coloring is bright and colorful as is expected for it being made 2013-2014. However, it is not overly bright with \"sheen bubbles\" or a too exaggerated of a color scheme. It uses a straight forward color scheme to get the job done. The animation itself was pretty solid, which is always important in a sports anime.\\n\\n\r\nSound 9/10\\n\\n\r\nThe sounds was superb. It fit the moments perfectly, and was just enough to where is aided the emotion of the scene without overpowering it. Music has never gotten my heart racing as much as the soundtrack in Yowapeda. The three openings and ending themes were great too, which is unheard of coming from me. Normally due to time constraints I listen to the opening and ending once, unless one or the either was something special. I listened to all six theme songs without skipping them--I even have the soundtracks to listen to them all the time. \\n\\n\\n\r\nCharacter 9/10\\n\\n\r\nWhen you walk into a sports anime you're just basically counting the seconds until you see a major sterotypical character. And while Yowapeda exhumes the natural talent, elite and hot-head archtype with Onoda, Imaizumi and Naruko (respectively) they have their own quirks that really do make them unique. And what makes Yowapeda really shine are the character interactions. All of Sohoku really supports each other and works together to pull the team along (now whether this is efficient or not is neither here nor there).\\n\\n\r\nWhat's even more amazing with the close relationship they have with their rival school--Hakone High. They are supposed to be enemies, and I feel like with most sports anime I've seen, the rivals are just viewed as the bad guys to be defeated. In Yowapeda though the seniors all have a relationship with one another, creating the impression that these guys could in reality be friends--and even SHOW signs of friendship during the race. What's even better is that most of the characters in Hakone get their own little background story, so now not only do these guys have more demension to them, I actually care about them and feel for them!\\n\\n\r\nI love all of the characters in Yowamushi Pedal, they all bring something to the table to make the series enjoyable. Yes, even Midosuji, for as fucking creepy as he is, he brings spice into the competition.Ugh....so creepy\\n\\n\r\nOverall 9.5/10\\n\\n\r\nYowamushi pedal really is a great anime. Onoda is a very relatible character and the underlying theme is inspiring. Yes, the pacing is bad, but you'll soon forget it in the heat of the races, waiting on the edge of your seat to see who wins.\\n\\n\r\nNow if you really dislike sports anime, then I would probably skip over this. Because with the genere they try to take the sport and make it as cool and as awesome as humanely as possible. Other than that you should give it a try.",
            "date": "2014-11-24T09:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 169761,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/753557.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Risan07",
                "username": "Risan07"
            },
            "url": "https://myanimelist.net/reviews.php?id=169761"
        },
        {
            "content": "Personally I was never a fan of sports anime. They just didn't interest me what so ever. Free was okay but it wasn't my favorite, but then I found this masterpiece. Once upon a time I was in my dorm trying to find an anime to watch and i was on a manga fanpage on facebook and they posted a comparison meme of Imaizumi to Haru from Free. I saw in the comments the anime was called yowamushi pedal. I went on google and looked it up and I knew from just the summary I would enjoy this show. I never had so much funwatching an anime since I first got introduced to the genre as a whole. Now on to the technical stuff. \\n\\n\r\nStory: 10/10- The story itself is amazing. A lonely otaku who just wants to make friends and finds them in the most unique way, by riding a bicycle and getting noticed by someone on the racing team. Can I just say my favorite episode will forever be \"you are the princess\" The singing moment never fails to make me laugh hysterically I always go back to that episode when I just need a laugh when I am stressed. Another thing i love about this story is that you find yourself constantly routing for the characters for success. It constantly makes me have a fuzzy happy feeling inside me every time I watch it. \\n\\n\r\nCharacter: 11/10- Like I said, the characters made the show amazing. I constantly fell in love with this show because of the bonds with the characters. I actually kept on watching the show because Naruko and Imaizumi actually reminded me of Gray and Natsu from Fairy Tail constantly and made me laugh even more with the show. If I had to choose a favorite though it would be between Makishima and Toudou because i love their rivalry and comedic bonds with each other xD (SPOILERS AHEAD) \"Makichan don't ignore me!\" \"onada hes not important just ignore everything he tells you\"\\n\\n\\n\r\nArt/Sound: 9/10- the animation and music was good i particularly liked what they do with Midousuji making him so freaking creepy to the point where sometimes I forget I'm watching a sports anime not Horror. THE LOVE HIME SONG ITSELF IS 10/10 lol\\n\\n\r\n Overall: 10/10 - If you like me is curious about sports anime and don't know which one to watch as a start, watch yowamushi pedal. You don't have to be a sports anime fan to watch it. I definitely recommend this wonderful anime.",
            "date": "2016-11-08T11:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 233442,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nylife1022",
                "username": "nylife1022"
            },
            "url": "https://myanimelist.net/reviews.php?id=233442"
        },
        {
            "content": "Let me preface this by saying that not only do I not watch sports anime, I hate sports in general. Nothing interests me less than athletic competition, especially since I find most sports to be horrendously boring (I'm not counting martial arts in the category of 'sports' here, or I'd find very little shonen I'm able to enjoy).\r\nYowaPeda is the exception to the rule, and boy what an exception it is.\r\nI almost don't really think of it as a sports anime, as it makes use of all the shonen tropes we know and love. Red Oni/Blue Oni, Hot Blooded heroes, plucky underdogs, and of course,Nakama Power. \\n\\n\r\nStory: 9\\n\\n\r\nThe series makes great (if frustrating) use of cliffhanger endings to help the story flow together. I was glad that I waited until this portion of the series was over to marathon it, as it flows so well from one episode to the next.\\n\\n\r\nArt: 8\\n\\n\r\nThe CGI is sometimes rather conspicuous, but it gets extra points for making use of shonen power-up sequences while being about racing bikes. \\n\\n\r\nSound: 10\\n\\n\r\nThe battle theme is catchy and gets in your head, and I defy you to watch this and not find yourself humming the theme to 'Love Hime', a fictional anime that the main character loves.\\n\\n\r\nCharacter: 10\\n\\n\r\nOnoda is a great main character, overcoming the odds in the traditional shonen fashion. It also helps that he starts out as an otaku with no interest in sports or bike racing, but has built his stamina up from years of biking 60 kilometers to Akihabara and back on his single-speed 'momma bike'. The villain of the Inter-High is the creepiest SOB you'd ever want to meet, and just begs to be punched in the face. \\n\\n\r\nEnjoyment: 9\\n\\n\r\nLoved this anime from start to finish, and the ending segments are not to be missed.\\n\\n\r\nOverall: 9/10",
            "date": "2014-11-30T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 170515,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=170515"
        },
        {
            "content": "Bicycling anime! Onoda is a nerdy otaku who plans on starting a school anime club until his natural talent for biking is discovered, and then he and his new friends Imaizumi and Naruko bond over a love of bike racing. I love the rivalry/friendship between Imaizumi and Naruko, how they’re determined not to lose to each other and yet are bound together by their mutual interest in taking care of Onoda. What an adorable trio: they work so well together. \r\nOnoda is completely loveable with his glasses and his “mommy bike” and his anime; I burst out laughing every time he sings his princess animetheme song (and the scene with Tadokoro in episode 33...oh my God, that was hysterical).\\n\\n\r\nThere is so much to love about this silly and fun anime: the comically overly-serious characters (“Abs!”), the humor (I really enjoyed the scenes after the credits on each episode), the bright and colorful art, the cute songs, the importance of friendship and teamwork, the strange and weirdly terrifying antagonists (Midousuji). But most of all, to quote the coach, the anime’s charm is how its protagonist represents “the fundamental joy of cycling.”\\n\\n\r\nCan’t wait until season 2 of this anime comes out in October!",
            "date": "2014-06-30T19:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 149699,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=149699"
        },
        {
            "content": "\" Hime Hime Hime, suki suki daisuki Hime Hime, kira kirarin\" -I already love this anime song. \r\n9/10 \r\nThis anime is simply all about getting out of your comfort zone and experiencing the world on what it has to offer. However,  Sakamichi Onoda is awkward , appearance wise is not so good and has no friends. And just because of a habit he continuously does changes him as a character and his life. From a reader's point of view, I already love his genuineness which other characters do as well.\r\nThus I advise everyone who loves generally anime to try this anime out. As thecharacters develop and your there experiencing this whole process...it is truly amazing.Furthermore, the anime interestingly questions you as a person on your habits and interests by getting out of your comfort  zone and taking on challenges and having FUN! \\n\\n\r\n\"It's fun climbing together!\" - Sakamichi Onoda",
            "date": "2014-11-29T02:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 170291,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4273583.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeDevotee",
                "username": "AnimeDevotee"
            },
            "url": "https://myanimelist.net/reviews.php?id=170291"
        },
        {
            "content": "Story: (8/10)\r\nThe storyline is common for a sports anime but it is done better than others. It has more strategy (fewer super-powers, when they do exist they are properly explained and make sense) and better setup than any other sports anime I have seen. \r\nArt: (7/10)\r\nArt can be good at times are better at others, the background can either be breathtaking or decent, the character art looks great and gets better the farther in you go.\r\nSound: (10/10)\r\nWonderful OPs and EDs, you will want to re-listen to all of them. Voice acting is great, really in-character and fits the characters well. \r\nCharacters: (8/10)\r\nSome cliches but thereis real character development and the cliches are thrown away (and not overnight, they actually have reasons for their character development)\\n\\n\r\nEnjoyment: (10/10)\\n\r\nThis show is so fun to watch and isn't hard to keep up with. It has real tense moments, and there isn't just fake tension where the MC just wins no matter what.\\n\\n\r\nOverall: (10/10)\\n\r\nThis is by far the best sports anime I have ever seen and would HIGHLY suggest watching it!!\\n",
            "date": "2017-05-22T09:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 248287,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6003298.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GuyWRunningShirt",
                "username": "GuyWRunningShirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=248287"
        },
        {
            "content": "Oh, the story of the underdog.\r\nOnoda is a total otaku that finds his true calling as a road racer climber. Through his high school bike club, he meets friends and rivals, and begins his journey as a road racer.\r\nI particularly love shounen sports manga because they are so much fun. And there is something to be said about an underdog to comes out on top. You can't help but hope and pray they make it. And yes, part of the enjoyment is finding out how they do it.\r\n2/3 of the first season sets the stage: we find out how Onoda is dragged into this worldand his training as a road racer. We begin to meet rivals and friends and see subtle moments where Onoda's mysterious power as a climber come out. The last 1/3 begins the Interhigh competition and I enjoyed this part the most. We've got interesting characters and rivals, some flashback moments delving into character backgrounds (but personally, I enjoy the racing action more). Also, (and this is the problem with most cowardly underdogs) I got a little annoyed at Onoda sometimes. Grow some more and man up! I do hope that story-wise, Onoda will learn from his mistakes and they wont play the catch up game so much any more. \\n\\n\r\nIn terms of road racing in general, I feel like this anime does a great job of explaining that sport, what each different type of racer does, and how to work as team in a road racing tournament. Not that I knew anything about road racing before. But now I can say I know what a climber does, what a sprinter does, so on and so forth. And I have to say that is something I have come to expect from a good shounen sports manga/anime especially if it's about something I'm unfamiliar with. By the end, I should have learned all the rules and details of the game/sport and enjoyed learning about it.\\n\\n\r\nThe art style and music raises the excitement during race scenes. The art style in particular adds to the action scenes, color, slants, emanating waves of bursts of power. It definitely has an edge over another road racing anime, Overdrive, in this respect. Sometimes though, the action effects might get a little over the top but thankfully, not to the extent that Prince of Tennis does (yes, I love PoT too but come on guys, Cyclone Smash?). The music and voice actors are also well chosen. \\n\\n\r\nMy absolute FAVORITE episode? Episode 33 - \"You Are the Princess\" / \"Hime nano da\" / ヒメなのだ\\n\r\nOh my god. I have not laughed so much in a while. Tadakoricchi's face here. The Hime song. Everything put together had me laughing hysterically.",
            "date": "2016-06-22T13:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 221529,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493455.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yumenokotoba",
                "username": "yumenokotoba"
            },
            "url": "https://myanimelist.net/reviews.php?id=221529"
        },
        {
            "content": "My Rating Model: 7/10 ~ MAL Rating Model: 6/10\r\nNote: To say one needs an athletic disposition to enjoy Sport-Genre anime is quickly proved wrong in the first few episodes of Yowamushi Pedal. In fact, I believe the very foundation of Sport-Genre anime is what creates strong character-building. Stories that challenge the very nature of rejection vs. achievement is what allows Champions to be born. \r\nFor what starts off as an entertaining anime quickly turns into an unbearable mental test - rather a test of your durability in patience & suspense. I'm fairly disappointed with what began as a 9/10 story but for me - endedat 4/10. If i may alike it to any analogy I'd certainly pick One Piece or the Freeza Ark of DBZ where a single event/fight/challenge is stretched-out frustratingly long. I dare say i enjoyed the first half of the anime as much as Hajime No Ippo or the 'Major' series but it became quickly evident that this anime will only continue to force flashbacks and cheap suspense driving devices. \\n\\n\\n\r\nI'd HIGHLY recommend this anime for anyone with mental patience - who's happily satisfied in watching 3 hours of a 'complication/event' where not much worth noting transpires. \\n\\n\r\nThough, if this is your first Sport Anime i'm sure it will be either a Hit or Miss - though i'd recommend the first season of Hajime No Ippo 10/10 times over this. \\n\\n\\n\r\nMy Rating Model [Beta]\\n\r\n1.\tStory 6/10 \\n\r\n--1.1.\tPlot (60% of Mark) = 6.6 \\n\r\n1.1.1.\t+Opening [9/10]\\n\r\n1.1.2.\t+Conflict [7/10\\n\r\n1.1.3.\t+Resolution [4/10]\\n\r\n--1.2.\tPacing (20% of Mark) ~ Criteria (1/4 is dragged on, 2/4 is not bad/good, 3/4 is good, 4/4 perfect)\\n\r\n1.2.1.\tDragged On [1/4] ~ ratio to 20% = 0.5/10\\n\r\n--1.3.\tSetting (20% of Mark) = (1/4 lifeless, 2/4 non-fiction, 3/4 innovative, 4/4 alive) \\n\r\n1.3.1.\tNon Fiction [2/4] ~ ratio to 20% = 0.8/10\\n\\n\r\n2.\tCharacters 6/10\\n\r\n--2.1.\tCharacters 6/10 ~ Criteria (5/10: Empty, 6:10 Generic, 7:10 Generic/Original, 8: Original, 9: Original/Relatable/Engaging, 10/10: Wouldn't have it any other way) \t\\n\r\n2.1.1.\tThe overwhelming majority of Characters were Generic and without appeal, very few exceptions to this rule existed. \\n\\n\r\n3.\tArt 4/5 (Catalyst to PLOT / marks are slightly relative) \\n\r\n--3.1.\tRepetition (20%) Flashbacks/Filler Art ~ How often were the exact same blueprints used: Too Often, 1/3: Often, 2/3: On Occasion, 3/3: Never)\\n\r\n3.1.1.\t0/3 ~ 0/5:  Sadly I began counting episodes that DIDN'T have repeated art. Especially Point of View renditions of the road-ahead. That was consistently reused.\\n\r\n--3.2.\tColoring (20%) ~ How well did the coloring build Mood: 1/4: Rarely, 2/4: Sometimes, 3/4: Frequently, 4/4: Always.\\n\r\n3.2.1.\t Sometimes 2/4 ~ 1/5\\n\r\n--3.3.\tMood - (60%) ~ Specific to each mood presented - ie ~ Each mood is identified and to interpretation - marked with either Sympathy (care) or Apathy (don't care). \\n\r\n✔ Melancholy - Through use of the scenery, shading and coloring the artists successfully captured the sense of hopeless/futility in the characters.\\n\r\n✔ Passion - Many 'moving' cut scenes between hopelessness vs. hope to which the artist's rendition of a 'desperate' facial expressions - really helped established. \\n\r\n✔ Devotion (friends) Specifically Onoda's animation (expression) created genuine Sympathy and Cheer for the character.\\n\r\n3.3.1.\tFull Marks:  Cared about 100% of Mood presented ~ 3/5\\n\r\n3.3.2.\t✘ -/+ Extra mark [Use of Allegory] N.A\\n\\n\r\n4.\tSound: 5/5\t\\n\r\n--4.1.\tOpening/Ending Sequence (5%) My only criteria is Annoying/Not-Annoying :L\\n\r\n4.1.1.\t Not-Annoying - Full Marks\\n\r\n--4.2.\tSubtitles/Dub Quality (45%)\\n\r\n4.2.1.\t Subtitles 9/10\\n\r\n--4.3.\tMusic Theme/s (50%)\\n\r\n4.3.1.\t Full Marks just because of the 'Love Hime' song Onoda sings ;) \\n\r\n4.3.2.\t✘ -/+ Extra mark [Use of Allegory] = Did i hear any goddamn Cicada's ... dammit lol - only Japan's obsessed with these annoying pests. I'd love to see Mood/Atmosphere created without Insects for once. N.A\\n\\n\r\n5.\tOverall 21/30 ~ 70/100 or 70%\\n\r\n5.1.\tLetter Grading: C –\\n\r\n5.1.1.\tGrading Key:\\n\r\nA = 90 (-) > 99 (+)\\n\r\nB = 80 (-) > 89 (+)\\n\r\nC = 70 (-) > 79 (+)\\n\r\nD = 60 (-) >69 (+)\\n\\n\r\n6.\tMAL Rating \\n\r\n--6.1.\tDisclaimer\\n\r\n6.1.1.\t To cater for MAL’s unquantifiable ‘Enjoyment’ category – in conjunction with their naïve category balancing – I apply a handicap of 1 point to each score. While this may serve (at times) as counter-productive in rating 10/10 or 9/10’s with due credit; the overwhelming majority does not fall into this margin. In doing this, it’s my hope to fairly handicap all anime so as to ensure a fair – non-biased score and no ridiculously high scores for generic anime. It’s my belief that stricter methods have to be established to ‘level-out’ the reckless ratings on MAL’s. \\n\r\n--6.2.\t7/10 – 1/10 = 6/10 MAL \\n\\n",
            "date": "2017-02-10T21:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 240328,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5986201.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Willow_Folk",
                "username": "Willow_Folk"
            },
            "url": "https://myanimelist.net/reviews.php?id=240328"
        },
        {
            "content": "One thing I love about Yowamushi Pedal is that you don't have to be a fan of sports, sports anime or cycling to fall in love with the anime. The characters are all interesting and you grow to love them and hate them in your own kind of way. \r\nI find this anime funny, fun to watch, interesting and awesome. It's one of those anime's that'll keep you on edge during the races and give you feels when you see one of your beloved characters win or lose. If any of you guys like Kuroko No Basket then you will deffo love Yowamushi Pedal, Iwasn't sure at first as i'm not a big fan of cycling but trust me I absolutely loved it and now it's one of my favorite animes that i'll happily watch again ^^ until the new season comes out.\\n\\n\r\nHonestly it's worth giving it a watch, i'd say give at least 4-5 episodes a shot and see what you think :) but you'll be missing out! it's cycling in a completely different way, it's fun and cool for a start! So cool that I'm planning on cosplaying Imaizumi and Manami from it! Don't just take my word tho! Get going and check out Yowamushi Pedal episode 1!!",
            "date": "2014-07-24T11:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 153531,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3707261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RaveMasterHaru",
                "username": "RaveMasterHaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=153531"
        }
    ],
    [
        {
            "content": "Peer pressure often prevents us from being the person we want to be. The teenage years entail a necessity for conformity and a fear of change. Physical appearance, grades, money and social status are used to determine someone's value in society. Or so it seems.\r\nFor Onoda Sakamichi, he finds his place by pedalling and pedalling forward.\r\nYowamushi Pedal is a story of a weak-willed, unattractive and friendless otaku finding joy in life through the sweat of sport. Nobody, including himself, thinks him capable of more than shopping for manga and singing embarrassing anime songs. He rides his cheap bicycle from school to Akihabara once a weekand the dismal cycle begins anew. But through a series of fortunate coincidences he finds untapped talent and a place in his school's cycling club. \\n\\n\r\nUnlike most protagonists in sports anime, Onoda is not a hot-blooded maniac with a craving for victory. He is timid, weak-- but earnest. He pedals on not out of proud, but because his aching muscles and the wind beating against him makes him feel alive. In a race he does not need to worry that he is shy or awkward; all that matters is that he pedal forward and dominate the asphalt. While Onoda may not be likeable in the traditional sense (his timidness can occasionally reach the point of frustration), much like Mihashi from \"Big Windup\", you can't help but root for the poor guy.\\n\\n\r\nThe other members of Souhoku's cycling club are fairly exciting, though most of them are nothing you haven't already seen before in a sports anime. There's Onoda's rival, Imaizumi, but the rivalry seemingly vanishes into thin air as the Interhigh tournament approaches. Naruko represents the life and energy of the club, while the three seniors unsurprisingly serve as mentors to the first-years. The most interesting of all the characters (sans Onoda) is Makishima. His long, green hair, lanky body, molester-like smile and spider-like cycling manoeuvre has him come across as a creepy little bastard, but gradually he develops and adds a distinct personality to the show. Souhoku will certainly feel the loss once he graduates. \\n\\n\r\nThe rival cyclists are, well... they have quite a personality. One of them is a muscle freak who names his pecks (Andy & Frank, in case you were curious) and regularly screams \"Abs!\" while riding with his jersey unzipped, exposing his bulging, twitching muscles. Yes. Yowamushi Pedal is a very strange show.\\n\\n\r\nOthers are more conservative in their personality, with the unbeatable Hakone High serving as the second main cast of characters. Their rivalry with Souhoku feels genuine as a result of a number of flashbacks, and these scenes fortunately are handled gracefully, only ever shown when pertinent to the story. The individual members of Hakone High are all fleshed-out, too. Even Muscle Dude.\\n\\n\r\nThe one blemish in an otherwise fun cast of characters is Midousuji of Kyoto Fushimi. He takes ridiculous to a level that I don't believe I have seen before in a sports anime. He does not stop at simply being the arrogant antagonist; he is a goddamn animal masquerading as human. He slurps with his long, lizard-like tongue, bends his body in positions impossible for the human body, loudly grinds his skeleton-like teeth in front of his opponents, strangles his team-mates and leaves death shrieks like a complete lunatic. Okay, I understand that the show wanted to create conflict by having a villain that the entire audience can despise and root against, but he did not need to be exaggerated to such an extent. His character simply creates a pervasive, ceaseless sense of imbalance within the show. And he does not ever stop frustrating the viewer. By the power of God, Jesus, Allah, those Hindu deities that I can't remember the name of, my mom and every other person in the history of mankind, won't somebody please please please beat the fool senseless? \\n\\n\r\nMidosuji aside, Yowamushi Pedal does an excellent job of being accessible to those who have no prior experience or interest in the sport of cycling. Basic terminology is concisely conveyed to the viewer without being condescending, and it focuses more on the abilities of the cyclists rather than the intricacies of some obscure technique they are using. It does occasionally stray from realism during the Interhigh tournament, though. Every main character seems to have some sort of superpower. And you have to wonder how the characters don't lose their breath from talking so much while cycling.\\n\\n\r\nYowamushi Pedal is a visual feast. It is easily one of the best-looking sports anime produced to date. In the thirty-eight episodes produced thus far, there has not been one where the animation quality has dipped to any noticeable extent. The amount of CG used is thankfully minimal (usually limited to the scenery and the legs of the cyclists), though to be fair, it does skip many of the expensive shots by focusing more on the faces of the cyclists, with said faces given extra prominence by the blurring of the backgrounds. However, the best part of the visuals is the most basic: colour. Too many shows forget the importance of colour. Grey and brown is not fun for the eyeballs. \\n\\n\r\nThe musical score is great, but the real beauty is in how well-timed it is. All the tracks start and end at the perfect moment; a final dash towards the finish line being accompanied by a hot-blooded orchestral piece with guitars riffing in the background, or a tense 'eleventh hour' piece playing as the characters run out of strength and fall behind. One of the best moments in the entire show occurs in the thirty-first episode, with Onoda motivating his teammate by forcing him to sing along to a cheesy anime song (the way he's always encouraged himself), it later switching into a guitar solo of the song before finally crescendoing into the show's main background piece. Even if there's no particular stand-out track, the excellent usage of these tracks makes every episode a joy to watch. It's also pretty damn motivational, to boot. \\n\\n\r\nHowever, it should be noted that the first season (should they even be considered separate seasons?) does not have a conclusion. It ends in the middle of the Interhigh tournament during one of its climaxes, the final sprint of the second day with no 'to be continued' to assuage the viewer. Watching the second season is an absolute necessity, so you will have to prepare yourself for a fairly long ride.  \\n\\n\r\nYowamushi Pedal is first and foremost an inspirational story of the weak surpassing the odds and triumphing over the strong. It will not leave you with something you haven't already seen before, and while it is most certainly not deep or philosophical, it excels at doing what matters most: leaving a smile on the viewer's face.",
            "date": "2014-08-12T02:04:00+00:00",
            "helpful_count": 285,
            "mal_id": 156279,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=156279"
        },
        {
            "content": "Hobbies. Everyone has them whether when you were just a kid, during high school, or as an adolescent. But everyone’s hobbies vary. Hobbies pique interest and interest can lead into an obsession. For Sakamichi Onoda, his hobby is watching anime to the point of obsession. You remember that one time when you forgot to record your favorite show that airs late at night? Well for Sakamichi, that could be a catastrophe. But little does Sakamichi know that his hobby will lead him to an encounter with destiny. That encounter leads him to ride the winds and steer the Yowamushi Pedal.\r\nA tour with Yowamushi Pedal willquickly reveal the essence of this show surrounding the sport of cycling. It’s not just the promotional picture but rather the way the characters are designed. Besides Sakamichi, almost every supporting and major character has a degree of athletic form. It’s their passion, their desire, and love for bicycles that drives them to become the best in the world of cycling. But for Sakamichi, he is still riding a mamachari, or better known as the “mommy bike”. It doesn’t take a genius to figure out that he’s a beginner. Yet, there’s something that makes Sakamichi draw attention with his wit. And by that means, I mean potential. That potential leads him to join the Souhoku High Bicycle Club, the core group of the series starring individuals of all angles.\\n\\n\r\nThe show builds paths for our characters to take. For Sakamichi, his journey to stardom begins with his meeting with Shōkichi Naruko at Akihabara. The encounter isn’t anything mind crushing but strikes a bit of curiosity. After all, the two seems nothing alike based on their personalities and appearances. Naruko, the boy with red hair, has a fiery passion with a competitive nature in sports. Sakamichi is the boy with otaku passion with an obsessive nature in anime. Get the picture now? Nonetheless, the episode detailing their meeting highlights a potential for Sakamachi. He is able to ride through the winds and break forth his timid nature. In retrospect, Sakamichi creates an impression that some people might of not originally anticipated. While the show does not warp itself with mind games, Yowamushi Pedal does offer plot twists viewers will be surprised by. Sakamichi’s first step to becoming an elite cyclist is one of those surprises.\\n\\n\r\nHowever, the real question remains if Sakamichi can talk the talk, but also walk the walk. Comparing to characters such as Shunsuke Imaizumi, this seems to be overkill. Shunsuke is like the professor of cycling, knowing the nature of the game and presented as logical thinker. His competitiveness and dream has no boundary. In fact, the rivalry between him and Naruko is quite intimidating like tiger vs. dragon. Drawing from rivalries usually brings out the best of a character. In this series, it does that easily with the way characters compete whether it’d be friendly competitions or a battle of pride. At the paramount of the story, Sakamichi also shines with brilliance with how much he improves. For a show like this, character building is important and the focus is adamant to draw interest. The competitive atmosphere brings out that focus with obstacles the characters must overcome both physically and mentally. These obstacles ranges from a simple steep slope to catastrophic bike accidents that can lead to potential death for the characters. This is expanded to supporting characters as well and rivals of the Souhku High Bicycle Club. The success here is that the show embraces characterization on them with clever flashbacks and well-timed scenarios. It clearly makes its point across to show what the character wants and desire to achieve. Characterization becomes an important aspect of this show and I am thoroughly impressed by its aspects.\\n\\n\r\nThere’s also a niche for sports series that doesn’t need to be unique to set itself apart. The catch for this show is that it can transform cycling into a form of art. Characters brings their skills artistically during competitions with their unique styles of skills. These include a variety of signature moves like Naruko’s rocket sprint, Makishima’s spider climb, Midousuji’s leaning style, Tadokoro’s human bullet train, among others. Even Sakamichi develops his own signature move that truly shows how far he comes across. He might not be a prodigy but potential is one word that draws in people’s attention. As a member of Souhoku High Bicycle Club along with some of the main characters, Sakamichi sets himself as a journeyman. His interaction with characters brings out his potential especially during training camp. When he rides up that slope, Sakamachi is building character with his spirit. We’d like to appreciate his development as he takes on challenges that are seemingly impossible. He has to figure out solutions to difficult problems where they are real, not like the ones in the anime world he came to embrace.\\n\\n\r\nIt’s also said that competition often draws out the best of a person. After all, competition has rewards, tests, and strives to make us accomplish and achieve. Despite playing roles of supporting characters, some of them really tests the Souhoku High Bicycle Club. A few of them even have dynamics focused on their characters through clever usage of flashbacks. It ties directly with the story to bring forth development. It’s not just their gimmicks but their nature that will draw out interests for viewers. This interest leads to both friendships and rivalries to bring out the best of the best.\\n\\n\r\nThere are also other ways to look at this show. One is from the realistic angle with the mechanics of cycling. There are fundamentals explained that draws in techniques of cycling from the real world. Brand names are also featured to bring credibility with the competitions. From another angle is the comedy that sometimes will feel unrealistic. Characters such as Izumida will draw attention with his signature phrase “ABS, ABS, ABS” or Akira Midousuji’s nightmarish face. At the same time, some of the feats these cyclists performs can seem superhuman and unreal. There’s a boundary that blurs in between fiction and reality as the competitions gets tougher and heated each episode. And don’t forget the ending after the credit song. There’s a little gimmicky afterwards that offer laughs for nearly everyone.\\n\\n\r\nA philosophy to get used to for sports series is generally development and training. Perhaps this show focuses a bit too much on the latter. The training session can feel repetitive and dragged. In fact, the first half exclusively focuses on this with appealing image but will take patience to get through. Furthermore, Sakamichi isn’t exactly a model to look on firsthand. His blend design and obsessive hobby isn’t something to write home about. The crux of the series focuses on his development but this could come as a mixed bags for viewers. The weaknesses also comes forth with his biking style that doesn’t bring impression at first glance. Furthermore, there’s a lack of this show’s style itself when it comes to competitions. Some bits can be predictable while others will feel like a repetitive cycle. And when it comes to destinations, there are times when you might not like what you see. Season 1 is also noticeable for cliffhangers and the endgame isn’t far from that.\\n\\n\r\nArtwork is attractive on most parts of the series. The backgrounds feels natural with the mountain fields and rural roads. Although the characters doesn’t all look cutting edge, they do have a well-built presence. Each character has a design style that matches their persona whether it’s Naruko’s fiery hair to make his equally intense personality, Makashima’s long green hair, captain Shingo’s trademark sunglasses, or Midousuji’s malevolent expressions. It’s silly to say but Sakamichi is probably the most normal looking main character we see. Luckily, there’s limited fan service. (unless of you count Izumida’s friends nicknamed by him as “Andy” and “Frank”) What you get is characters that looks real, competitive fields that look consistently natural, and a respect for the nature of the game.\\n\\n\r\nWith an intense sport such as cycling, you’d expect soundtrack as a major backbone for support. The hype is real and the soundtrack does not disappoint with its well-coordinated orchestra. The OST is a strength that is fierce, adamant, and vigorous to the core. Incoming climatic scenes are set up well with thanks to the OST. Along with pacing, we get what fans deserve – high caliber races of integrity and well-timed music. The OP and ED songs also demonstrate degrees of such integrity. Character voicing is also respectable with their voice mannerisms that matches their personalities.  There’s also a silly gimmick with the infamous “Hime Song” that will knock your socks off. If you’re not ready for each episode, the soundtrack will get you fired up.\\n\\n\r\nIt’s admirable that such an exercising hobby such as cycling can be turned into such a competitive sport. For Sakamichi, he never thought of going from a mommy bike to riding the glorious winds of a national competition. Just note that season 1 serves more as a built-up (for the first half) and execution with the remaining course. The ultimate conclusion isn’t exactly what should be designated as a suitable ending. Still, the experience you gain out of this show will also feel like a journey after you watch the rivalries, the characters’ creativeness, and a story about so much more than just riding a bike to burn calories.\\n",
            "date": "2014-09-07T23:24:00+00:00",
            "helpful_count": 45,
            "mal_id": 159591,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159591"
        },
        {
            "content": "Yowamushi Pedal is not a good show. It's a standard, predictable shounen sports series that does nothing memorable or exciting. Every conflict in the story is caused by not having enough pride in your team, and every conflict is resolved by having more pride in your team. The characters all fit neatly into their pre-determined stereotypes, and nothing really changes between the start of the show and the last end card. But this show does excel in one area, and that is copious amounts of balls-to-the-wall MANSERVICE.\r\nNow, I don't claim to be an expert on the admiration of the male physique. I like my ladiesmore than I like my guys, which is why I lean towards shows like Highschool DxD more than Free. But I started this show with no idea what I was getting myself into, and for the first, oh, 10 episodes it was a so-so show about bicycles. Then it started happening. The outfits got tighter, the shorts got shorter, and the amount of screen real estate taken up by sweaty butts increased dramatically. I was bewildered by this sudden turn. “Truly,” thought I, “these camera angles are those reserved for fanservice shots, but there is nary a panty to be seen!” It wasn't until 2 episodes before the show ended that I finally had a complete conception of what I was seeing. It was a shot of two cyclists crossing the finish line, one positioned triumphantly behind the other with his arms held to the sky, hips thrust proudly into the rear of the one in front. The loser was wide-eyed at this sudden shock, overcome with the realization that the winner had completely taken him by surprise. It was then that I knew just how far from home I had come.\\n\\n\r\nYowamushi Pedal is a show built entirely on a foundation of manliness. You're apt to see so many sweaty, panting men with their firm butts thrust high in the air, grasping at each other and fighting for dominance, that you'll never want for another slash fic again. There is a veritable smorgasbord of masculinity on display for any tastes you might have. Do you fancy the stoic leader type? Take your pick from any of the team leaders. Do you prefer a foul-mouthed lone wolf who secretly cares deeply for his friends? You got it. Want a tall, awkward guy with a big heart? Well, you're getting one anyway.  The dogged nice guy with a dark and troubled past even makes an appearance. Like your guys with a more bishounen appeal? Here's a fun activity: count all the female cyclists you see on the character page. Done? Those are all guys. Do you love big beefy bros? There's not one, but TWO massive mountains of man-meat here, one of which even names his muscles for easy reference in fan fics. “Oh Arakita-san, please rub lotion on my Andy...” Like long, spindly guys with no bones and a sociopathic hatred of humans? You may want to talk to someone about that, but in the meantime, enjoy Yowamushi Pedal! No matter your preference, this show's got you covered.\\n\\n\r\nShould you watch Yowamushi Pedal? If you've read this far, you should already know the answer to that. If you like men's butts and you cannot lie, pick this one up and tough out the first two arcs. You will be richly rewarded. If you just want to watch a by-the-numbers shounen then by all means, pick this up as well. But if you're not in the mood for manservice and you don't want to see something that insults your intelligence, then give Yowamushi Pedal a pass. Now if you'll excuse me, I have to go marathon Seikon no Qwaser to reaffirm my sexuality.",
            "date": "2014-07-06T13:23:00+00:00",
            "helpful_count": 44,
            "mal_id": 150719,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1283401.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Solid_Cow",
                "username": "Solid_Cow"
            },
            "url": "https://myanimelist.net/reviews.php?id=150719"
        },
        {
            "content": "At one point or another, one faces a metaphorical wall, and no matter how much effort one puts into breaking it, it is futile. What does one do, then? Give up? Wait? Have the willpower to try again and again?\r\nThis, essentially, is what Yowamushi Pedal is about.\r\nYowamushi Pedal, Weak Pedals in English and Yowapeda for short, follows Onoda Sakamichi and his journey to have fun with friends he never had, as well as his struggles in the world of road racing he gets dragged into. It’s, of course, not a unique concept by any means – after all, many sports shows follow the scheme ofa rookie exploring the sport in question. But instead of giving the viewer what they want – Onoda, and the bicycle team he’s in – Sohoku – to be at the top after hard work, Yowamushi Pedal rather makes the members suffer through one obstacle to the other.\\n\\n\r\nBut let’s start from the beginning.\\n\\n\r\nOnoda’s biggest wish when entering high school is to join the anime club and to gain some friends with similar interests, since he was mostly alone in middle school. But this is going to change in high school, he tells himself, and it does indeed, as he doesn’t join the anime club as intended, but the bicycle club instead, after meeting the tall, serious Imaizumi and the flashy, short Naruko, to test his own potential. And Onoda does show lots of potential, especially at climbing hills (true to his name, which means “hill” in Japanese), and at catching up to opponents, eventually determined to help the Sohoku bicycle club in any way possible to gain overall victory. \\n\\n\r\nWhile the story per se is not particularly good – especially paired with pacing problems in the second half of the show, unnecessary time extensions as well as the ending – its themes are very heartwarming and realistic. For one can’t say that they can’t identify with the theme of failing, and the constant struggle of overcoming obstacles, and Yowapeda has it in all facets and angles. Every character looks for ways to overcome their struggles, and for ways to motivate themselves. And in the middle of all that, there are comedical slice-of-life moments that strengthen the interactions between the characters after every ending song. The world of road racing is explained well, as the viewer has just as much of an idea of it as Onoda does, bit by bit so that it doesn’t come off as a boring info-dump, especially with every piece of information almost directly demonstrated in the scene.\\n\\n\r\nThe cast is certainly an odd mix. It never really fits any archetype, though it is close to, but that doesn’t exactly mean they’re very unique, either. Onoda fits in the otaku archetype, but is more presented as a timid, shy person who tries to give his best. Imaizumi fits in the serious, arrogant boy archetype, but there are moments where he is simply very awkward, and the list continues. The Sohoku team, save the green-haired third-year Makishima, who is an “irregularity” as he refers to himself and grows to be a distinct personality in the team, is very conventional with nothing new. But Makishima is by far not the only one who develops over the course of 38 episodes; the previously mentioned Imaizumi and third-year Kinjou are some examples as well. Of course, Yowapeda doesn’t only focus on Sohoku only (even though the first half does invest on the team); the rival team and champions Hakone is worth mentioning as well. They’re a lot odder than Sohoku – there’s the aggressive Arakita, the eccentric Toudou, laid-back Shinkai, muscle-freak Izumida and Onoda’s rival Manami. And despite being such an odd bunch, they get their flashbacks and development as well, even their stone-faced captain Fukutomi. The rivalry between Sohoku and Hakone feels real, too. Last but not least, there’s the antagonist Midousuji with his team Kyoto Fushimi. He’s the oddest of the cast, disturbingly so, and most of the time Kyoto Fushimi serves as a shock factor to Sohoku and Hakone. While not everyone’s past is revealed and not everyone is developed, a lot of them are, and they help making the characters seem very human with their faults and motivations. Indeed, the characters are Yowamushi Pedal’s strongest point.\\n\\n\r\nThe animation is average, sometimes even cringeworthy, but at least consistent. The CGI is not very annoying nor very remarkable. As for the sound, it certainly never feels out of place, always suiting the current mood. The problem is though that it is very repetitive, as certain tracks for racing or dramatic moments are used over and over again. The opening and ending themes deserve a special mention as well – almost all of the song fit the mood to the corresponding arc, the best of them being the second opening (Dirty Old Men’s “Yowamushi na Honoo”) and the best ending the third, “Glory Road”, sung by the voice actors of the Hakone members. Speaking of voice acting, it is certainly well-done. Many of them are B-list voice actors, and still pulled off the character they’re voicing without effort, especially the performances for Onoda and Toudou.\\n\\n\r\nSo in conclusion, Yowamushi Pedal is not the most unique, but a very touching tale about friendship and overcoming obstacles. Even though it has pacing issues at times as well as a non-existent end, it makes up for it with loveable characters and intense matches, as well as the great opening and ending themes. It does not rely on “pseudo-homo” moments, nor on magically winning because it’s the main character, but rather on the strength of willpower and how actually motivating friendship is. Should you watch Yowamushi Pedal? Yes.\\n",
            "date": "2014-10-02T06:59:00+00:00",
            "helpful_count": 34,
            "mal_id": 163273,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3190265.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elleyonce",
                "username": "elleyonce"
            },
            "url": "https://myanimelist.net/reviews.php?id=163273"
        },
        {
            "content": "This review has grown big enough, so I'll cut the chase and let you jump right into it:\r\n -Story-\r\n 7/10\r\n I'll go right ahead and say that I'm not usually \"into\" sports manga and/or anime, mainly because I'm not into sports in general. Thus, I can't really say how clichéd or not clichéd the story is compared to other titles in the genre. I do know a few things about shōnen though, and seriously - this is so shōnen.\r\n A lot of determined faces, seemingly impossible odds, close failures that get solved in the nick of time by the power of some good ol' JapaneseSpirit(TM), speeches about friendship and teamwork, and homo-eroticism. My god, is there a lot of that last one (this is excellent fujoshi-bait, so keep that in mind fellas).\\n\r\n Anyway; yeah, as far as shōnen goes, this story probably has seen the light of day more times than can be counted. And honestly? I don't mind.\\n\r\n The characters tries, works hard, support each other, fails and then tries some more. The competitions are exciting, the friendships are touching and the funny moments are genuinely funny.\\n\r\n Have we seen it before? Yes, definitely. Does it matter? No, I don't think so.\\n\r\n (It's also nice to be able to truthfully say that I actually learn something new when watching it; Watanabe, the mangaka, is a cyclist himself and all the facts and techniques that show up are real, if sometimes exaggerated.)\\n\\n\r\n -Art & Animation-\\n\r\n 8/10\\n\r\n Nothing really special. There are shots that linger a teensy bit too long, many close-ups of the eyes, looped footage, CGI in a few places (though it's not as jarring as you might think; I for the most part didn't think about it) and probably some other tricks to make the animation seem not-as-cheap-as-it-most-likely-is. At the same time, the art still looks nice. The art in the manga is at best stylistic and at worst sloppy, but the anime makes a good job of cleaning it up and giving the character designs a little bit more consistency. The result is polished, if slightly generic.\\n\r\n (I'm also happy to tell that there's a considerable lack of side-mouths or \"fish-faces\", which is always a welcomed virtue.)\\n\\n\r\n -Sound-\\n\r\n 9/10\\n\r\n Absolutely lovely. If the music wants to get you pumped, you'll get pumped. If it wants to break your heart, reach for the tissues. If it wants to make your heart grow three sizes and fill it with fluff, don't fight it - embrace it. It will get you, sooner or later. All of the opening and endings fit very well with the concept and are pretty damn good songs on their own to boot.\\n\r\n The voice acting is equally satisfying; among the cast there are some known and some less known, but all of them are doing a great job and every voice fits their character superbly.\\n\\n\r\n -Character-\\n\r\n 10/10\\n\r\n The trump card of the show. These characters are WONDERFUL and I love every single one of them. Each and every one have their own special blend of talent and eccentricity that makes them stand out and be charming both by themselves and when paired with another character. Perfect since much of the humour comes from the guys' personalities playing off each other. Like probably many other sports anime and practically every shōnen anime there are rivalries in abundance, but so far only one of them is actually malicious, which is a nice change of pace. It's safe to say that the characters alone are reason enough to check YowaPeda out.\\n\\n\r\n -Enjoyment-\\n\r\n 10/10\\n\r\n If you haven't realised it already, I enjoy this show immensely, both in a written and animated format. It's fun, exciting and at times incredibly sweet. I was amazed at how something as simple as racing up a hill could pull me into the action and struggles of the characters. Sports anime and manga might not have been my thing before and, hell, maybe it still isn't, but after watching Yowamushi Pedal I'm at least willing to give the genre a try.\\n\\n\r\n Overall, a 9/10 - lowered only because of the art and story which we've unquestionably seen before. Still, I cannot stress enough how worthy this show is of your time and attention.\\n\r\n And about the fujoshi-thing I said before? It's actually not that bad, so please - don't let it be a deterrent (just stay away from certain forums and art sites and you should be fine).",
            "date": "2014-07-08T19:58:00+00:00",
            "helpful_count": 26,
            "mal_id": 151125,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1164545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TooBadForU",
                "username": "TooBadForU"
            },
            "url": "https://myanimelist.net/reviews.php?id=151125"
        },
        {
            "content": "\"Sometimes, things that you dont consider as a good thing for you is probably the most good things for you\"\r\nThats what i learned from Yowamushi Pedal.\r\nYowamushi Pedal is an anime that i pick randomly just because some people talking about it, honestly i dont have any expectation for this anime and i am not even a fan of cycling. For me, cycling is just a boring sport you just have to pedal your bicycle as fast as you can and thats it. But seems my arrogance must be paid, this anime gives you a new perspective about cycling and makes you think cycling is notalways ride a bike but also the fun behind ride it.\\n\\n\r\nThe story will begin about Onoda Sakamichi, an otaku who loves to go to Akiba using his mama bikes once a week. When he entered into Sohoku high school, he already planned to join anime club but unfortunately anime club is already disbanded and need new members to revive the club. While he tried to find a new member, he realize his talents in cycling especially in climbing which he got from his journey to Akiba each week. Then, he ended up to join Sohoku cycling club.\\n\\n\r\nWhat makes Yowamushi Pedal interesting is the way how the bring the story.  As we know, cycling is not really popular and even boring sport for some people –me, especially- they bring out the tension and drawing out some “action” scenes. Basically, Yowamushi Pedal  is a modern sports konjo (meaning sports and will-power). They providing us each of the character’s thoughts carefully while taking careful time to illustrate the action and the reason behind each characters the action.\\n\\n\r\nNot just that, Yowamushi Pedal explains perfectly all things about cycling. Like how i said before this anime give you a new perspective about cycling and they really did it. I always thought cycling race (like tour de france) is simple, you just need ride the bike and quickly reach the finish line but i was wrong. It is more complicated. Like did you know there is two type road bicycle racer, climber or sprinter? Or did you know the pack leader is the most exhausting parts because they must drafting the pack?\\n\\n\r\nAs i said before, sports konjo is focussing on will-power. Its pretty much genre that quite essentially from japanese and easily reflects an important mentality within the culture: no matter how tough it gets, it’s possible to improve by the power of will and this what makes Yowamushi interesting. Our main character, Onoda is not a talented person in cycling but his will what makes him through all the obstacles and we, as viewer cant be helped to not to root for him.\\n\\n\r\nYowamushi Pedal is surely quite eyecandy for a people who looking for visual quality. It surely have the best art in sport anime. They mixed well between 2D animation and 3D animation especially when every riding scenes, they use 3D animation from the legs to the bottom  while  in the face they using 2D in face section. I must say the art is really superb and almost flawless. Not just that, the background is also looks vivid and colorful, its surely visual feast for the viewers.\\n\\n\r\nThe music is also pleasant to hear. All the opening song which are rock songs is really suitable with the themes, which is sport and determination. The one thing i really memorize is from Dirty Old Men, Yowamushi na Honoo (弱虫な炎) is really a catchy rock song, the fast beat drum and catchy tune makes this anime looks epic. The BGM or soundtrack is also amazing, they really hyped the atmosphere like when the racer nearly reach the finish line, the BGM that they use is an orchestra music which makes the atmosphere looks glorius and epic.\\n\\n\r\nWhat makes Yowamushi interesting to watch is the characters. Almost all the characters in this anime have unique side and personality. You can easily knowing them by the differences, like Naruko , which he is hot blooded character or Izumida, the rival cyclist who is always flaunting his chiseled abs. Its important to make the characters prominent to others because by doing it you can easily remembering them and make them is not like a forgettable 2D character and become a wasted character.\\n\\n\r\nFinally, after all the things i have said, i can surely saying this “this is a great anime that i would recommend to you guys”. This is one of good sports anime, because it can turn the topic of a sport you’ve never had interest into entertainment, and Yowamushi Pedal is just like that",
            "date": "2014-12-18T06:29:00+00:00",
            "helpful_count": 24,
            "mal_id": 172825,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=172825"
        },
        {
            "content": "Oh gosh, the things to say about this show.\r\nI really, really loved this show. When I first found out about it, I was a bit confused because: Bikes? Why? \r\nBut then I fell in love with every single character in the series and it was one hell of a ride.\r\nThe story is simple and easy to follow. Looking at the story dryly, it may seem a bit boring, but it really isn't. It's the characters and their amazing development that make this series awesome.\r\nThis cast is hugely diverse in looks and personality. You've got chubby characters, extremely thin characters, muscly characters, tall characters, short characters,characters with birthmarks, and each character's face looks different and unique. Oh, I just love this cast! Their diversity makes them seem so real and loveable, not to mention they all have their strengths and weaknesses, each and every character's backstory being touched on, making you love these characters more. Each character had something they were carrying, some initiative to win and fight and carry on. These characters had their own demons to fight, a character with PTSD that overcame his stress, characters that suffered loss (races, and family) and characters that had to gain confidence along the way, like our protagonist, the first year Onoda.\\n\\n\r\nOnoda started off the show with no friends and planned to just simply have an anime club and make friends there. With his unplanned decision to join the bike racing club and in which he finds his love and passion for bikes. There are parts in this series that will warm your heart and make you tear up a little, and parts that will make you mad and keep you at the edge of your seats. It made you want to get up and cheer on for these characters like you were watching a real live race. At points, you will think you know who will win, and then there are points where your mind changes and this is an even bigger reason why this show will keep you at the edge of your chairs in suspense!\\n\\n\r\nThe animation and sound were both very good, I enjoyed the openings especially. I definitely did not focus on those factors much while watching the show, but Ii did enjoy the animation and how bright and colorful everything was.\\n\\n\r\nOverall, I highly recommend this anime for those who want a story of friendship, hardship, challenge, and most importantly bikes. I was most definitely not expecting such a heartwarming and passionate story like this to be about bikes, but it was and I wouldn't have it any other way. This series was great, and for more be sure to read the manga!",
            "date": "2014-07-23T12:47:00+00:00",
            "helpful_count": 17,
            "mal_id": 153395,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/freemums",
                "username": "freemums"
            },
            "url": "https://myanimelist.net/reviews.php?id=153395"
        },
        {
            "content": "This review only applies for the first 10 episodes of the series, it does not constitute for the overall experience of the anime itself and it will be comprised of what I liked/disliked about the anime and the reason I have had dropped it for.\r\nMy reasoning for dropping Yowamushi Pedal is fairly simple. It has no element that is unique to itself and presents only themes that have presented in a lot of other sports anime. As a result of such, you have an underdog that finds friendship and determination by getting entranced in a sport, cherishing the friendships he made along the way, beingentranced in the competitive nature of the sport. He doesn't look impressive to the average person, but unlike them, he has a lot of determination, despite doubting his capability, but he has x trait that really shows off how talented they are. Follow the adventures of 和名 as he finds friends and proves his worth.\\n\\n\\n\r\nThis is the exact setting. The sport is cycling. The protagonist is an otaku with no friends that kept riding to Akihabara which was 90 kilometers away and was sad because he has no friends, literally. He wished to get friends and noticed he actually had potential in something, so he started developing a passion for the said something. The sport itself isn't particularly interesting, not because cycling itself can't be entertaining, but because it can't be written in a way in which you can measure the skill of the participants, so every time it just showcases the characters constantly reiterating the fact that they're determined, and then they speed up. It does explain cycling techniques and how to cycle more efficiently, but watching a battle of endurance/determination is just not something I consider fun, when there isn't really anything else to it other than that. It's just like lighting up a couple of candles and watching which one melts the fastest. Can't contain that excitement. At the very least, the candles can't say cringy things such as \"He's one with the bike.\" \"He won because his feelings WERE THE STRONGEST!!!\" \"I'm only good at talking... with my pedals.\" and there's plenty more that I don't remember. \\n\\n\r\nThe characters aren't particularly interesting, and are merely safe archetypes that worked before in the setting. Like the reserved introverted guy, that is really passionate for the sport, or the guy that wants to stand out and be in the spotlight, with the colored hair and the short height, or a goof that wants to brag about how good he is, despite the fact he's mediocre, or a tall guy that is intimidating due to his height and because he is socially awkward, or a guy that learns about the power of friendship. I mean, their entire character can be boiled down in a few single words, like  otaku wants friends, i'm muscular, i'm short but i can pedal and so forth, you don't see any depth. They're just a blend of bare minimum character traits with singular motivations. Frankly I watched for 3 hours and 20 minutes, and this is the impression the characters left on me, and I think that that is more than enough time to display at least one out of the ordinary element in your story or characters. There is no such thing to the point that I got in Yowamushi Pedal.\\n\\n\r\nThere wasn't really anything I particularly enjoyed about Yowamushi Pedal. I appreciated some of the information about cycling, but everything else was not really noteworthy, and this is what I think Yowamushi Pedal is, not noteworthy. It doesn't try to do something inherently unique in any measure and presents a story that was done to death, without altering the formula in any way. It simply banks on the audience reaction of \"cheer for the underdog because they're the underdog.\" There wasn't anything unique about it and I noticed how it went with safe formulas that were used before, as well as its focus on a theme that has been done to death. There isn't really anything about the sport through which you can measure the skill of the participant, and it mostly comes down to determination and endurance, which are all decided by the narrator at his own leasure, which eliminates all of the tension. Yowamushi Pedal tells the story of an underdog's journey of developing friends and getting better at a sport. If that's what you're seeking, this is a good choice for you. But if you want more than a repeat, or have prior knowledge of series of the sort, I would steer clear of this series. But I think a good underdog story is a story where you can understand how the underdog changes in order to overcome the odds. And I just can't see this not going into a direction that is settled by \"I wanted it more/You didn't want it enough.\" Which is a required element at the basis, but one that needs to be largely built on to stand out, and not be constantly said on screen. That is how Yowamushi Pedal failed me.",
            "date": "2017-01-21T13:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 238770,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=238770"
        },
        {
            "content": "This was an enjoyable anime that gives one a great glimpse into cycling and its peculiarities. While giving you information about the sport you also get a pretty common but well build story that is, in its format, quite often used. The main character find a new passion and happens to have a talent because of something he had to do up until now. (This is similar to Initial D and others.)\r\nSo the story isn't a deep masterpiece but fits perfectly for the theme of cycling and allows for exposition.\r\nThe art and sound design are fine and allow for easy watching and support the actionwell.\\n\\n\r\nMy verdict: Nice Anime, solidly build and well made about a topic that is interesting and known to many. If you want an anime thats fun to watch, you don't want a deep story but would like to know more about cycling this is a great anime for you.",
            "date": "2015-03-30T15:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 184137,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/acclrtr",
                "username": "acclrtr"
            },
            "url": "https://myanimelist.net/reviews.php?id=184137"
        },
        {
            "content": "With the announcement of the 3rd season, I decided to check out Yowamushi Pedal and see whether the ride was worth it (pun intended). I wasn't exactly expecting anything special out of it, so I can with a heart full of love say that Yowamushi Pedal is everything I thought it would be before I watched it. In a nutshell, it's just another sports anime...\r\nIf you're a newcomer to either the world of anime or the sports genre, you may get far more out of YP than I did. It has everything that enticed me into this genre at first: over the top animation, plethoraof characters with special abilities, rivalries, etc. It's entertainment in its purest form, and I can't fault it for that alone. In reality, I enjoyed my time with Yowamushi Pedal quite a lot. That is, if I ignore the fact that I've skipped at least 6-7 episodes altogether. \\n\\n\r\nAs for the main reason, I can only blame the story. You won't find a sports anime nowadays with good story - you simply cannot. They rotate the same cliches as if they're playing 'Wheel of Fortune', and you can practically see the entire 1st season from the very 1st episode of the show (okay, maybe 2nd). A guy who can barely, if at all, play a certain sport joins a team which would under no circumstances accept him in real life, but he has that one, unique thing about him that makes others want to teach him. Raise your hand if you've ever heard of  that kind of a story. \\n\\n\r\nThe reason I why I graded the story as such is because it's practically a carbon copy of every popular sports anime out there. Imagine if KnB or DnA were converted into cycling, and you have it. However, whereas KnB, DnA and so on merely have cliche and predictable stories, they at least try to break the mold here and there. YP? Never. Not throughout 62 episodes of the first and second season did I even notice an attempt at something new or different. \\n\\n\r\nHowever, I can't say that's truly a bad thing. The author merely followed the formula of 'if it ain't broke, don't fix it', and decided to just roll with it. Problem arises though if you're someone like me, someone who has seen his fair share of sports anime. Because, starting with episode 1, you gain the ability to see into anime's future. And, as fun and awesome as that sounds, it is not. Same backstories of the minor characters that are neither interesting nor fun, same 'unexpected' twists, same rivalries, same sequences of random power-ups... I can go on listing cliches till sun freezes over, but I think I got my point across. \\n\\n\r\nOne thing, though, I can praise the story for is the pace. At least it doesn't take 70 fucking episodes for the MC do be kind of, sort of, somewhat fucking useful to the team. \\n\\n\r\nAnime even falls behind others in the genre in production values. While sound and music should be applauded, alongside voice actors, I always felt that animation was lacking that 'wow' factor that other shows have. Unlike with others, I cannot remember a single moment, save for perhaps one, as THE moment, where MC does something truly badass. Everything, animation wise, simply felt... average. I mean, I see the effort, and fluidity, at least to a certain degree, is there, but the animation lacks that final punch. At some of the more important moments, I always felt as if the animation, and anime in extension, failed to convey the sense of speed (which is hugely important for this sort of an anime) to the viewer. If you've ever seen some episodes of Major, Eyeshield, Kuruko, hell, even Diamond, you can remember that you felt the sense of massive speed being conveyed by animation. Yowamushi simply fails to deliver that. \\n\\n\r\nWhen it comes to the characters, there isn't really much to say. It's your standard set of sports anime characters, but Onoda reminded me far more of Eyeshield MC rather than most others as he was extremely timid. He's probably the best and the worst character in the entire series, and that 'worstness' boils down to two things:\\n\\n\r\nFirst, he lacks any sort of individuality. For the entire run of the anime, he never did anything out of his own will. He joined the club because he was basically told to. He trained hard because he was told to. He participated in the race because he was asked to. He did his best in the race because he was ordered to. He lacks any sort of a backbone and that's just terrible writing for your main character, especially in sports anime. \\n\\n\r\nSecond, his reactions... I mean, fucking overreactions to ABSOLUTELY EVERYTHING. Each time some of the characters would say something that's mildly outside his comfort zone, or each time something \"\"\"\"ODD\"\"\"\"\" (all the quotation marks intended) would happen, the dude would freak out as if a random chick pulled him off the street and told him she's carrying his kid. I fucking had nightmares feautirng that face of his, and it is present in EVERY SINGLE GODDAMN EPISODE. No, seriously. I strongly believe that if someone had said \"SKY EXISTS\" he'd make the same :OOOOOO face. Brutal. \\n\\n\r\nFor all my ranting, I can honestly say I enjoyed Yowamushi Pedal. That's mainly, though, since i had low expectations to begin with, and I mostly knew what I was getting myself into. It has the similar feeling that all sports anime share - they're rather easy to watch, and even easier to binge watch. Although I did skip most of the 'character development' scenes and backstories of the characters that are there for like 2 episodes, I feel like that actually helped the factor of enjoyment. I sure as hell couldn't have sat through yet another story of a freaking thug being converted over to the sports by the sport junkie or whatever. \\n\\n\r\nOverall, this is... just another sports anime, really. If you enjoy sports genre, go for it, you'll love it. If you're like me, though, and are looking for something that's at least slightly different, then yeah, keep looking mate. This ain't a ride you wanna ride. (omg...)",
            "date": "2016-12-18T07:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 235739,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=235739"
        },
        {
            "content": "This is a SPOILER FREE review. This is my opinion and you dont have to agree!\r\nI just watched Yowamush Pedal and I have very mixed opinions about it. \r\nFor starters people that dont like slowpaced anime or just can`t stick through the whole anime shoudn´t even give this a try beacuse this is one of the most slowpaced anime that I have seen ever.\r\nStory: (7/10) This is an anime about an otaku name Onoda Sakamichi. He is a plain looking guy with glasses the regular guy. In middle school he didn`t have anyone to talk about anime beacuse no one watched it in hisschool  neither did he have friends and no one knew he was into anime. Thats why  road alone to Akiba everyday on his bicycle which was many kilometers away from his house. He was excited for highschool beacuse his plan was to join the anime club and make lots and lots of friends. But it doesn`t go the way he thinks. \\n\\n\r\nThe pacing had alot of problems like :\\n\\n\r\n1. It takes them like 3 or 4 episodes to introduce the main protaganists in the anime.  \\n\\n\r\n2. There are lots and lots of inner dialogs in every episode. \\n\\n\r\n3. Flashbacks... good god there are so flashbacks it drove me crazy. Almost every character that had a role in the anime had atleast 1 flashback. Even if it was a non important character that gets to be in the anime for like 4 episodes he had to have a flashback\\n\\n\r\nThe story is good I didn`t like the pacing it was way too slow and made the anime feel boring but other wise it was nice. The main character is tested both physically and mentaly. The other characters supported Onoda and Onoda supported the others. Honestly I thought that is was a waste that they didnt add little romance in the anime there was this girl that I could see being in love with Onoda and Onoda fall in love with her but they didnt do anything with it so I thought it was a waste of a good looking character just saying. Like there are many wasted things in the anime that I could see being good but they didnt do anything of it which was a little disapointing.\\n\\n\r\nArt:(8/10) The art is good it fits the characters. The art is modern and done well but it isnt anything special that I don`t see in other anime.\\n\\n\r\nSound: (8/10) The sound track was nice i changed from when the characters are fighting (with bicycles) too music when the characters were happy. The opening were okey.\\n\\n\r\nCharacters: (9/10) All of the characters have different personalitys that are very refreshing and keep the anime interesting despite it being slow paced. The characters delvelope during the anime alot at the end you can see the difference.\\n\\n\r\nEnjoyment: (7/10) I didnt really enjoy the whole anime I only felt like I wanted to watch more near the end beacuse it was then it got more exciting. I feel as though it would have been way more exciting if they didn`t have so many flashbacks and inner dialogs.\\n\\n\r\nOverall (8/10) The anime was good and an average anime that managed to keep my interest even if it wasn`t very enjoyable. I would reccomend this anime if you don`t really know what to watch or if you love sports anime.\\n\\n\r\nStuff unrealated to the review : My favourite character in this anime was Midosuji he was one of the reasons why I thought it was worth watching. He's a great character with alot of depth.\\n\\n\\n\\n\\n\\n",
            "date": "2015-08-25T09:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 197018,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515662.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CookieFudge",
                "username": "CookieFudge"
            },
            "url": "https://myanimelist.net/reviews.php?id=197018"
        },
        {
            "content": "High school is sort of that akward time for us all where we try to find out place in the world and try to make friends that have similar interests as us. For some it can be worse trying to accomplish this seemingly impossible feat. The main take away for Yowamushi Pedal is this:\r\nYou can conquer any challenge.\r\nStory 8/10\r\nThe story is about Onoda Sakamichi, a friendless Otaku who goes into high school with the hopes of joining the anime club to finally make friends. His hopes are crushed though when he finds that the club has been cancelled due to a lack of members. Ashe tried to revive the club he runs into Imaizumi and Naruko--first years like him who joined the bycicle racing club, and managed to convince him to do the same despite his fears that he really had no place in the world of sports. Here he meets the third years, who mentor them all to become the strongest, fastest, and best that they can be.\\n\\n\r\nMany can argue that Yowamushi Pedal is just a copy of Over Drive (because the plot is very very similar), but to me Yowapeda brings something a little different to the table, a weak character. Most sports anime/manga have the MC be really good, and kind of know it too. Since Onoda is weak and self concious of himself there is a very realistic feeling to the story--mainly the struggles and determination to become something great. It inspires me, and it makes me more involved with Onoda.\\n\\n\r\nThe anime pretty much follows the anime to a T--which brings up a major flaw--The pacing. The bulk of this anime is taken up by the Inter-High competition. You would think that with 38 episodes you could get through a relatively big chunk of this 3 day race out of the way. Well....sorry to say, but there is a reason why there is a second season. The last episode was left on a major cliff hanger, and for many who watched the series right as it was coming out found themselves to be severly disappointed and upset when the season ended in July and they found out that they had to wait until early October to continue the series.\\n\\n\r\nAnimation 9/10\\n\\n\r\nNow I definitely didn't get into Yowapeda for the art. The manga is rather brash with its art style and the characters often look disfigured when they are riding their bikes (Midosuji is a prime example). So I was really impressed with how well the animators did with cleaning it up. All of the characters are unique, with few characters being drawn to fit a particular stereotype (the three Sohoku first years are about it). My only complaint is that Imaizumi and Arakita are so similar looking that I had trouble distinguishing them in the manga.\\n\\n\r\nThe coloring is bright and colorful as is expected for it being made 2013-2014. However, it is not overly bright with \"sheen bubbles\" or a too exaggerated of a color scheme. It uses a straight forward color scheme to get the job done. The animation itself was pretty solid, which is always important in a sports anime.\\n\\n\r\nSound 9/10\\n\\n\r\nThe sounds was superb. It fit the moments perfectly, and was just enough to where is aided the emotion of the scene without overpowering it. Music has never gotten my heart racing as much as the soundtrack in Yowapeda. The three openings and ending themes were great too, which is unheard of coming from me. Normally due to time constraints I listen to the opening and ending once, unless one or the either was something special. I listened to all six theme songs without skipping them--I even have the soundtracks to listen to them all the time. \\n\\n\\n\r\nCharacter 9/10\\n\\n\r\nWhen you walk into a sports anime you're just basically counting the seconds until you see a major sterotypical character. And while Yowapeda exhumes the natural talent, elite and hot-head archtype with Onoda, Imaizumi and Naruko (respectively) they have their own quirks that really do make them unique. And what makes Yowapeda really shine are the character interactions. All of Sohoku really supports each other and works together to pull the team along (now whether this is efficient or not is neither here nor there).\\n\\n\r\nWhat's even more amazing with the close relationship they have with their rival school--Hakone High. They are supposed to be enemies, and I feel like with most sports anime I've seen, the rivals are just viewed as the bad guys to be defeated. In Yowapeda though the seniors all have a relationship with one another, creating the impression that these guys could in reality be friends--and even SHOW signs of friendship during the race. What's even better is that most of the characters in Hakone get their own little background story, so now not only do these guys have more demension to them, I actually care about them and feel for them!\\n\\n\r\nI love all of the characters in Yowamushi Pedal, they all bring something to the table to make the series enjoyable. Yes, even Midosuji, for as fucking creepy as he is, he brings spice into the competition.Ugh....so creepy\\n\\n\r\nOverall 9.5/10\\n\\n\r\nYowamushi pedal really is a great anime. Onoda is a very relatible character and the underlying theme is inspiring. Yes, the pacing is bad, but you'll soon forget it in the heat of the races, waiting on the edge of your seat to see who wins.\\n\\n\r\nNow if you really dislike sports anime, then I would probably skip over this. Because with the genere they try to take the sport and make it as cool and as awesome as humanely as possible. Other than that you should give it a try.",
            "date": "2014-11-24T09:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 169761,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/753557.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Risan07",
                "username": "Risan07"
            },
            "url": "https://myanimelist.net/reviews.php?id=169761"
        },
        {
            "content": "Personally I was never a fan of sports anime. They just didn't interest me what so ever. Free was okay but it wasn't my favorite, but then I found this masterpiece. Once upon a time I was in my dorm trying to find an anime to watch and i was on a manga fanpage on facebook and they posted a comparison meme of Imaizumi to Haru from Free. I saw in the comments the anime was called yowamushi pedal. I went on google and looked it up and I knew from just the summary I would enjoy this show. I never had so much funwatching an anime since I first got introduced to the genre as a whole. Now on to the technical stuff. \\n\\n\r\nStory: 10/10- The story itself is amazing. A lonely otaku who just wants to make friends and finds them in the most unique way, by riding a bicycle and getting noticed by someone on the racing team. Can I just say my favorite episode will forever be \"you are the princess\" The singing moment never fails to make me laugh hysterically I always go back to that episode when I just need a laugh when I am stressed. Another thing i love about this story is that you find yourself constantly routing for the characters for success. It constantly makes me have a fuzzy happy feeling inside me every time I watch it. \\n\\n\r\nCharacter: 11/10- Like I said, the characters made the show amazing. I constantly fell in love with this show because of the bonds with the characters. I actually kept on watching the show because Naruko and Imaizumi actually reminded me of Gray and Natsu from Fairy Tail constantly and made me laugh even more with the show. If I had to choose a favorite though it would be between Makishima and Toudou because i love their rivalry and comedic bonds with each other xD (SPOILERS AHEAD) \"Makichan don't ignore me!\" \"onada hes not important just ignore everything he tells you\"\\n\\n\\n\r\nArt/Sound: 9/10- the animation and music was good i particularly liked what they do with Midousuji making him so freaking creepy to the point where sometimes I forget I'm watching a sports anime not Horror. THE LOVE HIME SONG ITSELF IS 10/10 lol\\n\\n\r\n Overall: 10/10 - If you like me is curious about sports anime and don't know which one to watch as a start, watch yowamushi pedal. You don't have to be a sports anime fan to watch it. I definitely recommend this wonderful anime.",
            "date": "2016-11-08T11:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 233442,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/nylife1022",
                "username": "nylife1022"
            },
            "url": "https://myanimelist.net/reviews.php?id=233442"
        },
        {
            "content": "Let me preface this by saying that not only do I not watch sports anime, I hate sports in general. Nothing interests me less than athletic competition, especially since I find most sports to be horrendously boring (I'm not counting martial arts in the category of 'sports' here, or I'd find very little shonen I'm able to enjoy).\r\nYowaPeda is the exception to the rule, and boy what an exception it is.\r\nI almost don't really think of it as a sports anime, as it makes use of all the shonen tropes we know and love. Red Oni/Blue Oni, Hot Blooded heroes, plucky underdogs, and of course,Nakama Power. \\n\\n\r\nStory: 9\\n\\n\r\nThe series makes great (if frustrating) use of cliffhanger endings to help the story flow together. I was glad that I waited until this portion of the series was over to marathon it, as it flows so well from one episode to the next.\\n\\n\r\nArt: 8\\n\\n\r\nThe CGI is sometimes rather conspicuous, but it gets extra points for making use of shonen power-up sequences while being about racing bikes. \\n\\n\r\nSound: 10\\n\\n\r\nThe battle theme is catchy and gets in your head, and I defy you to watch this and not find yourself humming the theme to 'Love Hime', a fictional anime that the main character loves.\\n\\n\r\nCharacter: 10\\n\\n\r\nOnoda is a great main character, overcoming the odds in the traditional shonen fashion. It also helps that he starts out as an otaku with no interest in sports or bike racing, but has built his stamina up from years of biking 60 kilometers to Akihabara and back on his single-speed 'momma bike'. The villain of the Inter-High is the creepiest SOB you'd ever want to meet, and just begs to be punched in the face. \\n\\n\r\nEnjoyment: 9\\n\\n\r\nLoved this anime from start to finish, and the ending segments are not to be missed.\\n\\n\r\nOverall: 9/10",
            "date": "2014-11-30T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 170515,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=170515"
        },
        {
            "content": "Bicycling anime! Onoda is a nerdy otaku who plans on starting a school anime club until his natural talent for biking is discovered, and then he and his new friends Imaizumi and Naruko bond over a love of bike racing. I love the rivalry/friendship between Imaizumi and Naruko, how they’re determined not to lose to each other and yet are bound together by their mutual interest in taking care of Onoda. What an adorable trio: they work so well together. \r\nOnoda is completely loveable with his glasses and his “mommy bike” and his anime; I burst out laughing every time he sings his princess animetheme song (and the scene with Tadokoro in episode 33...oh my God, that was hysterical).\\n\\n\r\nThere is so much to love about this silly and fun anime: the comically overly-serious characters (“Abs!”), the humor (I really enjoyed the scenes after the credits on each episode), the bright and colorful art, the cute songs, the importance of friendship and teamwork, the strange and weirdly terrifying antagonists (Midousuji). But most of all, to quote the coach, the anime’s charm is how its protagonist represents “the fundamental joy of cycling.”\\n\\n\r\nCan’t wait until season 2 of this anime comes out in October!",
            "date": "2014-06-30T19:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 149699,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=149699"
        },
        {
            "content": "\" Hime Hime Hime, suki suki daisuki Hime Hime, kira kirarin\" -I already love this anime song. \r\n9/10 \r\nThis anime is simply all about getting out of your comfort zone and experiencing the world on what it has to offer. However,  Sakamichi Onoda is awkward , appearance wise is not so good and has no friends. And just because of a habit he continuously does changes him as a character and his life. From a reader's point of view, I already love his genuineness which other characters do as well.\r\nThus I advise everyone who loves generally anime to try this anime out. As thecharacters develop and your there experiencing this whole process...it is truly amazing.Furthermore, the anime interestingly questions you as a person on your habits and interests by getting out of your comfort  zone and taking on challenges and having FUN! \\n\\n\r\n\"It's fun climbing together!\" - Sakamichi Onoda",
            "date": "2014-11-29T02:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 170291,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4273583.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeDevotee",
                "username": "AnimeDevotee"
            },
            "url": "https://myanimelist.net/reviews.php?id=170291"
        },
        {
            "content": "Story: (8/10)\r\nThe storyline is common for a sports anime but it is done better than others. It has more strategy (fewer super-powers, when they do exist they are properly explained and make sense) and better setup than any other sports anime I have seen. \r\nArt: (7/10)\r\nArt can be good at times are better at others, the background can either be breathtaking or decent, the character art looks great and gets better the farther in you go.\r\nSound: (10/10)\r\nWonderful OPs and EDs, you will want to re-listen to all of them. Voice acting is great, really in-character and fits the characters well. \r\nCharacters: (8/10)\r\nSome cliches but thereis real character development and the cliches are thrown away (and not overnight, they actually have reasons for their character development)\\n\\n\r\nEnjoyment: (10/10)\\n\r\nThis show is so fun to watch and isn't hard to keep up with. It has real tense moments, and there isn't just fake tension where the MC just wins no matter what.\\n\\n\r\nOverall: (10/10)\\n\r\nThis is by far the best sports anime I have ever seen and would HIGHLY suggest watching it!!\\n",
            "date": "2017-05-22T09:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 248287,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6003298.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GuyWRunningShirt",
                "username": "GuyWRunningShirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=248287"
        },
        {
            "content": "Oh, the story of the underdog.\r\nOnoda is a total otaku that finds his true calling as a road racer climber. Through his high school bike club, he meets friends and rivals, and begins his journey as a road racer.\r\nI particularly love shounen sports manga because they are so much fun. And there is something to be said about an underdog to comes out on top. You can't help but hope and pray they make it. And yes, part of the enjoyment is finding out how they do it.\r\n2/3 of the first season sets the stage: we find out how Onoda is dragged into this worldand his training as a road racer. We begin to meet rivals and friends and see subtle moments where Onoda's mysterious power as a climber come out. The last 1/3 begins the Interhigh competition and I enjoyed this part the most. We've got interesting characters and rivals, some flashback moments delving into character backgrounds (but personally, I enjoy the racing action more). Also, (and this is the problem with most cowardly underdogs) I got a little annoyed at Onoda sometimes. Grow some more and man up! I do hope that story-wise, Onoda will learn from his mistakes and they wont play the catch up game so much any more. \\n\\n\r\nIn terms of road racing in general, I feel like this anime does a great job of explaining that sport, what each different type of racer does, and how to work as team in a road racing tournament. Not that I knew anything about road racing before. But now I can say I know what a climber does, what a sprinter does, so on and so forth. And I have to say that is something I have come to expect from a good shounen sports manga/anime especially if it's about something I'm unfamiliar with. By the end, I should have learned all the rules and details of the game/sport and enjoyed learning about it.\\n\\n\r\nThe art style and music raises the excitement during race scenes. The art style in particular adds to the action scenes, color, slants, emanating waves of bursts of power. It definitely has an edge over another road racing anime, Overdrive, in this respect. Sometimes though, the action effects might get a little over the top but thankfully, not to the extent that Prince of Tennis does (yes, I love PoT too but come on guys, Cyclone Smash?). The music and voice actors are also well chosen. \\n\\n\r\nMy absolute FAVORITE episode? Episode 33 - \"You Are the Princess\" / \"Hime nano da\" / ヒメなのだ\\n\r\nOh my god. I have not laughed so much in a while. Tadakoricchi's face here. The Hime song. Everything put together had me laughing hysterically.",
            "date": "2016-06-22T13:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 221529,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493455.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yumenokotoba",
                "username": "yumenokotoba"
            },
            "url": "https://myanimelist.net/reviews.php?id=221529"
        },
        {
            "content": "My Rating Model: 7/10 ~ MAL Rating Model: 6/10\r\nNote: To say one needs an athletic disposition to enjoy Sport-Genre anime is quickly proved wrong in the first few episodes of Yowamushi Pedal. In fact, I believe the very foundation of Sport-Genre anime is what creates strong character-building. Stories that challenge the very nature of rejection vs. achievement is what allows Champions to be born. \r\nFor what starts off as an entertaining anime quickly turns into an unbearable mental test - rather a test of your durability in patience & suspense. I'm fairly disappointed with what began as a 9/10 story but for me - endedat 4/10. If i may alike it to any analogy I'd certainly pick One Piece or the Freeza Ark of DBZ where a single event/fight/challenge is stretched-out frustratingly long. I dare say i enjoyed the first half of the anime as much as Hajime No Ippo or the 'Major' series but it became quickly evident that this anime will only continue to force flashbacks and cheap suspense driving devices. \\n\\n\\n\r\nI'd HIGHLY recommend this anime for anyone with mental patience - who's happily satisfied in watching 3 hours of a 'complication/event' where not much worth noting transpires. \\n\\n\r\nThough, if this is your first Sport Anime i'm sure it will be either a Hit or Miss - though i'd recommend the first season of Hajime No Ippo 10/10 times over this. \\n\\n\\n\r\nMy Rating Model [Beta]\\n\r\n1.\tStory 6/10 \\n\r\n--1.1.\tPlot (60% of Mark) = 6.6 \\n\r\n1.1.1.\t+Opening [9/10]\\n\r\n1.1.2.\t+Conflict [7/10\\n\r\n1.1.3.\t+Resolution [4/10]\\n\r\n--1.2.\tPacing (20% of Mark) ~ Criteria (1/4 is dragged on, 2/4 is not bad/good, 3/4 is good, 4/4 perfect)\\n\r\n1.2.1.\tDragged On [1/4] ~ ratio to 20% = 0.5/10\\n\r\n--1.3.\tSetting (20% of Mark) = (1/4 lifeless, 2/4 non-fiction, 3/4 innovative, 4/4 alive) \\n\r\n1.3.1.\tNon Fiction [2/4] ~ ratio to 20% = 0.8/10\\n\\n\r\n2.\tCharacters 6/10\\n\r\n--2.1.\tCharacters 6/10 ~ Criteria (5/10: Empty, 6:10 Generic, 7:10 Generic/Original, 8: Original, 9: Original/Relatable/Engaging, 10/10: Wouldn't have it any other way) \t\\n\r\n2.1.1.\tThe overwhelming majority of Characters were Generic and without appeal, very few exceptions to this rule existed. \\n\\n\r\n3.\tArt 4/5 (Catalyst to PLOT / marks are slightly relative) \\n\r\n--3.1.\tRepetition (20%) Flashbacks/Filler Art ~ How often were the exact same blueprints used: Too Often, 1/3: Often, 2/3: On Occasion, 3/3: Never)\\n\r\n3.1.1.\t0/3 ~ 0/5:  Sadly I began counting episodes that DIDN'T have repeated art. Especially Point of View renditions of the road-ahead. That was consistently reused.\\n\r\n--3.2.\tColoring (20%) ~ How well did the coloring build Mood: 1/4: Rarely, 2/4: Sometimes, 3/4: Frequently, 4/4: Always.\\n\r\n3.2.1.\t Sometimes 2/4 ~ 1/5\\n\r\n--3.3.\tMood - (60%) ~ Specific to each mood presented - ie ~ Each mood is identified and to interpretation - marked with either Sympathy (care) or Apathy (don't care). \\n\r\n✔ Melancholy - Through use of the scenery, shading and coloring the artists successfully captured the sense of hopeless/futility in the characters.\\n\r\n✔ Passion - Many 'moving' cut scenes between hopelessness vs. hope to which the artist's rendition of a 'desperate' facial expressions - really helped established. \\n\r\n✔ Devotion (friends) Specifically Onoda's animation (expression) created genuine Sympathy and Cheer for the character.\\n\r\n3.3.1.\tFull Marks:  Cared about 100% of Mood presented ~ 3/5\\n\r\n3.3.2.\t✘ -/+ Extra mark [Use of Allegory] N.A\\n\\n\r\n4.\tSound: 5/5\t\\n\r\n--4.1.\tOpening/Ending Sequence (5%) My only criteria is Annoying/Not-Annoying :L\\n\r\n4.1.1.\t Not-Annoying - Full Marks\\n\r\n--4.2.\tSubtitles/Dub Quality (45%)\\n\r\n4.2.1.\t Subtitles 9/10\\n\r\n--4.3.\tMusic Theme/s (50%)\\n\r\n4.3.1.\t Full Marks just because of the 'Love Hime' song Onoda sings ;) \\n\r\n4.3.2.\t✘ -/+ Extra mark [Use of Allegory] = Did i hear any goddamn Cicada's ... dammit lol - only Japan's obsessed with these annoying pests. I'd love to see Mood/Atmosphere created without Insects for once. N.A\\n\\n\r\n5.\tOverall 21/30 ~ 70/100 or 70%\\n\r\n5.1.\tLetter Grading: C –\\n\r\n5.1.1.\tGrading Key:\\n\r\nA = 90 (-) > 99 (+)\\n\r\nB = 80 (-) > 89 (+)\\n\r\nC = 70 (-) > 79 (+)\\n\r\nD = 60 (-) >69 (+)\\n\\n\r\n6.\tMAL Rating \\n\r\n--6.1.\tDisclaimer\\n\r\n6.1.1.\t To cater for MAL’s unquantifiable ‘Enjoyment’ category – in conjunction with their naïve category balancing – I apply a handicap of 1 point to each score. While this may serve (at times) as counter-productive in rating 10/10 or 9/10’s with due credit; the overwhelming majority does not fall into this margin. In doing this, it’s my hope to fairly handicap all anime so as to ensure a fair – non-biased score and no ridiculously high scores for generic anime. It’s my belief that stricter methods have to be established to ‘level-out’ the reckless ratings on MAL’s. \\n\r\n--6.2.\t7/10 – 1/10 = 6/10 MAL \\n\\n",
            "date": "2017-02-10T21:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 240328,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5986201.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Willow_Folk",
                "username": "Willow_Folk"
            },
            "url": "https://myanimelist.net/reviews.php?id=240328"
        },
        {
            "content": "One thing I love about Yowamushi Pedal is that you don't have to be a fan of sports, sports anime or cycling to fall in love with the anime. The characters are all interesting and you grow to love them and hate them in your own kind of way. \r\nI find this anime funny, fun to watch, interesting and awesome. It's one of those anime's that'll keep you on edge during the races and give you feels when you see one of your beloved characters win or lose. If any of you guys like Kuroko No Basket then you will deffo love Yowamushi Pedal, Iwasn't sure at first as i'm not a big fan of cycling but trust me I absolutely loved it and now it's one of my favorite animes that i'll happily watch again ^^ until the new season comes out.\\n\\n\r\nHonestly it's worth giving it a watch, i'd say give at least 4-5 episodes a shot and see what you think :) but you'll be missing out! it's cycling in a completely different way, it's fun and cool for a start! So cool that I'm planning on cosplaying Imaizumi and Manami from it! Don't just take my word tho! Get going and check out Yowamushi Pedal episode 1!!",
            "date": "2014-07-24T11:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 153531,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3707261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RaveMasterHaru",
                "username": "RaveMasterHaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=153531"
        }
    ],
    [
        {
            "content": "Yowamushi Pedal is just your regular sports anime. As this is my first time trying to review an anime, I am just going to give it my honest opinion on it. As someone who is a fan of sports anime's in general, I find that Yowamushi Pedal is probably the best bicycle racing anime. But that doesn't mean that it was amazing. Anyways lets jump right on in (Warning, Minor Spoilers)\r\nStory: 7\r\nI actually thought the story was very original in some unique aspects. Even though it is your classic talented individual (Sakamichi) who never recognized he had a talent for bicycle racing, I thought thatthe beginning was a very good refresher. I also enjoyed the development of his skill. He was already pretty good to begin with and the training throughout the series made him into a pretty decent racer. The only thing that I did not like about the story and the episode structure is that some parts that only consisted of like 200m for example took around like 15 minutes. I found that to be quite annoying at times, perhaps because I wanted that scene to finish and get rolling on the next action scene, or I was just simply impatient/frustrated.\\n\\n\r\nArt and Sound: 7\\n\r\nI think that this is just a regular anime when it comes to Art and Sound. There is nothing special about it. Like I said in the beginning, I find it to be your classic sports anime. I didn't think that there was anything that stood out (either very good or bad). \\n\\n\r\nCharacter and Enjoyment: 8/6\\n\r\n I found that the characters seemed to be pretty cool except for a couple. One that had seemed really underdeveloped throughout the series was Makishima. I thought that since he was the climber that worked with Sakamichi, I thought they would go way more in depth into him than any other character. Turns out that wasn't really the case and we saw all of the upperclassmen have flashbacks of their own. My enjoyment factor was a 6 because of the scenes that sometimes took 15 minutes for like 4 seconds in the actual race. Even though they were intense, I just found these episodes to kind of be a waste of time. \\n\\n\r\nOverall and Conclusion: 7\\n\r\nI would honestly recommend this anime to anyone who is interesting in learning about bicycle racing and the sports genre in general. I think that it brings something new to the table since there aren't that many bicycle anime's anyways. Any time that I watch one of these sports anime's I always get a drive to be active and be fit as I am a runner myself. \\n\\n\r\nFinal Quote: \"Victory won't just fall in your lap. It's something I've learned through my victories and losses\" - Tadokoro Jin\\n",
            "date": "2018-10-10T22:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 291459,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7046619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/icekoolkr",
                "username": "icekoolkr"
            },
            "url": "https://myanimelist.net/reviews.php?id=291459"
        },
        {
            "content": "By episode 25, I have to say I've dropped this show for good. It's just a waste of time. This could be an entertaining show if you're a noob in anime. But for those who've watched anime for like, 10 years and more, this was just a rehashed of the elements of shounen-types with all its stereotypes.\r\nI watched this because I just got myself into the venture of cycling. And I did my research and could tell the hybrids, MTBs, and road bikes apart; and cyclocross, and touring, and brands like Specialized, Giant, Trek, Cannondale, Cube, KTM, Boardman, and more.\r\nWhat you get here is thesame vibe when watching Initial-D, Prince of Tennis, then character stereotypes found in Slam Dunk, and add some slight yakitate!Japan-type of humor in the mix, for a theme of cycling, and that's it for Yowamushi Pedal. The story is predictable and mediocre, you'll get a weak but not epic protagonist. Gurren Lagann already smashed the \"weak protagonist\" with Simoun, and thus no other anime might come as good, not until two decades or so.\\n\\n\r\nArt is okay, I'm not mindful about the art, whether it's as fluid as KyoAni's, or intricate as CLAMP's; or quirky as PingPong; or epic as Kill la Kill or Gurren Lagann; as long as the story is befitting to waste time, art would be the last thing on my mind.\\n\\n\r\nSound is alright.\\n\\n\r\nAgain, for the characterization, you'll have a weak character for a protagonist, a quite arrogant second-placer deuteragonist, then some bishoujos on the sides reminiscent of Initial-D or other shounen anime (Saiki-K maybe? But that anime's epic, and this one isn't) ; some dude that reminded me of another dude in Akame ga Kill, in fact, the cast here kinda reminded me of Akame Ga Kill, and I last watched that show in 2016. It's all a set of varied, BUT predictable characters at best. So what charactrerization you've seen here, I'm sure you've seen them elsewhere.\\n\\n\\n\r\nEnjoyment... right. I was thinking it'd be like Initial-D on bikes, like I get to know what Specialized is and all that, but it is none of that. I should have just watched ESPN, or Long Riders if I was aiming to get the fancy delivery of bicycles and its parts and those.\\n\r\nStill, you still get those flashbacks as the action was about to progress, and some backstories that we've seen on other anime. But well, can't help it. At most, this is a generic, rehashed elements molded into a different story of road-cycling. \\n\r\nOnly SAO and its cousins (like Rei-Zero) are the type of anime I'd hate more; and this is me who's a fan of Gen Urobuchi-type of anime (Fate/Zero, Puella Magi, Psycho Pass, those kinda).\\n\\n\r\nOVERALL, well, you watch this and be entertained and love this because you're a noob on the realm of anime. \\n\r\nMaybe you still haven't watched DeathNote and would freak out once you've seen it---like it's the best anime evur; then you'd have a high-blood pressure and atrial fibrillation when you watch Attack on Titan, and get a brain aneurysm when you watched Psycho Pass.\\n\\n\r\nBut if you've watched the type of anime where more than half of them are NOT mainstream, then you can waste your life on something else, like go have a real cycling around town. \\n\\n\r\nGet a bicycle of your preference (hybrid, MTB, road, BMX) Specialized, or Giant, or Trek---you'll never be wrong with any of these three brands. :) Cube, Whyte, and Orbea are also great enough. Scott, and Marin are like... on the third-tier.\\n\\n\r\nGet a reliable cycling helmet--- Kask, Giro, or Specialized;\\n\\n\r\nthen get a strong, robust bike-lock: Kryptonite, or Abus brands if you still want to find your bicycle where you left it off (and lock it properly and correctly, no bike-lock is infallible to a dimwitted owner). \\n\\n\r\nAnd that's it, you go cycling instead than watch this crap.",
            "date": "2018-09-15T12:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 289077,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=289077"
        },
        {
            "content": "Let me tell you one thing, I watched this whole series while biking, in about 3 days. I can't even describe how much it helped me bike faster and for a longer amount of time. If you have a static bike or a base for it, I strongly recommend watching this anime.\r\nThe story itself is very inspiring at first, even though they make it seem like people with \"mom bikes\" are aliens. After the 7th or so episode, we stop seeing significant character evolution but it's still kind of good.\r\nI really hated how the focus goes from a critical point for the main character tosomeone else and we don't get to see what happened to the main for 2 whole episodes. That purely depends on you but I wanted the main character to be under the spotlight more. \\n\\n\r\nI was surprised by how they would talk about details only people who really like to bike know and they just forgot about basic physics. For example, I have never, not even once, seen a person biking and looking where they're supposed to. They will either have their eyes closed, look at the bikers next to or behind them... a whole mess overall. Also, there's a guy that rides the bike like he's a windscreen wiper... for some reason. \\n\\n\r\nOverall, the anime is very funny and very inspiring, however, I feel like many people will find it very boring. If you do, bike while watching it. Trust me on this.",
            "date": "2018-05-27T06:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 281480,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3491421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TACOSHIP",
                "username": "TACOSHIP"
            },
            "url": "https://myanimelist.net/reviews.php?id=281480"
        },
        {
            "content": "It's not the best anime, I know, but it has made me feel so much during the 2014, that's why Yowamushi Pedal it's one of my favorite animes.\r\nIt introduce us a history where an otaku guy,Onoda Sakamichi it's his first year in high school. As it's a new school he wants to make friends with common interests but instead of achieving that he joins the cycling club.\r\nWhat I like so much about this anime is how it can make us have interest about what's going on and it's not a predictable shit like Kuroko no Basket where we see the Seirin Team always winning. Herewe see a main team who has trained but doesn't always win in the competetions that were implemented during the Inter High. It also has a lot of emotions and we can feel the empathy that is put in the characters even if I didn't felt much as the series pass\\n\r\nOther thing that I liked and surprised me were the characters. Most of the characters were like so weird, something I've never seen before. The designs were kind of original which made me have also an interest in watching it. They don't behave very much like we humans do: for example, there is this eyelashes guy called Izumida who is always saying: ABU ABU while he is cyclying. That isn't a very well common human behaviour.  But what I most liked was Midousuji's character....It has a lot of mystery, feeling and even if he is a creepy monster (believe me he is, he has a lot of unrealistic acts and can get really scary) we can see that he is a individual who has emotions and wants to win so bad for his own satisfaction (Yes, he is very individualist) because that's what makes him feel happy. It's a very deep character and I love characters that has like a mystery around them as I want to figure more things about them as the anime goes by. But I have to admit that I've never seen a character like Midousuji before he is the most weird of all but at the same time I can see what he has been trought and I can understand him as well.\\n\\n\r\nBut even if it has its things that I liked a lot there are things which I didn't liked. For example, the FLASHBACKS. This anime makes an abuse of constant flashbacks. A flashback can be nice when you want to know the character's childhood and why he is like that now. It's cool that every character has a flashback but there were times which they were very heavy. But I have to admit that the flashbacks in the first season weren't like the second season, which the last one I mentioned was very bad aranged and they repeated lots of flashbacks from the first season.\\n\r\nOther thing which was very irritating was the time of the race. For example, we have to wait like 10 chapters in 500 meters for the characters to arrive. Unfortunately, this gets worse as the Inter High is about to finish.\\n\\n\r\nSo overwall, the first season of Yowamushi Pedal is very good. It may be a little boring for you at the beggining but when the Inter High starts you'll want to watch all the rest of the episodes. I have to say that is not a typical sports anime for me and I enjoyed this season a lot. The Inter High doesn't finish here so you may have to watch the following season which is worst as I said before but at least it does brings you more information about Midousuji's character. \\n\\n\r\nAnd now that I think about it, maybe the anime doesn't deserve an 8 but I can't be objetive with it.  I love Yowamushi Pedal and I can rewatch it a lot of times and never get tired of it. Thinking about it, we all have this anime which may not be the best for a lot of people but we love it anyways, that's how individual tastes are in my opinion.\\n",
            "date": "2016-03-14T19:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 212956,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4026357.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sangss",
                "username": "Sangss"
            },
            "url": "https://myanimelist.net/reviews.php?id=212956"
        },
        {
            "content": "i am a big fan of sports anime, so im always looking for one, then i found yowamushi pedal. the first episode really took me away, it was really cool and made me say \" this anime's really interesting!\" \r\nSTORY-10 \r\nit follows the usual shounen-sports routine where a seemingly ordinary hs boy was introduced to a particular sport (in here it's biking) which he knows little about. he eventually starts enjoying the sport, becoming dedicated and meeting lots cool people (interesting characters). it has a nice-warm atmosphere which is common in shounen animes.\r\neven though it follows the routine, yowamushi pedal has its own uniqueness makingit different and more exciting from other sports anime. There is never a boring part and it'll always wanna make you crave for the next episode.\\n\\n\r\nART-7\\n\r\nfor me the art was just good, since i saw better art in other sports anime like Kuroko no Basket. It was colorful and i like the character designs but it can still get better, it's maybe the own art-style of the mangaka. The animation itself is good since it wont satisfy a sport anime fan like me if the animation is sloppy, right?\\n\\n\r\nSOUND-10\\n\r\nthe sounds used are perfect for the specific situations in the anime. It made me even more interested and eager to watch, making every scenes more exciting.  Especially the opening and ending songs, they were really cool, i've downloaded and keep on listening to them. \\n\\n\r\nCHARACTER-10\\n\r\ni like the characters, especially the main, Onoda, there's always something new to him and you know that he's gonna do something but you can never know how he'll do it. It always made me cheer \"Zoom past all of them!\". Even though he's shy and doesn't know anything, he's very determined and has a knack for the sport. you can also see his steady character development how he, slowly but surely gets stronger and continue to amaze the people around him. \\n\\n\r\nThe sohoku bicycle team guys are cool too, especially makishima, i dont know why i lke him so much, there's a certain charm about him. I kinda like Naruko too, he somehow reminded me of Natsu of Fairy tail (i love Natsu) and then imaizumi kinda reminded me of Sasuke (i like sasuke too).Then, there's Manami, he looks so cute and cool to me, it made me cheer for hakogako though they're enemy team.\\n\\n\r\nThe characters are well introduced and you can see the character development on each of them. you can also see their past history.\\n\\n\\n\r\nENJOYMENT-10\\n\r\ni really really enjoyed this anime to the point that i've watched this 3 times already and im stiil planning to watch it once more! even though i already knew what was going to happen since im updated in the manga, i still wanna see it in motion. this anime also made me wanna learn how to bike, and i can bike now, but i cant apply their techniques, im a beginner and it seems dangerous. It made me realize the joy of biking and the joy of being one wiht nature\\n\\n\r\nOVERALL-10\\n\r\nit is really exciting and i highly recommend it! especially to sports anime fans out there this is a must watch and to those who just wanna have fun, it is definitely worth your time and i bet it'll make you into a sports-anime fan!\\n",
            "date": "2015-04-01T02:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 184354,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4330775.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ayashirofume17",
                "username": "ayashirofume17"
            },
            "url": "https://myanimelist.net/reviews.php?id=184354"
        },
        {
            "content": "Warning: You are about to read a long review because there is so much to say about this extraordinary anime. \r\nStory = 10: Geez oh peez, from the get go this anime grabs the viewer's attention with a refreshing and unique start. The MC, Sakamichi Onada, is a border line otaku who is completely inept at sports but somehow ends up joining his high school's Bicycle Club. What's different about Yowamushi Pedal is that unlike other shonen & sports anime the story is not centered on the MC but rather on the team as a whole. In fact, the MC is not even the mostimportant character nor is he the strongest member of his team. However, Onada's personal development is particularly enjoyable to watch because he had such a humble beginning. Moreover, unlike the majority of MC's in sports anime, Onada remains comparatively weak until the end and loses many of his battles. But he is able to use his fierce passion for biking to overcome obstacles and beat strong opponents with a bit of help and support from his teammates. \"If you can't overcome the obstacle in front of you, there is no future.\" Lastly, another interesting feature of the story line is that the Inter High tournament for cycling is three days long. Anything can happen within that time span and unexpected battles occur during every stage of this competition. \\n\\n\r\nArt = 9: When I first saw the MAL profile photo for Yowamushi Pedal I was turned off by the childish/cartoonish art style which is why I've put this anime on hold for so long. But upon starting the series I've come to realize how exceptional the art is. Incredible care and attention has been put into drawing the characters so that no two look the same and each has their unique features. From the dorky glasses and the pathetic maroon tracker's pants that Onada wears when cycling, to Makashima's ridiculously long green hair (which is totally unsuitable for biking at high speeds), and that one buff guy with girly eyelashes who named his pecs Andy and Frank, Watanabe Wataru has truly outdone himself in creating quirky, one-of-a-kind characters. Although some may criticize this anime's aesthetics, I personally believe that art is magnificent if it is able to leave an impression rather than merely fascinate viewers. I've watched many beautiful anime and have seen many more characters with stunning visuals, but few were memorable. Although none of the characters in Yowamushi Pedal are attractive, many are unforgettable because of their creative and unusual characteristics. \\n\\n\r\nCharacters = 10: In my opinion the characters are the most important component of an anime. Many of the characters in Yowamushi Pedal are a breath of fresh air. For starters, Onada is not your typical MC. The writer couldn't have come up with a character who is more unlikely to become a bad-ass cyclist. Onada is a clumsy and pathetic guy whose obsession with anime is quite hilarious and endearing at the same time. As the story progresses Onada develops a fierce passion for road racing and his weak/pathetic nature is forgotten as he learns to face challenges and gradually overcome his limits. Prior to watching Yowamushi Pedal I've never really liked any of the MC's but Onada took me by surprise, and before I knew it this shy, hardworking otaku had taken a permanent spot in my heart. My favorite character in this anime, however, is Yuusuke Makishima. I love eccentric characters and there is nothing ordinary/normal about Makishima. His appearance is highly unusual (i.e. Makishima looks like a drag queen with his long, lush green hair and his disturbing moles) and he has this weird but wicked cycling technique called \"Peak Spider.\" Not only that, Makishima comes off as a creep due to his awkward and unsociable personality. However appearances aren't everything and the viewers will soon adore the person Makishima is within. \\n\\n\r\nEnjoyment = 10: One of the main reasons why I gave Yowamushi Pedal a nearly perfect score was because of the director's ability to keep me watching until the end. It should be noted that most shonen/sports anime have a predictable plot which inevitably end ups becoming repetitive and boring to watch towards the middle or end of of the series. In addition, anime of the shonen genre have an annoying tendency to introduce ridiculous deus ex machina plot twists to superpower its MC and allow him/her to overcome insurmountable obstacles, which takes away from the overall enjoyment. However, Yowamushi Pedal avoids these (traps) by keeping the viewer continuously delighted and entertained throughout the series without having to introduce never before seen powers. This anime's pacing was marvelously executed and it effectively incorporated creative plot twists. There was never a dull moment in Yowamushi Pedal; in fact this will be the third time I've completed an anime from start to finish without skipping any episodes. I thought Haikyuu! would forever be my all-time favorite sports anime but Yowamushi Pedal has now taken the #1 spot. \\n\\n",
            "date": "2016-06-25T12:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 221882,
            "reviewer": {
                "episodes_seen": 33,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4784272.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/eccentric4u",
                "username": "eccentric4u"
            },
            "url": "https://myanimelist.net/reviews.php?id=221882"
        },
        {
            "content": "Story 10: Yowamushi Pedal is a sport anime. Generally speaking, this is not my type because the genre I usually watch is either mystery or action. But because of my curiosity of this anime, I give a shot for this. This is a cycling-based sport anime and I thought it is a boring one because it is just about pedaling a bicycle but this anime exceeds my expectation. The story is about an otaku first year student who wants to join anime club  however the anime club in that school was abolished due of lack of members. As the story goes, he met somepeople who help him polished his hidden potential which is cycling. As I continue watching this, the intensity I feel is rising every episode. A lot of intense episodes which drawn me into its world. I feel like  I am one of those spectators. Overall, the story itself is very good and well-written also a lot of lessons about sportsmanship and friendship can be learned from this anime.\\n\\n\r\nArt and Sound 10: The art and sound of this anime is also good because it feels realistic. \\n\\n\r\nCharacter 10: Characters in this anime are all well-developed. They are very hilarious and they are very funny in the after credit scene. I'm glad that they made a short scene after credits because that can ease the intensity of every episode. On the other hand, aside from the main characters, the other characters are consistent throughout the series. The main characters are developing every episode and they are too good. The timing for developing the potential of each main character are well done. \\n\\n\r\nOverall 10: Only two words that I can say to this series. \"INTENSE\" and \"RIDICULOUS\".\\n",
            "date": "2015-12-18T01:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 205884,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5048766.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DocOtonashi",
                "username": "DocOtonashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=205884"
        },
        {
            "content": "I love watching sports anime and I can't believe I missed this!! Just recently watched it still in ep 12 though..and really enjoying this show. To think that simple things you do everyday may become one of your talents and that's how this show was.. Onoda who is bad at P.E is now capable of being in the cycling road race because of his eagerness to save money and rather bike 90 km than ride a train just to buy his favorite capsule toy. \r\n I also love the other characters because it was unusual how they treat him, I thought they would look downon him but instead they give him help and courage that he can do it. \\n\\n",
            "date": "2016-11-27T23:33:00+00:00",
            "helpful_count": 0,
            "mal_id": 234530,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5758820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shikizhiu",
                "username": "shikizhiu"
            },
            "url": "https://myanimelist.net/reviews.php?id=234530"
        }
    ]
]