[
    [
        {
            "content": "Guns, war, violence, deals, allies, enemies, and loyalty. What do all these words have in common? If the word, “sequel” also pops into your mind, then you guessed right because Jormungand gets a season 2 and rightfully deserves it! Jormungand: Perfect Order returns with Koko Hekmatyar along the alpha crew in this sequel and presents what they do best: making deals and kicking ass.\r\nJormungand: Perfect Order is the direct sequel of the original series, Jormungand that debuted a few month after its original ending. The sequel is written by the same author Keitaro Takahashi with White Fox handling its animation and Geneon doing the production.The series continues off from its prequel and follows Koko Hekmatyar along with her fellow crew including Jonah.\\n\\n\r\nTo refresh some things, Koko still plays her role as a young arms dealer. She retains her independent personality that can be seen as playful, cunning, deceptive, but at the same time also ruthless when the events calls for it. Her profession remains dangerous as it's not only involves dealing with other armed individuals but the fact that it's technical illegal under normal jurisdictions. As such, Koko often comes in terms with conflict where it's least expected. Luckily for her though is her crew and Jonah who are always by her side to support her work. \\n\\n\r\nThe series continues to follow a journey type of scenario. In this sequel though, the story enhances itself with its development especially in the latter half regarding the Jormungand project. But besides that, other supporting characters gets highlights even from the very beginning such as Hex and R. In fact, this focus on more supporting characters works out for the better as we can see more development from others besides just Koko and Jonah. Unfortunately though, their times are short due to the length of the series. Yet, their moments in the series captured their highlights well and expresses just how dangerous the world of Jormungand can be.\\n\\n\r\nThe dynamic duo of Koko and Jonah once again becomes entertaining to watch. At first, it's lighthearted and comedic with the usual raccoon-like expressions from both characters. Later on though, we get a bit more serious as Koko reveals her plan for world peace but not without a cost. This cost will result in both physical and emotional pain as Jonah views Koko's ways of executing her actions as a bit more immoral. She is an arms dealer who deals with weapons that causes destruction. Yet at the same time, she wishes to end destruction to the world and bring world peace. This all comes at a cost.\\n\\n\r\nLike its original series, Jormungand: Perfect Order does pack the action including those road war and full throttle shootouts. Most of happens quite fast and captures the violence of what being an arms dealer is all about because it's a dangerous profession. As result, expect blood being spilled, alliances shattered, and even deaths. At times however, the series slows with what almost seems like fillers such as the episode with Dr. Miami. But the story of this sequel progresses well with its pacing. Despite some of the slow movements, it gets to the point especially later on when  Koko's brother, Kasper gets involved with the crew. He is the man that Jonah loathes because of what happened to his past. Yet in this season, a strange alliance later forms between them that shows how far some characters have come in the series. Let's not also forget Chequita who represents herself as one of the most proficient bodyguards known in HCLI with her skills in handling armed weaponry.\\n\\n\r\nThe business of trading weapons are still present but seems to rather diminish a bit in this sequel. Luckily, it retains its realism and that being the modern times and military gadgets. The fighter planes, anti-aircraft weaponry, and rockets are all realistic and present in today's real world. Similarly, the characters themselves are depicted with realism. The way they are dressed for their profession and their skills of handling various weaponry are often presented in the series. As such, their skills are protrayed as well in handling such weapons with various skills levels between each crew member. To add on the fun part of the mix are the priceless expressions in the form of those grins, smiles, and laughs curtsey of Koko with her crew. \\n\\n\r\nThe series also continues to the idea of teamwork and how it is crucial for its members to cooperate in order to succeed in missions. In the latter half of the series, Jonah is presented with a situation where the idea presented to him isn't what he likes to hear. As such, a strain sorts is put between him and Koko. It is a bit sad to watch given everything we've seen between the likeable duo especially since the  bond is not romance but as loving partners.\\n\\n\r\nIn terms of artwork, I would say that White Fox does it again and that means a clear job on the animation department. As mentioned before, the series takes place in modern times and everything is drawn to match its themes. The characters' and their outfits fits within their professions coupled with their figures that show why they are part of the crew. Although it looks a bit dirty at times, it works out right and portrays Jormungand: PO at its finest. I appreciate it and White Fox deserves some praise.\\n\\n\r\nThe soundtrack is once again well performed by the choreographer of the series, Taku Iwasaki. He has already done work in related fields such as Gurren Lagann, R.O.D. The TV, and Soul Eater. All of these series have in common with the soundtrack involving fast paced action during intense scenes. The rap beatings and electronic blues are what makes Jormungand: Perfect Order intense. It's well done. The opening song, \"UNDER/SHAFT\" by Maon Kurosaki is also well orchestrated that demonstrates the theme of Jormungand just like season 1. Oh and let's not forget the previews of each episode that fans adore. Her name is Koko, she is Loco, I said oh no~\\n\\n\r\nUltimately, Jormungand: Perfect Order is a nice series which deserves a score of 8. Although slow at times, it makes it up with its insightful character cast where even supporting characters get their own spotlights. The ability to fuse together action and comedy in a series such as this is difficult but the directors did their jobs right this time around. It's fun to watch despite the fact that we realize how dangerous of being an arms dealer is all about. All in all, Jormungand: Perfect Order is by no means a perfect series but it is one hell of a ride.\\n",
            "date": "2012-12-27T18:07:00+00:00",
            "helpful_count": 101,
            "mal_id": 81594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=81594"
        },
        {
            "content": "TL;DR - Jormungand: PO is a good anime\r\nThe crazy hijinks and bold plans with Koko and company continue in the sequel to Jormungand. How does the second coming of Jormungand fare? I’m here to tell you that it’s better this time around. How do you improve Jormungand’s formula, you ask? You make it more focused. Spoilers for the first season finale below.\r\nSo, Koko and her friends are still roaming the world and everything is swell. Oh wait, no it’s not. The story takes place right after the end of the previous one. R is a double agent who is spying on Koko for the CIA;Hex, a woman from Kokos past, is here for blood; All this while Operation Undershaft is trying to figure out what the hell Koko is trying to do. So let’s look at the formula set for the previous season and see it it still is in place here.\\n\\n\r\n1. The crew arrives.\\n\r\n2. Stuff goes awry and they need a way out / need to out-think their opponents / straight up kill dudes.\\n\r\n3. Mission completed and on to next arc.\\n\\n\r\nYep. Although this time around the arcs are longer and more focused on storytelling rather than outmanoeuvring and killing enemies.\\n\\n\r\nHere’s a run-down on the cast if you need to freshen your memory.\\n\\n\r\nKoko Hekmatyar: Arms dealer, handling business mainly in Europe and Africa. Very charismatic and beautiful. Usually very energetic and behaving sometimes like a child, she has a ruthless interior and on multiple occasions called a monster. Although usually cool with a smile on her lips, Koko has one of the most intimidating glares in anime.\\n\\n\r\nJonah: Child soldier. His parents were killed in an air-strike and he became a child soldier shortly after. Has a strong hate for weapons, but still works for Koko, often serving as her bodyguard. He shows more understanding than expected from a child.\\n\\n\r\nLehm: Ex-Delta Force operator. Used to be active in Somalia. Second in command of Koko’s crew. Veteran mercenary who takes charge when armed conflict arises. Used to work for Koko’s father. Very versatile in weapon use, ranging from long-distance sniping to close quarters combat.\\n\\n\r\nValmet: Ex-Major serving for UN forces in Africa. Her unit got slaughtered by Chen Guoming and she lost an eye in the attack. Since then, she suffers from anxiety whenever she sets foot in Africa. Very proficient with knives and pistols. She is also in love with Koko, something which often is used as comedic relief.\\n\\n\r\nThen there are the rest of the cast, that aren’t given much other than support roles most of the time. Technically only Koko and Jonah are the only real main characters, but Valmet and Lehm are given much more time on screen than the other side characters, so they sort of sneak into main roles.\\n\\n\r\nMao: One of the regular grunts of the group. Was discharged after a training exercise went awry. Picked up by shortly after. The only one of the group to have a family (as in wife + kids). He lied to them in order to leave. Teaches science to Jonah between missions.\\n\\n\r\nR: Former Italian intelligence officer. Revealed in the last episode of the former season to be a mole for the CIA.\\n\\n\r\nUgo: Former Mafia driver and enforcer. Spared by Koko when his family was destroyed. A behemoth of a man, he possesses immense strength. The crew’s driver when needing a getaway.\\n\\n\r\nLutz: Former police sniper, part of a counter-terrorist unit. Very hesitant to kill young targets.\\n\\n\r\nTojo: Previous Japanese black-ops operative, working in places like Cuba. In charge of teaching Jonah maths between missions.\\n\\n\r\nWilee: Former explosives expert and ex-lieutenant of the 20th Engineer Brigade of the XVIII Airborne Corps of the US Army. Assigned to give Jonah English lessons between missions. Is the only member aside Koko to be black-listed by the FBI.\\n\\n\r\nThe perils of having a huge cast like this is just as apparent in the second season as it was in the first one, but the show does a better job at dealing out screen-time this time around and you quickly get a good vibe where everyone’s at. It’s still the same colourful cast with no subs, so if you liked them in the first season, there’s more goodness here. The opening arc, dealing with R being a double agent and Hex coming after Koko is without a doubt the series’ strongest, with some strong, emotional moments. It sets up a season that is in its entirety better than its predecessor. The stakes are raised for Koko and her compatriots. Nobody’s safe in this crazy world.\\n\\n\r\nThe second season takes a step back from the group dynamic at times and focuses solely on Jonah and Koko. They’re interesting contrasts. Koko is the daughter of a shipping magnate and presumably had a very peaceful, or at least pampered life as she grew up. Jonah meanwhile, grew up in a war-zone and had his parents blown up by a bomber, coincidentally sold by Koko’s brother, Kasper. Jonah hates weapons with all his being, and Koko sells them for a living. The two make a fantastic leading duo and represent the tension and morals towards the end of a magnificent series.\\n\\n\r\nThe morality of the characters are brought froward into the centre this time around, and when Koko reveals her master plan that she’s been working on for a long time, it’s surprising it wasn’t brought up earlier. I can understand the reason why it’s hidden for so long, but I don’t agree with the choice. It would have been interesting to have it in the open for longer and see how it affected the supporting characters.\\n\\n\r\nSo, the story. It’s better, considering there’s actually a story this time. From the first episode to the last, every episode is connected to Koko’s goal, which is revealed a bit into the season. The series sheds its episodic skin, and so the arcs are more focused and character-driven, much to my joy.\\n\\n\r\nThe art is just as clean and well-done as it was in the first series. Maybe even better. Some backdrops are absolutely stunning. The character design is much like the first series, although a bit more realistic in general this time around, when it comes to the supporting cast of revolving antagonists/partners.\\n\\n\r\nThe voice acting and soundtrack of the series is way better than the first season. Actors have more opportunities to get heated here and some excellent dramatic episodes bring out the best of all. The music is still top-notch, and the opening song especially is fantastic.\\n\\n\r\nThe theme and pacing are still the same in this second serving of Koko’s adventures. The more story-focused approach leads to a better balanced product, with the episodes being better structured and the tone being a bit darker. With it, my pleas for the show to have less comedy are answered, as the show did turn towards the more serious in this venture, and the show is better off without the forced comedic elements.\\n\\n\r\nThe antagonists and threatening forces this time around are more realistic and grim. There’s not a crazy villain with ridiculous fighting techniques. It’s guns vs guns and tactics + strategy in a wild dance of death.\\n\\n\r\nEnjoyment-wise, Jormungand: PO lands a step above its former series with more thrilling planning; cooler action; better humour; and tear-inducing, heart-wrenching drama. Once again with a Jormungand series, the variance is its strength, balancing several genres and giving them good time. It’s one of those series’ where you finish one episode and keep watching. Not because there’s a crazy cliffhanger, but because the atmosphere, characterisation and execution of the series is so fantastic that you can help wanting to spend more time in Koko’s mad world. Jormungand: Perfect Order is a rare gem to find in today’s anime world, a show with an identity so unique and fresh you can’t help but be swept away by its charm.",
            "date": "2013-04-30T19:49:00+00:00",
            "helpful_count": 64,
            "mal_id": 95499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20333.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Purjoloek",
                "username": "Purjoloek"
            },
            "url": "https://myanimelist.net/reviews.php?id=95499"
        },
        {
            "content": "Scoring Preconditions: While I rate all parts, the overall score takes in most consideration from story, character, and enjoyment. Art and sound are not factors in the overall, although they can slightly enhance or detract from enjoyment portion. I score from as unbiased a view as possible and I view it in a critical sense, not in a simple enjoyment sense. Thus I give at most a one point overall bonus for enjoyment. Story and characters matter most. I will state exceptions to this rule depending on the anime.\r\nSummary: I felt the premise of the anime was weak from the get go. For those whodon't know, the makers of Black Lagoon made Jormungand. Now the key difference between Jormungand and Jormungand: Perfect Order is 1) Darker feel 2) More plot. Otherwise, its very similar to Black Lagoon in its all out action feel. Details to follow.\\n\\n\r\nStory (4/10): Koko wants to build a supercomputer and do what with it? Spoiler alert: Crash every flying thing down to earth. This is the plot. Nothing intricate to it. No offense, but Treyarch had more creative ideas with Call of Duty. The story isn't original at all and the maker didn't make the plot complicated. Essentially Koko succeeds every time and her goons get everything necessary for the computer.With the notable exception of Jonah and his running away part, everything was entirely predictable. And Jonah's past really was pointless throughout this whole anime. I'll talk more on Jonah in the characters section. In general, the plot was pretty generic and on its own, not worth the watch. And finally, the makers tried to add some morality talk similar to with Black Lagoon, but unlike with Black Lagoon, they failed epically here.\\n\\n\r\nArt (10/10): Other than the fact that the Hekmatyars and Jonah are albino, I found the artwork enjoyable. Perhaps they were pointy chinned, but I fail to see the problem. Of course art is subjective so I won't deny that it may not appeal to certain people. But I thought it enhanced the anime. If nothing else, the gun artwork was pretty epic.\\n\\n\r\nSound (10/10): The opening theme UNDER/SHAFT is on my playlist and I enjoyed the song. Ending theme I felt was not really a match with the mood. Gun noise and background music enhanced the feel of the anime.\\n\\n\r\nCharacter (7/10): I want to start off by saying that Koko gets crazier in the second season. She loses her more comical sense in favor of a tyrant like temperament. I personally have no problem with that. Compared to the second season, I felt it was more realistic of an arms dealer. We also got a better look at her true inner feelings so character development for Koko was great. Now on to Jonah. I'm still not sure whether to like Jonah or hate him. First of all, the idea of a child soldier being the center piece is ridiculous. The fact that he is surviving and actually killing professionally trained adults is beyond me. But the bigger problem I have with him is his whole do I hate or do I not hate Kasper Hekmatyar. No offense but if you really hated him, you wouldn't look to him as your next employer after running away from Koko. After all, he did starve him in a shipping container for a week. Jonah does play the quiet role well though. But I had a bigger problem with the fact that his character development really goes nowhere. He first says no to project Jormungand and runs away only to change his mind and return to Koko. I have a hard time with characters that can't make up their mind and seeing as this basically consisted of the last couple episodes, both the story and the character suffers for it. The only reason the character score isn't a 3 is because I love Koko.\\n\\n\r\nEnjoyment (10/10): Now I watched this anime in anticipation of the action. The gunfights in this season as well as the first are still some of the best I've seen. While not always entirely realistic, it was great to watch. If I had to describe it, it was like watching a first person shooter in reality from a third person view. You get a lot more cool but unrealistic stuff and the guns are up close. That and Koko as a character was sufficient enjoyment for me. \\n\\n\r\nOverall (6/10): First off, I weighed the enjoyment a little more here seeing as the action is its biggest asset. The story and Jonah merits a 5 or lower overall, but Koko and the action add more to this anime. The reason I don't give it a 7 though is because the premise of this anime was bs. i simply can't give it a higher score from a critical perspective as it really wasn't all that good. I'd say as a viewer, its at least a 9/10, but from a critical sense this is the score i give because it is neither creative nor intelligent. One word to describe this season and the first is: explosive.\\n\\n\r\nThanks for reading this. I'm open for discussion so if you have anything to add, message me and I will get back to you.\\n",
            "date": "2014-10-28T16:26:00+00:00",
            "helpful_count": 41,
            "mal_id": 166571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4143293.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Emperormin3",
                "username": "Emperormin3"
            },
            "url": "https://myanimelist.net/reviews.php?id=166571"
        },
        {
            "content": "I'm going to make this short and simple. \r\nThe character development was prize the for the show. It's not easy selling weapons, knowing that your life is actually on the line and that you are considered a merchant of death.Some arms dealers do for the money, some do it for the fame, but Koko does it for World Peace. Arms dealing might not be the greatest idea for world peace, and can be considered downright hypocrisy, but Koko's work is based on necessary evil, where evil deeds must be done into order for good to arise.\r\n As for other protagonist, Jonah, he travels and protectsKoko with his life, even though his parents were killed by the very weapons sold by arms dealers. It might be ironic, but he does it as a sacrifice so others can live a better life, even though he hates wars, weapons, and arm dealers. Jonah and Koko might have contradicting beliefs, but they work together for the betterment of others. \\n\\n\r\nI also enjoyed the other characters. It's nice to know a girl who can kick your ass like Valmet, who's probably the scariest and most physical imposing member of the group, but she does show some softness towards Koko, but no mercy against men. The other characters like Lehm, Willie, Tojo, Lutz, and others all might come from tough backgrounds like special forces and secret organizations, but they tend to grow on you as human beings.\\n\\n\r\nAs for the story plot, the first series (Jormungand) is like a scattershot of action and of the group's adventure through the arms market. However, it's this series  that connects the dots and shows what Koko was plotting all along. I admit that I was confused what Jormungand had to do with the anime because it took all the way to the last couple episodes to know what Jormungand was all about. \\n\\n\r\nAnyways, I must say the show is enjoyable due to the innovation and cooperation of the group to achieve their goal. Also, the combination of the undercover arms dealers and intelligence organizations teaches a lot about the underworld of arms trading and intelligence gathering, which some might be considered fictional. Conclusion wise, I actually want the series to continue due to the underwhelming ending, but the manga is complete as well as the anime.",
            "date": "2013-05-10T11:06:00+00:00",
            "helpful_count": 40,
            "mal_id": 96633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2409823.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Samjoko",
                "username": "Samjoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=96633"
        },
        {
            "content": "“Knowledge is power. Information is power. The secreting or hoarding of knowledge or information may be an act of tyranny camouflaged as humility” - Robin Morgan.\r\nWar indeed can be viewed as an inescapable and integral aspect of human culture. Sources claim 14,500 wars have taken place between 3500 BC and the late 20th century, costing 3.5 billion lives, leaving only 300 years of peace, but one dynamic concept of war has always been the tools used to wage it. We’ve seen the early man start with stones and clubs to advance to swords and with the discovery of gunpowder, bullets have also come into thefray, and the deadly nuclear and atomic warfare have also taken flight. The latest addition to this devastation inflicting family is information technology, but does this seemingly docile and easily accessible piece of technology be considered the most deadly weapon man has ever created?\\n\\n\r\nThe second season of Jormungand, sub-named ‘Perfect Order’ comes with some changes in plot devices as the arms dealing takes a back seat in place of informational warfare. We are introduced to the fact that Koko has some sort of plan in the making as we see her send several rockets into space with the viewer kept completely in the dark as to what could be the reason for this. Although not a mystery series, the way the plot and secrets nicely unfolds is both smart and entertaining at the same time.\\n\\n\r\nUnlike the first season, intelligence agencies such as the CIA play a bigger role in the story. Viewers kept in the dark as to Koko’s plans are smartly inserted into the shoes of intelligence agencies as they try to discover what it is she is up to, this somewhat different approach is a welcome addition as it requires a bit of intuition from the viewer to keep up with the story unlike most series that just require you to simply look at the screen and diffuse any useless information that comes your way. The prequel was never presented with an antagonist that seemed would be able to go toe to toe against Koko in terms of wit but the second season states a claim on this with the introduction of new characters such as Hex and George Black who definitely seem to have the potential to push Koko and her crew to the wall. \\n\\n\r\nJust as in the first season the series progresses in bi-episodic arcs, while this is a good strategy that helps the writer to focus completely on one aspect of the story, it also poses a problem of connection. Once one arc is over, the connection between the previous and the next arc is most of the time thread-thin. Only very brief conversations about the previous arc serves as the basis to connecting two story joints which can make the series seems a bit disjointed a times. Fortunately only being a 12 episode show it manages not to suffer the long term effects of such a predicament as it poses serious problem to character growth.\\n\\n\r\nWhite fox have of course done a great job with the visuals, some nice notables was the studios use of shading, shadows were nicely placed in appropriate locations such as faces that depicted facial buildup of the characters and especially on the clothes. Some stressed emotions such as rage are also nicely conveyed by use of shading right under characters eyes. Being a show that depicted modern warfare it also consisted of mechanical parts such as vehicles and helicopters, the studio decided to use CGI to animate this. The CGI most of the times remains seamless with the surroundings and impressively a times we see mesh perfectly when interacting with hand drawn characters however those CGI elements that used a somewhat darker color tone seemed a bit sloppy and carried with it all that most anime fans resent of CGI animation. The second season also placed strong emphasis on location, as the team traveled to a large number of different cities around the world and white fox of course did not slack off on doing their research to make sure they capture a city’s scenery and populace accurately into the fray.\\n\\n\r\nThe place where the second season seemed to outdo itself far more than the first was with its choices of soundtracks. The soundtrack of the first season was great and honestly it was really unexpected that it would be something that could be built upon, but regardless it was done and with brilliant execution if i may add. The soundtrack consists of tracks from the first season, remixes of those tracks as well instrumentals that spanned into several genres such as rock, rap and even electro. Insert songs were included that to my surprise even included some Indian and French tracks.\\n\\n\r\nIn the first season Koko has always seemed one dimensional in her emotions, always reserving a cool, calm and collected demeanor, so it was with great joy that this mask of hers is cast away at certain places as we see a different side to her emotions; Fear, grief and rage are ultimately introduced into her character in certain places that went a long way in making her character seem ‘human’. The relationship between Koko and Jonah is also put to the test as their already seemingly weird unpronounced relationship is put under serious strain in some places and the overall decisions and actions they choose to take make up a big turning point in the show itself.\\n\\n\r\nOne of the first departments the series decided to give attention to was with the development of side characters, an aspect that was left barely touched from the first season. We get to see the past of the remaining members such as Tojo, R and Wilee up to their meeting with Koko. Instead of the show simply showing an entire episode of a characters’ past, it approaches it smartly by interchanging events between the past and the present, this ensured both development and advancement of the story at the same time, a “killing two birds with one stone” strategy if you’d like to call it. The lack of development in the first season that would no doubt leave fans with either Koko, Jonah or Lehm as character favorites are immediately put at risk as characters such as Wilee are presented to us in such an entertaining manner that one has to re-think their plans of favorite character. \\n\\n\r\nWhile we do get to see the whole characters in the series finally developed and create a stronger connection to them emotionally, the end- result however was never built upon. A character immediately having their arcs completed are afterwards seemingly put back under the rock from which they were picked up from and revert to be nothing more than filling spaces as they once were. This blatant disregard and ignorance on the part of the writers will prove to be an extremely wasted potential as it was basically a great chance that opened new pathways and possibilities that the series could have and should have advanced in but never did.\\n\\n\r\nWith a mere 4 months between the first and second season we didn’t see too many improvements to the overall series as a whole, but there are little improvements here and there as we see in the thickening plot and the music. The series does still harbor it’s set of entertaining gun fights that with the help of great animation from white fox will leave most audiences dazzled.\\n\\n\r\nAs time moves on, man will continue to advance his science and technology, and with information warfare being his latest weapon, we have to wait and see what new toy we can make in future to better and effectively kill each another.\\n",
            "date": "2013-01-10T03:30:00+00:00",
            "helpful_count": 27,
            "mal_id": 83239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1019085.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zee530",
                "username": "Zee530"
            },
            "url": "https://myanimelist.net/reviews.php?id=83239"
        },
        {
            "content": "Worst ending I've ever seen in a show.  Right before this I finished Beyond the Boundary and that had a crap ending, but it was just saccharine sweet bullshit that ruined the last minute or so of the show, but this goes above and beyond that.\r\nJormungand is a show about an arms dealer planning and maneuvering to execute her master plan to save the world from war.  The problem?  Her plan is fucking assinine.  The entire show hints at this super complex incredibly important end game that's the reason we've been sneaking around and orchestrating all these different conflicts, and thenthe plan makes no fucking sense whatsoever.\\n\\n\r\nI don't know what to say  other than that.  The entire story leads up to the reveal, but even the slightest amount of critical thinking will tell you that the plan will never work, has too many drawbacks, and the main drawback mentioned (not to spoil, but its a fucking humdinger) could be mitigated with a little extra effort.\\n\\n\r\nThe entire show this wonder squad of badasses has been nigh untouchable and 50 moves ahead of the opposition.  No one ever pulls a fast one over on the main characters, and they just mow through any and all opposition without a thought.\\n\\n\r\nThere are no stakes, and it throws all logic and character development under the bus at the last minute.\\n\\n\r\nAs soon as the reveal happened this went from an 8/10 to a 3/10.",
            "date": "2017-12-01T21:33:00+00:00",
            "helpful_count": 7,
            "mal_id": 264339,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6027134.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MrConductor",
                "username": "MrConductor"
            },
            "url": "https://myanimelist.net/reviews.php?id=264339"
        },
        {
            "content": "Ok, this is my edited review of this anime since, co'z a certain dude thinks that it has a lot of spoilers.......or was it just because I'm being singled out, ehhhh, who cares ok so please pardon my boring and unsensible review of   this sequel, so let's get down to business. Now that I've ending watching this sequel, I kinda find this sequel as good as the previous season, since it still has the usual gun fights and the usual blood and gore. As usual it still involves the dangerous life of Koko and her posses' in which every episode was action packed,however unlike the previous, this time Koko is better, badder and uglier than before. Here, she was no longer your typical arms dealer who is in competition with other arms dealer and staying one step ahead of those who wanna kill her, she was now a textbook definition of a TV show villainess who wants to rule the world. Though it was said in episode 12 that she hasn't activated the \"Jormungand\" system her prediction from episode 11 contradicts it as if if she as a hand  as to how the world when in to chaos, 2 years after Jonah left her. Jonah on the other hand, is the usual hypocrite that I would like to put on the firing squad, to me I see him as either very stupid for leaving one arms dealer only work for another arms dealer and go back to the same arms dealer in the end, when in fact he hates arms dealers in the first place or he's very smart for being able to survived a lot dangerous encounters, either way I wish he could have killed Koko, then again, wtf am I saying? As for the other characters, I hate it when the CIA who were supposed to be the good guys turn up to be a bunch of bungling keystone cops, especially when George Black got a taste of his own operation called \"Undershaft.\" As for the 3 scientist, Minami, Rabbitfoot and Elena I would have like to see some onsen fanservce of those three, but too bad it was censored. Ok, so enough talk, how did I rate this sequel? \\n\\n\r\nHere's how:\\n\\n\r\nStory: Good 7.\\n\\n\r\nStill has the usual plot and violence for grown ups.\\n\\n\r\nArt: Mediocre 5.\\n\\n\r\nStill the same character design, though I would like to see some intense fanservce with the babes including Valment, man, I like FBB who are also Milfs.\\n\\n\r\nSound: Good 7.\\n\\n\r\nSince I like both opening and closing theme.\\n\\n\r\nCharacters, enjoyment, overall: Fair 6.\\n\\n\r\nThe character's are still there more better, badder and uglier, which to me makes Koko and her posses' an unlikable character, the enjoyment.........still awesome except I would have wish that Scarecrow would have capture the  Hekmatyars. Overall, hummm, if I were this anime's director, Keitaro Motonaga, I would have end it this way:\\n\\n\r\n-After 2 years have pass Koko and Jonah met again, but ignored each other.\\n\\n\r\n-Jonah, being tired of working for an arms dealer and seeing all the chaos happening wanted to leave and was granted, he was awarded with large sums of cash to start over and he was able to go home hoping that his village would have rebuilt itself.\\n\\n\r\n-Jonah came hope and saw his village slowly rebuilding itself and was greeted by the people who recognize him.\\n\\n\r\n- And here the \"Pièce de résistance\" Jonah (smiling), made a promise that he'll never hold a weapon nor will he kill anyone again. \\n\\n\r\n-The end.\\n\\n\r\nOverall, such ending would have provide a good ending, which btw this sequel ended stupidly but still entertaining, but hey, that's just me. \\n\\n\r\nBTW: If any spoilers are present, then excuuuuuussssssseeeeeee me. Co'z most of everyone else's review would contain a spoiler or 2, jaz saying, no disrespect.\\n\\n",
            "date": "2013-01-06T09:47:00+00:00",
            "helpful_count": 14,
            "mal_id": 82862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=82862"
        },
        {
            "content": "If you don't like to feel CONFLICTED, not because of the issues the anime raises, but of the anime itself, DON'T WATCH THIS ONE!\r\nI watched both seasons in like, 3 days! It's pretty engrossing with all the gun fights and the cool background setting. It seems realistic, but don't get too into it, because in the end, it's all fiction. \r\nI was having a hard time understanding why I didn't like it as much as when I first started watching it. The ending, for me, wasn't satisfying at all. It really was underwhelming with all the hype it had built up (especially towards the endof season two). \\n\\n\r\nNo real character development except for Koko, who isn't even the main character! Wait, it's not even character development, she just simply reveals herself. Jonah, the protagonist went nowhere in the series! Really, Jonah? I honestly liked you so much until the end... And Koko, don't get me started on her. She's cool, yea, real cool, at first. She went real loco later on indeed. \\n\\n\r\nI'm like so UGHHHHH right now...\\n\\n\r\nTo be fair, the series has very memorable quotes! The issues are real, but the story was only ok. \\n\\n\r\n\"In this world, guns are always within arm's reach, and sadly they are more trustworthy than kindness.\" --Koko\\n\\n\r\nOVERALL: Started out cool, intense climax, then plunged right down the bottom of the ocean, leaving me hanging: \"Wait, what just happened? That was all for nothing? Now we're just at the beginning again? HUHHHHH????\"",
            "date": "2015-03-29T06:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 183901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2691761.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/riri9",
                "username": "riri9"
            },
            "url": "https://myanimelist.net/reviews.php?id=183901"
        },
        {
            "content": "There is something wrong about Jormungand. I felt it in the first season, but I dismissed it as my lack of understanding of the characters and plot in general. I wanted to revisit the characters' psychology again in the second season. I wasn't expecting much more development out of Jormungand. I mean, there were tiny hints in the first season that showed the direction where this series is going, mainly from Koko's words, so the plot development in fact did not interest me much. I wanted to understand the characters more and the reasons behind their actions, but it turned out to be disappointing, alongwith the plot too.\\n\\n\r\nJormungand has complex characters and plot, but they are all pieced together. This is the most serious flaw of Jormungand. The people beside Koko all are pretty unique, but honestly their uniqueness tells nothing about themselves and most importantly, how it works in the big picture. In other words, their unique personalities don't drive one bit of the story. That's where a potentially character driven story becomes no longer so. What's more unfortunate is Jormungand was not designed to be plot driven but character driven. Of course, this can be saved by Koko. If Koko's character is strong enough to drive the plot and other characters, Jormungand can be saved. \\n\r\nI thought Koko's characterization is pretty strong since the very beginning, but I changed my mind after the second season. Even Koko is pieced together and lacks integrity as a character. She did not change throughout the series. In fact, I think she is probably the only one who stayed the same. I don't really mind it. Jonah is there so to put a leash on herself, but even in that respect, Koko did not change.Some of her comrades died too, but she did not change. I don't mind it. She has her beliefs and resolves, so she doesn't need to change. \\n\r\nBut, it's not the fact she didn't change that failed to make Jormungand come together. It''s the fact that jonan did not change, and from this fact, you'll come to understand the biggest flaw. I can see how Jonah is struggling inside with his wavering beliefs, but Jormungand didn't convey in the end the change in Johah. Yes, he ended up accepting sacrificing a few to protect the mass, but how did that change take place inside of him? It seems to me that he simply ended up relying on Koko too much, accepting her way of doing things more than how others like her brother does the trade. If this is the case, what's the whole point of Jonah's character? Having a kid beside a powerful queen gives a nice picture, but  the fact Jonah simply grew a habit but not growing or developing as a character made Jonah's existence pretty meaningless. This is even more obvious when you look at the other team members. We get a glimpse into their past, but what's even the meaning of showing the past when it makes no difference to the progression of present events? Are we to feel more attached to those characters? Honestly I did not feel any because they did not contribute anything to the story except helping Koko win all the gun fights. \\n\r\nYou might say that it's more about the political mind of people rather than their emotional side. I agree if it's about the antagonists of the story. They are there to demonstrate the political sides of things. But the protagonists aren't intended that way. \\n\\n\r\nThe part that made me realize that even Koko doesn't have the depth to support this whole complicated story is the ending. This is also related to the theme of Jormungand. Koko hates the weapon trading world and weapons in general. Her belief is not very different from Jonah's. She knows just hating things won't change anything, so she took on the role she dislikes the most to change things from the inside. She doesn't even mind making sacrifices if necessary. This is all her motives and intentions, but what about her psychology? The fact that she thinks that giving people the original beauty of the world would bring out their shame and make them stop only showed me that Koko does not have a psychological depth. Why? Because this naive thinking contradicts her character in general. To put it bluntly, I didn't expect Koko to think that way considering her actions and words from the past. It disappointed me. If she were just a shallow thinking person in the beginning, this thought wouldn't bother me. But Koko isn't depicted as a shallow thinking person. You might say it's just her ideology, and ideologies are suppose to be naive. But Koko is not an ideological person. She is a very practical person who is more about actions than about words, and that's why she has the ability to carry out her grand plan.\\n\r\nOVerall, this made me realize that the concepts behind the characters, even in Koko's case, were not well planned out. I feel like the staff put together a whole variety of personalities and ideologies just to make the characters and story complex and engaging. For me, however, it failed to work because I don't believe you can ever reach the whole from connecting the pieces. It's a philosophical belief of mine based on the idea that you can never reach enough connections because there are limitless number of them. In other workds, Jormungand's characters and stories are designed from bottom up rather than top down, and this made the series fall flat at the end.\\n\\n\r\nThe reason I won't rate Jormungand any lower is because Jormungand is potentially a good story with a good theme. After finding the flaw in its set-up, I started to think it actually isn't too bad considering it could be much worse. \\n\\n\\n\\n\\n\\n",
            "date": "2013-01-03T07:58:00+00:00",
            "helpful_count": 12,
            "mal_id": 82510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/526945.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/movoning",
                "username": "movoning"
            },
            "url": "https://myanimelist.net/reviews.php?id=82510"
        },
        {
            "content": "Along with the ridiculous master plan of the main charater to crash every plane with no survivors, the gunfights, and the combat in general feels childish, it's like the creators never even saw a gun shot. The show goes from spraying someone from 5 meters and not hitting them to accurately sniping from distance with the same gun. It's like they threw any hint of realism out in favour of \"coolnes\" but kinda backfired because in a \"adult\" anime it makes it look idiotic. The show is stuck between trying to be serious with \"heavy\" plot and realistic combat then it turns around and havemain characters walk into machinegun fire and come out unscathed while also killing the enemy like a cheap hollywood action movie. Also we don't actually see the outcome of the masterplan.",
            "date": "2018-10-30T20:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 293026,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525838.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/deathabarbar",
                "username": "deathabarbar"
            },
            "url": "https://myanimelist.net/reviews.php?id=293026"
        },
        {
            "content": "This review will cover the whole series. \r\nStory:\r\nThe story. Well. I give it 10/10. I like the whole plot and how the story follows a straight line, where the viewer is sometimes led back in time to get a better grasp of certain characters past and how they got involved with Koko. I really love how the story takes place in real places and to see how the story has been inspired by real war events. I just love it. The story it self is very well crafted and doesn't leave the viewer with a mindfuc*, but leaves an almost complete puzzle, but with anending that enables the viewer's imagination to take over. The story gets more and more intense by almost every episode. I never had the urge to sleep during this anime.\\n\r\nI should also mention that this anime is filled with shooting and action. If you like that sort of anime, then I can recommend this one.\\n\\n\r\nArt/animation:\\n\r\nThe art/animation is great. The colors and the depiction of places are \"realistic\", so to speak. The colors aren't too bright, but rather washed out. A bit like the animation of \"Monster\", which I also have written a review about. Overall it gets 9/10 .\\n\\n\r\nSound:\\n\r\nThe sound is good, but nothing out of the ordinary. The voice actors all do a great job, the sound of firing and explosions are realistic. The music good, but really nothing that I noticed during the series. But I love both openings and both endings. \\n\r\n7/10\\n\\n\r\nCharacter:\\n\r\n8/10\\n\r\nOkay. This one I struggled with during the whole series. I had a problem which I've never encountered before, concerning anime. I had a really hard time remembering the faces of the female characters because I think they some of them look very much a like. Besides that everything is great. The design of the characters fits very well to their roles. And their body structure fits to their personality, past and current position. \\n\\n\r\nEnjoyment:\\n\r\n10/10\\n\r\nI enjoyed the anime quite a lot. I love how the anime follows a straight line, but goes back and forth into characters past. I really enjoy the realistic war-events (some inspired by the horrible events in the Balkan war). I loved to see Jonah grow and becoming more aware of what's going on around him. I enjoyed this anime to the very end, even beyond(letting my imagination take over after the ending, sitting outside with my churchwarden pipe and just.. enjoying it). \\n\\n\r\nOverall:\\n\r\n9/10\\n\\n\r\nOverall I can recommend this anime to anime who likes an action filled anime, with lots of shooting and explosions, but also those who likes seeing a child growing and developing it's emotions. I certainly enjoyed this anime. And if you like the animes that has what I mentioned above, this is an anime for you.",
            "date": "2013-01-12T17:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 83489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1933410.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BakaShinjiIkari",
                "username": "BakaShinjiIkari"
            },
            "url": "https://myanimelist.net/reviews.php?id=83489"
        },
        {
            "content": "“Fun, funny and packed with well-achieved action scenes. An enjoyable show with a great premise that lacked the backbone to end with a bang. ”\r\nREVIEW FREE OF SPOILERS!\r\nLet me begin this show with two statements I said on the review of the first season.\r\n1) A plot built around arms dealing isn’t one of the most original things ever, we have seen it in movies such as “Lord of War” (Nicolas Cage) or “The International” (Clive Owen), nevertheless the use of this plot isn’t overused as many others subjects related to war, which makes this show sort of “unique”.\r\n2) The first season was more of aplanning for the second season, by this I mean that the “pieces” –characters and situations- where being placed just like chessboard.  In order to achieve –probably- a more detailed story with a background.\\n\r\nHaving said these two statements, I will rate this show in view of that –that it’s a whole- and not just as a simple “stand-alone” season.\\n\\n\r\n-STORY: 7-\\n\r\nSelecting a title for a “work” –whether a movie, book, TV show or whatever- is one of the most important things for sometimes the title is slightly counterproductive or it might give hints of the direction they are leading towards, such is the case of this show –in my opinion-. \\n\r\nIf you know something about Norse mythology, a word or name such as “Jörmungandr” (aka Midgard Serpent or World Serpent) will definitely give you a very strong idea of what the characters are trying to do.\\n\r\nWhether they achieve it or not is one of the things that will get you hooked up.\\n\\n\r\nNow, leaving aside the fact that the title –amazingly- “spills the beans” of the show, the story of “JORMUNGAND” –season 2- is interesting and to some extent original, after all, since the beginning of the show the MC’s are trying to save the world. Each and every one on their own way –thing that I find delightful and well-achieved-, BUT it IS predictable. Does this means that the story on the second season is unoriginal or boring? No, it is original, more importantly it is unique on the way they –the writers- are doing the story, and by this I mean the main focus. Although you shouldn’t get carried away. Yes, the story is well-written, it entices you and it makes you want more, but in the end the show fails to achieve the “explosive” final that seems to be guaranteed with the premise and most importantly with the “journey” of the characters.\\n\\n\r\nThe second season pics up after the “cliffhanger” –to call it somehow- and the revelation of the first season, leading to a better-grounded plot and most importantly to a “richer” story, nonetheless the writers of the story didn’t deliver, they looked, self-complaisant, lazy and most importantly conformist, the story containing a better “pillar” wasn’t “squeezed” and the story just kept on following the same repetitive “straight-line” showed on the previous season instead of the “adventurous” path they could have chosen.\\n\\n\r\n-ART: 9- \\n\r\nWith so little time between season one and season two there’s not much difference between both arts depicted in both shows. Still, the art is remarkable; it’s well detailed but not perfect. Although, the actions scenes were incredibly well achieved, and the characters and guns are amazing. Slightly better than in the previous season.\\n\\n\\n\r\n-SOUND: 7-\\n\r\nI usually open with the voice actors review, but there’s a reason why I will open with the soundtrack part.\\n\\n\r\nMy statement on the soundtrack of the previous season was that it was good but it wasn’t imposing anything new or interesting.  Regretfully for the soundtrack team on this second season of “JORMUNGAND”, I will use one word to describe their work, and the word is “Slothful”. Being a musician isn’t something easy -I know myself that, after all I create/write music- but falling into the same pattern or in this case “recycling” most of the previous soundtrack by just remixing it’s sad. There was nothing new except a few songs. The work they displayed was just a back-step instead of a progressive one. Don’t misunderstand me, the music is good –not great or bad- but the lack of creativity was a demotivation.\\n\\n\r\nIn the “SOUND Department” the voice acting IS the jewel of the crown. The script reaches –in comparison with the previous season- a more deep and meaningful dialogue. And the voice actors where capable of transfer that “deepness” –especially Mitsumi Tamura (Jonathan Mar).\\n\\n\r\n-CHARACTER: 10-\\n\r\nThe “Character Department” in this second season amazed me, THE best thing in the show. What they lacked in sound and other areas they have it on the character development, for the writers of the show gave them a very well deserved attention, and not just to our MC’s but also to the side characters. But the jewel within the character development is Jonathan Mar. He grows up and gets an amazing development.\\n\\n\r\nMeanwhile Koko gets a poorly made development –in my opinion- getting a typical and predictable crazier/obsessive look in this second season, UNTIL the last episode. Still she’s a character that is lovable and memorable.\\n\\n\r\n-ENJOYMENT: 8 & OVERALL: 8.2-\\n\r\nAfter this entire critic I made about “JORMUNGAND” I still think that is an enjoyable show, and as I said previously it’s mostly because of the characters within the story. And of course, because of the action within it.\\n\r\nI will say this again, “JORMUNGAND” is a show that fails to deliver an explosive final, BUT it gives something else, something good and deep.\\n\\n\r\nThanks for reading!",
            "date": "2014-11-07T14:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 167763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4195751.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GonWithARose",
                "username": "GonWithARose"
            },
            "url": "https://myanimelist.net/reviews.php?id=167763"
        },
        {
            "content": "Story: 8.5\r\nAnother beautifully complex story that you won't get till the very end. After Finishing Jormungand with a cliff hanger we must jump right into Jormungand Perfect order still not knowing yet what Jormungand even is. Is it a WMD a Bidding Chip or some massive technological advancement.....only time will tell. Even the ending of Perfect Order will leave you on the end of your seat \r\neither: \r\na) Mind Blown at what you just witnessed or\r\nb) Me, still asking questions that you want answered\r\nEnding: 7\r\nB) As stated the ending personally left me wanting something more, regardless of the ending being good it wasn't great. Neverthelessit did leave us with a cliffhanger to ponder many possibilities.\\n\\n\r\nSolid Plot: 8\\n\r\nThe plot was great. Each episode leaving you wanting more and never a dull moment. A quality action guns blazing, blow sh@t up anime. Also unlike other shorts Jormungand has each episode have relevance to either character development or the main story line which is fantastic. \\n\\n\r\nMoral: 8.5\\n\r\nEvery anime has to have some sort of hidden deeper meaning, that they wish to convey. With Jormungand it was the majorly debated issue of world piece and the theme \"insanity\". Jormungand shows us that only those willing to spill blood in the present have the right to pave the way towards our future. As Jonah says to Koko \"both you and the world are crazy.\" In a crazy world we must do crazy things. The moral would've got a 10 if it had have been consistent  \\n\\n\r\nSense: 8.5\\n\r\nYou get shot in the head you die, you get betrayed you feel betrayel, somebody dies you honour their death. All themes that Jormungand stays true to in attaining a level of realism in accordance to its genres. \\n\\n\r\nMusic: 8.5\\n\r\nProbably one of the best anime's when it also comes to theme songs and timed moment beats. \"Her name his koko she is loco i said oh oh\" A tune that will get stuck in your head for days and days. When there's a gunfight fast paced music is played when somebody dies its slow. \\n\\n\r\nArt: 8.5\\n\r\nExplosions, blood, guns, scenery and character design where all quite amazing. Guns where pictured down to the detail and no two characters had the same frame. The scenery was quite amazing (especially if in 1080p) and the explosions/implosions where all also fantastic.\\n\\n\r\nCharacters: 8.5\\n\r\nCharacter design and development was flawless. They couldn't have done anything better (maybe like 1 or 2 things but) within 12 episodes they ensured we got to learn about the characters past and why they joined Koko's team. The emotions each character also portrays stays true to what we know about them and their past. Eg: A character who had a harsh past life is able to forget about most of her troubles due to finding love, however we see that not all of her troubles are forgotten. Quite fantastic.\\n\\n\r\nBoredom Factor: 8.5 \\n\r\nWas i sitting away piking my nails or was at the edge of my seat saying \"kill him kill him\". An 8.5 for \"killing him\".\\n\\n\r\nCaptivation Scale: 9\\n\r\nLeaving us always wanting more with every episode and giving us what we desire, explosions and blood thrown in with some mystery.\\n\\n\r\nPersonal Score: 8.5\\n\r\nThey pretty much did everything right, except for me with the ending didn't hit an all time high. Though this anime was easily able to jump right in into my top 5. If you havnt seen it Watch it RIGHT NOW\\n\\n\r\nGenres-\\n\r\nAction: 8.5\\n\r\nIn nearly every episode someone would either die or something would get blown up. What more could an Action genre ask for (maybe a nuclear bomb)\\n\\n\r\nOverall (Average) - 8.8529\\n",
            "date": "2013-03-10T07:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 89263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2277829.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuLair",
                "username": "OtakuLair"
            },
            "url": "https://myanimelist.net/reviews.php?id=89263"
        },
        {
            "content": "Seriously a love/hate relationship with this anime...\r\nNot sure if I'm feeling frustrated or upset but I guess to sum it up... This anime does if not a GREAT but OUTSTANDING job with creating extremely fascinating characters even with whatever little backstory they have\r\nChiquita, Karen, Sofia, The Witch, Orchestra, just to name a mere few favorites every character was so unique and a blast every time they were on screen!\r\nMy only gripe is ::may or not be a spoiler:: that either characters die TOO FAST or some don't even get into many fights at all... or just a lot of characters DON'T DIE so unfortunately younever really feel any danger or game of thrones/attack on titan type of \"oh my gosh!\" mouth opening moments...\\n\\n\r\nLong story short... Really more of a story type drama/morals/thought provoking anime in the end... Action wise too few to really enjoy and end too fast before you can really carry some emotional weight with the outcomes.",
            "date": "2016-02-16T02:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 211015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anilist637",
                "username": "Anilist637"
            },
            "url": "https://myanimelist.net/reviews.php?id=211015"
        },
        {
            "content": "In my other review, I talked about how much I loved the first season of Jormungand. Here is the second season, which I obviously was not a fan of. The story was alright, and it transitioned smoothly, until near the end,--which I won't spoil--where it kind of just became really jagged and rough, like an unfinished product. The art is great as usual, just like the first season, with that semi-realistic anime style mixed in with the realistic surroundings. The sound was okay, but not as good as the first season. The opening wasn't one I personally enjoyed, but Inormally don't like the second opening of any anime, due to changes and the like. The characters were great as usual, but they seemed to change somewhat between the first and second seasons--maybe because they were wrapping up the story, but some characters just weren't the same anymore. I get that it may have been meant to end up like that, but I didn't like it personally, and that goes into enjoyment. I really didn't enjoy this season. I can't lie--I really disliked it. It wrapped up the story in a way I really disliked, and it might have been better if there were more episodes to make the transition smoother, I don't know. I legitimately had to force myself to finish the last four episodes, and normally, I don't have to do this. I really didn't like this second season, and, in contrast from the first, I'd say it's just not nearly as good. I would recommend this for anyone who likes action and politics, but the story just really lacks in this season. I do encourage anyone who has seen the first season to watch this season, too, however, since it's best to know the ending. Who knows, maybe the manga is better.",
            "date": "2016-07-20T13:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 224500,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5498121.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/morningxtea",
                "username": "morningxtea"
            },
            "url": "https://myanimelist.net/reviews.php?id=224500"
        },
        {
            "content": "This has got to be one of the most ridiculous animes I've seen in awhile. The gun battles are just terribly sad and the dialog is something you'd expect from a little kids cartoon. Yet this anime has a R17+ rating. What exactly is their target audience? I suppose if you live on an island completely isolated from firearm ownership you might fool them into thinking you cant hit someone running straight at you a stones throw away with an ak-47 but come on! You cant have that same character turn and shoot some snipers off a building like it was nothing and expect meto disconnect my brain and ignore that! This... This is just too absurd to watch.",
            "date": "2013-01-20T22:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 84325,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/363863.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pontiac",
                "username": "Pontiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=84325"
        },
        {
            "content": "First off I want to point out that this is not a story for everyone, honestly, the morality of the choices that the individuals in this series demonstrate are ambiguous, at best. \r\nThe show really delves into the protagonist group of arms dealers under one Koko Hekmatyar, and their dealings all around the world from militaries, to militias to the mafias. Each encounter gives more insight into the character of Koko while keeping a mysterious mask over her true goals and intentions.\r\nWhen looking at the characters in her group, which is a key aspect of the series, it's important to understand that each one wassomehow affected by war and have first-hand experiences that are written in a believable manner. Throughout the series, the individual stories and histories of each person in the group are touched upon and the series does a great job to flesh out and make it understandable why each person does what they do and how they gained the skills they demonstrate throughout. My only complaint here is that some of the characters could've used a little more fleshing out, however it was overall a minor issue I had.\\n\\n\r\nNext the art; it was very unique and honestly a bit of trademark of Mr. Takahashi's, I personally loved it. The art was weird and different from most manga's and anime's I've read and watched respectively, a breath of fresh air in an over saturated market of similarly styled art forms. I understand it's a very subjective style and might not be to everyone's liking. The anime really brought out a nice polished version of the art from the manga and it seemed to work very well from the overemphasized proportions of peoples facial expressions to really point out guile and cruelty to the shapes and sizes of different peoples presence on the screen. Every visual detail gave a nice little hint at the powerplay going on both physically and mentally between characters and groups.\\n\\n\r\nThe music and sounds, oh man were they NICE; clean gun effects lots of clatter and noises during intense movement and it was very well done to the environments that scenes were set to! The gunshots were really well done; I've been around firearms sparsely but what little knowledge of guns that I have, I thought the sound work was believably done. Music, now that's something that is extremely subjective, but I thought that the way they wove certain tracks and pieces were perfect in setting the mood and getting the viewer thinking on what was going on in the conversations and situations on the screen; overall an amazing use of a soundtrack to fit the animation!\\n\\n\r\nFrom the beginning to the end, you really feel like you're traveling amongst this group learning and getting a feel for the aspects of the team, the world they travel in, and the complexity of intelligence work between Koko's party and their government antagonists. I honestly feel like Studio White Fox did an amazing job adapting the anime from the manga, never once did I feel like I was missing anything from things not being narrated by thought clouds or the like both non-verbal communication and scene setting were fantastically executed! Stellar work!",
            "date": "2019-01-18T20:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 299413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5518845.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MegaFire800",
                "username": "MegaFire800"
            },
            "url": "https://myanimelist.net/reviews.php?id=299413"
        },
        {
            "content": "to sum it up in one word it be \"perfect\" ,it have everything i was looking for  :\r\n-blood\r\n-gun fight \r\n-knife fights\r\n-strong beautiful main character\r\n- a dark theme with light comedy \r\nbut that not made this anime for me , it was the characters , the development between character made this special",
            "date": "2013-11-26T00:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 121433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/enigma10",
                "username": "enigma10"
            },
            "url": "https://myanimelist.net/reviews.php?id=121433"
        },
        {
            "content": "Story starts with the boy soldier and I thought the series will center around him. But he finally gets the focus near the end.\r\nAgain, the opponents are over-hyped and lose too easily. Even if one of the main characters is defeated, it's only to further the plot.\r\nIt's hard for me to believe Coco's final solution can have the impact she claims. I'm sure the world will not submit to her will and will not use commercialized warfare.",
            "date": "2013-04-14T20:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 93815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/suprasaiyajim",
                "username": "suprasaiyajim"
            },
            "url": "https://myanimelist.net/reviews.php?id=93815"
        },
        {
            "content": "Unlike the first season of Jormungand, Perfect Order simply does not deliver. At first, it seems to touch upon something exciting, world peace delivered by a catalyst of war. But in the end, the anime leaves you hanging. It devolves into ino a shitstorm of ecchi from honestly unattractive characters.\r\nJonah's horror at Koko's Jormungand plan could have been more fully developed. However, all that happens is Jonah running away from Koko and running back to figuratively adopted mommy in two years.\r\nAnd I feel that there are less good action scenes in Perfect Order when compared to the first season.\r\nI know this review is rather disjointedso I'll make one last concise summary.\\n\\n\r\nThis anime's ending left the taste of slightly spoiled milk in my mouth.",
            "date": "2015-07-24T15:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 194224,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4601375.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/acynicalasian",
                "username": "acynicalasian"
            },
            "url": "https://myanimelist.net/reviews.php?id=194224"
        }
    ],
    [
        {
            "content": "Guns, war, violence, deals, allies, enemies, and loyalty. What do all these words have in common? If the word, “sequel” also pops into your mind, then you guessed right because Jormungand gets a season 2 and rightfully deserves it! Jormungand: Perfect Order returns with Koko Hekmatyar along the alpha crew in this sequel and presents what they do best: making deals and kicking ass.\r\nJormungand: Perfect Order is the direct sequel of the original series, Jormungand that debuted a few month after its original ending. The sequel is written by the same author Keitaro Takahashi with White Fox handling its animation and Geneon doing the production.The series continues off from its prequel and follows Koko Hekmatyar along with her fellow crew including Jonah.\\n\\n\r\nTo refresh some things, Koko still plays her role as a young arms dealer. She retains her independent personality that can be seen as playful, cunning, deceptive, but at the same time also ruthless when the events calls for it. Her profession remains dangerous as it's not only involves dealing with other armed individuals but the fact that it's technical illegal under normal jurisdictions. As such, Koko often comes in terms with conflict where it's least expected. Luckily for her though is her crew and Jonah who are always by her side to support her work. \\n\\n\r\nThe series continues to follow a journey type of scenario. In this sequel though, the story enhances itself with its development especially in the latter half regarding the Jormungand project. But besides that, other supporting characters gets highlights even from the very beginning such as Hex and R. In fact, this focus on more supporting characters works out for the better as we can see more development from others besides just Koko and Jonah. Unfortunately though, their times are short due to the length of the series. Yet, their moments in the series captured their highlights well and expresses just how dangerous the world of Jormungand can be.\\n\\n\r\nThe dynamic duo of Koko and Jonah once again becomes entertaining to watch. At first, it's lighthearted and comedic with the usual raccoon-like expressions from both characters. Later on though, we get a bit more serious as Koko reveals her plan for world peace but not without a cost. This cost will result in both physical and emotional pain as Jonah views Koko's ways of executing her actions as a bit more immoral. She is an arms dealer who deals with weapons that causes destruction. Yet at the same time, she wishes to end destruction to the world and bring world peace. This all comes at a cost.\\n\\n\r\nLike its original series, Jormungand: Perfect Order does pack the action including those road war and full throttle shootouts. Most of happens quite fast and captures the violence of what being an arms dealer is all about because it's a dangerous profession. As result, expect blood being spilled, alliances shattered, and even deaths. At times however, the series slows with what almost seems like fillers such as the episode with Dr. Miami. But the story of this sequel progresses well with its pacing. Despite some of the slow movements, it gets to the point especially later on when  Koko's brother, Kasper gets involved with the crew. He is the man that Jonah loathes because of what happened to his past. Yet in this season, a strange alliance later forms between them that shows how far some characters have come in the series. Let's not also forget Chequita who represents herself as one of the most proficient bodyguards known in HCLI with her skills in handling armed weaponry.\\n\\n\r\nThe business of trading weapons are still present but seems to rather diminish a bit in this sequel. Luckily, it retains its realism and that being the modern times and military gadgets. The fighter planes, anti-aircraft weaponry, and rockets are all realistic and present in today's real world. Similarly, the characters themselves are depicted with realism. The way they are dressed for their profession and their skills of handling various weaponry are often presented in the series. As such, their skills are protrayed as well in handling such weapons with various skills levels between each crew member. To add on the fun part of the mix are the priceless expressions in the form of those grins, smiles, and laughs curtsey of Koko with her crew. \\n\\n\r\nThe series also continues to the idea of teamwork and how it is crucial for its members to cooperate in order to succeed in missions. In the latter half of the series, Jonah is presented with a situation where the idea presented to him isn't what he likes to hear. As such, a strain sorts is put between him and Koko. It is a bit sad to watch given everything we've seen between the likeable duo especially since the  bond is not romance but as loving partners.\\n\\n\r\nIn terms of artwork, I would say that White Fox does it again and that means a clear job on the animation department. As mentioned before, the series takes place in modern times and everything is drawn to match its themes. The characters' and their outfits fits within their professions coupled with their figures that show why they are part of the crew. Although it looks a bit dirty at times, it works out right and portrays Jormungand: PO at its finest. I appreciate it and White Fox deserves some praise.\\n\\n\r\nThe soundtrack is once again well performed by the choreographer of the series, Taku Iwasaki. He has already done work in related fields such as Gurren Lagann, R.O.D. The TV, and Soul Eater. All of these series have in common with the soundtrack involving fast paced action during intense scenes. The rap beatings and electronic blues are what makes Jormungand: Perfect Order intense. It's well done. The opening song, \"UNDER/SHAFT\" by Maon Kurosaki is also well orchestrated that demonstrates the theme of Jormungand just like season 1. Oh and let's not forget the previews of each episode that fans adore. Her name is Koko, she is Loco, I said oh no~\\n\\n\r\nUltimately, Jormungand: Perfect Order is a nice series which deserves a score of 8. Although slow at times, it makes it up with its insightful character cast where even supporting characters get their own spotlights. The ability to fuse together action and comedy in a series such as this is difficult but the directors did their jobs right this time around. It's fun to watch despite the fact that we realize how dangerous of being an arms dealer is all about. All in all, Jormungand: Perfect Order is by no means a perfect series but it is one hell of a ride.\\n",
            "date": "2012-12-27T18:07:00+00:00",
            "helpful_count": 101,
            "mal_id": 81594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=81594"
        },
        {
            "content": "TL;DR - Jormungand: PO is a good anime\r\nThe crazy hijinks and bold plans with Koko and company continue in the sequel to Jormungand. How does the second coming of Jormungand fare? I’m here to tell you that it’s better this time around. How do you improve Jormungand’s formula, you ask? You make it more focused. Spoilers for the first season finale below.\r\nSo, Koko and her friends are still roaming the world and everything is swell. Oh wait, no it’s not. The story takes place right after the end of the previous one. R is a double agent who is spying on Koko for the CIA;Hex, a woman from Kokos past, is here for blood; All this while Operation Undershaft is trying to figure out what the hell Koko is trying to do. So let’s look at the formula set for the previous season and see it it still is in place here.\\n\\n\r\n1. The crew arrives.\\n\r\n2. Stuff goes awry and they need a way out / need to out-think their opponents / straight up kill dudes.\\n\r\n3. Mission completed and on to next arc.\\n\\n\r\nYep. Although this time around the arcs are longer and more focused on storytelling rather than outmanoeuvring and killing enemies.\\n\\n\r\nHere’s a run-down on the cast if you need to freshen your memory.\\n\\n\r\nKoko Hekmatyar: Arms dealer, handling business mainly in Europe and Africa. Very charismatic and beautiful. Usually very energetic and behaving sometimes like a child, she has a ruthless interior and on multiple occasions called a monster. Although usually cool with a smile on her lips, Koko has one of the most intimidating glares in anime.\\n\\n\r\nJonah: Child soldier. His parents were killed in an air-strike and he became a child soldier shortly after. Has a strong hate for weapons, but still works for Koko, often serving as her bodyguard. He shows more understanding than expected from a child.\\n\\n\r\nLehm: Ex-Delta Force operator. Used to be active in Somalia. Second in command of Koko’s crew. Veteran mercenary who takes charge when armed conflict arises. Used to work for Koko’s father. Very versatile in weapon use, ranging from long-distance sniping to close quarters combat.\\n\\n\r\nValmet: Ex-Major serving for UN forces in Africa. Her unit got slaughtered by Chen Guoming and she lost an eye in the attack. Since then, she suffers from anxiety whenever she sets foot in Africa. Very proficient with knives and pistols. She is also in love with Koko, something which often is used as comedic relief.\\n\\n\r\nThen there are the rest of the cast, that aren’t given much other than support roles most of the time. Technically only Koko and Jonah are the only real main characters, but Valmet and Lehm are given much more time on screen than the other side characters, so they sort of sneak into main roles.\\n\\n\r\nMao: One of the regular grunts of the group. Was discharged after a training exercise went awry. Picked up by shortly after. The only one of the group to have a family (as in wife + kids). He lied to them in order to leave. Teaches science to Jonah between missions.\\n\\n\r\nR: Former Italian intelligence officer. Revealed in the last episode of the former season to be a mole for the CIA.\\n\\n\r\nUgo: Former Mafia driver and enforcer. Spared by Koko when his family was destroyed. A behemoth of a man, he possesses immense strength. The crew’s driver when needing a getaway.\\n\\n\r\nLutz: Former police sniper, part of a counter-terrorist unit. Very hesitant to kill young targets.\\n\\n\r\nTojo: Previous Japanese black-ops operative, working in places like Cuba. In charge of teaching Jonah maths between missions.\\n\\n\r\nWilee: Former explosives expert and ex-lieutenant of the 20th Engineer Brigade of the XVIII Airborne Corps of the US Army. Assigned to give Jonah English lessons between missions. Is the only member aside Koko to be black-listed by the FBI.\\n\\n\r\nThe perils of having a huge cast like this is just as apparent in the second season as it was in the first one, but the show does a better job at dealing out screen-time this time around and you quickly get a good vibe where everyone’s at. It’s still the same colourful cast with no subs, so if you liked them in the first season, there’s more goodness here. The opening arc, dealing with R being a double agent and Hex coming after Koko is without a doubt the series’ strongest, with some strong, emotional moments. It sets up a season that is in its entirety better than its predecessor. The stakes are raised for Koko and her compatriots. Nobody’s safe in this crazy world.\\n\\n\r\nThe second season takes a step back from the group dynamic at times and focuses solely on Jonah and Koko. They’re interesting contrasts. Koko is the daughter of a shipping magnate and presumably had a very peaceful, or at least pampered life as she grew up. Jonah meanwhile, grew up in a war-zone and had his parents blown up by a bomber, coincidentally sold by Koko’s brother, Kasper. Jonah hates weapons with all his being, and Koko sells them for a living. The two make a fantastic leading duo and represent the tension and morals towards the end of a magnificent series.\\n\\n\r\nThe morality of the characters are brought froward into the centre this time around, and when Koko reveals her master plan that she’s been working on for a long time, it’s surprising it wasn’t brought up earlier. I can understand the reason why it’s hidden for so long, but I don’t agree with the choice. It would have been interesting to have it in the open for longer and see how it affected the supporting characters.\\n\\n\r\nSo, the story. It’s better, considering there’s actually a story this time. From the first episode to the last, every episode is connected to Koko’s goal, which is revealed a bit into the season. The series sheds its episodic skin, and so the arcs are more focused and character-driven, much to my joy.\\n\\n\r\nThe art is just as clean and well-done as it was in the first series. Maybe even better. Some backdrops are absolutely stunning. The character design is much like the first series, although a bit more realistic in general this time around, when it comes to the supporting cast of revolving antagonists/partners.\\n\\n\r\nThe voice acting and soundtrack of the series is way better than the first season. Actors have more opportunities to get heated here and some excellent dramatic episodes bring out the best of all. The music is still top-notch, and the opening song especially is fantastic.\\n\\n\r\nThe theme and pacing are still the same in this second serving of Koko’s adventures. The more story-focused approach leads to a better balanced product, with the episodes being better structured and the tone being a bit darker. With it, my pleas for the show to have less comedy are answered, as the show did turn towards the more serious in this venture, and the show is better off without the forced comedic elements.\\n\\n\r\nThe antagonists and threatening forces this time around are more realistic and grim. There’s not a crazy villain with ridiculous fighting techniques. It’s guns vs guns and tactics + strategy in a wild dance of death.\\n\\n\r\nEnjoyment-wise, Jormungand: PO lands a step above its former series with more thrilling planning; cooler action; better humour; and tear-inducing, heart-wrenching drama. Once again with a Jormungand series, the variance is its strength, balancing several genres and giving them good time. It’s one of those series’ where you finish one episode and keep watching. Not because there’s a crazy cliffhanger, but because the atmosphere, characterisation and execution of the series is so fantastic that you can help wanting to spend more time in Koko’s mad world. Jormungand: Perfect Order is a rare gem to find in today’s anime world, a show with an identity so unique and fresh you can’t help but be swept away by its charm.",
            "date": "2013-04-30T19:49:00+00:00",
            "helpful_count": 64,
            "mal_id": 95499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20333.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Purjoloek",
                "username": "Purjoloek"
            },
            "url": "https://myanimelist.net/reviews.php?id=95499"
        },
        {
            "content": "Scoring Preconditions: While I rate all parts, the overall score takes in most consideration from story, character, and enjoyment. Art and sound are not factors in the overall, although they can slightly enhance or detract from enjoyment portion. I score from as unbiased a view as possible and I view it in a critical sense, not in a simple enjoyment sense. Thus I give at most a one point overall bonus for enjoyment. Story and characters matter most. I will state exceptions to this rule depending on the anime.\r\nSummary: I felt the premise of the anime was weak from the get go. For those whodon't know, the makers of Black Lagoon made Jormungand. Now the key difference between Jormungand and Jormungand: Perfect Order is 1) Darker feel 2) More plot. Otherwise, its very similar to Black Lagoon in its all out action feel. Details to follow.\\n\\n\r\nStory (4/10): Koko wants to build a supercomputer and do what with it? Spoiler alert: Crash every flying thing down to earth. This is the plot. Nothing intricate to it. No offense, but Treyarch had more creative ideas with Call of Duty. The story isn't original at all and the maker didn't make the plot complicated. Essentially Koko succeeds every time and her goons get everything necessary for the computer.With the notable exception of Jonah and his running away part, everything was entirely predictable. And Jonah's past really was pointless throughout this whole anime. I'll talk more on Jonah in the characters section. In general, the plot was pretty generic and on its own, not worth the watch. And finally, the makers tried to add some morality talk similar to with Black Lagoon, but unlike with Black Lagoon, they failed epically here.\\n\\n\r\nArt (10/10): Other than the fact that the Hekmatyars and Jonah are albino, I found the artwork enjoyable. Perhaps they were pointy chinned, but I fail to see the problem. Of course art is subjective so I won't deny that it may not appeal to certain people. But I thought it enhanced the anime. If nothing else, the gun artwork was pretty epic.\\n\\n\r\nSound (10/10): The opening theme UNDER/SHAFT is on my playlist and I enjoyed the song. Ending theme I felt was not really a match with the mood. Gun noise and background music enhanced the feel of the anime.\\n\\n\r\nCharacter (7/10): I want to start off by saying that Koko gets crazier in the second season. She loses her more comical sense in favor of a tyrant like temperament. I personally have no problem with that. Compared to the second season, I felt it was more realistic of an arms dealer. We also got a better look at her true inner feelings so character development for Koko was great. Now on to Jonah. I'm still not sure whether to like Jonah or hate him. First of all, the idea of a child soldier being the center piece is ridiculous. The fact that he is surviving and actually killing professionally trained adults is beyond me. But the bigger problem I have with him is his whole do I hate or do I not hate Kasper Hekmatyar. No offense but if you really hated him, you wouldn't look to him as your next employer after running away from Koko. After all, he did starve him in a shipping container for a week. Jonah does play the quiet role well though. But I had a bigger problem with the fact that his character development really goes nowhere. He first says no to project Jormungand and runs away only to change his mind and return to Koko. I have a hard time with characters that can't make up their mind and seeing as this basically consisted of the last couple episodes, both the story and the character suffers for it. The only reason the character score isn't a 3 is because I love Koko.\\n\\n\r\nEnjoyment (10/10): Now I watched this anime in anticipation of the action. The gunfights in this season as well as the first are still some of the best I've seen. While not always entirely realistic, it was great to watch. If I had to describe it, it was like watching a first person shooter in reality from a third person view. You get a lot more cool but unrealistic stuff and the guns are up close. That and Koko as a character was sufficient enjoyment for me. \\n\\n\r\nOverall (6/10): First off, I weighed the enjoyment a little more here seeing as the action is its biggest asset. The story and Jonah merits a 5 or lower overall, but Koko and the action add more to this anime. The reason I don't give it a 7 though is because the premise of this anime was bs. i simply can't give it a higher score from a critical perspective as it really wasn't all that good. I'd say as a viewer, its at least a 9/10, but from a critical sense this is the score i give because it is neither creative nor intelligent. One word to describe this season and the first is: explosive.\\n\\n\r\nThanks for reading this. I'm open for discussion so if you have anything to add, message me and I will get back to you.\\n",
            "date": "2014-10-28T16:26:00+00:00",
            "helpful_count": 41,
            "mal_id": 166571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4143293.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Emperormin3",
                "username": "Emperormin3"
            },
            "url": "https://myanimelist.net/reviews.php?id=166571"
        },
        {
            "content": "I'm going to make this short and simple. \r\nThe character development was prize the for the show. It's not easy selling weapons, knowing that your life is actually on the line and that you are considered a merchant of death.Some arms dealers do for the money, some do it for the fame, but Koko does it for World Peace. Arms dealing might not be the greatest idea for world peace, and can be considered downright hypocrisy, but Koko's work is based on necessary evil, where evil deeds must be done into order for good to arise.\r\n As for other protagonist, Jonah, he travels and protectsKoko with his life, even though his parents were killed by the very weapons sold by arms dealers. It might be ironic, but he does it as a sacrifice so others can live a better life, even though he hates wars, weapons, and arm dealers. Jonah and Koko might have contradicting beliefs, but they work together for the betterment of others. \\n\\n\r\nI also enjoyed the other characters. It's nice to know a girl who can kick your ass like Valmet, who's probably the scariest and most physical imposing member of the group, but she does show some softness towards Koko, but no mercy against men. The other characters like Lehm, Willie, Tojo, Lutz, and others all might come from tough backgrounds like special forces and secret organizations, but they tend to grow on you as human beings.\\n\\n\r\nAs for the story plot, the first series (Jormungand) is like a scattershot of action and of the group's adventure through the arms market. However, it's this series  that connects the dots and shows what Koko was plotting all along. I admit that I was confused what Jormungand had to do with the anime because it took all the way to the last couple episodes to know what Jormungand was all about. \\n\\n\r\nAnyways, I must say the show is enjoyable due to the innovation and cooperation of the group to achieve their goal. Also, the combination of the undercover arms dealers and intelligence organizations teaches a lot about the underworld of arms trading and intelligence gathering, which some might be considered fictional. Conclusion wise, I actually want the series to continue due to the underwhelming ending, but the manga is complete as well as the anime.",
            "date": "2013-05-10T11:06:00+00:00",
            "helpful_count": 40,
            "mal_id": 96633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2409823.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Samjoko",
                "username": "Samjoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=96633"
        },
        {
            "content": "“Knowledge is power. Information is power. The secreting or hoarding of knowledge or information may be an act of tyranny camouflaged as humility” - Robin Morgan.\r\nWar indeed can be viewed as an inescapable and integral aspect of human culture. Sources claim 14,500 wars have taken place between 3500 BC and the late 20th century, costing 3.5 billion lives, leaving only 300 years of peace, but one dynamic concept of war has always been the tools used to wage it. We’ve seen the early man start with stones and clubs to advance to swords and with the discovery of gunpowder, bullets have also come into thefray, and the deadly nuclear and atomic warfare have also taken flight. The latest addition to this devastation inflicting family is information technology, but does this seemingly docile and easily accessible piece of technology be considered the most deadly weapon man has ever created?\\n\\n\r\nThe second season of Jormungand, sub-named ‘Perfect Order’ comes with some changes in plot devices as the arms dealing takes a back seat in place of informational warfare. We are introduced to the fact that Koko has some sort of plan in the making as we see her send several rockets into space with the viewer kept completely in the dark as to what could be the reason for this. Although not a mystery series, the way the plot and secrets nicely unfolds is both smart and entertaining at the same time.\\n\\n\r\nUnlike the first season, intelligence agencies such as the CIA play a bigger role in the story. Viewers kept in the dark as to Koko’s plans are smartly inserted into the shoes of intelligence agencies as they try to discover what it is she is up to, this somewhat different approach is a welcome addition as it requires a bit of intuition from the viewer to keep up with the story unlike most series that just require you to simply look at the screen and diffuse any useless information that comes your way. The prequel was never presented with an antagonist that seemed would be able to go toe to toe against Koko in terms of wit but the second season states a claim on this with the introduction of new characters such as Hex and George Black who definitely seem to have the potential to push Koko and her crew to the wall. \\n\\n\r\nJust as in the first season the series progresses in bi-episodic arcs, while this is a good strategy that helps the writer to focus completely on one aspect of the story, it also poses a problem of connection. Once one arc is over, the connection between the previous and the next arc is most of the time thread-thin. Only very brief conversations about the previous arc serves as the basis to connecting two story joints which can make the series seems a bit disjointed a times. Fortunately only being a 12 episode show it manages not to suffer the long term effects of such a predicament as it poses serious problem to character growth.\\n\\n\r\nWhite fox have of course done a great job with the visuals, some nice notables was the studios use of shading, shadows were nicely placed in appropriate locations such as faces that depicted facial buildup of the characters and especially on the clothes. Some stressed emotions such as rage are also nicely conveyed by use of shading right under characters eyes. Being a show that depicted modern warfare it also consisted of mechanical parts such as vehicles and helicopters, the studio decided to use CGI to animate this. The CGI most of the times remains seamless with the surroundings and impressively a times we see mesh perfectly when interacting with hand drawn characters however those CGI elements that used a somewhat darker color tone seemed a bit sloppy and carried with it all that most anime fans resent of CGI animation. The second season also placed strong emphasis on location, as the team traveled to a large number of different cities around the world and white fox of course did not slack off on doing their research to make sure they capture a city’s scenery and populace accurately into the fray.\\n\\n\r\nThe place where the second season seemed to outdo itself far more than the first was with its choices of soundtracks. The soundtrack of the first season was great and honestly it was really unexpected that it would be something that could be built upon, but regardless it was done and with brilliant execution if i may add. The soundtrack consists of tracks from the first season, remixes of those tracks as well instrumentals that spanned into several genres such as rock, rap and even electro. Insert songs were included that to my surprise even included some Indian and French tracks.\\n\\n\r\nIn the first season Koko has always seemed one dimensional in her emotions, always reserving a cool, calm and collected demeanor, so it was with great joy that this mask of hers is cast away at certain places as we see a different side to her emotions; Fear, grief and rage are ultimately introduced into her character in certain places that went a long way in making her character seem ‘human’. The relationship between Koko and Jonah is also put to the test as their already seemingly weird unpronounced relationship is put under serious strain in some places and the overall decisions and actions they choose to take make up a big turning point in the show itself.\\n\\n\r\nOne of the first departments the series decided to give attention to was with the development of side characters, an aspect that was left barely touched from the first season. We get to see the past of the remaining members such as Tojo, R and Wilee up to their meeting with Koko. Instead of the show simply showing an entire episode of a characters’ past, it approaches it smartly by interchanging events between the past and the present, this ensured both development and advancement of the story at the same time, a “killing two birds with one stone” strategy if you’d like to call it. The lack of development in the first season that would no doubt leave fans with either Koko, Jonah or Lehm as character favorites are immediately put at risk as characters such as Wilee are presented to us in such an entertaining manner that one has to re-think their plans of favorite character. \\n\\n\r\nWhile we do get to see the whole characters in the series finally developed and create a stronger connection to them emotionally, the end- result however was never built upon. A character immediately having their arcs completed are afterwards seemingly put back under the rock from which they were picked up from and revert to be nothing more than filling spaces as they once were. This blatant disregard and ignorance on the part of the writers will prove to be an extremely wasted potential as it was basically a great chance that opened new pathways and possibilities that the series could have and should have advanced in but never did.\\n\\n\r\nWith a mere 4 months between the first and second season we didn’t see too many improvements to the overall series as a whole, but there are little improvements here and there as we see in the thickening plot and the music. The series does still harbor it’s set of entertaining gun fights that with the help of great animation from white fox will leave most audiences dazzled.\\n\\n\r\nAs time moves on, man will continue to advance his science and technology, and with information warfare being his latest weapon, we have to wait and see what new toy we can make in future to better and effectively kill each another.\\n",
            "date": "2013-01-10T03:30:00+00:00",
            "helpful_count": 27,
            "mal_id": 83239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1019085.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zee530",
                "username": "Zee530"
            },
            "url": "https://myanimelist.net/reviews.php?id=83239"
        },
        {
            "content": "Worst ending I've ever seen in a show.  Right before this I finished Beyond the Boundary and that had a crap ending, but it was just saccharine sweet bullshit that ruined the last minute or so of the show, but this goes above and beyond that.\r\nJormungand is a show about an arms dealer planning and maneuvering to execute her master plan to save the world from war.  The problem?  Her plan is fucking assinine.  The entire show hints at this super complex incredibly important end game that's the reason we've been sneaking around and orchestrating all these different conflicts, and thenthe plan makes no fucking sense whatsoever.\\n\\n\r\nI don't know what to say  other than that.  The entire story leads up to the reveal, but even the slightest amount of critical thinking will tell you that the plan will never work, has too many drawbacks, and the main drawback mentioned (not to spoil, but its a fucking humdinger) could be mitigated with a little extra effort.\\n\\n\r\nThe entire show this wonder squad of badasses has been nigh untouchable and 50 moves ahead of the opposition.  No one ever pulls a fast one over on the main characters, and they just mow through any and all opposition without a thought.\\n\\n\r\nThere are no stakes, and it throws all logic and character development under the bus at the last minute.\\n\\n\r\nAs soon as the reveal happened this went from an 8/10 to a 3/10.",
            "date": "2017-12-01T21:33:00+00:00",
            "helpful_count": 7,
            "mal_id": 264339,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6027134.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MrConductor",
                "username": "MrConductor"
            },
            "url": "https://myanimelist.net/reviews.php?id=264339"
        },
        {
            "content": "Ok, this is my edited review of this anime since, co'z a certain dude thinks that it has a lot of spoilers.......or was it just because I'm being singled out, ehhhh, who cares ok so please pardon my boring and unsensible review of   this sequel, so let's get down to business. Now that I've ending watching this sequel, I kinda find this sequel as good as the previous season, since it still has the usual gun fights and the usual blood and gore. As usual it still involves the dangerous life of Koko and her posses' in which every episode was action packed,however unlike the previous, this time Koko is better, badder and uglier than before. Here, she was no longer your typical arms dealer who is in competition with other arms dealer and staying one step ahead of those who wanna kill her, she was now a textbook definition of a TV show villainess who wants to rule the world. Though it was said in episode 12 that she hasn't activated the \"Jormungand\" system her prediction from episode 11 contradicts it as if if she as a hand  as to how the world when in to chaos, 2 years after Jonah left her. Jonah on the other hand, is the usual hypocrite that I would like to put on the firing squad, to me I see him as either very stupid for leaving one arms dealer only work for another arms dealer and go back to the same arms dealer in the end, when in fact he hates arms dealers in the first place or he's very smart for being able to survived a lot dangerous encounters, either way I wish he could have killed Koko, then again, wtf am I saying? As for the other characters, I hate it when the CIA who were supposed to be the good guys turn up to be a bunch of bungling keystone cops, especially when George Black got a taste of his own operation called \"Undershaft.\" As for the 3 scientist, Minami, Rabbitfoot and Elena I would have like to see some onsen fanservce of those three, but too bad it was censored. Ok, so enough talk, how did I rate this sequel? \\n\\n\r\nHere's how:\\n\\n\r\nStory: Good 7.\\n\\n\r\nStill has the usual plot and violence for grown ups.\\n\\n\r\nArt: Mediocre 5.\\n\\n\r\nStill the same character design, though I would like to see some intense fanservce with the babes including Valment, man, I like FBB who are also Milfs.\\n\\n\r\nSound: Good 7.\\n\\n\r\nSince I like both opening and closing theme.\\n\\n\r\nCharacters, enjoyment, overall: Fair 6.\\n\\n\r\nThe character's are still there more better, badder and uglier, which to me makes Koko and her posses' an unlikable character, the enjoyment.........still awesome except I would have wish that Scarecrow would have capture the  Hekmatyars. Overall, hummm, if I were this anime's director, Keitaro Motonaga, I would have end it this way:\\n\\n\r\n-After 2 years have pass Koko and Jonah met again, but ignored each other.\\n\\n\r\n-Jonah, being tired of working for an arms dealer and seeing all the chaos happening wanted to leave and was granted, he was awarded with large sums of cash to start over and he was able to go home hoping that his village would have rebuilt itself.\\n\\n\r\n-Jonah came hope and saw his village slowly rebuilding itself and was greeted by the people who recognize him.\\n\\n\r\n- And here the \"Pièce de résistance\" Jonah (smiling), made a promise that he'll never hold a weapon nor will he kill anyone again. \\n\\n\r\n-The end.\\n\\n\r\nOverall, such ending would have provide a good ending, which btw this sequel ended stupidly but still entertaining, but hey, that's just me. \\n\\n\r\nBTW: If any spoilers are present, then excuuuuuussssssseeeeeee me. Co'z most of everyone else's review would contain a spoiler or 2, jaz saying, no disrespect.\\n\\n",
            "date": "2013-01-06T09:47:00+00:00",
            "helpful_count": 14,
            "mal_id": 82862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=82862"
        },
        {
            "content": "If you don't like to feel CONFLICTED, not because of the issues the anime raises, but of the anime itself, DON'T WATCH THIS ONE!\r\nI watched both seasons in like, 3 days! It's pretty engrossing with all the gun fights and the cool background setting. It seems realistic, but don't get too into it, because in the end, it's all fiction. \r\nI was having a hard time understanding why I didn't like it as much as when I first started watching it. The ending, for me, wasn't satisfying at all. It really was underwhelming with all the hype it had built up (especially towards the endof season two). \\n\\n\r\nNo real character development except for Koko, who isn't even the main character! Wait, it's not even character development, she just simply reveals herself. Jonah, the protagonist went nowhere in the series! Really, Jonah? I honestly liked you so much until the end... And Koko, don't get me started on her. She's cool, yea, real cool, at first. She went real loco later on indeed. \\n\\n\r\nI'm like so UGHHHHH right now...\\n\\n\r\nTo be fair, the series has very memorable quotes! The issues are real, but the story was only ok. \\n\\n\r\n\"In this world, guns are always within arm's reach, and sadly they are more trustworthy than kindness.\" --Koko\\n\\n\r\nOVERALL: Started out cool, intense climax, then plunged right down the bottom of the ocean, leaving me hanging: \"Wait, what just happened? That was all for nothing? Now we're just at the beginning again? HUHHHHH????\"",
            "date": "2015-03-29T06:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 183901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2691761.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/riri9",
                "username": "riri9"
            },
            "url": "https://myanimelist.net/reviews.php?id=183901"
        },
        {
            "content": "There is something wrong about Jormungand. I felt it in the first season, but I dismissed it as my lack of understanding of the characters and plot in general. I wanted to revisit the characters' psychology again in the second season. I wasn't expecting much more development out of Jormungand. I mean, there were tiny hints in the first season that showed the direction where this series is going, mainly from Koko's words, so the plot development in fact did not interest me much. I wanted to understand the characters more and the reasons behind their actions, but it turned out to be disappointing, alongwith the plot too.\\n\\n\r\nJormungand has complex characters and plot, but they are all pieced together. This is the most serious flaw of Jormungand. The people beside Koko all are pretty unique, but honestly their uniqueness tells nothing about themselves and most importantly, how it works in the big picture. In other words, their unique personalities don't drive one bit of the story. That's where a potentially character driven story becomes no longer so. What's more unfortunate is Jormungand was not designed to be plot driven but character driven. Of course, this can be saved by Koko. If Koko's character is strong enough to drive the plot and other characters, Jormungand can be saved. \\n\r\nI thought Koko's characterization is pretty strong since the very beginning, but I changed my mind after the second season. Even Koko is pieced together and lacks integrity as a character. She did not change throughout the series. In fact, I think she is probably the only one who stayed the same. I don't really mind it. Jonah is there so to put a leash on herself, but even in that respect, Koko did not change.Some of her comrades died too, but she did not change. I don't mind it. She has her beliefs and resolves, so she doesn't need to change. \\n\r\nBut, it's not the fact she didn't change that failed to make Jormungand come together. It''s the fact that jonan did not change, and from this fact, you'll come to understand the biggest flaw. I can see how Jonah is struggling inside with his wavering beliefs, but Jormungand didn't convey in the end the change in Johah. Yes, he ended up accepting sacrificing a few to protect the mass, but how did that change take place inside of him? It seems to me that he simply ended up relying on Koko too much, accepting her way of doing things more than how others like her brother does the trade. If this is the case, what's the whole point of Jonah's character? Having a kid beside a powerful queen gives a nice picture, but  the fact Jonah simply grew a habit but not growing or developing as a character made Jonah's existence pretty meaningless. This is even more obvious when you look at the other team members. We get a glimpse into their past, but what's even the meaning of showing the past when it makes no difference to the progression of present events? Are we to feel more attached to those characters? Honestly I did not feel any because they did not contribute anything to the story except helping Koko win all the gun fights. \\n\r\nYou might say that it's more about the political mind of people rather than their emotional side. I agree if it's about the antagonists of the story. They are there to demonstrate the political sides of things. But the protagonists aren't intended that way. \\n\\n\r\nThe part that made me realize that even Koko doesn't have the depth to support this whole complicated story is the ending. This is also related to the theme of Jormungand. Koko hates the weapon trading world and weapons in general. Her belief is not very different from Jonah's. She knows just hating things won't change anything, so she took on the role she dislikes the most to change things from the inside. She doesn't even mind making sacrifices if necessary. This is all her motives and intentions, but what about her psychology? The fact that she thinks that giving people the original beauty of the world would bring out their shame and make them stop only showed me that Koko does not have a psychological depth. Why? Because this naive thinking contradicts her character in general. To put it bluntly, I didn't expect Koko to think that way considering her actions and words from the past. It disappointed me. If she were just a shallow thinking person in the beginning, this thought wouldn't bother me. But Koko isn't depicted as a shallow thinking person. You might say it's just her ideology, and ideologies are suppose to be naive. But Koko is not an ideological person. She is a very practical person who is more about actions than about words, and that's why she has the ability to carry out her grand plan.\\n\r\nOVerall, this made me realize that the concepts behind the characters, even in Koko's case, were not well planned out. I feel like the staff put together a whole variety of personalities and ideologies just to make the characters and story complex and engaging. For me, however, it failed to work because I don't believe you can ever reach the whole from connecting the pieces. It's a philosophical belief of mine based on the idea that you can never reach enough connections because there are limitless number of them. In other workds, Jormungand's characters and stories are designed from bottom up rather than top down, and this made the series fall flat at the end.\\n\\n\r\nThe reason I won't rate Jormungand any lower is because Jormungand is potentially a good story with a good theme. After finding the flaw in its set-up, I started to think it actually isn't too bad considering it could be much worse. \\n\\n\\n\\n\\n\\n",
            "date": "2013-01-03T07:58:00+00:00",
            "helpful_count": 12,
            "mal_id": 82510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/526945.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/movoning",
                "username": "movoning"
            },
            "url": "https://myanimelist.net/reviews.php?id=82510"
        },
        {
            "content": "Along with the ridiculous master plan of the main charater to crash every plane with no survivors, the gunfights, and the combat in general feels childish, it's like the creators never even saw a gun shot. The show goes from spraying someone from 5 meters and not hitting them to accurately sniping from distance with the same gun. It's like they threw any hint of realism out in favour of \"coolnes\" but kinda backfired because in a \"adult\" anime it makes it look idiotic. The show is stuck between trying to be serious with \"heavy\" plot and realistic combat then it turns around and havemain characters walk into machinegun fire and come out unscathed while also killing the enemy like a cheap hollywood action movie. Also we don't actually see the outcome of the masterplan.",
            "date": "2018-10-30T20:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 293026,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525838.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/deathabarbar",
                "username": "deathabarbar"
            },
            "url": "https://myanimelist.net/reviews.php?id=293026"
        },
        {
            "content": "This review will cover the whole series. \r\nStory:\r\nThe story. Well. I give it 10/10. I like the whole plot and how the story follows a straight line, where the viewer is sometimes led back in time to get a better grasp of certain characters past and how they got involved with Koko. I really love how the story takes place in real places and to see how the story has been inspired by real war events. I just love it. The story it self is very well crafted and doesn't leave the viewer with a mindfuc*, but leaves an almost complete puzzle, but with anending that enables the viewer's imagination to take over. The story gets more and more intense by almost every episode. I never had the urge to sleep during this anime.\\n\r\nI should also mention that this anime is filled with shooting and action. If you like that sort of anime, then I can recommend this one.\\n\\n\r\nArt/animation:\\n\r\nThe art/animation is great. The colors and the depiction of places are \"realistic\", so to speak. The colors aren't too bright, but rather washed out. A bit like the animation of \"Monster\", which I also have written a review about. Overall it gets 9/10 .\\n\\n\r\nSound:\\n\r\nThe sound is good, but nothing out of the ordinary. The voice actors all do a great job, the sound of firing and explosions are realistic. The music good, but really nothing that I noticed during the series. But I love both openings and both endings. \\n\r\n7/10\\n\\n\r\nCharacter:\\n\r\n8/10\\n\r\nOkay. This one I struggled with during the whole series. I had a problem which I've never encountered before, concerning anime. I had a really hard time remembering the faces of the female characters because I think they some of them look very much a like. Besides that everything is great. The design of the characters fits very well to their roles. And their body structure fits to their personality, past and current position. \\n\\n\r\nEnjoyment:\\n\r\n10/10\\n\r\nI enjoyed the anime quite a lot. I love how the anime follows a straight line, but goes back and forth into characters past. I really enjoy the realistic war-events (some inspired by the horrible events in the Balkan war). I loved to see Jonah grow and becoming more aware of what's going on around him. I enjoyed this anime to the very end, even beyond(letting my imagination take over after the ending, sitting outside with my churchwarden pipe and just.. enjoying it). \\n\\n\r\nOverall:\\n\r\n9/10\\n\\n\r\nOverall I can recommend this anime to anime who likes an action filled anime, with lots of shooting and explosions, but also those who likes seeing a child growing and developing it's emotions. I certainly enjoyed this anime. And if you like the animes that has what I mentioned above, this is an anime for you.",
            "date": "2013-01-12T17:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 83489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1933410.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BakaShinjiIkari",
                "username": "BakaShinjiIkari"
            },
            "url": "https://myanimelist.net/reviews.php?id=83489"
        },
        {
            "content": "“Fun, funny and packed with well-achieved action scenes. An enjoyable show with a great premise that lacked the backbone to end with a bang. ”\r\nREVIEW FREE OF SPOILERS!\r\nLet me begin this show with two statements I said on the review of the first season.\r\n1) A plot built around arms dealing isn’t one of the most original things ever, we have seen it in movies such as “Lord of War” (Nicolas Cage) or “The International” (Clive Owen), nevertheless the use of this plot isn’t overused as many others subjects related to war, which makes this show sort of “unique”.\r\n2) The first season was more of aplanning for the second season, by this I mean that the “pieces” –characters and situations- where being placed just like chessboard.  In order to achieve –probably- a more detailed story with a background.\\n\r\nHaving said these two statements, I will rate this show in view of that –that it’s a whole- and not just as a simple “stand-alone” season.\\n\\n\r\n-STORY: 7-\\n\r\nSelecting a title for a “work” –whether a movie, book, TV show or whatever- is one of the most important things for sometimes the title is slightly counterproductive or it might give hints of the direction they are leading towards, such is the case of this show –in my opinion-. \\n\r\nIf you know something about Norse mythology, a word or name such as “Jörmungandr” (aka Midgard Serpent or World Serpent) will definitely give you a very strong idea of what the characters are trying to do.\\n\r\nWhether they achieve it or not is one of the things that will get you hooked up.\\n\\n\r\nNow, leaving aside the fact that the title –amazingly- “spills the beans” of the show, the story of “JORMUNGAND” –season 2- is interesting and to some extent original, after all, since the beginning of the show the MC’s are trying to save the world. Each and every one on their own way –thing that I find delightful and well-achieved-, BUT it IS predictable. Does this means that the story on the second season is unoriginal or boring? No, it is original, more importantly it is unique on the way they –the writers- are doing the story, and by this I mean the main focus. Although you shouldn’t get carried away. Yes, the story is well-written, it entices you and it makes you want more, but in the end the show fails to achieve the “explosive” final that seems to be guaranteed with the premise and most importantly with the “journey” of the characters.\\n\\n\r\nThe second season pics up after the “cliffhanger” –to call it somehow- and the revelation of the first season, leading to a better-grounded plot and most importantly to a “richer” story, nonetheless the writers of the story didn’t deliver, they looked, self-complaisant, lazy and most importantly conformist, the story containing a better “pillar” wasn’t “squeezed” and the story just kept on following the same repetitive “straight-line” showed on the previous season instead of the “adventurous” path they could have chosen.\\n\\n\r\n-ART: 9- \\n\r\nWith so little time between season one and season two there’s not much difference between both arts depicted in both shows. Still, the art is remarkable; it’s well detailed but not perfect. Although, the actions scenes were incredibly well achieved, and the characters and guns are amazing. Slightly better than in the previous season.\\n\\n\\n\r\n-SOUND: 7-\\n\r\nI usually open with the voice actors review, but there’s a reason why I will open with the soundtrack part.\\n\\n\r\nMy statement on the soundtrack of the previous season was that it was good but it wasn’t imposing anything new or interesting.  Regretfully for the soundtrack team on this second season of “JORMUNGAND”, I will use one word to describe their work, and the word is “Slothful”. Being a musician isn’t something easy -I know myself that, after all I create/write music- but falling into the same pattern or in this case “recycling” most of the previous soundtrack by just remixing it’s sad. There was nothing new except a few songs. The work they displayed was just a back-step instead of a progressive one. Don’t misunderstand me, the music is good –not great or bad- but the lack of creativity was a demotivation.\\n\\n\r\nIn the “SOUND Department” the voice acting IS the jewel of the crown. The script reaches –in comparison with the previous season- a more deep and meaningful dialogue. And the voice actors where capable of transfer that “deepness” –especially Mitsumi Tamura (Jonathan Mar).\\n\\n\r\n-CHARACTER: 10-\\n\r\nThe “Character Department” in this second season amazed me, THE best thing in the show. What they lacked in sound and other areas they have it on the character development, for the writers of the show gave them a very well deserved attention, and not just to our MC’s but also to the side characters. But the jewel within the character development is Jonathan Mar. He grows up and gets an amazing development.\\n\\n\r\nMeanwhile Koko gets a poorly made development –in my opinion- getting a typical and predictable crazier/obsessive look in this second season, UNTIL the last episode. Still she’s a character that is lovable and memorable.\\n\\n\r\n-ENJOYMENT: 8 & OVERALL: 8.2-\\n\r\nAfter this entire critic I made about “JORMUNGAND” I still think that is an enjoyable show, and as I said previously it’s mostly because of the characters within the story. And of course, because of the action within it.\\n\r\nI will say this again, “JORMUNGAND” is a show that fails to deliver an explosive final, BUT it gives something else, something good and deep.\\n\\n\r\nThanks for reading!",
            "date": "2014-11-07T14:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 167763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4195751.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GonWithARose",
                "username": "GonWithARose"
            },
            "url": "https://myanimelist.net/reviews.php?id=167763"
        },
        {
            "content": "Story: 8.5\r\nAnother beautifully complex story that you won't get till the very end. After Finishing Jormungand with a cliff hanger we must jump right into Jormungand Perfect order still not knowing yet what Jormungand even is. Is it a WMD a Bidding Chip or some massive technological advancement.....only time will tell. Even the ending of Perfect Order will leave you on the end of your seat \r\neither: \r\na) Mind Blown at what you just witnessed or\r\nb) Me, still asking questions that you want answered\r\nEnding: 7\r\nB) As stated the ending personally left me wanting something more, regardless of the ending being good it wasn't great. Neverthelessit did leave us with a cliffhanger to ponder many possibilities.\\n\\n\r\nSolid Plot: 8\\n\r\nThe plot was great. Each episode leaving you wanting more and never a dull moment. A quality action guns blazing, blow sh@t up anime. Also unlike other shorts Jormungand has each episode have relevance to either character development or the main story line which is fantastic. \\n\\n\r\nMoral: 8.5\\n\r\nEvery anime has to have some sort of hidden deeper meaning, that they wish to convey. With Jormungand it was the majorly debated issue of world piece and the theme \"insanity\". Jormungand shows us that only those willing to spill blood in the present have the right to pave the way towards our future. As Jonah says to Koko \"both you and the world are crazy.\" In a crazy world we must do crazy things. The moral would've got a 10 if it had have been consistent  \\n\\n\r\nSense: 8.5\\n\r\nYou get shot in the head you die, you get betrayed you feel betrayel, somebody dies you honour their death. All themes that Jormungand stays true to in attaining a level of realism in accordance to its genres. \\n\\n\r\nMusic: 8.5\\n\r\nProbably one of the best anime's when it also comes to theme songs and timed moment beats. \"Her name his koko she is loco i said oh oh\" A tune that will get stuck in your head for days and days. When there's a gunfight fast paced music is played when somebody dies its slow. \\n\\n\r\nArt: 8.5\\n\r\nExplosions, blood, guns, scenery and character design where all quite amazing. Guns where pictured down to the detail and no two characters had the same frame. The scenery was quite amazing (especially if in 1080p) and the explosions/implosions where all also fantastic.\\n\\n\r\nCharacters: 8.5\\n\r\nCharacter design and development was flawless. They couldn't have done anything better (maybe like 1 or 2 things but) within 12 episodes they ensured we got to learn about the characters past and why they joined Koko's team. The emotions each character also portrays stays true to what we know about them and their past. Eg: A character who had a harsh past life is able to forget about most of her troubles due to finding love, however we see that not all of her troubles are forgotten. Quite fantastic.\\n\\n\r\nBoredom Factor: 8.5 \\n\r\nWas i sitting away piking my nails or was at the edge of my seat saying \"kill him kill him\". An 8.5 for \"killing him\".\\n\\n\r\nCaptivation Scale: 9\\n\r\nLeaving us always wanting more with every episode and giving us what we desire, explosions and blood thrown in with some mystery.\\n\\n\r\nPersonal Score: 8.5\\n\r\nThey pretty much did everything right, except for me with the ending didn't hit an all time high. Though this anime was easily able to jump right in into my top 5. If you havnt seen it Watch it RIGHT NOW\\n\\n\r\nGenres-\\n\r\nAction: 8.5\\n\r\nIn nearly every episode someone would either die or something would get blown up. What more could an Action genre ask for (maybe a nuclear bomb)\\n\\n\r\nOverall (Average) - 8.8529\\n",
            "date": "2013-03-10T07:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 89263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2277829.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuLair",
                "username": "OtakuLair"
            },
            "url": "https://myanimelist.net/reviews.php?id=89263"
        },
        {
            "content": "Seriously a love/hate relationship with this anime...\r\nNot sure if I'm feeling frustrated or upset but I guess to sum it up... This anime does if not a GREAT but OUTSTANDING job with creating extremely fascinating characters even with whatever little backstory they have\r\nChiquita, Karen, Sofia, The Witch, Orchestra, just to name a mere few favorites every character was so unique and a blast every time they were on screen!\r\nMy only gripe is ::may or not be a spoiler:: that either characters die TOO FAST or some don't even get into many fights at all... or just a lot of characters DON'T DIE so unfortunately younever really feel any danger or game of thrones/attack on titan type of \"oh my gosh!\" mouth opening moments...\\n\\n\r\nLong story short... Really more of a story type drama/morals/thought provoking anime in the end... Action wise too few to really enjoy and end too fast before you can really carry some emotional weight with the outcomes.",
            "date": "2016-02-16T02:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 211015,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anilist637",
                "username": "Anilist637"
            },
            "url": "https://myanimelist.net/reviews.php?id=211015"
        },
        {
            "content": "In my other review, I talked about how much I loved the first season of Jormungand. Here is the second season, which I obviously was not a fan of. The story was alright, and it transitioned smoothly, until near the end,--which I won't spoil--where it kind of just became really jagged and rough, like an unfinished product. The art is great as usual, just like the first season, with that semi-realistic anime style mixed in with the realistic surroundings. The sound was okay, but not as good as the first season. The opening wasn't one I personally enjoyed, but Inormally don't like the second opening of any anime, due to changes and the like. The characters were great as usual, but they seemed to change somewhat between the first and second seasons--maybe because they were wrapping up the story, but some characters just weren't the same anymore. I get that it may have been meant to end up like that, but I didn't like it personally, and that goes into enjoyment. I really didn't enjoy this season. I can't lie--I really disliked it. It wrapped up the story in a way I really disliked, and it might have been better if there were more episodes to make the transition smoother, I don't know. I legitimately had to force myself to finish the last four episodes, and normally, I don't have to do this. I really didn't like this second season, and, in contrast from the first, I'd say it's just not nearly as good. I would recommend this for anyone who likes action and politics, but the story just really lacks in this season. I do encourage anyone who has seen the first season to watch this season, too, however, since it's best to know the ending. Who knows, maybe the manga is better.",
            "date": "2016-07-20T13:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 224500,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5498121.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/morningxtea",
                "username": "morningxtea"
            },
            "url": "https://myanimelist.net/reviews.php?id=224500"
        },
        {
            "content": "This has got to be one of the most ridiculous animes I've seen in awhile. The gun battles are just terribly sad and the dialog is something you'd expect from a little kids cartoon. Yet this anime has a R17+ rating. What exactly is their target audience? I suppose if you live on an island completely isolated from firearm ownership you might fool them into thinking you cant hit someone running straight at you a stones throw away with an ak-47 but come on! You cant have that same character turn and shoot some snipers off a building like it was nothing and expect meto disconnect my brain and ignore that! This... This is just too absurd to watch.",
            "date": "2013-01-20T22:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 84325,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/363863.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pontiac",
                "username": "Pontiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=84325"
        },
        {
            "content": "First off I want to point out that this is not a story for everyone, honestly, the morality of the choices that the individuals in this series demonstrate are ambiguous, at best. \r\nThe show really delves into the protagonist group of arms dealers under one Koko Hekmatyar, and their dealings all around the world from militaries, to militias to the mafias. Each encounter gives more insight into the character of Koko while keeping a mysterious mask over her true goals and intentions.\r\nWhen looking at the characters in her group, which is a key aspect of the series, it's important to understand that each one wassomehow affected by war and have first-hand experiences that are written in a believable manner. Throughout the series, the individual stories and histories of each person in the group are touched upon and the series does a great job to flesh out and make it understandable why each person does what they do and how they gained the skills they demonstrate throughout. My only complaint here is that some of the characters could've used a little more fleshing out, however it was overall a minor issue I had.\\n\\n\r\nNext the art; it was very unique and honestly a bit of trademark of Mr. Takahashi's, I personally loved it. The art was weird and different from most manga's and anime's I've read and watched respectively, a breath of fresh air in an over saturated market of similarly styled art forms. I understand it's a very subjective style and might not be to everyone's liking. The anime really brought out a nice polished version of the art from the manga and it seemed to work very well from the overemphasized proportions of peoples facial expressions to really point out guile and cruelty to the shapes and sizes of different peoples presence on the screen. Every visual detail gave a nice little hint at the powerplay going on both physically and mentally between characters and groups.\\n\\n\r\nThe music and sounds, oh man were they NICE; clean gun effects lots of clatter and noises during intense movement and it was very well done to the environments that scenes were set to! The gunshots were really well done; I've been around firearms sparsely but what little knowledge of guns that I have, I thought the sound work was believably done. Music, now that's something that is extremely subjective, but I thought that the way they wove certain tracks and pieces were perfect in setting the mood and getting the viewer thinking on what was going on in the conversations and situations on the screen; overall an amazing use of a soundtrack to fit the animation!\\n\\n\r\nFrom the beginning to the end, you really feel like you're traveling amongst this group learning and getting a feel for the aspects of the team, the world they travel in, and the complexity of intelligence work between Koko's party and their government antagonists. I honestly feel like Studio White Fox did an amazing job adapting the anime from the manga, never once did I feel like I was missing anything from things not being narrated by thought clouds or the like both non-verbal communication and scene setting were fantastically executed! Stellar work!",
            "date": "2019-01-18T20:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 299413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5518845.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MegaFire800",
                "username": "MegaFire800"
            },
            "url": "https://myanimelist.net/reviews.php?id=299413"
        },
        {
            "content": "to sum it up in one word it be \"perfect\" ,it have everything i was looking for  :\r\n-blood\r\n-gun fight \r\n-knife fights\r\n-strong beautiful main character\r\n- a dark theme with light comedy \r\nbut that not made this anime for me , it was the characters , the development between character made this special",
            "date": "2013-11-26T00:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 121433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/enigma10",
                "username": "enigma10"
            },
            "url": "https://myanimelist.net/reviews.php?id=121433"
        },
        {
            "content": "Story starts with the boy soldier and I thought the series will center around him. But he finally gets the focus near the end.\r\nAgain, the opponents are over-hyped and lose too easily. Even if one of the main characters is defeated, it's only to further the plot.\r\nIt's hard for me to believe Coco's final solution can have the impact she claims. I'm sure the world will not submit to her will and will not use commercialized warfare.",
            "date": "2013-04-14T20:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 93815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/suprasaiyajim",
                "username": "suprasaiyajim"
            },
            "url": "https://myanimelist.net/reviews.php?id=93815"
        },
        {
            "content": "Unlike the first season of Jormungand, Perfect Order simply does not deliver. At first, it seems to touch upon something exciting, world peace delivered by a catalyst of war. But in the end, the anime leaves you hanging. It devolves into ino a shitstorm of ecchi from honestly unattractive characters.\r\nJonah's horror at Koko's Jormungand plan could have been more fully developed. However, all that happens is Jonah running away from Koko and running back to figuratively adopted mommy in two years.\r\nAnd I feel that there are less good action scenes in Perfect Order when compared to the first season.\r\nI know this review is rather disjointedso I'll make one last concise summary.\\n\\n\r\nThis anime's ending left the taste of slightly spoiled milk in my mouth.",
            "date": "2015-07-24T15:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 194224,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4601375.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/acynicalasian",
                "username": "acynicalasian"
            },
            "url": "https://myanimelist.net/reviews.php?id=194224"
        }
    ],
    [
        {
            "content": "The first series was fun. Not much of an overall plot or anything, but the characters were likable and their interactions with each other were the main highlight of the show for me. Then you factor in great action, and you have yourself a great show.\r\nThen, the second season rolls around. Is the action still there? Check. Does it still have the same quality animation and sound? Check. Does it retain the fun interactions between the characters you like? Ummm... Well, actually...\r\nThis season spends its time giving every member in Koko's crew a backstory. You learn where each of them comes from and why theyare now so loyal to Koko. All of their backstories are interesting and engaging, and are the reason why I like this season even more than the first.\\n\\n\r\nThe only downfall of The Perfect Order is the titular element. Without spoiling too much, the show takes a turn towards the end that loses track of what made the show great in the first place. The show isn't ruined or anything, but it does end on a slightly lower note then it starts on. \\n\\n\r\nDespite the stumble towards the end, Jorgunmand: The Perfect Order is a great follow up to the first season and a fun watch.",
            "date": "2018-09-08T14:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 288469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6471999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lombandicoot",
                "username": "Lombandicoot"
            },
            "url": "https://myanimelist.net/reviews.php?id=288469"
        },
        {
            "content": "season 1 was awesome but season 2 it wasn't as good as season 1 because of the ending the ending was a total piece of crap if there was an extra episode  or something like that it would make up for that ending but overall it was great the animation / art was great the sound was also really great the plot was amazing and I really enjoyed it but if I had to remake the ending I'd do all that what happened but with an extra episode where they tell you about what happened after the jormugand was activated and I'd als likekoko and Jonah to get married 💕💕💕 and that  koko stops working as a arms dealer and and someone x velvet and the rest of the crew living a quit and fun live That would be my ending my jormugand end.",
            "date": "2016-03-03T12:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 212180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4857910.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/killa69917",
                "username": "killa69917"
            },
            "url": "https://myanimelist.net/reviews.php?id=212180"
        },
        {
            "content": "*THIS REVIEW CONTAINS MINOR SPOILERS AS NECESSARY TO EXPLAIN MY RATING* (first season inclusive). The spoilers will not be very specific and will be speaking in broad terms.\r\nBased on the MAL rating system,\r\nStory: 6\r\nArt: 6\r\nSound: 8\r\nCharacter: 8\r\nEnjoyment: 8\r\nOverall: 7\r\nBased on my personal rating system, my overall rating is: 7.43\r\nIf I could use one word to describe this series as a whole, it would be: paradox. Jörmungand--the midgard serpent of the world--is an anime packed with fun action sequences, awesome theme songs and music, some great characters, and a story with massive potential. Additionally, the name of the series is part of a grand scheme ofKoko's that is not revealed until nearly the end of the series. It is at this point where the writing comes into question, as a poor ending or loose ends can hamper the greatness of any series. \\n\\n\r\nThe art is fair. The quality is not spectacular and the character designs are basic, but the animators were still able to create some epic moments between blazing gun battles and spectacular rocket launches. The OP artwork was great for both seasons, while the EDs were a bit lazier in comparison (still image EDs versus motion animation OPs). \\n\\n\r\nThe sound is really good. It is largely because of the sound that I enjoyed sitting through the entirety of the OPs and EDs. Additionally, the music was executed well during action sequences and tense moments to heighten the experience.\\n\\n\r\nThe characters were also something that were done really well. Particularly, the main character Koko has a lot of depth and is very fun. Her personality is reminiscent of famous characters like Holo from Spice and Wolf and Rin from Fate. She has a playful, cunning, and charmful character while also giving off a mysterious and even dangerous vibe. Koko can act like a child one moment and then transform into a mature leader who will be at the frontline with her soldiers the next, pistol in hand. This character is a fine example of the vicious but cute girl, adding a layer of paradox which seemed to be a constant theme to me throughout the story.\\n\\n\r\nRather intentional or not, there were a lot of paradoxical concepts found in the story. Whether or not that adds or takes away from the story is up for debate, but it is worth pointing out: Jonah's disgust for weapons while simultaneously being a child soldier for a living. Koko's status as a reputable arms dealer and her self-proclaimed love for capitalism, to her transformation of becoming a near communist dictator. The classic idea that peace can be achieved through violence, paired with the crude ethical utilitarianism of killing off \"the few\" in order to provide a better future \"for the many.\" \\n\\n\r\nThe problem with the story is not my disagreement with any view held by any character, but how the characters acted on these paradoxes paired with the ending. Jonah recognizes the conflict about killing hundreds of thousands of people to potentially save millions of lives in the future when he leaves Koko's squad to go work for Kasper. Instead of the story forcing Jonah to confront his main conflict throughout the entire series (\"I hate weapons but travel with an arms dealer\"), we are presented with some cliche and sudden time leap of 2 years where Jonah finally returns to Koko to execute Jörmungand. There is no battling with his demons, there is no revolution, there is no resolve. There is only a changing of minds, going back and forth on the story, with a dry outcome that significantly subtracts from the story. \\n\\n\r\nKoko claims to hate being an arms dealer and wishes for world peace, but never faces any of her own demons or is faced with her own contradictions and philosophical shortcomings. The closest thing that we get to this is Jonah saying \"goodbye Koko\" as he does a cannon-ball and leaves the squad for 2 years, before returning and executing Koko's grand scheme without any challenge or even satisfactory agreement. The conclusion was rushed and the lack of challenge between the characters takes away from what could have been an outstanding anime.\\n\\n\r\nEven with some major problems in the story, I still enjoyed Jörmungand greatly. The action was right up my alley, the geopolitical aspect was intriguing, the competition between private organizations and state actors was fun, the sound was great, and Shizuka Itou's performance as Koko was memorable.",
            "date": "2017-01-05T01:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 237475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5069017.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cryptotaku",
                "username": "Cryptotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=237475"
        }
    ]
]