[
    [
        {
            "content": "Many kids have big dreams these days. Some wants to win an Olympic Gold Medal for their country. Some wants to date a supermodel. Some wants to become an astronaut when they grow up. But how many kids out there wants to conquer the world? Perhaps not many in the real world but there’s one little girl who really wants to make that dream into a reality. Her name is Kate Hoshimiya. She may be small but has a big dream as leader of the Zvezda, a secret society. Their goal? World conquest.\r\nA trip into this show is one that will first strike you outas bizarre at first. It’s not just the way the premise is crafted but the execution. Even the first episode extravagantly brings its gags in various forms such as jelly bobs, military tanks, mecha, and a loli dressed like if she’s planning to go to a Halloween party. But despite the silliness of the setup, the show maintains somewhat of a serious vibe. Taken for granted, we learn that no one has yet successfully conquered the world. Now, we have this young girl that tries to take on the impossible.\\n\\n\r\nStanding no taller than a middle school grader, Kate comes off as a young girl full of energy. Perhaps what strikes her character out the most is her commanding way of leading people. Believe it or not, she doesn’t actually suffer from delusions (as in the ‘chuunibyou’ case). Kate’s ambitions are real that are fueled by her words and actions. More importantly is the fact that Kate has followers collectively formed as a group by the name of Zvezda. The series details their journey and trials of conquests that ranges from a variety of subjects. They don’t mess around as the conquests they complete usually require effort that is perhaps surpassed by a normal human is capable of. During their journey, we also meet Asuta Jimon, a young boy that coincidentally runs into Kate during one of her days in life.  \\n\\n\r\nUnlike the other members of Zvezda, Asuta has no superpowers of his own. Yet, he is useful for his cooking skills. After all, you can’t fight on an empty stomach. His first encounter with Kate is not only bizarre but comes off as abrupt. Rather than hiding her identity, Kate reveals her goals and who she is. Normally, it would be uncommon for overlords to give out sensitive information. Yet, Kate not only reveals her identity but boasts about her greatness with a large ego. In essence, Kate serves as more of a super villain. Despite this, she does treat her subordinates with respect. She also tends to avoid violence unless a task requires it or something catches her mind in a bind of frustration. But most importantly, she holds together the group through their single-minded task – to conquer the world. You have to wonder how serious this show takes the trope as the story becomes molded with amateurish tactics, lack of common sense, and logic defilement. For what it’s worth, the show is comedic. There’s really no emphasis on a key purpose to the story besides the simple concept of world conquest. Rather than going on with complex plans, the author decides to write this show’s story like an open textbook. Each page tells the story of Kate and her conquests.\\n\\n\r\nAn organization as it is, Zvezda composes of no more than seven members. Unlike Asuta, they have their own superpowers that matches their character styles. Some of them fits with the classic stereotypes such as the mad scientist (Natasha), Yasu (super soldier), or Roboko (the brains). Their superpower ranges in wide degrees and collectively does make a force to be reckoned with. Yet, there are some silly gadgets to take notice of. One for instance is their hideout that is initially designed like a playhouse as a “super villain base”. (it even says “Zvevda Secret Society” on the outside!) Then, there are the outfits the characters wear when they go on missions. They are flamboyant and even Kate has to wear an ornamental cape to make a point for herself. We also find out that some of the characters has unusual closeness among its group members while others tend to be oil and water. In retrospect, Zvevda is an organization that we like to feel attached to. Their members, ambitions, and missions they set to carry out shows their attributes as well as clearly pointing their strengths and weaknesses. \\n\\n\r\nYet as the story progresses on, we find out about opposition against Zvevda. Taking on the name of “White Light”, they are group that stands out as the adversaries. It’s really silly with this setup reflexively if we look closer. It makes it look like the White Light are the bad guys going up against Zvevda. Caught up in the middle is Asuta. And to make matters worse, we learn that some of White Light’s members are acquitted with Asuta in the school norm. There’s a curiosity that should spark to viewers for cases of identity. In which case, Asuta would become a scapegoat because he is in one group that is portrayed as the “super villains” while the good guys (White Light) opposes their goals. As ridiculous as the concept is portrayed, there’s a certain attractiveness with this setup marked with silliness. It should be taken in as granted for a joke rather than something to take by heart. \\n\\n\r\nHaving action also means fighting and battles. Whether it’s at home, school, or out in the open world, most of the core characters demonstrates various degree of combat experience. Yet, some of these weapons are so risible that it makes you wonder if it’s all just a big prank in the end. Nonetheless, there are some weapons that are menacing enough to strike fear such as Itsuka’s sharp sword or Natasha’s crafty inventions. Then, there’s absurdity coming from Asuta for his normalcy. Perhaps he’s just too normal and can’t ever conform 100% with Zvevda. More necessary comes with the fact that he needs to acquire superpowers of his own. In the end, Asuta is no more than just a cook despite his ways to help the group. But if we talk about bizarre, action takes it a near imaginative level with its gags and stylish yet artistic way of coordinating its action scenes.\\n\\n\r\nThe show comes together other aspects with its formulation. Comedy wise, the show nailed it with its colorful dialogues, gags, and characters. However, do watch out for repetitiveness as some jokes can quickly grow old and stale. One particular episode also plays off as a campaign that may actually be offensive to a certain group of viewers despite being advertised as a parody. On the other hand, mystery becomes a rather weak point. There’s a lack of characterization with nearly all the characters. Thus, do not expect powerful flashbacks or development. Rather, don’t even expect story depth. The show itself is one big wisecrack. Despite being in directed by Tensai Okamura (Darker than Black, Ghost in the Shell, Wolf Rain), the show will feel very different. But being different isn’t necessary faulty. It just takes time to get used to because this show has a contagious fun odor that will catch your attention.\\n\\n\r\nArtwork doesn’t take itself as substantial credit. Instead, it comes off as more goofy and amateurish. But nonetheless, we get a classic feeling of the superhero (or perhaps maybe super villain) atmosphere. The parts that stands out the most in regards to visuals is the way characters are designed. Flamboyant, exuberant, and conspicuous are just a few words that describe our characters’ outfits. The way Kate is designed gives us a way to appreciate her intentions for someone so small yet with a huge ego At the same time she can come off as a brat with her kiddy outfit. On the other hand, there are characters dressed in ways that gives them more a menacing look such as Itsuka’s eyepatch or Gorou’s skullface. Then, there are the obnoxious bits of fan service such as Natasha’s loosely dressed lab coat and even Kate’s outfit herself. But in retrospect, most aspects come together in union. The backgrounds stand out as average. A-1 Works strikes out controversially for some series in the past but here only comes as something just tolerable. \\n\\n\r\nThe soundtrack is above moderate in terms of consistency on most parts. But more noticeable is the way characters speak with their diverse mannerisms. Kate for instance has an egoistic way of speech so naturally, expect some words of narcissism to come out of her mouth. Other characters display their personalities with their voices such as Itsuka’s hot-blooded personality, Renge’s innocence, Miki’s elegance, or Roboko’s wisdom. The OST mixes in tune with a combination of rock and rapid pace during action scenes. During more humorous sequences, it attaches a more goofy tone. The OP and ED song are more childish but does make its point.\\n\\n\r\nBy the time you finish this show, you’ll feel like a kid again. It’s not just a Halloween party you attended where you dress up and look like someone else. Rather, it’s what you’re doing with yourself and the goals you choose to follow. But being a kid is something we’ve all gone through but for Kate, she has goals beyond what any single child can dream for. Ultimately, this show isn’t something to take for granted like an action packed motion picture. Rather, it’s the fun that never ends that will set yourself to freedom.\\n",
            "date": "2014-03-29T20:39:00+00:00",
            "helpful_count": 114,
            "mal_id": 137819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137819"
        },
        {
            "content": "Sekai Seifuku tells the story of an eternally young girl attempting to conquer the world with her group called Zvesda, and a boy named Asuta who gets caught up in it all. Hoshimiya Kate, for reasons that are never explained, is a girl who seems to never age while everyone around her does. She, though a reason is never really given, wants to conquer the world and fights against other organziations who try to foil her plan. As you may have already guessed, my main issue with this anime is that they don't explain hardly anything. Characters are given quick backstories that don't make muchsense and the plot is full of filler and doesn't really go anywhere until the last three or so episodes.\\n\\n\r\nThe show begins with a high school boy named Jimon Asuta who ran away from home. He is struggling to get food to eat but is determined to make a living on his own and avoid anyone knowing that he has run away. Though, the only person he ever talks to and cares about hiding his situation from is his crush, Renge. Renge is also hiding a secret. She is a member of the group called \"White Light\" who fights against evil, which is mainly Zvesda. The members of White Light wear masks and uniforms that hide their identity from each other even though it should be blatantly obvious who they all are considering their unique hairstyles still show..... But moving on, Asuta ends up running into a conflict between Zvesda and White Light, is recruited into Zvesda against his will, and now has a place to stay even if it might cause him to lose his life in the process. All of the other members are \"quirky\" to say the least, and White Light is out to kill all of the members of Zvesda, and Asuta has to adjust to this new lifestyle whether he wants to or not.\\n\\n\r\nThe story is very generic for the most part and uninteresting. The characters are all generic except for Kate, and none of them get enough time to develop very much. Asuta is about as unoriginal as a main protagonist can get. He's good at cooking and randomly saving the day but nothing else. Kate is a bit unique, but the anime does a horrible job of explaining anything about her mission or why she's been 7 years old in both mind and body since many of the older characters were kids. The rest of the main characters consist of a scientist, a tsuntsun swordswoman, an ex-gang member and his underling (who is just a terrible comedic relief character with absolutely no redeeming qualities), and a female robot.\\n\\n\r\nThe one part of the story I did really enjoy was the anti-smoking (cigarattes, not marijuana) aspect. The one episode completely about anti-smoking is the best one by far, even if it does show how Yasubee is a horrible character which no one should ever trust (seriously, he switches sides out of nowhere and it's just plain stupid how everyone forgives him anyway, especially Gorou). Though it was never explained at all how the villain's smoke powers were even possible in the show's universe.\\n\\n\r\nThe animation is good, but some of the character designs are very.... fanservicy. Mainly Kate's (give a 7 year old a revealing outfit, why not?) and Natalia. Aside from that, the character designs still aren't great, but they're not terrible. The scenery in the show is also average, and the action scenes aren't anything too interesting with only decent choreography. The use of CG for larger monsters and weapons also becomes a bit annoying and clashes with the regular animation. The soundtrack is mostly unmemorable with the OP being the only good song.\\n\\n\r\nWhile I did enjoy some parts of Sekai Seifuku, nothing much really happened. It's just going from point A to point B with a lot of filler in the middle and a few mediocre flashbacks to try and make you feel more attached to the characters that never have anything too bad happen to them anyway. The drama in this show just falls flat and the comedy is only occasionally funny. If not for the anti-smoking episode and some of the few good character interactions, the story would have had nothing unique or good about it. I just never even began to like any of the characters in this show or care if anything bad happened to them. Because of that and all of the other problems, I just could not come to like Sekai Seifuku.",
            "date": "2014-03-30T23:03:00+00:00",
            "helpful_count": 60,
            "mal_id": 138005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=138005"
        },
        {
            "content": "A-1 and Aniplex really scored a hit with this one! In this extremely original, unique series, you get a combination of comedy, action, drama, romance, and even a little fanservice all wrapped into a great little package! The characters are developed very well, as are the relationships and backgrounds of each of the said characters. The plot and how the series develops is extremely unique and entertaining. But also conveys that you can achieve your dreams no matter how small or what gender you are, or what the odds are against you. Every episode has it's own significant story to it and theme to betaken from it, but all the while adding to the overall plot of the series. You will be continually drawn into this entertaining series more and more as you watch. Great action. Ton of comedy. And an intriguing plot. This is a winner for sure! (Season 2 PLEASE!)\\n\\n\\n\r\n                                \"May the light of Zvezda shine throughout this world!\"\\n",
            "date": "2014-03-30T08:09:00+00:00",
            "helpful_count": 48,
            "mal_id": 137887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=137887"
        },
        {
            "content": "I'm recollecting at all the smokers who dropped it on episode 3 lol.\r\nBut seriously, while it may not match the top anime, it has a very creative way of being cute. I was personally attracted to all the characters.\r\n-----\r\nIf you're looking for criticism... I thought the main character was incredibly pointless as in... you could essentially write him out of the entire story, focus around another character, and it wouldn't affect much at all. Main characters in stories are supposed to have an effect on other characters and perhaps the world... Asuta didn't do any of that. The story moved incredibly fast... perhaps too fastand all was tied in with extreme silliness which can be a great turn-off for some people looking for something more serious.\\n\r\n-----\\n\\n\r\nKate's Venera outfit is getting her a lot of slack but if you look at the stereotypical female \"super villain\" it matches to the outfit themes of them, Kate just so happens to be a loli so people are complaining about it lol.\\n\\n\r\nThe cuteness is unique in this anime and the silliness is childish as I feel this anime was meant towards a younger audience. People with more of an imagination can enjoy this anime more - as in people who can just kick back and not think too much into the writing and just enjoy what's being shown to them - while others may be turned off by the lack of seriousness and lack of effort to go truly in-depth with the characters.\\n\\n\r\nEnjoying this anime depends on how much you can lower your expectations and just enjoy a story that's not serious with character backgrounds that are not really told in-depth. Kate's background, however, has room for a ridiculous amount of depth but, as a writer, I feel that her background doesn't make much sense with how she is in the anime I can't really explain it without a spoiler.\\n\\n\r\nBut I can overlook that and other things when I realize that I watched an anime that is targeting a younger audience. Sometimes you just need to drop certain \"adult\" expectations of a story and open your imagination to find the good in it and that's what this anime is about at least for me.\\n\\n\r\nI'm giving the story a 8/10 because I felt it achieved the goal it set out to do which I felt was pretty clear. Not a 10/10 because I felt the story moved a bit too fast. Like there wasn't that much of a build-up it just suddenly came crashing down to a forced conclusion. Even if it is a childish story, build-ups are what I enjoy most and they are extremely important for every story :P\\n\\n\r\nOn a side note, there seems to be an episode 13 which is the rumored OVA. They are likely waiting and testing how sales do before deciding on whether or not to make a new season. *PRAYS SALES DO WELL!* I will buy anything they release outside of Japan if that'll help.\\n\\n\r\nStory 8/10 - Already said above.\\n\\n\r\nArt 10/10 - Seriously the quality of the art in this anime is great. I am very pleased.\\n\\n\r\nSound 10/10 - Some people said Kate's voice is annoying sometimes but I loved it. All the voices, sound effects and especially the opening / ending are awesome!\\n\\n\r\nCharacters 9/10 - All the characters were great to me except Asuta hence the 9/10. I explained this in my criticism above too. Kate, Goro and Natalia were my favorites!\\n\\n\r\nEnjoyment 10/10 - If you can watch it without thinking too much about the silliness and lack of in-depth characters and the ruined potential for Kate's backstory, you'll be laughing at the comedy and enjoying the silliness and pretty impressive art and animation. Let's all support our loli overlord Lady Kate Venera to conquer the world! May the light of Zvezda shine throughout the world!",
            "date": "2014-03-29T12:18:00+00:00",
            "helpful_count": 44,
            "mal_id": 137741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/765875.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hoshimiya-Kate",
                "username": "Hoshimiya-Kate"
            },
            "url": "https://myanimelist.net/reviews.php?id=137741"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIn our world, there are many different types of rulers. From Presidents to Prime Ministers, from Kings to Queens, people of power are able to maintain great influence over life itself. Most of the time, these leaders hold moral ideals, wanting peace over war. Yet others have one goal in mind: to conquer the world. World Conquest Zvezda Plot is a story of such conquering, spearheaded by a little girl, a young boy, and the rest of Zvezda squad.\r\nSTORY\r\nWorld Conquest Zvezda Plot begins with Asuta coming across a little kid named Kate. After a small altercation, Asuta (nowknown as \"Dva\") is recruited into Zvezda, a group of people determined to conquer the world.\\n\\n\r\nConquest goes about telling its story in a rather clever way. In most cases, instead of outright revealing the information through explanations or visuals, the show often uses indirect speaking as a way to give the audience insight into the world without having it spoon-fed to them. Using this tactic causes the viewers to actually have to \"connect-the-dots\" in order to understand who the characters are, why the world is the way it is, and where things will be headed. Now, the show does utilize flashbacks in order to get the more difficult details across, but for the most part, the writing itself was done rather nicely.\\n\\n\r\nIn regards to what actually goes on, the over-arcing plot is rather lackluster. The problem is that the goal itself is not only too vague but too large in scope. Meaning, it's difficult to understand what exactly the purpose is of what they are doing. On a smaller scale, however, the show does at least a fair job of showcasing a slice-of-life-ish portrayal of a fantastical world. Filled with strange creatures, transformations, and tons of udo, most episodes have simpler goals in mind that help to flesh out not only the characters but the world itself. At the same time, the missions are often unique and filled with comedic moments between the cast and the environments housing them. The humor isn't anything great, but the snide quips from Asuta or the overzealous nature of Plamya when it comes to Kate is usually good for a laugh or two.\\n\\n\r\nA large problem with Conquest is the ending. At this point, it has done a very nice job of setting up the overall tension and despair that contrasts with the previous events. However, when all is said and done, the contrived plot points, role-reversals, and underwhelming antagonist leave the series on an unfortunate low-note. Coupled with the fact that the story sets itself up for further shenanigans down the road, you are left with a vast feeling of emptiness. Not that things are just getting started, but rather that they have yet to be completed.\\n\\n\r\nANIMATION\\n\\n\r\nThe overall art and animation for Conquest is actually pretty darn good.\\n\r\nStarting with the art, the show loves to use a wide variance of colors. The ball-like creatures, the characters' clothing, and the locations themselves are rife with many different colors that make everything pop. The backgrounds aren't so much colorful as they are detailed. The Zvezda base comes to mind as do the underground ancient ruins.\\n\\n\r\nAbove all else, the character designs are top-notch. Each character has a \"transformation\" that allows them to become their more powerful selves. These costumes contain the same level of detail as the backgrounds do. Goro's skull mask and military gear, Plamya's eye-patch, helmet, and coat, and Um's Halloween coloring and witch-like outfit are the standouts, but easily help to demonstrate how unique each of them look. Even when not in their strong attire, their regular selves also contain some level of detail to make them contrast with everyday civilians.\\n\\n\r\nThe show also does well in the actual animation department. The fights are easy to follow and nicely choreographed, and the characters contain both fluid movements and varying facial expressions. The CG isn't the best, but it doesn't feel over-bearing or terribly out of place.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe characters in Conquest are \"characters\" themselves, but I'll at least talk about some of my favorites.\\n\\n\r\nItsuka, aka \"Plamya,\" is a young woman who is strong-willed, straight-forward, and at times simple-minded. In a lot of ways, she reminded me heavily of Asuna of SAO fame due to her interesting character design, swordplay, and general bad-assery. Plamya appears difficult to approach, but her conviction to protect the squad is evident. Her character serves to demonstrate that dedication and hard work may not come easy, but the payoffs in the end more than make up for the trouble one goes through.\\n\\n\r\nGaro, aka \"Chief,\" seems like the tough, parental type. Instead, he's more like the silent guardian. Among the whole cast, he surprisingly seems the most out of place with his stature and past, but it's slowly revealed why such a man follows such a girl. He actually has some of the best action sequences in the show to make up for his lack of humor. Chief represents something that we all hope to do, and that is upholding the ideals we hold true to our heart.\\n\\n\r\nEasily the best character from the anime, Kate, aka \"Venera,\" is literally a child. The leader of Zvezda, her strange ability to unite random people from across the land to work towards a common goal is unprecedented. She's loud, demanding, and sometimes sleepy. On top of all this, her best friend is a stuffed pink rabbit. For all intents and purposes, she is a baby girl whose dreams are seemingly too grand to be feasible. And that's what makes her shine. Sure, she's cute, sure, she has an adorable way of talking. But what she isn't is being afraid to dream big, to go for the impossible. That despite the troubles one may face, they can always be conquered.\\n\\n\r\nIf it isn't evident by now, what Conquest does right with its characters is having them serve as messages for personal growth, for personal conquest. Dva is about understanding one's place in the world, Um tells us it's not about being constricted to the past but anticipating the future, etc. The characters' themselves may be slightly trope-y with some of their character quirks, but almost all characters are. Instead, their most important aspects are not the way they look, how they talk, or what they do, but the ideas that they share with us.\\n\\n\r\nOne final note is that some of the characters, comparatively, do not have their backgrounds fleshed out enough. Some do and some don't. It's a mixed bag that is sadly not divided evenly between the cast. Furthermore, as a main character, Dva is rather weak. He provides most of the comedy, but that's just about it. When the show is progressing, one isn't looking for Dva's next scene but rather what the rest of Zvezda squad is doing.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is interesting. At first, it's not that good. It seems rather plain or generic, given the unique atmosphere that the show tries to portray. However, after a few episodes (roughly half-way through), the piece becomes at least average. It's nothing worth listening to on a daily basis, but the beginning, middle, and ending sequences are well done. If anything, the OP feels like lost potential.\\n\\n\r\nThe ED reminded me a bit of Humanity Has Declined's, with its soft vocalist and perhaps out-of-place visuals. This one doesn't have the same \"oomph\" attached to it that Humanity Has Declined does, but it does at least remind one of a lullaby, coinciding with Kate's nature.\\n\\n\r\nThe rest of the soundtrack is sadly quite forgettable. The only prominent \"piece\" is the bell chimes that go off during the screen transitions.\\n\\n\r\nFinally, in regards to VA work, Misaki Kuno does an above average job in her role as Kate. Her voice has that little kid quality to it that is tough to nail. Plus, it's rather unique, making it stand out more than usual.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen it comes to watching this one, it's difficult to like it right away. It seems rather similar to other shows out there in the anime world, and to an extent that is a correct statement. The show's excitement and urge to watch it never really settled in until about three-quarters of the way through. The action was fine, the comedy was there, it just never had much of a hook or draw to entice me further.\\n\\n\r\nEach episode is more or less set-up (at least in the beginning) to give us some indication of who the characters are. This is done in conjunction with the indirect world-building explained earlier. It works decently well, but causes a lot of the scenarios to become somewhat repetitive. Some instances are vastly different from what occurred before, but many of the same jokes and outcomes happen time and again.\\n\\n\r\nThe ending itself is sadly left open, the romance elements at play are teased at but never really take off, and even with the clever storytelling there are some parts that are just never explained. World Conquest Zvezda Plot doesn't really do anything new or exciting, but if you need a fun little show with the added bonus of slick visuals, then this one wouldn't be a bad place to start.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, nice indirect story-telling with contrived ending\\n\\n\r\nAnimation: Great, art is detailed, character designs are unique, actual animation is well done\\n\\n\r\nCharacters: Fine, each provides an underlying \"message\"\\n\\n\r\nSound: Fine, okay OP and ED, bad soundtrack, decent VA work\\n\\n\r\nEnjoyment: Fine, some fun and laughs for the whole experience\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-11-24T09:28:00+00:00",
            "helpful_count": 13,
            "mal_id": 169757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=169757"
        },
        {
            "content": "\"What did I just watch?\" This phrase was uttered by me each week I watched Zvezda Plot. This show is easily one of the strangest I've watched in a long time, but it's really not a bad thing. On the contrary, it's actually one it's strengths and also the main reason I kept coming back week after week to watch it. I'll be leaving a breakdown of its strengths a weakness below, with as little spoilers as possible.\r\nStory - Zvezda's story to be quite frank is extremely silly. The bare bones plot is about a group of borderline superhuman people and their quest for worldconquest. Week after week they go out and conquer something, be it smokers, buildings, or whatever else they feel like doing. They have to fight other organizations that are trying to stop them from taking over the world. A main antagonist does eventually surface, but it's up to you to decide if you think it's really worth it in the end. I didn't watch it for the plot personally, but as with most things, mileage may vary. (6)\\n\\n\r\nArt - The art style is kinda of strange, but all in all it's nothing that would turn you away from the show in my opinion. (7)\\n\\n\r\nSound - (9)\\n\\n\r\nCharacters - This is where Zvezda truly shines in my opinion. The cast is colorful, fun, and their personalities are varied. The way they interact was a treat to watch and kept me laughing throughout the show. Swordsmen, Mafia members, scientists, and mythical creatures are found in this show. You'll be pretty hard pressed to not find someone you like in this cast. The only strikes against the characters I seen were that the cast was female heavy and the main character was somewhat lacking. (8)\\n\\n\r\nEnjoyment - I enjoyed the show a lot more than I probably should have. The comedy really worked for me and as stated above, I loved the characters. I don't regret watching it all. (9)\\n\\n\r\nOverall - If I had to summarize Zvezda in a couple words, they would be \"Stupid Fun.\" The show doesn't take itself seriously and neither should you. If you're looking for a show that has and amazing layered plot look elsewhere because Zvezda is nothing like that. However, if you're looking for comedy or just something different Zvezda might just be the show for you. Give a shot, you just might like what you experience. (7)",
            "date": "2014-04-13T16:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 139825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3441293.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LordAura",
                "username": "LordAura"
            },
            "url": "https://myanimelist.net/reviews.php?id=139825"
        },
        {
            "content": "\"My Loli-instinct tells me that.\"\r\nSTORY 7/10 (Roughly based on tension, coherence, enjoyment and universe)\r\nThe story of Sekai Seifuku is in my opinion not the main point of the show. It is very episodic, yet it doesn't lose its thread throughout the show. Therefore, you are going to get some progress in each episode, still it doesn't seem rushed. You will have a good laugh here and a little tear in the eye there with not too much seriousness going on. Which is a good thing, because anything else wouldn't have fit into this show. That said, both ,fans of comedic and fans of dramatic anime,are going to get their money's worth. \\n\r\nAs the story itself can at some parts appear a little dumb and is, like I said before, not the main point, I was going to give a fair 6 here first.\\n\r\nHowever, I went for a 7, because of the interesting universe and the hilariously exaggerated social criticism this show presents. \\n\\n\r\nART 9/10 (Based on art, art style and animation)\\n\\n\r\nThe art was great. Very detailed characters,clean and colorful art style and smooth animations made a great, yet not outstanding total package anyone will definitely enjoy.\\n\\n\r\nSOUND 7/10 (Based on OST, OP+ED and voice actors)\\n\\n\r\nThe Soundtrack itself was all in all ok. No Soundtrack really was recognizable, but none of them ruined the feeling from time to time either. The opening was great, the voice actors fitted well and did a fantastic job. \\n\\n\r\nCHARACTER 10/10 (Roughly based on authenticity, coherence, development(long running series) and character design)\\n\\n\r\nNow we've finally arrived at the main point of this show. Though my rating might seem questionable to one or two, I'm completely convinced of it. This show gives you a complete cast of characters with convincing backgrounds and more or less reasonable intentions. All of them acted justifiable and were very likeable and non-stereotyped, in a way that may appear very stereoptyped at first. We have a bossy Loli, a plain but likeable main, a mentally teary thug, a nudist prof, a shy robot, a kindhearted ex-mobster and a selfish idiot. And I absolutely adore them all. \\n\r\nAlso this show manages to give the enemies character and screen time as well. They have their own intentions and are believable and likeable, too. That's why the line between our cast and their enemies is very thin.\\n\r\nAnother thing I found absolutely amazing about Sekai Seifuku are the character designs. The kind-of hero-like atmosphere lead to very unique and just awesome \"costumes\", which underlined the characteristics of each and every character in a very creative and well-done way. \\n\\n\r\nENJOYMENT 8/10 (Roughly based on how badly I wanted to watch the next episode and on how often I paused the video an did something else)\\n\\n\r\nI very much enjoyed the show. It's got its ups and downs and I wasn't always pored over the story, especially in the middle where it was very episodic, but all in all I got very much into it, maybe even too much at some points. \\n\\n\r\nOVERALL 9/10\\n\\n\r\nMathematically my overall rating should be an 8 now. But just too encourage people to watch it and as a matter of principle too, because the rating is too low in my opinion, I'll give it a 9.\\n\r\nIf you like unique shows with both, drama and comedy included, that features awesome characters you can relate to, you should definitely give it a try some time!\\n",
            "date": "2015-02-02T08:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 179499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3102423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/laraes",
                "username": "laraes"
            },
            "url": "https://myanimelist.net/reviews.php?id=179499"
        },
        {
            "content": "For all of it's interesting character designs and potential, Zvezda can't seem to translate it into something watchable. The premise is an immediate attention grabber, a comedic story about a organization out for world domination from the perspective of one of it's low level grunts. Unfortunately A-1 seem to have stopped at the premise and character designs, forgoing writing an interesting narrative. \r\nOn several occasions I was left with the feeling that I'd missed an episode or two, plot points are introduced and dropped fast with little explanation. Some story beats completely miss the mark, and the level of narrative convenience on display is unmatchedby any piece of media I've ever watched. Things happen in Bouryaku no Zvezda which is the nicest thing you can say about it's plot, but it's unlikely to explain why.\\n\\n\r\nThere is little to no consequence to anything that happens during these 12 episodes. Many of the characters do not get their time in the sun, instead the show assumes that we know them already by introducing characters from their past and forcing us to fill in the blanks. In one particularly insulting instance, the climatic episode of the series is a hot spring episode. The characters return from their vacation to discover that the final act of the story has started without them present. Why?\\n\\n\r\nOf course the character designs are interesting, but you'll be given very little reason to care about many of them. It's impressive that in a show with such an out-there cast they still find time to have anime requisite filler in a 12 episode show. What's the opposite of \"tightly paced?\" Zvezda is exactly that.\\n\\n\r\nThe animation is fine enough, and the voice acting and soundtrack is a particular highlight for me. But otherwise this is a show with very, very little to offer the viewer. In fact it doesn't seem to have much to offer to itself. With a bit of effort with it's narrative this might have been a highlight of the season, instead it's easily forgettable and in some cases obnoxious to remember.\\n\\n\r\nZvezda isn't interested enough to have a coherent story, return the favour and avoid this one.",
            "date": "2017-03-27T12:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 243696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5485448.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Streecer",
                "username": "Streecer"
            },
            "url": "https://myanimelist.net/reviews.php?id=243696"
        },
        {
            "content": "A what if scenario involving #GotMilk & #StopSmoking got together and made a love baby. \r\nThe show while not having any story worth noting. It greatly makes up for that in Comedy,Art,Music and Characters.\r\nThe comedy of the show is pretty good with a lot of good jokes. The MC is one of the best Straightman i'v seen in recent time and fits with into this show really well. \r\nAsuta himself also has a pretty nice Character design that surprisingly looks different then every other male MC. I originally thought he might be a chick and was kind of disappointed when i found out he wasn't. But in the end i actually like this more.\\n\\n\r\nKate is a pretty adorable character. Even though she looks like a kid i am pretty sure she should be around 20 something, Maybe even more. Her aging stopped when she was a kid witch is why she looks the way she does. But she still has the mannerisms of a little kid. Kind of wish we got to see what she'd look like if she was grown up.\\n\\n\r\nGorou Has a pretty badass looking character design. First time we see him is him walking through the smoke of a Company of soldiers in the middle of the night and it's pretty awesome looking. He himself is also a nice character.\\n\\n\r\nNatalia not much to say. She is a awesome genius. Compared to others girl geniuses that are always annoying and never likable. She Probably has the 2nd to last worst hero design.\\n\\n\r\nItsuka Is probably my 3rd favorite character of the Main character cast. She is just a funny character.\\n\\n\r\nYasu is the worst character in  the main cast and of the worst in the entire show. It sucks to cause he kind of seemed like a nice character at the start.\\n\\n\r\nRobin is funny and also a good pair up with Asuta. \\n\\n\r\nThe art is really nice. I found myself really liking this would just because of the art. \\n\\n\r\nThe music is pretty awesome. I'v been listening to a ton of generic soundtracks from the anime's i'v watched recently so this was a nice surprise.\\n\\n\r\nReally like this show. I recommend it to just about anyone.",
            "date": "2017-12-04T22:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 264546,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264546"
        },
        {
            "content": "☆ This is a spoiler-free review ☆\r\nStory [8]\r\nHonestly, Sekai Seifuku: Bouryaku no Zvezda, or as it's known in English, World Conquest: Zvezda Plot, was a rather enjoyable watch. \r\nArt  [8]\r\nThe art was a nice blend of cutesy-modern with a great color scheme and character design. You could really get a grasp of what each character's persona was, right off of the design. \r\nSound [7]\r\nThe sound was nothing spectacular, as I'm not much of an audiophile, but the voice acting was fine. \r\nCharacter [7]\r\nThere was a nice supply of character development-it may come as a surprise, with such a comedic output and the overview ofjust being another quick 12 episode anime, but had some great characters with great backstories.\\n\\n\r\nEnjoyment [9], Overall [8]\\n\\n\r\nOverall, it's a great show for a quick laugh, and if you glance a little bit deeper, it might be able to send some interesting messages your way.",
            "date": "2016-08-25T03:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 227561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5648188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EchoGumdrops",
                "username": "EchoGumdrops"
            },
            "url": "https://myanimelist.net/reviews.php?id=227561"
        },
        {
            "content": "This anime is really good for a laugh. While watching it there were several times i had to go back and re watch  scene just to see all the jokes they were able to fit in there. \r\nIf you're here for an anime about world conquest, then you're about to be conquested yourself, by a lack of actual conquesting.\r\nThe whole anime is basically about this girl who plans on taking over the whole world and her crew of comrades, who include \r\nGirl with sword: Features include, a sword, eye-patch, and a  underlying crippling depression that causes her to break into tears like a2 year old whenever she loses the eye-patch\\n\r\nMagic Girl: IDK if its actually magic or just advanced technology but she does some cool stuff and sleeps wherever she wants\\n\r\nThe Tank: He walks, talks, and doesn't stop, unless he gets shot then he takes a bullet wound cause he is actually just a human after all\\n\r\nRobot Girl: Perks include: Is a robot. Cons include: She runs on vegetables \\n\r\nThat one guy that smokes a lot: He looks like a cowboy and smokes sometimes, usually followed by him getting water poured on him, making him leave the group, then come back and sometimes even not break everything.\\n\r\nThe normal guy: Our main character, doesn't have anything special about him he literally just talks to people and thats about it. \\n\r\nThis group is fought by the relentless group of highschoolers dressed in white robes and masks on top of masks, with the goal of finally wiping out the Zvezda group and stopping their not-so-tyrannical rule over this small town in Japan. \\n\r\nAt a certain point you realize that you just enjoyed this anime, thought it was funny, but you got through it without asking any questions on how things work. I mean, how does the entire city run on the energy produced by a giant plant, idk, but it does and its pretty funny. \\n\r\nNevertheless the anime does have some moments that could be called \"tense\" and actually felt like it was doing something sometimes. Definitely worth a watch if you have a free night and nothing else to do. \\n\r\nAnd remember kids, smoking kills... everything. like its actually the main enemy in this anime for some reason.",
            "date": "2017-01-22T00:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 238818,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5100143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BenjaminRogers",
                "username": "BenjaminRogers"
            },
            "url": "https://myanimelist.net/reviews.php?id=238818"
        },
        {
            "content": "When I first saw this show on MAL, I was surprised that I hadn't heard of it before. It was made by A1-picture, a very popular studio. But after I watched it, I get it.\r\nI won't write much about the show, cause I don't care enough.\r\nThe first 4 episodes were actually pretty good. The character interactions were fun and the character designs were really good. It wasn't very unique, I had seen many shows like this. But it was still fun to watch.\r\nAfter that, the interactions got less and less fun. I don't know if the quality actually got worse, or if the scenes weretoo similar. but I definitely enjoyed it less.  \\n\r\nBut then there were the last few episodes, where they tried to make it a little more story focused. And here's where the most forgettable part comes. Cause nothing happens. Of course, plot points occur, but nothing of any big consequences. I don't know why that part had any significance. It was cool visuals and evil villains.  \\n\\n\r\nSo yeah. It was mostly the technical aspects that saved the show from being the worst. So overall, it was a strong 6",
            "date": "2019-01-12T04:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 298802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6937139.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WeebWithoutAName",
                "username": "WeebWithoutAName"
            },
            "url": "https://myanimelist.net/reviews.php?id=298802"
        },
        {
            "content": "Plot [7/10] : Step into the world of world conquest!!! If I was to describe Sekai Sefuku's plot so you get a good grasp of what the anime is about it would require long mathematics formulas, a few of Newton's laws, a wet nap and a glass of cranberry juice. But to simplify, Sekai Seifuku is just what the name entails... World domination. The story centers around a boy named Jimon Asuta, A.K.A Dva, who runs away from home and finds refuge in the the Zvezda;an \"evil\" organizaiton who's goals are to....basically  take over the world. Each episode is mixed with a good amountof comedy but this isn't really a gag manga. The manga uses a type of dark humor that seems light at first glance. Add in a light organization who is trying to shut down Zvezda and you basically have Sekai Sefuku.  Instead of being plot oriented this story is more character driven..\\n\\n\r\nCharacters [9/10]\\n\r\nI loved the characters. They kinda reminded me of Awakawa Under the Bridge because in AwaxBridge everyone who lives under the the bridge are weirdos with only 1 sane person trying to figure out WTH is going on. If you relate that to the members of Zvezda, Asuta is probably the only normal person. The character designs are really good and I enjoyed a lot of the back stories. Although they are random at times they made this a really good anime and you cant lie... The costumes are bad a$$.\\n\\n\r\nSound/Art [8/10]\\n\r\nThe Op was really done well and Its fun to listen to. The art is above average and adds to the enjoyment of the anime. There's a lot of pretty colors and its nice an easy on the eyes.\\n\\n\r\nOverall [9/10]\\n\r\nFor me this was the best anime of the winter season. But i didn't watch the Oda Nabunaga based anime so I cant count them but I watched a fair amount of the winter season. It takes about 3 episodes to get used to the pace but overall it was done really well. I recommend this to people who loved comedy and weird characters. Also at the end of this anime it attempts to have some sort of plot and although it fails IMO its still good.",
            "date": "2014-04-05T18:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 138829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465770.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BossTheKid",
                "username": "BossTheKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=138829"
        },
        {
            "content": "I'm rather new to the anime 'game', but I like to think I know when I've found something good. After a disappointing attempt at Attack on Titan I'd found Kill la Kill, and I was hooked. Both AoT and KLK were easy - the amount of talk they got on tumblr, and the resulting fandoms, provided enough peer pressure and 'buzz' to make entering those series almost mandatory for understanding what was going on on my dash.\r\nZvezda, however, was not one of those series. I've yet to come across any casual reblogs or fan-art of the series on my dash from people I'm currently following.The screencaps I've posted have received attention, usually in the form of 'what series is this' if it's not stated outright, but even so, the attention's been relegated to a handful of notes. The attention the series has gotten, as far as I can tell, has been mostly from people who've fallen in love with the girl whose dreams will always be bigger than her body, the semi-dressed-to-kill Kate Hoshimiya. \\n\\n\r\nDoes this make Zvezda a sleeper hit? Or just another fluffy show with a fair amount of fanservice to round out last season? It may be hard to tell right now, but I'd say, at 12 episodes, it's worth your time if you're in the mood for something silly and exciting with a heart, you probably won't be disappointed. Full disclosure: I say this as someone who's fallen for the aforementioned half-dressed girl.\\n\\n\r\nI found Zvezda on Daisuke from an ad showing a crew of characters dressed in eccentric outfits. A skeleton, a robot, a girl with a skull-and-crossbones kitten eyepatch, and a couple of masked-up, mostly-naked women - as bizarre as this sounds, you'll see how accurately this sums up the series. It's funny, weird, and intriguing, featuring a cast of bizarre outsiders engaged in a struggle over the fate of the world. It will have you laughing, and maybe a bit touched by the stories of struggle against oppression and the bonds of friendship in the face of danger. Over the course of the show you'll get glimpses of a secret world beneath our own, watch intrigue play out between warring factions in the past and present, and discover why smoking is really much worse for you than you might originally think.\\n\\n\r\nThat said, if that sounds like a lot to work out over the course of twelve episodes, you're right.\\n\\n\r\nLike Kate, the vision that Zvezda puts forward might be a little bigger than it's capable of handling on its own. The show devotes a fair amount of time to its ensemble cast, each of which has a strange backstory that you're treated to glimpses of without seeing the whole thing. There's a lot going on, both with the characters and the world around them, and none of it's explained too clearly. What you get is impressions - sadness, fear, excitement, joy - without much depth or elaboration. While this isn't bad, a few times during my initial viewing, and more in retrospect, I found myself asking, 'if they have so little time for the series, why did they put x into it?'. \\n\\n\r\nBut that being said, I didn't walk away from it disappointed - on the contrary, I wanted more! The OVA, another season, an English translation of the manga - there's plenty of story here to tell, and part of what Zvezda does best is lends itself to the imagination where (much like Kate's outfit) it only teases instead of showing outright. You're mostly along for a very fun. fast-paced and somewhat confusing ride, much like the unlikely protagonist Jimon Asuta himself, and if you're willing to put up with a fair bit of nonsense and a few half-baked ideas this is probably worth your time.",
            "date": "2014-04-13T14:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 139813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=139813"
        },
        {
            "content": "The only thing you can say after watching this show is \"What.\"\r\nIt's good, but don't watch too many episodes at once, because your brain might overclock and shut down, like mine did. Don't try to think while you're watching. You do have to pay attention though because it's really easy to miss one of the gamut of random scenes throughout.\r\nThe best parts were the animation quality and characters. The action scenes were animated very well when they had them, and the cg was okay. The characters were really kooky but I liked them when I stopped trying to understand anything and just went along withthe show. Another cool thing that I noticed was that the plot exposition was done in a roundabout way.\\n\\n\r\nThe sound effects wore me out after a while, but that was expected considering the colorful style of the show. \\n\\n\r\nThe reason I'm giving this a relatively high score is that the show doesn't take itself seriously given what it presents.\\n\\n\r\n7.2/10.0",
            "date": "2016-08-28T08:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 227805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4920374.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jeffreyhou1997",
                "username": "jeffreyhou1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=227805"
        },
        {
            "content": "This show had almost no plot and no character development, but this show's charm does not come from either of those two. The show was an outrageous comedy, to which some of the jokes were actually kinda funny. The characters are all different and entertaining, each having a strange and neat background story. Near the end of the show, like most episodic shows, it started to give a shit about the plot, but this show did it in a good way. The ending fit with the show, it was strange and kinda funny. The show also ended on a good note, not really leaving anyhuge events leading to a second season, but if they really wanted a second season they could easily pick it back up.",
            "date": "2015-10-21T21:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 201721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShadowBunny",
                "username": "ShadowBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=201721"
        }
    ],
    [
        {
            "content": "Many kids have big dreams these days. Some wants to win an Olympic Gold Medal for their country. Some wants to date a supermodel. Some wants to become an astronaut when they grow up. But how many kids out there wants to conquer the world? Perhaps not many in the real world but there’s one little girl who really wants to make that dream into a reality. Her name is Kate Hoshimiya. She may be small but has a big dream as leader of the Zvezda, a secret society. Their goal? World conquest.\r\nA trip into this show is one that will first strike you outas bizarre at first. It’s not just the way the premise is crafted but the execution. Even the first episode extravagantly brings its gags in various forms such as jelly bobs, military tanks, mecha, and a loli dressed like if she’s planning to go to a Halloween party. But despite the silliness of the setup, the show maintains somewhat of a serious vibe. Taken for granted, we learn that no one has yet successfully conquered the world. Now, we have this young girl that tries to take on the impossible.\\n\\n\r\nStanding no taller than a middle school grader, Kate comes off as a young girl full of energy. Perhaps what strikes her character out the most is her commanding way of leading people. Believe it or not, she doesn’t actually suffer from delusions (as in the ‘chuunibyou’ case). Kate’s ambitions are real that are fueled by her words and actions. More importantly is the fact that Kate has followers collectively formed as a group by the name of Zvezda. The series details their journey and trials of conquests that ranges from a variety of subjects. They don’t mess around as the conquests they complete usually require effort that is perhaps surpassed by a normal human is capable of. During their journey, we also meet Asuta Jimon, a young boy that coincidentally runs into Kate during one of her days in life.  \\n\\n\r\nUnlike the other members of Zvezda, Asuta has no superpowers of his own. Yet, he is useful for his cooking skills. After all, you can’t fight on an empty stomach. His first encounter with Kate is not only bizarre but comes off as abrupt. Rather than hiding her identity, Kate reveals her goals and who she is. Normally, it would be uncommon for overlords to give out sensitive information. Yet, Kate not only reveals her identity but boasts about her greatness with a large ego. In essence, Kate serves as more of a super villain. Despite this, she does treat her subordinates with respect. She also tends to avoid violence unless a task requires it or something catches her mind in a bind of frustration. But most importantly, she holds together the group through their single-minded task – to conquer the world. You have to wonder how serious this show takes the trope as the story becomes molded with amateurish tactics, lack of common sense, and logic defilement. For what it’s worth, the show is comedic. There’s really no emphasis on a key purpose to the story besides the simple concept of world conquest. Rather than going on with complex plans, the author decides to write this show’s story like an open textbook. Each page tells the story of Kate and her conquests.\\n\\n\r\nAn organization as it is, Zvezda composes of no more than seven members. Unlike Asuta, they have their own superpowers that matches their character styles. Some of them fits with the classic stereotypes such as the mad scientist (Natasha), Yasu (super soldier), or Roboko (the brains). Their superpower ranges in wide degrees and collectively does make a force to be reckoned with. Yet, there are some silly gadgets to take notice of. One for instance is their hideout that is initially designed like a playhouse as a “super villain base”. (it even says “Zvevda Secret Society” on the outside!) Then, there are the outfits the characters wear when they go on missions. They are flamboyant and even Kate has to wear an ornamental cape to make a point for herself. We also find out that some of the characters has unusual closeness among its group members while others tend to be oil and water. In retrospect, Zvevda is an organization that we like to feel attached to. Their members, ambitions, and missions they set to carry out shows their attributes as well as clearly pointing their strengths and weaknesses. \\n\\n\r\nYet as the story progresses on, we find out about opposition against Zvevda. Taking on the name of “White Light”, they are group that stands out as the adversaries. It’s really silly with this setup reflexively if we look closer. It makes it look like the White Light are the bad guys going up against Zvevda. Caught up in the middle is Asuta. And to make matters worse, we learn that some of White Light’s members are acquitted with Asuta in the school norm. There’s a curiosity that should spark to viewers for cases of identity. In which case, Asuta would become a scapegoat because he is in one group that is portrayed as the “super villains” while the good guys (White Light) opposes their goals. As ridiculous as the concept is portrayed, there’s a certain attractiveness with this setup marked with silliness. It should be taken in as granted for a joke rather than something to take by heart. \\n\\n\r\nHaving action also means fighting and battles. Whether it’s at home, school, or out in the open world, most of the core characters demonstrates various degree of combat experience. Yet, some of these weapons are so risible that it makes you wonder if it’s all just a big prank in the end. Nonetheless, there are some weapons that are menacing enough to strike fear such as Itsuka’s sharp sword or Natasha’s crafty inventions. Then, there’s absurdity coming from Asuta for his normalcy. Perhaps he’s just too normal and can’t ever conform 100% with Zvevda. More necessary comes with the fact that he needs to acquire superpowers of his own. In the end, Asuta is no more than just a cook despite his ways to help the group. But if we talk about bizarre, action takes it a near imaginative level with its gags and stylish yet artistic way of coordinating its action scenes.\\n\\n\r\nThe show comes together other aspects with its formulation. Comedy wise, the show nailed it with its colorful dialogues, gags, and characters. However, do watch out for repetitiveness as some jokes can quickly grow old and stale. One particular episode also plays off as a campaign that may actually be offensive to a certain group of viewers despite being advertised as a parody. On the other hand, mystery becomes a rather weak point. There’s a lack of characterization with nearly all the characters. Thus, do not expect powerful flashbacks or development. Rather, don’t even expect story depth. The show itself is one big wisecrack. Despite being in directed by Tensai Okamura (Darker than Black, Ghost in the Shell, Wolf Rain), the show will feel very different. But being different isn’t necessary faulty. It just takes time to get used to because this show has a contagious fun odor that will catch your attention.\\n\\n\r\nArtwork doesn’t take itself as substantial credit. Instead, it comes off as more goofy and amateurish. But nonetheless, we get a classic feeling of the superhero (or perhaps maybe super villain) atmosphere. The parts that stands out the most in regards to visuals is the way characters are designed. Flamboyant, exuberant, and conspicuous are just a few words that describe our characters’ outfits. The way Kate is designed gives us a way to appreciate her intentions for someone so small yet with a huge ego At the same time she can come off as a brat with her kiddy outfit. On the other hand, there are characters dressed in ways that gives them more a menacing look such as Itsuka’s eyepatch or Gorou’s skullface. Then, there are the obnoxious bits of fan service such as Natasha’s loosely dressed lab coat and even Kate’s outfit herself. But in retrospect, most aspects come together in union. The backgrounds stand out as average. A-1 Works strikes out controversially for some series in the past but here only comes as something just tolerable. \\n\\n\r\nThe soundtrack is above moderate in terms of consistency on most parts. But more noticeable is the way characters speak with their diverse mannerisms. Kate for instance has an egoistic way of speech so naturally, expect some words of narcissism to come out of her mouth. Other characters display their personalities with their voices such as Itsuka’s hot-blooded personality, Renge’s innocence, Miki’s elegance, or Roboko’s wisdom. The OST mixes in tune with a combination of rock and rapid pace during action scenes. During more humorous sequences, it attaches a more goofy tone. The OP and ED song are more childish but does make its point.\\n\\n\r\nBy the time you finish this show, you’ll feel like a kid again. It’s not just a Halloween party you attended where you dress up and look like someone else. Rather, it’s what you’re doing with yourself and the goals you choose to follow. But being a kid is something we’ve all gone through but for Kate, she has goals beyond what any single child can dream for. Ultimately, this show isn’t something to take for granted like an action packed motion picture. Rather, it’s the fun that never ends that will set yourself to freedom.\\n",
            "date": "2014-03-29T20:39:00+00:00",
            "helpful_count": 114,
            "mal_id": 137819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137819"
        },
        {
            "content": "Sekai Seifuku tells the story of an eternally young girl attempting to conquer the world with her group called Zvesda, and a boy named Asuta who gets caught up in it all. Hoshimiya Kate, for reasons that are never explained, is a girl who seems to never age while everyone around her does. She, though a reason is never really given, wants to conquer the world and fights against other organziations who try to foil her plan. As you may have already guessed, my main issue with this anime is that they don't explain hardly anything. Characters are given quick backstories that don't make muchsense and the plot is full of filler and doesn't really go anywhere until the last three or so episodes.\\n\\n\r\nThe show begins with a high school boy named Jimon Asuta who ran away from home. He is struggling to get food to eat but is determined to make a living on his own and avoid anyone knowing that he has run away. Though, the only person he ever talks to and cares about hiding his situation from is his crush, Renge. Renge is also hiding a secret. She is a member of the group called \"White Light\" who fights against evil, which is mainly Zvesda. The members of White Light wear masks and uniforms that hide their identity from each other even though it should be blatantly obvious who they all are considering their unique hairstyles still show..... But moving on, Asuta ends up running into a conflict between Zvesda and White Light, is recruited into Zvesda against his will, and now has a place to stay even if it might cause him to lose his life in the process. All of the other members are \"quirky\" to say the least, and White Light is out to kill all of the members of Zvesda, and Asuta has to adjust to this new lifestyle whether he wants to or not.\\n\\n\r\nThe story is very generic for the most part and uninteresting. The characters are all generic except for Kate, and none of them get enough time to develop very much. Asuta is about as unoriginal as a main protagonist can get. He's good at cooking and randomly saving the day but nothing else. Kate is a bit unique, but the anime does a horrible job of explaining anything about her mission or why she's been 7 years old in both mind and body since many of the older characters were kids. The rest of the main characters consist of a scientist, a tsuntsun swordswoman, an ex-gang member and his underling (who is just a terrible comedic relief character with absolutely no redeeming qualities), and a female robot.\\n\\n\r\nThe one part of the story I did really enjoy was the anti-smoking (cigarattes, not marijuana) aspect. The one episode completely about anti-smoking is the best one by far, even if it does show how Yasubee is a horrible character which no one should ever trust (seriously, he switches sides out of nowhere and it's just plain stupid how everyone forgives him anyway, especially Gorou). Though it was never explained at all how the villain's smoke powers were even possible in the show's universe.\\n\\n\r\nThe animation is good, but some of the character designs are very.... fanservicy. Mainly Kate's (give a 7 year old a revealing outfit, why not?) and Natalia. Aside from that, the character designs still aren't great, but they're not terrible. The scenery in the show is also average, and the action scenes aren't anything too interesting with only decent choreography. The use of CG for larger monsters and weapons also becomes a bit annoying and clashes with the regular animation. The soundtrack is mostly unmemorable with the OP being the only good song.\\n\\n\r\nWhile I did enjoy some parts of Sekai Seifuku, nothing much really happened. It's just going from point A to point B with a lot of filler in the middle and a few mediocre flashbacks to try and make you feel more attached to the characters that never have anything too bad happen to them anyway. The drama in this show just falls flat and the comedy is only occasionally funny. If not for the anti-smoking episode and some of the few good character interactions, the story would have had nothing unique or good about it. I just never even began to like any of the characters in this show or care if anything bad happened to them. Because of that and all of the other problems, I just could not come to like Sekai Seifuku.",
            "date": "2014-03-30T23:03:00+00:00",
            "helpful_count": 60,
            "mal_id": 138005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=138005"
        },
        {
            "content": "A-1 and Aniplex really scored a hit with this one! In this extremely original, unique series, you get a combination of comedy, action, drama, romance, and even a little fanservice all wrapped into a great little package! The characters are developed very well, as are the relationships and backgrounds of each of the said characters. The plot and how the series develops is extremely unique and entertaining. But also conveys that you can achieve your dreams no matter how small or what gender you are, or what the odds are against you. Every episode has it's own significant story to it and theme to betaken from it, but all the while adding to the overall plot of the series. You will be continually drawn into this entertaining series more and more as you watch. Great action. Ton of comedy. And an intriguing plot. This is a winner for sure! (Season 2 PLEASE!)\\n\\n\\n\r\n                                \"May the light of Zvezda shine throughout this world!\"\\n",
            "date": "2014-03-30T08:09:00+00:00",
            "helpful_count": 48,
            "mal_id": 137887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=137887"
        },
        {
            "content": "I'm recollecting at all the smokers who dropped it on episode 3 lol.\r\nBut seriously, while it may not match the top anime, it has a very creative way of being cute. I was personally attracted to all the characters.\r\n-----\r\nIf you're looking for criticism... I thought the main character was incredibly pointless as in... you could essentially write him out of the entire story, focus around another character, and it wouldn't affect much at all. Main characters in stories are supposed to have an effect on other characters and perhaps the world... Asuta didn't do any of that. The story moved incredibly fast... perhaps too fastand all was tied in with extreme silliness which can be a great turn-off for some people looking for something more serious.\\n\r\n-----\\n\\n\r\nKate's Venera outfit is getting her a lot of slack but if you look at the stereotypical female \"super villain\" it matches to the outfit themes of them, Kate just so happens to be a loli so people are complaining about it lol.\\n\\n\r\nThe cuteness is unique in this anime and the silliness is childish as I feel this anime was meant towards a younger audience. People with more of an imagination can enjoy this anime more - as in people who can just kick back and not think too much into the writing and just enjoy what's being shown to them - while others may be turned off by the lack of seriousness and lack of effort to go truly in-depth with the characters.\\n\\n\r\nEnjoying this anime depends on how much you can lower your expectations and just enjoy a story that's not serious with character backgrounds that are not really told in-depth. Kate's background, however, has room for a ridiculous amount of depth but, as a writer, I feel that her background doesn't make much sense with how she is in the anime I can't really explain it without a spoiler.\\n\\n\r\nBut I can overlook that and other things when I realize that I watched an anime that is targeting a younger audience. Sometimes you just need to drop certain \"adult\" expectations of a story and open your imagination to find the good in it and that's what this anime is about at least for me.\\n\\n\r\nI'm giving the story a 8/10 because I felt it achieved the goal it set out to do which I felt was pretty clear. Not a 10/10 because I felt the story moved a bit too fast. Like there wasn't that much of a build-up it just suddenly came crashing down to a forced conclusion. Even if it is a childish story, build-ups are what I enjoy most and they are extremely important for every story :P\\n\\n\r\nOn a side note, there seems to be an episode 13 which is the rumored OVA. They are likely waiting and testing how sales do before deciding on whether or not to make a new season. *PRAYS SALES DO WELL!* I will buy anything they release outside of Japan if that'll help.\\n\\n\r\nStory 8/10 - Already said above.\\n\\n\r\nArt 10/10 - Seriously the quality of the art in this anime is great. I am very pleased.\\n\\n\r\nSound 10/10 - Some people said Kate's voice is annoying sometimes but I loved it. All the voices, sound effects and especially the opening / ending are awesome!\\n\\n\r\nCharacters 9/10 - All the characters were great to me except Asuta hence the 9/10. I explained this in my criticism above too. Kate, Goro and Natalia were my favorites!\\n\\n\r\nEnjoyment 10/10 - If you can watch it without thinking too much about the silliness and lack of in-depth characters and the ruined potential for Kate's backstory, you'll be laughing at the comedy and enjoying the silliness and pretty impressive art and animation. Let's all support our loli overlord Lady Kate Venera to conquer the world! May the light of Zvezda shine throughout the world!",
            "date": "2014-03-29T12:18:00+00:00",
            "helpful_count": 44,
            "mal_id": 137741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/765875.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hoshimiya-Kate",
                "username": "Hoshimiya-Kate"
            },
            "url": "https://myanimelist.net/reviews.php?id=137741"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIn our world, there are many different types of rulers. From Presidents to Prime Ministers, from Kings to Queens, people of power are able to maintain great influence over life itself. Most of the time, these leaders hold moral ideals, wanting peace over war. Yet others have one goal in mind: to conquer the world. World Conquest Zvezda Plot is a story of such conquering, spearheaded by a little girl, a young boy, and the rest of Zvezda squad.\r\nSTORY\r\nWorld Conquest Zvezda Plot begins with Asuta coming across a little kid named Kate. After a small altercation, Asuta (nowknown as \"Dva\") is recruited into Zvezda, a group of people determined to conquer the world.\\n\\n\r\nConquest goes about telling its story in a rather clever way. In most cases, instead of outright revealing the information through explanations or visuals, the show often uses indirect speaking as a way to give the audience insight into the world without having it spoon-fed to them. Using this tactic causes the viewers to actually have to \"connect-the-dots\" in order to understand who the characters are, why the world is the way it is, and where things will be headed. Now, the show does utilize flashbacks in order to get the more difficult details across, but for the most part, the writing itself was done rather nicely.\\n\\n\r\nIn regards to what actually goes on, the over-arcing plot is rather lackluster. The problem is that the goal itself is not only too vague but too large in scope. Meaning, it's difficult to understand what exactly the purpose is of what they are doing. On a smaller scale, however, the show does at least a fair job of showcasing a slice-of-life-ish portrayal of a fantastical world. Filled with strange creatures, transformations, and tons of udo, most episodes have simpler goals in mind that help to flesh out not only the characters but the world itself. At the same time, the missions are often unique and filled with comedic moments between the cast and the environments housing them. The humor isn't anything great, but the snide quips from Asuta or the overzealous nature of Plamya when it comes to Kate is usually good for a laugh or two.\\n\\n\r\nA large problem with Conquest is the ending. At this point, it has done a very nice job of setting up the overall tension and despair that contrasts with the previous events. However, when all is said and done, the contrived plot points, role-reversals, and underwhelming antagonist leave the series on an unfortunate low-note. Coupled with the fact that the story sets itself up for further shenanigans down the road, you are left with a vast feeling of emptiness. Not that things are just getting started, but rather that they have yet to be completed.\\n\\n\r\nANIMATION\\n\\n\r\nThe overall art and animation for Conquest is actually pretty darn good.\\n\r\nStarting with the art, the show loves to use a wide variance of colors. The ball-like creatures, the characters' clothing, and the locations themselves are rife with many different colors that make everything pop. The backgrounds aren't so much colorful as they are detailed. The Zvezda base comes to mind as do the underground ancient ruins.\\n\\n\r\nAbove all else, the character designs are top-notch. Each character has a \"transformation\" that allows them to become their more powerful selves. These costumes contain the same level of detail as the backgrounds do. Goro's skull mask and military gear, Plamya's eye-patch, helmet, and coat, and Um's Halloween coloring and witch-like outfit are the standouts, but easily help to demonstrate how unique each of them look. Even when not in their strong attire, their regular selves also contain some level of detail to make them contrast with everyday civilians.\\n\\n\r\nThe show also does well in the actual animation department. The fights are easy to follow and nicely choreographed, and the characters contain both fluid movements and varying facial expressions. The CG isn't the best, but it doesn't feel over-bearing or terribly out of place.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe characters in Conquest are \"characters\" themselves, but I'll at least talk about some of my favorites.\\n\\n\r\nItsuka, aka \"Plamya,\" is a young woman who is strong-willed, straight-forward, and at times simple-minded. In a lot of ways, she reminded me heavily of Asuna of SAO fame due to her interesting character design, swordplay, and general bad-assery. Plamya appears difficult to approach, but her conviction to protect the squad is evident. Her character serves to demonstrate that dedication and hard work may not come easy, but the payoffs in the end more than make up for the trouble one goes through.\\n\\n\r\nGaro, aka \"Chief,\" seems like the tough, parental type. Instead, he's more like the silent guardian. Among the whole cast, he surprisingly seems the most out of place with his stature and past, but it's slowly revealed why such a man follows such a girl. He actually has some of the best action sequences in the show to make up for his lack of humor. Chief represents something that we all hope to do, and that is upholding the ideals we hold true to our heart.\\n\\n\r\nEasily the best character from the anime, Kate, aka \"Venera,\" is literally a child. The leader of Zvezda, her strange ability to unite random people from across the land to work towards a common goal is unprecedented. She's loud, demanding, and sometimes sleepy. On top of all this, her best friend is a stuffed pink rabbit. For all intents and purposes, she is a baby girl whose dreams are seemingly too grand to be feasible. And that's what makes her shine. Sure, she's cute, sure, she has an adorable way of talking. But what she isn't is being afraid to dream big, to go for the impossible. That despite the troubles one may face, they can always be conquered.\\n\\n\r\nIf it isn't evident by now, what Conquest does right with its characters is having them serve as messages for personal growth, for personal conquest. Dva is about understanding one's place in the world, Um tells us it's not about being constricted to the past but anticipating the future, etc. The characters' themselves may be slightly trope-y with some of their character quirks, but almost all characters are. Instead, their most important aspects are not the way they look, how they talk, or what they do, but the ideas that they share with us.\\n\\n\r\nOne final note is that some of the characters, comparatively, do not have their backgrounds fleshed out enough. Some do and some don't. It's a mixed bag that is sadly not divided evenly between the cast. Furthermore, as a main character, Dva is rather weak. He provides most of the comedy, but that's just about it. When the show is progressing, one isn't looking for Dva's next scene but rather what the rest of Zvezda squad is doing.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is interesting. At first, it's not that good. It seems rather plain or generic, given the unique atmosphere that the show tries to portray. However, after a few episodes (roughly half-way through), the piece becomes at least average. It's nothing worth listening to on a daily basis, but the beginning, middle, and ending sequences are well done. If anything, the OP feels like lost potential.\\n\\n\r\nThe ED reminded me a bit of Humanity Has Declined's, with its soft vocalist and perhaps out-of-place visuals. This one doesn't have the same \"oomph\" attached to it that Humanity Has Declined does, but it does at least remind one of a lullaby, coinciding with Kate's nature.\\n\\n\r\nThe rest of the soundtrack is sadly quite forgettable. The only prominent \"piece\" is the bell chimes that go off during the screen transitions.\\n\\n\r\nFinally, in regards to VA work, Misaki Kuno does an above average job in her role as Kate. Her voice has that little kid quality to it that is tough to nail. Plus, it's rather unique, making it stand out more than usual.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen it comes to watching this one, it's difficult to like it right away. It seems rather similar to other shows out there in the anime world, and to an extent that is a correct statement. The show's excitement and urge to watch it never really settled in until about three-quarters of the way through. The action was fine, the comedy was there, it just never had much of a hook or draw to entice me further.\\n\\n\r\nEach episode is more or less set-up (at least in the beginning) to give us some indication of who the characters are. This is done in conjunction with the indirect world-building explained earlier. It works decently well, but causes a lot of the scenarios to become somewhat repetitive. Some instances are vastly different from what occurred before, but many of the same jokes and outcomes happen time and again.\\n\\n\r\nThe ending itself is sadly left open, the romance elements at play are teased at but never really take off, and even with the clever storytelling there are some parts that are just never explained. World Conquest Zvezda Plot doesn't really do anything new or exciting, but if you need a fun little show with the added bonus of slick visuals, then this one wouldn't be a bad place to start.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, nice indirect story-telling with contrived ending\\n\\n\r\nAnimation: Great, art is detailed, character designs are unique, actual animation is well done\\n\\n\r\nCharacters: Fine, each provides an underlying \"message\"\\n\\n\r\nSound: Fine, okay OP and ED, bad soundtrack, decent VA work\\n\\n\r\nEnjoyment: Fine, some fun and laughs for the whole experience\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-11-24T09:28:00+00:00",
            "helpful_count": 13,
            "mal_id": 169757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=169757"
        },
        {
            "content": "\"What did I just watch?\" This phrase was uttered by me each week I watched Zvezda Plot. This show is easily one of the strangest I've watched in a long time, but it's really not a bad thing. On the contrary, it's actually one it's strengths and also the main reason I kept coming back week after week to watch it. I'll be leaving a breakdown of its strengths a weakness below, with as little spoilers as possible.\r\nStory - Zvezda's story to be quite frank is extremely silly. The bare bones plot is about a group of borderline superhuman people and their quest for worldconquest. Week after week they go out and conquer something, be it smokers, buildings, or whatever else they feel like doing. They have to fight other organizations that are trying to stop them from taking over the world. A main antagonist does eventually surface, but it's up to you to decide if you think it's really worth it in the end. I didn't watch it for the plot personally, but as with most things, mileage may vary. (6)\\n\\n\r\nArt - The art style is kinda of strange, but all in all it's nothing that would turn you away from the show in my opinion. (7)\\n\\n\r\nSound - (9)\\n\\n\r\nCharacters - This is where Zvezda truly shines in my opinion. The cast is colorful, fun, and their personalities are varied. The way they interact was a treat to watch and kept me laughing throughout the show. Swordsmen, Mafia members, scientists, and mythical creatures are found in this show. You'll be pretty hard pressed to not find someone you like in this cast. The only strikes against the characters I seen were that the cast was female heavy and the main character was somewhat lacking. (8)\\n\\n\r\nEnjoyment - I enjoyed the show a lot more than I probably should have. The comedy really worked for me and as stated above, I loved the characters. I don't regret watching it all. (9)\\n\\n\r\nOverall - If I had to summarize Zvezda in a couple words, they would be \"Stupid Fun.\" The show doesn't take itself seriously and neither should you. If you're looking for a show that has and amazing layered plot look elsewhere because Zvezda is nothing like that. However, if you're looking for comedy or just something different Zvezda might just be the show for you. Give a shot, you just might like what you experience. (7)",
            "date": "2014-04-13T16:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 139825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3441293.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LordAura",
                "username": "LordAura"
            },
            "url": "https://myanimelist.net/reviews.php?id=139825"
        },
        {
            "content": "\"My Loli-instinct tells me that.\"\r\nSTORY 7/10 (Roughly based on tension, coherence, enjoyment and universe)\r\nThe story of Sekai Seifuku is in my opinion not the main point of the show. It is very episodic, yet it doesn't lose its thread throughout the show. Therefore, you are going to get some progress in each episode, still it doesn't seem rushed. You will have a good laugh here and a little tear in the eye there with not too much seriousness going on. Which is a good thing, because anything else wouldn't have fit into this show. That said, both ,fans of comedic and fans of dramatic anime,are going to get their money's worth. \\n\r\nAs the story itself can at some parts appear a little dumb and is, like I said before, not the main point, I was going to give a fair 6 here first.\\n\r\nHowever, I went for a 7, because of the interesting universe and the hilariously exaggerated social criticism this show presents. \\n\\n\r\nART 9/10 (Based on art, art style and animation)\\n\\n\r\nThe art was great. Very detailed characters,clean and colorful art style and smooth animations made a great, yet not outstanding total package anyone will definitely enjoy.\\n\\n\r\nSOUND 7/10 (Based on OST, OP+ED and voice actors)\\n\\n\r\nThe Soundtrack itself was all in all ok. No Soundtrack really was recognizable, but none of them ruined the feeling from time to time either. The opening was great, the voice actors fitted well and did a fantastic job. \\n\\n\r\nCHARACTER 10/10 (Roughly based on authenticity, coherence, development(long running series) and character design)\\n\\n\r\nNow we've finally arrived at the main point of this show. Though my rating might seem questionable to one or two, I'm completely convinced of it. This show gives you a complete cast of characters with convincing backgrounds and more or less reasonable intentions. All of them acted justifiable and were very likeable and non-stereotyped, in a way that may appear very stereoptyped at first. We have a bossy Loli, a plain but likeable main, a mentally teary thug, a nudist prof, a shy robot, a kindhearted ex-mobster and a selfish idiot. And I absolutely adore them all. \\n\r\nAlso this show manages to give the enemies character and screen time as well. They have their own intentions and are believable and likeable, too. That's why the line between our cast and their enemies is very thin.\\n\r\nAnother thing I found absolutely amazing about Sekai Seifuku are the character designs. The kind-of hero-like atmosphere lead to very unique and just awesome \"costumes\", which underlined the characteristics of each and every character in a very creative and well-done way. \\n\\n\r\nENJOYMENT 8/10 (Roughly based on how badly I wanted to watch the next episode and on how often I paused the video an did something else)\\n\\n\r\nI very much enjoyed the show. It's got its ups and downs and I wasn't always pored over the story, especially in the middle where it was very episodic, but all in all I got very much into it, maybe even too much at some points. \\n\\n\r\nOVERALL 9/10\\n\\n\r\nMathematically my overall rating should be an 8 now. But just too encourage people to watch it and as a matter of principle too, because the rating is too low in my opinion, I'll give it a 9.\\n\r\nIf you like unique shows with both, drama and comedy included, that features awesome characters you can relate to, you should definitely give it a try some time!\\n",
            "date": "2015-02-02T08:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 179499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3102423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/laraes",
                "username": "laraes"
            },
            "url": "https://myanimelist.net/reviews.php?id=179499"
        },
        {
            "content": "For all of it's interesting character designs and potential, Zvezda can't seem to translate it into something watchable. The premise is an immediate attention grabber, a comedic story about a organization out for world domination from the perspective of one of it's low level grunts. Unfortunately A-1 seem to have stopped at the premise and character designs, forgoing writing an interesting narrative. \r\nOn several occasions I was left with the feeling that I'd missed an episode or two, plot points are introduced and dropped fast with little explanation. Some story beats completely miss the mark, and the level of narrative convenience on display is unmatchedby any piece of media I've ever watched. Things happen in Bouryaku no Zvezda which is the nicest thing you can say about it's plot, but it's unlikely to explain why.\\n\\n\r\nThere is little to no consequence to anything that happens during these 12 episodes. Many of the characters do not get their time in the sun, instead the show assumes that we know them already by introducing characters from their past and forcing us to fill in the blanks. In one particularly insulting instance, the climatic episode of the series is a hot spring episode. The characters return from their vacation to discover that the final act of the story has started without them present. Why?\\n\\n\r\nOf course the character designs are interesting, but you'll be given very little reason to care about many of them. It's impressive that in a show with such an out-there cast they still find time to have anime requisite filler in a 12 episode show. What's the opposite of \"tightly paced?\" Zvezda is exactly that.\\n\\n\r\nThe animation is fine enough, and the voice acting and soundtrack is a particular highlight for me. But otherwise this is a show with very, very little to offer the viewer. In fact it doesn't seem to have much to offer to itself. With a bit of effort with it's narrative this might have been a highlight of the season, instead it's easily forgettable and in some cases obnoxious to remember.\\n\\n\r\nZvezda isn't interested enough to have a coherent story, return the favour and avoid this one.",
            "date": "2017-03-27T12:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 243696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5485448.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Streecer",
                "username": "Streecer"
            },
            "url": "https://myanimelist.net/reviews.php?id=243696"
        },
        {
            "content": "A what if scenario involving #GotMilk & #StopSmoking got together and made a love baby. \r\nThe show while not having any story worth noting. It greatly makes up for that in Comedy,Art,Music and Characters.\r\nThe comedy of the show is pretty good with a lot of good jokes. The MC is one of the best Straightman i'v seen in recent time and fits with into this show really well. \r\nAsuta himself also has a pretty nice Character design that surprisingly looks different then every other male MC. I originally thought he might be a chick and was kind of disappointed when i found out he wasn't. But in the end i actually like this more.\\n\\n\r\nKate is a pretty adorable character. Even though she looks like a kid i am pretty sure she should be around 20 something, Maybe even more. Her aging stopped when she was a kid witch is why she looks the way she does. But she still has the mannerisms of a little kid. Kind of wish we got to see what she'd look like if she was grown up.\\n\\n\r\nGorou Has a pretty badass looking character design. First time we see him is him walking through the smoke of a Company of soldiers in the middle of the night and it's pretty awesome looking. He himself is also a nice character.\\n\\n\r\nNatalia not much to say. She is a awesome genius. Compared to others girl geniuses that are always annoying and never likable. She Probably has the 2nd to last worst hero design.\\n\\n\r\nItsuka Is probably my 3rd favorite character of the Main character cast. She is just a funny character.\\n\\n\r\nYasu is the worst character in  the main cast and of the worst in the entire show. It sucks to cause he kind of seemed like a nice character at the start.\\n\\n\r\nRobin is funny and also a good pair up with Asuta. \\n\\n\r\nThe art is really nice. I found myself really liking this would just because of the art. \\n\\n\r\nThe music is pretty awesome. I'v been listening to a ton of generic soundtracks from the anime's i'v watched recently so this was a nice surprise.\\n\\n\r\nReally like this show. I recommend it to just about anyone.",
            "date": "2017-12-04T22:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 264546,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264546"
        },
        {
            "content": "☆ This is a spoiler-free review ☆\r\nStory [8]\r\nHonestly, Sekai Seifuku: Bouryaku no Zvezda, or as it's known in English, World Conquest: Zvezda Plot, was a rather enjoyable watch. \r\nArt  [8]\r\nThe art was a nice blend of cutesy-modern with a great color scheme and character design. You could really get a grasp of what each character's persona was, right off of the design. \r\nSound [7]\r\nThe sound was nothing spectacular, as I'm not much of an audiophile, but the voice acting was fine. \r\nCharacter [7]\r\nThere was a nice supply of character development-it may come as a surprise, with such a comedic output and the overview ofjust being another quick 12 episode anime, but had some great characters with great backstories.\\n\\n\r\nEnjoyment [9], Overall [8]\\n\\n\r\nOverall, it's a great show for a quick laugh, and if you glance a little bit deeper, it might be able to send some interesting messages your way.",
            "date": "2016-08-25T03:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 227561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5648188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EchoGumdrops",
                "username": "EchoGumdrops"
            },
            "url": "https://myanimelist.net/reviews.php?id=227561"
        },
        {
            "content": "This anime is really good for a laugh. While watching it there were several times i had to go back and re watch  scene just to see all the jokes they were able to fit in there. \r\nIf you're here for an anime about world conquest, then you're about to be conquested yourself, by a lack of actual conquesting.\r\nThe whole anime is basically about this girl who plans on taking over the whole world and her crew of comrades, who include \r\nGirl with sword: Features include, a sword, eye-patch, and a  underlying crippling depression that causes her to break into tears like a2 year old whenever she loses the eye-patch\\n\r\nMagic Girl: IDK if its actually magic or just advanced technology but she does some cool stuff and sleeps wherever she wants\\n\r\nThe Tank: He walks, talks, and doesn't stop, unless he gets shot then he takes a bullet wound cause he is actually just a human after all\\n\r\nRobot Girl: Perks include: Is a robot. Cons include: She runs on vegetables \\n\r\nThat one guy that smokes a lot: He looks like a cowboy and smokes sometimes, usually followed by him getting water poured on him, making him leave the group, then come back and sometimes even not break everything.\\n\r\nThe normal guy: Our main character, doesn't have anything special about him he literally just talks to people and thats about it. \\n\r\nThis group is fought by the relentless group of highschoolers dressed in white robes and masks on top of masks, with the goal of finally wiping out the Zvezda group and stopping their not-so-tyrannical rule over this small town in Japan. \\n\r\nAt a certain point you realize that you just enjoyed this anime, thought it was funny, but you got through it without asking any questions on how things work. I mean, how does the entire city run on the energy produced by a giant plant, idk, but it does and its pretty funny. \\n\r\nNevertheless the anime does have some moments that could be called \"tense\" and actually felt like it was doing something sometimes. Definitely worth a watch if you have a free night and nothing else to do. \\n\r\nAnd remember kids, smoking kills... everything. like its actually the main enemy in this anime for some reason.",
            "date": "2017-01-22T00:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 238818,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5100143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BenjaminRogers",
                "username": "BenjaminRogers"
            },
            "url": "https://myanimelist.net/reviews.php?id=238818"
        },
        {
            "content": "When I first saw this show on MAL, I was surprised that I hadn't heard of it before. It was made by A1-picture, a very popular studio. But after I watched it, I get it.\r\nI won't write much about the show, cause I don't care enough.\r\nThe first 4 episodes were actually pretty good. The character interactions were fun and the character designs were really good. It wasn't very unique, I had seen many shows like this. But it was still fun to watch.\r\nAfter that, the interactions got less and less fun. I don't know if the quality actually got worse, or if the scenes weretoo similar. but I definitely enjoyed it less.  \\n\r\nBut then there were the last few episodes, where they tried to make it a little more story focused. And here's where the most forgettable part comes. Cause nothing happens. Of course, plot points occur, but nothing of any big consequences. I don't know why that part had any significance. It was cool visuals and evil villains.  \\n\\n\r\nSo yeah. It was mostly the technical aspects that saved the show from being the worst. So overall, it was a strong 6",
            "date": "2019-01-12T04:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 298802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6937139.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WeebWithoutAName",
                "username": "WeebWithoutAName"
            },
            "url": "https://myanimelist.net/reviews.php?id=298802"
        },
        {
            "content": "Plot [7/10] : Step into the world of world conquest!!! If I was to describe Sekai Sefuku's plot so you get a good grasp of what the anime is about it would require long mathematics formulas, a few of Newton's laws, a wet nap and a glass of cranberry juice. But to simplify, Sekai Seifuku is just what the name entails... World domination. The story centers around a boy named Jimon Asuta, A.K.A Dva, who runs away from home and finds refuge in the the Zvezda;an \"evil\" organizaiton who's goals are to....basically  take over the world. Each episode is mixed with a good amountof comedy but this isn't really a gag manga. The manga uses a type of dark humor that seems light at first glance. Add in a light organization who is trying to shut down Zvezda and you basically have Sekai Sefuku.  Instead of being plot oriented this story is more character driven..\\n\\n\r\nCharacters [9/10]\\n\r\nI loved the characters. They kinda reminded me of Awakawa Under the Bridge because in AwaxBridge everyone who lives under the the bridge are weirdos with only 1 sane person trying to figure out WTH is going on. If you relate that to the members of Zvezda, Asuta is probably the only normal person. The character designs are really good and I enjoyed a lot of the back stories. Although they are random at times they made this a really good anime and you cant lie... The costumes are bad a$$.\\n\\n\r\nSound/Art [8/10]\\n\r\nThe Op was really done well and Its fun to listen to. The art is above average and adds to the enjoyment of the anime. There's a lot of pretty colors and its nice an easy on the eyes.\\n\\n\r\nOverall [9/10]\\n\r\nFor me this was the best anime of the winter season. But i didn't watch the Oda Nabunaga based anime so I cant count them but I watched a fair amount of the winter season. It takes about 3 episodes to get used to the pace but overall it was done really well. I recommend this to people who loved comedy and weird characters. Also at the end of this anime it attempts to have some sort of plot and although it fails IMO its still good.",
            "date": "2014-04-05T18:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 138829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465770.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BossTheKid",
                "username": "BossTheKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=138829"
        },
        {
            "content": "I'm rather new to the anime 'game', but I like to think I know when I've found something good. After a disappointing attempt at Attack on Titan I'd found Kill la Kill, and I was hooked. Both AoT and KLK were easy - the amount of talk they got on tumblr, and the resulting fandoms, provided enough peer pressure and 'buzz' to make entering those series almost mandatory for understanding what was going on on my dash.\r\nZvezda, however, was not one of those series. I've yet to come across any casual reblogs or fan-art of the series on my dash from people I'm currently following.The screencaps I've posted have received attention, usually in the form of 'what series is this' if it's not stated outright, but even so, the attention's been relegated to a handful of notes. The attention the series has gotten, as far as I can tell, has been mostly from people who've fallen in love with the girl whose dreams will always be bigger than her body, the semi-dressed-to-kill Kate Hoshimiya. \\n\\n\r\nDoes this make Zvezda a sleeper hit? Or just another fluffy show with a fair amount of fanservice to round out last season? It may be hard to tell right now, but I'd say, at 12 episodes, it's worth your time if you're in the mood for something silly and exciting with a heart, you probably won't be disappointed. Full disclosure: I say this as someone who's fallen for the aforementioned half-dressed girl.\\n\\n\r\nI found Zvezda on Daisuke from an ad showing a crew of characters dressed in eccentric outfits. A skeleton, a robot, a girl with a skull-and-crossbones kitten eyepatch, and a couple of masked-up, mostly-naked women - as bizarre as this sounds, you'll see how accurately this sums up the series. It's funny, weird, and intriguing, featuring a cast of bizarre outsiders engaged in a struggle over the fate of the world. It will have you laughing, and maybe a bit touched by the stories of struggle against oppression and the bonds of friendship in the face of danger. Over the course of the show you'll get glimpses of a secret world beneath our own, watch intrigue play out between warring factions in the past and present, and discover why smoking is really much worse for you than you might originally think.\\n\\n\r\nThat said, if that sounds like a lot to work out over the course of twelve episodes, you're right.\\n\\n\r\nLike Kate, the vision that Zvezda puts forward might be a little bigger than it's capable of handling on its own. The show devotes a fair amount of time to its ensemble cast, each of which has a strange backstory that you're treated to glimpses of without seeing the whole thing. There's a lot going on, both with the characters and the world around them, and none of it's explained too clearly. What you get is impressions - sadness, fear, excitement, joy - without much depth or elaboration. While this isn't bad, a few times during my initial viewing, and more in retrospect, I found myself asking, 'if they have so little time for the series, why did they put x into it?'. \\n\\n\r\nBut that being said, I didn't walk away from it disappointed - on the contrary, I wanted more! The OVA, another season, an English translation of the manga - there's plenty of story here to tell, and part of what Zvezda does best is lends itself to the imagination where (much like Kate's outfit) it only teases instead of showing outright. You're mostly along for a very fun. fast-paced and somewhat confusing ride, much like the unlikely protagonist Jimon Asuta himself, and if you're willing to put up with a fair bit of nonsense and a few half-baked ideas this is probably worth your time.",
            "date": "2014-04-13T14:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 139813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=139813"
        },
        {
            "content": "The only thing you can say after watching this show is \"What.\"\r\nIt's good, but don't watch too many episodes at once, because your brain might overclock and shut down, like mine did. Don't try to think while you're watching. You do have to pay attention though because it's really easy to miss one of the gamut of random scenes throughout.\r\nThe best parts were the animation quality and characters. The action scenes were animated very well when they had them, and the cg was okay. The characters were really kooky but I liked them when I stopped trying to understand anything and just went along withthe show. Another cool thing that I noticed was that the plot exposition was done in a roundabout way.\\n\\n\r\nThe sound effects wore me out after a while, but that was expected considering the colorful style of the show. \\n\\n\r\nThe reason I'm giving this a relatively high score is that the show doesn't take itself seriously given what it presents.\\n\\n\r\n7.2/10.0",
            "date": "2016-08-28T08:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 227805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4920374.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jeffreyhou1997",
                "username": "jeffreyhou1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=227805"
        },
        {
            "content": "This show had almost no plot and no character development, but this show's charm does not come from either of those two. The show was an outrageous comedy, to which some of the jokes were actually kinda funny. The characters are all different and entertaining, each having a strange and neat background story. Near the end of the show, like most episodic shows, it started to give a shit about the plot, but this show did it in a good way. The ending fit with the show, it was strange and kinda funny. The show also ended on a good note, not really leaving anyhuge events leading to a second season, but if they really wanted a second season they could easily pick it back up.",
            "date": "2015-10-21T21:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 201721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShadowBunny",
                "username": "ShadowBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=201721"
        }
    ]
]