[
    [
        {
            "content": "It is rare to find a sequel as emotionally powerful as Little Busters: Refrain. Where the first season blundered with its melodrama, Refrain instead provides a much more thoughtful and meaningful story. If you have developed any sort of attachment to the characters in Little Busters, you will undoubtedly shed at least a few tears by the end of Refrain. It is the second best Key anime to date. \r\nAs somebody who regards the Little Busters visual novel as one of the most emotional stories they have ever experienced, I was sceptical hearing about an anime adaptation of Refrain. Did it turn out to besome dreadful abomination in the end? I don't believe so, but the visual novel is still undeniably the superior experience. Large sections of story (including half of Rin's route) are skimmed over or ignored entirely in the anime. Other important scenes, such as Masato's backstory, are misrepresented as something silly when they should be serious. There are so many things that could have, should have been better, and yet it still manages to be one of 2013's best anime. Perhaps that is a testament to how strong the characters are.\\n\\n\r\nFor anime-only viewers, Little Busters: Refrain is certainly no featherweight. The story directly follows the events of the first season by developing characters who were largely overlooked in the past. Perhaps you found Rin adorable or Kyousuke amusing, but Refrain succeeds in elevating the main five much higher than that. It is one of very few anime where the relationships between the characters feel genuine rather than forced or manufactured. As a series rooted in the theme of friendship, Refrain does a magnificent job of making the viewer feel like they are a part of the story rather than merely spectators. That is no easy feat in a visual medium. \\n\\n\r\nLittle Busters does not rely on fanservice and other cheap tricks to hold your interest. Surely, there is an ever-present feeling of 'moe' among the girls (isn't Rin just the cutest thing?) but it is never used as a crutch for characterisation. Even Komari, arguably the weakest character in the first season, is given a considerable amount of depth through her relationship with Rin. Refrain goes further than giving more-- it makes us care. It does not find complacency in characterisation without meaning.\\n\\n\r\nWhat about Kengo and Masato, then? There was never much depth to them in the first season, amusing as they were. Masato in particular seemed to exist solely as comedy relief, like a more idiotic version of Clannad's Sunohara. That is no longer the case with Refrain. An entire episode focusses on Masato's backstory: why he is obsessed with the idea of strength, why he acts like an incessant moron in front of others, and how he became friends with Kyousuke and Kengo. The only issue is that the anime portrays these scenes as something silly (zombie eyes and battle music blasting in the background) when it is meant to be emotional. I'm not so sure the anime-only viewers will appreciate his characterisation as much as they could, which is a shame, as all the characters enrich the story in a pretty significant way. \\n\\n\r\nKyousuke's characterisation is where the writing truly shines. While his presence as a leader is often taken for granted in the first season, Refrain shows there is a far deeper reason for why everyone respects him so much. It is more than mere charisma. He cares about his friends more than anyone else and will go to any lengths to protect them from harm. Even if it requires him to play the role of a villain. And often he does. It is easy to be frustrated or even infuriated by Kyousuke's actions, but once all the pieces start clicking together at the end, you can't help but respect the poor guy. He's a deeply flawed person, and that's the way it should be. He is not perfect and makes mistakes like anybody else. Rarely do we find a character as genuine as Kyousuke. \\n\\n\r\nWhile the handling of Rin's route is disappointing, Rin manages to stand right beside Kyousuke by the end of the story. The second-to-last episode focussing on Rin is so touching, so masterfully directed that it genuinely surpasses the visual novel. I do not say that lightly. Unlike many other Key stories (and even anime in general), there is no melodrama. The entire series has been building towards a very specific point. Once Rin starts crying into Komari's arms, it is nearly impossible to resist choking up a bit. It's similar to the ending of K-ON's second season in many respects... although I might argue that Refrain does it better. \\n\\n\r\nAnd that is to speak nothing of how powerful Kyousuke's episode is. Or the lyrical significance behind the insert song \"Haruka Kanata\". Or all the subtle details hidden in the first season, or even how it gives meaning to all the alleged dei ex machina within Kud's and Mio's routes. Little Busters is Jun Maeda's masterpiece, and while not everybody may appreciate his style of storytelling, there is almost nothing to criticise about his work on Little Busters. Even if the anime only captured a tiny fraction of the visual novel's charm, I still believe it would be a satisfying experience. J.C. Staff's adaptation isn't fully there-- but it comes close. \\n\\n\r\n\"Comes close\". I wish it could have been on par with the visual novel, but that is regrettably not the case. The amount of scenes (and important ones, no less) that are skipped over is truly disappointing. All J.C. Staff needed to do was simply tone down on the foreshadowing (which can really undermine the surprise) and find the budget needed to double Refrain's episode count. If the anime did reach the same heights as the visual novel, I have no doubts that it would be regarded even more highly than Clannad: After Story.  \\n\\n\r\nThe artwork has been noticeably improved over the previous season, though. A surprising amount of effort was put into the first episode, and J.C. Staff has worked to eliminate most of the bizarre, off-model faces that were so prevalent before. There are still occasional scenes where the animation quality dips but it is nowhere near as egregious as it used to be. My only complaint is that many important CGs from the visual novel (\"called game\") are lacking any sort of visual impact in the anime. The visuals should have been used to enhance the story rather than merely assist it. \\n\\n\r\nRefrain makes near-perfect use of its soundtrack. \"Boys Don't Cry\" (Kyousuke's theme) is a subtle track that does not seem to carry much significance at first, but eventually evolves into what I believe to be the most emotional track in the story. It is a perfect tribute to Kyousuke. Most people will also find themselves pulled by the sheer emotional weight of \"Haruka Kanata\", the farewell song of the series. Considering the lyrical significance and all that was building up towards this point, it achieves more than simply being sappy; it is a massive tsunami of emotion. Special props should also be given to \"Song for Friends\" which achieves much of the same impact as the previous two. While Little Busters may have one of the best soundtracks in anime, it also has one of the best uses of music. \\n\\n\r\nThe seiyuu work is also commendable. The actors do not simply state their lines. During the more emotional moments in the story, you can clearly hear the actors choke up as their character begins to cry. We do not often see this level of effort in anime. Kyousuke's and Rin's seiyuu evidently care about getting into the role of their character, and the result is some of the best voice acting in years.\\n\\n\r\nLittle Busters: Refrain is a superb anime. It is an experience that is more than the sum of its parts. Few anime have managed to create such a thoroughly endearing cast of characters, and even fewer have managed to strike such an emotional chord with its audience. It may not be as good as it should have been, and while the visual novel is still several steps above, the anime adaptation is a solid alternative for those unable to dedicate the fifty-some hours into reading the visual novel. Those expecting a deep, convoluted story brimming with 'mature' characters may not find what they are looking for. Little Busters Refrain is particularly well-written and well-produced, but it does still rely on your ability to empathise with the characters. I don't think that is a bad thing at all.\\n\\n\r\nAnd I wonder, why do we live in an era where stories are judged solely by their complexity? Why must a critic feel forced to act is if they are too high-brow to value emotion? Human emotion is a powerful, powerful thing that gives our transient existence a meaning and a purpose. If a story is capable of bringing you to tears, it is a damn good one, I would say.",
            "date": "2014-02-14T20:12:00+00:00",
            "helpful_count": 406,
            "mal_id": 132599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=132599"
        },
        {
            "content": "Let's get one thing out in the open, I played the VN. Little Busters has always been close to my heart with the story itself one of my favorites around. But enough of that, let's get the review under way! Oh, and this review will contain comparisons between this and the first series and occasionally, reference to the VN. \r\nFirst things first, this series is a massive improvement in every aspect compared to the first series, be it art style, script, or timing of music. If I were to choose one stand out improvement however, it would have to be the animation. I found theprevious series almost unbearable at some points but this series, well was top class compared to what we have already witnessed within the Little Busters universe. This series blitzes the first series. One thing I must add is that to those who didn't watch the first series and have noticed the popularity of this series and wondered 'can I watch this series without watching the first?', you must watch the first series to fully embrace this series. \\n\\n\r\nThis series kicks off right where the previous series left off, focusing more on the 'Secret of the World' and the original Little Busters themselves. When the 'Secret of the World' starts to become more apparent, one realizes that this series itself is far darker and serious compared to the first. A personal love of this series is how subtle hints are dropped throughout concerning 'the secret of the world'. Some moments are incredibly clever and well, blow your mind! \\n\\n\r\nOne thing that is very apparent in this series is that it is very emotional. In the first series, there were incidences that weren't emotional at all and yet in the VN, they had me reaching for the tissues. This was due to things being lost in translation, literally. For me this was most obvious during Haruka's route but let's save this rant for another time. However, I was simply blown away at how well they transferred the emotional scenes over from the VN. I even felt that at certain points, the anime was actually more emotional than the VN!\\n\\n\r\nUnlike the first series, Refrain actually contains character development! Hooray! This in turn makes you feel more connected to the characters and thus enjoy the series more. Whats more is that this 'character development' didn't just apply to the 'original little busters' but the newcomers aswell such as Kurugaya. Happy days!\\n\\n\r\nNow, before I tie up this review, I wanted to dedicate a section the music. The music in LB is simply astounding. Be it instrumentals like 'Lamplight', which sends a shiver down my spine due to how harrowing it is or songs like 'Faraway' or 'Song for Friends'. I must add 'Faraway' is simply one of the most emotional songs I have ever heard. \\n\\n\r\nThis story is full of so many twists and turns that you couldn't possibly predict what could happen. Its a compelling, sad and funny story all in one! But the main reason I gave this series such a high rating is simply because of how well the JC staff adapted this story into an anime. I knew what was going to happen and yet I was glued to the screen from the get go.\\n\\n\r\nThis is a must see. One of the best of 2013!",
            "date": "2013-12-28T15:44:00+00:00",
            "helpful_count": 101,
            "mal_id": 126071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1831559.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/thelotusf1fan",
                "username": "thelotusf1fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=126071"
        },
        {
            "content": "Little Busters Refrain is (loosely) based of the key visual novels who have notably produced some great shows such as Clannad, Kanon and Air. Little Busters Refrain is no different. For a LB refrain is the sequel to Little Busters and in my opinion (and widely regarded to be) much much better than the first season, not that LB was bad in any way. This 2nd season is 13 episodes long.\r\nI should mention at this point that this again would fall under the category of high-school life (almost all of the action occurs here), fantasy and slice of life perhaps. As we have come toexpect from key, LB Refrain is just as emotionally hard hitting in its own way but I will leave you to decide that for yourselves.\\n\\n\r\nNow for the actual show itself. It picks off basically where LB left off and continues to develop characters stories from there. However the way it goes about this is in much more depth and each and every episode will invoke strong emotion. They only give themselves 13 with it all to do and they pull it off pretty well. You may be wondering if it is possible to further develop the characters stories in such a short time however the pacing and the mixture is just right. \\n\\n\r\nWhere LB was a rather nice, slow setting into the story, you really have to feel that it was all building up to LB Refrain. Be warned, LB Refrain takes a much darker angle right from the outset, some sensitive themes are explored and are very thought provoking. It goes to show that not everything can always go smoothly and it is here that you can really start to connect with the characters. \\n\\n\r\nSTORY + CHARACTERS: The story itself continues in the high school, we still don't know the answer to the universe (to those who have watched LB) and the episodes go through with each character. They all have very different stories and they are all fascinating in their own right. The characters you may have thought to be on the fringe suddenly make much more sense and everything is never as it seems at first ;). The best bit of this show in fact how well all the episodes were integrated with each other right from the first episode of LB to the last of Refrain. When you reach the climax, which personally I found very satisfying you can come to appreciate everything that has occurred in the previous episodes, it all suddenly fits together with amazing effect. \\n\\n\r\nOne thing I found with LB Refrain which was distinctly different to LB was the way they just dropped bombshell after bombshell without really ever giving you any chance to recover, the plot gets thick and very fast. In order to wrap up the show in 13 eps, each of the eps feel meaty and full of content and in fact the intricacies all make it more pleasurable to watch a second time once you know what is actually going on.\\n\\n\r\nThe soundtrack was very good I thought, the music complemented the action just as you would expect from a key adaptation and once again it was used to add an extra dimension to the atmosphere, made you feel something a little extra. The OP in my opinion was especially pleasant as well. \\n\\n\r\nAs a final word on LB Refrain, if there were one thing that I would stress the most, it would be that you have to keep yourself aware and keep your mind open. The story really does take you on ups and downs in the 13 episodes and it executes it so well in such a short period of time that there are various emotions that are evoked. The characters of this anime are probably some of the best worked characters or rather collectively they are the most interactive bunch with everyone having an affect on the other.\\n\\n\r\nExpect the unexpected on this emotional rollercoaster that is Little Busters Refrain. \\n\\n\r\nKyousuke, Rikki, Rin and co. make for one heck of a show with perhaps my most favourite story line full of twists and turns.",
            "date": "2014-02-07T15:07:00+00:00",
            "helpful_count": 79,
            "mal_id": 131815,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3111993.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tukky12",
                "username": "tukky12"
            },
            "url": "https://myanimelist.net/reviews.php?id=131815"
        },
        {
            "content": "There is a \"secret of this world\"….\r\nIf there is anything, it’s no secret that Little Busters Refrain is a sequel of the first season based off the visual novel of the same name. Also no secret is the fact that the visual novel has gained tremendous success as one of Key’s works. Key is known to produce a variety of their works with supernatural elements including Kanon, Clannad, and Rewrite. The Little Busters franchise tells the story of a boy named Riki Naoe who is a member of the team known as Little Busters. Along with three other boys and a girl named Rin, theyare led by Kyousuke to play baseball at their school. But little do they know there’s much more than meets the eye...\\n\\n\r\nIf the first season of Little Busters was the prototype, Refrain would be the final product. This means that it’s a direct continuation from the way season 1 was set up. Of course, not everything usually goes right especially in cases of visual novel game adaptations. Usually, fans expect more than what they can bargain for in terms of consistency with its characters, story, setting, music, artwork, and the list goes on and on. There have been some series that pulled it off quite successfully with its adaptations while others not so much in recent years. Little Busters Refrain falls under the category of a mixed bag at some occasions. It’s not a masterpiece but neither is it a shipwreck beyond salvage. It’s more of a work that fans should appreciate as it wraps up the story of Little Busters as a whole to deliver satisfaction and something to remember by.\\n\\n\r\nLittle Busters Refrain takes place in the same setting as the first season with most of the characters returning. However, it’s noticeable that the story changes dramatically in tone with its previous predecessor. A key (no pun intended here) concept involving the supernatural element of the “secret of the world” becomes prominent throughout the season. However, it doesn’t always go that way as we still some humorous moments. Not only has that but Refrain also added in some hints of potential romance between Riki and Kurugaya. The beginning stages of Refrain drops many hints of this with Kurugaya’s desire and wish to live her best days. Her presence in the show will leave a short yet memorable impression to viewers because of her wish. However at the same time, her departure lacks morality on her own behalf as what she wishes isn’t exactly what viewers may hope for. \\n\\n\r\nBut that’s only the beginning stages as viewers will find out that Refrain has many secrets to be unraveled as each episodes goes. This is accompanied by a balance of light and darker themes. Unlike season 1, the show ventures into a darker element involving tragedies along with themes of adolescence in growing up, dealing with losses, and experiencing the unexpected. At the same time, the show still brings in the slice of life fun at occasions similar to season one. The feeling of being part of a team and enjoying life with friends is an experience that I’m sure most people would cherish. In Refrain, we get to see five childhood friends enjoy their life. Unfortunately, not everything goes as they expected. \\n\\n\r\nAs Key is involved in the show, adolescence and growing up becomes a major role for our characters. In particular, Kyousuke (the leader of Little Busters) plays a guardian role and bringing in the foundation of the show of growing up. At the apex of the story, his feelings are poured out that truly allow viewers to see how he expresses them. More than that though, characters such as Kengo and Masato also play prominent supporting roles. All the characters are joined together by friendship that defines the importance of closeness and appreciation. As the series goes on, fans will learn the truth and more about the ‘secret of the world’.\\n\\n\r\nThe story of Refrain might also seem confusing at first with the various twists such as montages, narration, and climatic like scenes. There is a presence that something is not right in the world that Riki and his friends are part of. This is where foreshadowing comes into play as various hints are dropped with the dialogues, character interactions, and scenes are shown to give viewers firsthand what they might experience. As for the experience itself, it can be different for everyone. Key is a company known to bring forth themes of tragedy as well so emotions are to be expected. As one grows up, they will embark on a journey to learn from the various events in their lives. For our characters in Refrain, they too experience that journey. \\n\\n\r\nThe journey itself is explored in various arcs and episodes that connects the story as a whole. As a way of presenting the show, Refrain gives most of the prominent characters their spotlight including Kurugaya, Masato, Kengo, Riki, and Rin. Kyousuke becomes a driving figure in this show as mentioned before and the experiences he goes through reflects on Key’s reflection – the way it illuminates his feelings. The story itself also conveys comedy despite the grimmer atmosphere. Comedy exists not as fan service but rather as the character interactions and dialogues that holds various meanings. Although Refrain also lacks a bit of the more battle theme setting, it retains its sports style of baseball. Obviously, the show isn’t about sports but the moments are memorable especially for our main characters that enjoys their everyday lives just being together. Viewers will appreciate the concept of friendship that connects them as a whole while discovering the secret of the world. The surprise might not be pleasant but their experiences are unforgettable.\\n\\n\r\nRefrain still lacks a few aspect that might not be appreciable for viewers. As an anime only viewer, I did get quite the satisfaction from this show. However at times, I feel like something is missing such as resolutions to sudden conflicts. Some of the comedy also seems to be oddly coordinated or expressed such as Masato’s reactions. There’s even one particular episode focuses on him that gives him the highlight but doesn’t seem fitting with the Refrain atmosphere. Among other things, visual novel adaptations also sometimes suffers from consistency. In the case of dialogues, it nails it on the spot but not always the expressions or reflection of its ideas. There is an emotional impact to be felt but some parts aren’t tear jerking by Key standards. Perhaps a show being one cour is a problem here but at some cases, the arc/story feels rushed such as montages and resolutions. Also from what I understand, sudden elements of the VN are omitted that would of given the impact of tragic scenes. Despite this though, Refrain still balances itself between light and dark with its style and presentation.\\n\\n\r\nAnimation wise, the show remains decent but sometimes lacks impact or rather the maturity of its darker tone for Refrain. Characters are designed to look innocent such as Komari, Kud, Rin, etc. Kurugaya and the boys have a more mature while Riki has more of a childish appearance. On the other hand, the backgrounds are portrayed well and consistent with its fantasy-like atmosphere. The dream like sequences are prominent features that brings supernatural elements while dropping foreshadowing sequences for viewers. As an anime only viewer though, some of the expressions of the characters bothers me such as Masato and Rin. In fact, Rin isn’t very noticeable compared to the other main characters. Even when she takes the stage, it’s hard to take her seriously with her body language and expressions. On another note, JC Staff is known to adapt various anime series with a school life setting such as Sakurasou no Pet Kanojo, Hentai Ouji to Warawanai Neko., and Shakugan no Shana. While not all of them contains elements of supernatural, they do convey the innocence reflections of the characters. However, I question sometimes if this style fits given the more serious style of Refrain.\\n\\n\r\nThe soundtrack balances well on most parts whether it’s during scenes of emotional, comedic, or suspense. Various OST are incorporated from the visual novel while certain new ones are inserted in. It’s also noticeable that Jun Maeda, the creator of the VN is directly involved in coordinating the soundtrack so some of the experiences will feel similar according to his style of presenting the series. The OP song ‘Boys be Smile’ stands as a prominent song to convey the friendship that brings together the team of Little Busters. Even though not all the characters get their own spotlights, it portrays the show in a way that is remarkable with its messages. On the other hand, the main ED song “Kimi to no Nakushi Mono” lacks impact with its orchestra. Voice acting wise, most characters fits well although I sometimes find Riki’s voice to be irritating along with Rin. Kyousuke on the other hand has that authoritative mannerism thanks to Hikaru Midorikawa’s talents. The way he speaks gives him a sense of command and shows why he is the leader of Little Busters. Other characters such as Kurugaya and Kengo demonstrates maturity with their own tone of voice.\\n\\n\r\nLittle Busters Refrain isn’t just about discovering secrets but also finding paths to connect the characters together in a complex story. The romance might not be promising but the connections are through friendship and loyalty. There are certain elements that might be confusing especially for anime only viewers so be sure to pay attention as each episode unravels itself. Dialogues in the end should not be just memorable but also matching to Key’s style of presentation. Thankfully, it did that even with some of the oddly coordinated scenes involving expressionism of the characters. And because the show lacks fan service, there is no stupidity with the common misunderstandings or cliches that are overused in the anime industries on many occasions. What it does have is an impact that give viewers an experience they won’t forget. Refrain is not just a continuation but an appreciation as a gift for fans to open up.\\n",
            "date": "2014-01-03T15:56:00+00:00",
            "helpful_count": 57,
            "mal_id": 127027,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=127027"
        },
        {
            "content": "Little Busters! ~Refrain~ Full Review\r\nThis fall season, I get the joy and honour of reviewing Little Busters Refrain on Anime Corner. Honestly, I didn't expect it to be this good. It surpassed my low expectations garnered from the mediocre first season, to one of my favourite series of all time. However, please note that I have not played the visual novel, so this review will be solely based on the anime only. Anyway, let’s get on with the review.\r\nStory (9/10):\r\n“I totally didn’t expect that to happen.”\r\nIf you have watched the first season of Little Busters, you must have found it rather boring and mediocre. Everythingwas kinda predictable, and as such when they hit you with the feels, somehow the tears just don’t flow. As such, Refrain is the reward for managing to watch all 25 episodes of the first season.\\n\\n\r\nRefrain is totally different. Every episode is interesting with a super-annoying (but satisfying) cliffhanger at the end of each episode that just keeps you at the edge of your seat. There are so many plot twists within the show; you almost never know what’s coming up next, which causes so many emotions to be experienced when they do hit you with the emotional scenes.\\n\\n\r\nRefrain basically continues directly where season 1 left off. Riki and Rin get closer to the secret of the world, which I have to say, be extremely satisfying when it got revealed.\\n\\n\r\nMoreover, everything from season one has been linked together here to form this masterpiece. If you do go back and watch season one, you’ll get a newfound appreciation for it because you can see exactly what the characters and doing and why they are doing so. \\n\\n\r\nCharacters (9.5/10):\\n\\n\r\nHonestly, Little Busters is nothing without its characters. This is an anime where the characters are so masterfully done where it just carries the whole show forward.\\n\\n\r\n*Spoilers Ahead*\\n\\n\r\nOf course, with characters being the main focus, you would see a lot of development. Hell, the whole story is centered on the development of both Riki and Rin. Without a doubt, Riki is developed the most. When he was young, he was super depressed because he lost his parents, but Kyousuke and the Little Busters helped him get back on his feet. But even in season one, he was more of a follower. A follower of Kyousuke. As such, the entire story was basically to make Riki into a more independent leader. You could definitely see the difference between Riki’s confidence and decisions in season one as compared to the last few episodes of season two. \\n\\n\r\nAnother commendable character is definitely Natsume Kyousuke. The writers did an awesome job in portraying Kyousuke, such that halfway through the series, he was made to look like the villain. An extremely terrifying villain at that, being able to control whatever happens in the world, and trying to make Rin do things against her will. However, at the end of the season, we finally see his true intentions. I would say that Kyousuke is somewhat of a fatherly figure to both Riki and Rin. He did his best in order for the both of them to grow and develop, even if he knows he’s hurting them, because as the saying goes, “What doesn’t kill you makes you stronger”. As much as it pains him to see them getting hurt, it is for their own good.\\n\\n\r\nLastly, is of course the entire Little Busters team. They have all done their best till the very end in order to help both Riki and Rin grow, even though they do not benefit from it. I sincerely believe that if all friends in this world were as noble and kind as the Little Busters team, the world would definitely be a better place.\\n\\n\r\nAnimation (9/10):\\n\\n\r\nThe animation for Refrain is amazing. If you have been looking carefully at each scene, you would notice that there are actually very minor details that serve as foreshadowing to the later parts of the story, something that is pretty commendable. An example would be from episode 2; many scenes are white and look cold. This actually signifies Kurugaya’s loneliness, which is seen later on. \\n\\n\r\nSound (9/10):\\n\\n\r\nThe soundtrack of the anime is extremely fitting, complimenting each scene to make it feel more lively or to add to the sadness.\\n\\n\r\nSpecial credits to the insert song, Song for Friends, by Rita. It’s sung with so much emotion, and if you look at the lyrics you’ll feel even sadder for the characters during the scenes it is played.\\n\\n\r\n“Dare no tame ni bokura wa yuku? \\n\r\nDare no tame ni mata mezameru? \\n\r\nDare ga itemo daremo inakutemo koe wo okuru yo”\\n\\n\r\n(For whom do we go on? \\n\r\nFor whom do we awaken again for? \\n\r\nWhether that person exists or not, I call to them)\\n\\n\r\nIt basically captures the essence of the entire Little Busters anime.\\n\\n\r\nEnjoyment and Overall (9/10)\\n\\n\r\nI can say that I thoroughly enjoyed Little Busters Refrain. It was an absolute blast to watch, keeping me on the edge of my seat every episode. Moreover, I finally had the feels that I have craved for so much from season one, from an anime by Key. If you haven’t even picked up the first season of Little Busters, I highly recommend you do so right now, because Refrain is worth every episode and you’ll definitely be craving for more at the end of the series. \\n\\n\r\nIf you would like to check out more of my reviews, you can like my page at www.facebook.com/eisuanime .",
            "date": "2014-01-02T22:04:00+00:00",
            "helpful_count": 40,
            "mal_id": 126921,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2749279.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChargedCoin",
                "username": "ChargedCoin"
            },
            "url": "https://myanimelist.net/reviews.php?id=126921"
        },
        {
            "content": "Once in a while, I find myself craving for good drama with at least a decent story depth and a somewhat intense atmosphere. Apart from the latter, Little Busters ~Refrain~ was not able to deliver.\r\nThere's one thing in particular that is always inherent to KEY anime: borderline drama. In some cases (Clannad, Kanon), this drama plays out well because it feels genuine. In other cases (Angel Beats!, LB ~Refrain~), it is forced upon the viewer with all one's might and consequently feels artificial. While I must admit that Refrain does have its strengths, especially in terms of plot twists and tension, the characters totally failalong the way, which is the primary reason the drama that is being told here sadly mutates into something melodramatic.\\n\\n\r\nWhen there is one thing about the story that I have to point out as a definite success, it is the way the 'secret to the world' is being uncovered step by step in a very consistent pace. With each episode, the viewer gets drawn more and more into the mess with which the LB gang struggles to cope. This is the reason why there is a rather intense atmosphere to be felt that encourages to jump to the next episode and continue watching. Nevertheless, despite the decent idea underlying the story and the well planned-out conclusion, that, what was intended to be its greatest strength - the dramatic climax - turned out to be the most significant disappointment. That is not because of how the story was written, but first and foremost a result of poorly conceptualized main characters.\\n\\n\r\nI really love the drama in Clannad ~After Story~, but even there it becomes apparent how clichéd the (side) characters were designed to be. In Refrain this blatantly swaps over and affects the entire main cast, which is simply not acceptable. The fact that it is possible to summarize the personality of the main characters with one, at most two sentences is something that not only prevents the characters from driving the story forward, but has also a strong negative impact on the perceived credibility of the entire thing. The emotional attachment and the ability to relate to characters is what makes drama dramatic, when the appropriate plot elements are introduced. Refrain leaves it at presenting tearjerking scenes, which are emotional because of their nature and the viewers' cognitive associations, and not because there is genuine drama inherent to the content of the show.\\n\\n\r\nWell, but if someone perceives the emotional impact of an anime - be it artificial or genuine - as its quality, it is basically a good thing, isn't it? Basically yes. The good thing about Refrain is its level of entertainment and the degree to which most people enjoy this series. Only a minority of the viewership actually thinks about whether the drama is rather artificial than genuine. That is why Refrain can without fail be recommended as an anime that has the ability to entertain in various ways. In my rating, however, I give credit to those anime that succeed in thinking things through. Moving someone to tears is simple, building a structure of attachments between the viewer and the characters and killing it off is something that requires method.\\n\\n\r\nUnfortunately, considering that I always loved at least the technical aspect of KEY anime, Refrain, in contrast to previous works, disappointed here as well. A mediocre (beautiful but not noticeably varying) soundtrack, a standard-type ending song, and a slightly more original opening song with some build-up tension don't suffice to warrant a higher rating. Even in terms of visuals, Refrain is sloppy. We live in times of high quality productions, yet Refrain - with its highly emotional content - doesn't make use of the potential that a decent colorization offers to shows like these. Camera angles, transitions, character design, there's nothing that reminds me of the quality of KEY's previous works. Apart from these comparisons, Refrain as a standalone series is definitely enjoyable in terms of arts.\\n\\n\r\nI was looking forward to Refrain, since it ranks among the best anime on MAL, but it yet again turned out to be a tearjerker without substance. Tearjerkers are perceived very differently by the anime audience. Those who actively search for meaningful, authentic drama won't be satisfied by watching Refrain, while those who predominantly value the emotional impact a show (forcefully) produces discover a first-class series. One reason for the great success of Refrain might be the huge improvement since season one. Personally, I really enjoyed watching Refrain because of its atmosphere, but in each and every episode I was reminded of the fact that this cannot in any way be compared to Clannad. It lacks passion and method.\\n\\n\r\nRating: 6.32/10\\n\r\n(A quantified evaluation can be found on my page.)",
            "date": "2015-04-04T15:08:00+00:00",
            "helpful_count": 23,
            "mal_id": 184745,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197998.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nishiyamo",
                "username": "Nishiyamo"
            },
            "url": "https://myanimelist.net/reviews.php?id=184745"
        },
        {
            "content": "\"I'd forgotten\r\n That living \r\n Meant losing\" -Naoe Riki \r\nComing of Age is a really tough genre to pull off, especially in recent anime. You have to establish characters, and as the story progresses, force them to endure certain events and cause them to grow up, whether from a child into an adult or grow as a human being. Little Busters pulls off coming of age as good as I've ever seen an anime do it. And it does it while adding such emotional power to the story that only enhances the impact that the story will leave on you. This is thanks in nosmall part to Key, of whom the original Visual Novel was originally conceived. Key knows how to touch your emotions. And some would say that they've been hit or miss with some of their stuff. But when it comes to Little Busters, which I just finished rewatching, the messages they convey are on par with their best. \\n\\n\r\nMany people dislike the first season of LB (For reasons other than adaptation decay). And I can't really blame them for doing so. When you watch this anime, you'll see season 1, and you might feel a little disappointed. Because to be completely honest, it is exactly what you'd expect from a Key Visual Novel adaptation. Protagonist meets an assortment of girls, and helps them out with their problems, which tend to have a lot of sad moments sprinkled throughout them. It also consists of a lot of moe characters doing moe things. And has a few stand alone episodes that at first, feel like they aren't really important to the overall plot, but in the end, are integral. But don't let that ruin things for you, the first season is vitally important to the success of this show. I for one loved the first season, it had many lovable characters, hilarious comedy, some very good story arcs, and subtle nods to \"something more\" that was yet to come. Season 1 establishes all of its characters, it gets you attached to them. Which will make the emotional jolt the story takes in season 2 much more meaningful to watch. This anime succeeded where the incredibly similar  Angel Beats didn't, in its length. Angel Beats threw at you 15+ characters, and tried to make you get attached to them in just 13 episodes, which, is almost flat out impossible. Little Busters as a whole is 39 episodes. It gives you an immense amount of time to get invested into these people's lives. More comparable to Clannad, season 1 serves as pretty much the 26 episode prequel to let you know who everyone is, what they're like, and attempts to prepare you for the much bigger and better sequel. \\n\\n\r\nWhen season 2 rolls around, it will begin to take a turn. A turn down a path that's quite unlike season 1. It introduces things into the story that you hadn't seen before. Those nods to \"something more\" in season 1 all come to fruition here. All your questions will have answers. Your opinions will change. And, unlike most anime that have come out within the past 4 years,  you will see the growth of a character. This is a Key anime. And as said before, some Key anime are hit or miss. Some of them, like Angel Beats, exist only to make you cry. It's not trying to tell you a good story, nor is it trying to throw out real character depth. It exists solely for the purpose of pulling at your emotions. And if you're like me, that won't work, because you can't become emotionally invested in a story and characters in only 13 episodes devoid of meaningful development. LB isn't just some melodramatic tear fest, forcing you to cry is not Little Busters' one and only objective. This is a show that's going to tell you a story. A story that you can become easily invested in, and if you cry along the way, so be it. Little Busters Refrain takes the Clannad After Story method of establishing characters in a first season, and putting them to the test in the second. Really forcing them to do what they are capable of doing. No longer is our protagonist just a protagonist, he is, in Clannad's case, Tomoya Okazaki, a man who has lost everything, a man who has given up,  but a man who still finds hope, and must fight his hardest to regain the things that he once held dear. Little Busters, has Naoe Riki. A boy who is young, naive, and not ready for the real world, Relying too much on others to do what they think is right rather than what he thinks. Throughout Refrain, he has to grow stronger, not particularly physically, but stronger as a person. Grow into someone who can deal with loss, and overcome hardship. Little Busters conveys the theme of growing up insanely well. Saying that you can't rely on your friends forever. Your going to have to deal with very bad and awful situations, and your friends won't always be there for you. You have to become independent. You have to grow up. \\n\\n\r\nAs I said earlier, I just finished rewatching Little Busters. Now, I've rewatched a lot of anime now, and while Little Busters is one of my all time favorite anime, it is not my absolute favorite. But I can say that it was definitely the most rewarding rewatch I've ever experienced. I never knew just how much season 1 references things that have to do with season 2 that you won't understand until you get there. You're able to more knowingly understand certain character motivations, and some things they say will make a lot more sense knowing the overall outcome. My opinion on the characters was different the second time around, and it made for an incomparable rewatch  experience. Originally, I had thought that I just loved LB, not that it was a great show by any means, but upon seeing it a second time, I can objectively say that it's one of the best anime I've ever seen to date, season 2 specifically. It is something that will grip you, attach to you, and emotionally drain you. Something I feel takes what both Anohana and Angel Beats did, and does it 10x better. With a coming of age story that will surely blow you away from start to finish, it's something that I'll wholeheartedly recommend to anyone and everyone who either wants a great story with great characters and character development, or if you just wanna sit back and cry a whole days worth of tears. \\n\\n\r\nLittle Busters ~Refrain~ is a masterpiece among modern day coming of age anime. \\n\\n\r\nThank you for reading.",
            "date": "2015-08-16T19:20:00+00:00",
            "helpful_count": 18,
            "mal_id": 196345,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3373331.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ZachM",
                "username": "ZachM"
            },
            "url": "https://myanimelist.net/reviews.php?id=196345"
        },
        {
            "content": "My first review so bear with me.\r\nLittle Busters! Another anime adaptation done by none other than Key Visual Arts. This anime pretty much revolves around a group of friends looking to carry on their youth and try to make the most out of it with the amount of time they have left in High School. Refrain! As most would know is the sequel which leads more into the main arc of the overall story. I HIGHLY suggest you watch the first season before watching this because it may cause some confusion. Now here is where I get into the actually review.\r\nStory 10/10:\r\nAssuming you haven't watchedthe first season (which isn't necessarily required) the story may start out a bit vague. For obvious reasons the first season solely focuses on character development and things of that nature so immediately starting off at refrain would obviously cause some confusion. Now if you are looking for an anime with a really heartfelt and very touching story then this is the anime for you. Watching up till now it gave me that same feel Clannad and Angel Beats! gave me. It was able to touch my heart and give me \"dem feels.\" Originally I would have rated the story a 9 The reasons for that was because at certain parts in the story it was slightly predictable. Take notice I have not had any experience with the Visual Novel what so ever so I was unfamiliar with the story to begin with, but as I mentioned the story was predictable and I felt I was writing the story on the spot as I was watching it. What made me decide whether to give this story a 10 or not was the plot twist near the ending. Which is something I should be accustomed to by now considering a lot of this happens in other Key stories. \\n\\n\\n\\n\\n\r\nArt 9/10: The art is great. It is well done and very bright and contrast. They did a great job with the mood of the scenes as well as showing emotion in the scene. Not much to say on the art but it is definitely top notch and a huge improvement from the first season. But there are some scenes where it seems either rushed or just badly animated but they make up for that with the story.\\n\\n\\n\\n\r\nSound 10/10: The audio is amazing. This is definitely what drove my emotions up and down while watching this anime. The music was used correctly in every scene and I think overall they were just beautiful and perfect.  Just like their other anime adaptations the music in this was phenomenal I will more than likely be getting the sound track as it has been one of the most beautiful music written since Angel Beats! and Clannad!\\n\\n\\n\r\nCharacter 10/10: The Characters at first seem very simple especially in the first season but in Refrain! They live up to \"Key standard\" with very intense backgrounds and how they came to be the way they are. I would rate it a 9 because some of the background stories for the characters seem to be rushed or cut short but I was able to piece things together realizing how deep the characters actually are and how far they have as well as the obstacles they have overcome. Masato's obstacle was incredibly touching yet simple, which is something I really like to see in Key's stories. \\n\\n\\n\\n\r\nEnjoyment 10/10: Overall I love slice of life anime especially the ones produced by Key. Key is the only company that has impressed me with every single story they have produced because despite them all being slightly similar in one way or another they all have their own thing that makes them tick to get my attention. I give it a 10 because I have enjoyed this so much I will watch this again in the near future just as I did with Clannad and AngelBeats! I also plan to re-watch Kanon(2006) as well as Air!\\n\\n\\n\r\nOverall 10/10: Despite the story being slightly jumbled and confusing I feel you shall enjoy this. I mentioned similarities between the other stories Key has produced. I didn't mean to compare and for you to expect the same thing. But If you enjoyed Key's other stories than you will more than likely enjoy this one. This is an anime that you have to watch just expecting a great story. \\n\\n\\n\r\nThank you for reading my review. Like I mentioned this is my first review and it is currently 4:46 AM so if any sentences that I have written sound weird just know that I was up really late writing this. Thanks again and I do recommend you watch this anime because it is now among my list of all time favorites. :)",
            "date": "2013-12-28T06:48:00+00:00",
            "helpful_count": 16,
            "mal_id": 125993,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1483261.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shian96",
                "username": "Shian96"
            },
            "url": "https://myanimelist.net/reviews.php?id=125993"
        },
        {
            "content": "Drama\r\nA lot of good series out there depict an emotion-filled story where the romance comes secondary, if at all. Strong depictions of friendship and in challenging situations can really draw a viewer into the story and start making them sympathize with the characters. It’s a bit of an all-encompassing genre, but only a handful of series really pull viewers in with their screenplay.\r\nIt took a while to build. Little Busters! started out slow, and after the first few episodes some people were condemning J.C.Staff for ruining the latest Key adaptation. many of the fans dropped it but I hold on to it. It built slowbecause the fast punch isn’t nearly so devastating as the freight train slamming into your soul. By the time Refrain rolled around it had built up a head of steam, and when all the emotions finally came crashing down, I wept. I wept unabashedly for two whole episodes, so potent was the drama unfolding on the screen. There were many great dramas this year, with Uchouten Kazoku almost winning for a similarly slow build up and an emotional gut punch on Episode 8, but only one show pulled us in so deeply only to rip our hearts out with friendship and love. It made every minute that proceeded it worth it many times over.\\n\\n\r\nMystery\\n\r\nWho doesn’t love a good mystery? Thought-provoking storylines that keep inquisitive viewers watching and speculating on where things are headed? Yes, please. They don’t necessarily have to have a horror element to them.\\n\\n\r\nLike last year, 2013 didn’t provide much in terms of mysteries. That didn’t mean that there weren’t good additions to the genre however, and one mystery ended up particularly good. By that, we mean the “Secret of the World.” Set up in its original run and finally culminating in this past season’s Little Busters! ~Refrain~, this was a mystery that hung around for over two dozen episodes, occasionally disappearing and reappearing when we least expected it. It taunted us with red herrings and subtle hints, giving viewers the general feeling that something wasn’t quite right while holding the actual secret until the very end. And what a secret it was. No matter what you thought about the original series, the fact is that Refrain was a spectacular piece of storytelling, and its mystery elements were a big reason why. This was a mystery whose revelation sucker punched you when you least expected it, turned the entire series upside down, and was something whose emotional impact made it an easy winner for this category in my list.",
            "date": "2014-11-02T00:52:00+00:00",
            "helpful_count": 13,
            "mal_id": 167117,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4054861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Raghnaq",
                "username": "Raghnaq"
            },
            "url": "https://myanimelist.net/reviews.php?id=167117"
        },
        {
            "content": "Now that I watched the last episode, I can finally write a review for this anime, I can go on and on about this and list 675  reasons why you should watch it, but I am just going to keep it simple so that people who aren't sure about it, can at least consider it.\r\nLittle Busters!: Refrain is a continuation for the first season, where in that they just focused on introducing the characters best way possible. But Refrain is where things start to get really interesting, the main story will start to unfold, and many plot twists and shocking moments will occur thatwill pull you in.\\n\\n\r\nStory: 10/10\\n\r\nNothing shocked me as much as when the true story of little busters! started to unfold. The story just hits you on the head without you even knowing, you start noticing things that you didn't notice before because you didn't know what is going on, episode by episode questions start to build up in your mind, and by the final episodes all of them are answered and you just sit there dumbfounded by the awesomeness (while crying of course).\\n\\n\r\nArt: 9/10\\n\r\nEven though I never really had an issue with the first season's art. I will admit that it is more improved here, the characters look better and the animation as well... And that's about it, if you're watching an anime just for the \"art style\" and going to judge it based on that, then you're watching it for the wrong reasons. (Of course art is an important reason, but it isn't EVERYTHING.)\\n\\n\r\nSound: 10/10\\n\r\nI don't think I have much to say here, just listening to it's soundtracks, you will know how amazing they are. Every song fits perfectly, and without these strong and emotional soundtracks the scenes wouldn't have left an impact as they did. \\n\\n\r\nCharacters 10/10\\n\r\nLittle busters!: Refrain offers such strong characters, and all of them are different from the ones you already saw in season one, because in Refrain, they show their true selves and you will be surprised by how different they are. And not to forget the emotions each character shows, it's as if the characters are real.. you can feel the pain they are going through. Your thoughts on the main characters before will surely change for the best. \\n\\n\r\nOverall 10/10\\n\r\nI enjoyed every episode of Little Busters!, I thought it was an amazing anime and I think everyone should at least give it a try, and watch it until the end before judging. People shouldn't compare this to the visual novel, or even other titles. This should be looked at as an individual, and should be judged based on that. \\n\\n",
            "date": "2013-12-28T12:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 126041,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1131715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cosmic09Moon",
                "username": "Cosmic09Moon"
            },
            "url": "https://myanimelist.net/reviews.php?id=126041"
        },
        {
            "content": "I thought this was going to be \"another season, another crappy drama\" kind of show but my god was I wrong. This, folks, is an example of a sequel that is a lot better than the original. I'm not a VN reader so I'm reviewing this as an anime-only viewer.\r\n(There will be some SPOILERS in my review)\r\n[Story]: (9/10) (SPOILERS)\r\nThe story continues from the season as Rikki now successfully recruited enough members for the Little Busters and won their first game. \r\nCompared to the 1st season's story, the story told in the 2nd season is a lot better. Just by watching the first episodes, you'll thinkthat they haven't learned their mistakes and are doing the same mistake but nope. After the 1st episode ends, the show starts to get serious and you'll know that this isn't going to be the same as the first season. \\n\\n\r\nThe show focuses on 4 main arcs. The first arc is Yuiko's arc, the second is Rin's arc, the 3rd is focused on Riki and the original Little Busters (without the girls), and finally the final arc, where the show answers everything that happened in the first season, the early second season and the things going on in their \"world\". I am not going to summarize the arcs. \\n\r\nAnyways,  Let's focus on the first arc. This arc primarily focused on Yuiko and Rikki. The first season didn't focus that much on Yuiko so I'm glad they did it here so they can give her a character development.  This arc maybe focused on Yuiko but if you take a closer look, this arc is preparing you for what is about to happen at the later episodes. The big hint that this arc gave away is the \"time loop\" and it also foreshadowed some events that is about to happen. \\n\r\nNow the 2nd arc which is focused on Rikki and Rin's relationship and the \"secrets of this world\". This might not be the best arc but it's still a great arc. They have now received the final mysterious and they must solve it and the writer of the messages will reveal the \"secrets of the world\". At first, I thought this \"secrets of the world\" crap is just a filler but it's not. The \"secrets of the world\" is a plot point that makes the whole story of the second season. The arc also focuses on Rin and Rikki's relationship. In my opinion, them being a couple felt a little bit forced and it was predictable because Rin and Rikki have been spending a lot of time together. \\n\r\nNow the 3rd arc which is focused on Rikki and the Little Busters. When I first watched this arc, I was very confused. I was asking myself \"What happened after the police took Rikki away from Rin?\" and \"What is this, a flashback episode?\". I just ignored those questions and proceeded to go forward. Apparently, Rikki is now recruiting members for the Little Busters while Kyosuke is in his dorm, depressed and reading mangas, because Little Busters is now broken up.\\n\r\nNow the 4th and final arc, where every single plot hole gets filled, everything is explained and how this arc stabbed me right through my heart. I just want to get this out of the way, this arc made me cried and I rarely cry when I watch TV shows. Especially when they showed the bus accident scene.\\n\r\nAll of the character's actions in season 1 started to make sense, all those forced dramatic character arcs, why Kyosuke wants Rin and Rikki to become stronger, the time loop that Rikki experienced on the 20th on June, and the \"secrets of the world\" also started to make sense. I also felt sad and depressed when Kyosuke revealed why he's doing what he's doing. I'm just going to ignore the fact that Kyosuke can repeat time and create a fake world without a scientific explanation. \\n\r\nNow my opinions on the story. It's great. It shows how Kyosuke is doing everything just so when they go back to the real world, they become stronger. The dramatic scenes and emotional moments are not forced this time so the drama was thought out and not something the director just came up with. There are a few flaws and one of those is the story pacing. Characters arc are still rushed but they're not as rushed as the first season. \\n\r\nNow my opinions on the ending. Thank the Lord that they did not die. I don't want the show killing off all my favorite characters.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Art/Animation]: (9/10)\\n\r\nThe Animation is a lot better than the first season but there are still a few flaws. Details are still somewhat lacking and the character design is a bit better than the first season. Their hair are also somewhat better but I don't know if this is just me. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Sound]: (9/10)\\n\r\nI didn't really like the soundtrack in the first season but the soundtrack in this season is a major improvement. The OP theme song fit so well in this dramatic show. At first, it sounded bland and boring but later on, I understood why. The OP also got more and more depressing as the show goes on. The ED theme songs are also better than the previous ED. I only liked the 1st, 3rd and 5th ED theme song but I didn't really like the 2nd one but this is my opinion.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Characters]: (9/10) (SPOILERS)\\n\r\nIn the first season, I loved all the characters except Riki because of how he's able to go around and solve the girl's problem without him having any problems. However, in this season. It showed that Kyosuke was resetting time everytime Rikki gives up on one of the girl's problem so it pretty much shows that Rikki is not a perfect main protagonist. What was shown in the 1st season is Rikki successfully solving that girl's problem and they didn't show his failed attempts. It also shows that he becomes stronger everytime Kyosuke resets the time.  Because of that, I now like Rikki. \\n\r\nThe whole season pretty much gave Rikki and Rin a major character development. Showing their flashbacks, their struggles, etc. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Enjoyment]: (10/10)\\n\r\nEasily a perfect score from me. I wasn't expecting to cry this much when I started watching Refrain because the 1st season was just forced dramatic moments so it didn't really make my cry. I don't think I'll see anymore anime that can make me depressed. (Besides Clannad)\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[OVERALL]: (9.2/10)\\n\r\nIf you're holding back on this anime because you didn't like the 1st season that much then you'll regret it. This season is a lot better and the emotional moments can really hit you so hard. This is one of the best drama anime I have ever seen. The last 4 episodes made me depressed as hell and cried my eyes out. I shouldn't have watch the last 4 episodes all in one go.\\n\\n\\n\r\nPros:\\n\r\n+Great Story\\n\r\n+Great Animation\\n\r\n+Improved Soundtrack\\n\r\n+Emotional and Dramatic moments are successfully executed\\n\r\n+Happy Ending\\n\r\n+Great Characters\\n\r\n+Heavy Character Development on Rin, Rikki, Kyosuke, Masato, and Kengo\\n\\n\r\nCons:\\n\r\n-Story Pacing is still a bit rushed\\n",
            "date": "2015-08-10T15:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 195755,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=195755"
        },
        {
            "content": "This Review For Little Busters and Little Buster! Refrain\r\nWhen I look at this like the early story of friendship which is housed in a comfortable school.\r\nevery character undergoes each for its development in the first season of the series little busters this.\r\nthe most I like this anime was the development of characters ending with ending the coolest!!\r\nuntil I can not say much ...\r\nsorry for bad english :p\r\nOverall 10/10",
            "date": "2015-04-03T10:03:00+00:00",
            "helpful_count": 9,
            "mal_id": 184600,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3203475.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kawaishou",
                "username": "kawaishou"
            },
            "url": "https://myanimelist.net/reviews.php?id=184600"
        },
        {
            "content": "As soon as I saw the first season of Little Busters! end announcing a second season, I couldn't help but think that it would be similar to Clannad After Story (I'm assuming almost everyone planning on watching Little Busters has already seen Clannad in this review but I won't spoil anything from it). Having not played the visual novel and only knowing how other Key anime have done so far, I knew Refrain would bring tons of drama that the first season only a small amount of. Since Little Busters! is basically the friendship version of the family-focused Clannad, it's easy to imagine that Refrainwould follow in it's footsteps of being much better (to me) than it's prequel. And Refrain did just that.\\n\\n\r\nRefrain is a bit of an odd sequel as far as sequels go. For most shows, it is a requirement that you watch the first season for whatever reason before moving on to the second. I would only recommend watching the first season of Little Busters in order to get acquainted with the characters a little better, but otherwise (since almost nothing happens in the story overall aside from the original group of five members doubling in size) you could just skip it and go right to Refrain. The characters acquired in the Little Busters group during the first season become minor characters and the focus shifts to the original quintet who had less development during the first season.\\n\\n\r\nSo what makes Refrain so much better than the first season? Everything. A moving, dramatic plot; plenty of character development for the main characters; an improved soundtrack and better animation. And, of course, it's much more enjoyable.\\n\\n\r\nThe story of Refrain begins not long after the Little Busters! baseball team won their first (and only) game. The show moves away from baseball now and starts focusing specifically on Riki and Rin. But the first arc of the story focuses on Kurugaya, the mature genius girl who was the only one of the new recruits who didn't get an arc in the first season. This arc leads the way into the real story similar to how Clannad After Story's first few arcs did.\\n\\n\r\nThe story of Refrain is the biggest improvement from the first season. Rather than just the typical \"go around and help all the girls solve their problems\" plot which you can find in basically every harem anime ever, the story focuses only on Rin and not the other girls. Rin has always been shy and slower to grow attached to the other characters than everyone else, however her shyness starts to become an even bigger problem and neither her older brother Kyousuke nor Riki seem to be able to solve it completely. To make matters more difficult, Kyousuke and Riki are both going about trying to help her in different ways.\\n\\n\r\nAside from Kurugaya during her arc, the only important characters for the most part are Riki, Rin, Kyousuke, Masato, and Kengo. Along with many flashbacks to their childhoods, the show also develops them incredibly well in the present time. This was one of the main problems I had with the first season. With all the attention given to the other girls who were joining the Little Busters, the original five had very little development. Even Riki did not have very much development despite being the main character. Refrain does a great job of giving enough screen-time to each of the five and building their characters separately and developing the group as a whole. The only real problem with the characters is that they start off so weak that it takes a while before their development makes them really likable. The group of minor characters now gets even less development than the main quintet did in the first season and are only really important for their impact on the main characters.\\n\\n\r\nRefrain's soundtrack uses many of the same songs from the first season, but it focuses much more on the dramatic tracks and (with the decreased amount of comedic scenes) has much less of the forgettable, lighthearted music that was used plentifully throughout the first season. The OP theme also changes to fit the mood whereas the OP and ED from the first season were much more upbeat and cheerful (that's not to say I didn't love the ones from the first season, and it was very nice to hear the first OP return once).\\n\\n\r\nThe animation improves just like everything else, though not quite as much. The animation of the first season, though it had spots where the quality fell, was good. The quality of this season's animation was improved in part due to the story requiring it to be much better. The scenery moves away from almost primarily the high school setting and incorporates many other places as well as some more surreal moments. The character designs (though the majority of the colorful hairstyles disappeared with the minor characters) improved as well. The actions of the characters are detailed much better than before and the dramatic mood the animation sets is astounding. There were still some problems especially early on where the animation was more similar to how it was in the first season, but for the most part it improved very well.\\n\\n\r\nBut as much as I've been saying positive things about Little Busters, it still only gets an 8/10 overall. So where does the anime have problems? Going back to the how it's similar to Clannad After Story, Refrain has problems in both the beginning and end mainly in the story, but also with the characters in the beginning. With the beginning being similar to the first season, the story then is more of a setup for the real story which begins about a third of the way through the season. As for the ending... well it's a Key anime and what Key anime doesn't suffer from it's ending a little? The strongest part of Refrain is the middle once the anime begins to shed some light on the real story and what is actually happening. All I'll say about it is that it really is one of Key's best works.\\n\\n\r\nStory -- 8/10\\n\r\nAnimation -- 8/10\\n\r\nSoundtrack -- 9/10\\n\r\nCharacter -- 8/10\\n\r\nEnjoyment -- 9/10\\n\\n\r\nIf you've watched and enjoyed any of Key's other anime (especially Clannad), then I highly recommend you watch Refrain. If you want to build up more of a connection to the characters, then also watch the first season. If you know that the end of Refrain will probably not make you cry no matter how much of a connection you have to the characters, then you could probably just skip to this season. Refrain is (in my opinion at least) Key's second best anime adaptation (second only to After Story). It is a vast improvement over the first season in every way and I believe it is something you should not miss if you enjoy high school romance and/or slice of life anime.",
            "date": "2013-12-28T12:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 126037,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=126037"
        },
        {
            "content": "I don't usually review sequel series' for shows, but Little Busters will be an exception.\r\nAfter being completely blown away by the original series (10/10) mostly due to the amazing character development - despite its predictability, i loved it.\r\nThen i completed Refrain.\r\nCompletely different ball park\r\nIt was EVERYTHING and more that i wanted it to be.\r\nThe best phrase to describe this masterful sequel would be \"Edge of my seat\", and it does this seamlessly, not through cheap action scenes. Instead, throughout these 13  episodes, doors are constantly being nudged, you lean forward - hoping to find out more, but it wasn't even a door in thefirst place. I guess what i'm trying to get at here is the utterly different frame of mind that the show induces so differently to the original, it completely overwhelmed me...\\n\\n\r\nTHIS THING HAS MORE TWISTS AND TURNS THAN THE BIGGEST (Emotional) ROLLOCOASTER IN THE WORLD.\\n\\n\r\nand if you've completed Little Busters (original), you would be a FOOL not to look into refrain, i can't put it into words well at the moment but EVERYTHING becomes truly explained, you have no idea what's in store for you...\\n\\n\r\nYet i do :-)\\n\r\nAnd i can honestly say that it is the most outstanding series of TV I've ever seen. When it comes to media, i'm not a cry-er - it just doesn't happen, yet this show pushed me to the limit, that's how immersive it is. But no, it's far from one dimensional, after all, i didn't tell you what emotions i felt so strongly.\\n\\n\r\nIt may seem like a Cliche, but those cliffhangers and the revelations in the show will make you want to watch through it all as soon as possible. If you do decide to go binge watching though, i advise you check the floor for a safe landing zone: as you'll be on the edge of your seat!\\n\\n\r\n-----\\n\\n\r\n10's across all boards, though the original series was 90% character based, now you have a wonderful STORY to cherish! ^.^",
            "date": "2014-11-04T17:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 167449,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=167449"
        },
        {
            "content": "\"Wait, let me cry just a little longer.\"\r\nI don't think any quote from this series can really sum up the emotional energy it carries. Forget the overdrawn melodrama of the first season flicking you on the nose; Little Busters!: Refrain is here to punch you in the face.\r\nEverything about Little Busters! has been revamped and improved for Refrain. The story is tighter, more focused, and more emotional. Since this season is only half as long as the last and only focuses on one main story arc, events move along with a much better rhythm and flow.\r\nThe art, while still pretty bland and uninteresting, has beenmade crisper and clearer, and the animation has been made smoother and more natural. However, there are some moments of great imagery that elevate the show's visuals.\\n\\n\r\n The music is much the same: the piano melody from the last season is carried over and used repeatedly, but the tune is used to great effect, representing nostalgia, melancholy, loss, regret, relief, and happiness. The opening and closing themes, especially the former, are perfectly suited to the tone of the show.\\n\\n\r\nThe characterization of this season is executed much more naturally than the last. Gone are the cumbersome multi-episode character arcs, replaced instead with slower paced reveals and moments of growth that feel much heartier and effective. Refrain focuses much more on the core Little Busters (Riki, Rin, Kyousuke, Masato, and Kengo). That's not to say that the other characters do not play a role in the story, their role is just not as pronounced. You will care about these characters. You will cry for these characters.\\n\\n\r\nRefrain is much more enjoyable than the previous season. The story is paced much better, the arcs are more focused, the emotions are more intense, and the visuals are crisper. Everything is better.\\n\\n\r\nLittle Busters!: Refrain is unreasonably good. It's the only anime I've cried at, and I never expected to do so after finishing the mediocre first season. Refrain is worth the time spent slogging through the original Little Busters ten times over.",
            "date": "2015-07-22T15:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 194082,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4521039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gregdubin",
                "username": "gregdubin"
            },
            "url": "https://myanimelist.net/reviews.php?id=194082"
        },
        {
            "content": "Little Busters! ~Refrain~, the sequel of Little Busters!. This anime was adapted from Little Busters! VN Refrain route. Maybe some of you will compare this anime with Clannad. In my opinion, we can't compare these two anime because they have different genre and different main story. It will be great if we compare this anime with Angel Beats! because both of them have a same genre. That's my preface of reviewing this anime :)\r\nOkay, i'll start my review of this anime.\r\nStory:\r\nThe story was based from LB! VN. The anime producer of LB! Refrain, J.C. Staff, is doing good enough to represent the story. The firststory is about Kurugaya's route. It has a little different story from the VN because J.C. Staff made Kurugaya's route become the intermediary to Rin's route. It is nice because when you play the VN, Kurugaya's route and Rin's route are separate and can't be connected. I have a little disappointed in Kurugaya's route because it can made me cry but J.C. Staff didn't made a little dramatical as sad as AB!.\\n\\n\r\nIn Rin's route, the story is really good. The story is about Riki and Rin who will \"going out\". This story also continuing the mission about \"The Secret of The World\". One part what made me confuse is when Mio, Kud, and Haruka are going out and didn't say goodbye. I think they will going back to the dorm. But if you're the VN reader, you have know that three of them are disappeared.\\n\\n\r\nAfter Rin's route finish, you will watch the real Refrain's route. The story is same as VN. J.C. Staff only cut the part when Riki is going to hospital. That's a disappoint. In a good news, J.C. Staff made a nice farewell of Riki and Rin with Masato, Kengo, and Kyousuke, who made a dramatical farewell.\\n\\n\r\nArt:\\n\r\nLittle Busters! Refrain isn't the best of the art but it is better than Little Busters!. J.C. Staff improved the quality of the art and it reminded me to Angel Beats art.\\n\\n\r\nSound:\\n\r\nThere's no doubt about Key's music. For the OP, ED, and some of BGM, i think it's not Key's work. Boy's be Smile, the main OP of LB! Refrain, is deccent and nice to hear it. the lyric is describe what will happen in LB! Refrain. Kimi to no Nakushi Mono, the main ED of LB! Refrain is deccent, too. It's like Clannad AS, who has melancholy music in OP and fun music in ED. For BGM, is good but there are some mistaken place of BGM and the moment.\\n\\n\r\nCharacter:\\n\r\nYou need to watch Little Busters! first if you want to know the detail of LB! Refrain character. Some character also missing like Futaki Kanata, A-chan, and Sasasegawa Sasami, who will play in LB! EX. Overall is good.\\n\\n\r\nEnjoyment:\\n\r\nLB! Refrain is enjoyment because the story has one goal and have the storyline is forward. Not really lack and it brings a moral value for us.\\n\\n\r\nOverall:\\n\r\nLB! Refrain has a potential to make you cry. But there are some missing. And i really appreciate for J.C. Staff because they has improved the quality of the art rather than the prequel, but they also cut of the great moment in LB! VN. In Little Busters! Refrain, you can find the moral value.\\n\\n\r\nThis is my review. I hope my review is useful for you.",
            "date": "2015-01-27T12:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 179068,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776581.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IrohaUtsugi",
                "username": "IrohaUtsugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179068"
        },
        {
            "content": "*No Refrain spoliers*Now i played the VN and little busters changed the way i lived entirely and has always had a place in my heart and the anime is now exception\r\nStory:10/10 Now unlike in the first season of little busters.Refrain is changed in NO way from the VN the only thing missing are the alternate endings to refrain which if you LOVED little busters and refrain i recommend you pick up the vn on steam (not released as of this time if you are reading this at a later date check)however one thing i noticed is that key might have noticed that refrain in itselfwas to short to make it into a anime by itself so they included Kurugaya's and Rin's (part 2) Route into refrain to make it long (refrain if it was by itself would only be like 5 episodes of content) and the problem i have with this is how again they kinda changed Kurugaya's route to match the story layout of the anime but besides that thats the only problem i have with the story of refrain.\\n\\n\r\nArt:10/10 The art hasn't changed from the first season but the scenes are amazingly beautiful and breath taking.\\n\\n\r\nSound:10/10 If you've played the VN or seen the first season(which i hope you have cuz theres season one spoilers in this review)the music is just appealing to the ears and i still listen to the soundtrack of the VN and the anime from when i first saw the anime and read the VN in 2013.\\n\\n\r\nCharacter:10/10 Now without spoiling anything Refrain just ties everything together bout the characters there friendship,hardships and worries all come together in refrain.\\n\\n\r\nEnjoyment:10/10 Well i just finished watching Refrain and i have a shotgun blast size hole in my heart and my face is full of tears...........i f**king love little busters.\\n\\n\r\nOverall:Why are you still reading this if you've seen the first season GO WATCH REFRAIN LEAVE and if you seen refrain you are welcome for cookies and milk and a box of tissues all provided by the great Saigusa-san..........I'm sorry but seriously its worth a watch if you've read the VN and enjoyed the first season.\\n\r\nThanks for reading!! Also RIN X RIKI FOREVER X333333... Ok ill see my self out now.",
            "date": "2016-04-19T18:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 216716,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4472009.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Salmo69",
                "username": "Salmo69"
            },
            "url": "https://myanimelist.net/reviews.php?id=216716"
        },
        {
            "content": "Little Busters! has been quite a ride. From the first season when Kyousuke invites us to partake in his missions, to the second season where we are disillusioned alongside Riki & Rin, and made to face a harsh reality. Refrain! brings an emotional end to this journey as a sequel that teaches a lesson. \r\nThe story of Refrain! is a sequel to the first season, Little Busters!, where Riki and Rin embark on a path as they become disillusioned by the truth of the world they live in. Continuing their pursuit in discovering the \"Secret of the World,\" they are met with revelations of tragedythat they must overcome. It is a story that has been given a dose of the traditional KEY, a visual arts studio, supernatural elements to it. These elements are blended into such themes as \"growing up,\" and \"becoming stronger,\" among other motifs, that seem to centralize on the idea of adolescence. In essence, this is a story of friendship of the main Little Busters gang, as well as Riki and Rin's maturity and how they must bear leaving their childhood behind. In the bulk of Refrain!, the focus of the story is narrowed down to five main characters- Riki, Rin, Masato, Kengo, and Kyousuke. Each character whose actions and rationalizations are symbolically linked to how people tend to face the concept of adolescence. Riki and Rin are the two who go through this process of growing up. They are challenged by Kyousuke and Kengo who exemplify different approaches to adolescence, while Masato acts as the neutral man between the polar ends. In detail, Kyousuke represents the parents who want their children to develop their strength and become independent enough to face reality. Kengo represents the parents who want to shelter their children and protect their innocence from reality. \\n\\n\r\nWhat really made me fall in love with Little Busters was the character interactions as well as their inner thoughts. I believe this is where the Little Busters excel the most at. A noticeable improvement from the first season is the better animation and focus on each character's emotions and their reactions. To name a few- Kengo and Kyousuke's altercation, and Kurugaya's out of character rage were conveyed and executed so well that it sent shivers down my spine when I heard their outbursts. Another instance of great execution is during the Little Busters' final baseball game where Kengo and Kyousuke break character from their usual stoic demeanor as they burst in to tears. That and the animation that accompanied their breakdown also brought me to tears as they, and the audience, take the full brunt of emotions over the realization of their departure. I also must credit Kyousuke's episode which is dedicated to his monologue; Kyousuke's trembling voice and tonal shifts along with his reaction to his own reflection was stunning to me. While not up to par, to me it was reminiscent to Kyon's self-questioning monologue in Disappearance of Suzumiya Haruhi.  All of this is to be attributed to the spectacular work of the voice actors and the ability to animate what were originally still images(CGs) from the visual novel. However, not all scenes were done well and to say the characters were done perfectly would be a lie. There were several scenes that appeared as if their emotions were out of place if not forced. And while such scenes may have been the result of pacing issues, it is unfortunate to see characterization suffer as a result of pacing a one cour. That said, despite some parts being rushed, the characters were incredibly well done.\\n\\n\r\nOne thing that really stands out about Key works is Jun Maeda. His music seems to strike all the right chords during the right moments in these adaptations. This wouldn't be possible however, without Rita. The two worked together on the music for the VN, and while bringing it over to an adaptation still conveyed the right emotions during the animated scenes. While the music was fantastic, the sound department was lacking. I'll be a bit nitpicky here but sound does encompass background noise. Little nuances like having the sound of thunder/lightning/firework come at the same time as the light is simply lazy editing that could have been avoided. This, as well as certain sound inconsistencies aren't too noticeable, but nonetheless makes the overall adaptation seem lazy.\\n\\n\r\nLittle Busters: Refrain! has set the bar of expectations high for its adaptation due to the loyalty of the fanbase towards the Visual Novel. As a result, people who are only interested in the anime are given this illusion that the adaptation will grant the same feelings and emotions that were evoked from the VN. While the effect is different for every person, keep in mind that one shouldn't compare works made with a different medium. This is the trap that visual novel readers tend to create for adaptations, and the same applies to adaptations of light novels and mangas. So take Little Busters! Refrain as its own story, it was well done and conveyed what it wanted despite small inconsistencies here and there. \\n\\n\r\n8.5/10",
            "date": "2013-12-29T03:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 126133,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2799905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jammin_Rabbit",
                "username": "Jammin_Rabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=126133"
        },
        {
            "content": "Usually I do reviews following more technical matters but in the case of Little Busters!: Refrain  I feel it's more important to talk about it's impact and it makes you feel. All in all Refrain is a great sequel that tied all the unknowns of its prequel in an outstanding way. However just like its prequel, the concept is splendid but suffers from some execution mistakes. There are behaviors you can't understand and things that seem to short due to lack of depth in the arcs. However all of this is forgivable if you consider the way it strikes your senses. With its moreserious vibe, Refrain is a powerful tearjerker.\\n\\n\r\nNow let me tell you the feelings this series provoked on me. \\n\\n\r\nTo me little busters is about friendship something that we seriously lack in Anime. Friendship is always a side to romance, girls always fight for a guy and guys can never have 'bromance' without it being depicted in a humorous ways. Little Busters! breaks all of those being about just a group of friends spending their days having fun and solving their problems to become stronger. Due to this, all characters grow together and so do you. It's truly refreshing to see a series like this which comedy doesn't rely on outrageous situations or sex appeal (in most cases) but to the crazy interactions between characters. I guess it kind of remind me of my school days, when i also used to do idiotic things and care way too much about transient matters. I relate to their group and recall the days that i used to be like that. What and idiot i was but what a fun i had!\\n\\n\r\nAnd then through unexpected twists the series gets serious. I don't want to spoil anything but seeing this group of characters go through hard situations you can't help but to relate and feel sad. It made me want to just call my friends and tell them i miss them.\\n\\n\r\nTo me Little Busters! is a reminder of our youth, how great it is and how short and fragile it can be.",
            "date": "2014-07-11T18:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 151589,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302249.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jchang",
                "username": "jchang"
            },
            "url": "https://myanimelist.net/reviews.php?id=151589"
        },
        {
            "content": "Our past shapes who we are. \r\nReally. It’s that simple. And this is what LB Refrain is all about.\r\nAfter watching the first season of LB, I was seriously looking forward to the second season of LB. In the first season, you had a series of arcs that centered around nearly all of the LB’s new additions. These arcs – even though they used supernatural/surreal plot elements that were presented in a very Key-/visual-novel typical fashion – did flow surprisingly well as they were all built around the same common themes: friendship and identity. Sure, not too much character development for the original five members ofLB (although there was some for the new additions, but definitely not fully flushed out – after their arc was over they didn’t change much anymore), but the plot was definitely solid. \\n\\n\r\nBut damn, the second season – talk about wasted potential.\\n\\n\r\nThe second season is the complete opposite: strong character development, but a super weak, unsubstantiated (haha get it because my username) plot.\\n\\n\r\nThe second season was arguably more moving and emotionally stirring than the first season, but to achieve this, it introduces a series of plot elements that are (1) poorly transitioned, (2) out of the blue, and (3) very deus ex machina. Sure, the same themes that were present in the first season are also here in the second season, but the plot (despite being built around these themes) is executed much, much worse than the first season. Kyousuke’s “powers”, for one, came out of nowhere. There were no hints during the first season that alluded to what Kyousuke could do. In the first season, Riki and Rin were only given “clues” and Riki knew something was up with Kyousuke, but we, as the viewers, are not given sufficient clues to Kyousuke’s true powers until halfway through the second season.\\n\\n\r\nAnother example of poor transitioning is towards the last three episodes when Riki and Rin “switch” worlds. If you’re just another average anime watcher like me, these last three episodes were pretty hard to follow. When you think Riki and Rin finally left the “fake” world into the “real” one, somehow, just somehow, one of them is able to transition back into the “fake” world to search for some lost clues. This transitioning was not only hard to follow, but personally I thought the “fake” world disappeared because of Kyousuke’s lack of control over his powers – so how are they able to go back into the “fake” world? Again, there are some plot elements like these are not fully explained and thus left me extremely confused.\\n\\n\r\nAlthough Kyousuke’s little monologue towards the end of Refrain does string together these weird supernatural/surreal plot elements together, by this point in the series the damage is already done. Everything seems too coincidental, too artificial, and too forced for anything to seem even remotely coherent.\\n\\n\r\nOne more downside: the new, supporting members of LB play a significantly less role during the second season. They were pretty much the entire basis of the plot throughout the first season (since the friendship theme was only primarily explored through their presence); in the second season, they simply fall out of the picture. If they were better incorporated into the second season I feel like Refrain could have been even more impressive.\\n\\n\r\nThe plus side: very strong character development that is blatantly and obviously pointed out by Kyousuke. Throughout Riki and Rin’s arc, Riki and Rin grow, mature, and do what even Kyousuke thought was impossible. This character development is fully flushed out and is substantially better than the first season. Definitely a nice way to tie the entire series off.\\n\\n\r\nAlso: the art is still crisp and never ceases to amaze me. (Go J.C.Staff!) Some of the soundtrack is recycled from the first season, but the voice acting is still on point. No major complaints on that front.\\n\\n\r\nSo, to summarize, what is LB Refrain? It gives you feels just for the sake of feels and does so through a series of plot elements that doesn’t make any sense.\\n\\n\r\ntl;dr\\n\\n\r\nPros:\\n\r\n+ Strong character development\\n\r\n+ Emotionally stirring\\n\r\n+ Strong thematic content that was present in the first season and also in Refrain\\n\r\nCons:\\n\r\n- Questionable plot elements that are poorly explained/linked\\n\r\n- Although the characters are developed well, the plot does not have an equal level of depth\\n\r\n- Poor transitioning \\n\r\n- Hard to follow, especially towards the end of Refrain\\n\r\n- Supporting members drop in significance \\n\\n\r\nStory: 4\\n\r\nArt: 6\\n\r\nSound: 4\\n\r\nCharacter: 7\\n\r\nEnjoyment: 6\\n\r\nOverall: 5",
            "date": "2015-12-18T17:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 205926,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=205926"
        }
    ],
    [
        {
            "content": "It is rare to find a sequel as emotionally powerful as Little Busters: Refrain. Where the first season blundered with its melodrama, Refrain instead provides a much more thoughtful and meaningful story. If you have developed any sort of attachment to the characters in Little Busters, you will undoubtedly shed at least a few tears by the end of Refrain. It is the second best Key anime to date. \r\nAs somebody who regards the Little Busters visual novel as one of the most emotional stories they have ever experienced, I was sceptical hearing about an anime adaptation of Refrain. Did it turn out to besome dreadful abomination in the end? I don't believe so, but the visual novel is still undeniably the superior experience. Large sections of story (including half of Rin's route) are skimmed over or ignored entirely in the anime. Other important scenes, such as Masato's backstory, are misrepresented as something silly when they should be serious. There are so many things that could have, should have been better, and yet it still manages to be one of 2013's best anime. Perhaps that is a testament to how strong the characters are.\\n\\n\r\nFor anime-only viewers, Little Busters: Refrain is certainly no featherweight. The story directly follows the events of the first season by developing characters who were largely overlooked in the past. Perhaps you found Rin adorable or Kyousuke amusing, but Refrain succeeds in elevating the main five much higher than that. It is one of very few anime where the relationships between the characters feel genuine rather than forced or manufactured. As a series rooted in the theme of friendship, Refrain does a magnificent job of making the viewer feel like they are a part of the story rather than merely spectators. That is no easy feat in a visual medium. \\n\\n\r\nLittle Busters does not rely on fanservice and other cheap tricks to hold your interest. Surely, there is an ever-present feeling of 'moe' among the girls (isn't Rin just the cutest thing?) but it is never used as a crutch for characterisation. Even Komari, arguably the weakest character in the first season, is given a considerable amount of depth through her relationship with Rin. Refrain goes further than giving more-- it makes us care. It does not find complacency in characterisation without meaning.\\n\\n\r\nWhat about Kengo and Masato, then? There was never much depth to them in the first season, amusing as they were. Masato in particular seemed to exist solely as comedy relief, like a more idiotic version of Clannad's Sunohara. That is no longer the case with Refrain. An entire episode focusses on Masato's backstory: why he is obsessed with the idea of strength, why he acts like an incessant moron in front of others, and how he became friends with Kyousuke and Kengo. The only issue is that the anime portrays these scenes as something silly (zombie eyes and battle music blasting in the background) when it is meant to be emotional. I'm not so sure the anime-only viewers will appreciate his characterisation as much as they could, which is a shame, as all the characters enrich the story in a pretty significant way. \\n\\n\r\nKyousuke's characterisation is where the writing truly shines. While his presence as a leader is often taken for granted in the first season, Refrain shows there is a far deeper reason for why everyone respects him so much. It is more than mere charisma. He cares about his friends more than anyone else and will go to any lengths to protect them from harm. Even if it requires him to play the role of a villain. And often he does. It is easy to be frustrated or even infuriated by Kyousuke's actions, but once all the pieces start clicking together at the end, you can't help but respect the poor guy. He's a deeply flawed person, and that's the way it should be. He is not perfect and makes mistakes like anybody else. Rarely do we find a character as genuine as Kyousuke. \\n\\n\r\nWhile the handling of Rin's route is disappointing, Rin manages to stand right beside Kyousuke by the end of the story. The second-to-last episode focussing on Rin is so touching, so masterfully directed that it genuinely surpasses the visual novel. I do not say that lightly. Unlike many other Key stories (and even anime in general), there is no melodrama. The entire series has been building towards a very specific point. Once Rin starts crying into Komari's arms, it is nearly impossible to resist choking up a bit. It's similar to the ending of K-ON's second season in many respects... although I might argue that Refrain does it better. \\n\\n\r\nAnd that is to speak nothing of how powerful Kyousuke's episode is. Or the lyrical significance behind the insert song \"Haruka Kanata\". Or all the subtle details hidden in the first season, or even how it gives meaning to all the alleged dei ex machina within Kud's and Mio's routes. Little Busters is Jun Maeda's masterpiece, and while not everybody may appreciate his style of storytelling, there is almost nothing to criticise about his work on Little Busters. Even if the anime only captured a tiny fraction of the visual novel's charm, I still believe it would be a satisfying experience. J.C. Staff's adaptation isn't fully there-- but it comes close. \\n\\n\r\n\"Comes close\". I wish it could have been on par with the visual novel, but that is regrettably not the case. The amount of scenes (and important ones, no less) that are skipped over is truly disappointing. All J.C. Staff needed to do was simply tone down on the foreshadowing (which can really undermine the surprise) and find the budget needed to double Refrain's episode count. If the anime did reach the same heights as the visual novel, I have no doubts that it would be regarded even more highly than Clannad: After Story.  \\n\\n\r\nThe artwork has been noticeably improved over the previous season, though. A surprising amount of effort was put into the first episode, and J.C. Staff has worked to eliminate most of the bizarre, off-model faces that were so prevalent before. There are still occasional scenes where the animation quality dips but it is nowhere near as egregious as it used to be. My only complaint is that many important CGs from the visual novel (\"called game\") are lacking any sort of visual impact in the anime. The visuals should have been used to enhance the story rather than merely assist it. \\n\\n\r\nRefrain makes near-perfect use of its soundtrack. \"Boys Don't Cry\" (Kyousuke's theme) is a subtle track that does not seem to carry much significance at first, but eventually evolves into what I believe to be the most emotional track in the story. It is a perfect tribute to Kyousuke. Most people will also find themselves pulled by the sheer emotional weight of \"Haruka Kanata\", the farewell song of the series. Considering the lyrical significance and all that was building up towards this point, it achieves more than simply being sappy; it is a massive tsunami of emotion. Special props should also be given to \"Song for Friends\" which achieves much of the same impact as the previous two. While Little Busters may have one of the best soundtracks in anime, it also has one of the best uses of music. \\n\\n\r\nThe seiyuu work is also commendable. The actors do not simply state their lines. During the more emotional moments in the story, you can clearly hear the actors choke up as their character begins to cry. We do not often see this level of effort in anime. Kyousuke's and Rin's seiyuu evidently care about getting into the role of their character, and the result is some of the best voice acting in years.\\n\\n\r\nLittle Busters: Refrain is a superb anime. It is an experience that is more than the sum of its parts. Few anime have managed to create such a thoroughly endearing cast of characters, and even fewer have managed to strike such an emotional chord with its audience. It may not be as good as it should have been, and while the visual novel is still several steps above, the anime adaptation is a solid alternative for those unable to dedicate the fifty-some hours into reading the visual novel. Those expecting a deep, convoluted story brimming with 'mature' characters may not find what they are looking for. Little Busters Refrain is particularly well-written and well-produced, but it does still rely on your ability to empathise with the characters. I don't think that is a bad thing at all.\\n\\n\r\nAnd I wonder, why do we live in an era where stories are judged solely by their complexity? Why must a critic feel forced to act is if they are too high-brow to value emotion? Human emotion is a powerful, powerful thing that gives our transient existence a meaning and a purpose. If a story is capable of bringing you to tears, it is a damn good one, I would say.",
            "date": "2014-02-14T20:12:00+00:00",
            "helpful_count": 406,
            "mal_id": 132599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=132599"
        },
        {
            "content": "Let's get one thing out in the open, I played the VN. Little Busters has always been close to my heart with the story itself one of my favorites around. But enough of that, let's get the review under way! Oh, and this review will contain comparisons between this and the first series and occasionally, reference to the VN. \r\nFirst things first, this series is a massive improvement in every aspect compared to the first series, be it art style, script, or timing of music. If I were to choose one stand out improvement however, it would have to be the animation. I found theprevious series almost unbearable at some points but this series, well was top class compared to what we have already witnessed within the Little Busters universe. This series blitzes the first series. One thing I must add is that to those who didn't watch the first series and have noticed the popularity of this series and wondered 'can I watch this series without watching the first?', you must watch the first series to fully embrace this series. \\n\\n\r\nThis series kicks off right where the previous series left off, focusing more on the 'Secret of the World' and the original Little Busters themselves. When the 'Secret of the World' starts to become more apparent, one realizes that this series itself is far darker and serious compared to the first. A personal love of this series is how subtle hints are dropped throughout concerning 'the secret of the world'. Some moments are incredibly clever and well, blow your mind! \\n\\n\r\nOne thing that is very apparent in this series is that it is very emotional. In the first series, there were incidences that weren't emotional at all and yet in the VN, they had me reaching for the tissues. This was due to things being lost in translation, literally. For me this was most obvious during Haruka's route but let's save this rant for another time. However, I was simply blown away at how well they transferred the emotional scenes over from the VN. I even felt that at certain points, the anime was actually more emotional than the VN!\\n\\n\r\nUnlike the first series, Refrain actually contains character development! Hooray! This in turn makes you feel more connected to the characters and thus enjoy the series more. Whats more is that this 'character development' didn't just apply to the 'original little busters' but the newcomers aswell such as Kurugaya. Happy days!\\n\\n\r\nNow, before I tie up this review, I wanted to dedicate a section the music. The music in LB is simply astounding. Be it instrumentals like 'Lamplight', which sends a shiver down my spine due to how harrowing it is or songs like 'Faraway' or 'Song for Friends'. I must add 'Faraway' is simply one of the most emotional songs I have ever heard. \\n\\n\r\nThis story is full of so many twists and turns that you couldn't possibly predict what could happen. Its a compelling, sad and funny story all in one! But the main reason I gave this series such a high rating is simply because of how well the JC staff adapted this story into an anime. I knew what was going to happen and yet I was glued to the screen from the get go.\\n\\n\r\nThis is a must see. One of the best of 2013!",
            "date": "2013-12-28T15:44:00+00:00",
            "helpful_count": 101,
            "mal_id": 126071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1831559.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/thelotusf1fan",
                "username": "thelotusf1fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=126071"
        },
        {
            "content": "Little Busters Refrain is (loosely) based of the key visual novels who have notably produced some great shows such as Clannad, Kanon and Air. Little Busters Refrain is no different. For a LB refrain is the sequel to Little Busters and in my opinion (and widely regarded to be) much much better than the first season, not that LB was bad in any way. This 2nd season is 13 episodes long.\r\nI should mention at this point that this again would fall under the category of high-school life (almost all of the action occurs here), fantasy and slice of life perhaps. As we have come toexpect from key, LB Refrain is just as emotionally hard hitting in its own way but I will leave you to decide that for yourselves.\\n\\n\r\nNow for the actual show itself. It picks off basically where LB left off and continues to develop characters stories from there. However the way it goes about this is in much more depth and each and every episode will invoke strong emotion. They only give themselves 13 with it all to do and they pull it off pretty well. You may be wondering if it is possible to further develop the characters stories in such a short time however the pacing and the mixture is just right. \\n\\n\r\nWhere LB was a rather nice, slow setting into the story, you really have to feel that it was all building up to LB Refrain. Be warned, LB Refrain takes a much darker angle right from the outset, some sensitive themes are explored and are very thought provoking. It goes to show that not everything can always go smoothly and it is here that you can really start to connect with the characters. \\n\\n\r\nSTORY + CHARACTERS: The story itself continues in the high school, we still don't know the answer to the universe (to those who have watched LB) and the episodes go through with each character. They all have very different stories and they are all fascinating in their own right. The characters you may have thought to be on the fringe suddenly make much more sense and everything is never as it seems at first ;). The best bit of this show in fact how well all the episodes were integrated with each other right from the first episode of LB to the last of Refrain. When you reach the climax, which personally I found very satisfying you can come to appreciate everything that has occurred in the previous episodes, it all suddenly fits together with amazing effect. \\n\\n\r\nOne thing I found with LB Refrain which was distinctly different to LB was the way they just dropped bombshell after bombshell without really ever giving you any chance to recover, the plot gets thick and very fast. In order to wrap up the show in 13 eps, each of the eps feel meaty and full of content and in fact the intricacies all make it more pleasurable to watch a second time once you know what is actually going on.\\n\\n\r\nThe soundtrack was very good I thought, the music complemented the action just as you would expect from a key adaptation and once again it was used to add an extra dimension to the atmosphere, made you feel something a little extra. The OP in my opinion was especially pleasant as well. \\n\\n\r\nAs a final word on LB Refrain, if there were one thing that I would stress the most, it would be that you have to keep yourself aware and keep your mind open. The story really does take you on ups and downs in the 13 episodes and it executes it so well in such a short period of time that there are various emotions that are evoked. The characters of this anime are probably some of the best worked characters or rather collectively they are the most interactive bunch with everyone having an affect on the other.\\n\\n\r\nExpect the unexpected on this emotional rollercoaster that is Little Busters Refrain. \\n\\n\r\nKyousuke, Rikki, Rin and co. make for one heck of a show with perhaps my most favourite story line full of twists and turns.",
            "date": "2014-02-07T15:07:00+00:00",
            "helpful_count": 79,
            "mal_id": 131815,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3111993.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tukky12",
                "username": "tukky12"
            },
            "url": "https://myanimelist.net/reviews.php?id=131815"
        },
        {
            "content": "There is a \"secret of this world\"….\r\nIf there is anything, it’s no secret that Little Busters Refrain is a sequel of the first season based off the visual novel of the same name. Also no secret is the fact that the visual novel has gained tremendous success as one of Key’s works. Key is known to produce a variety of their works with supernatural elements including Kanon, Clannad, and Rewrite. The Little Busters franchise tells the story of a boy named Riki Naoe who is a member of the team known as Little Busters. Along with three other boys and a girl named Rin, theyare led by Kyousuke to play baseball at their school. But little do they know there’s much more than meets the eye...\\n\\n\r\nIf the first season of Little Busters was the prototype, Refrain would be the final product. This means that it’s a direct continuation from the way season 1 was set up. Of course, not everything usually goes right especially in cases of visual novel game adaptations. Usually, fans expect more than what they can bargain for in terms of consistency with its characters, story, setting, music, artwork, and the list goes on and on. There have been some series that pulled it off quite successfully with its adaptations while others not so much in recent years. Little Busters Refrain falls under the category of a mixed bag at some occasions. It’s not a masterpiece but neither is it a shipwreck beyond salvage. It’s more of a work that fans should appreciate as it wraps up the story of Little Busters as a whole to deliver satisfaction and something to remember by.\\n\\n\r\nLittle Busters Refrain takes place in the same setting as the first season with most of the characters returning. However, it’s noticeable that the story changes dramatically in tone with its previous predecessor. A key (no pun intended here) concept involving the supernatural element of the “secret of the world” becomes prominent throughout the season. However, it doesn’t always go that way as we still some humorous moments. Not only has that but Refrain also added in some hints of potential romance between Riki and Kurugaya. The beginning stages of Refrain drops many hints of this with Kurugaya’s desire and wish to live her best days. Her presence in the show will leave a short yet memorable impression to viewers because of her wish. However at the same time, her departure lacks morality on her own behalf as what she wishes isn’t exactly what viewers may hope for. \\n\\n\r\nBut that’s only the beginning stages as viewers will find out that Refrain has many secrets to be unraveled as each episodes goes. This is accompanied by a balance of light and darker themes. Unlike season 1, the show ventures into a darker element involving tragedies along with themes of adolescence in growing up, dealing with losses, and experiencing the unexpected. At the same time, the show still brings in the slice of life fun at occasions similar to season one. The feeling of being part of a team and enjoying life with friends is an experience that I’m sure most people would cherish. In Refrain, we get to see five childhood friends enjoy their life. Unfortunately, not everything goes as they expected. \\n\\n\r\nAs Key is involved in the show, adolescence and growing up becomes a major role for our characters. In particular, Kyousuke (the leader of Little Busters) plays a guardian role and bringing in the foundation of the show of growing up. At the apex of the story, his feelings are poured out that truly allow viewers to see how he expresses them. More than that though, characters such as Kengo and Masato also play prominent supporting roles. All the characters are joined together by friendship that defines the importance of closeness and appreciation. As the series goes on, fans will learn the truth and more about the ‘secret of the world’.\\n\\n\r\nThe story of Refrain might also seem confusing at first with the various twists such as montages, narration, and climatic like scenes. There is a presence that something is not right in the world that Riki and his friends are part of. This is where foreshadowing comes into play as various hints are dropped with the dialogues, character interactions, and scenes are shown to give viewers firsthand what they might experience. As for the experience itself, it can be different for everyone. Key is a company known to bring forth themes of tragedy as well so emotions are to be expected. As one grows up, they will embark on a journey to learn from the various events in their lives. For our characters in Refrain, they too experience that journey. \\n\\n\r\nThe journey itself is explored in various arcs and episodes that connects the story as a whole. As a way of presenting the show, Refrain gives most of the prominent characters their spotlight including Kurugaya, Masato, Kengo, Riki, and Rin. Kyousuke becomes a driving figure in this show as mentioned before and the experiences he goes through reflects on Key’s reflection – the way it illuminates his feelings. The story itself also conveys comedy despite the grimmer atmosphere. Comedy exists not as fan service but rather as the character interactions and dialogues that holds various meanings. Although Refrain also lacks a bit of the more battle theme setting, it retains its sports style of baseball. Obviously, the show isn’t about sports but the moments are memorable especially for our main characters that enjoys their everyday lives just being together. Viewers will appreciate the concept of friendship that connects them as a whole while discovering the secret of the world. The surprise might not be pleasant but their experiences are unforgettable.\\n\\n\r\nRefrain still lacks a few aspect that might not be appreciable for viewers. As an anime only viewer, I did get quite the satisfaction from this show. However at times, I feel like something is missing such as resolutions to sudden conflicts. Some of the comedy also seems to be oddly coordinated or expressed such as Masato’s reactions. There’s even one particular episode focuses on him that gives him the highlight but doesn’t seem fitting with the Refrain atmosphere. Among other things, visual novel adaptations also sometimes suffers from consistency. In the case of dialogues, it nails it on the spot but not always the expressions or reflection of its ideas. There is an emotional impact to be felt but some parts aren’t tear jerking by Key standards. Perhaps a show being one cour is a problem here but at some cases, the arc/story feels rushed such as montages and resolutions. Also from what I understand, sudden elements of the VN are omitted that would of given the impact of tragic scenes. Despite this though, Refrain still balances itself between light and dark with its style and presentation.\\n\\n\r\nAnimation wise, the show remains decent but sometimes lacks impact or rather the maturity of its darker tone for Refrain. Characters are designed to look innocent such as Komari, Kud, Rin, etc. Kurugaya and the boys have a more mature while Riki has more of a childish appearance. On the other hand, the backgrounds are portrayed well and consistent with its fantasy-like atmosphere. The dream like sequences are prominent features that brings supernatural elements while dropping foreshadowing sequences for viewers. As an anime only viewer though, some of the expressions of the characters bothers me such as Masato and Rin. In fact, Rin isn’t very noticeable compared to the other main characters. Even when she takes the stage, it’s hard to take her seriously with her body language and expressions. On another note, JC Staff is known to adapt various anime series with a school life setting such as Sakurasou no Pet Kanojo, Hentai Ouji to Warawanai Neko., and Shakugan no Shana. While not all of them contains elements of supernatural, they do convey the innocence reflections of the characters. However, I question sometimes if this style fits given the more serious style of Refrain.\\n\\n\r\nThe soundtrack balances well on most parts whether it’s during scenes of emotional, comedic, or suspense. Various OST are incorporated from the visual novel while certain new ones are inserted in. It’s also noticeable that Jun Maeda, the creator of the VN is directly involved in coordinating the soundtrack so some of the experiences will feel similar according to his style of presenting the series. The OP song ‘Boys be Smile’ stands as a prominent song to convey the friendship that brings together the team of Little Busters. Even though not all the characters get their own spotlights, it portrays the show in a way that is remarkable with its messages. On the other hand, the main ED song “Kimi to no Nakushi Mono” lacks impact with its orchestra. Voice acting wise, most characters fits well although I sometimes find Riki’s voice to be irritating along with Rin. Kyousuke on the other hand has that authoritative mannerism thanks to Hikaru Midorikawa’s talents. The way he speaks gives him a sense of command and shows why he is the leader of Little Busters. Other characters such as Kurugaya and Kengo demonstrates maturity with their own tone of voice.\\n\\n\r\nLittle Busters Refrain isn’t just about discovering secrets but also finding paths to connect the characters together in a complex story. The romance might not be promising but the connections are through friendship and loyalty. There are certain elements that might be confusing especially for anime only viewers so be sure to pay attention as each episode unravels itself. Dialogues in the end should not be just memorable but also matching to Key’s style of presentation. Thankfully, it did that even with some of the oddly coordinated scenes involving expressionism of the characters. And because the show lacks fan service, there is no stupidity with the common misunderstandings or cliches that are overused in the anime industries on many occasions. What it does have is an impact that give viewers an experience they won’t forget. Refrain is not just a continuation but an appreciation as a gift for fans to open up.\\n",
            "date": "2014-01-03T15:56:00+00:00",
            "helpful_count": 57,
            "mal_id": 127027,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=127027"
        },
        {
            "content": "Little Busters! ~Refrain~ Full Review\r\nThis fall season, I get the joy and honour of reviewing Little Busters Refrain on Anime Corner. Honestly, I didn't expect it to be this good. It surpassed my low expectations garnered from the mediocre first season, to one of my favourite series of all time. However, please note that I have not played the visual novel, so this review will be solely based on the anime only. Anyway, let’s get on with the review.\r\nStory (9/10):\r\n“I totally didn’t expect that to happen.”\r\nIf you have watched the first season of Little Busters, you must have found it rather boring and mediocre. Everythingwas kinda predictable, and as such when they hit you with the feels, somehow the tears just don’t flow. As such, Refrain is the reward for managing to watch all 25 episodes of the first season.\\n\\n\r\nRefrain is totally different. Every episode is interesting with a super-annoying (but satisfying) cliffhanger at the end of each episode that just keeps you at the edge of your seat. There are so many plot twists within the show; you almost never know what’s coming up next, which causes so many emotions to be experienced when they do hit you with the emotional scenes.\\n\\n\r\nRefrain basically continues directly where season 1 left off. Riki and Rin get closer to the secret of the world, which I have to say, be extremely satisfying when it got revealed.\\n\\n\r\nMoreover, everything from season one has been linked together here to form this masterpiece. If you do go back and watch season one, you’ll get a newfound appreciation for it because you can see exactly what the characters and doing and why they are doing so. \\n\\n\r\nCharacters (9.5/10):\\n\\n\r\nHonestly, Little Busters is nothing without its characters. This is an anime where the characters are so masterfully done where it just carries the whole show forward.\\n\\n\r\n*Spoilers Ahead*\\n\\n\r\nOf course, with characters being the main focus, you would see a lot of development. Hell, the whole story is centered on the development of both Riki and Rin. Without a doubt, Riki is developed the most. When he was young, he was super depressed because he lost his parents, but Kyousuke and the Little Busters helped him get back on his feet. But even in season one, he was more of a follower. A follower of Kyousuke. As such, the entire story was basically to make Riki into a more independent leader. You could definitely see the difference between Riki’s confidence and decisions in season one as compared to the last few episodes of season two. \\n\\n\r\nAnother commendable character is definitely Natsume Kyousuke. The writers did an awesome job in portraying Kyousuke, such that halfway through the series, he was made to look like the villain. An extremely terrifying villain at that, being able to control whatever happens in the world, and trying to make Rin do things against her will. However, at the end of the season, we finally see his true intentions. I would say that Kyousuke is somewhat of a fatherly figure to both Riki and Rin. He did his best in order for the both of them to grow and develop, even if he knows he’s hurting them, because as the saying goes, “What doesn’t kill you makes you stronger”. As much as it pains him to see them getting hurt, it is for their own good.\\n\\n\r\nLastly, is of course the entire Little Busters team. They have all done their best till the very end in order to help both Riki and Rin grow, even though they do not benefit from it. I sincerely believe that if all friends in this world were as noble and kind as the Little Busters team, the world would definitely be a better place.\\n\\n\r\nAnimation (9/10):\\n\\n\r\nThe animation for Refrain is amazing. If you have been looking carefully at each scene, you would notice that there are actually very minor details that serve as foreshadowing to the later parts of the story, something that is pretty commendable. An example would be from episode 2; many scenes are white and look cold. This actually signifies Kurugaya’s loneliness, which is seen later on. \\n\\n\r\nSound (9/10):\\n\\n\r\nThe soundtrack of the anime is extremely fitting, complimenting each scene to make it feel more lively or to add to the sadness.\\n\\n\r\nSpecial credits to the insert song, Song for Friends, by Rita. It’s sung with so much emotion, and if you look at the lyrics you’ll feel even sadder for the characters during the scenes it is played.\\n\\n\r\n“Dare no tame ni bokura wa yuku? \\n\r\nDare no tame ni mata mezameru? \\n\r\nDare ga itemo daremo inakutemo koe wo okuru yo”\\n\\n\r\n(For whom do we go on? \\n\r\nFor whom do we awaken again for? \\n\r\nWhether that person exists or not, I call to them)\\n\\n\r\nIt basically captures the essence of the entire Little Busters anime.\\n\\n\r\nEnjoyment and Overall (9/10)\\n\\n\r\nI can say that I thoroughly enjoyed Little Busters Refrain. It was an absolute blast to watch, keeping me on the edge of my seat every episode. Moreover, I finally had the feels that I have craved for so much from season one, from an anime by Key. If you haven’t even picked up the first season of Little Busters, I highly recommend you do so right now, because Refrain is worth every episode and you’ll definitely be craving for more at the end of the series. \\n\\n\r\nIf you would like to check out more of my reviews, you can like my page at www.facebook.com/eisuanime .",
            "date": "2014-01-02T22:04:00+00:00",
            "helpful_count": 40,
            "mal_id": 126921,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2749279.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChargedCoin",
                "username": "ChargedCoin"
            },
            "url": "https://myanimelist.net/reviews.php?id=126921"
        },
        {
            "content": "Once in a while, I find myself craving for good drama with at least a decent story depth and a somewhat intense atmosphere. Apart from the latter, Little Busters ~Refrain~ was not able to deliver.\r\nThere's one thing in particular that is always inherent to KEY anime: borderline drama. In some cases (Clannad, Kanon), this drama plays out well because it feels genuine. In other cases (Angel Beats!, LB ~Refrain~), it is forced upon the viewer with all one's might and consequently feels artificial. While I must admit that Refrain does have its strengths, especially in terms of plot twists and tension, the characters totally failalong the way, which is the primary reason the drama that is being told here sadly mutates into something melodramatic.\\n\\n\r\nWhen there is one thing about the story that I have to point out as a definite success, it is the way the 'secret to the world' is being uncovered step by step in a very consistent pace. With each episode, the viewer gets drawn more and more into the mess with which the LB gang struggles to cope. This is the reason why there is a rather intense atmosphere to be felt that encourages to jump to the next episode and continue watching. Nevertheless, despite the decent idea underlying the story and the well planned-out conclusion, that, what was intended to be its greatest strength - the dramatic climax - turned out to be the most significant disappointment. That is not because of how the story was written, but first and foremost a result of poorly conceptualized main characters.\\n\\n\r\nI really love the drama in Clannad ~After Story~, but even there it becomes apparent how clichéd the (side) characters were designed to be. In Refrain this blatantly swaps over and affects the entire main cast, which is simply not acceptable. The fact that it is possible to summarize the personality of the main characters with one, at most two sentences is something that not only prevents the characters from driving the story forward, but has also a strong negative impact on the perceived credibility of the entire thing. The emotional attachment and the ability to relate to characters is what makes drama dramatic, when the appropriate plot elements are introduced. Refrain leaves it at presenting tearjerking scenes, which are emotional because of their nature and the viewers' cognitive associations, and not because there is genuine drama inherent to the content of the show.\\n\\n\r\nWell, but if someone perceives the emotional impact of an anime - be it artificial or genuine - as its quality, it is basically a good thing, isn't it? Basically yes. The good thing about Refrain is its level of entertainment and the degree to which most people enjoy this series. Only a minority of the viewership actually thinks about whether the drama is rather artificial than genuine. That is why Refrain can without fail be recommended as an anime that has the ability to entertain in various ways. In my rating, however, I give credit to those anime that succeed in thinking things through. Moving someone to tears is simple, building a structure of attachments between the viewer and the characters and killing it off is something that requires method.\\n\\n\r\nUnfortunately, considering that I always loved at least the technical aspect of KEY anime, Refrain, in contrast to previous works, disappointed here as well. A mediocre (beautiful but not noticeably varying) soundtrack, a standard-type ending song, and a slightly more original opening song with some build-up tension don't suffice to warrant a higher rating. Even in terms of visuals, Refrain is sloppy. We live in times of high quality productions, yet Refrain - with its highly emotional content - doesn't make use of the potential that a decent colorization offers to shows like these. Camera angles, transitions, character design, there's nothing that reminds me of the quality of KEY's previous works. Apart from these comparisons, Refrain as a standalone series is definitely enjoyable in terms of arts.\\n\\n\r\nI was looking forward to Refrain, since it ranks among the best anime on MAL, but it yet again turned out to be a tearjerker without substance. Tearjerkers are perceived very differently by the anime audience. Those who actively search for meaningful, authentic drama won't be satisfied by watching Refrain, while those who predominantly value the emotional impact a show (forcefully) produces discover a first-class series. One reason for the great success of Refrain might be the huge improvement since season one. Personally, I really enjoyed watching Refrain because of its atmosphere, but in each and every episode I was reminded of the fact that this cannot in any way be compared to Clannad. It lacks passion and method.\\n\\n\r\nRating: 6.32/10\\n\r\n(A quantified evaluation can be found on my page.)",
            "date": "2015-04-04T15:08:00+00:00",
            "helpful_count": 23,
            "mal_id": 184745,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197998.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nishiyamo",
                "username": "Nishiyamo"
            },
            "url": "https://myanimelist.net/reviews.php?id=184745"
        },
        {
            "content": "\"I'd forgotten\r\n That living \r\n Meant losing\" -Naoe Riki \r\nComing of Age is a really tough genre to pull off, especially in recent anime. You have to establish characters, and as the story progresses, force them to endure certain events and cause them to grow up, whether from a child into an adult or grow as a human being. Little Busters pulls off coming of age as good as I've ever seen an anime do it. And it does it while adding such emotional power to the story that only enhances the impact that the story will leave on you. This is thanks in nosmall part to Key, of whom the original Visual Novel was originally conceived. Key knows how to touch your emotions. And some would say that they've been hit or miss with some of their stuff. But when it comes to Little Busters, which I just finished rewatching, the messages they convey are on par with their best. \\n\\n\r\nMany people dislike the first season of LB (For reasons other than adaptation decay). And I can't really blame them for doing so. When you watch this anime, you'll see season 1, and you might feel a little disappointed. Because to be completely honest, it is exactly what you'd expect from a Key Visual Novel adaptation. Protagonist meets an assortment of girls, and helps them out with their problems, which tend to have a lot of sad moments sprinkled throughout them. It also consists of a lot of moe characters doing moe things. And has a few stand alone episodes that at first, feel like they aren't really important to the overall plot, but in the end, are integral. But don't let that ruin things for you, the first season is vitally important to the success of this show. I for one loved the first season, it had many lovable characters, hilarious comedy, some very good story arcs, and subtle nods to \"something more\" that was yet to come. Season 1 establishes all of its characters, it gets you attached to them. Which will make the emotional jolt the story takes in season 2 much more meaningful to watch. This anime succeeded where the incredibly similar  Angel Beats didn't, in its length. Angel Beats threw at you 15+ characters, and tried to make you get attached to them in just 13 episodes, which, is almost flat out impossible. Little Busters as a whole is 39 episodes. It gives you an immense amount of time to get invested into these people's lives. More comparable to Clannad, season 1 serves as pretty much the 26 episode prequel to let you know who everyone is, what they're like, and attempts to prepare you for the much bigger and better sequel. \\n\\n\r\nWhen season 2 rolls around, it will begin to take a turn. A turn down a path that's quite unlike season 1. It introduces things into the story that you hadn't seen before. Those nods to \"something more\" in season 1 all come to fruition here. All your questions will have answers. Your opinions will change. And, unlike most anime that have come out within the past 4 years,  you will see the growth of a character. This is a Key anime. And as said before, some Key anime are hit or miss. Some of them, like Angel Beats, exist only to make you cry. It's not trying to tell you a good story, nor is it trying to throw out real character depth. It exists solely for the purpose of pulling at your emotions. And if you're like me, that won't work, because you can't become emotionally invested in a story and characters in only 13 episodes devoid of meaningful development. LB isn't just some melodramatic tear fest, forcing you to cry is not Little Busters' one and only objective. This is a show that's going to tell you a story. A story that you can become easily invested in, and if you cry along the way, so be it. Little Busters Refrain takes the Clannad After Story method of establishing characters in a first season, and putting them to the test in the second. Really forcing them to do what they are capable of doing. No longer is our protagonist just a protagonist, he is, in Clannad's case, Tomoya Okazaki, a man who has lost everything, a man who has given up,  but a man who still finds hope, and must fight his hardest to regain the things that he once held dear. Little Busters, has Naoe Riki. A boy who is young, naive, and not ready for the real world, Relying too much on others to do what they think is right rather than what he thinks. Throughout Refrain, he has to grow stronger, not particularly physically, but stronger as a person. Grow into someone who can deal with loss, and overcome hardship. Little Busters conveys the theme of growing up insanely well. Saying that you can't rely on your friends forever. Your going to have to deal with very bad and awful situations, and your friends won't always be there for you. You have to become independent. You have to grow up. \\n\\n\r\nAs I said earlier, I just finished rewatching Little Busters. Now, I've rewatched a lot of anime now, and while Little Busters is one of my all time favorite anime, it is not my absolute favorite. But I can say that it was definitely the most rewarding rewatch I've ever experienced. I never knew just how much season 1 references things that have to do with season 2 that you won't understand until you get there. You're able to more knowingly understand certain character motivations, and some things they say will make a lot more sense knowing the overall outcome. My opinion on the characters was different the second time around, and it made for an incomparable rewatch  experience. Originally, I had thought that I just loved LB, not that it was a great show by any means, but upon seeing it a second time, I can objectively say that it's one of the best anime I've ever seen to date, season 2 specifically. It is something that will grip you, attach to you, and emotionally drain you. Something I feel takes what both Anohana and Angel Beats did, and does it 10x better. With a coming of age story that will surely blow you away from start to finish, it's something that I'll wholeheartedly recommend to anyone and everyone who either wants a great story with great characters and character development, or if you just wanna sit back and cry a whole days worth of tears. \\n\\n\r\nLittle Busters ~Refrain~ is a masterpiece among modern day coming of age anime. \\n\\n\r\nThank you for reading.",
            "date": "2015-08-16T19:20:00+00:00",
            "helpful_count": 18,
            "mal_id": 196345,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3373331.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ZachM",
                "username": "ZachM"
            },
            "url": "https://myanimelist.net/reviews.php?id=196345"
        },
        {
            "content": "My first review so bear with me.\r\nLittle Busters! Another anime adaptation done by none other than Key Visual Arts. This anime pretty much revolves around a group of friends looking to carry on their youth and try to make the most out of it with the amount of time they have left in High School. Refrain! As most would know is the sequel which leads more into the main arc of the overall story. I HIGHLY suggest you watch the first season before watching this because it may cause some confusion. Now here is where I get into the actually review.\r\nStory 10/10:\r\nAssuming you haven't watchedthe first season (which isn't necessarily required) the story may start out a bit vague. For obvious reasons the first season solely focuses on character development and things of that nature so immediately starting off at refrain would obviously cause some confusion. Now if you are looking for an anime with a really heartfelt and very touching story then this is the anime for you. Watching up till now it gave me that same feel Clannad and Angel Beats! gave me. It was able to touch my heart and give me \"dem feels.\" Originally I would have rated the story a 9 The reasons for that was because at certain parts in the story it was slightly predictable. Take notice I have not had any experience with the Visual Novel what so ever so I was unfamiliar with the story to begin with, but as I mentioned the story was predictable and I felt I was writing the story on the spot as I was watching it. What made me decide whether to give this story a 10 or not was the plot twist near the ending. Which is something I should be accustomed to by now considering a lot of this happens in other Key stories. \\n\\n\\n\\n\\n\r\nArt 9/10: The art is great. It is well done and very bright and contrast. They did a great job with the mood of the scenes as well as showing emotion in the scene. Not much to say on the art but it is definitely top notch and a huge improvement from the first season. But there are some scenes where it seems either rushed or just badly animated but they make up for that with the story.\\n\\n\\n\\n\r\nSound 10/10: The audio is amazing. This is definitely what drove my emotions up and down while watching this anime. The music was used correctly in every scene and I think overall they were just beautiful and perfect.  Just like their other anime adaptations the music in this was phenomenal I will more than likely be getting the sound track as it has been one of the most beautiful music written since Angel Beats! and Clannad!\\n\\n\\n\r\nCharacter 10/10: The Characters at first seem very simple especially in the first season but in Refrain! They live up to \"Key standard\" with very intense backgrounds and how they came to be the way they are. I would rate it a 9 because some of the background stories for the characters seem to be rushed or cut short but I was able to piece things together realizing how deep the characters actually are and how far they have as well as the obstacles they have overcome. Masato's obstacle was incredibly touching yet simple, which is something I really like to see in Key's stories. \\n\\n\\n\\n\r\nEnjoyment 10/10: Overall I love slice of life anime especially the ones produced by Key. Key is the only company that has impressed me with every single story they have produced because despite them all being slightly similar in one way or another they all have their own thing that makes them tick to get my attention. I give it a 10 because I have enjoyed this so much I will watch this again in the near future just as I did with Clannad and AngelBeats! I also plan to re-watch Kanon(2006) as well as Air!\\n\\n\\n\r\nOverall 10/10: Despite the story being slightly jumbled and confusing I feel you shall enjoy this. I mentioned similarities between the other stories Key has produced. I didn't mean to compare and for you to expect the same thing. But If you enjoyed Key's other stories than you will more than likely enjoy this one. This is an anime that you have to watch just expecting a great story. \\n\\n\\n\r\nThank you for reading my review. Like I mentioned this is my first review and it is currently 4:46 AM so if any sentences that I have written sound weird just know that I was up really late writing this. Thanks again and I do recommend you watch this anime because it is now among my list of all time favorites. :)",
            "date": "2013-12-28T06:48:00+00:00",
            "helpful_count": 16,
            "mal_id": 125993,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1483261.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shian96",
                "username": "Shian96"
            },
            "url": "https://myanimelist.net/reviews.php?id=125993"
        },
        {
            "content": "Drama\r\nA lot of good series out there depict an emotion-filled story where the romance comes secondary, if at all. Strong depictions of friendship and in challenging situations can really draw a viewer into the story and start making them sympathize with the characters. It’s a bit of an all-encompassing genre, but only a handful of series really pull viewers in with their screenplay.\r\nIt took a while to build. Little Busters! started out slow, and after the first few episodes some people were condemning J.C.Staff for ruining the latest Key adaptation. many of the fans dropped it but I hold on to it. It built slowbecause the fast punch isn’t nearly so devastating as the freight train slamming into your soul. By the time Refrain rolled around it had built up a head of steam, and when all the emotions finally came crashing down, I wept. I wept unabashedly for two whole episodes, so potent was the drama unfolding on the screen. There were many great dramas this year, with Uchouten Kazoku almost winning for a similarly slow build up and an emotional gut punch on Episode 8, but only one show pulled us in so deeply only to rip our hearts out with friendship and love. It made every minute that proceeded it worth it many times over.\\n\\n\r\nMystery\\n\r\nWho doesn’t love a good mystery? Thought-provoking storylines that keep inquisitive viewers watching and speculating on where things are headed? Yes, please. They don’t necessarily have to have a horror element to them.\\n\\n\r\nLike last year, 2013 didn’t provide much in terms of mysteries. That didn’t mean that there weren’t good additions to the genre however, and one mystery ended up particularly good. By that, we mean the “Secret of the World.” Set up in its original run and finally culminating in this past season’s Little Busters! ~Refrain~, this was a mystery that hung around for over two dozen episodes, occasionally disappearing and reappearing when we least expected it. It taunted us with red herrings and subtle hints, giving viewers the general feeling that something wasn’t quite right while holding the actual secret until the very end. And what a secret it was. No matter what you thought about the original series, the fact is that Refrain was a spectacular piece of storytelling, and its mystery elements were a big reason why. This was a mystery whose revelation sucker punched you when you least expected it, turned the entire series upside down, and was something whose emotional impact made it an easy winner for this category in my list.",
            "date": "2014-11-02T00:52:00+00:00",
            "helpful_count": 13,
            "mal_id": 167117,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4054861.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Raghnaq",
                "username": "Raghnaq"
            },
            "url": "https://myanimelist.net/reviews.php?id=167117"
        },
        {
            "content": "Now that I watched the last episode, I can finally write a review for this anime, I can go on and on about this and list 675  reasons why you should watch it, but I am just going to keep it simple so that people who aren't sure about it, can at least consider it.\r\nLittle Busters!: Refrain is a continuation for the first season, where in that they just focused on introducing the characters best way possible. But Refrain is where things start to get really interesting, the main story will start to unfold, and many plot twists and shocking moments will occur thatwill pull you in.\\n\\n\r\nStory: 10/10\\n\r\nNothing shocked me as much as when the true story of little busters! started to unfold. The story just hits you on the head without you even knowing, you start noticing things that you didn't notice before because you didn't know what is going on, episode by episode questions start to build up in your mind, and by the final episodes all of them are answered and you just sit there dumbfounded by the awesomeness (while crying of course).\\n\\n\r\nArt: 9/10\\n\r\nEven though I never really had an issue with the first season's art. I will admit that it is more improved here, the characters look better and the animation as well... And that's about it, if you're watching an anime just for the \"art style\" and going to judge it based on that, then you're watching it for the wrong reasons. (Of course art is an important reason, but it isn't EVERYTHING.)\\n\\n\r\nSound: 10/10\\n\r\nI don't think I have much to say here, just listening to it's soundtracks, you will know how amazing they are. Every song fits perfectly, and without these strong and emotional soundtracks the scenes wouldn't have left an impact as they did. \\n\\n\r\nCharacters 10/10\\n\r\nLittle busters!: Refrain offers such strong characters, and all of them are different from the ones you already saw in season one, because in Refrain, they show their true selves and you will be surprised by how different they are. And not to forget the emotions each character shows, it's as if the characters are real.. you can feel the pain they are going through. Your thoughts on the main characters before will surely change for the best. \\n\\n\r\nOverall 10/10\\n\r\nI enjoyed every episode of Little Busters!, I thought it was an amazing anime and I think everyone should at least give it a try, and watch it until the end before judging. People shouldn't compare this to the visual novel, or even other titles. This should be looked at as an individual, and should be judged based on that. \\n\\n",
            "date": "2013-12-28T12:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 126041,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1131715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cosmic09Moon",
                "username": "Cosmic09Moon"
            },
            "url": "https://myanimelist.net/reviews.php?id=126041"
        },
        {
            "content": "I thought this was going to be \"another season, another crappy drama\" kind of show but my god was I wrong. This, folks, is an example of a sequel that is a lot better than the original. I'm not a VN reader so I'm reviewing this as an anime-only viewer.\r\n(There will be some SPOILERS in my review)\r\n[Story]: (9/10) (SPOILERS)\r\nThe story continues from the season as Rikki now successfully recruited enough members for the Little Busters and won their first game. \r\nCompared to the 1st season's story, the story told in the 2nd season is a lot better. Just by watching the first episodes, you'll thinkthat they haven't learned their mistakes and are doing the same mistake but nope. After the 1st episode ends, the show starts to get serious and you'll know that this isn't going to be the same as the first season. \\n\\n\r\nThe show focuses on 4 main arcs. The first arc is Yuiko's arc, the second is Rin's arc, the 3rd is focused on Riki and the original Little Busters (without the girls), and finally the final arc, where the show answers everything that happened in the first season, the early second season and the things going on in their \"world\". I am not going to summarize the arcs. \\n\r\nAnyways,  Let's focus on the first arc. This arc primarily focused on Yuiko and Rikki. The first season didn't focus that much on Yuiko so I'm glad they did it here so they can give her a character development.  This arc maybe focused on Yuiko but if you take a closer look, this arc is preparing you for what is about to happen at the later episodes. The big hint that this arc gave away is the \"time loop\" and it also foreshadowed some events that is about to happen. \\n\r\nNow the 2nd arc which is focused on Rikki and Rin's relationship and the \"secrets of this world\". This might not be the best arc but it's still a great arc. They have now received the final mysterious and they must solve it and the writer of the messages will reveal the \"secrets of the world\". At first, I thought this \"secrets of the world\" crap is just a filler but it's not. The \"secrets of the world\" is a plot point that makes the whole story of the second season. The arc also focuses on Rin and Rikki's relationship. In my opinion, them being a couple felt a little bit forced and it was predictable because Rin and Rikki have been spending a lot of time together. \\n\r\nNow the 3rd arc which is focused on Rikki and the Little Busters. When I first watched this arc, I was very confused. I was asking myself \"What happened after the police took Rikki away from Rin?\" and \"What is this, a flashback episode?\". I just ignored those questions and proceeded to go forward. Apparently, Rikki is now recruiting members for the Little Busters while Kyosuke is in his dorm, depressed and reading mangas, because Little Busters is now broken up.\\n\r\nNow the 4th and final arc, where every single plot hole gets filled, everything is explained and how this arc stabbed me right through my heart. I just want to get this out of the way, this arc made me cried and I rarely cry when I watch TV shows. Especially when they showed the bus accident scene.\\n\r\nAll of the character's actions in season 1 started to make sense, all those forced dramatic character arcs, why Kyosuke wants Rin and Rikki to become stronger, the time loop that Rikki experienced on the 20th on June, and the \"secrets of the world\" also started to make sense. I also felt sad and depressed when Kyosuke revealed why he's doing what he's doing. I'm just going to ignore the fact that Kyosuke can repeat time and create a fake world without a scientific explanation. \\n\r\nNow my opinions on the story. It's great. It shows how Kyosuke is doing everything just so when they go back to the real world, they become stronger. The dramatic scenes and emotional moments are not forced this time so the drama was thought out and not something the director just came up with. There are a few flaws and one of those is the story pacing. Characters arc are still rushed but they're not as rushed as the first season. \\n\r\nNow my opinions on the ending. Thank the Lord that they did not die. I don't want the show killing off all my favorite characters.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Art/Animation]: (9/10)\\n\r\nThe Animation is a lot better than the first season but there are still a few flaws. Details are still somewhat lacking and the character design is a bit better than the first season. Their hair are also somewhat better but I don't know if this is just me. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Sound]: (9/10)\\n\r\nI didn't really like the soundtrack in the first season but the soundtrack in this season is a major improvement. The OP theme song fit so well in this dramatic show. At first, it sounded bland and boring but later on, I understood why. The OP also got more and more depressing as the show goes on. The ED theme songs are also better than the previous ED. I only liked the 1st, 3rd and 5th ED theme song but I didn't really like the 2nd one but this is my opinion.\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Characters]: (9/10) (SPOILERS)\\n\r\nIn the first season, I loved all the characters except Riki because of how he's able to go around and solve the girl's problem without him having any problems. However, in this season. It showed that Kyosuke was resetting time everytime Rikki gives up on one of the girl's problem so it pretty much shows that Rikki is not a perfect main protagonist. What was shown in the 1st season is Rikki successfully solving that girl's problem and they didn't show his failed attempts. It also shows that he becomes stronger everytime Kyosuke resets the time.  Because of that, I now like Rikki. \\n\r\nThe whole season pretty much gave Rikki and Rin a major character development. Showing their flashbacks, their struggles, etc. \\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[Enjoyment]: (10/10)\\n\r\nEasily a perfect score from me. I wasn't expecting to cry this much when I started watching Refrain because the 1st season was just forced dramatic moments so it didn't really make my cry. I don't think I'll see anymore anime that can make me depressed. (Besides Clannad)\\n\r\n---------------------------------------------------------------------------------------------\\n\r\n[OVERALL]: (9.2/10)\\n\r\nIf you're holding back on this anime because you didn't like the 1st season that much then you'll regret it. This season is a lot better and the emotional moments can really hit you so hard. This is one of the best drama anime I have ever seen. The last 4 episodes made me depressed as hell and cried my eyes out. I shouldn't have watch the last 4 episodes all in one go.\\n\\n\\n\r\nPros:\\n\r\n+Great Story\\n\r\n+Great Animation\\n\r\n+Improved Soundtrack\\n\r\n+Emotional and Dramatic moments are successfully executed\\n\r\n+Happy Ending\\n\r\n+Great Characters\\n\r\n+Heavy Character Development on Rin, Rikki, Kyosuke, Masato, and Kengo\\n\\n\r\nCons:\\n\r\n-Story Pacing is still a bit rushed\\n",
            "date": "2015-08-10T15:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 195755,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=195755"
        },
        {
            "content": "This Review For Little Busters and Little Buster! Refrain\r\nWhen I look at this like the early story of friendship which is housed in a comfortable school.\r\nevery character undergoes each for its development in the first season of the series little busters this.\r\nthe most I like this anime was the development of characters ending with ending the coolest!!\r\nuntil I can not say much ...\r\nsorry for bad english :p\r\nOverall 10/10",
            "date": "2015-04-03T10:03:00+00:00",
            "helpful_count": 9,
            "mal_id": 184600,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3203475.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kawaishou",
                "username": "kawaishou"
            },
            "url": "https://myanimelist.net/reviews.php?id=184600"
        },
        {
            "content": "As soon as I saw the first season of Little Busters! end announcing a second season, I couldn't help but think that it would be similar to Clannad After Story (I'm assuming almost everyone planning on watching Little Busters has already seen Clannad in this review but I won't spoil anything from it). Having not played the visual novel and only knowing how other Key anime have done so far, I knew Refrain would bring tons of drama that the first season only a small amount of. Since Little Busters! is basically the friendship version of the family-focused Clannad, it's easy to imagine that Refrainwould follow in it's footsteps of being much better (to me) than it's prequel. And Refrain did just that.\\n\\n\r\nRefrain is a bit of an odd sequel as far as sequels go. For most shows, it is a requirement that you watch the first season for whatever reason before moving on to the second. I would only recommend watching the first season of Little Busters in order to get acquainted with the characters a little better, but otherwise (since almost nothing happens in the story overall aside from the original group of five members doubling in size) you could just skip it and go right to Refrain. The characters acquired in the Little Busters group during the first season become minor characters and the focus shifts to the original quintet who had less development during the first season.\\n\\n\r\nSo what makes Refrain so much better than the first season? Everything. A moving, dramatic plot; plenty of character development for the main characters; an improved soundtrack and better animation. And, of course, it's much more enjoyable.\\n\\n\r\nThe story of Refrain begins not long after the Little Busters! baseball team won their first (and only) game. The show moves away from baseball now and starts focusing specifically on Riki and Rin. But the first arc of the story focuses on Kurugaya, the mature genius girl who was the only one of the new recruits who didn't get an arc in the first season. This arc leads the way into the real story similar to how Clannad After Story's first few arcs did.\\n\\n\r\nThe story of Refrain is the biggest improvement from the first season. Rather than just the typical \"go around and help all the girls solve their problems\" plot which you can find in basically every harem anime ever, the story focuses only on Rin and not the other girls. Rin has always been shy and slower to grow attached to the other characters than everyone else, however her shyness starts to become an even bigger problem and neither her older brother Kyousuke nor Riki seem to be able to solve it completely. To make matters more difficult, Kyousuke and Riki are both going about trying to help her in different ways.\\n\\n\r\nAside from Kurugaya during her arc, the only important characters for the most part are Riki, Rin, Kyousuke, Masato, and Kengo. Along with many flashbacks to their childhoods, the show also develops them incredibly well in the present time. This was one of the main problems I had with the first season. With all the attention given to the other girls who were joining the Little Busters, the original five had very little development. Even Riki did not have very much development despite being the main character. Refrain does a great job of giving enough screen-time to each of the five and building their characters separately and developing the group as a whole. The only real problem with the characters is that they start off so weak that it takes a while before their development makes them really likable. The group of minor characters now gets even less development than the main quintet did in the first season and are only really important for their impact on the main characters.\\n\\n\r\nRefrain's soundtrack uses many of the same songs from the first season, but it focuses much more on the dramatic tracks and (with the decreased amount of comedic scenes) has much less of the forgettable, lighthearted music that was used plentifully throughout the first season. The OP theme also changes to fit the mood whereas the OP and ED from the first season were much more upbeat and cheerful (that's not to say I didn't love the ones from the first season, and it was very nice to hear the first OP return once).\\n\\n\r\nThe animation improves just like everything else, though not quite as much. The animation of the first season, though it had spots where the quality fell, was good. The quality of this season's animation was improved in part due to the story requiring it to be much better. The scenery moves away from almost primarily the high school setting and incorporates many other places as well as some more surreal moments. The character designs (though the majority of the colorful hairstyles disappeared with the minor characters) improved as well. The actions of the characters are detailed much better than before and the dramatic mood the animation sets is astounding. There were still some problems especially early on where the animation was more similar to how it was in the first season, but for the most part it improved very well.\\n\\n\r\nBut as much as I've been saying positive things about Little Busters, it still only gets an 8/10 overall. So where does the anime have problems? Going back to the how it's similar to Clannad After Story, Refrain has problems in both the beginning and end mainly in the story, but also with the characters in the beginning. With the beginning being similar to the first season, the story then is more of a setup for the real story which begins about a third of the way through the season. As for the ending... well it's a Key anime and what Key anime doesn't suffer from it's ending a little? The strongest part of Refrain is the middle once the anime begins to shed some light on the real story and what is actually happening. All I'll say about it is that it really is one of Key's best works.\\n\\n\r\nStory -- 8/10\\n\r\nAnimation -- 8/10\\n\r\nSoundtrack -- 9/10\\n\r\nCharacter -- 8/10\\n\r\nEnjoyment -- 9/10\\n\\n\r\nIf you've watched and enjoyed any of Key's other anime (especially Clannad), then I highly recommend you watch Refrain. If you want to build up more of a connection to the characters, then also watch the first season. If you know that the end of Refrain will probably not make you cry no matter how much of a connection you have to the characters, then you could probably just skip to this season. Refrain is (in my opinion at least) Key's second best anime adaptation (second only to After Story). It is a vast improvement over the first season in every way and I believe it is something you should not miss if you enjoy high school romance and/or slice of life anime.",
            "date": "2013-12-28T12:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 126037,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=126037"
        },
        {
            "content": "I don't usually review sequel series' for shows, but Little Busters will be an exception.\r\nAfter being completely blown away by the original series (10/10) mostly due to the amazing character development - despite its predictability, i loved it.\r\nThen i completed Refrain.\r\nCompletely different ball park\r\nIt was EVERYTHING and more that i wanted it to be.\r\nThe best phrase to describe this masterful sequel would be \"Edge of my seat\", and it does this seamlessly, not through cheap action scenes. Instead, throughout these 13  episodes, doors are constantly being nudged, you lean forward - hoping to find out more, but it wasn't even a door in thefirst place. I guess what i'm trying to get at here is the utterly different frame of mind that the show induces so differently to the original, it completely overwhelmed me...\\n\\n\r\nTHIS THING HAS MORE TWISTS AND TURNS THAN THE BIGGEST (Emotional) ROLLOCOASTER IN THE WORLD.\\n\\n\r\nand if you've completed Little Busters (original), you would be a FOOL not to look into refrain, i can't put it into words well at the moment but EVERYTHING becomes truly explained, you have no idea what's in store for you...\\n\\n\r\nYet i do :-)\\n\r\nAnd i can honestly say that it is the most outstanding series of TV I've ever seen. When it comes to media, i'm not a cry-er - it just doesn't happen, yet this show pushed me to the limit, that's how immersive it is. But no, it's far from one dimensional, after all, i didn't tell you what emotions i felt so strongly.\\n\\n\r\nIt may seem like a Cliche, but those cliffhangers and the revelations in the show will make you want to watch through it all as soon as possible. If you do decide to go binge watching though, i advise you check the floor for a safe landing zone: as you'll be on the edge of your seat!\\n\\n\r\n-----\\n\\n\r\n10's across all boards, though the original series was 90% character based, now you have a wonderful STORY to cherish! ^.^",
            "date": "2014-11-04T17:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 167449,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=167449"
        },
        {
            "content": "\"Wait, let me cry just a little longer.\"\r\nI don't think any quote from this series can really sum up the emotional energy it carries. Forget the overdrawn melodrama of the first season flicking you on the nose; Little Busters!: Refrain is here to punch you in the face.\r\nEverything about Little Busters! has been revamped and improved for Refrain. The story is tighter, more focused, and more emotional. Since this season is only half as long as the last and only focuses on one main story arc, events move along with a much better rhythm and flow.\r\nThe art, while still pretty bland and uninteresting, has beenmade crisper and clearer, and the animation has been made smoother and more natural. However, there are some moments of great imagery that elevate the show's visuals.\\n\\n\r\n The music is much the same: the piano melody from the last season is carried over and used repeatedly, but the tune is used to great effect, representing nostalgia, melancholy, loss, regret, relief, and happiness. The opening and closing themes, especially the former, are perfectly suited to the tone of the show.\\n\\n\r\nThe characterization of this season is executed much more naturally than the last. Gone are the cumbersome multi-episode character arcs, replaced instead with slower paced reveals and moments of growth that feel much heartier and effective. Refrain focuses much more on the core Little Busters (Riki, Rin, Kyousuke, Masato, and Kengo). That's not to say that the other characters do not play a role in the story, their role is just not as pronounced. You will care about these characters. You will cry for these characters.\\n\\n\r\nRefrain is much more enjoyable than the previous season. The story is paced much better, the arcs are more focused, the emotions are more intense, and the visuals are crisper. Everything is better.\\n\\n\r\nLittle Busters!: Refrain is unreasonably good. It's the only anime I've cried at, and I never expected to do so after finishing the mediocre first season. Refrain is worth the time spent slogging through the original Little Busters ten times over.",
            "date": "2015-07-22T15:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 194082,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4521039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gregdubin",
                "username": "gregdubin"
            },
            "url": "https://myanimelist.net/reviews.php?id=194082"
        },
        {
            "content": "Little Busters! ~Refrain~, the sequel of Little Busters!. This anime was adapted from Little Busters! VN Refrain route. Maybe some of you will compare this anime with Clannad. In my opinion, we can't compare these two anime because they have different genre and different main story. It will be great if we compare this anime with Angel Beats! because both of them have a same genre. That's my preface of reviewing this anime :)\r\nOkay, i'll start my review of this anime.\r\nStory:\r\nThe story was based from LB! VN. The anime producer of LB! Refrain, J.C. Staff, is doing good enough to represent the story. The firststory is about Kurugaya's route. It has a little different story from the VN because J.C. Staff made Kurugaya's route become the intermediary to Rin's route. It is nice because when you play the VN, Kurugaya's route and Rin's route are separate and can't be connected. I have a little disappointed in Kurugaya's route because it can made me cry but J.C. Staff didn't made a little dramatical as sad as AB!.\\n\\n\r\nIn Rin's route, the story is really good. The story is about Riki and Rin who will \"going out\". This story also continuing the mission about \"The Secret of The World\". One part what made me confuse is when Mio, Kud, and Haruka are going out and didn't say goodbye. I think they will going back to the dorm. But if you're the VN reader, you have know that three of them are disappeared.\\n\\n\r\nAfter Rin's route finish, you will watch the real Refrain's route. The story is same as VN. J.C. Staff only cut the part when Riki is going to hospital. That's a disappoint. In a good news, J.C. Staff made a nice farewell of Riki and Rin with Masato, Kengo, and Kyousuke, who made a dramatical farewell.\\n\\n\r\nArt:\\n\r\nLittle Busters! Refrain isn't the best of the art but it is better than Little Busters!. J.C. Staff improved the quality of the art and it reminded me to Angel Beats art.\\n\\n\r\nSound:\\n\r\nThere's no doubt about Key's music. For the OP, ED, and some of BGM, i think it's not Key's work. Boy's be Smile, the main OP of LB! Refrain, is deccent and nice to hear it. the lyric is describe what will happen in LB! Refrain. Kimi to no Nakushi Mono, the main ED of LB! Refrain is deccent, too. It's like Clannad AS, who has melancholy music in OP and fun music in ED. For BGM, is good but there are some mistaken place of BGM and the moment.\\n\\n\r\nCharacter:\\n\r\nYou need to watch Little Busters! first if you want to know the detail of LB! Refrain character. Some character also missing like Futaki Kanata, A-chan, and Sasasegawa Sasami, who will play in LB! EX. Overall is good.\\n\\n\r\nEnjoyment:\\n\r\nLB! Refrain is enjoyment because the story has one goal and have the storyline is forward. Not really lack and it brings a moral value for us.\\n\\n\r\nOverall:\\n\r\nLB! Refrain has a potential to make you cry. But there are some missing. And i really appreciate for J.C. Staff because they has improved the quality of the art rather than the prequel, but they also cut of the great moment in LB! VN. In Little Busters! Refrain, you can find the moral value.\\n\\n\r\nThis is my review. I hope my review is useful for you.",
            "date": "2015-01-27T12:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 179068,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776581.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IrohaUtsugi",
                "username": "IrohaUtsugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179068"
        },
        {
            "content": "*No Refrain spoliers*Now i played the VN and little busters changed the way i lived entirely and has always had a place in my heart and the anime is now exception\r\nStory:10/10 Now unlike in the first season of little busters.Refrain is changed in NO way from the VN the only thing missing are the alternate endings to refrain which if you LOVED little busters and refrain i recommend you pick up the vn on steam (not released as of this time if you are reading this at a later date check)however one thing i noticed is that key might have noticed that refrain in itselfwas to short to make it into a anime by itself so they included Kurugaya's and Rin's (part 2) Route into refrain to make it long (refrain if it was by itself would only be like 5 episodes of content) and the problem i have with this is how again they kinda changed Kurugaya's route to match the story layout of the anime but besides that thats the only problem i have with the story of refrain.\\n\\n\r\nArt:10/10 The art hasn't changed from the first season but the scenes are amazingly beautiful and breath taking.\\n\\n\r\nSound:10/10 If you've played the VN or seen the first season(which i hope you have cuz theres season one spoilers in this review)the music is just appealing to the ears and i still listen to the soundtrack of the VN and the anime from when i first saw the anime and read the VN in 2013.\\n\\n\r\nCharacter:10/10 Now without spoiling anything Refrain just ties everything together bout the characters there friendship,hardships and worries all come together in refrain.\\n\\n\r\nEnjoyment:10/10 Well i just finished watching Refrain and i have a shotgun blast size hole in my heart and my face is full of tears...........i f**king love little busters.\\n\\n\r\nOverall:Why are you still reading this if you've seen the first season GO WATCH REFRAIN LEAVE and if you seen refrain you are welcome for cookies and milk and a box of tissues all provided by the great Saigusa-san..........I'm sorry but seriously its worth a watch if you've read the VN and enjoyed the first season.\\n\r\nThanks for reading!! Also RIN X RIKI FOREVER X333333... Ok ill see my self out now.",
            "date": "2016-04-19T18:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 216716,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4472009.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Salmo69",
                "username": "Salmo69"
            },
            "url": "https://myanimelist.net/reviews.php?id=216716"
        },
        {
            "content": "Little Busters! has been quite a ride. From the first season when Kyousuke invites us to partake in his missions, to the second season where we are disillusioned alongside Riki & Rin, and made to face a harsh reality. Refrain! brings an emotional end to this journey as a sequel that teaches a lesson. \r\nThe story of Refrain! is a sequel to the first season, Little Busters!, where Riki and Rin embark on a path as they become disillusioned by the truth of the world they live in. Continuing their pursuit in discovering the \"Secret of the World,\" they are met with revelations of tragedythat they must overcome. It is a story that has been given a dose of the traditional KEY, a visual arts studio, supernatural elements to it. These elements are blended into such themes as \"growing up,\" and \"becoming stronger,\" among other motifs, that seem to centralize on the idea of adolescence. In essence, this is a story of friendship of the main Little Busters gang, as well as Riki and Rin's maturity and how they must bear leaving their childhood behind. In the bulk of Refrain!, the focus of the story is narrowed down to five main characters- Riki, Rin, Masato, Kengo, and Kyousuke. Each character whose actions and rationalizations are symbolically linked to how people tend to face the concept of adolescence. Riki and Rin are the two who go through this process of growing up. They are challenged by Kyousuke and Kengo who exemplify different approaches to adolescence, while Masato acts as the neutral man between the polar ends. In detail, Kyousuke represents the parents who want their children to develop their strength and become independent enough to face reality. Kengo represents the parents who want to shelter their children and protect their innocence from reality. \\n\\n\r\nWhat really made me fall in love with Little Busters was the character interactions as well as their inner thoughts. I believe this is where the Little Busters excel the most at. A noticeable improvement from the first season is the better animation and focus on each character's emotions and their reactions. To name a few- Kengo and Kyousuke's altercation, and Kurugaya's out of character rage were conveyed and executed so well that it sent shivers down my spine when I heard their outbursts. Another instance of great execution is during the Little Busters' final baseball game where Kengo and Kyousuke break character from their usual stoic demeanor as they burst in to tears. That and the animation that accompanied their breakdown also brought me to tears as they, and the audience, take the full brunt of emotions over the realization of their departure. I also must credit Kyousuke's episode which is dedicated to his monologue; Kyousuke's trembling voice and tonal shifts along with his reaction to his own reflection was stunning to me. While not up to par, to me it was reminiscent to Kyon's self-questioning monologue in Disappearance of Suzumiya Haruhi.  All of this is to be attributed to the spectacular work of the voice actors and the ability to animate what were originally still images(CGs) from the visual novel. However, not all scenes were done well and to say the characters were done perfectly would be a lie. There were several scenes that appeared as if their emotions were out of place if not forced. And while such scenes may have been the result of pacing issues, it is unfortunate to see characterization suffer as a result of pacing a one cour. That said, despite some parts being rushed, the characters were incredibly well done.\\n\\n\r\nOne thing that really stands out about Key works is Jun Maeda. His music seems to strike all the right chords during the right moments in these adaptations. This wouldn't be possible however, without Rita. The two worked together on the music for the VN, and while bringing it over to an adaptation still conveyed the right emotions during the animated scenes. While the music was fantastic, the sound department was lacking. I'll be a bit nitpicky here but sound does encompass background noise. Little nuances like having the sound of thunder/lightning/firework come at the same time as the light is simply lazy editing that could have been avoided. This, as well as certain sound inconsistencies aren't too noticeable, but nonetheless makes the overall adaptation seem lazy.\\n\\n\r\nLittle Busters: Refrain! has set the bar of expectations high for its adaptation due to the loyalty of the fanbase towards the Visual Novel. As a result, people who are only interested in the anime are given this illusion that the adaptation will grant the same feelings and emotions that were evoked from the VN. While the effect is different for every person, keep in mind that one shouldn't compare works made with a different medium. This is the trap that visual novel readers tend to create for adaptations, and the same applies to adaptations of light novels and mangas. So take Little Busters! Refrain as its own story, it was well done and conveyed what it wanted despite small inconsistencies here and there. \\n\\n\r\n8.5/10",
            "date": "2013-12-29T03:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 126133,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2799905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jammin_Rabbit",
                "username": "Jammin_Rabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=126133"
        },
        {
            "content": "Usually I do reviews following more technical matters but in the case of Little Busters!: Refrain  I feel it's more important to talk about it's impact and it makes you feel. All in all Refrain is a great sequel that tied all the unknowns of its prequel in an outstanding way. However just like its prequel, the concept is splendid but suffers from some execution mistakes. There are behaviors you can't understand and things that seem to short due to lack of depth in the arcs. However all of this is forgivable if you consider the way it strikes your senses. With its moreserious vibe, Refrain is a powerful tearjerker.\\n\\n\r\nNow let me tell you the feelings this series provoked on me. \\n\\n\r\nTo me little busters is about friendship something that we seriously lack in Anime. Friendship is always a side to romance, girls always fight for a guy and guys can never have 'bromance' without it being depicted in a humorous ways. Little Busters! breaks all of those being about just a group of friends spending their days having fun and solving their problems to become stronger. Due to this, all characters grow together and so do you. It's truly refreshing to see a series like this which comedy doesn't rely on outrageous situations or sex appeal (in most cases) but to the crazy interactions between characters. I guess it kind of remind me of my school days, when i also used to do idiotic things and care way too much about transient matters. I relate to their group and recall the days that i used to be like that. What and idiot i was but what a fun i had!\\n\\n\r\nAnd then through unexpected twists the series gets serious. I don't want to spoil anything but seeing this group of characters go through hard situations you can't help but to relate and feel sad. It made me want to just call my friends and tell them i miss them.\\n\\n\r\nTo me Little Busters! is a reminder of our youth, how great it is and how short and fragile it can be.",
            "date": "2014-07-11T18:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 151589,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302249.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jchang",
                "username": "jchang"
            },
            "url": "https://myanimelist.net/reviews.php?id=151589"
        },
        {
            "content": "Our past shapes who we are. \r\nReally. It’s that simple. And this is what LB Refrain is all about.\r\nAfter watching the first season of LB, I was seriously looking forward to the second season of LB. In the first season, you had a series of arcs that centered around nearly all of the LB’s new additions. These arcs – even though they used supernatural/surreal plot elements that were presented in a very Key-/visual-novel typical fashion – did flow surprisingly well as they were all built around the same common themes: friendship and identity. Sure, not too much character development for the original five members ofLB (although there was some for the new additions, but definitely not fully flushed out – after their arc was over they didn’t change much anymore), but the plot was definitely solid. \\n\\n\r\nBut damn, the second season – talk about wasted potential.\\n\\n\r\nThe second season is the complete opposite: strong character development, but a super weak, unsubstantiated (haha get it because my username) plot.\\n\\n\r\nThe second season was arguably more moving and emotionally stirring than the first season, but to achieve this, it introduces a series of plot elements that are (1) poorly transitioned, (2) out of the blue, and (3) very deus ex machina. Sure, the same themes that were present in the first season are also here in the second season, but the plot (despite being built around these themes) is executed much, much worse than the first season. Kyousuke’s “powers”, for one, came out of nowhere. There were no hints during the first season that alluded to what Kyousuke could do. In the first season, Riki and Rin were only given “clues” and Riki knew something was up with Kyousuke, but we, as the viewers, are not given sufficient clues to Kyousuke’s true powers until halfway through the second season.\\n\\n\r\nAnother example of poor transitioning is towards the last three episodes when Riki and Rin “switch” worlds. If you’re just another average anime watcher like me, these last three episodes were pretty hard to follow. When you think Riki and Rin finally left the “fake” world into the “real” one, somehow, just somehow, one of them is able to transition back into the “fake” world to search for some lost clues. This transitioning was not only hard to follow, but personally I thought the “fake” world disappeared because of Kyousuke’s lack of control over his powers – so how are they able to go back into the “fake” world? Again, there are some plot elements like these are not fully explained and thus left me extremely confused.\\n\\n\r\nAlthough Kyousuke’s little monologue towards the end of Refrain does string together these weird supernatural/surreal plot elements together, by this point in the series the damage is already done. Everything seems too coincidental, too artificial, and too forced for anything to seem even remotely coherent.\\n\\n\r\nOne more downside: the new, supporting members of LB play a significantly less role during the second season. They were pretty much the entire basis of the plot throughout the first season (since the friendship theme was only primarily explored through their presence); in the second season, they simply fall out of the picture. If they were better incorporated into the second season I feel like Refrain could have been even more impressive.\\n\\n\r\nThe plus side: very strong character development that is blatantly and obviously pointed out by Kyousuke. Throughout Riki and Rin’s arc, Riki and Rin grow, mature, and do what even Kyousuke thought was impossible. This character development is fully flushed out and is substantially better than the first season. Definitely a nice way to tie the entire series off.\\n\\n\r\nAlso: the art is still crisp and never ceases to amaze me. (Go J.C.Staff!) Some of the soundtrack is recycled from the first season, but the voice acting is still on point. No major complaints on that front.\\n\\n\r\nSo, to summarize, what is LB Refrain? It gives you feels just for the sake of feels and does so through a series of plot elements that doesn’t make any sense.\\n\\n\r\ntl;dr\\n\\n\r\nPros:\\n\r\n+ Strong character development\\n\r\n+ Emotionally stirring\\n\r\n+ Strong thematic content that was present in the first season and also in Refrain\\n\r\nCons:\\n\r\n- Questionable plot elements that are poorly explained/linked\\n\r\n- Although the characters are developed well, the plot does not have an equal level of depth\\n\r\n- Poor transitioning \\n\r\n- Hard to follow, especially towards the end of Refrain\\n\r\n- Supporting members drop in significance \\n\\n\r\nStory: 4\\n\r\nArt: 6\\n\r\nSound: 4\\n\r\nCharacter: 7\\n\r\nEnjoyment: 6\\n\r\nOverall: 5",
            "date": "2015-12-18T17:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 205926,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=205926"
        }
    ],
    [
        {
            "content": "Being the second season of Little Busters,I was not expecting the darker themes Refrain would offer.But,nevertheless I consider Refrain to be an improvement from the first season.\r\nStory:9/10\r\nThe story is balanced, wherein the routes shown in Refrain,are characters who do not have a route in the previous season.The story may be confusing at times due to plot twists,but all will be explained,as the story progress.I love the complexity of the plot and the depth the story exhibits.\r\nArt and Sound :8/10\r\nI love the improvement of the art.The soundtrack is more melodramatic and less upbeat compared to the soundtrack of the first season.signifying its change in genre.\r\nCharacter:9/10\r\nKurugaya getsfocused on her route,and the original Little Busters get more development and characterization.I love the fact,that Kengo and Masato,whom I feel,are bland characters,gets to have more screen time.and how Riki and Rin grow to be stronger characters.\\n\\n\r\nEnjoyment:10/10 \\n\\n\r\nI enjoy Refrain a lot, more than the first season.Especially with the darker theme and \\n\\n\r\nOverall:9/10\\n\r\nLittle Busters Refrain is a great sequel,and is worth to watch.",
            "date": "2015-05-09T07:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 187438,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3750643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MaeSis",
                "username": "MaeSis"
            },
            "url": "https://myanimelist.net/reviews.php?id=187438"
        },
        {
            "content": "Muscles or Physics?\r\nAround two months ago, I took a try at the Little Busters visual novel. So I downloaded the 3 GB file and I played through it. I have one word.\r\nAmazing.\r\nThe visual novel was beautiful in many aspects. It had some great comedic scenes like the 'Loli-Loli Hunters', the Muscle Sensation, and other laughable parts. Then there were the feels, with the character routes and Refrain, the true route of LB.\r\nThis review will be about the anime adaptation for Refrain.\r\nSo, this fall season, after the JC Staff announced the second season for LB after their first 'mediocre' season, I took a try at theVN. I had not watched the first season anyways, so I didn't know shit. There. \\n\\n\r\nSo after being blown away by the Little Busters visual novel, I took a try at the JC Staff version.\\n\\n\r\nLets just say... it was good, but not as good as I was expecting.\\n\\n\r\nThe story for Refrain is directly adapted from the visual novel, making it beautiful and, well, great. With a ton of plot twists and tear-jerking scenes, the story for LB is better than most anime out there. I can't go into detail for this or the whole thing will be spoiled.\\n\\n\r\nHere's a big downfall for Refrain. The art. JC Staff is famous for their, cough, 'mediocre', cough, art. Refrain was a big step up from their first season of LB, making this anime more decent for the eyes. Still, the art can't really compare to the visual novel. Heck, I really wanted this to be remade by KyoAni, I would give that an eleven or twelve. \\n\\n\r\nBack on topic, the art for Refrain is decent at best. I still enjoyed it, but deep inside of me, I still wanted it to be a bit better.\\n\\n\r\nThe sound for both seasons of LB are taken directly from the VN, even the OSTs. All credits go to Jun Maeda. The exception was the opening for Refrain and 2 of the EDs. Sort of surprising, wasn't expecting it. I still liked it, and it still matched the mood of LB a bit.\\n\\n\r\nAnyways, the soundtracks for Little Busters are very nice and they almost always match the theme of the scenes. Jun Maeda is a great composer, and Rita is a great singer.\\n\\n\r\nThe characters for LB, simply amazing. Mostly extremely likable, GO KURUGAYA!!!\\n\\n\r\nOkay. Each character gets development, and anyone can grow to like at least 5 of them after finishing the series. Even the guys.\\n\r\nSadly, I cannot go into much detail for the characters because many of their personalities affect the story.\\n\\n\r\nI enjoyed this even though it did not live up to my expectations. I even marathoned the first 10 episodes, being the Little Busters fanboy I was. It was a nice ride, and now it's over.\\n\\n\r\nOverall, play the visual novel first. After that, watch Refrain. Don't even watch the first season. Just follow me.\\n\\n\r\n9/10\\n",
            "date": "2013-12-28T12:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 126039,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2344457.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Moonsolol",
                "username": "Moonsolol"
            },
            "url": "https://myanimelist.net/reviews.php?id=126039"
        },
        {
            "content": "Probably, like most of Visual Novel readers, I feel this anime adaption not adequate enough to meet my expectations. \r\nI feel this adaption is disgrace for the company that made Kanon, Air, Clannad, Little Busters and Rewrite and made our heart race during the whole show.\r\nHowever, even with all this, the experience of Little Busters! : Refrain is a very UNIQUE and RECOMMENDED experience. Why? read this review.\r\n==Story (9/10)==\r\nAs KEY production, just like always KEY made us expect. You're going to share both of great moments and sad moments during the show. So it's really recommended to prepare handkerchief before watching the latest episodes.\r\nBut ifyou're looking for crying and not morals, sorry dude, wait for either a better adaption or look for other KEY animes.\\n\\n\r\nThe story is about 4 boys, 1 girl forming together a great bond of friendship. Together they formed a small team \"Little Busters!\" which was later joined by 5 more girls that made a great combination. So far, so good, that's season 1. \\n\r\nHowever, It's clear that things aren't normal in that world: Like a cat giving missions, accurate predictions of future and even more, an endless day, weird memory loss and disappearence of people. \\n\\n\r\nWhat's going on with this world? What's the secret of this world? Who's exactly Kyousuke? Is he really the one behind everything?\\n\\n\\n\r\n==Character (10/10)==\\n\r\nAs you all know, little busters! is a team of 4 boys and 1 girl, later joined by more girls that do nothing but roaming around, playing and playing baseball.\\n\r\nThose are the leader, the muscle idiot, the Kendo idiot, the shy girl and the weak boy (no spoiler for those two later characters... just 'CHANGE') .\\n\r\nThe group is later joined by 5 other girls: The Happy-Go-Lucky, the silent bookworm, the pervert genius, the wafu and the cheerful \"Everything is alright\" girl.\\n\\n\r\nThis combination is very amazing, It fits those who are looking for actions, leadership, pervery girl, moe, cheerful girl and of course comedy and targedy!\\n\\n\\n\r\n==Sound (9/10)==\\n\r\nWell, the soundtrack is by KEY. The music is amazing but not _THAT_amazing, Although some if heard again can get you to the depth of depression.\\n\r\nWe have both of electric/piano and Calm/Noisy sound track. If you loved Clannad OST you'll with NO DOUBT love this.\\n\r\nMost of Sound Tracks are well placed except in many episodes. \\n\\n\r\nThe Seiyuu did their best in the show. Things can be voiced more dramatically especially in episode 10 and 2, but I can't complain. Overall it's 9/10...\\n\\n\r\n==Art (8/10)==\\n\r\nThe Art. Let's just say it's ruined.\\n\r\nDon't misunderstood me, I didn't say it's terrible but, it's good yes. However for this show, I feel like it needed more love from key animators.\\n\\n\r\nThe character design is a little dull compared to the big eyes in Visual Novel. However, it's good enough.\\n\\n\r\nCertainly, the animation \"film effects\" are good. But It feels like people are jut forced to do the work, there is no deep affection. Art erm... shall we pass this?\\n\\n\\n\r\n== Overall (8/10)==\\n\r\nIn one word \"KEY\" anime.\\n\r\nBut KEY usually means 10/10. Yes, I'm NOT satisfied with the adaption, to put it in one sentence. And I'm really waiting for a better adaption in the future. This is Jun Maeda's last/latest work, that would mean it should better than Clannad and similar to Angel beats. But see the difference in scores.\\n\\n\\n\r\n== Enjoyment (8/10)==\\n\r\nI'm definitely NOT satisfied with the adaption, however, I really enjoyed it (except of the last episode , I felt like punching myself). \\n\r\nYou'll really enjoy the other 12 episodes, I don't guarantee it I'm sure of it (for most tastes I mean).\\n\\n\r\nFinal words,\\n\r\nIt's a good experience that you won't regret. Similarily goes with KEY works. Whether you're a fan of comedy/tragedy/school or not, it's definitely a great experience and I really recommend it.",
            "date": "2013-12-29T03:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 126131,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/461060.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lightningfalcon",
                "username": "lightningfalcon"
            },
            "url": "https://myanimelist.net/reviews.php?id=126131"
        },
        {
            "content": "SPOILERS\r\nThis anime, right here, is the single biggest improvement from a season one to a season two I've ever seen.\r\nSomething I hate in anime is when fans compare an anime to a different anime, just because it was made by the same company. Whenever a new show adapting a key visual novel is announced, everyone just instantly compares it to Clannad and Clannad after story. I think this is unfair, because this show, while having many very similar aspects was its own show and should be taken as such. Anyways, onto the review. Little busters was a nice little high school drama show, but sufferedfrom unoriginality and some of the sad moments felt forced to me. This is all fixed in the second season, where all the buildup done in season one pays off for a very satisfying conclusion.\\n\\n\r\nStory- *MASSIVE SPOILERS AHEAD* 9.5 (rounded to ten on the ratings)\\n\r\nThis story took everything wrong with the original's story, and fixed it. It took the biggest problems, the unoriginality, and got rid of it. This follows directly after season one, and really just changes things up immediately. It starts off a bit slow, but then immediately really picks up. Once Riki realized that Kyouske was the one who sent Rin off to the other school, he completely hated Kyouske and for a while it looked like he was going to be the main villain. A very well done red herring. Another awesome idea was the plot twist in episode 11. The plot twist in episode 11 completely shattered the foundations and destroyed everything you thought you knew about little busters, and really was just well executed and unexpected. It also seems to have much more mystery than any other drama I've seen, which I commend it for. Everything that happens happens for a reason, and it comes together to make one of the best stories I've ever seen in anime.\\n\\n\r\nArt-8\\n\r\nThe art style for this show is good, the animation is nice and fluid, and everything just worked well. The problem is that nothing about this stands out, it just all seems plain and like all the other key adaptations. Not bad, actually its good, but it didn't do anything new.\\n\\n\r\nSound- 9.5\\n\r\nThe soundtrack for this anime was just amazing. There were many amazing songs, but the real stand out ones for me were lamplights and boys don't cry. Boys don't cry was Kyouske's theme, and it really sums up his character very nicely and was just nice to listen to. Lamplights however, is one of my favorite songs in any anime. It reminds me a lot of Lost My Pieces from Toradora, another one of my favorite songs and it just gives me the feels so much when I listen to it.\\n\\n\r\nCharacters- 10 (Spoilers)\\n\r\nThis is, without a doubt, Little Busters strong point. Little Busters Refrain has possibly my favorite cast of characters in anime history, they are all just amazing. Riki is a fairly normal main character, but the rest of the characters are amazing. Rin starts off really shy and not wanting to see the world, but she gradually opens up and becomes a likable female lead. Inohara seems to just be a dumb muscle head, but he turns out to be very well developed and more than meets the eye. Kengo is the exact opposite of Inohara, he looks like a calm and collected martial artist, but is actually very simple and not that smart. Finally, there is Kyouske. Kyouske is one of the best characters I've ever seen in an anime. He kind of reminds me of Kamina from Gurren Lagann, my favorite character of all time, because he always seems to be leading people and tries to help people improve themselves. In season one, he was very upbeat and was kind of a badass. However, in season two so much stuff happens with his character. At some points they make him look the villain, and quite a formidable one at that. He always knows what is going to happen and what is going on in the world somehow. However, he is actually just a very nice guy who wanted Rin and Riki to grow up before facing reality and making it so they can stand on their own.\\n\\n\r\nEnjoyment- 10\\n\r\nI enjoyed this anime so much. All of the characters and the way they interacted really just made this a fun watch and kept me watching.\\n\\n\r\nOverall-9.2\\n\r\nThis anime was a fun watch with a great story and fantastic characters. If you haven't seen it yet, I would highly recommend it, it's one of the best dramas I've ever seen. It is very sad, but an extremely interesting and fun watch.",
            "date": "2015-04-14T11:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 185616,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4469753.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Willthemost",
                "username": "Willthemost"
            },
            "url": "https://myanimelist.net/reviews.php?id=185616"
        },
        {
            "content": "So you've watched the first season of Little Busters! Did you find the first several episodes to be a little bit tedious to get through? So did I. But I'm so glad I watched it... Because since I finished season 1, I got to experience the masterfully written story of Refrain. Definitely a Masterpiece in my opinion. \r\nStory: The story is direct follow up of season 1, and now all that build up of character development really comes into play and has so much impact. There is so much emotion in season 2.\r\nArt: There wasn't a significant change in art, and that's a good thingbecause the art is just as good as it was for season 1. Maybe various times you might see some improvements.\\n\\n\r\nSound: Much like season 1's sound, the sound for season 2 is once again amazing.\\n\\n\r\nCharacters: All that character development for season 1 leads us here, and now we get to explore the relationships of the five original Little Busters at a much deeper level.\\n\\n\r\nI absolutely loved this series. I felt it wasn't as humorous as season 1, but that's just fine. In fact, it's perfect, because season 2 has done exactly what I think it set out to do.",
            "date": "2018-09-17T00:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 289226,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289226"
        },
        {
            "content": "I'm pretty disappointed for the 1st season since the drama is so weak and the plot didn't touch my heart at all. Nevertheless I got a really high expectation for the 2nd season since it got a pretty high score on MAL.\r\nAnd after I finished this I could say that it's a huge improvement from the 1st season, the plot is really touching and finally it succeed in making me cry. Just watching the 1st episode got me asking is it really the same series since the atmosphere is so different. A little bit downside is that the ending is predictable since the episode beforethe final kinda make it obvious.\\n\\n\r\nThe animation is beautiful while the music is overally good but could be bettter as in some sad scenes the music is too quiet and didn't add enough suspense for the scene. \\n\\n\r\nFor me it's still not as good as Clannad After Story or Angel Beats but overall a great anime and It's really worth it to watch through the 1st season for this.",
            "date": "2018-09-14T03:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 288956,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7313557.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SenpaiDray",
                "username": "SenpaiDray"
            },
            "url": "https://myanimelist.net/reviews.php?id=288956"
        },
        {
            "content": "Little Busters Refrain! is the second season of the Little Busters anime. The show is based on a Key visual novel, and if you know what that means, then you know what to expect.\r\nFor those unfamiliar with Key or visual novel adaptations, the series plays out the plot line from a dating sim-type video game, where the protagonist builds relationships with multiple girls.  Little Busters follows a young man who meets several people and helps them overcome personal tragedies so they can all play baseball. Most visual novel adaptations have an emphasis on romance, where the story arc of each girl has them fallingin love with the main character. Little Busters is more focused on friendship, which is a nice change.\\n\\n\r\nI would say that it is important to see the first season before watching Refrain because you won't know who any of the characters are otherwise. Like other Key adaptations, this show pulls on the heartstrings and can be very emotional. I enjoyed the experience the characters went through, and the struggles they face are real world issues. Without getting into spoilers, I have mixed feelings about the ending, which deviates from the story of the game. Overall its a good drama with themes of friendship. Worth the watch.",
            "date": "2015-02-09T05:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 180011,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445780.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JosChaMur",
                "username": "JosChaMur"
            },
            "url": "https://myanimelist.net/reviews.php?id=180011"
        },
        {
            "content": "Have you caught up from the first series?! Little Buster?!\r\nWell get ready for the second part!\r\nThe opening and ending is still a great things to hear.\r\nIn this case your upto date ,I know it is only 13 episodes but it is worth watching!!\r\nGet ready for a twist of fate because even I didn't expect it,but it happened.\r\nOne thing is don't regret being with your friends.the bonds you created and times you spent .\r\nWell for me if you watched until the ending of the Little Busters , this season will makes sence,watching it will make you think and guess ,what happened?!\r\nWhat is the secret to thisworld?!\\n\r\nThe little notes Rin gets from the  cat Lennon are to be explained.\\n\\n\r\nThe scenery is always so beautiful ,so touching and the characters arcs just keep getting better and closer to the truth,and it is a stage and something to see through just like the main character.",
            "date": "2014-05-07T09:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 142583,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RosyXkid",
                "username": "RosyXkid"
            },
            "url": "https://myanimelist.net/reviews.php?id=142583"
        },
        {
            "content": "After the predictability and lightheartedness of the first season I was pleasantly surprised with the story and tone of the second season. The characters were definitely developed better and there was more of a purpose or driving-factor to the story line. \r\nI feel like the message gets a bit jumbled up in the works. Riki and Rin are the focus of LB Refrain, and we watch them progress as the plot unfolds. I feel like much of what they learn is lost however in the end of the series. They finally learn to face reality as it is, but then the story lets itself offthe hook and creates something that just feels rushed. I would have given LB Refrain a significantly higher score if it weren't for the last episode.\\n\\n\r\nThe whole series was entertaining to watch, and had some fantastic characters. It's a shame that the ending is the way it is, but I guess audiences will definitely eat it up.",
            "date": "2013-12-30T04:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 126293,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1505317.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-pyrrhomaniac-",
                "username": "-pyrrhomaniac-"
            },
            "url": "https://myanimelist.net/reviews.php?id=126293"
        },
        {
            "content": "When I started watching Little Busters back from the very first episode in the first season, I was not really satisfied with the plot and character development. At first it seems that the whole season was only filler and there is no actual goal for the plot. The first season almost had me dropping the series because it was too cliche and the story is somewhat predictable. Continuing into the next season, things took quite a turn and the plot became something entirely different. It's like I was watching a different anime because of the shift in the story line. Season 2 however explained thewhole plot of the series in the end and all questions are answered. The ending is great and the drama did its job. Overall, this anime is worth the time so you should check it out if you're into drama and comedy.",
            "date": "2017-10-03T04:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 259556,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=259556"
        },
        {
            "content": "(This is a review of both Little Busters and Refrain)\r\nThe Key formula could never be simpler. A series of heroines suffer through certain traumas, go through certain epiphanies and realizations with a little help from their friends, and all of it works its way to one grand finale, making use of fantasy or magic, to become a culmination of everyone’s efforts. This way of writing a story isn’t particularly special to Key either, being an innovation on how to adapt the Visual Novel style of common route and heroine routes into an animated linear format. Within the structure there are many variations. Clannad chose toextract the main protagonist and heroine from their friends and focus itself into a very tight family drama. Steins;Gate chose to tie the whole structure in with a paranoiac and focused sci-fi thriller. Little Busters, and Refrain, chose to abstract all concrete elements from a basic story of friendship (at least Refrain did), to make an atmospheric slice of life drama following the footsteps of KareKano and Ef: A tale of Memories. A strange movie comparison I can think of to Little Busters is Hitchcock’s North by Northwest, which was a Hitchcockian thriller that removed most elements of realism and conjunction of plot to create a spy fantasia that would be precedent to most James Bond films or even the extreme cynical abstract noir film Branded to Kill. Refrain’s ending is even comparable to North by Northwest’s ending.\\n\\n\r\n\tBy abstracting the plot in such a way, Little Busters becomes a kind of nostalgic fairytale, even having some underpinnings of Nietzschean allegory about the Death of God, or moral redemption tale. But to try to excavate a ‘meaning’ from Little Busters would lead me to speculate and overreach into a wide amount of tangents, which quite frankly is not the focus of this review.\\n\\n\r\n\tKey animes have always been about texture; that is the texture of the voices culminating with the rosy romantic art style and poignant music. When seen with the judgment of a person who longs for realism and ‘plots that make sense’, the series definitely falls apart, being too easy with its psychological family past traumas and its easy tragic situations of death and demise. In Little Buster’s case, the plot is wholly there to back up the atmosphere.\\n\\n\r\n\tWe can classify certain series or movies together based on the styles of their atmosphere, as opposed to their plot elements. Kimi ni Todoke and Ao Haru Ride are examples of the ‘pastoral romantic’ kind of dramas, where everything seems a tad bright and impressionistic, and the background and drawings are always a bit sketchy and have a childlike nature to them. Little Busters falls under that special category of ‘gleam romantic’ anime like White Album 2, other Key works, and, most importantly, the works of Makoto Shinkai. Makoto Shinkai is basically the ultimate pinnacle of the ‘gleam romantic’ style, being himself trained through making the opening movies of Visual Novels, which is a medium that frequently makes use of gleam and strong light-shadow delineations to develop a beautiful style. In White Album 2, I was amazed that much of the first episode takes place under the shelter of a bright orange dusk; such atmospheric spaces are common in ‘gleam romantic’ anime.\\n\\n\r\n\tSo the power of Little Busters rests on those moments such as Komari and Riki under the starry sky, or Riki and Mio at the beach. The problem though is that Key’s general method of writing Visual Novels involves throwing out different arcs to a bunch of their other writers and leaving Jun Maeda to clean up the mess in the ‘afterstory’ or main arc. This means that we have long stretches of banter which pad out the plot, ruin the atmosphere, and don’t even contribute much to characterization, while most of the character development arcs have plots so ludicrous, going from oppressive and huge Japanese family plots to a crazy post-Soviet USSR Cold War tension rebellion plot. Even the most beautiful hallucinogenic moments, like a walk through a stream inside a cave leading to a wide purple pink orange seascape, is undermined by the inability for most to suspend disbelief at the sheer insanity of the events that just took place.\\n\\n\r\n\tThe most cohesive arc in the first season is probably Mio’s arc. It’s the arc that makes the most use of abstraction before Refrain, with its Swan-Sky-Sea metaphor and its magic plot involving a Double, the same as the many doubles strewn throughout Borges, Nabokov or Dostoyevsky. When Refrain really starts though, it becomes a great but flawed culmination of ‘gleam romanticism’ and abstract Annoesque or Shaftesque experimentalism. Real spaces and realism is eschewed for elliptical montages and colourscapes. Dusk skies become more beautiful, as like the riverbed scene with Riki and Rin. Action is made to match the music and some scenes really flow through brilliantly.\\n\\n\r\n\tIn Refrain, words are less like words and more like mantras. All the boundless optimism and talks of friendship seem generic, if not for the fact that, within the abstract atmosphere of the series, it becomes like terse poetry flowing through a sound-image collage. When cut away from the silly comedic atmospheres, zany plots, and relentless meaningless banter, are when those moments really shine through. It also contains the best possible way to pull off a recap episode, making it seem less like a recap and more like a reorientation of previous events. \\n\\n\r\nThe problem is that Little Busters is a show that likes to explain itself too much, and dampens atmosphere with great loads of exposition, and also wants to please the audience too much, which leads to most of the cheaply entertaining moments. It has an ending that may cause ruptures in the same way Clannad’s ending caused ruptures among the fanbase, even as a fantasy plot or a fairytale. I have no qualms about the substance of the ending, except in the flawed execution, as if they were trying to speedily tie up all loose ends in a wholly unsatisfying way. North by Northwest’s ending was a playfully brilliant one that made full use of the medium it was working in. Refrain ended in a way that cheaply tried to invoke stable emotions but only served to dole out confusion and a lack of closure.\\n\\n\r\nSometimes its great to have shows that are unashamedly melodramatic and fight with relentless optimism. Sometimes its great to have shows that teaches morals which have long become clichés and are naïvely overwhelming. Yet these shows require an absolute and focused purity of execution in order to convey all the feelings it wants to convey without tripping over itself in complete disbelief. \\n",
            "date": "2015-01-09T19:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 177127,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/439808.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/czxcjx",
                "username": "czxcjx"
            },
            "url": "https://myanimelist.net/reviews.php?id=177127"
        },
        {
            "content": "I’ve waited a few years since its release to watch Little Busters and Refrain. At first, I was very skeptical. I had heard that LB was good, but not great, nothing new to write home about. So I wrote it off after the first episode and moved on to the next thing, even knowing that it was a Key adaptation (and I do love Key adaptations). I had it suggested to me recently, and I was surprised. I had only paid any mind to the negative aspects of the show and hearing something positive threw me for a loop. So, I decided to give ita chance. And I am beyond thankful that I did.\\n\\n\r\nSince this is technically a review of Refrain, I’ll keep my thoughts on the first season brief: it does a fantastic job of preparing you for the second season, as far as character interactions and building of the world, and also creating an attachment with them. I believe that without the first season, the second would not have nearly as much of an impact as it did, and so I am thankful for its existence, even if it isn’t as strong as the second season.\\n\\n\r\nNow, for the actual review. (Note that I have not played the VN, so I won’t be comparing the two.)\\n\\n\r\nRefrain is, in a single word, wonderful. In many words, it is wonderful, beautiful, insightful, creative, fun, inspirational, hopeful, enraging, and so much more. The show shines in so many ways, from the lovely storytelling to the soundtrack. Though I think the real strength of the show is the characters. Though Refrain focuses mainly on the main five, I can appreciate the way the rest of the group was handled in the show, even if they were not the main focus. They were not tossed aside, and even if at times it seemed like they were, there were always things to give you the feeling that they were watching over the others as they grew and changed. For that, I am thankful. As for our main cast, Refrain is where we get the majority of their characterization. Masato is no longer just the idiot who is constantly teased, Kengo is no longer just the distant competitor, Rin is no longer just the shy and awkward girl, Riki is no longer just the uncertain follower, and Kyousuke is no longer just the fearless leader. Though these traits remain, the truths behind why they are the way they have become are revealed, and in a beautiful fashion that garners respect for each and every one of them. Though they all shine like stars, I would like to note Kyousuke and Rin in particular. His character development is superb. As a viewer, I constantly found myself drawn to him, often conflicted, trying to decide whether I loved him or hated him. He raised more questions than any other character, and also generated the most emotions in me personally, though others may disagree. In the end, I can gladly say that Kyousuke is my favorite character in the Little Busters series. Not to be outdone though, Rin’s character development is also incredible. Though it is slow throughout the first season, the way she changes through the second is amazing as well. It almost evokes the feeling of a parent watching a child grow, gradually becoming stronger and more mature as time progresses. Her main episode toward the end of the series really drives these feelings home, and really solidifies just how caring and lovable Rin really is.\\n\\n\r\nI’m not the best judge of animation, but I would say that the quality was generally solid. At times it was able to enhance the show, but mainly just served as a stepping-stone for greatness to be built upon. Even so, I have no complaints. The soundtrack, however, was beyond expectations. Though there weren’t too many tracks on the OST, the few that were included fit the show’s ambiance so well that it could only serve to move the viewers even further than if they had not been. I rarely find myself completely satisfied by a soundtrack, but this time, I have no real weakness that I can point out within it, only strengths.\\n\\n\r\nMaybe you are thinking the way I did: if the first season isn’t so great, I shouldn’t bother watching it, even if the second season is good. For those of you on that train of thought, I would like to tell you how much you are missing out. Sure, the first season is weak, but it is by no means bad. The characters are likeable and the story plays out well, and it could stand on its own if it needed to. But the addition of Refrain only leads me to urge those thinking this way to give the show a chance, even if they aren’t exactly certain about its quality. The second season makes up for the weaknesses of the first, and then some, wrapping up a beautiful world and a beautiful series. Though it may be predictable at times, the uncertainty adds to the experience. It is rare to find a second season that is stronger than the first, but in this case, Little Busters Refrain is unique, and a true standout in anime, and is definitely worth the watch.",
            "date": "2015-03-23T21:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 183193,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2136267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bribrigirl1155",
                "username": "bribrigirl1155"
            },
            "url": "https://myanimelist.net/reviews.php?id=183193"
        },
        {
            "content": "Little Busters: Refrain is the second instalment of the Little Busters series, a series based on a visual novel of the same name. \r\nI did have misgivings about LB considering JC Staff was handling it. There are some pros and cons to LB, which I will address throughout the course of this review. I'll try my best to keep my opinion out of this review, and free of spoilers.\r\nStory (8/10):\r\nThe main theme of LB was the theme of friendship. However, with LB: Refrain, there is an abrupt shift, with the plot now consisting of romantic and supernatural elements. The story now focuses on Riki andRin, who must face and overcome the ghosts of their past in order to save their friends and secure a future where they can be together. \\n\r\nThe second season starts off well, with the plot getting more convoluted as you progress. Towards the end, there is a LOT happening which may be a lot to digest. The plot execution isn't the best, and a lot of things happen with little to no foreshadowing.\\n\r\nThe supporting characters of LB around whom the arcs of the first season were centred around play little to no part here, which is consistent with the theme shift.\\n\r\nOne thing I found disappointing was the lack of explanation given for a lot of things that I will not list as they are potential spoilers (watch episode 9, 10, and 11).\\n\r\nThe romance between Riki and Rin also felt somewhat forced.\\n\\n\r\nArt (8/10):\\n\r\nThe art measures up to 21st century standards.\\n\\n\r\nSound (7/10): \\n\r\nThe soundtrack has been recycled from the first season, but is fitting for their scenes, more or less.\\n\\n\r\nCharacters (7/10):\\n\r\nWhen speaking about the characters, I also speak with reference to season 1. The character designs are, O.K. at best, with traces of the hair/eye colour swap syndrome. A lot of the characters feel very one-dimensional (very trope-y personalities) with past traumatic experiences tacked on to compensate for the lack of dimensionality. \\n\r\nI don't blame JC Staff for these shortcomings since they have faultlessly adapted the visual novel with the original character designs intact.\\n\r\nOn the bright side, the second season sees some really great character development. Since the second season focuses on fewer characters, it has more room to work with. Riki in particular, receives the most attention. Rin's development on the other hand, felt very deus-ex-machina like (watch the last episode to understand).\\n\\n\r\nEnjoyment (8/10):\\n\r\nLittle Busters is a feel good anime. The series has a happy ending. Even if you consider what it took to get there, it's alright, because that's what a feel good anime is about. \\n\r\nI liked the theme shift, since it gave the whole series some sense of a greater purpose. \\n\r\nThe episodes are engineered to evoke your emotions, though the producers may have jumped a couple of hoops to do so.\\n\\n\r\nOverall (8/10):\\n\r\nThe LB series, like any other series, is not free of issues. But it does a lot of things right and on the whole, comes off as a nice, feel good series that anyone can enjoy.",
            "date": "2015-12-21T02:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 206256,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4325099.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Coldsp33d",
                "username": "Coldsp33d"
            },
            "url": "https://myanimelist.net/reviews.php?id=206256"
        },
        {
            "content": "This second season is even better than the first one. \r\nIf LB is a happier anime, LB Refrain is much more dramatic and intense, yet beautiful. What I liked the most was the evolution of the main characters (Riki, Rin and specially Kyousuke) and how every single piece of this complex puzzle started to make sense. Be sure to pay attention to every single hint!\r\nAnother relevant and positive point of this season is that it is definitely catching: I got addicted to it. \r\nEven the opening is better than the first one... well, maybe not better, but much more appropiate to this part of theseries. It's sadder and a bit dark, but hiding a ray of light in it. If you study the lyrics in depth after having watched the show, you'll discover how accurate they are. \\n\\n\r\nTo conclude, I consider this season a masterpiece, from its intense beginning to its surprising and moving end.",
            "date": "2015-03-14T10:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 182331,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/528749.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lorihime",
                "username": "Lorihime"
            },
            "url": "https://myanimelist.net/reviews.php?id=182331"
        },
        {
            "content": "Little Busters is one of Jun Maeda's stories, which means it is meant to hit hearts hard.\r\nWhile it did move me, this anime adaptation is far from perfect.\r\nThis review is for both seasons.\r\nSTORY\r\nUsual Jun Maeda story, so it is composed of:\r\n- a 1st part focusing on fun,\r\n- a second part developing the characters' tragic backgrounds,\r\n- a final \"secret\" part developing the main story.\r\nI have to say I really love this setting: the first part sets a peaceful mood while preparing the ground for the rest of the story.\r\nThen, the second part hits us hard by being cruel with the characters we grew to like.\r\nFinally, thefinal part shows its cleverness.\\n\\n\r\nWhen done properly, this formula is unbeatable!\\n\\n\r\nAside from that, it's the usual Slice Of Life setting: we follow a club of high-schoolers, this one is called \"Little Busters\". The core of the group wants to play baseball (for some reason, lol), but needs to find new members for that.\\n\r\nSo first, we need to discover the new characters, which is done through the whole first season.\\n\r\nThen, the second season develops the main characters as well as the main story, revolving around the \"secret behind this world\".\\n\\n\\n\r\nIf I were to complain about one thing, that would be the quantity of supernatural stuff. I mean, every Jun Maeda story is supernatural, but in this case, some stories did feel way too much supernatural. Nishizono's story, for example, doesn't make sense at all...\\n\\n\r\nThis is a minor issue, so it all sounds good! BUT... the anime does have one major flaw: many events are rushed, especially the second season.\\n\r\nThat is due to the fact that the second season has only 13 episodes. Jeez, again?! When are you going to understand that 13 episodes aren't enough for a season!!!!\\n\r\nThe thing is, Refrain is the most important part of the story BUT it's that very part that is rushed!\\n\\n\r\nWhile it can be forgiven as it doesn't totally ruin the story, it does bring it way down in my opinion. I mean, they just had to take 12 more episodes and use that time to develop things a bit more!\\n\\n\\n\\n\r\nART\\n\r\nThis isn't KyoAni like for Kanon (2006) and Clannad: this is JC Staff. As a result, the visuals are... meh.\\n\r\nBasically, it's simplistic. The environments are quite detailed when fixed, but as soon as something has to move, it suddenly becomes super simplistic and not really believable...\\n\r\nThe same for the characters: as soon as they have to move, the level of detail suddenly drops.\\n\\n\r\nThe light effects are way too bright, everything is too white most of the time.\\n\\n\r\nAll of this results in the one main flaw of this anime compared to other Jun Maeda anime adaptations: it doesn't feel really believable. I wasn't as immersed in this anime as I was in Kanon (2006) or Clannad, for example. It felt too much like a cartoon, basically.\\n\\n\\n\\n\r\nSOUND\\n\r\nThe OST is nice, although I didn't find any memorable tracks. The openings are wonderful, very emotional and clever.\\n\r\nThe seiyuus are awesome. I especially loved Kud's voice (\"wafuuu!\"), and all of the voices played their part. Kyousuke's voice was awesome.\\n\\n\\n\r\nCHARACTER\\n\r\nThis is definitely the most interesting part of this anime.\\n\r\nThe characters are diversified and very enjoyable. Some of them have their story rushed, which makes them less appealing than the others. But those who are developed properly are really appealing, and of course, all of them suffer from deep wounds that makes them really interesting.\\n\\n\r\nUnfortunately, this anime suffers from the \"cliché Syndrome\": all the characters are mainly one-dimensional, until their story comes in and changes it a bit.\\n\r\nMasato and Kengo, for example, didn't really appeal to me because of that... until they explain their role in the story and they suddenly get interesting.\\n\\n\r\nI also found there was a HUGE lack of interactions between many characters. Rin and Kyousuke, for example; they're brother and sister, but... they almost never talk to each other! If that were justified, I wouldn't mind, but the story does make a point that they are in good terms, so why this lack of interaction?\\n\\n\\n\\n\r\nENJOYMENT\\n\r\nHonestly, I think Little Busters has the same potential as Clannad. Sadly, the visuals and sounds aren't at that level despite being more recent, which ultimately brings it down...\\n\r\nBut the story itself was great. Sadly, it rushed the important parts, which brings it down as well.\\n\r\nBut overall I did like this a lot. It was very emotional and deep.",
            "date": "2019-02-14T06:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 301651,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7223606.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dante012",
                "username": "Dante012"
            },
            "url": "https://myanimelist.net/reviews.php?id=301651"
        },
        {
            "content": "Now by all means, this anime had a lot of expectations and considering it was made by J.C Staff who is notoriously known for botching adaptions i had my doubts.  But Refrain is something that I can say was done remarkably well (albeit not perfect).\r\nFor those of you who have not watched the first season, I highly recommend that you do so! Even though many say that the first season was extremely boring or whatnot, but hey that's what they also said about Clannad  with Afterstory.\r\nBut for those who do not care, then I guarantee you that you will not feel as emotionallyattached to the characters.\\n\\n\r\nI apologize for my rant, onto the review:\\n\\n\r\nRefrain is using the build up similar to Clannad and Afterstory, with Rin being the main heroine in this season, focusing on the relationship between Riki and Rin as well as the original five members of the Little Busters (Kyousuke, Masato, Kengo, Riki and Rin).  Now we also get to view Kurugaya's route which was not explored in the first season and I personally thought that it added a nice touch to begin the season.\\n\\n\r\nStory: 9\\n\\n\r\nThe storyline for this season is different from the first season.  The \"secret of the world\" is hinted strongly as the episodes progress to the point where you almost have it figured it out but don't really know for sure.  J.C Staff's ability to weave multiple routes into a coherent story wasn't done very well in the first season, and this season was better but was still a little sloppy in terms of its transitions from kurugaya's route to rin's final route.\\n\\n\r\nArt: 8\\n\\n\r\nI enjoyed the art for the series as a whole, but it didn't have that \"eye candy\" quality that Clannad and Afterstory had.  The background art wasn't as nicely enhanced or vibrant as Clannad and afterstory but I wouldn't consider it to be the deal breaker for this.  That being said, it did have some of its moments in which I refrain (hah get it?!) from stating and will let you be the judge of it.\\n\\n\r\nSound: 10\\n\\n\r\nOkay personally, the music for the season was what kept the tensions level high.  In the first season, it felt like the music didn't necessarily match the scene at the moment but for Refrain it was greatly improved.  However, I still felt as though for some of the scenes the music selection could have been different, such:\\n\\n\r\n*SPOILER*\\n\\n\r\nKomari and Rin's final meeting.\\n\\n\r\n*END SPOILER*\\n\\n\r\nI also enjoyed the opening and ending very much, the art (which I apologize for being in this section) fit the music extremely well and it is something that I could watch over and over again.  The opening is more of a melancholy and somber theme while the ending is sort of a way to make the viewer feel happier after experiencing the tension given by the episode (or I'm just being corny).  Regardless, the music is what appealed to me most besides the characters.\\n\\n\r\nCharacter: 10\\n\\n\r\nThe main focal point of the series and the appeal factor for Littler Busters! as a whole.  Each character's had their own hardship to overcome and each one tugged at the heartstrings in a different chord, but the build up of these characters is what makes the finale extremely emotional and I have to admit that even I almost let out some mantears at the end of it all, especially at the big revealing episode once you find out what the characters have really been going through just for the sake of Riki and Rin.  \\n\\n\r\nIn refrain, starting with Kurugaya, each character almost made me feel empty inside once they each had their moment of glory and final moments with Riki (I felt like I was missing something after... it is not a bad thing!).\\n\\n\r\nEach character had their importance in the series, despite how some say how annoying they can be, which i disagree that all of the characters are loveable. \\n\\n\r\nEnjoyment: 9 \\n\\n\r\nAfter finishing Refrain, I had to sit there for a few minutes to have it fully sink it.  Then after that I started some of the episodes up again just to really see if what I watched was real or not ( I know I'm weird), but my enjoyment was the same.  \\n\\n\r\nOverall: 9\\n\\n\r\nOverall, I just loved refrain.  the only nitpicking I had about it was what happens to the rest of the girls as the season progresses, it seemed as though the main five just forgot all about them at some point. I also felt as though some stuff were omitted due it being constrained to 13 episodes instead of 24-26 like the first season (which I still wonder why it was shorten?).\\n\\n\r\nAlso, a lot of people that I have read on forums have mentioned that the climax of Refrain is supposed to be just as good if not better than Afterstory, and personally I will say that it is up there with Afterstory in terms of the tear-jerking factors, but does it top it? That will be a tough question to answer.  But I do admit that it did a good job in bringing out the emotional factor in only 13 episodes.  \\n\\n\r\nP.S\\n\\n\r\nI never played the VN and so maybe refrain tops afterstory in terms of the VN but now that I have finished it, I am dying to play the game now to see what its really about!\\n\\n\r\nNow time to wait for the Ex episodes!\\n\\n\r\nThanks for reading and I hope this was helpful... even if it was just a little... \\n\\n",
            "date": "2014-02-02T17:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 131197,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dullaznboi",
                "username": "dullaznboi"
            },
            "url": "https://myanimelist.net/reviews.php?id=131197"
        },
        {
            "content": "*SPOILER ALERT*\r\nA missed opportunity, this anime had everything to become a perfect tragedy, there were several chances for a tragic ending. But instead, it ended very cliché and implausible. I don't want to say that I like it when characters die, but in this case it would have been a much better story. Especially near the end, when Kyousuke was in a coma and all the others were waiting for him, because they had nothing left to do. He suddenly pops op at the EXACT right time (SERIOUSLY?!).\r\nI did really like the first season of Little Busters, but this season was just so bad inmy opinion. The art and characters are still great (although you didn't get to see a lot of the other half), but the story is just really poor.",
            "date": "2014-01-15T08:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 128881,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1413937.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/idavisje",
                "username": "idavisje"
            },
            "url": "https://myanimelist.net/reviews.php?id=128881"
        },
        {
            "content": "\"Nice rebound J.C. Staff... Nice Rebound..!\"\r\nAfter watching the awful Little Busters! I'm starting to think that Key's work are going downhill. So when I heard that there is a sequel I gladly gave it a shot. 13 episodes is not that hard to watch, and this time time J.C. Staff nailed it. This is just a short review so I hope this may help.\r\nStory: 8\r\nThe story is still the same. It's just a continuation from the last series. But this one really focuses now on Riki and his childhood friends. This show will also give you the answer to the secrets of this world thatthey are talking about.\\n\\n\r\nArt : 9\\n\r\nThey really did a great job here! They improved a lot. And I'm sure it will be the first one that you will notice when you watch this. \\n\\n\r\nSound: 9\\n\r\nThey really made a great OP song here which fits to the overall theme of the series. The ending song has nice beats and catchy lyrics at the same way.\\n\\n\r\nCharacter: 8\\n\r\nThis is a continuation of the main characters arc. So expect those unanswered questions of yours to be answered here. And most of all they really developed them here especially Riki and Rin.\\n\\n\r\nEnjoyment: 10\\n\r\nYes! It's a 10. I really enjoyed the show. I finished it in just one night. Unlike the prequel there is no boring episode here so rest assured that you're not wasting your time when you watch this.\\n\\n\r\nOverall: 9\\n\r\nJust like I said J.C. Staff did a great job this time. I still have my hopes for the works of Key and this one sealed the deal. If you are expecting a drama you can find it here but not greater that Clannad After Story.\\n\\n\r\nThanks for your feedbacks! :)",
            "date": "2014-04-13T01:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 139731,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175752.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ezaya",
                "username": "ezaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=139731"
        },
        {
            "content": "I have never found an anime that has moved me so deeply. I look back and smile while crying. There was always something more in Little Busters that kept me watching, and when I started Refrain, I was on the edge of my seat with a myriad of feelings. The anime left me feeling that I had done something good with the time I spent and lightened my heart. The characters all impacted me deeply, taking me deeper and deeper into the plotline, until Refrain latched on to me and my heart. This anime will leave you with a heart just a little bit brighterand just a little bit stronger. I have seen a lot of anime, but this is by far one of my closely treasured few. This story will live on in my heart.",
            "date": "2016-07-24T19:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 224893,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3968193.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LaviBookmanJr",
                "username": "LaviBookmanJr"
            },
            "url": "https://myanimelist.net/reviews.php?id=224893"
        },
        {
            "content": "Well this is my first time writing a review so please bare with me...\r\nBut I just had to write a review for this marvelous anime series..\r\nI'll separate my rating by MAL scoring system and first up is story \r\nStory: 9/10\r\nThe story actually picks up from the first season giving the whole \"secret of the world\" completing tasks and etc. The story may seem a bit odd like the first season but I assure you that if you keep watching it through... you will be rewarded greatly.. \r\nYou see things that you sort of expected but in a more flashier way.. sometimes it doesn't happen theway you thought it would.. which kind of sucks haha..\\n\r\nSince it's 13 episodes I believe that the producers found out they don't have time to mess around so they got right on the point and that's what they did.. little busters refrain did an amazing job on delivering the top quality story plot to its viewers.\\n\\n\r\nArt 9/10\\n\r\nThis category you don't even have to worry about... it's not some 1990 series.. the art actually does play a role on playing with emotions.. the bright colors, dark colors, auras(vibes) you can see that it emphasizes on the current mood of the scene.. tbh you won't even have time to be worked up on the art because the plot is so good..\\n\r\nBut again... it's not perfect but i assure you it's almost there..\\n\\n\r\nSound 10/10\\n\r\nAs you have seen from first season.. Im sure you guys know that this anime series has some sad scenes to it.. and holy mother of wow does this anime give us a punch to our emotions with its music... you get the feels... you think you're going to tear up but you're not because you don't usually tear up.. but nope.. the background music says \"screw you, I'm going to make you cry\" and you start tearing up and feel your heart aching.... welp enough of this section\\n\r\nOh yea..I personally liked first season's opening music than this season's.. I didn't listen to the ending so I wouldn't know but I think first season would be better..\\n\\n\r\n Character 10/10\\n\r\nFinally my favorite section.... you see.. there are quite a few supporting characters that feel like they are main characters.. Little busters refrain gives an absolute top notch character development between first and second season.. second season does emphasize the main characters more but wow... it's just a complete different level than your ordinary \"good anime\" you feel like you're a part of the characters and you feel their pain.. their joys... their sorrows... and their ideas... well I'm an idiot so I fell in love with Masato first... but others kept coming into my eyes and next thing you know, you're part of little busters too... I'll admit it.. there were couple characters that I wasn't attached too but... the amount of affection I got and gave to other characters was beyond any scale of measurements... I never been deeply moved and never really cared about what happens to the characters because that's the way it is... little busters was different... \\n\r\nI enjoyed the character development the most and I felt all the effort the people who made little busters, in me..\\n\\n\r\nEnjoyment 10/10\\n\r\nThis section will be short since.. you know... I think I wrote enough on why you should watch this... just grab a big bag of chips and watch 3 episodes at a time... BOOM next thing you know you're at episode 8\\n\\n\r\nOverall 10/10\\n\r\nWould watch again...\\n\r\nI'm so glad this series came out.. I am honored to experience the experiences I got while watching this anime and really do cherish my friendship now.. but it does leave me a bit salty because I didn't have good friends in high school... \\n\r\nIf you're looking for an anime because you watched all the popular ones and mainstream ones... this is an anime you don't want to miss out on.",
            "date": "2016-02-23T23:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 211581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3917849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Chartemis",
                "username": "Chartemis"
            },
            "url": "https://myanimelist.net/reviews.php?id=211581"
        }
    ],
    [
        {
            "content": "This anime will have you in tears: both happy and sad. All is revealed about the secrets of the world. There isn't a boring moment and it will keep you on the edge of your seat throughout the whole anime. Don't worry about completing the Visual Novel before watching because Key did such a wonderful job adapting it. The art is great as well as the music. I find myself singing the songs constantly! The connection with the characters strengthens not only between themselves, but with the viewers as well. This piece will resonate with you long after you've watched it. Maybe even make youwatch it multiple times! You'll definitely become a fan, there's no doubt about it!",
            "date": "2014-08-22T16:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 157569,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4039057.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/happinessspiral",
                "username": "happinessspiral"
            },
            "url": "https://myanimelist.net/reviews.php?id=157569"
        }
    ]
]