[
    [
        {
            "content": "A Nyan Koi rip-off? Not really. For those who have read the synopsis and went on that basis, let me stop you there. While the similarities of cat-allergies are familiar to each anime, that's pretty much it that each tale will share.\r\nAfter episode 1, I was actually surprised to want to watch the next episode due to how close the show stuck to the manga's storyline. With a long line of let-downs in the last year for adaptations, I had made sure not too have to much of an expectation for this show, and I'm glad I did as its proven to be just abovewhat I had hoped for.\\n\\n\r\nWithout going into detail, Omamori Himari is the story of Amakawa Yuuto, descendant to a long line of demon slayers, and his kick-ass sexy feline guardian Himari Noihara(demon neko-mimi or cute puss-in-boots for you westerners). Add in a 'tsundere' childhood friend, a loli, a maid waitress, and an  'ojou-sama' like fiancee and you have the rest of Yuuto's \"cliched harem\" as they try to handle co-existence with youkai(demons) and humans alike due to Yuuto being casted as one of those  sensitive new age guy who doesn't like violence(the type of nose-bleeding harem male you love to hate) \\n\\n\r\nNow this show falls in the genres of Action, Comedy, Demons,  Romance, Harem, Supernatural....which sound like ingredients to a great plot and story, but coming from a creator who's previous works are hentai, what you will see is fan-service, cliches, fan-service, loli-action, fan-service and a lot of ecchi(as a male I have no problem with that....oh and did I mention fan-service?)...well I guess the benefits of a H-mangaka is that you can expect the artwork to be top-notch. From the 3 sizes(of each heroine) to Yuuto making out with a few of the leading ladies, they've made sure to cover the right angle shots in detail(which some will find very ero-ero....if you can get past the censorship that is...hopefully there'll be none of that when DVD gets released).\\n\\n\r\nThe OP and ED are ok but not something to start looking out for on your next karaoke session and the BGM can be classed as elevator music(well not as bad). As for the voice actors, you have a great line up of seiyuus(Tenma from School Rumble being Himari as an example, and the cute Kuro from Kodomo no Jikan as Shizuku for those loli-lovers ^nano). The only thing I wasn't pleased with is Yuuto's VA, which I feel they've miscasted. Those who've seen School Days should know what I mean. Everytime I hear Yuuto's voice whilst Himari's trying to flirt with him, I get that spine-cringing feeling that someones out of place. I do feel sorry for that seiyuu as its not his fault for being the VA to Makoto(probably the most hated male lead in all of harem time), but he just does not suit being a harem lead. \\n\\n\r\nAll-in-all without discriminating the show from the seiyuu, Omamori Himari is a worthwhile anime to watch. From the producers ZEXCS(who gave us Regios, Rental Magica and *vomit* Da Capo), here's hoping they don't stuff this one and give us a bad ending, or in Makoto's term a \"nice boat\"....\\n\\n\r\nIf your looking for Nyan Koi replacement, I'll advice you now your not going to get it. As long as you don't come with no expectations, I can safely vouch that this anime will aim to please",
            "date": "2010-02-03T05:45:00+00:00",
            "helpful_count": 56,
            "mal_id": 22914,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=22914"
        },
        {
            "content": "Hey guys, this is my first review! :D\r\nOmamori Himari is a Super-natural Ecchi/Harem anime with action scenes and romance.. Maybe more than that, hehe.  It is like any other Ecchi/ Harem anime out there but this shouldn’t be a problem if you are into that. I will try not to give any spoilers but If I do, I apologize. \r\nStory 6/10.\r\nThe story is involving a guy named Yuuto, who lives alone due to his parents dying in a car accident. He is an average teen, but he is allergic to cats. Then there are the Ayakashi, or the demons. There are some Ayakashi thatare evil and some that are not. On Yuuto’s 16th birthday as he was walking to school, meets a strange girl with a katana named Himari. Himari appears to be an Ayakashi but she oaths to protect him from evil. \\n\\n\r\nSound 7/10\\n\r\nThe sound was mainly blah and didn’t really touch me. The sad OST’s do not sound that great but the action OST’s are fine. Opening theme song was good and the ending was good as well. The voice acting in Omamori Himari is very very good (English Subbed). Extra details are added when the main character is getting seduced by Himari making sounds like “Oh my goodness, please do not.. I’m very very shy.. OooAWawoo.” The voice acting for the female was very good and not annoying at all.\\n\\n\r\nArt/Animation 9/10 \\n\r\nYou can surely enjoy the art and the animation in Omamori Himari, the fighting scenes are not that great because it doesn’t really make any sense. The art is very well done like any other ecchi/harem series with the Chest and other areas appealing for a lot of people. Overall the art was very well drawn and the animation was great.\\n\\n\r\nCharacters 3/10\\n\r\nThe main character is a “Weakling” who gets protected from 4 ladies at ALL times. The other females (Except from Himari) did not make any sense at all. They were basically there to fill the show in for 12 episodes. Himari is willing to do anything for her “Young Master, Yuuto – Kun” going far as having intercourse with him. I was very displeased with the characters and thought they could do a better job with it.\\n\\n\r\nEnjoyment 10/10\\n\r\nAs an ecchi/harem fan, I really liked this series. But for the people that dislike these genres, this anime is not for you as this has a lot of “sexy” stuff in it. However if you are into this, this anime can be very very enjoyable like I did. \\n\\n\r\nOverall 7/10\\n\r\nI would suggest you watching this anime if you are into Ecchi/Harem/Action/Supernatural. \\n\\n\r\nOther Recommendations of the genres listed above would be: Rosario To Vampire, Rosario To Vampire Capu2, Highschool DxD, Highschool DxD NEW.\\n\r\nFor Just Ecchi/Harem : Princess Lover, Ichiban Ushiro no Daimaou, Freezing, and Sekirei. \\n\\n\r\nI thank you for reading my review, and I hope you have a nice day.\\n",
            "date": "2013-08-25T17:17:00+00:00",
            "helpful_count": 38,
            "mal_id": 111197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2944781.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/10makunn",
                "username": "10makunn"
            },
            "url": "https://myanimelist.net/reviews.php?id=111197"
        },
        {
            "content": "Yet another ecchi show aired this  year proves that trivial things like plot or characters' depth might end solely as a bonus to the brainless fanservice. And I wouldn't mind that!\r\nOmamori Himari, though, was one of the worst and least enjoyable anime shows I've watched lately.\r\nAgain, normally, I wouldn't mind fanservice>everything else design, as long as it's at least decent. This anime, though rated R+ lacked it at all!\r\nIt's not like I'm watching the show solely of the fanservice purposes, but this one has literally nothing else to offer.\r\nArt isn't horrible, but mediocre at it's best.\r\nCharacters' design is tedious  and ordinary. Backgrounds areboring and dull-looking. Overally bland.\\n\\n\r\nSound doesn't highlight much. Music is that typical that it hurts. Not interesting at all.\\n\\n\r\nPlot lacks plot, mostly slice-of-life except few episodes. Dialogues are dull, usually too long and boring. Characters are shallow, lackluster and stereotypical.\\n\r\nOverally very predictable and beat.\\n\\n\r\nIn general anime is bad and very tiresome. I don't suggest watching unless you expect nothing or get entertained very, very easily by boring stuff.",
            "date": "2010-05-05T07:04:00+00:00",
            "helpful_count": 36,
            "mal_id": 25755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199580.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nekonyan",
                "username": "nekonyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=25755"
        },
        {
            "content": "I suppose the easiest way to sum up what I've seen so far are these two words: Uninspired and dull.\r\nEverything you can see in this anime has been done multiple times before in so many better series, so if your after originality then you shouldn't bother watching this.\r\nThe good thing about Omamori Himari is the fact that it will appeal to most fetishes out there: Lolicon, maids, cat-girls and what-not. Buts that probably the shows only redeaming feature, and even then its only good if your into that kind of thing.\r\nI'm quite glad theres only a week left of this as there really hasn't beenany building up to a finale, everything just feels like another episode rather than something meaningful.\\n\\n\r\nTo sum this up; If you like having boobs and panty shots thrown at you then you'll probably like this, though if you want something with a bit of depth or action that is actually good then I'd advise to stay away from this.",
            "date": "2010-03-20T13:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 24135,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284602.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Xavierxenon",
                "username": "Xavierxenon"
            },
            "url": "https://myanimelist.net/reviews.php?id=24135"
        },
        {
            "content": "Omamori Himari\r\nThis anime was my first Ecchi/Harem anime and it was very good...\r\nStory\r\nThe story is about this young boy named Yuuto that has a normal life and is allergic to cats, one day he trips with this girl called Himari then he finds out she is a cat/girl and is allergic when she gets close to him, but there's something he doesn't remember and that is she is his protector and gives him an Omamori (amulet) that keeps the enemies away from hurting him, he will meet a lot of girls that will care for him and they want to be with him, they willhelp him to retrieve back his memory to know what he should do. The story is good.\\n\\n\r\nArt & Animation\\n\r\nThe animation was very good, it's an ecchi after all, it has to be, there were irregularities sometimes but i thought it was very good.\\n\\n\r\nSound\\n\r\nThe sound overall was good, the VA was good too and the music background was ok, the OP and ED were ok.\\n\\n\r\nCharacter\\n\r\nThere's a lot of characters to see here, all of them well developed, your typical harem where there are a lot of girls with big boobs or naive girls or the ones that falls for the MC with his back story but this was very good because of the bunch of boobs and babes there are.\\n\\n\r\nEnjoyment\\n\r\nBeing my first Ecchi/Harem i enjoyed more this anime because of those elements and the action scenes were good and boobs of course.",
            "date": "2015-08-03T01:38:00+00:00",
            "helpful_count": 26,
            "mal_id": 195052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195052"
        },
        {
            "content": "it's a great anime it has a manga to and if u like ecchi, romance,action(good fight scenes indeed) u found ur anime its really a great anime.\r\nits about a boy named Amakawa Yuuto he is a demon slayer(and has the blood of amakawa it gives power to the demon slayers but there are other clans they got their own powers and blood)but in the centry we live they dont need demon slayers or they thouth.then he encounters demons but he doesnt have training to kill them becouse of his family.so there comes our cool savior cat himari he protects yuuto then he encounters many otherdemons some of them will join him and some of them will do everything to kill him \\n\\n\r\nstory: its interesting and never gets boring 10\\n\r\nart: its super gooood 10\\n\r\nsound: its cool and good 10\\n\r\ncharacter: cooool \\n\r\nenjoyment: from the beginin to the end its AWESOME so its ok\\n\r\nOVERALL: 10",
            "date": "2010-02-06T15:30:00+00:00",
            "helpful_count": 10,
            "mal_id": 22993,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291600.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chingstah",
                "username": "chingstah"
            },
            "url": "https://myanimelist.net/reviews.php?id=22993"
        },
        {
            "content": "Ecchi and harem, they go hand in hand in the anime industry and are two of the most popular genres within the otaku culture, but this is widely known, so the question is: Does this anime have anything else to offer other than fan-service? \r\nIt's answer is: No, while it does have a plot and has some action mixed into it, this kind of a story could be from a kid's dream for all I know.\r\nSo after stating that this has no story where does this enjoyment come from, the fan-service obviously, while plot wise it is bad, the way it introduces characters and createsfor the situations it has, it does relatively good. The \"plot\" revolves around a guy named Amakawa Yuuto, who is your ordinary high school student, nothing more than that, he has his caretaker (a tsundere) wake him up and tend to him for most of the time. Until one day he wakes up with a cat in his face (a catgirl, childhood friend) and they start out their adventures from that point.\\n\\n\r\nBut a story with only fan-service in it has no chance of getting an anime, so they added action/magic theme to it, which is fine in terms of content, we get to see a variety of magic they creator thought of when he added powers to his characters, the action itself is actually a bit good, they have some good fights which aren't only for the sake of fan-service. \\n\\n\r\nLastly in the story, I would like to address the episodes and their content, while it has a bad plot and no real character background, it doesn't have the cliché episodes and has some episodes with original stuff happening in them. \\n\\n\r\nArt-wise it is good, like surprisingly good, the boob physics are used without holding back and the characters look colourful and vivid.\\n\\n\r\nSound-wise, it is decent, nothing amazing or outstanding which piqued my interest, seiyuu wise, most of them you can probably recognise and if not, you will later as they play lots of roles in different anime.\\n\\n\r\nNow to add up on that tsundere and catgirl, childhood friend stereotype, we can add: a loli kuudere, clumsy maid and childhood friend 2. By summing all these up you can come to the conclusion that every cliché harem character is present, although I do say that, some of them have their own variations from their archetype, but honestly, most of them are textbook cliché characters.\\n\\n\r\nOverall I though Omamori Himari was quite a weak anime, but there is worse out there, a lot worse, it made up for its no-plot with decently good fights and the fan-service was not half bad.\\n\\n\r\nStrong points:\\n\r\n- Fan service has some nice variety to it.\\n\r\n- The episodes have some decent content in them.\\n\r\n- The fights in the anime are good, cliché and overused, but entertaining.\\n\\n\r\nWeak points:\\n\r\n- Textbook characters. Including the weak protagonist.\\n\r\n- Weak plot, which doesn't get any expansion on in the anime.\\n\r\n- Nothing special about its sound part.\\n\\n\r\nSo if you are looking for a classic harem ecchi with some decent fights and episodes (in terms of content) and don't mind the weak characters, then Omamori Himari is the anime for you.",
            "date": "2012-08-11T11:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 69441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191455.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Karpman",
                "username": "Karpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=69441"
        },
        {
            "content": "Story: 1/10\r\nI'm not the biggest harem or fanservice fan, but I don't mind if they have a good story and likeable characters. But instead of a good plot with fanservice, it's fanservice with little plot. \r\nI knew all hope was lost when the generic fanservice beach episode was the second one. Then episode 3 was written around fanservice. 'How can we make Himari's breasts/panties show this time?\". I wanted to give it a chance, it sounded interesting and for the most part ecchi doesn't bother me. I mean series like 11 eyes, for example, find ways to write fanservice into a scene, but in thisseries, they try to write a scene around fanservice. It's pointless! And the thing is, it even has potential to be a good story! Demon slayers, demons, magic powers etc. Sounds like it could be a good fantasy story, but alas no. They might as well have taken the clothes out completely and made it a hentai. And I've seen hentai with more story.. \\n\r\nThere are maybe 3 episodes out of 12 that relate to the \"plot\". \\n\\n\r\nCharacter: 3/10\\n\r\nAll of the villains tend to be large breasted females who also lust over the main character (and for what reason I don't know). The main male character barely looks a day over 12, yet is getting fondled and dry humped by a lot of women who look many years older than him (except one, who looks like an elementary school kid. She heals him by rubbing against him until she gets off). Of course he has his cliche annoying possessive female friend, and the the large busted bodyguard. However, I actually like Himari. She's pretty well rounded (and not just her chest). She's also a powerful cat demon that fights with a sword- what's not to like? She also shows the widest range of emotion. Really she's the only character worth mentioning.  \\n\\n\r\nOverall, unless you watch an anime for just breasts and pantyshots and no story, this is not one I'd recommend. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-04-06T22:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 35767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/247399.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Galactic_Kitten",
                "username": "Galactic_Kitten"
            },
            "url": "https://myanimelist.net/reviews.php?id=35767"
        },
        {
            "content": "I remember when I first read the manga to this. I enjoyed every bit and the first signs that I would equally enjoy the anime appeared when I found myself smiling at the list of winter 2009 new releases.\r\nAbout just another high schooler living his life up until his demon repellent charm expires, making him vulnerable to demons, youkais, and monsters alike. Why are these demons after him? He's from a family of demon slayers and the rest goes along without much relevance to what's really important in the anime.\r\nWe have the childhood friend, starting off at square one of this harem. Then a demoncat guardian (Himari of course) appears to save him from his first demon attack. Shizuku gets dragged in after witnessing Yuuto's compassion for innocent demons. Lizlet sticks along after Yuuto \"saves her life\". And another childhood friend, apparently long lost, a demon slayer like Yuuto and my favorite of them all Kuesu Junguji.\\n\\n\r\nIt's a harem anime, what's there to expect? Loads of boobage and underwear scenes of course. Being cat themed, we also get a bit of neko ears in the mix as well.\\n\\n\r\nThe plot isn't that much important. I say the most interesting thing was Himari's quest to earn a mouth to mouth kiss with Yuuto with I enjoyed watching.\\n\\n\r\nAlthough I wish it would've been longer and a bit more closer to the manga (for the benefit of the plot) I am very much satisfied with the 12 eps I received and hope with all my heart we get a little more content out of this.\\n\\n\r\nOne thing that stuck out to me was the music. BEAM My BEAM (ED theme) was the best ending theme I've heard in a long time. Possibly the best out of the winter 2009 - Spring 2010 anime EDs. Same for the OP as well. I loved all the songs.\\n\\n\r\nIf I could wish for anything more of this anime. I would ask for Character albums with at least 2 songs for each character as well as a different version of the OP and ED themes.\\n\\n\r\ntl;dr: It's good, watch it before you start your next series in line.\\n\\n",
            "date": "2010-05-19T08:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 26199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=26199"
        },
        {
            "content": "When you first look at Omamori Himari, you may think that it is just like every other Harem anime out there.  Where Himari really pulls ahead and shows that this is a very different anime is but the way all of the characters interact with not only the main male lead Yuuto, but with the other girls that have come to follow him.  In most of your harem anime the first girl that you meet is most of the time your air head who just likes to do a couple things. In this anime they do not introduce the air head until laterin the anime and not as a critical character. The first two girls that you meet are one of Yuuto's childhood friend, Rinko and the cat demon Himari. Right there you have the smart friend who wants to help Yuuto as much as she can and the other is the always loyal bodyguard.\\n\r\n\tThe story to Omamori Himari is not bad. The ending left it open for a second season, but they gave you enough to feel satisfied when it is over. Throughout the anime, the writer is always introducing new characters; some may play a bigger role and sometimes just the normal additions. They play a part that would be very different if they were not there. Between the voice and the characters, the producer of this anime did a good job. All of the voice actors fit the personality of the character that they were playing.\\n\r\n\tGive this anime a chance I know that it will make you want to keep watching until there are none left and all you can is watch it over and over again.\\n",
            "date": "2010-06-23T19:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 27497,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/112259.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/valdrane",
                "username": "valdrane"
            },
            "url": "https://myanimelist.net/reviews.php?id=27497"
        },
        {
            "content": "How should I describe Omamori Himari in a way that does not downplay it's worth of your time? Well if you like your anime to consist of at least three pathetic main characters who do nothing but bitch about how weak they are then you'll be fine. Then about 1/2 of the time watching you will see nothing but tits, panties, and more tits. Which isn't that bad if your looking for just that. It also has a decent but half-assed story line for those of you who wish to seek a half-assed enjoyable tale. \r\nSTORY: 6\r\nI'll be blunt. The story falls short of achievinga memorable tale and exciting adventure. There wasn't so much a problem to where the story was going but to where it DIDN'T GO. There were many questions left unanswered which only left me miffed. Like what concluded at the end. *SPOILER* Mɥʎ ʇɥǝ ɟnɔʞ ıs ┴ɐɯɐ ıu ⅄nnʇo,s ɥonsǝɥolp¿ ∀ɟʇǝɹ ɐll sɥǝ pıp ǝɐʇ ɐ sɥıʇ loɐp oɟ ɥǝɹ oʍu ʞıup ɟoɹ ɥǝɹ dǝɹsouɐl ƃɐıu˙ ∀up Hıɯɐɹı pıp qǝɐʇ ʇɥǝ lıʌıuƃ ɔɹɐd onʇ oɟ ɥǝɹ˙ I ʞuoʍ ſǝsns sɐʎs ɟoɹƃıʌǝuǝss ıs ɐ ʌıɹʇnǝ qnʇ ɔoɯǝ ou¡ Mɥɐʇ¿ ∀ɹǝ Hıɯɐɹı ɐup ⅄nnʇo ƃoıuƃ ʇo ʞǝǝd ɐ ɔɐuuıqɐlısʇıɔ uıuǝ-ʇɐıl ɟox ʍɥǝɹǝ ʇɥǝʎ slǝǝd¿ ∀lso ʍɥɐʇ ɥɐddǝuǝp ʇo ʇɥǝ ɯosʇ doʍǝɹɟnl ∀ʎɐʞɐsɥı¿ ∀ddɐɹǝuʇlʎ ʇɥǝɹǝ ɐɹǝ Ɛ oɟ ʇɥǝɯ˙ )┴ɐʎnʇɐɯɐ ɥɐs ʇɥǝ sɐɯǝ unɯqǝɹ˙ I ʍoupǝɹ ʍɥʎ¿( ┴ɥǝɹǝ,s ɾnsʇ so ɯnɔɥ ɔɹɐd ʇɥǝʎ lǝɟʇ onʇ ıʇ,s ǝuonƃɥ ʇo ɯɐʞǝ ɐ sǝɔoup sǝɐsou˙ Mıll ʇɥǝʎ¿ SHO∩˥p ʇɥǝʎ¿ I pou,ʇ ǝʌǝu ɔɐɹǝ ɐuʎɯoɹǝ ʎon pǝɔıpǝ ıɟ ʎon ʍɐuʇ ʇo ʍɐʇɔɥ ʇɥıs ɔɹɐd˙ ∀up ıɟ ʎon ɟlıddǝp ʎonɹ ɯouıʇoɹ ndsıpǝ poʍu ʇo ɹǝɐp ʇɥıs ʎonɹ ɹǝʇɐɹpǝp˙ *END OF SPOILER* (If you want to read the spoiler try Googling \"upside down text\".)  Due to this glass being only half-way filled I found it quite similar to \"Tayutama: Kiss on My Deity\". Both have this issue of incompletion and both have their main protagonists seeking coexistence. However, I find that \"Omamori Himari\" did execute its story a lot better than its counterpart Tayutama. But it still failed to succeed where Tayutama also failed. And that was its useless characters and the unsatisfactory ending. Where it could have easily continued through a 2nd season and hopefully redeem itself through a well thought out conclusion. While there were many ecchi moments and romantic endeavors occurring everywhere in the story frequently, there was also a good portion of action involved which was very much welcomed. It could have been more gruesome and violent as it had a few scenes which seemed to beg for a violent outcome but this anime was aiming more for an ecchi/romance audience. Again, it could have done much worse than what other anime's who are KNOWN for gruesome scenes have done, *cough* Elfen Lied *cough* but the way it handled its plot it seemed to lean more towards Otaku's who love to see a Tig Ol' Bittied heroine.\\n\\n\r\nART: 8\\n\r\nI very much enjoyed the art of Omamori Himari. Not because I had a hard on most of the time since it showed so much tit and ass but because...OK so the tits and ass were drawn very erotically and nicely. To the point where I didn't care about the story anymore. All I cared about was \"Are they...are they going to show me the nipples now or do I have to go watch a hentai?\" \\n\\n\r\nSOUND: 9\\n\r\nThe music was OK and the sound of the characters fighting, arguing, etc is the same as any other anime and no different in anyway. TBH I don't even know why there is a sound section in reviews. Pretty much ALL anime's sound the same except for the voice actors, music, and special effects. And if the anime's do sound a bit off (or entirely) it probably is your speakers, download of the video, or streaming source.  They should just name this section \"Music\" or \"Actors\" IMO. Speaking of actors Bleach's Orihime is in here and so is the voice of Makoto (School Days) as the main protagonist. And if your familiar with the voice of Nymph from \"Heaven's Lost Property\" and Erio from \"Denpa Onna to Seishun Otoko\" you'll probably :D. In addition to all of these underrated voice actresses/actors apparently Holo is our main heroine. \\n\\n\r\nCHARACTER: 6\\n\r\nHmm...don't know how to start this part out as the character list defines all of them almost perfectly. So I don't really see the point in addressing this part of the review. I guess I could only just review how they brought upon themselves the belief of them being an actual character that has worth in the show. You've got:\\n\\n\r\nHimari: A VERY sexy feline Ayakashi who serves as the body guard of our main faggot obviously. She has real nice tits...and ass...and..FUCK! I've paid too much attention to the fan-service that I practically forgot how she is. Let me see if I can remember...hmm....DAMN YOU FAN-SERVICE! \\n\\n\r\nShizuku: Um...why does she remind me of Nozomu from Kanokon? (That anime was TERRIBLE by the way) \\n\\n\r\nYuuto Amakawa: This guy is a FAGGOT and a PUSSY. (Not the feline kind) THAT IS ALL. \\n\\n\r\nLizlet L \"Liz\" Chelsie: She basically is in the show purely for comedic relief and fan-service. Nothing about her is interesting...AT ALL...other than she's a fucking teacup lol. \\n\\n\r\nKuesu Jinguuji: I didn't even give a shit about this bitch. OK MOVING ON! \\n\\n\r\nRinko Kuzaki: This pathetic use of a script and character reminded me of Kazumi from Shakugan no Shana. (Who I deeply hate with a passion) You wanna know why? She's practically an EXACT REPLICA OF SAID BITCH. Almost everything about her (excluding her voice actress) is exactly like her! Especially her uselessness. I don't know why the developers even put her in the show. She just gets all pissed when Himari try's to get it on with the main faggot. (Just to let you know I shall refer to him as faggot as he is indeed a faggot) Everything else is just her trying to claim faggot as her own. And if you think I'm wrong about her being a clone GTFO right now and watch SNS and then tell me she doesn't look and have the talent of being useless just like  Kazumi. \\n\\n\r\nENJOYMENT: 6\\n\r\nI did enjoy \"Omamori Himari\" I will not lie. It's got good ecchi moments if that's what your looking for but with a mix of some action and plot development as well. Although it wasted a lot of potential of being beyond a typical Action, Comedy, Demons, Ecchi, Romance, Harem, Supernatural anime it still manages to do just fine. Which suits its score perfectly. Its just a fine anime.\\n\\n\r\nOVERALL: 6 \\n\r\n If you like tits but no nipples, ass but not so much as the tits, and some plot and action development in between, then \"Omamori Himari\" just might be for you. Otherwise steer clear of this ecchi fest. And if your pissed that I wasted your time then blame yourself faggot. Your the one that decided to read a review than to go watch the damn anime in question. And this is just my personal opinion. That's what reviews are for! To let the ass who wastes their times writing these reviews express their ideas and feelings about the thing in question. Go ahead...click that \"Not Helpful Button\" I DARE YOU.",
            "date": "2012-02-29T21:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 55101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Golden_Darknezz",
                "username": "Golden_Darknezz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55101"
        },
        {
            "content": "If you are looking for an anime with an extremely good story and a strong main male character, leave this very second, this anime has none of those things. If you like bouncing boobs and a hot main female 'exposing herself' in front of our main male, then your in for a treat.\r\nStory:7\r\nThe story wasn't bad compared to shows like Kanokon and some other shows that have completely no story and are episodic anime. Rosario to Vampire just barely pulled it off, so I was glad when this anime had an actual story. That doesn't mean they pulled it off perfectly. Guess they just plainlyshould have had more experience. But it is still an enjoyable story.\\n\\n\r\nArt:10\\n\r\nThis art is simply amazing. Simply amazing. Blew me away as the great design and the immense detail immerse you in the storyline, at the very most making you want to be there. I see absolutely nothing wrong with the art and everything that I wanted was there, this includes the art of bouncing boobs, even THAT had good artwork.\\n\\n\r\nSound:9\\n\r\nI see nothing wrong but nothing outstanding about the sound quality of this anime. I guess since it's not dubbed it doesn't matter anyway.\\n\\n\r\nCharacters:4\\n\r\nLet me tell you something Ecchi-anime makers. WHY IS THE MAIN MALE ALWAYS SO WIMPY? This is what is wrong with pretty much every ecchi anime in existence, save for High School DxD, which in the novels states Issei is extremely strong. I would give this anime's character score a ZERO if it weren't for Himari and Kuesu. So many Lolis on this goddamn show, I think there is 3 or something.\\n\\n\r\nEnjoyment:7\\n\r\nThis anime can still be enjoyed, even with that wimpy main male. It did leave me wanting to watch more and more, which is something that some anime don't really give at all. If you are new to ecchi anime altogether, you might wanna try this. \\n\\n\r\nOverall:7\\n\r\nOverall, this anime is a great one to watch and I would reccoment it to everyone that fits the requirements of the first lines of this review.\\n\\n\r\nThanks!!!",
            "date": "2014-02-27T20:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 134117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Honjitsu",
                "username": "Honjitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=134117"
        },
        {
            "content": "I drew a wrong stick..so i have to review this..Damn it\r\n  So the story is about a boy from the 12 legendary demon hunter clans but he doesnt know it.A cat-woman(+1) gets to be his guardian and as the anime goes on this damn boy gets a harem..my god im jealous.This anime also has heavy fanservice(dont let your children watch it) so older people might enjoy(themeselves huehue).\r\n  Characters are mostly huge breasted..or at least big(except1) and the main character is the clicheic weak MC who grows stronger.\r\n  Sounds are pretty good so i wont pick on them..they were decent.\r\n  The artwas good...you know that i mean here.So i wont descrive it any further\\n\\n\r\n  I enjoyed it and i do recomed it if you can stand all the *ahems*...\\n\r\nIt wasnt that bad,it was quite decent and also has fight scenes(watching for the plot only..) so it is worth giving it a go.",
            "date": "2016-01-27T01:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 209447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4972556.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NineNTG",
                "username": "NineNTG"
            },
            "url": "https://myanimelist.net/reviews.php?id=209447"
        },
        {
            "content": "Omamori Himari was one of the first animes I'd watched over my \"Summer Anime Marathon\" and I can say it was good. It wasn't a \"One of the Greatest Animes Ever\" anime, but it is worth watching if you're into the Echii/Harem stuff.\r\nStory wise... cat girl is sent to \"protect\" a childhood friend from demons that want to kill him. That's the main story right there. Along with some side stories added to it, it turned out pretty decent. For every couple episodes, new characters joined the show and the story got more interesting. Well done, although at points it seemed a little slow.\r\nArtwork, it'syour average anime made within a 3 year period. The art was clear and colorful, but it seemed fairly average for an anime, and it's not just the scenery, it goes for the characters too. I feel like I've seen them before even watching the show, so they had common faces from other animes I've watched. I'm not complaining, the art went well with the show, but I would have liked to see a little more creativity.\\n\\n\r\nSound was good, voice actors did their role well, and I'm hoping that one day if this is dubbed the voice actors will do just as good. SFX were also well done, for the few battle sequences the show had, it was really impressive.\\n\\n\r\nCharacters... like I said before, the artwork could have been a little more creative. And it's not just the artwork they could have added more creativity to, the character's personalities should have been more unique. Like ALL echii/harem animes I've ever seen, there is always a silent character, a loli character, a strong/scary character, a character that is all lovey-dovey, etc. Even though these traits fit the characters, I would have liked to see something different for a change. I did like all the characters though, none of the characters turned out to be total jerks or annoying to me, which is interesting because there is almost ALWAYS at least one character in this kind of genre that gets on my nerves in every anime.\\n\\n\r\nI enjoyed the most of it, had some good comedy, good action scenes, interesting plot, and a whole lot of fanservice... but most of it ties in with the comedy part of the show. Overall it was good. I wouldn't rewatch it over and over again, but I will rewatch it some day when I am in the mood for it. It's worth watching. \\n\\n\r\nSolid 7.",
            "date": "2012-12-02T13:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 78980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=78980"
        },
        {
            "content": "Plain and simple: the artwor is well done, the voices matched characters to a point, and the plotline for this story, even if common, is still good. However, the charactersb are all pathetic. A character dictates how well a show is....the main character's motivation to do anything is weak. Clearly most of the characters fight for the sake of Amakawa, their reason being that they lik him and there are even reasons for why they like him, yet he is an inconsistency in the story....hehas no motivation to fight, even if he is kind his \"wimpy\" attitude to every situation is annoying and it takesmountains to be crushed before he dos something useful if he even does anything at all. His character is supposed to be the base for all the other characters, yet reality would show most people would never follow a guy like that. The story could have progressed in a number of ways to make the show good, yet it took crappiest and did not live up to the potential. Overall...this show is no good unless you want senseless fanservice.",
            "date": "2012-03-03T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 55241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1179185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/akatsukikaras",
                "username": "akatsukikaras"
            },
            "url": "https://myanimelist.net/reviews.php?id=55241"
        },
        {
            "content": "This is my first review about an anime\r\nStory 7/10\r\nA story about a guy named Amakawa Yuuto who wants to live a normal life, then a girl named Himari who is an Ayakashi and also a cat comes into his life. As the story keep going, more Ayakashi are introduced. The ending is too boring, and there are no romance at all\r\nArt 8/10\r\nThe art is not a problem for me\r\nSound 6/10\r\nThe music is not so bad, but some of them are really annoying. The OP and ED are not too bad\r\nCharacter 4/10\r\nIn my opinion, the most annoying one is Rinko. I admit that she's beautiful, butshe is a normal human, and she should stay away from the Ayakashis because she is pathetic. This is probably the only part I hate from the story.\\n\\n\r\nEnjoyment 5/10\\n\r\nSeriously, this anime is too boring for me. I can't enjoy this anime to the fullest.\\n\\n\r\nOverall 6/10\\n\r\nThe producer are too concerned about the harem storyline. The actions are suck! Seriously, I know they can make a better one than this!",
            "date": "2014-01-30T09:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 130799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512949.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PitchBlack99",
                "username": "PitchBlack99"
            },
            "url": "https://myanimelist.net/reviews.php?id=130799"
        },
        {
            "content": "The plot of the anime follows the manga for the first few episodes\r\nand then just goes to pieces on the last few episodes\r\nthe artwork could definitely be better\r\nfalls in the genres of Action, Comedy, Demons, Romance, Harem, Supernatural  what you will see is fan-service, cliches, fan-service, loli-action, fan-service and a lot of ecchi but the plot sucks near the end\r\nI don't know if the plot at the end is what will happen in the manga, but\r\neverything was rushed",
            "date": "2010-03-26T07:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 24336,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/258028.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Phanotak",
                "username": "Phanotak"
            },
            "url": "https://myanimelist.net/reviews.php?id=24336"
        },
        {
            "content": "Decent Ecchi/harem/action anime with plenty of fan-service, but if you're like me and dislike weak MC's I would probably pass on this show. The main character belongs to the group of MC's that instead of helping people when they're getting beat up just yells their name over and over again. The story is decent for the genre, and the characters are fairly well developed. Only complaints are that the art seems kinda meh, the animation isn't super great like a lot of pre-2015 shows, and its hard to find online above 360p quality. Although I think overall it's an alright show, there are definitely alot of similar shows that are better. I'd only watch this if you have nothing better or don't really care about a show having a very engaging story.",
            "date": "2018-10-13T18:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 291666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7491483.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Skoll_Talks",
                "username": "Skoll_Talks"
            },
            "url": "https://myanimelist.net/reviews.php?id=291666"
        },
        {
            "content": "This is a pretty solid romcom action anime. The cast of characters was interesting, and most of the main characters got solid character development, with the only real exception I feel being Rinko who feels somewhat out of place at times. The central theme of co-existence between humans and non human entities, in this case mostly Ayakashi, is something that's pretty overused, but it was still used effectively here, wherein it didn't spend as much time on discussing the theme itself, rather it stood as something that Yuuto simply believed in and the actual implementation of the theme was more so in regards to howthat effected his relationship with other characters. The plot started out somewhat slowly when it was simply introducing characters with a really light hearted tone, but by the time it reached its final arc the story has gotten a lot more intense and involved, which managed to benefit from the investment the viewers had gotten in the characters from the less involved portion. Though I should note that the light hearted moments don't go away and the comedy, which is solid, is a core part of the anime throughout. The action wasn't tremendously great, not really having much mechanical complexity at all, but there was a variety of powers and such in play that still made it interesting, and it was flashy so overall I would have to say that it was quite enjoyable. The finale was really good and ended the anime incredibly well, and though from what I understand they had to diverge from the manga in order to do so, I suppose that it was worth it as the ending was quite satisfying, though I felt the Public Affairs agent deserved worse than he got.\\n\\n\r\nThe style and designs I thought were quite great, especially Himari's purple standard fighting outfit. The animation and art felt somewhat dated though. The soundtrack was quite good, and OP/EDs were great as well, with the changes to the OP each episode being a nice touch.\\n\\n\r\ntl;dr: A solid action rom-com featuring a solid plot and a great cast of characters.",
            "date": "2018-10-13T11:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 291644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=291644"
        },
        {
            "content": "So ill first state this if your not a fan of a weak main guy is afraid in a romantic of the girls or boobs just push in your face than dont watch this otherwise ill get into it\r\nStory: so the story starts out with yuuto is a demon slayer but also walking too school just too get attack by a Ayakashi than a cat girl version of them comes in and actually tells yuuto that he is a demon slayer and that this thing that was protecting him no longer is and now she is his bodyguard and has too protect yuuto from thisAyakashi who are coming after him\\n\\n\r\nArt: the art was very good nothing to complain about with this\\n\\n\r\nSound: now the op and ed were not the greatest but good also the sound was very good\\n\\n\r\nCharacter: now with this i actually loved all the characters in this i loved all of the characters in this anime yes even the main character as i like that type of character yuuto is\\n\\n\r\nEnjoyment: now i hella enjoyed this anime from the comedy too just all the fun stuff that would happen with yuuto and all the other girls with him the action was decent and yes the ecchi was very good aswell\\n\\n\r\nOverall: gotta give this a 9 for sure the comedy was just pure gold too me also the relationship that yuuto and himari had i just loved\\n",
            "date": "2016-09-09T23:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 228677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=228677"
        }
    ],
    [
        {
            "content": "A Nyan Koi rip-off? Not really. For those who have read the synopsis and went on that basis, let me stop you there. While the similarities of cat-allergies are familiar to each anime, that's pretty much it that each tale will share.\r\nAfter episode 1, I was actually surprised to want to watch the next episode due to how close the show stuck to the manga's storyline. With a long line of let-downs in the last year for adaptations, I had made sure not too have to much of an expectation for this show, and I'm glad I did as its proven to be just abovewhat I had hoped for.\\n\\n\r\nWithout going into detail, Omamori Himari is the story of Amakawa Yuuto, descendant to a long line of demon slayers, and his kick-ass sexy feline guardian Himari Noihara(demon neko-mimi or cute puss-in-boots for you westerners). Add in a 'tsundere' childhood friend, a loli, a maid waitress, and an  'ojou-sama' like fiancee and you have the rest of Yuuto's \"cliched harem\" as they try to handle co-existence with youkai(demons) and humans alike due to Yuuto being casted as one of those  sensitive new age guy who doesn't like violence(the type of nose-bleeding harem male you love to hate) \\n\\n\r\nNow this show falls in the genres of Action, Comedy, Demons,  Romance, Harem, Supernatural....which sound like ingredients to a great plot and story, but coming from a creator who's previous works are hentai, what you will see is fan-service, cliches, fan-service, loli-action, fan-service and a lot of ecchi(as a male I have no problem with that....oh and did I mention fan-service?)...well I guess the benefits of a H-mangaka is that you can expect the artwork to be top-notch. From the 3 sizes(of each heroine) to Yuuto making out with a few of the leading ladies, they've made sure to cover the right angle shots in detail(which some will find very ero-ero....if you can get past the censorship that is...hopefully there'll be none of that when DVD gets released).\\n\\n\r\nThe OP and ED are ok but not something to start looking out for on your next karaoke session and the BGM can be classed as elevator music(well not as bad). As for the voice actors, you have a great line up of seiyuus(Tenma from School Rumble being Himari as an example, and the cute Kuro from Kodomo no Jikan as Shizuku for those loli-lovers ^nano). The only thing I wasn't pleased with is Yuuto's VA, which I feel they've miscasted. Those who've seen School Days should know what I mean. Everytime I hear Yuuto's voice whilst Himari's trying to flirt with him, I get that spine-cringing feeling that someones out of place. I do feel sorry for that seiyuu as its not his fault for being the VA to Makoto(probably the most hated male lead in all of harem time), but he just does not suit being a harem lead. \\n\\n\r\nAll-in-all without discriminating the show from the seiyuu, Omamori Himari is a worthwhile anime to watch. From the producers ZEXCS(who gave us Regios, Rental Magica and *vomit* Da Capo), here's hoping they don't stuff this one and give us a bad ending, or in Makoto's term a \"nice boat\"....\\n\\n\r\nIf your looking for Nyan Koi replacement, I'll advice you now your not going to get it. As long as you don't come with no expectations, I can safely vouch that this anime will aim to please",
            "date": "2010-02-03T05:45:00+00:00",
            "helpful_count": 56,
            "mal_id": 22914,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=22914"
        },
        {
            "content": "Hey guys, this is my first review! :D\r\nOmamori Himari is a Super-natural Ecchi/Harem anime with action scenes and romance.. Maybe more than that, hehe.  It is like any other Ecchi/ Harem anime out there but this shouldn’t be a problem if you are into that. I will try not to give any spoilers but If I do, I apologize. \r\nStory 6/10.\r\nThe story is involving a guy named Yuuto, who lives alone due to his parents dying in a car accident. He is an average teen, but he is allergic to cats. Then there are the Ayakashi, or the demons. There are some Ayakashi thatare evil and some that are not. On Yuuto’s 16th birthday as he was walking to school, meets a strange girl with a katana named Himari. Himari appears to be an Ayakashi but she oaths to protect him from evil. \\n\\n\r\nSound 7/10\\n\r\nThe sound was mainly blah and didn’t really touch me. The sad OST’s do not sound that great but the action OST’s are fine. Opening theme song was good and the ending was good as well. The voice acting in Omamori Himari is very very good (English Subbed). Extra details are added when the main character is getting seduced by Himari making sounds like “Oh my goodness, please do not.. I’m very very shy.. OooAWawoo.” The voice acting for the female was very good and not annoying at all.\\n\\n\r\nArt/Animation 9/10 \\n\r\nYou can surely enjoy the art and the animation in Omamori Himari, the fighting scenes are not that great because it doesn’t really make any sense. The art is very well done like any other ecchi/harem series with the Chest and other areas appealing for a lot of people. Overall the art was very well drawn and the animation was great.\\n\\n\r\nCharacters 3/10\\n\r\nThe main character is a “Weakling” who gets protected from 4 ladies at ALL times. The other females (Except from Himari) did not make any sense at all. They were basically there to fill the show in for 12 episodes. Himari is willing to do anything for her “Young Master, Yuuto – Kun” going far as having intercourse with him. I was very displeased with the characters and thought they could do a better job with it.\\n\\n\r\nEnjoyment 10/10\\n\r\nAs an ecchi/harem fan, I really liked this series. But for the people that dislike these genres, this anime is not for you as this has a lot of “sexy” stuff in it. However if you are into this, this anime can be very very enjoyable like I did. \\n\\n\r\nOverall 7/10\\n\r\nI would suggest you watching this anime if you are into Ecchi/Harem/Action/Supernatural. \\n\\n\r\nOther Recommendations of the genres listed above would be: Rosario To Vampire, Rosario To Vampire Capu2, Highschool DxD, Highschool DxD NEW.\\n\r\nFor Just Ecchi/Harem : Princess Lover, Ichiban Ushiro no Daimaou, Freezing, and Sekirei. \\n\\n\r\nI thank you for reading my review, and I hope you have a nice day.\\n",
            "date": "2013-08-25T17:17:00+00:00",
            "helpful_count": 38,
            "mal_id": 111197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2944781.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/10makunn",
                "username": "10makunn"
            },
            "url": "https://myanimelist.net/reviews.php?id=111197"
        },
        {
            "content": "Yet another ecchi show aired this  year proves that trivial things like plot or characters' depth might end solely as a bonus to the brainless fanservice. And I wouldn't mind that!\r\nOmamori Himari, though, was one of the worst and least enjoyable anime shows I've watched lately.\r\nAgain, normally, I wouldn't mind fanservice>everything else design, as long as it's at least decent. This anime, though rated R+ lacked it at all!\r\nIt's not like I'm watching the show solely of the fanservice purposes, but this one has literally nothing else to offer.\r\nArt isn't horrible, but mediocre at it's best.\r\nCharacters' design is tedious  and ordinary. Backgrounds areboring and dull-looking. Overally bland.\\n\\n\r\nSound doesn't highlight much. Music is that typical that it hurts. Not interesting at all.\\n\\n\r\nPlot lacks plot, mostly slice-of-life except few episodes. Dialogues are dull, usually too long and boring. Characters are shallow, lackluster and stereotypical.\\n\r\nOverally very predictable and beat.\\n\\n\r\nIn general anime is bad and very tiresome. I don't suggest watching unless you expect nothing or get entertained very, very easily by boring stuff.",
            "date": "2010-05-05T07:04:00+00:00",
            "helpful_count": 36,
            "mal_id": 25755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199580.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nekonyan",
                "username": "nekonyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=25755"
        },
        {
            "content": "I suppose the easiest way to sum up what I've seen so far are these two words: Uninspired and dull.\r\nEverything you can see in this anime has been done multiple times before in so many better series, so if your after originality then you shouldn't bother watching this.\r\nThe good thing about Omamori Himari is the fact that it will appeal to most fetishes out there: Lolicon, maids, cat-girls and what-not. Buts that probably the shows only redeaming feature, and even then its only good if your into that kind of thing.\r\nI'm quite glad theres only a week left of this as there really hasn't beenany building up to a finale, everything just feels like another episode rather than something meaningful.\\n\\n\r\nTo sum this up; If you like having boobs and panty shots thrown at you then you'll probably like this, though if you want something with a bit of depth or action that is actually good then I'd advise to stay away from this.",
            "date": "2010-03-20T13:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 24135,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284602.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Xavierxenon",
                "username": "Xavierxenon"
            },
            "url": "https://myanimelist.net/reviews.php?id=24135"
        },
        {
            "content": "Omamori Himari\r\nThis anime was my first Ecchi/Harem anime and it was very good...\r\nStory\r\nThe story is about this young boy named Yuuto that has a normal life and is allergic to cats, one day he trips with this girl called Himari then he finds out she is a cat/girl and is allergic when she gets close to him, but there's something he doesn't remember and that is she is his protector and gives him an Omamori (amulet) that keeps the enemies away from hurting him, he will meet a lot of girls that will care for him and they want to be with him, they willhelp him to retrieve back his memory to know what he should do. The story is good.\\n\\n\r\nArt & Animation\\n\r\nThe animation was very good, it's an ecchi after all, it has to be, there were irregularities sometimes but i thought it was very good.\\n\\n\r\nSound\\n\r\nThe sound overall was good, the VA was good too and the music background was ok, the OP and ED were ok.\\n\\n\r\nCharacter\\n\r\nThere's a lot of characters to see here, all of them well developed, your typical harem where there are a lot of girls with big boobs or naive girls or the ones that falls for the MC with his back story but this was very good because of the bunch of boobs and babes there are.\\n\\n\r\nEnjoyment\\n\r\nBeing my first Ecchi/Harem i enjoyed more this anime because of those elements and the action scenes were good and boobs of course.",
            "date": "2015-08-03T01:38:00+00:00",
            "helpful_count": 26,
            "mal_id": 195052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195052"
        },
        {
            "content": "it's a great anime it has a manga to and if u like ecchi, romance,action(good fight scenes indeed) u found ur anime its really a great anime.\r\nits about a boy named Amakawa Yuuto he is a demon slayer(and has the blood of amakawa it gives power to the demon slayers but there are other clans they got their own powers and blood)but in the centry we live they dont need demon slayers or they thouth.then he encounters demons but he doesnt have training to kill them becouse of his family.so there comes our cool savior cat himari he protects yuuto then he encounters many otherdemons some of them will join him and some of them will do everything to kill him \\n\\n\r\nstory: its interesting and never gets boring 10\\n\r\nart: its super gooood 10\\n\r\nsound: its cool and good 10\\n\r\ncharacter: cooool \\n\r\nenjoyment: from the beginin to the end its AWESOME so its ok\\n\r\nOVERALL: 10",
            "date": "2010-02-06T15:30:00+00:00",
            "helpful_count": 10,
            "mal_id": 22993,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291600.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chingstah",
                "username": "chingstah"
            },
            "url": "https://myanimelist.net/reviews.php?id=22993"
        },
        {
            "content": "Ecchi and harem, they go hand in hand in the anime industry and are two of the most popular genres within the otaku culture, but this is widely known, so the question is: Does this anime have anything else to offer other than fan-service? \r\nIt's answer is: No, while it does have a plot and has some action mixed into it, this kind of a story could be from a kid's dream for all I know.\r\nSo after stating that this has no story where does this enjoyment come from, the fan-service obviously, while plot wise it is bad, the way it introduces characters and createsfor the situations it has, it does relatively good. The \"plot\" revolves around a guy named Amakawa Yuuto, who is your ordinary high school student, nothing more than that, he has his caretaker (a tsundere) wake him up and tend to him for most of the time. Until one day he wakes up with a cat in his face (a catgirl, childhood friend) and they start out their adventures from that point.\\n\\n\r\nBut a story with only fan-service in it has no chance of getting an anime, so they added action/magic theme to it, which is fine in terms of content, we get to see a variety of magic they creator thought of when he added powers to his characters, the action itself is actually a bit good, they have some good fights which aren't only for the sake of fan-service. \\n\\n\r\nLastly in the story, I would like to address the episodes and their content, while it has a bad plot and no real character background, it doesn't have the cliché episodes and has some episodes with original stuff happening in them. \\n\\n\r\nArt-wise it is good, like surprisingly good, the boob physics are used without holding back and the characters look colourful and vivid.\\n\\n\r\nSound-wise, it is decent, nothing amazing or outstanding which piqued my interest, seiyuu wise, most of them you can probably recognise and if not, you will later as they play lots of roles in different anime.\\n\\n\r\nNow to add up on that tsundere and catgirl, childhood friend stereotype, we can add: a loli kuudere, clumsy maid and childhood friend 2. By summing all these up you can come to the conclusion that every cliché harem character is present, although I do say that, some of them have their own variations from their archetype, but honestly, most of them are textbook cliché characters.\\n\\n\r\nOverall I though Omamori Himari was quite a weak anime, but there is worse out there, a lot worse, it made up for its no-plot with decently good fights and the fan-service was not half bad.\\n\\n\r\nStrong points:\\n\r\n- Fan service has some nice variety to it.\\n\r\n- The episodes have some decent content in them.\\n\r\n- The fights in the anime are good, cliché and overused, but entertaining.\\n\\n\r\nWeak points:\\n\r\n- Textbook characters. Including the weak protagonist.\\n\r\n- Weak plot, which doesn't get any expansion on in the anime.\\n\r\n- Nothing special about its sound part.\\n\\n\r\nSo if you are looking for a classic harem ecchi with some decent fights and episodes (in terms of content) and don't mind the weak characters, then Omamori Himari is the anime for you.",
            "date": "2012-08-11T11:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 69441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191455.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Karpman",
                "username": "Karpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=69441"
        },
        {
            "content": "Story: 1/10\r\nI'm not the biggest harem or fanservice fan, but I don't mind if they have a good story and likeable characters. But instead of a good plot with fanservice, it's fanservice with little plot. \r\nI knew all hope was lost when the generic fanservice beach episode was the second one. Then episode 3 was written around fanservice. 'How can we make Himari's breasts/panties show this time?\". I wanted to give it a chance, it sounded interesting and for the most part ecchi doesn't bother me. I mean series like 11 eyes, for example, find ways to write fanservice into a scene, but in thisseries, they try to write a scene around fanservice. It's pointless! And the thing is, it even has potential to be a good story! Demon slayers, demons, magic powers etc. Sounds like it could be a good fantasy story, but alas no. They might as well have taken the clothes out completely and made it a hentai. And I've seen hentai with more story.. \\n\r\nThere are maybe 3 episodes out of 12 that relate to the \"plot\". \\n\\n\r\nCharacter: 3/10\\n\r\nAll of the villains tend to be large breasted females who also lust over the main character (and for what reason I don't know). The main male character barely looks a day over 12, yet is getting fondled and dry humped by a lot of women who look many years older than him (except one, who looks like an elementary school kid. She heals him by rubbing against him until she gets off). Of course he has his cliche annoying possessive female friend, and the the large busted bodyguard. However, I actually like Himari. She's pretty well rounded (and not just her chest). She's also a powerful cat demon that fights with a sword- what's not to like? She also shows the widest range of emotion. Really she's the only character worth mentioning.  \\n\\n\r\nOverall, unless you watch an anime for just breasts and pantyshots and no story, this is not one I'd recommend. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2011-04-06T22:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 35767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/247399.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Galactic_Kitten",
                "username": "Galactic_Kitten"
            },
            "url": "https://myanimelist.net/reviews.php?id=35767"
        },
        {
            "content": "I remember when I first read the manga to this. I enjoyed every bit and the first signs that I would equally enjoy the anime appeared when I found myself smiling at the list of winter 2009 new releases.\r\nAbout just another high schooler living his life up until his demon repellent charm expires, making him vulnerable to demons, youkais, and monsters alike. Why are these demons after him? He's from a family of demon slayers and the rest goes along without much relevance to what's really important in the anime.\r\nWe have the childhood friend, starting off at square one of this harem. Then a demoncat guardian (Himari of course) appears to save him from his first demon attack. Shizuku gets dragged in after witnessing Yuuto's compassion for innocent demons. Lizlet sticks along after Yuuto \"saves her life\". And another childhood friend, apparently long lost, a demon slayer like Yuuto and my favorite of them all Kuesu Junguji.\\n\\n\r\nIt's a harem anime, what's there to expect? Loads of boobage and underwear scenes of course. Being cat themed, we also get a bit of neko ears in the mix as well.\\n\\n\r\nThe plot isn't that much important. I say the most interesting thing was Himari's quest to earn a mouth to mouth kiss with Yuuto with I enjoyed watching.\\n\\n\r\nAlthough I wish it would've been longer and a bit more closer to the manga (for the benefit of the plot) I am very much satisfied with the 12 eps I received and hope with all my heart we get a little more content out of this.\\n\\n\r\nOne thing that stuck out to me was the music. BEAM My BEAM (ED theme) was the best ending theme I've heard in a long time. Possibly the best out of the winter 2009 - Spring 2010 anime EDs. Same for the OP as well. I loved all the songs.\\n\\n\r\nIf I could wish for anything more of this anime. I would ask for Character albums with at least 2 songs for each character as well as a different version of the OP and ED themes.\\n\\n\r\ntl;dr: It's good, watch it before you start your next series in line.\\n\\n",
            "date": "2010-05-19T08:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 26199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=26199"
        },
        {
            "content": "When you first look at Omamori Himari, you may think that it is just like every other Harem anime out there.  Where Himari really pulls ahead and shows that this is a very different anime is but the way all of the characters interact with not only the main male lead Yuuto, but with the other girls that have come to follow him.  In most of your harem anime the first girl that you meet is most of the time your air head who just likes to do a couple things. In this anime they do not introduce the air head until laterin the anime and not as a critical character. The first two girls that you meet are one of Yuuto's childhood friend, Rinko and the cat demon Himari. Right there you have the smart friend who wants to help Yuuto as much as she can and the other is the always loyal bodyguard.\\n\r\n\tThe story to Omamori Himari is not bad. The ending left it open for a second season, but they gave you enough to feel satisfied when it is over. Throughout the anime, the writer is always introducing new characters; some may play a bigger role and sometimes just the normal additions. They play a part that would be very different if they were not there. Between the voice and the characters, the producer of this anime did a good job. All of the voice actors fit the personality of the character that they were playing.\\n\r\n\tGive this anime a chance I know that it will make you want to keep watching until there are none left and all you can is watch it over and over again.\\n",
            "date": "2010-06-23T19:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 27497,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/112259.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/valdrane",
                "username": "valdrane"
            },
            "url": "https://myanimelist.net/reviews.php?id=27497"
        },
        {
            "content": "How should I describe Omamori Himari in a way that does not downplay it's worth of your time? Well if you like your anime to consist of at least three pathetic main characters who do nothing but bitch about how weak they are then you'll be fine. Then about 1/2 of the time watching you will see nothing but tits, panties, and more tits. Which isn't that bad if your looking for just that. It also has a decent but half-assed story line for those of you who wish to seek a half-assed enjoyable tale. \r\nSTORY: 6\r\nI'll be blunt. The story falls short of achievinga memorable tale and exciting adventure. There wasn't so much a problem to where the story was going but to where it DIDN'T GO. There were many questions left unanswered which only left me miffed. Like what concluded at the end. *SPOILER* Mɥʎ ʇɥǝ ɟnɔʞ ıs ┴ɐɯɐ ıu ⅄nnʇo,s ɥonsǝɥolp¿ ∀ɟʇǝɹ ɐll sɥǝ pıp ǝɐʇ ɐ sɥıʇ loɐp oɟ ɥǝɹ oʍu ʞıup ɟoɹ ɥǝɹ dǝɹsouɐl ƃɐıu˙ ∀up Hıɯɐɹı pıp qǝɐʇ ʇɥǝ lıʌıuƃ ɔɹɐd onʇ oɟ ɥǝɹ˙ I ʞuoʍ ſǝsns sɐʎs ɟoɹƃıʌǝuǝss ıs ɐ ʌıɹʇnǝ qnʇ ɔoɯǝ ou¡ Mɥɐʇ¿ ∀ɹǝ Hıɯɐɹı ɐup ⅄nnʇo ƃoıuƃ ʇo ʞǝǝd ɐ ɔɐuuıqɐlısʇıɔ uıuǝ-ʇɐıl ɟox ʍɥǝɹǝ ʇɥǝʎ slǝǝd¿ ∀lso ʍɥɐʇ ɥɐddǝuǝp ʇo ʇɥǝ ɯosʇ doʍǝɹɟnl ∀ʎɐʞɐsɥı¿ ∀ddɐɹǝuʇlʎ ʇɥǝɹǝ ɐɹǝ Ɛ oɟ ʇɥǝɯ˙ )┴ɐʎnʇɐɯɐ ɥɐs ʇɥǝ sɐɯǝ unɯqǝɹ˙ I ʍoupǝɹ ʍɥʎ¿( ┴ɥǝɹǝ,s ɾnsʇ so ɯnɔɥ ɔɹɐd ʇɥǝʎ lǝɟʇ onʇ ıʇ,s ǝuonƃɥ ʇo ɯɐʞǝ ɐ sǝɔoup sǝɐsou˙ Mıll ʇɥǝʎ¿ SHO∩˥p ʇɥǝʎ¿ I pou,ʇ ǝʌǝu ɔɐɹǝ ɐuʎɯoɹǝ ʎon pǝɔıpǝ ıɟ ʎon ʍɐuʇ ʇo ʍɐʇɔɥ ʇɥıs ɔɹɐd˙ ∀up ıɟ ʎon ɟlıddǝp ʎonɹ ɯouıʇoɹ ndsıpǝ poʍu ʇo ɹǝɐp ʇɥıs ʎonɹ ɹǝʇɐɹpǝp˙ *END OF SPOILER* (If you want to read the spoiler try Googling \"upside down text\".)  Due to this glass being only half-way filled I found it quite similar to \"Tayutama: Kiss on My Deity\". Both have this issue of incompletion and both have their main protagonists seeking coexistence. However, I find that \"Omamori Himari\" did execute its story a lot better than its counterpart Tayutama. But it still failed to succeed where Tayutama also failed. And that was its useless characters and the unsatisfactory ending. Where it could have easily continued through a 2nd season and hopefully redeem itself through a well thought out conclusion. While there were many ecchi moments and romantic endeavors occurring everywhere in the story frequently, there was also a good portion of action involved which was very much welcomed. It could have been more gruesome and violent as it had a few scenes which seemed to beg for a violent outcome but this anime was aiming more for an ecchi/romance audience. Again, it could have done much worse than what other anime's who are KNOWN for gruesome scenes have done, *cough* Elfen Lied *cough* but the way it handled its plot it seemed to lean more towards Otaku's who love to see a Tig Ol' Bittied heroine.\\n\\n\r\nART: 8\\n\r\nI very much enjoyed the art of Omamori Himari. Not because I had a hard on most of the time since it showed so much tit and ass but because...OK so the tits and ass were drawn very erotically and nicely. To the point where I didn't care about the story anymore. All I cared about was \"Are they...are they going to show me the nipples now or do I have to go watch a hentai?\" \\n\\n\r\nSOUND: 9\\n\r\nThe music was OK and the sound of the characters fighting, arguing, etc is the same as any other anime and no different in anyway. TBH I don't even know why there is a sound section in reviews. Pretty much ALL anime's sound the same except for the voice actors, music, and special effects. And if the anime's do sound a bit off (or entirely) it probably is your speakers, download of the video, or streaming source.  They should just name this section \"Music\" or \"Actors\" IMO. Speaking of actors Bleach's Orihime is in here and so is the voice of Makoto (School Days) as the main protagonist. And if your familiar with the voice of Nymph from \"Heaven's Lost Property\" and Erio from \"Denpa Onna to Seishun Otoko\" you'll probably :D. In addition to all of these underrated voice actresses/actors apparently Holo is our main heroine. \\n\\n\r\nCHARACTER: 6\\n\r\nHmm...don't know how to start this part out as the character list defines all of them almost perfectly. So I don't really see the point in addressing this part of the review. I guess I could only just review how they brought upon themselves the belief of them being an actual character that has worth in the show. You've got:\\n\\n\r\nHimari: A VERY sexy feline Ayakashi who serves as the body guard of our main faggot obviously. She has real nice tits...and ass...and..FUCK! I've paid too much attention to the fan-service that I practically forgot how she is. Let me see if I can remember...hmm....DAMN YOU FAN-SERVICE! \\n\\n\r\nShizuku: Um...why does she remind me of Nozomu from Kanokon? (That anime was TERRIBLE by the way) \\n\\n\r\nYuuto Amakawa: This guy is a FAGGOT and a PUSSY. (Not the feline kind) THAT IS ALL. \\n\\n\r\nLizlet L \"Liz\" Chelsie: She basically is in the show purely for comedic relief and fan-service. Nothing about her is interesting...AT ALL...other than she's a fucking teacup lol. \\n\\n\r\nKuesu Jinguuji: I didn't even give a shit about this bitch. OK MOVING ON! \\n\\n\r\nRinko Kuzaki: This pathetic use of a script and character reminded me of Kazumi from Shakugan no Shana. (Who I deeply hate with a passion) You wanna know why? She's practically an EXACT REPLICA OF SAID BITCH. Almost everything about her (excluding her voice actress) is exactly like her! Especially her uselessness. I don't know why the developers even put her in the show. She just gets all pissed when Himari try's to get it on with the main faggot. (Just to let you know I shall refer to him as faggot as he is indeed a faggot) Everything else is just her trying to claim faggot as her own. And if you think I'm wrong about her being a clone GTFO right now and watch SNS and then tell me she doesn't look and have the talent of being useless just like  Kazumi. \\n\\n\r\nENJOYMENT: 6\\n\r\nI did enjoy \"Omamori Himari\" I will not lie. It's got good ecchi moments if that's what your looking for but with a mix of some action and plot development as well. Although it wasted a lot of potential of being beyond a typical Action, Comedy, Demons, Ecchi, Romance, Harem, Supernatural anime it still manages to do just fine. Which suits its score perfectly. Its just a fine anime.\\n\\n\r\nOVERALL: 6 \\n\r\n If you like tits but no nipples, ass but not so much as the tits, and some plot and action development in between, then \"Omamori Himari\" just might be for you. Otherwise steer clear of this ecchi fest. And if your pissed that I wasted your time then blame yourself faggot. Your the one that decided to read a review than to go watch the damn anime in question. And this is just my personal opinion. That's what reviews are for! To let the ass who wastes their times writing these reviews express their ideas and feelings about the thing in question. Go ahead...click that \"Not Helpful Button\" I DARE YOU.",
            "date": "2012-02-29T21:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 55101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Golden_Darknezz",
                "username": "Golden_Darknezz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55101"
        },
        {
            "content": "If you are looking for an anime with an extremely good story and a strong main male character, leave this very second, this anime has none of those things. If you like bouncing boobs and a hot main female 'exposing herself' in front of our main male, then your in for a treat.\r\nStory:7\r\nThe story wasn't bad compared to shows like Kanokon and some other shows that have completely no story and are episodic anime. Rosario to Vampire just barely pulled it off, so I was glad when this anime had an actual story. That doesn't mean they pulled it off perfectly. Guess they just plainlyshould have had more experience. But it is still an enjoyable story.\\n\\n\r\nArt:10\\n\r\nThis art is simply amazing. Simply amazing. Blew me away as the great design and the immense detail immerse you in the storyline, at the very most making you want to be there. I see absolutely nothing wrong with the art and everything that I wanted was there, this includes the art of bouncing boobs, even THAT had good artwork.\\n\\n\r\nSound:9\\n\r\nI see nothing wrong but nothing outstanding about the sound quality of this anime. I guess since it's not dubbed it doesn't matter anyway.\\n\\n\r\nCharacters:4\\n\r\nLet me tell you something Ecchi-anime makers. WHY IS THE MAIN MALE ALWAYS SO WIMPY? This is what is wrong with pretty much every ecchi anime in existence, save for High School DxD, which in the novels states Issei is extremely strong. I would give this anime's character score a ZERO if it weren't for Himari and Kuesu. So many Lolis on this goddamn show, I think there is 3 or something.\\n\\n\r\nEnjoyment:7\\n\r\nThis anime can still be enjoyed, even with that wimpy main male. It did leave me wanting to watch more and more, which is something that some anime don't really give at all. If you are new to ecchi anime altogether, you might wanna try this. \\n\\n\r\nOverall:7\\n\r\nOverall, this anime is a great one to watch and I would reccoment it to everyone that fits the requirements of the first lines of this review.\\n\\n\r\nThanks!!!",
            "date": "2014-02-27T20:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 134117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Honjitsu",
                "username": "Honjitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=134117"
        },
        {
            "content": "I drew a wrong stick..so i have to review this..Damn it\r\n  So the story is about a boy from the 12 legendary demon hunter clans but he doesnt know it.A cat-woman(+1) gets to be his guardian and as the anime goes on this damn boy gets a harem..my god im jealous.This anime also has heavy fanservice(dont let your children watch it) so older people might enjoy(themeselves huehue).\r\n  Characters are mostly huge breasted..or at least big(except1) and the main character is the clicheic weak MC who grows stronger.\r\n  Sounds are pretty good so i wont pick on them..they were decent.\r\n  The artwas good...you know that i mean here.So i wont descrive it any further\\n\\n\r\n  I enjoyed it and i do recomed it if you can stand all the *ahems*...\\n\r\nIt wasnt that bad,it was quite decent and also has fight scenes(watching for the plot only..) so it is worth giving it a go.",
            "date": "2016-01-27T01:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 209447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4972556.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NineNTG",
                "username": "NineNTG"
            },
            "url": "https://myanimelist.net/reviews.php?id=209447"
        },
        {
            "content": "Omamori Himari was one of the first animes I'd watched over my \"Summer Anime Marathon\" and I can say it was good. It wasn't a \"One of the Greatest Animes Ever\" anime, but it is worth watching if you're into the Echii/Harem stuff.\r\nStory wise... cat girl is sent to \"protect\" a childhood friend from demons that want to kill him. That's the main story right there. Along with some side stories added to it, it turned out pretty decent. For every couple episodes, new characters joined the show and the story got more interesting. Well done, although at points it seemed a little slow.\r\nArtwork, it'syour average anime made within a 3 year period. The art was clear and colorful, but it seemed fairly average for an anime, and it's not just the scenery, it goes for the characters too. I feel like I've seen them before even watching the show, so they had common faces from other animes I've watched. I'm not complaining, the art went well with the show, but I would have liked to see a little more creativity.\\n\\n\r\nSound was good, voice actors did their role well, and I'm hoping that one day if this is dubbed the voice actors will do just as good. SFX were also well done, for the few battle sequences the show had, it was really impressive.\\n\\n\r\nCharacters... like I said before, the artwork could have been a little more creative. And it's not just the artwork they could have added more creativity to, the character's personalities should have been more unique. Like ALL echii/harem animes I've ever seen, there is always a silent character, a loli character, a strong/scary character, a character that is all lovey-dovey, etc. Even though these traits fit the characters, I would have liked to see something different for a change. I did like all the characters though, none of the characters turned out to be total jerks or annoying to me, which is interesting because there is almost ALWAYS at least one character in this kind of genre that gets on my nerves in every anime.\\n\\n\r\nI enjoyed the most of it, had some good comedy, good action scenes, interesting plot, and a whole lot of fanservice... but most of it ties in with the comedy part of the show. Overall it was good. I wouldn't rewatch it over and over again, but I will rewatch it some day when I am in the mood for it. It's worth watching. \\n\\n\r\nSolid 7.",
            "date": "2012-12-02T13:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 78980,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=78980"
        },
        {
            "content": "Plain and simple: the artwor is well done, the voices matched characters to a point, and the plotline for this story, even if common, is still good. However, the charactersb are all pathetic. A character dictates how well a show is....the main character's motivation to do anything is weak. Clearly most of the characters fight for the sake of Amakawa, their reason being that they lik him and there are even reasons for why they like him, yet he is an inconsistency in the story....hehas no motivation to fight, even if he is kind his \"wimpy\" attitude to every situation is annoying and it takesmountains to be crushed before he dos something useful if he even does anything at all. His character is supposed to be the base for all the other characters, yet reality would show most people would never follow a guy like that. The story could have progressed in a number of ways to make the show good, yet it took crappiest and did not live up to the potential. Overall...this show is no good unless you want senseless fanservice.",
            "date": "2012-03-03T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 55241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1179185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/akatsukikaras",
                "username": "akatsukikaras"
            },
            "url": "https://myanimelist.net/reviews.php?id=55241"
        },
        {
            "content": "This is my first review about an anime\r\nStory 7/10\r\nA story about a guy named Amakawa Yuuto who wants to live a normal life, then a girl named Himari who is an Ayakashi and also a cat comes into his life. As the story keep going, more Ayakashi are introduced. The ending is too boring, and there are no romance at all\r\nArt 8/10\r\nThe art is not a problem for me\r\nSound 6/10\r\nThe music is not so bad, but some of them are really annoying. The OP and ED are not too bad\r\nCharacter 4/10\r\nIn my opinion, the most annoying one is Rinko. I admit that she's beautiful, butshe is a normal human, and she should stay away from the Ayakashis because she is pathetic. This is probably the only part I hate from the story.\\n\\n\r\nEnjoyment 5/10\\n\r\nSeriously, this anime is too boring for me. I can't enjoy this anime to the fullest.\\n\\n\r\nOverall 6/10\\n\r\nThe producer are too concerned about the harem storyline. The actions are suck! Seriously, I know they can make a better one than this!",
            "date": "2014-01-30T09:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 130799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512949.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PitchBlack99",
                "username": "PitchBlack99"
            },
            "url": "https://myanimelist.net/reviews.php?id=130799"
        },
        {
            "content": "The plot of the anime follows the manga for the first few episodes\r\nand then just goes to pieces on the last few episodes\r\nthe artwork could definitely be better\r\nfalls in the genres of Action, Comedy, Demons, Romance, Harem, Supernatural  what you will see is fan-service, cliches, fan-service, loli-action, fan-service and a lot of ecchi but the plot sucks near the end\r\nI don't know if the plot at the end is what will happen in the manga, but\r\neverything was rushed",
            "date": "2010-03-26T07:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 24336,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/258028.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Phanotak",
                "username": "Phanotak"
            },
            "url": "https://myanimelist.net/reviews.php?id=24336"
        },
        {
            "content": "Decent Ecchi/harem/action anime with plenty of fan-service, but if you're like me and dislike weak MC's I would probably pass on this show. The main character belongs to the group of MC's that instead of helping people when they're getting beat up just yells their name over and over again. The story is decent for the genre, and the characters are fairly well developed. Only complaints are that the art seems kinda meh, the animation isn't super great like a lot of pre-2015 shows, and its hard to find online above 360p quality. Although I think overall it's an alright show, there are definitely alot of similar shows that are better. I'd only watch this if you have nothing better or don't really care about a show having a very engaging story.",
            "date": "2018-10-13T18:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 291666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7491483.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Skoll_Talks",
                "username": "Skoll_Talks"
            },
            "url": "https://myanimelist.net/reviews.php?id=291666"
        },
        {
            "content": "This is a pretty solid romcom action anime. The cast of characters was interesting, and most of the main characters got solid character development, with the only real exception I feel being Rinko who feels somewhat out of place at times. The central theme of co-existence between humans and non human entities, in this case mostly Ayakashi, is something that's pretty overused, but it was still used effectively here, wherein it didn't spend as much time on discussing the theme itself, rather it stood as something that Yuuto simply believed in and the actual implementation of the theme was more so in regards to howthat effected his relationship with other characters. The plot started out somewhat slowly when it was simply introducing characters with a really light hearted tone, but by the time it reached its final arc the story has gotten a lot more intense and involved, which managed to benefit from the investment the viewers had gotten in the characters from the less involved portion. Though I should note that the light hearted moments don't go away and the comedy, which is solid, is a core part of the anime throughout. The action wasn't tremendously great, not really having much mechanical complexity at all, but there was a variety of powers and such in play that still made it interesting, and it was flashy so overall I would have to say that it was quite enjoyable. The finale was really good and ended the anime incredibly well, and though from what I understand they had to diverge from the manga in order to do so, I suppose that it was worth it as the ending was quite satisfying, though I felt the Public Affairs agent deserved worse than he got.\\n\\n\r\nThe style and designs I thought were quite great, especially Himari's purple standard fighting outfit. The animation and art felt somewhat dated though. The soundtrack was quite good, and OP/EDs were great as well, with the changes to the OP each episode being a nice touch.\\n\\n\r\ntl;dr: A solid action rom-com featuring a solid plot and a great cast of characters.",
            "date": "2018-10-13T11:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 291644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=291644"
        },
        {
            "content": "So ill first state this if your not a fan of a weak main guy is afraid in a romantic of the girls or boobs just push in your face than dont watch this otherwise ill get into it\r\nStory: so the story starts out with yuuto is a demon slayer but also walking too school just too get attack by a Ayakashi than a cat girl version of them comes in and actually tells yuuto that he is a demon slayer and that this thing that was protecting him no longer is and now she is his bodyguard and has too protect yuuto from thisAyakashi who are coming after him\\n\\n\r\nArt: the art was very good nothing to complain about with this\\n\\n\r\nSound: now the op and ed were not the greatest but good also the sound was very good\\n\\n\r\nCharacter: now with this i actually loved all the characters in this i loved all of the characters in this anime yes even the main character as i like that type of character yuuto is\\n\\n\r\nEnjoyment: now i hella enjoyed this anime from the comedy too just all the fun stuff that would happen with yuuto and all the other girls with him the action was decent and yes the ecchi was very good aswell\\n\\n\r\nOverall: gotta give this a 9 for sure the comedy was just pure gold too me also the relationship that yuuto and himari had i just loved\\n",
            "date": "2016-09-09T23:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 228677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=228677"
        }
    ],
    [
        {
            "content": "There was not a review for this and there are only four episodes out atm but i felt like it still deserved a review.\r\nAll of this is based off of four episodes: \r\nStory: So far the story is decent at the begging its a little slow and you think it will be just another demon slaying-animal serving there master type of anime, After a few episodes you find out that this series has a good mix of different themes which makes it pretty enjoyable.\r\nArt: I find the art is decent for this anime, although many people like the mangas art better. If your hesitant becauseof a little difference just ignore that fact and watch few episodes.\\n\\n\r\nSound: Sound is good im no expert on anime sounds but theres ussualy the terrible the ok and the good\\n\\n\r\nCharaters: the characters are well matched for this anime even though its one of those animes where you get intruduced to more characters the farther the story goes it has its own uniqueness that makes it match the story well.\\n\\n\r\nEnjoyment: if your into the romance action ecchi stuff then this is the show for you",
            "date": "2010-01-31T16:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 22846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/265707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Red_Lighting",
                "username": "Red_Lighting"
            },
            "url": "https://myanimelist.net/reviews.php?id=22846"
        },
        {
            "content": "Omamori himari is nothing groundbreaking, I gave it a 7 because I found it to be the most average you could get an anime and 7 is my idea of average. In engineering class we had to come up with a chart for a program that would design a movie based off of a few inputs from the viewer and this made me feel like the people who write anime nowadays have one. It seems like so many of the animes coming out today aim for average, as if there was some sort of algorithm out there where one could simply put in a fewideas and a machine would spew out a script that used the same old concepts and ideas. \\n\\n\r\nStory: it's pretty simple, a boy named yuuto turns 16 and finds out he's from a family of demon hunters when he is attacked on the roof of the school only to be saved by his sexy cat bodyguard himari. He remembers nothing from his past because the charm that was protecting him for 16 years was so powerful. From then on it's your typical harem anime that has an ever-growing cast of female characters and 1 perverted friend. If you've ever seen steel angel kurumi the plot is very similar to that. like I said the story for OH was far from original but I actually did enjoy the theme they used of yuuto and himari fighting ayakashi and feel that it actually had a good deal of potential. The problem was that like many animes this one could've easily changed a few things around and been a lot better than it was but instead they stuck to the same boring pattern so many before it have fallen to, I will never understand the people that make these and why they can't see these obvious mistakes they're making. One thing I really get sick of seeing is the main character only surrounded by girls and the 1 guy friend only being a pervert. If you've seen clannad you'll see Okazaki continuously runs off to hang out with sunohara, I loved seeing that because it was such a simple thing to do and its realistic but you never see it, as if the main character never has any friends and then once he does they're all girls.\\n\\n\r\nArt: while the art was standard the character designs were great. The only problem I had with it was the huge boobs were a little bit excessive, at some point it starts hurting the art not helping it. Still the harem of girls yuuto manages to collect does have it's gems, himari was hotter than your average harem girl and if you appreciate that kind of thing (who doesn't) and you don't really have plans to watch anything after what you're currently on you should check this out. Along with himari, Liz was another above average character and in my opinion that somewhat redeems this slightly, while I'd much rather have originality over above average beauty I won't complain if they decide to throw in some great looking women (although I wish they'd do both).\\n\\n\r\nSound: I liked the sound in OH, the opening theme was very catchy and I enjoyed it more than many other openings I've heard. The music during the anime got \"different\" at times but I liked it and felt it was a nice change from the average music You'll hear.\\n\\n\r\nCharacter: I hate to bash an anime but the characters were all typical harem characters. Yuuto was a spineless idiot who did nothing. Himari was his protective horny servant, Shizuku was another horny girl with a dark past, Liz was a horny girl who likes serving tea, Kuesu was a horny girl who is an enemy but hangs around with the rest of the bunch, and rinko was the tsundere best friend who loves yuuto. None of the characters grow throughout the anime at all, the only change we see is yuuto finally taking charge and deciding to fight which really wasn't all that big. The relationship between himari and yuuto suffered horribly, we didn't even get to see a real kiss between the two because it got interrupted by the rest of the cast, which was really annoying because I knew that's what would happen but was still hoping to see it.\\n\\n\r\nOverall I still think this series has potential but it will need more seasons to reach it. If we do see more series I'd like to see more of 3 things, yuuto becoming stronger, fighting real enemies, and yuuto and himari's relationship grow. I hate how there aren't any animes out there were 2 people are in a relationship before the last episode, it can be done and we can enjoy watching the 2's relationship grow even beyond 2 that are just starting their relationship. I would like to see less of the harem constantly interrupting at every possible moment and attacking yuuto with lust or anger. There will have to be many changes if they wish to accomplish this seeing that the last episode of this 1st season got us nowhere, yuuto even said he didn't want himari around (I believe someone told him he must really want that cat around and he said no) which really kind of pissed me off since he does want himari around and now he's just contradicting himself. Either way I will watch a second season if they make one and I'm still reading the manga which is different from the anime where the anime starts making changes when they go on the trip to paint, which I also think is a big mistake.",
            "date": "2012-04-06T15:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 58081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976291.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VelocityWaffles",
                "username": "VelocityWaffles"
            },
            "url": "https://myanimelist.net/reviews.php?id=58081"
        },
        {
            "content": "On my opinion, Omamori Himari is one of my few favorite manga that I have read so far in my 20s. It is one of the Ecchi and Harem anime that can't miss for the fans of Harem anime. (Truth:Is it my imagination or Yuuto is the only man that play the protagonist of the entire story?) \r\nDespite the differs between the plot between the manga and anime version, I could tell that the anime ending are even faster than the manga counter part  (Truth:Something that become the major questions of all times, could anime ending is the canon of the manga counterpart? Ifso, when the ending of the manga version would appear and if not, is the ending is the only exclusive for anime only?) \\n\\n\\n\r\nCharacter design is much little more advance than the manga version, that's all I can say...\\n\\n\r\nArtwork: 8/10 Level 4-Outstanding",
            "date": "2011-10-08T07:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 45089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/714007.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chingaruna",
                "username": "Chingaruna"
            },
            "url": "https://myanimelist.net/reviews.php?id=45089"
        },
        {
            "content": "More or less directly copied from my review on Anime Planet\r\n-----------------------------\r\nWhen I made my \"anime to review next\" list, I thought it'd be fun to re-watch some anime I haven't seen in a long time, mixed in with the more recent stuff and shows I haven't seen yet.\r\nEnter Omamori Himari. A supernatural harem anime that I haven't seen in over a year. Unfortunately, I had an experience similar to Negima!?; I still enjoyed it, but not watching it in so long kinda dulled it a little...\r\nStory\r\nBecause I was new to anime when I watched Omamori Himari, I thought it was really good. Fast-forward about 16months and it just seems meh at best. Sure, the existence of youkai allow some action to be injected into the show, but for the most part, it was about the main character collecting a harem, and switching from one to the other makes it feel out-of-place.\\n\\n\\n\r\nAnimation\\n\\n\r\nThe animation in Omamori Himari has nothing really special about it. The characters look good, and the animation seems to flow smoothly, but the worst part about it is probably the fight scenes. It was all fine at the start, and looked good, but in several fights (ones involving Shizuku, especially) ended up using CG effects that looked REALLY out of place. At least, it did for me.\\n\\n\\n\r\nSound\\n\\n\r\nFor me, several of the BGM tracks in this anime stuck out, and generally fit the situation, but at times would feel very out of place. The OP is a cute and catchy song that will be stuck in your head for quite a while, and the ED (or EDs) were sung by the female cast, and I really like it when they do that.\\n\\n\r\nFor the voice actors, there were several memorable names. The most obvious would be Ami Koshimizu voicing the titular Himari, and with pretty much every main character, I could hear someone from a different anime. This, however, is also a detriment due to the male lead's voice actor... Daisuke Hirakawa may very well turn people away because he pretty much sounds like a certain cheating asshole of a character.\\n\\n\r\nI was surprised, however, at how well the guy could sing in the final episode's ED.\\n\\n\\n\r\nCharacters\\n\\n\r\nCharacters in anime are a bit of a hit-or-miss. Omamori Himari is disliked for having two characters who are more or less useless throughout most of the show (or, in Rinko's case, the show in its entirety).\\n\\n\r\nThe better of the main characters (Himari, Shizuku, Kuesu) are generally more fun to watch, especially when any combination of the three battle. However, Kuesu's initial introduction may prove to be too strong for some viewers during the closing stages of the show.\\n\\n\\n\r\nFinal thoughts\\n\\n\r\nOmamori Himari was a fun watch overall, but when it tried to get too serious near the end, it felt like it was trying a little too hard and the sudden change in tone may end up turning some watchers off.\\n\\n\r\nI'd say to watch this if you are bored and have nothing else to do, at an overall pace of one episode a day. Trying to marathon this anime could quite possibly end up being too much.\\n\\n\r\nStory - 4.6\\n\r\nAnimation - 7.2\\n\r\nSound - 8.1\\n\r\nCharacters - 7.2\\n\r\nEnjoyment - 7.0\\n\r\nFINAL SCORE - 6.82/10",
            "date": "2013-07-12T06:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 104981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2731295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EHeroReview",
                "username": "EHeroReview"
            },
            "url": "https://myanimelist.net/reviews.php?id=104981"
        },
        {
            "content": "If you're looking to enjoy the story of this correctly, then just read the manga. But if you want to enjoy it visually in animation, and have a lot of the story drowned out with more unnecessary ecchiness and perversions; just watch this anime. Nuff said.",
            "date": "2013-10-24T16:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 118143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3095905.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/yuri187",
                "username": "yuri187"
            },
            "url": "https://myanimelist.net/reviews.php?id=118143"
        },
        {
            "content": "This is my second review so hopefully I can do it good. I will try to leave spoilers out.\r\nOmamori Himari is your typical harem/ecchi anime, Amakawa Yuuto graces us with his MCness and has your typical background. Parents are dead, memories with a girl when he was younger and  living alone and having someone take care of him everyday. Honestly this whole anime screamed clicheness and boy did it not disappoint with the harem/ecchi tags. There are so many boobs and pantyshots, its beyond ridiculous.\r\nStory 7/10\r\nThe story started off strong but for me kinda started dropping near the middle. This story revolves around Yuutobut Himari is the one that takes center stage most of the time. Himari is an Ayakashi or a demon and she is bound by contract to protect Yuuto untill he becomes a demon slayer. When Yuuto turned 16, Himari appeared to abide by the contract. Then they begin their lives as a Master/Bodygaurd type relationship.\\n\\n\r\nArt 8/10\\n\r\nThe artsyle presented in this anime was pretty good, one of the main things that it falls flat on is that its animated the same way other ecchi/harem animes are so its lackluster in that department. The fight scenes were decent  but it didn't really amaze me. The main attraction that anime goes for is the plethora of boob and panty shots as per the ecchi type of anime but I still felt like it was a tad beyond neccesity.\\n\\n\r\nSound 4/10\\n\r\nIm not going to write too much into this category. The only thing I enjoyed was the OP, it was catchy and I found myself listening to it on youtube abit more than I care to admit. Other than that the sound was pretty nonexistant, they used the same bgm for almost all the fight scenes and much of the other bgm's didnt appeal to me.\\n\\n\r\nCharacter 7/10\\n\r\nThe characters both annoyed me and amused me, they are a colorful bunch with a variety of personalities and I enjoyed that but they are so oversexualized it killed it abit for me. I do not mind that they act perverted in front of the MC but I had to stop myself from screaming at my computer for them to stop so they could continue with the plot. The way they just strut around with panties everywhere and public nudity(yes, can't have an ecchi anime without public nudity) made me wish why isn't my life like this. My favorite character would have to be Kuesu, she is determined to make a name for herself and prove her family is strong and I admire that. She also uses a grimoire which is extra points for me. My least favorite character is Lizlet, she only has one grand scene which is her opening to the story then she falls flat afterwards. I question why she is even there sometimes, she does almost nothing to help the group and is gone half the time but she is a apart of the harem circle of heroines and it makes me wonder but you gotta have at least 5 heroines to make sure you fit in the harem crowd.\\n\\n\r\nEnjoyment 8/10\\n\r\nAlthough I have bashed this anime, I did enjoy it to some extent. There was some good comedy and the side characters were amusing. Really this anime is pointed towards the group of guys who watch anime purely for the pantyshots and semi-nudity because thats what this mainly has. I found that this anime is either a hate it or you don't anime because I could not find an inbetween.\\n\\n\r\nOverall 6/10\\n\r\nI have to give Omamori Himari a 6, it had its moments but it fell flat alot and figured it could get back up with oversexualized scenes and panties. This was one of those animes were I enjoyed the heroines more because Yuuto was one useless dude who did nothing but sit on his ass the whole damn show and I had to deduct points for that. Overall, this anime is good if you enjoy the harem/ecchi genre but if your looking for more then I suggest you look somewhere else because this show won't give you more than that.",
            "date": "2014-05-08T12:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 142699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/396932.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JoshSakurazaki",
                "username": "JoshSakurazaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=142699"
        },
        {
            "content": "Well, its definately one of those anime series with \"fun actions, big breasts, naked bodies, And Harem\",\r\none thing is still bothering me....\r\nMain male char is one of those \"weakling\"\r\nnot important for rest of female chars, they still likes him so much...\r\nFor God Sake, no ******* way..... \r\nmy opinion:\r\nStory: To short.....\r\nSound: not bad, but could be better...\r\nAbout Characters: Big Breasts made me a little mad, but rest about them is Great.(Main male char suck, but at least he has his \"iron rules\", so it's saved him)\r\nFuny Actions: Not many, but every each one made mu laugh like creazy\r\nEnjoyment: Masterpiece\r\nOverall: Very good ;)\r\nso...\r\nIf u Like harem, magicand echi funny moments, you should watch it.\\n\\n\\n",
            "date": "2012-07-06T16:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 65499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14498.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ari91",
                "username": "Ari91"
            },
            "url": "https://myanimelist.net/reviews.php?id=65499"
        },
        {
            "content": "Can you ever really escape the harem series? I mean really? Not complaining just stating.\r\nAnyways, the plot is simple. Amakawa Yuuto is the heir to a demon slaying clan which broke the trend and decided to continue the tradition when his demon cat guard makes her random appearance. After that him and his guard Himari begin to amass a harem of demons (and one human girl who is totally out-shined) as Yuuto is nearly killed each time. After that it's pretty self-explanitory. Boy gains ridiculously large harem, discovers hidden secrets, epic battle, then lovey-dovey climax; but being that it's an harem I can't exactly guaranteethat.\\n\r\nBUT WHAT ABOUT THE ACTUAL REVIEW!? Well here it is: it's a harem/ecchi so that in itself is played out, but we still come to love it... for some reason. However, this series felt unusually fresh and didn't have a \"completely\" played out feel, despite the cliche plot concept.\\n\r\nPoint by Point:\\n\r\n-Animation; Standard, not bad, but it felt like I was looking at a Manga.\\n\r\n-Characters: Okay, it was pretty easy to understand Himari.\\n\r\n-Plot: Yuck, but they made it work for them.\\n\r\n-Music: Was there any?\\n\\n\r\nOverall 7/10. Not gold, but it was okay. Not a series for serious otakus.",
            "date": "2010-04-09T23:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 24916,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=24916"
        },
        {
            "content": "This is my first review so please don't be too critical.\r\nThis is based on the anime only and I will not reference it with the manga.\r\nStory:6\r\nOmmamori Himari is about the comedies(and problems) of the life of a clueless and cat-allergic demon slayer, his cat demon bodyguard and a harem of other demons and girls vying for his affection. Right from the start I saw that the anime had great potential. Instead of the typical accept-my-duty-as-a-demon-slayer scenario, Yuuto(the main character) chooses to lead a normal life. But things are never that simple in the world of anime or else there would'nt be a story. However,after therequisite introduction of Yuuto's harem and the perverted situations he gets into, the story basically felt as if it was rushed towards a very cliched and painful end. It could have been much much better and thus warrants only a 6 from me, it could have been a 9 or 10 with more work.\\n\\n\r\nArt:8\\n\r\nThe drawings was exquisite. Well drawn facial expressions too. Yet in 2010 I cannot really forgive that the action scenes feel as if they are from the 1990s; it takes 20 seconds to show a swing of the sword and everybody flying away. An action genre should show action not useless posturing. Nevertheless, tha art is still great.\\n\\n\r\nSound:7\\n\r\nThe sound was good. The OP had a light-hearted feel to it that matched the mood of most of the episodes. But feel free to form your own opinion about the sound as I am not a good critic on the sound department.\\n\\n\r\nCharacters:6\\n\r\nOther than Himari's internal conflict between protecting Yuuto and staying by his side, the rest of the characters face little development. The other characters the story intoduced seem to turn into useless sidekick roles  almost overepisode(pun on overnight); they stand there saying the most useless things that don't really add to the conversation and take up air-time. this anime could use some serious work in character development.\\n\\n\r\nEnjoyment:7\\n\r\nBeing male, I obviously enjoy the large servings of fan-service that Ommamori Himari provide but my enjoyment was dampened by the fact this was a poor ending to what could have been a really great anime story-wise.\\n\\n\r\nOverall:7\\n\r\nIf you are willing to accept the faults of a rushed ending or a fan of the ecchi genre, then i would reccomend you to watch this. The anime leaves much to be desired but hopefully there will be a second season with an ending that is not as crappy as the first season.",
            "date": "2010-10-27T08:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 31648,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/263535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sramain94",
                "username": "sramain94"
            },
            "url": "https://myanimelist.net/reviews.php?id=31648"
        },
        {
            "content": "well what can i say i have a thing for cat girls\r\nand as Japanese so eloquently put it \r\nshe is just  so kavaii!\r\nyes girls do all the fighting yes we have weak male lead yes the whole thing is not so original but you know and i know that we do get a kick out of the same old formula im not against anything genuine i truly like them but not everything you watch is genuine and fresh full of new ideas so youve gotta go for the same oldies but have to make sure you choose the good ones at that\r\nso if youenjoy the whole cat-girl ecchi harem you will like it and at least wont regret watching it\\n\\n\\n",
            "date": "2011-01-05T14:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 33479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/363881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/binke",
                "username": "binke"
            },
            "url": "https://myanimelist.net/reviews.php?id=33479"
        },
        {
            "content": "Ok let's begin\r\nStory\r\nTo be honest...From the very 10 min of the first episodes I was interested interested in this anime...I liked the story about demons and supernatural things...Not to say that I was really interested to see what kind of relationship will develop between Yuuto and Himati...I'm kindda drown to these things...So...I really really loved the plot....\r\nArt\r\nBery beautifull ecchi pictures,moments graphics and all sorts of lively colours...What else could I ask for it? Is just outstanding....\r\nSound\r\nTo be honest until the lasp episodeI didn't wat the ED/OP ....I was just skipping right to the episodes just because I was realy interested in the plot...but at thelast episode I give it a shot to the OP/ED  and I can say that I quitte good...the soundtracks from the episodes too I loved...\\n\\n\r\nCharacter\\n\\n\r\nLot's of female girls [But I don't complain just because I'm a boy -] ... I really liked all characters...But the most favourite was Himari...I really love Neko girls [Cat Girls-] from anime's",
            "date": "2010-07-05T19:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 28029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313513.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shiro-",
                "username": "Shiro-"
            },
            "url": "https://myanimelist.net/reviews.php?id=28029"
        },
        {
            "content": "Bouncing big boobs,ecchi, sword and neko... :)\r\nif you like one of them, i think you must watch this anime frst.\r\nand you'll really enjoy...\r\njust sit and let your eyes follow the storyline....\r\ni think \"8\" is enough to rate this...\r\nthat the incorporation of visuals, song and the storyline.",
            "date": "2012-10-09T14:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 74527,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1328161.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shinji_Furukawa",
                "username": "Shinji_Furukawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=74527"
        }
    ]
]