[
    [
        {
            "content": "Entertainment is a broad word to be honest. People tend to define entertainment as something of enjoyment and value that is provoked. And what better place to get entertainment than at a circus? As an attraction and adaptation, Black Butler: Book of Circus adapts the Noah's Ark Circus arc from the manga. (Volumes 6-8, chapters 24-37) Previously, the arc was skipped from season 1 (occurs after the Curry Arc). Nonetheless, the show establishes the assumption that you are already familiarized with the franchise; either anime or manga. Taken for granted though, Black Butler: Book of Circus continues the fantasy adventure of a young boy andhis butler. They return and takes part of an attraction at a circus where there’s much more than just entertainment.\\n\\n\r\nThe first episode essentially starts off as anime original filler that serves as a way to get fans refreshed and fired up for the main course. The main course here is of course, Noah’s Circus led by a man named Jack. It doesn’t take long for the main course to sink as the majority of the actors and actresses are introduced. But to get the best experience out of this series, it’s important to get attached with Ciel and Sebastian. They play their roles in this arc in a detective-esque role as they investigate the underworld relating to a case of missing children. Point taken, this arc has a combination of both lighthearted and dark moments. The latter is easily realized as the arc progresses with secrets unrivaled and boundaries of civilized behavior shattered in pieces.\\n\\n\r\nThere’s not much change however when it comes to our investigators, Ciel and Sebastian. Their personalities remains generally the same as the previous season. One thing noticeable is their growing attachment such as Sebastian looking after the well-being of his master. At the same time, he also plays the fool and pokes fun at Ciel; in particular his outfit and stage name. On the other hand, Ciel realizes what he must do to secure the case and takes action. Despite seeming like a timid boy, Ciel can be quite courageous and dedicated as evidenced when he gets a flu yet still wishes to continue with the case. Inspiration is perhaps a word to describe this young boy as well when we see how much he despises the darkness that roams behind the circus. And despite being childish at times, Ciel is a clever boy with ideas. Sebastian on the other hand uses his seductiveness to advantage and intellect to aid in the case. His relationship with another grim reaper in this arc adds a touch of comedy with their mutual dislike. The “rivalry” between the two takes various turns and exaggerates itself with oddball humor. Nonetheless, Ciel and Sebastian are still the main duo of this show. They might not be Sherlock Holmes of the century but they got guts.\\n\\n\r\nMystery becomes a pivotal point throughout this series’ story as we find out more about the origins of the circus. Ringleader Joker makes his highlight entrance as he performs for the crowd. The show gives the circus performance an extravagant elegance when the characters come to the stage. Characters such as Beast, Jumbo, Dagger, and Wendy all demonstrate their skills with praise. Despite the tongue-in-cheek humor (especially during Beast’s act), the show maintains a good posture with its comedy. It also has a degree of realism as the circus acts are symmetrical to real life circus performances. Joker in particular serves as an entertaining host with his cheerful personality and is able to hide his emotions from others at will. In a way, he is almost similar to Sebastian as both characters are able to hide their true motives while putting on a poker face. At the same time, there’s also adequate relationship dynamics as seen with the case of Beast. Her inner struggles is highlighted through her feelings as we see a more vulnerable side of her. The negative side of this is that we don’t get much characterization of the circus members. We only glance at the motives/ambitions, their personalities, and perhaps where their true purpose lies. There’s minimal amount of flashback or background story to flesh out with these characters as it only scratches on the surface. Unfortunately, a series covered by a mere 10 episodes isn’t’ enough to develop them enough which is a shame. The plus side is how we can appreciate the closeness of the Noah’s Circus Trope members. They might be travelers and entertainers but at a closer glance, they almost seem and act like a family as brothers and sisters. \\n\\n\r\nAs the season is more story oriented, expect plot twists and revelations. As mentioned before, the arc gets darker as each episode progresses. Mystery envelops itself with characters such as Doll and Snake. The latter demonstrates a malevolent presence while Doll becomes an epitome for mysteriousness. The imagery the show presents with the story is that there is something dark going on behind the scenes. And seemingly enough, there’s also a mastermind pulling the strings that is even a higher order than the host, Joker himself. The story gets grimmer with sinfully crafted themes that can be stomach indulging at times. It still remains culturally developed with the European like style but gets more complicated. Its gothic style is stylized by the behavior of the characters. Add a touch of fantasy and dream-like atmosphere and we get even more artistic story. Because behind the circus acts lies a dark secret in which this series explores with. Combined with the motivation of the mastermind, the story becomes something of a shadowy theater. Expect the unexpected. \\n\\n\r\nA-1 Studios attempts to bring back the style fans were used to with the previous season. Luckily enough, it achieves its purpose. Action scenes are fluid with well-coordinated movements and pacing. The backgrounds of this series still looks elegant with detailed designs such as the Victorian themes. I’m not just referring elegance with the structures but also the way characters are designed. Indeed, characters are lavishly decorated such as the flamboyant clothes of Joker, the fiery outfit Beasts wears, or the fashionable dress up that Doll puts on. It’s not just wholly imaginative but also makes sense for its circus theme. Similarly, Ciel and Sebastian has style when it comes to their choice of clothing. There’s also minimal fan service except a few cases with the seductive Sebastian. Every demonic butler has to a have a little bit of fun though, right?\\n\\n\r\nSoundtrack is fluid with orchestral tones and a folklore-like OST. The distinctiveness of the Circus’ theme plays out well with matching background music. And with our characters, voice mannerisms fits quite well with them. The big newcomer, Joker perhaps stands out as a centerpiece of this testament as he plays the sort of ringleader, host, and of pierrot of the show. Make no mistake though. The circus conveys a darker image as the soundtrack gets darker and darker with an unsettling atmosphere on more occasions. Even with the smooth fantasy elements added, the message is there to create an abstract feeling. Oh and OP/ED songs of this series is brilliantly presented. It’s like opening the stage of each episode and finishes it off with an encore.\\n\\n\r\nThere’s a sense of nostalgia with this series. Even though Black Butler didn’t air too long ago, the show feels refreshing. Color me surprised but this adaptation did justice to itself. Despite some fillers inserted in, there’s an impeccable performance with the characters and the story it works with. The spectacle is top notch with clever humor, neatly timed battle scenarios, and well-rounded dialogues. While it doesn’t have too much action compared to the previous seasons, Black Butler: Book of Circus stands out in its own way. It’s an epic feast of a fantasy adventure with the circus and return of Ciel and Sebastian. An accomplished series with goals met. This show is definitely something to keep an eye on if you’re a fan of the original series and manga. Take notice now.\\n\\n",
            "date": "2014-09-11T13:50:00+00:00",
            "helpful_count": 127,
            "mal_id": 159943,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159943"
        },
        {
            "content": "Can you imagine how frustrating it is to be a heterosexual male who HATES paedophilia who also happens to like Kuroshitsuji? Damn it, A-1 Pictures why did it take you guys THIS long to do Kuroshitsuji right, especially after all the shit you guys did to sour everyone else's view of the series? The first season had a lot of problems behind it that could've easily been fixed with a little more foresight and Kuroshitsuji II was a pointless cash-grab that just REEKED of corporate greed and yaoi-fangirl pandering that would make even make Hetalia fan fiction look like Dr. Seuss. With all of thisdamage done to Kuroshitsuji's reputation, why did it take you THIS long to finally get it right? If you're one of the many people who've been hesitating to give Kuroshitsuji a try because of its reputation as shameless fangirl pandering, I HIGHLY urge you to watch Book of Circus before coming to any conclusions.\\n\\n\r\nBefore I begin, I just want to get one thing out of the way: yes, this is technically a continuation of the first season which picks up the manga's story where the first season left off (which is around Episode 16-onward). HOWEVER, Book of Circus is inexplicably formatted as if it was geared toward newcomers to the franchise. This is of course both good and bad. The good is the fact that you don't have to sit through the first 15 episodes of the first season to actually familiarise yourself with the characters and the like since any events that happened within the first season are quickly recapped for your convenience. The bad news is that if you are in fact, a complete newcomer to the franchise... chances are that you might get a bit lost somewhere down the road. Keep in mind that this is only 10 episodes long though, so you should just kind of roll with it if you're watching and look it up later if you really are that curious.\\n\\n\r\nAside from the stuff I mentioned before, another reason why people don't give Kuroshitsuji a chance is because well... the concept sounds kind of boring in hindsight and that's something I really can't defend because truth be told, it DOES get boring. HOWEVER, that's not entirely the case with Book of Circus. Book of Circus adapts the much-lauded Noah's Ark Circus portion of the manga's story which is where Toboso actually cut all of the superfluous bullshit and actually focused on giving us involving plot that sucks us in. Here's the deal: a travelling circus comes to London, but the problem is that children keep getting abducted in every city that the circus has been in. Considering Ciel's reputation as the Queen's guard dog, it was only a matter of time before he's ordered by Her Majesty to conduct an investigation.\\n\\n\r\nRight off the bat, we have an awesome set-up. People unfamiliar with Black Butler tend to dismiss this show as a slice-of-life supernatural comedy taking place in Victorian England, which couldn't be farther from the truth. The biggest reason that I can think of as to why people tend to have this misconception is because the first half of Kuroshitsuji's first season REALLY dialled up the comedy which really affected the overall tone of the story. The manga does retain a similar style of humour which mostly consists of visual gags and slapstick, but it's far less prevalent. Considering the fact that the vast majority of this show takes place in a circus, it's no surprise that there would be some hint of a light-hearted tone with a little bit of comedy present. However, that's mostly evident within the first four episodes where the Noah's Ark Circus is being introduced and the mystery was being touched upon. \\n\\n\r\nAs the show progresses, the mystery surrounding the Noah's Ark Circus is gradually explored and good GOD does it get morbid. I'm not even joking when I tell you that there's actually a point in the penultimate episodes where there actually was censorship put into effect for a good 20-30 seconds (parts of the screen end up being blacked out). For people who come into Kuroshitsuji expecting some kind of bishie festival full of yaoi subtext and shota undertones full of over-the-top comedy akin to something like say... Ouran HSHC, this will be a MAJOR shock to the system. Whenever Yana Toboso actually gets to work on an arc with a serious story that has the potential to suck you in, she more or less drops most of the bullshit and actually focuses on developing the story with minimal interruptions whatsoever. Speaking of which, there's actually not a lot of shota/yaoi subtext throughout the entirety of the Noah's Ark Circus. I mean... there's bits and pieces of it here and there, but it's a hell of a lot more bearable than that fucking corset scene from Episode 4.\\n\\n\r\nAs for the pacing, the actual mystery surrounding the Noah's Ark Circus is handled quite well, which you might think is rather surprising given that this is a 10-episode season. HOWEVER, the entirety of the Noah's Ark Circus portion of the manga was only 13 chapters long to begin with which means that it's adapted at a ratio of about 1 chapter:1 episode ratio. Keep in mind that's also roughly 468 pages of material to adapt, where each chapter was around 35-40 pages long. I'd say that 10 episodes was enough to work with to give this part of the manga a fair adaptation. It's not a perfect adaptation though, given that the first episode is more or less an introduction to Ciel, Sebas-chan, and everyone else and has next-to-nothing to do with the Noah's Ark Circus until the end of the episode. I still found it pretty entertaining though, although that mostly stems from my fondness of Sebas-chan (and of course, the amazing visuals/OST that A-1 Pictures provides).\\n\\n\r\nMoving over to the character side of things, let's take a look at Ciel and Sebas-chan first. Ciel is for lack of better words, a 13-year-old Bruce Wayne but with an eye patch. The thing is that he suffers from a REALLY traumatic past (which actually DOES get explored in Book of Circus), but it's that traumatic past that causes him to constantly brood and never know when to lighten up... you know, unless he's faking it for the sake of Her Majesty. He will lie and cheat if it means that whatever he's doing for the sake of the Queen will go further which is clearly evident whenever he has to weasel his way out of some less-than-ideal situations. For the most part, Ciel doesn't really change throughout Book of Circus but that's kind of understandable given that he BARELY changed throughout the entirety of the manga (I'm 97 chapters in, and I can safely say that he hasn't had all that much character growth).\\n\\n\r\nNow we get to Sebastian Michaelis, affectionately referred to as \"Sebby\" by the fans and \"Sebas-chan\" or \"Bassy\" by Grell (depends on whether or not you watch sub/dub). He's one hell of a bishie demon butler who made a contract with Ciel to help him exact revenge on those who wronged him in exchange for being able to consume his soul once the deed is done. In all honesty, I love Sebas-chan as a character. In many ways, Ciel and Sebas-chan have a relationship similar to that of Integra and Alucard from Hellsing. At the same time, Sebastian likes to toy around with his master and keep things fresh and entertaining for him.\\n\\n\r\nA lot of people don't like Sebastian because of the fact that he's overpowered, but that's like hating on the Gundam franchise because it involves giant robots. The biggest draw to Sebastian is his personality and his approach to the various situations that he gets put into. The terms of the contract that he has with Ciel are only effective if he's alive... but just barely. Ciel also has to be very careful about what he orders Sebastian to do, otherwise he'll just do whatever and get off on a technicality. So in that sense, it keeps the relationship between the two of them fresh and is just a joy to watch on-screen... whenever there isn't any shota subtext. Much like Ciel, Sebas-chan really doesn't change throughout Book of Circus and that's kind of the way he is throughout the vast majority of the manga. Well, then again this manga's been going on for like eight years via monthly serialisation. It's no surprise that Toboso hasn't quite fleshed out the characters yet.\\n\\n\r\nAs for the new characters introduced in Book of Circus like Joker, Beast, Doll, and Snake... they're all pretty interesting to say the least. With the exception of Joker, Beast, and Doll, the vast majority of the Noah's Ark Circus characters aren't really developed all that much (with the possible exception of Snake, but he shows up later in the manga's run WAY past the end of the Noah's Ark Circus). Well... then again, this is a 10-episode long series that adapts a relatively short part of the manga. I guess it's only natural for character development to not exactly be up-to-snuff. I will say this though: Episodes 7-9 which feature this show's main antagonist will DEFINITELY catch you off-guard. On another note, Episode 8 features the Phantomhive servants kicking ass like they did in the episode \"His Butler, Engaging Servants\" from the first season and I have to say... I NEVER get tired of Mey-Rin without her glasses on. I can't wait to hear Monica Rial voicing her in the English dub. \\n\\n\r\nOn the technical side of things, the art/animation for Book of Circus is absolutely GORGEOUS and is quite possibly some of A-1 Pictures' best work to date. This season alone makes the other two pretty damn hard to watch. I guess it's similar to The Boondocks where the art/animation quality continuously improves throughout each season. I honestly can't wait for the Book of Murder OVAs to come out so that I can see how A-1 Pictures is going to top themselves. What I really love about the art/animation is how A-1 Pictures actually implemented stuff like shading and lighting to quite a realistic degree in a vein similar to Death Note. Now if only A-1 Pictures' adaptations were as good as Madhouse's. Whatever, that's none of my business *drinks a cup of Earl Grey tea* As for the art/animation for the OP and ED, I quite like the OP but the ED felt a bit too... fangirl-pandering for my liking. Whatever, this is Black Butler... fangirl pandering is something that's part of the course and it's something I've made peace with a long time ago.\\n\\n\r\nOn the sound side of things... I REALLY wish that the Book of Circus OST was released by now because there were a LOT of BGM tracks that I happened to pick up on and thoroughly enjoy. Now if only they retained the song \"Si Deus Me Relinquit\" from the first season. Speaking of which, they actually got SID back to do the opening for Book of Circus (these are also the guys that did the first ED and fifth OP of Fullmetal Alchemist: Brotherhood). \"Enamel\" has to be the catchiest OP theme I've heard yet, and this is coming from a guy who couldn't get the fifth OP for Naruto PT1 out of his head for a good six years (and I REALLY wish that was hyperbole). I also quite like the ED track, \"Aoki Tsuki Michite\" by AKIRA... although to be brutally honest, it's the visuals I don't quite care much for and is the main reason why I skipped over the ED altogether. If it were just you know... just a black screen with text in the foreground, I'd stay around and listen to the song because it really is that good. There is no English dub to speak of at the time of writing, but on the subtitled side of things, we've got familiar faces like Maaya Sakamoto and Daisuke Ono voicing Ciel and Sebas-chan respectively. In other words: REALLY good performances from these two. Considering the fact that Funimation licensed Book of Circus for simulcasting, I'm guessing that the dub will be the same as the first two seasons. In other words: Brina Palencia and J. Michael Tatum voicing Ciel and Sebastian with fake British accents. I'm game for that.\\n\\n\r\nWould I say that I enjoyed Book of Circus? Absolutely. This was actually the show that got me to pick up a Kuroshitsuji volume because I couldn't stand waiting for episodes every week while watching the show when it was still airing. If a show manages to get me to read something, it gets a pass from me. As for how much you'd enjoy it? I'd say that you'd probabl enjoy it quite a bit, maybe not as much as I do, but chances are that it'll probably exceed your expectations. Like, if you have some REALLY low expectations for the Kuroshitsuji franchise, I can't think of a better series to watch than Book of Circus. If you had a sour taste in your mouth because of the first two seasons, I heartily recommend watching this one as it will more than likely change your preconceptions about this series.",
            "date": "2014-09-26T23:36:00+00:00",
            "helpful_count": 104,
            "mal_id": 162391,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729535.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phs_togusa",
                "username": "phs_togusa"
            },
            "url": "https://myanimelist.net/reviews.php?id=162391"
        },
        {
            "content": "In the year of 2008, appear an anime that draws all the female audience into the front of the screen. Yes, it's Kuroshitsuji. \r\nThe Book of Circus is a sequel from the middle of the 1st season. \r\nBasically, at the early episode, the story doesn't have an orientation on its way, but after that episode, the story continues with a well-organized plot, it is successfully done well in a short periodic of time (10 episodes), although there are some points that lack in source.\r\nAs for the animation, the Book of Circus have the same animation like the other previous season, the characters have unique designsindeed.\\n\\n\r\nThe opening song really matched with the entire season, as well as the ending song. The seiyuu did a good job in bringing such character to the scene.\\n\\n\r\nBook of Circus have a decent character development, all characters seems to have their own role to play, the only problem is the story is just 10 episodes, is hard to create an excellent and precise development in that short time. So the characters have a development, but not described perfectly within the series.\\n\\n\r\nThe Book of Circus major success is located in the enjoyment of the season. The season practically different from the other season, it fills all the excitement into the screen.\\n\\n\r\nWell, Kuroshitsuji mainly aim to the female audience, SOME male viewers may not found this interesting, it is fully recommended for those who seeks  exciting action movies",
            "date": "2014-10-19T21:41:00+00:00",
            "helpful_count": 66,
            "mal_id": 165397,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=165397"
        },
        {
            "content": "Okay, before I continue with this review. I want to point out two things 1. I didn't read the manga so keep that in mind and 2. I hated the other two seasons of Black Butler, the first one is one of the dullest animes I've ever seen and the less I say about the second one (fans don't even like that, what more do I need to say?) So I was not looking forward to this one, I wanted nothing to do with it. The only reason I did was that a friend of mine told me that he was enjoying it so muchmore than the other ones and the details he gave me, I had a hard time believing so I decided to at least watch the first episode and see how things would turn out\\n\\n\r\nWell, I'll be damned (no pun intended). This actually wasn't half bad, I had alot of fun with this one. I gotta say fangirls, if this is the Sebastian you love from the manga then by all means, have at it. Before I couldn't for the life of me figure out why Sebastian had a huge fanbase outside of his looks (Because it's not like there aren't enough bishies in anime. More than enough if you ask me) all he did in those other ones was smirk alot, be the perfect butler, say \"I'm one hell of butler\" (My god what a stupid joke) and \"yes my lord\" and kiss Ciel's ass and cry like a bitch when Ciel didn't want him anymore in season 2 (GOD THAT WAS FUCKING RETARDED). He was boring and not the least bit intimidating. The Sebastian in this anime is a lying, devious bastard who takes every opportunity he can to fuck with his master. This is a guy who I would buy is actually a demon (if there were any traces of THIS Sebastian from the other two animes, they were way to vague for me to notice) and he's really funny, when Ciel is going to join the circus he says that he can't do any tricks and Sebby says he can do plenty like roll over and play fetch\\n\\n\r\nCiel hasn't changed that much and I still don't like him that much but the cool thing here is that all the other supernatural characters don't treat him like fucking royalty like they pretty much did in the other ones and why should they? Sure he's rich and he's smart for his age but that should be nothing compare to a demon or grim reaper and that's how they treat him, it's a job. I knew I was in for something different when the Under taker dare Ciel to do something without his servant, I was like \"Wait, did a character in this show just imply that Ciel is just a rich little nothing brat without his Butler. Wow! I did not see that coming\" so yeah I still don't like him but they do fuck with him more which is a plus for me and even by the end of the show I grew to respect him a little bit more\\n\\n\r\nI'll bring up one more improvement on the characters and then I'll move on from there and that's the servants. Mey Rin, Finny, Baldroy are all done way better. Before I though they were worthless, they either fucked everything as servants or they did shit that Sebby could easily do. That's not the case here. Through out the show, we don't see them that much and they're just their regular selves but here they're able to build up their badass-ness much properly. They're there to guard the house when Sebastian and Ciel are out of the house. That makes sense because even Sebastian can't be everywhere at once (Which makes the first one even more stupid because why the fuck would you bring those 3 guys on trips? Who the fuck's gonna guard your house?) It's all about how you present something so now I can respect these guys so much more\\n\\n\r\nThat fucking Soma guy is still in here (Seriously, someone kill him. He will not be missed. His girlfriend didn't need to be evil, any reasonable person would leave that dumbass) but thankfully he's not in it that much\\n\\n\r\nAs for everything else. This anime was what I wanted this series to be in the first place, a sorta Sherlock Holmes deal with supernatural elements, that sounds cool but that's not how the first two were like at all, they mostly stand around drinking tea and talked about crap I could care less about. Here, there's this whole mystery about missing children and the circus and all the clues make sense but they don't make it so obvious as to what's going and when the twist as to who is responsible, it makes sense that this person would be behind it unlike Hana from Black Butler 2 (Seriously what the fuck was that)\\n\\n\r\nThe animation is definitely an improvement from before, I mean it's no Bones or Ghibli but it gets the job done. Some times it looks really good and then other times it's stiff but I can forgive decent animation if the art is good and thankfully the artwork has always been in the franchise's favor\\n\\n\r\nThe music also WAY better. I actually remember the music here (no wonder, they got a different composer for this one same as with different director and writer). It has really nice classical music but not just that, they mix it up a bit with music that has a french vibe to it as well as Ireland river dance kinda music (Sorry I don't know the name of these kinds of music but when you listen to the music, you'll know what I mean). The soundtrack actually stands out here. I'm thinking of actually looking up the ost for this show when it comes out (when it comes out). \\n\\n\r\nAlthough there's one thing that ruins the music for me and that's the opening song, not because the song itself is bad (granted I don't like J pop / J rock anyway) but because I hate misused theme songs. You look at animes like Trigun, Ghost In The Shell SAC, Samurai Champloo, Baccano!, they all have theme songs that are not only unique but fit the overall feel of their respected shows and then there are animes like this where instead of using a theme song that matches up with the rest of the music of the show, uses some shitty generic j pop/rock song. It's a total whiplash, may seem like I'm nitpicking but that's really a pet peeve of mine with anime\\n\\n\r\nAll in all, I'm surprised how much I enjoyed this show. That's one of the best things you can say about something that it's surprisingly good and Black Butler: Book Of Circus is from now on my definition of Surprisingly Good. Is it now one of the perfect animes out there like Cowboy Bebop, Monster, LOGH, or Ghost In the Shell. No, not even close. I think it could've wrapped up a little tighter (the show's real ending really is episode 9, episode 10's more of an epilogue) and there still are stupid stuff I could make fun like grim reapers using garden tools as weapons (Seriously, who uses a lawnmower as a weapon?) and like I said the animation's not one of the best but like I said before, this is an example on how to take something I don't like at all and transform it into something I do like. Thanks alot, director of GTO and writer of Planetes\\n\\n\r\nIt's funny, dark, well paced (for the most part) and it's a good mystery that actually makes sense and best of all, there are no scenes of shota boys butt ass naked",
            "date": "2014-09-14T18:10:00+00:00",
            "helpful_count": 49,
            "mal_id": 160351,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/336566.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SolidPayne",
                "username": "SolidPayne"
            },
            "url": "https://myanimelist.net/reviews.php?id=160351"
        },
        {
            "content": "I didn't find this to be one of the \"typical\" Kuroshitsuji stories, the \"Boy with demon hunts down England's bad men in the name of the Queen\" kind of story. \r\nStill, I liked it. Maybe I liked it for that difference, maybe out of nostalgia. Maybe a mix of both. I do love Sebastian, Ciel, the crazy Phantomhive servants, the general wit of Kuroshitsuji, and the darkness around it all, Book of Circus had that, so I found it enjoyable. \r\nAnd yet, this arc had a different feeling to it. All in all, it was such a desolate story. What happens doesn't leave you witha \"serves them right\" or \"yay you go Ciel\" kind of feeling, as some of the other stories might have done. \\n\\n\r\nIt's dark, it's dirty. It's sad, it's unjust. It's human nature.\\n\r\nAnd maybe that's one more point for why I liked it.",
            "date": "2014-09-14T11:37:00+00:00",
            "helpful_count": 22,
            "mal_id": 160299,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459866.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Outori",
                "username": "Outori"
            },
            "url": "https://myanimelist.net/reviews.php?id=160299"
        },
        {
            "content": "as a person who hated the first two seasons of kuroshitsuji you would think i would hate book of circus (especially after that disaster of a second season) but i was happy for 2 reasons. 1 the new director and write of this was faithful to the manga and made it genuinely good; and 2 this has become my trump card to the fan girls of the franchise who would jump down my throat when i said i hated the first two seasons.\r\nStory: the story is that children have been disappearing and it is linked to a circus traveling around so Ciel and Sebastian gounder cover as performs to see the link. as opposed to the first two seasons the story here felt more complete and a genuine mystery throwing in red herrings and a twist that works (unlike seasons 2 twist which was insulting to everyone)\\n\\n\r\ncharacter: for the first two seasons i never saw why girls liked Sebastian he was a boring kiss ass but in book of circus he went from my most overrated to one of my favorites. Sebastian is snarky, he's sneaky, he will use any chance to mess with ciel and twist his words against him and insult him; I LOVE IT! Ciel is honestly more of the same from the first season but here it works because no body treats him like he's special; he get's made fun of more, has to handle things himself and FINALLY admits he's no better then any other human. the circus members feel genuinely like a family which dose make the ending sad. they use William as the reaper instead of Grell which is a good choice because he plays a great rival for Sebastian. finally the servants of the Phantomhive manor actually get there moment to shine and show why there actually there (something they never really did in the first 2 seasons.\\n\\n\r\nSound: the music in this anime is memorable and stands out. it wins be default; since it adds in more style of music besides generic Gothic music and it fits way better in the situation then the other two seasons. \\n\\n\r\nArt: face it whether you like Kuroshitsuji or not the art is good. so naturally this looks great. that being said what kept bugging me was the cgi on the horses or other live beings it feels unnatural; but the designs are still good and stand out.\\n\\n\r\nEnjoyment: again as a man who hated the first two seasons i really enjoyed this as a stand alone anime. it still surprised me that i actually enjoyed it; it dosen't do that yaoi overtones that turned many people away and felt like it's own anime to enjoy.\\n\\n\r\noverall i like this anime; will it be anime of the year sorry but no; but did i like this anime yes. take my words for what you think but i enjoyed it alot and did not regret watching it.",
            "date": "2014-09-12T16:08:00+00:00",
            "helpful_count": 21,
            "mal_id": 160065,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1274351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/maskedknight93",
                "username": "maskedknight93"
            },
            "url": "https://myanimelist.net/reviews.php?id=160065"
        },
        {
            "content": "Kuroshitsuji: Book of Circus is nothing like its prequels. Why so? It takes the brimming potential set by the first season of the franchise and invents an arc. What kind of an arc, you say? Well, come closer, and let me tell you. \r\nCiel Phantomhive, a boy who had undergone all sorts of hell, makes a contract at his desperate moments with a demon. This demons vows to never betray him, to forever stay by his side as he lives, a demon that does his everything bidding to the fullest. A demon: named Sebastian, who shall forever be his loyal butler and carry on hisplan to avenge the ones who done him wrong while serving under the Queen of England- until the moment that goal is achieved, that revenge sated, and his soul... eaten. \\n\\n\r\nBut we already know that. \\n\\n\r\nStory:\\n\r\nThe Queen of England has ordered Ciel Phantomhive to investigate in a case. In this case, children are suddenly mysteriously disappearing every time a certain circus comes by, and Ciel must catch the culprit and bring down justice. That's basically the story. But, wait, isn't there more? Yes, there is. It's basically another plot that technically takes place after the Curry arc back in the first season, but it, once again, is like no other. However, as you watch the first episode, it's nothing but the same thing that basically happened in the first episode of the first season. It's so... simple, awfully bland, not off to a great start. We all know that the formula is going to be along the lines of: Ciel investigates, tells Sebastian to do everything for him, finds culprit, Ciel is about to die, Sebastian saves his butt, \"Yes, my Lord.\", and Sebastian kills everyone. But as we delve deeper into the plot, perhaps this circus isn't so much laughs and fun as it claims to be. And perhaps... things will be different this time. \\n\\n\r\nOh, what am I saying? We all know clowns are scary. \\n\\n\r\nArt: \\n\r\nThe art... it's the same as the previous seasons. It is by all means not bad at all. In fact, I love it. It's beautiful. But, I want to stop here for a moment, and just comment on the opening for a bit. It's... astounding. Amazing. Like I said before, this opening is incomparable to the previous seasons. When you watch this opening, you have this feeling of suspense and it carries the dark tonality that Kuroshitsuji had all along. The animation is extremely fluid, the colors and desaturated and faded, giving off that eerie dissonance, while at the same time, still has that excitement contained within. Oh, what can I say? It's fabulous. \\n\\n\r\nCharacters:\\n\r\nThere isn't much character development. But, does this mean that they aren't interesting to watch? No, not at all. Though Sebastian is still the perfect demon he is, and Ciel the ruthless prickly brat he is, we have to remind ourselves that this is a supernatural show, a show about suspense, AHA! moments, blood, gore, horror. And wow, does this seriously do a good job on those aspects. The horrors Ciel gone through, the horrors the side characters gone through. And speaking of side characters, you do get a new cast of colorful side characters. You have Joker, Beast, Snake, Doll, Dagger. They first appear as quite a mix of rainbows, but not before too long will these rainbows wilt and drop dead to the ground. And you will feel with them, you will cry with them, you will pity them. For this is a story of tragedy. A story of suffering. A truly sadistic story. \\n\\n\r\nSound: \\n\r\nThe soundtrack is pretty nice. Though not too memorable, but the opening, the sound is equivalent in praise as the animation. \\n\\n\r\nEnjoyment: \\n\r\nHow could you not enjoy this beautiful third season of Kuroshitsuji? Simply put, it was an absolute shock to me on how good it was. It takes the brilliant potential the show had all along, expanded upon it, built upon it, explored upon it, made it colorful and brilliant, exactly how the first and second seasons should had been all long. My final verdict: You will watch this. You will like this. The suspense, horror, blood, tragedy, sorrow, pity and fast paced story will keep you interested until the show is over. Don't be fooled by the slightly giddy first episodes. The ending ties everything you've seen into a nice little bow on a nice little Halloween present. \\n\\n\r\nLadies and gentlemen, I bring you Kuroshitsuji: Book of Circus. \\n\\n\r\nHis Butler, recommends thee.",
            "date": "2014-09-11T15:33:00+00:00",
            "helpful_count": 21,
            "mal_id": 159945,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Enharmonic",
                "username": "Enharmonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=159945"
        },
        {
            "content": "Kurushitsuji 3: Book of circus(Black Butler 3) is a continuation of about halfway through the first season of Kurushitsuji. It follows the manga and is a rather important piece in the main character's life(Ciel phantomhive) as it explored and identifies some main points of his past. \r\nThe story, with the exception of the first episode(which is there to reintroduce the characters) is well thought out and since it is directly from the manga, any qualms with the story will come down to weather or not you like the manga or think that that arc was particularly good or bad. The plot is basically this: Atraveling circus, known as Noah's ark circus, comes to London. However, they are notorious for leaving behind missing children in every place they have visited so the Queen tasks Ciel with finding out if there are any truths to the rumors and if so, end the circus once and for all. The plot in general is well done given its series length of ten episodes, which you may or may not like. Objectively, it seems that ten episodes was a bit to short to truly capture everything but from what i have read from the Manga, it was \"word for word\" and therefore, done perfectly. (Though the end will leave you wanting more, and basically leaving you with the statement: \"I feel like there should be more\")\\n\\n\r\nThe art is well, if not slightly better than the first series, and I can't think of a single bad frame. \\n\\n\r\nAs for the sound, the opening and ending really fit the series well, and though I can't say I enjoyed the ending, I actually do like the opening(& have even downloaded the song to my phone). Along with the original OST used for black butler, they have added some new medley, which is good and fits the series well, specifically the times it is used. \\n\\n\r\nThe characters are mostly ok, and we get some great development in Ciel's character. The antagonists of the series are ok as well, and rather interesting as well, given their personalities conflict with their duty; the things they must do. There are a few characters that are not really developed enough, and despite their importance, seem almost disposable. (Though whether this was done on purpose or if it was just like the manga i cannot say). The only qualm I have(If you can call it that) is the misleading opening, which identifies the reapers(along with a new one). Though they are in the series, with Will being the most prominent, their role is rather ambiguous(Specifically will's) and  they don't contribute at all to the series other than for an amusing couple of scenes. \\n\\n\r\nIt all comes down to if you enjoy Black butler(Which I do; & I am a straight male). The series was much better than the second season in story and enjoyment and only falls short of the first(Due to the fact the first season has many arcs and more episodes while book of circus had 10 episodes and 1 arc). \\n\\n\r\nAs a footnote, I understand its appeal and sort of directness at female audiences, but the show, just like all the seasons, have complicated ideals, emotions and some interesting personal philosophies. Of course, the humour and relationships(like the one Grell has for Sebastian) are a bit over the top, I still find it a rather enjoyable series, and found Book of Circus to be a favorite arc of mine. (And if you don't like it, I Imagine there will be many more seasons to come)",
            "date": "2014-12-23T22:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 173959,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=173959"
        },
        {
            "content": "Some Spoilers Ensue...\r\nThis season is hands down THEE best of the show so far. I just loved season one and two, but this one was absolutely gorgeous. It is probably my favorite anime airing this summer. It was engaging, disturbing, emotional, funny, scary, and ultimately heartbreaking. I always know when a show's good because as I reflect back on it, all I can think is how sad I am that it's over and how much I wish I could watch it again not knowing what the outcome would be like.\r\nStory: This season follows the manga almost exactly. It introduces a slew of new characters, allof which are vibrant and exotic. Under the Queen's orders, Ciel is asked to investigate a number of child dissappearances that come about when the Noah's Ark Circus is in town. The first half of the show was entertaining and cool as we were being introduced to everyone. It featured Will the Reaper which was a nice touch (though who wouldn't want more Grell?), and had some great demon/reaper banter. Ciel was out of his element also which was interesting to watch. As we progressed with the story though, things started to take a dark turn, and we were treated to some of the most awesome reveals and twists solidifying this show as one of my favorites.\\n\\n\r\nAnimation: As always, it's devine. The characters are gorgeous and the scenery and colors are beautiful. The horror was well done, and graphic enough for my taste which is cool because a lot of anime I've seen usually cut away or make the blood black...this did not.  The circus itself was also gorgeous and the characters' tricks and traits were visually stunning...especially Sebastian. =)\\n\\n\r\nSound: The voice acting in this show has always been above par. Sebastian and Ciel's voice actors are mesmerizing and portray the emotions of their characters perfectly. All of the new voice actors this season were also brilliant. The OST music as well was just stunning. It was also a nice touch to add the \"Tom the piper's son\" song in giving us this goosebump feeling when Joker sings it. The opening and ending themes were both some of my favorites as well. You can't go wrong with SiD, but the ending theme (and animation) were the spotlight of the themes.\\n\\n\r\nCharacters: As I stated before, we are introduced to a wide variety of new characters in this season. At first, I was kind of upset Grell wasn't in it, but he comes in with a bang at the end...as does The Undertaker (in a breathtaking scene), and the Phantomhive servants. There's a part where Finny goes from cute and loveable, to downright scary in a matter of seconds. The beauty of this season is how much they make you care for these characters before ripping them away from you...somewhere, Yana Toboso is just laughing at us.\\n\\n\r\nOverall, I adored this season. Everything was well thought out and portrayed beautifully on screen and I just don't know what else to say...my favorite show of the summer.\\n\\n\r\n10/10\\n\\n\r\nWatched Subbed.\\n",
            "date": "2014-10-09T01:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 164167,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Animeted_love7",
                "username": "Animeted_love7"
            },
            "url": "https://myanimelist.net/reviews.php?id=164167"
        },
        {
            "content": "Akuma no Shitsuji continues onto the 3rd season with Book of Circus.\r\nThis arc takes place sometime after Madam Red's incident from the first season.\r\nI am left speechless about what to say about this season. All the things that happen in this season is just so fuutsu(normal) that i just can't think of anything unique to write about this. Oh, i just remembered something. Was there so many shotacons(lolicons being 'lolita complex' and shotacon being 'shouta complex', shouta means small boy-the male version of loli) in the 19th Century? Or is this to please the fanbase of shotacons who want to see this or that doneto shoutas? Whether it is fan service or reality, it just doesn't fit well with me. Once you notice this, you can see nothing but shoutacons and old men everywhere.\\n\\n\r\nShotacons will love this season(probably) as it has our Shota shuujinko(protagonist) Ciel Phantomhive who shows of his dizty self in the circus.\\n\\n\r\nIn the previous review of Kuroshitsuji II, i said something like 'this season is a must watch if you want to see the next season'. But, it looks like the Kuroshitsuji II is the end of the Kuroshitsuji series, at least according to the chronological order of the story.(As a side note, i haven't read the manga so i don't know if it ends then or not.)\\n\\n\r\nAs for whether you should watch this season or not, if you liked the first two seasons or if you want to complete the series, i recommend to watch this season but if you haven't watched any season yet, you can skip the series altogether as there is nothing worth mentioning about this series.",
            "date": "2015-11-27T06:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 204269,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4758709.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ryuuForte",
                "username": "ryuuForte"
            },
            "url": "https://myanimelist.net/reviews.php?id=204269"
        },
        {
            "content": "Cold stories always have an indescribable charm.\r\nObjective stories that simply narrate by favoring no one, are considered cold.\r\nStories in which the author does not create inferior supporting characters so that the main will look good are objective.\r\nKuroshitsuji: Book of Circus is a cold story like that...\r\nAnd unlike the Kuroshitsuji and Kuroshitsuji II, it is merciless.\r\nThe usual order for investigation from the Queen of England is the pretext for the story to start, an order addressed to Ciel Phantomhive and consequently to Sebastian-his one hell of a butler-containing directions for infiltrating a traveling circus squad which might be related to some recent children disappearances. In spiteof it beginning smoothly, the plot becomes a little bit heavy towards the end, deluging you with that unaltered sadness that one likes and dislikes at equal amounts.\\n\r\nKuroshitsuji is characterized by a certain charming cruelty you can not attach emotion at. Do not expect to feel the rebellious awe that takes the best of you when the protagonists win a battle at an anime such as One Piece, there will be no such thing, in the end however, you will admit that its different kind of awe is pleasant in its own way. Because amidst all of its ugliness or the ugly truth Book of Circus shows, the fleeting beauty it possesses is a quality one. As opposed to many other anime that force you to feel nice just because then characters are laughing or having fun, that beauty is genuine, letting you choose the full of grace fleeting joy you will eventually feel-along with the bitterness. \\n\\n\r\nThe quantity and art. The fine quality of the ten episodes might make you want more, nevertheless, due to the fact that they cover no more and no less than necessary, you end up satisfied with the ten as they are. Furthermore, in case you enjoy beautiful faces in your anime, Kuroshitsuji will utterly cover you at that part.\\n\\n\r\nDespite the fact that the new story is short it meanders with great detail, rendering it complete and with no vacancies that limited time usually causes. As for the characters, almost everyone is so well elaborated, at a point where nearly none of them feels unnecessary, supplementary or uninteresting, a notion that other anime consume dozens of episodes in order to achieve. More importantly, Book of Circus shows additional elements that any person whom have watched the prequels would want to know. \\n\\n\r\nAs for the direction a cartoon can have-the angle of the supposed camera, the music , the consecution of the scenes-is quite high leveled and in the sense that it won't make you tired.\\n\\n\r\nAfter all, this story is obviously the downfall, the only possible outcome the course of a soul can have when offered to a demon.\\n\r\nKuroshitsuji: Book of Circus is a tragedy, an incredibly alluring and well made tragedy...",
            "date": "2015-07-03T08:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 192151,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3933117.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Megami",
                "username": "_Megami"
            },
            "url": "https://myanimelist.net/reviews.php?id=192151"
        },
        {
            "content": "Book Of Circus is the worst thing put out by Black Butler franchise till now. But still they are pretty much enjoyable in their own way.\r\nStory: The story is quite great but the problem lie with the way it is executed. Story showcasing how poors are led into criminal world can be sensitive and dense. It just need some time to dig it roots into human mind and heart, but unfortunately BOC have tried to build such a huge story into just 10 episodes.As a audience i failed to connect myself with the story in such a less time. Once you are disconnected with storyits not possible to grow emotional attachment to it no matter how emotional the story is. \\n\r\nCharacter: Same problem lie here if you can't connect with story so obviously you won't be able to feel for characters. Introducing so many good characters at once and building just one or two of them is a shame.\\n\r\nEnjoyment: There are only few dull moment in 10 episodes it is thoroughly enjoyable. There is enough dose of funny moments and action scenes (more like brutal one sided massacre) to keep the enjoyment bar full. \\n",
            "date": "2014-09-14T08:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 160271,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3892693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedAmin",
                "username": "AhmedAmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=160271"
        },
        {
            "content": "I just completed this show, and as it happens this is my first review so I'll do my best to convey my experience and objectively evaluate the show. I will also try to not reveal key story elements as people who haven't watched the show might want to look at reviews to get an idea of what they are in for.\r\nWith all that out of the way let's dive in.\r\nStory : This show takes place after the first Kuroshitsuji (and I'm guessing this makes Kuroshitsuji II irelevant ) but not having watched it wont detract much as there is exposition to fill in the blanksfor new viewers , Old viewers are of course in context and can enjoy the triumphant return of the franchise and also know what to expect. Now the story adapts the Circus of Noah Arc from the manga in which Ciel (who is the Queen's \"guard dog\" ) is tasked with solving the mystery of serial children abductions occurring all over England,\\n\r\nthe aforementioned circus being the prime suspect since all of the abductions take place when the circus is in town. From there the story takes the usual approach, Ciel & Sebastian gather intel, identify the target and then proceed to the climactic resolution of the conflict, wrapping everything up (which usually involves their adversaries clashing with the Phantomhive household). Overall the story was enjoyable, it featured most of the things we love about the series and illustrated a rather heavy subject.which I will expand on in the character section \\n\\n\r\nCharacters : the characters in Book Of Circus are intriguing and enjoyable for the most part, in Book of circus all the Human members of the cast become illustrations of human suffering in the forms of corruption , despair and more than anything Damage as almost ALL humans that appear in Book of Circus are damaged to some extent, often in more than one ways. \\n\r\nAll of them are also tragic characters, the circus troupe is comprised of likable (for the most part) characters who began as outcasts, with no family home or money, many of them missing limbs and struggling just to stay alive , however, even with those hardships behind them their new lives are far from peaceful. Then in our main Duo, Sebastian the Demon butler himself and Ciel Phantomhive the young Earl/demon contract holder, as well as his usual entourage make up the \"protagonist\" cast.\\n\r\nWhat surprised me in book of circus is that we get a really good glimpse inside Ciel's psyche and we are reminded that out of all the characters introduced in Kuroshitsuji, Ciel is the most tragic and possibly the most damaged character, his contrast with the rest of the cast and of course with Sebastian's character (who is quite frankly just enjoying himself completely untouched by all the destruction and mayhem occuring everywhere around him) magnifies the impact of that fact. Some of the more quirky and unique recurring characters make a return in Book of circus but their screentime is minimal, overall while the characters are not perfect they are refreshing from what you see in most anime , development is decent for the amount of episodes given and unless you are one of the most elite of elitists you 'll be satisfied. \\n\\n\r\nArt & Music : art maintains this show's beautiful aesthetics and sets the tone perfectly , character designs are elaborate and detailed backgrounds are appropriate and direction is also upper tier , there are some minor bits of censoring but that's to be expected with any televised release , music is also very fitting with the opening theme in particular being one of the best in the series \\n\\n\r\nOverall I give Book Of Circus 7/10 , fans of the series are sure to enjoy it and new viewers can get a good taste of what the Black Butler franchise has to offer",
            "date": "2014-11-02T19:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 167233,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736349.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yagyuu_Mugen",
                "username": "Yagyuu_Mugen"
            },
            "url": "https://myanimelist.net/reviews.php?id=167233"
        },
        {
            "content": "Have always loved Kuroshitsuji, and the number of plot twists in the Book of Circus just seriously flipped me. I couldve never expected these unexpected turn of events, which makes the plot so much more interesting. Alot of thought has been put into each character - you can tell by the backstory and how they each react differently to the same events. Loved this, I can't wait for another to come out (I heard that Book of Murder may by coming out in October).",
            "date": "2014-09-12T06:46:00+00:00",
            "helpful_count": 11,
            "mal_id": 160011,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4006223.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hermainesay",
                "username": "Hermainesay"
            },
            "url": "https://myanimelist.net/reviews.php?id=160011"
        },
        {
            "content": "\"Kuroshitsuji: Book of Circus\" was the perfect sequel to the first.\r\nAs soon as I watched the first episode of \"BoC,\" I knew I was in for an exciting ride. This story was one of the most interesting fantasies I will ever see.\r\nMy adorable and sadistic Ciel is voiced by the talented Sakamoto, Maaya. She's voiced many characters like Crona (Soul Eater) and Kusanagi, Motoko (Ghost in the Shell). Her voices ranges anywhere from a powerful female role to a boyish one. She did not disappoint in \"BoC.\" The flaming (literally) Sebastian was voice by none other than Ono, Daisuke, whose voice should be outlawed. Onovoices characters like Heiwajima, Shizuo (Durarara!!), Smith, Erwin (Attack on Titan), and Midorima, Shintarou (Kuroko no Basket). His voice is silky smooth velvet that soothes the soul and captivates the heart. Yet again, he did a wonderful job at playing the seductive Sebastian. And lastly, I have to give a little shout out to my voice acting god, Kaji Yuki! He played the role of Finnian, and made the cute boy absolutely even more adorable. Although Finnian's a little on the deadly side.\\n\\n\r\nAs I said before, \"BoC\" is the perfect sequel. It continued the creepy aspect of its predecessor, and just had an overall wonderful mood to it. \"BoC\" continues to make English food look appetizing, and is just a well rounded story. I especially enjoyed Sebastian making fun of Ciel in one episode when they went to infiltrate the circus. It was also amusing to learn more about Ciel's past as the series progressed. The music in \"BoC\" is also soothing. It continues the classical theme, and with even capture those who do not enjoy the classical genre much. I can't say I have any dislikes other than the fact that the final episode did not close out anything. It just made me even more confused of what exactly had transpired. But the \"Book of Murder\" movie is coming out, so I'm not too worried.\\n\\n\r\n\"Book of Circus\" is a very confusing, and deep story. It keeps one on edge throughout the whole  watch. It's a good anime for those girls who want to fangirl over the two main characters. Boy might not like it as much, even if it is shounen, but they'll still enjoy it as long as they forgive Sebastian for being too hot for everyone. I very much enjoyed this series, and cannot wait until the movie comes out.\\n\\n\r\n-\\n\\n\r\nStory - 8\\n\r\nIt's very good. A little confusing from time to time, but it continues on its straightforward path. The whole concept is very well thought out, and catches the eye.\\n\\n\r\nArt - 9\\n\r\nI thought the artwork from the first series was very good -- maybe even better that \"Book of Circus'.\" In any case, there wasn't a lot of difference in artwork from the first series to this one. But whatever the matter, the art was simply beautiful and kept the dark undertones of the story. \\n\\n\r\nMusic - 8\\n\r\nThe music will always be my favorite part about this anime. However, sometimes classical music doesn't sit well with a certain audience. But I liked it and that's all that matters, right?\\n\\n\r\nCharacter - 8\\n\r\nThere was lots of character development in this series! I got to learn how much of a sadistic bastard Ciel really is, and became attached to the first string circus members. Sebastian didn't change very much. Though he is a demon and has lived thousands of years...he still thinks the best way to get an answer is through manipulation and sex. Got to see Grell though! His lovely flamboyant self was very much appreciated.\\n\\n\r\nEnjoyment - 10\\n\r\nEach week I would be excited just to sit down and watch \"Book of Circus.\" I very much enjoyed this series, and cannot wait for the \"Book of Murder\" movie to come out.\\n\\n\r\nOverall - 8.6\\n\r\nThis anime turned out to be very good. It did not suddenly become worse just because it's a sequel. I give props for that. I would have liked there to be more explanations for certain events that transpired, but oh well. I am satisfied.",
            "date": "2014-09-21T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 161459,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2733905.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Verria-Nichole",
                "username": "Verria-Nichole"
            },
            "url": "https://myanimelist.net/reviews.php?id=161459"
        },
        {
            "content": "The new Black Butler: Book of Circus is an anime adaptation to Kuroshitsuji: Noah's Ark Circus which left off after the Curry Contest Arc of Season 1 (Episode 15/Chapter 23). For those people who haven't seen Black Butler 2 yet, don't worry: that season isn't canon. For those who've already seen Black Butler 2, totally disregard that season when watching this one to fully enjoy yourself.\r\nThe ending of Black Butler 2 left many unsatisfied; however, Noah's Ark Circus made it up for me. This arc had every characteristic of a typical Black Butler arc: a dark story, psychotic characters, and a mysterious setting. However becauseof its length, this particular arc had much more to offer in terms of character development and story. However, every other aspect such as the art and sound/music stays true to the original series.\\n\\n\r\nStory:\\n\r\nThe plot is everything I expected from Black Butler, but more. Initially, it may seem like any other Black Butler arc where people get killed, kidnapped, tortured, and the perpetrator is at large where it's up to the protagonists, Ciel Phantomhive the Queen's Guard Dog and his demonic butler Sebastian Michaelis, to get to to the bottom of the crime. However, the story is more developed than previous arcs as it is the equivalent of a single season of most anime, about a dozen episodes.\\n\\n\r\nEach arc in Black Butler focuses on a particular character or group of characters. Due to this arc's length compared to some of the original series' arcs such as the Curry Contest arc, the characters' are more well-developed and invested in; therefore, the story is more developed.\\n\\n\r\nCharacters:\\n\r\nThis arc introduces a little more than half a dozen new characters. Due to most of them being circus performers, each is unique in their own way. Everyone has their own gimmick and character traits. For example, as his name implies, Joker is the most cheerful, silly, and charismatic performer among the circus folk. Initially, I was given the impression that each of them were psychos who committed crime for entertainment under the mask of a typical performer. However as the series progresses, the characters are shown to be more human than most antagonists from previous arcs who were either crazy or monsters in nature. This gave me a sense of irony as circus performers are stereotypically portrayed as freaks of nature rather than humans. This ultimately made me more emotionally invested into these characters despite being the antagonists. \\n\\n\r\nAs for recurring characters, let me just say that my perspective of the Phantomhive household and Ciel have changed quite a bit.\\n\\n\r\nArt:\\n\r\nThe art of this installment is no better nor worse than the original series'. Aside from a few differences in color and finishing touches, it is difficult to distinguish this arc's artwork to that of the original seasons. However because of that, I really had a sense of nostalgia when watching. In addition, the overall animation seems up to date, not that it was outdated a few years back. \\n\\n\r\nSound:\\n\r\nRecurring characters retain their previous voice actors, which are perfect anyway. The new characters receive voice actors that fit very well so no complaints at all on the voice department.\\n\\n\r\nThe opening theme Enamel by SID, who also did the previous Black Butler openings, builds up excitement and energy for me, which is a great aspect for opening songs and definitely did not expect less from SID. Coincidentally, the ending theme Akira by Aoki Tsuki Michite calmly concludes each episode with almost a sense of sadness and even a sense of excitement for the next episode.\\n\\n\r\nAs for the music/OST that plays throughout each episode, I honestly don't remember any song that stood out to me. Usually a certain song sticks with me for each anime I've seen, but not this one. However, don't get me wrong. This just shows that the music must've blended in nicely with the atmosphere of the corresponding scene; as a result, I never noticed them. Furthermore, this made me focus more on the scenes rather than the songs. This was also the case in the original series for me. However, it would have been nice to look forward to the release of the OST to download for my favorite song, but alas: no song stood out to me.\\n\\n\r\nEnjoyment: \\n\r\nIt's safe to say my feelings were tampered with a lot in this anime, most notably by the characters and their backgrounds. However, I absolutely love it when an anime makes me bipolar. Emotions. Feelings. Frustration. It's such an experience to have your feelings jump left and right, especially during the last few episodes where the climax is. Although it is not uncommon for an anime to affect my feelings, it is rare for an anime to do it right. This anime definitely delivered.\\n\\n\r\nOverall:\\n\r\nOverall, Black Butler: Book of Circus is undoubtedly one of the best of this season of anime. I would even venture as far as saying it is one of the best this year. Story is familiar yet different. Characters are well-developed and diverse. Art is nostalgia provoking. Sound/Music blended well with the atmosphere and suspense. Enjoyed this anime more than most anime in the past year and that's saying something because there were so many great anime in the past year. Highly recommended for those Black Butler fans out there. Also, the sequel Book of Murder is set to premier next month on October 25; therefore, you shouldn't waste time. Watch Book of Circus now!",
            "date": "2014-09-14T19:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 160357,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3065073.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/broniichan",
                "username": "broniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=160357"
        },
        {
            "content": "*may contain minor spoilers; read at your own risk*\r\nI've finally watched this after putting it off for so long. And before you think I'm some crazed fan girl who's rating way to high, just read. I promise it has nothing to do with Sebaciel.\r\nThe story is pretty basic in itself. Ciel gets a letter from the queen and he's off to obey this, just like a guard dog. And what isn't fun about a circus? Don't worry, they'll only go into town later and kidnap children for some sinister purpose! But what is this purpose? This is where I like Black Butler, it always hasthat nice element of mystery and suspense.\\n\\n\r\nAnd I commend the writers by now following the manga. Because second season was an atrocity of filler and nonsense. If you're thinking of watching it, don't. It's filled with facepalms and a plot that makes zero sense. \\n\\n\r\nDisregarding that, I think I've enjoyed my time with these 10 episodes more than I did with all of season one. I admire how the true nature of humans is exclaimed. \\n\\n\r\n\"Unlike demons, you're base, you harbor a complicated malice, you lie...You struggle desperately, knocking down others on your way...You steal and are stolen from, you make endless excuses...And still you strive to get over the hill far away.\"\\n\\n\r\nThe art for this is very stunning and fluid. The dark tones contrast pleasantly with the sharp and crisp colors. Outfits of the characters is very eye catching and unique as well.\\n\\n\r\nOne outstanding aspect of this season is the sound. Voice acting is on point as always, but that Opening and Ending song. Both are probably one the best of the summer lineup last year. \\n\\n\r\nEven though the main circus cast only had 9 episodes, I feel so impacted by them. They weren't anything special. But they all shared the same past. Human beings being rejected from society because of a physical difference. Then one day they are given a hand of kindness, but to only be stabbed in the back with that same hand holding a knife later in life.\\n\\n\r\nAll they wanted was happiness. For them, for each other. And they had all that taken away from them. They became obsessed with protecting something that wasn't even worth protecting. We are after all, only human. We do what we can to protect what is dear to us. They didn't deserve to have their life torn from their hands.\\n\\n\r\nI'm very happy with this 3rd installment of Black Butler. It tug on my heart strings. I actually cried. The last few minutes of the last episode is so beautiful. \\n\\n\r\nOverall: 9/10  \\n",
            "date": "2015-03-30T11:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 184110,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeZ0id",
                "username": "AnimeZ0id"
            },
            "url": "https://myanimelist.net/reviews.php?id=184110"
        },
        {
            "content": "Kuroshitsuji: Book of Circus is one of the animes that aired last year specifically in fall, after the second season. Now firstly, this is my thoughts on the anime, and this is my first time making a review in written form. So let's start off with it, shall we?\r\nStory: 8/10\r\nPersonally I find this story quite amusing and enjoyable. It kept my first impression of the anime show quite shocked, as the time passed by with the episodes, it kept going deeper into thought about Ciel Phantomhive's relationships with the people of the circus. Since I never have read the manga of its name, I findit very well done by going into detail per events of the show. It's ending was satisfying in the end with the simple thing left in my mind throughout the show's 10th episode.\\n\\n\r\nArt: 9/10\\n\\n\r\nAs a person who watched the Black Butler series, this quality of animation was greatly well done in terms of fluid fights and at the same time with some effects for some comedy of the episodes. The designs as always looks the same but its art shocked me the changes after a time when I watched season 1 and season 2 of the show.\\n\\n\r\nSound: 8/10\\n\\n\r\nNow why did I gave it a 8/10? well Not almost all osts of the show were great, except for a few that I really didn't like that much. As for the Opening and the Ending themes of the show, I actually love them pretty much. The Opening song along with the visuals fits perfectly, and its quite catchy as well for a person that likes beats and a rock type of song. For the ending song it was a piano type of song, but I simply love it because of the sound being played and the person singing it.\\n\\n\r\nNo complaints about the Voice Actors in this show.\\n\\n\r\nCharacters: 8/10\\n\\n\r\nThe reason why I gave the characters an 8/10 is because there are some of the new characters that haven't gotten much of a backstory to know them. But the rest we pretty much got a story related to them which in my personal opinion it makes me understand their lives back and Ciel as well got a lot of development through these 10 episodes.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nI for the most part enjoyed the show. No complains about that. The music along with the things added in this show were well done in my opinion. The only thing I didn't enjoyed was just one scene in the show, it kind of made me feel like what. But the rest of the show, had very good music, very good animation along with the other things included. \\n\\n\r\nOverall Score: 8.6/10 (Rounding it up would be a 9/10)\\n\\n\r\nA great anime and a great ride in my personal opinion of this show. Go ahead everyone and watch it! You won't be disappointed.\\n",
            "date": "2015-05-30T16:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 189203,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=189203"
        },
        {
            "content": "Book of Circus is a great series and is a great addition to the series as well as a good start point to newcomers.\r\nActual Score: 9.4\r\nStory: 10\r\nThe story revolves around a piece of the manga plot missing from the main anime known the circus arc; which is a fun story made up of your favourite characters while also introducing some new ones as well as dark and interesting story as well as circling around some events from Ciel's backstory that add more depth which also helps fit newcomers in understanding the story better as well as serving as a recap for fans already. The storyis well driven and has good pacing even though its only 10 episodes long while also keeping up with an interesting story and the comedy fans know and love.\\n\\n\r\nArt: 9\\n\r\nThe art is outstanding with well detailed characters and amazing set pieces that make the world come alive as well as well done fight scenes that will make your heart pound.\\n\\n\r\nSound: 9\\n\r\nThe opening of the anime is well done and fits the mood of the show with J-Rock band SID that set a dark atmosphere getting you ready for the show; while the ending was also well done it didn't have the same level as impact as the opening which made me neglect it fairly fast. The OST is amazing and helps portray the dark atmosphere the series portrays which is full of orchestral tones and folklore like music that fits nicely with the setting.\\n\\n\r\n Characters: 9\\n\r\nThe characters that you know and love are back as well as some fresh faces that get a decent amount of backstory that opens that character more up as well as getting decent amounts of screen time. The most notable of the new cast was Joker ring leader of the circus who gets good screen time and has a unique personality that is refreshing as well as the other characters of the circus who all have interesting personalities and appearances.   \\n",
            "date": "2014-09-12T12:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 160039,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=160039"
        },
        {
            "content": "I do not read the manga so I was looking forward to this a hell lot, I'm not a big fan of the black butler series, but it is more then worth watching. In the end I was more then satisfied and my immediate reaction was this, 'MOAR!'\r\nThe story follows the manga immediately from where it left off in season 1, after episode 15. This anime can be said to be of 9 episodes rather then 10 as the first is quite similar to season 1 episode 1.It starts of slowly and lightly; there are a lot of funny scenes that are typical of ablack butler series (perfect Sebastian's love for cats, the annoying Elizabeth, and Phantomhive's  trouble making trio..) but towards the ending the series takes on a dark path. It turns rather bloody and gruesome with a load of revelations.\\n\\n\r\nThe character development is different for different people. Some characters are done beautifully while others are just for screen-filling.(That is the right word, right?) When first stringers'' back story were revealed you can not help but feel sorry for all of them.(However I HATED that Lord Kelvin)  \\n\\n\r\nThe art is beautiful. Season 1's art wasn't impressive, season 2's was slightly better. It was elegant- but it was not suitable for a series as dark as black butler. But the art of Book of Circus (obviously)outmatched them both. It was beautiful and it suited Kuroshitsuji. The sound was awesome. I really loved the opening- easily one of my favorites.\\n\\n\r\nOverall I enjoyed this series a lot and I did not reject anything from this anime. A great anime. \\n",
            "date": "2014-09-12T05:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 160001,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3414707.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ironace",
                "username": "ironace"
            },
            "url": "https://myanimelist.net/reviews.php?id=160001"
        }
    ],
    [
        {
            "content": "Entertainment is a broad word to be honest. People tend to define entertainment as something of enjoyment and value that is provoked. And what better place to get entertainment than at a circus? As an attraction and adaptation, Black Butler: Book of Circus adapts the Noah's Ark Circus arc from the manga. (Volumes 6-8, chapters 24-37) Previously, the arc was skipped from season 1 (occurs after the Curry Arc). Nonetheless, the show establishes the assumption that you are already familiarized with the franchise; either anime or manga. Taken for granted though, Black Butler: Book of Circus continues the fantasy adventure of a young boy andhis butler. They return and takes part of an attraction at a circus where there’s much more than just entertainment.\\n\\n\r\nThe first episode essentially starts off as anime original filler that serves as a way to get fans refreshed and fired up for the main course. The main course here is of course, Noah’s Circus led by a man named Jack. It doesn’t take long for the main course to sink as the majority of the actors and actresses are introduced. But to get the best experience out of this series, it’s important to get attached with Ciel and Sebastian. They play their roles in this arc in a detective-esque role as they investigate the underworld relating to a case of missing children. Point taken, this arc has a combination of both lighthearted and dark moments. The latter is easily realized as the arc progresses with secrets unrivaled and boundaries of civilized behavior shattered in pieces.\\n\\n\r\nThere’s not much change however when it comes to our investigators, Ciel and Sebastian. Their personalities remains generally the same as the previous season. One thing noticeable is their growing attachment such as Sebastian looking after the well-being of his master. At the same time, he also plays the fool and pokes fun at Ciel; in particular his outfit and stage name. On the other hand, Ciel realizes what he must do to secure the case and takes action. Despite seeming like a timid boy, Ciel can be quite courageous and dedicated as evidenced when he gets a flu yet still wishes to continue with the case. Inspiration is perhaps a word to describe this young boy as well when we see how much he despises the darkness that roams behind the circus. And despite being childish at times, Ciel is a clever boy with ideas. Sebastian on the other hand uses his seductiveness to advantage and intellect to aid in the case. His relationship with another grim reaper in this arc adds a touch of comedy with their mutual dislike. The “rivalry” between the two takes various turns and exaggerates itself with oddball humor. Nonetheless, Ciel and Sebastian are still the main duo of this show. They might not be Sherlock Holmes of the century but they got guts.\\n\\n\r\nMystery becomes a pivotal point throughout this series’ story as we find out more about the origins of the circus. Ringleader Joker makes his highlight entrance as he performs for the crowd. The show gives the circus performance an extravagant elegance when the characters come to the stage. Characters such as Beast, Jumbo, Dagger, and Wendy all demonstrate their skills with praise. Despite the tongue-in-cheek humor (especially during Beast’s act), the show maintains a good posture with its comedy. It also has a degree of realism as the circus acts are symmetrical to real life circus performances. Joker in particular serves as an entertaining host with his cheerful personality and is able to hide his emotions from others at will. In a way, he is almost similar to Sebastian as both characters are able to hide their true motives while putting on a poker face. At the same time, there’s also adequate relationship dynamics as seen with the case of Beast. Her inner struggles is highlighted through her feelings as we see a more vulnerable side of her. The negative side of this is that we don’t get much characterization of the circus members. We only glance at the motives/ambitions, their personalities, and perhaps where their true purpose lies. There’s minimal amount of flashback or background story to flesh out with these characters as it only scratches on the surface. Unfortunately, a series covered by a mere 10 episodes isn’t’ enough to develop them enough which is a shame. The plus side is how we can appreciate the closeness of the Noah’s Circus Trope members. They might be travelers and entertainers but at a closer glance, they almost seem and act like a family as brothers and sisters. \\n\\n\r\nAs the season is more story oriented, expect plot twists and revelations. As mentioned before, the arc gets darker as each episode progresses. Mystery envelops itself with characters such as Doll and Snake. The latter demonstrates a malevolent presence while Doll becomes an epitome for mysteriousness. The imagery the show presents with the story is that there is something dark going on behind the scenes. And seemingly enough, there’s also a mastermind pulling the strings that is even a higher order than the host, Joker himself. The story gets grimmer with sinfully crafted themes that can be stomach indulging at times. It still remains culturally developed with the European like style but gets more complicated. Its gothic style is stylized by the behavior of the characters. Add a touch of fantasy and dream-like atmosphere and we get even more artistic story. Because behind the circus acts lies a dark secret in which this series explores with. Combined with the motivation of the mastermind, the story becomes something of a shadowy theater. Expect the unexpected. \\n\\n\r\nA-1 Studios attempts to bring back the style fans were used to with the previous season. Luckily enough, it achieves its purpose. Action scenes are fluid with well-coordinated movements and pacing. The backgrounds of this series still looks elegant with detailed designs such as the Victorian themes. I’m not just referring elegance with the structures but also the way characters are designed. Indeed, characters are lavishly decorated such as the flamboyant clothes of Joker, the fiery outfit Beasts wears, or the fashionable dress up that Doll puts on. It’s not just wholly imaginative but also makes sense for its circus theme. Similarly, Ciel and Sebastian has style when it comes to their choice of clothing. There’s also minimal fan service except a few cases with the seductive Sebastian. Every demonic butler has to a have a little bit of fun though, right?\\n\\n\r\nSoundtrack is fluid with orchestral tones and a folklore-like OST. The distinctiveness of the Circus’ theme plays out well with matching background music. And with our characters, voice mannerisms fits quite well with them. The big newcomer, Joker perhaps stands out as a centerpiece of this testament as he plays the sort of ringleader, host, and of pierrot of the show. Make no mistake though. The circus conveys a darker image as the soundtrack gets darker and darker with an unsettling atmosphere on more occasions. Even with the smooth fantasy elements added, the message is there to create an abstract feeling. Oh and OP/ED songs of this series is brilliantly presented. It’s like opening the stage of each episode and finishes it off with an encore.\\n\\n\r\nThere’s a sense of nostalgia with this series. Even though Black Butler didn’t air too long ago, the show feels refreshing. Color me surprised but this adaptation did justice to itself. Despite some fillers inserted in, there’s an impeccable performance with the characters and the story it works with. The spectacle is top notch with clever humor, neatly timed battle scenarios, and well-rounded dialogues. While it doesn’t have too much action compared to the previous seasons, Black Butler: Book of Circus stands out in its own way. It’s an epic feast of a fantasy adventure with the circus and return of Ciel and Sebastian. An accomplished series with goals met. This show is definitely something to keep an eye on if you’re a fan of the original series and manga. Take notice now.\\n\\n",
            "date": "2014-09-11T13:50:00+00:00",
            "helpful_count": 127,
            "mal_id": 159943,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159943"
        },
        {
            "content": "Can you imagine how frustrating it is to be a heterosexual male who HATES paedophilia who also happens to like Kuroshitsuji? Damn it, A-1 Pictures why did it take you guys THIS long to do Kuroshitsuji right, especially after all the shit you guys did to sour everyone else's view of the series? The first season had a lot of problems behind it that could've easily been fixed with a little more foresight and Kuroshitsuji II was a pointless cash-grab that just REEKED of corporate greed and yaoi-fangirl pandering that would make even make Hetalia fan fiction look like Dr. Seuss. With all of thisdamage done to Kuroshitsuji's reputation, why did it take you THIS long to finally get it right? If you're one of the many people who've been hesitating to give Kuroshitsuji a try because of its reputation as shameless fangirl pandering, I HIGHLY urge you to watch Book of Circus before coming to any conclusions.\\n\\n\r\nBefore I begin, I just want to get one thing out of the way: yes, this is technically a continuation of the first season which picks up the manga's story where the first season left off (which is around Episode 16-onward). HOWEVER, Book of Circus is inexplicably formatted as if it was geared toward newcomers to the franchise. This is of course both good and bad. The good is the fact that you don't have to sit through the first 15 episodes of the first season to actually familiarise yourself with the characters and the like since any events that happened within the first season are quickly recapped for your convenience. The bad news is that if you are in fact, a complete newcomer to the franchise... chances are that you might get a bit lost somewhere down the road. Keep in mind that this is only 10 episodes long though, so you should just kind of roll with it if you're watching and look it up later if you really are that curious.\\n\\n\r\nAside from the stuff I mentioned before, another reason why people don't give Kuroshitsuji a chance is because well... the concept sounds kind of boring in hindsight and that's something I really can't defend because truth be told, it DOES get boring. HOWEVER, that's not entirely the case with Book of Circus. Book of Circus adapts the much-lauded Noah's Ark Circus portion of the manga's story which is where Toboso actually cut all of the superfluous bullshit and actually focused on giving us involving plot that sucks us in. Here's the deal: a travelling circus comes to London, but the problem is that children keep getting abducted in every city that the circus has been in. Considering Ciel's reputation as the Queen's guard dog, it was only a matter of time before he's ordered by Her Majesty to conduct an investigation.\\n\\n\r\nRight off the bat, we have an awesome set-up. People unfamiliar with Black Butler tend to dismiss this show as a slice-of-life supernatural comedy taking place in Victorian England, which couldn't be farther from the truth. The biggest reason that I can think of as to why people tend to have this misconception is because the first half of Kuroshitsuji's first season REALLY dialled up the comedy which really affected the overall tone of the story. The manga does retain a similar style of humour which mostly consists of visual gags and slapstick, but it's far less prevalent. Considering the fact that the vast majority of this show takes place in a circus, it's no surprise that there would be some hint of a light-hearted tone with a little bit of comedy present. However, that's mostly evident within the first four episodes where the Noah's Ark Circus is being introduced and the mystery was being touched upon. \\n\\n\r\nAs the show progresses, the mystery surrounding the Noah's Ark Circus is gradually explored and good GOD does it get morbid. I'm not even joking when I tell you that there's actually a point in the penultimate episodes where there actually was censorship put into effect for a good 20-30 seconds (parts of the screen end up being blacked out). For people who come into Kuroshitsuji expecting some kind of bishie festival full of yaoi subtext and shota undertones full of over-the-top comedy akin to something like say... Ouran HSHC, this will be a MAJOR shock to the system. Whenever Yana Toboso actually gets to work on an arc with a serious story that has the potential to suck you in, she more or less drops most of the bullshit and actually focuses on developing the story with minimal interruptions whatsoever. Speaking of which, there's actually not a lot of shota/yaoi subtext throughout the entirety of the Noah's Ark Circus. I mean... there's bits and pieces of it here and there, but it's a hell of a lot more bearable than that fucking corset scene from Episode 4.\\n\\n\r\nAs for the pacing, the actual mystery surrounding the Noah's Ark Circus is handled quite well, which you might think is rather surprising given that this is a 10-episode season. HOWEVER, the entirety of the Noah's Ark Circus portion of the manga was only 13 chapters long to begin with which means that it's adapted at a ratio of about 1 chapter:1 episode ratio. Keep in mind that's also roughly 468 pages of material to adapt, where each chapter was around 35-40 pages long. I'd say that 10 episodes was enough to work with to give this part of the manga a fair adaptation. It's not a perfect adaptation though, given that the first episode is more or less an introduction to Ciel, Sebas-chan, and everyone else and has next-to-nothing to do with the Noah's Ark Circus until the end of the episode. I still found it pretty entertaining though, although that mostly stems from my fondness of Sebas-chan (and of course, the amazing visuals/OST that A-1 Pictures provides).\\n\\n\r\nMoving over to the character side of things, let's take a look at Ciel and Sebas-chan first. Ciel is for lack of better words, a 13-year-old Bruce Wayne but with an eye patch. The thing is that he suffers from a REALLY traumatic past (which actually DOES get explored in Book of Circus), but it's that traumatic past that causes him to constantly brood and never know when to lighten up... you know, unless he's faking it for the sake of Her Majesty. He will lie and cheat if it means that whatever he's doing for the sake of the Queen will go further which is clearly evident whenever he has to weasel his way out of some less-than-ideal situations. For the most part, Ciel doesn't really change throughout Book of Circus but that's kind of understandable given that he BARELY changed throughout the entirety of the manga (I'm 97 chapters in, and I can safely say that he hasn't had all that much character growth).\\n\\n\r\nNow we get to Sebastian Michaelis, affectionately referred to as \"Sebby\" by the fans and \"Sebas-chan\" or \"Bassy\" by Grell (depends on whether or not you watch sub/dub). He's one hell of a bishie demon butler who made a contract with Ciel to help him exact revenge on those who wronged him in exchange for being able to consume his soul once the deed is done. In all honesty, I love Sebas-chan as a character. In many ways, Ciel and Sebas-chan have a relationship similar to that of Integra and Alucard from Hellsing. At the same time, Sebastian likes to toy around with his master and keep things fresh and entertaining for him.\\n\\n\r\nA lot of people don't like Sebastian because of the fact that he's overpowered, but that's like hating on the Gundam franchise because it involves giant robots. The biggest draw to Sebastian is his personality and his approach to the various situations that he gets put into. The terms of the contract that he has with Ciel are only effective if he's alive... but just barely. Ciel also has to be very careful about what he orders Sebastian to do, otherwise he'll just do whatever and get off on a technicality. So in that sense, it keeps the relationship between the two of them fresh and is just a joy to watch on-screen... whenever there isn't any shota subtext. Much like Ciel, Sebas-chan really doesn't change throughout Book of Circus and that's kind of the way he is throughout the vast majority of the manga. Well, then again this manga's been going on for like eight years via monthly serialisation. It's no surprise that Toboso hasn't quite fleshed out the characters yet.\\n\\n\r\nAs for the new characters introduced in Book of Circus like Joker, Beast, Doll, and Snake... they're all pretty interesting to say the least. With the exception of Joker, Beast, and Doll, the vast majority of the Noah's Ark Circus characters aren't really developed all that much (with the possible exception of Snake, but he shows up later in the manga's run WAY past the end of the Noah's Ark Circus). Well... then again, this is a 10-episode long series that adapts a relatively short part of the manga. I guess it's only natural for character development to not exactly be up-to-snuff. I will say this though: Episodes 7-9 which feature this show's main antagonist will DEFINITELY catch you off-guard. On another note, Episode 8 features the Phantomhive servants kicking ass like they did in the episode \"His Butler, Engaging Servants\" from the first season and I have to say... I NEVER get tired of Mey-Rin without her glasses on. I can't wait to hear Monica Rial voicing her in the English dub. \\n\\n\r\nOn the technical side of things, the art/animation for Book of Circus is absolutely GORGEOUS and is quite possibly some of A-1 Pictures' best work to date. This season alone makes the other two pretty damn hard to watch. I guess it's similar to The Boondocks where the art/animation quality continuously improves throughout each season. I honestly can't wait for the Book of Murder OVAs to come out so that I can see how A-1 Pictures is going to top themselves. What I really love about the art/animation is how A-1 Pictures actually implemented stuff like shading and lighting to quite a realistic degree in a vein similar to Death Note. Now if only A-1 Pictures' adaptations were as good as Madhouse's. Whatever, that's none of my business *drinks a cup of Earl Grey tea* As for the art/animation for the OP and ED, I quite like the OP but the ED felt a bit too... fangirl-pandering for my liking. Whatever, this is Black Butler... fangirl pandering is something that's part of the course and it's something I've made peace with a long time ago.\\n\\n\r\nOn the sound side of things... I REALLY wish that the Book of Circus OST was released by now because there were a LOT of BGM tracks that I happened to pick up on and thoroughly enjoy. Now if only they retained the song \"Si Deus Me Relinquit\" from the first season. Speaking of which, they actually got SID back to do the opening for Book of Circus (these are also the guys that did the first ED and fifth OP of Fullmetal Alchemist: Brotherhood). \"Enamel\" has to be the catchiest OP theme I've heard yet, and this is coming from a guy who couldn't get the fifth OP for Naruto PT1 out of his head for a good six years (and I REALLY wish that was hyperbole). I also quite like the ED track, \"Aoki Tsuki Michite\" by AKIRA... although to be brutally honest, it's the visuals I don't quite care much for and is the main reason why I skipped over the ED altogether. If it were just you know... just a black screen with text in the foreground, I'd stay around and listen to the song because it really is that good. There is no English dub to speak of at the time of writing, but on the subtitled side of things, we've got familiar faces like Maaya Sakamoto and Daisuke Ono voicing Ciel and Sebas-chan respectively. In other words: REALLY good performances from these two. Considering the fact that Funimation licensed Book of Circus for simulcasting, I'm guessing that the dub will be the same as the first two seasons. In other words: Brina Palencia and J. Michael Tatum voicing Ciel and Sebastian with fake British accents. I'm game for that.\\n\\n\r\nWould I say that I enjoyed Book of Circus? Absolutely. This was actually the show that got me to pick up a Kuroshitsuji volume because I couldn't stand waiting for episodes every week while watching the show when it was still airing. If a show manages to get me to read something, it gets a pass from me. As for how much you'd enjoy it? I'd say that you'd probabl enjoy it quite a bit, maybe not as much as I do, but chances are that it'll probably exceed your expectations. Like, if you have some REALLY low expectations for the Kuroshitsuji franchise, I can't think of a better series to watch than Book of Circus. If you had a sour taste in your mouth because of the first two seasons, I heartily recommend watching this one as it will more than likely change your preconceptions about this series.",
            "date": "2014-09-26T23:36:00+00:00",
            "helpful_count": 104,
            "mal_id": 162391,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729535.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phs_togusa",
                "username": "phs_togusa"
            },
            "url": "https://myanimelist.net/reviews.php?id=162391"
        },
        {
            "content": "In the year of 2008, appear an anime that draws all the female audience into the front of the screen. Yes, it's Kuroshitsuji. \r\nThe Book of Circus is a sequel from the middle of the 1st season. \r\nBasically, at the early episode, the story doesn't have an orientation on its way, but after that episode, the story continues with a well-organized plot, it is successfully done well in a short periodic of time (10 episodes), although there are some points that lack in source.\r\nAs for the animation, the Book of Circus have the same animation like the other previous season, the characters have unique designsindeed.\\n\\n\r\nThe opening song really matched with the entire season, as well as the ending song. The seiyuu did a good job in bringing such character to the scene.\\n\\n\r\nBook of Circus have a decent character development, all characters seems to have their own role to play, the only problem is the story is just 10 episodes, is hard to create an excellent and precise development in that short time. So the characters have a development, but not described perfectly within the series.\\n\\n\r\nThe Book of Circus major success is located in the enjoyment of the season. The season practically different from the other season, it fills all the excitement into the screen.\\n\\n\r\nWell, Kuroshitsuji mainly aim to the female audience, SOME male viewers may not found this interesting, it is fully recommended for those who seeks  exciting action movies",
            "date": "2014-10-19T21:41:00+00:00",
            "helpful_count": 66,
            "mal_id": 165397,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=165397"
        },
        {
            "content": "Okay, before I continue with this review. I want to point out two things 1. I didn't read the manga so keep that in mind and 2. I hated the other two seasons of Black Butler, the first one is one of the dullest animes I've ever seen and the less I say about the second one (fans don't even like that, what more do I need to say?) So I was not looking forward to this one, I wanted nothing to do with it. The only reason I did was that a friend of mine told me that he was enjoying it so muchmore than the other ones and the details he gave me, I had a hard time believing so I decided to at least watch the first episode and see how things would turn out\\n\\n\r\nWell, I'll be damned (no pun intended). This actually wasn't half bad, I had alot of fun with this one. I gotta say fangirls, if this is the Sebastian you love from the manga then by all means, have at it. Before I couldn't for the life of me figure out why Sebastian had a huge fanbase outside of his looks (Because it's not like there aren't enough bishies in anime. More than enough if you ask me) all he did in those other ones was smirk alot, be the perfect butler, say \"I'm one hell of butler\" (My god what a stupid joke) and \"yes my lord\" and kiss Ciel's ass and cry like a bitch when Ciel didn't want him anymore in season 2 (GOD THAT WAS FUCKING RETARDED). He was boring and not the least bit intimidating. The Sebastian in this anime is a lying, devious bastard who takes every opportunity he can to fuck with his master. This is a guy who I would buy is actually a demon (if there were any traces of THIS Sebastian from the other two animes, they were way to vague for me to notice) and he's really funny, when Ciel is going to join the circus he says that he can't do any tricks and Sebby says he can do plenty like roll over and play fetch\\n\\n\r\nCiel hasn't changed that much and I still don't like him that much but the cool thing here is that all the other supernatural characters don't treat him like fucking royalty like they pretty much did in the other ones and why should they? Sure he's rich and he's smart for his age but that should be nothing compare to a demon or grim reaper and that's how they treat him, it's a job. I knew I was in for something different when the Under taker dare Ciel to do something without his servant, I was like \"Wait, did a character in this show just imply that Ciel is just a rich little nothing brat without his Butler. Wow! I did not see that coming\" so yeah I still don't like him but they do fuck with him more which is a plus for me and even by the end of the show I grew to respect him a little bit more\\n\\n\r\nI'll bring up one more improvement on the characters and then I'll move on from there and that's the servants. Mey Rin, Finny, Baldroy are all done way better. Before I though they were worthless, they either fucked everything as servants or they did shit that Sebby could easily do. That's not the case here. Through out the show, we don't see them that much and they're just their regular selves but here they're able to build up their badass-ness much properly. They're there to guard the house when Sebastian and Ciel are out of the house. That makes sense because even Sebastian can't be everywhere at once (Which makes the first one even more stupid because why the fuck would you bring those 3 guys on trips? Who the fuck's gonna guard your house?) It's all about how you present something so now I can respect these guys so much more\\n\\n\r\nThat fucking Soma guy is still in here (Seriously, someone kill him. He will not be missed. His girlfriend didn't need to be evil, any reasonable person would leave that dumbass) but thankfully he's not in it that much\\n\\n\r\nAs for everything else. This anime was what I wanted this series to be in the first place, a sorta Sherlock Holmes deal with supernatural elements, that sounds cool but that's not how the first two were like at all, they mostly stand around drinking tea and talked about crap I could care less about. Here, there's this whole mystery about missing children and the circus and all the clues make sense but they don't make it so obvious as to what's going and when the twist as to who is responsible, it makes sense that this person would be behind it unlike Hana from Black Butler 2 (Seriously what the fuck was that)\\n\\n\r\nThe animation is definitely an improvement from before, I mean it's no Bones or Ghibli but it gets the job done. Some times it looks really good and then other times it's stiff but I can forgive decent animation if the art is good and thankfully the artwork has always been in the franchise's favor\\n\\n\r\nThe music also WAY better. I actually remember the music here (no wonder, they got a different composer for this one same as with different director and writer). It has really nice classical music but not just that, they mix it up a bit with music that has a french vibe to it as well as Ireland river dance kinda music (Sorry I don't know the name of these kinds of music but when you listen to the music, you'll know what I mean). The soundtrack actually stands out here. I'm thinking of actually looking up the ost for this show when it comes out (when it comes out). \\n\\n\r\nAlthough there's one thing that ruins the music for me and that's the opening song, not because the song itself is bad (granted I don't like J pop / J rock anyway) but because I hate misused theme songs. You look at animes like Trigun, Ghost In The Shell SAC, Samurai Champloo, Baccano!, they all have theme songs that are not only unique but fit the overall feel of their respected shows and then there are animes like this where instead of using a theme song that matches up with the rest of the music of the show, uses some shitty generic j pop/rock song. It's a total whiplash, may seem like I'm nitpicking but that's really a pet peeve of mine with anime\\n\\n\r\nAll in all, I'm surprised how much I enjoyed this show. That's one of the best things you can say about something that it's surprisingly good and Black Butler: Book Of Circus is from now on my definition of Surprisingly Good. Is it now one of the perfect animes out there like Cowboy Bebop, Monster, LOGH, or Ghost In the Shell. No, not even close. I think it could've wrapped up a little tighter (the show's real ending really is episode 9, episode 10's more of an epilogue) and there still are stupid stuff I could make fun like grim reapers using garden tools as weapons (Seriously, who uses a lawnmower as a weapon?) and like I said the animation's not one of the best but like I said before, this is an example on how to take something I don't like at all and transform it into something I do like. Thanks alot, director of GTO and writer of Planetes\\n\\n\r\nIt's funny, dark, well paced (for the most part) and it's a good mystery that actually makes sense and best of all, there are no scenes of shota boys butt ass naked",
            "date": "2014-09-14T18:10:00+00:00",
            "helpful_count": 49,
            "mal_id": 160351,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/336566.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SolidPayne",
                "username": "SolidPayne"
            },
            "url": "https://myanimelist.net/reviews.php?id=160351"
        },
        {
            "content": "I didn't find this to be one of the \"typical\" Kuroshitsuji stories, the \"Boy with demon hunts down England's bad men in the name of the Queen\" kind of story. \r\nStill, I liked it. Maybe I liked it for that difference, maybe out of nostalgia. Maybe a mix of both. I do love Sebastian, Ciel, the crazy Phantomhive servants, the general wit of Kuroshitsuji, and the darkness around it all, Book of Circus had that, so I found it enjoyable. \r\nAnd yet, this arc had a different feeling to it. All in all, it was such a desolate story. What happens doesn't leave you witha \"serves them right\" or \"yay you go Ciel\" kind of feeling, as some of the other stories might have done. \\n\\n\r\nIt's dark, it's dirty. It's sad, it's unjust. It's human nature.\\n\r\nAnd maybe that's one more point for why I liked it.",
            "date": "2014-09-14T11:37:00+00:00",
            "helpful_count": 22,
            "mal_id": 160299,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459866.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Outori",
                "username": "Outori"
            },
            "url": "https://myanimelist.net/reviews.php?id=160299"
        },
        {
            "content": "as a person who hated the first two seasons of kuroshitsuji you would think i would hate book of circus (especially after that disaster of a second season) but i was happy for 2 reasons. 1 the new director and write of this was faithful to the manga and made it genuinely good; and 2 this has become my trump card to the fan girls of the franchise who would jump down my throat when i said i hated the first two seasons.\r\nStory: the story is that children have been disappearing and it is linked to a circus traveling around so Ciel and Sebastian gounder cover as performs to see the link. as opposed to the first two seasons the story here felt more complete and a genuine mystery throwing in red herrings and a twist that works (unlike seasons 2 twist which was insulting to everyone)\\n\\n\r\ncharacter: for the first two seasons i never saw why girls liked Sebastian he was a boring kiss ass but in book of circus he went from my most overrated to one of my favorites. Sebastian is snarky, he's sneaky, he will use any chance to mess with ciel and twist his words against him and insult him; I LOVE IT! Ciel is honestly more of the same from the first season but here it works because no body treats him like he's special; he get's made fun of more, has to handle things himself and FINALLY admits he's no better then any other human. the circus members feel genuinely like a family which dose make the ending sad. they use William as the reaper instead of Grell which is a good choice because he plays a great rival for Sebastian. finally the servants of the Phantomhive manor actually get there moment to shine and show why there actually there (something they never really did in the first 2 seasons.\\n\\n\r\nSound: the music in this anime is memorable and stands out. it wins be default; since it adds in more style of music besides generic Gothic music and it fits way better in the situation then the other two seasons. \\n\\n\r\nArt: face it whether you like Kuroshitsuji or not the art is good. so naturally this looks great. that being said what kept bugging me was the cgi on the horses or other live beings it feels unnatural; but the designs are still good and stand out.\\n\\n\r\nEnjoyment: again as a man who hated the first two seasons i really enjoyed this as a stand alone anime. it still surprised me that i actually enjoyed it; it dosen't do that yaoi overtones that turned many people away and felt like it's own anime to enjoy.\\n\\n\r\noverall i like this anime; will it be anime of the year sorry but no; but did i like this anime yes. take my words for what you think but i enjoyed it alot and did not regret watching it.",
            "date": "2014-09-12T16:08:00+00:00",
            "helpful_count": 21,
            "mal_id": 160065,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1274351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/maskedknight93",
                "username": "maskedknight93"
            },
            "url": "https://myanimelist.net/reviews.php?id=160065"
        },
        {
            "content": "Kuroshitsuji: Book of Circus is nothing like its prequels. Why so? It takes the brimming potential set by the first season of the franchise and invents an arc. What kind of an arc, you say? Well, come closer, and let me tell you. \r\nCiel Phantomhive, a boy who had undergone all sorts of hell, makes a contract at his desperate moments with a demon. This demons vows to never betray him, to forever stay by his side as he lives, a demon that does his everything bidding to the fullest. A demon: named Sebastian, who shall forever be his loyal butler and carry on hisplan to avenge the ones who done him wrong while serving under the Queen of England- until the moment that goal is achieved, that revenge sated, and his soul... eaten. \\n\\n\r\nBut we already know that. \\n\\n\r\nStory:\\n\r\nThe Queen of England has ordered Ciel Phantomhive to investigate in a case. In this case, children are suddenly mysteriously disappearing every time a certain circus comes by, and Ciel must catch the culprit and bring down justice. That's basically the story. But, wait, isn't there more? Yes, there is. It's basically another plot that technically takes place after the Curry arc back in the first season, but it, once again, is like no other. However, as you watch the first episode, it's nothing but the same thing that basically happened in the first episode of the first season. It's so... simple, awfully bland, not off to a great start. We all know that the formula is going to be along the lines of: Ciel investigates, tells Sebastian to do everything for him, finds culprit, Ciel is about to die, Sebastian saves his butt, \"Yes, my Lord.\", and Sebastian kills everyone. But as we delve deeper into the plot, perhaps this circus isn't so much laughs and fun as it claims to be. And perhaps... things will be different this time. \\n\\n\r\nOh, what am I saying? We all know clowns are scary. \\n\\n\r\nArt: \\n\r\nThe art... it's the same as the previous seasons. It is by all means not bad at all. In fact, I love it. It's beautiful. But, I want to stop here for a moment, and just comment on the opening for a bit. It's... astounding. Amazing. Like I said before, this opening is incomparable to the previous seasons. When you watch this opening, you have this feeling of suspense and it carries the dark tonality that Kuroshitsuji had all along. The animation is extremely fluid, the colors and desaturated and faded, giving off that eerie dissonance, while at the same time, still has that excitement contained within. Oh, what can I say? It's fabulous. \\n\\n\r\nCharacters:\\n\r\nThere isn't much character development. But, does this mean that they aren't interesting to watch? No, not at all. Though Sebastian is still the perfect demon he is, and Ciel the ruthless prickly brat he is, we have to remind ourselves that this is a supernatural show, a show about suspense, AHA! moments, blood, gore, horror. And wow, does this seriously do a good job on those aspects. The horrors Ciel gone through, the horrors the side characters gone through. And speaking of side characters, you do get a new cast of colorful side characters. You have Joker, Beast, Snake, Doll, Dagger. They first appear as quite a mix of rainbows, but not before too long will these rainbows wilt and drop dead to the ground. And you will feel with them, you will cry with them, you will pity them. For this is a story of tragedy. A story of suffering. A truly sadistic story. \\n\\n\r\nSound: \\n\r\nThe soundtrack is pretty nice. Though not too memorable, but the opening, the sound is equivalent in praise as the animation. \\n\\n\r\nEnjoyment: \\n\r\nHow could you not enjoy this beautiful third season of Kuroshitsuji? Simply put, it was an absolute shock to me on how good it was. It takes the brilliant potential the show had all along, expanded upon it, built upon it, explored upon it, made it colorful and brilliant, exactly how the first and second seasons should had been all long. My final verdict: You will watch this. You will like this. The suspense, horror, blood, tragedy, sorrow, pity and fast paced story will keep you interested until the show is over. Don't be fooled by the slightly giddy first episodes. The ending ties everything you've seen into a nice little bow on a nice little Halloween present. \\n\\n\r\nLadies and gentlemen, I bring you Kuroshitsuji: Book of Circus. \\n\\n\r\nHis Butler, recommends thee.",
            "date": "2014-09-11T15:33:00+00:00",
            "helpful_count": 21,
            "mal_id": 159945,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Enharmonic",
                "username": "Enharmonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=159945"
        },
        {
            "content": "Kurushitsuji 3: Book of circus(Black Butler 3) is a continuation of about halfway through the first season of Kurushitsuji. It follows the manga and is a rather important piece in the main character's life(Ciel phantomhive) as it explored and identifies some main points of his past. \r\nThe story, with the exception of the first episode(which is there to reintroduce the characters) is well thought out and since it is directly from the manga, any qualms with the story will come down to weather or not you like the manga or think that that arc was particularly good or bad. The plot is basically this: Atraveling circus, known as Noah's ark circus, comes to London. However, they are notorious for leaving behind missing children in every place they have visited so the Queen tasks Ciel with finding out if there are any truths to the rumors and if so, end the circus once and for all. The plot in general is well done given its series length of ten episodes, which you may or may not like. Objectively, it seems that ten episodes was a bit to short to truly capture everything but from what i have read from the Manga, it was \"word for word\" and therefore, done perfectly. (Though the end will leave you wanting more, and basically leaving you with the statement: \"I feel like there should be more\")\\n\\n\r\nThe art is well, if not slightly better than the first series, and I can't think of a single bad frame. \\n\\n\r\nAs for the sound, the opening and ending really fit the series well, and though I can't say I enjoyed the ending, I actually do like the opening(& have even downloaded the song to my phone). Along with the original OST used for black butler, they have added some new medley, which is good and fits the series well, specifically the times it is used. \\n\\n\r\nThe characters are mostly ok, and we get some great development in Ciel's character. The antagonists of the series are ok as well, and rather interesting as well, given their personalities conflict with their duty; the things they must do. There are a few characters that are not really developed enough, and despite their importance, seem almost disposable. (Though whether this was done on purpose or if it was just like the manga i cannot say). The only qualm I have(If you can call it that) is the misleading opening, which identifies the reapers(along with a new one). Though they are in the series, with Will being the most prominent, their role is rather ambiguous(Specifically will's) and  they don't contribute at all to the series other than for an amusing couple of scenes. \\n\\n\r\nIt all comes down to if you enjoy Black butler(Which I do; & I am a straight male). The series was much better than the second season in story and enjoyment and only falls short of the first(Due to the fact the first season has many arcs and more episodes while book of circus had 10 episodes and 1 arc). \\n\\n\r\nAs a footnote, I understand its appeal and sort of directness at female audiences, but the show, just like all the seasons, have complicated ideals, emotions and some interesting personal philosophies. Of course, the humour and relationships(like the one Grell has for Sebastian) are a bit over the top, I still find it a rather enjoyable series, and found Book of Circus to be a favorite arc of mine. (And if you don't like it, I Imagine there will be many more seasons to come)",
            "date": "2014-12-23T22:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 173959,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=173959"
        },
        {
            "content": "Some Spoilers Ensue...\r\nThis season is hands down THEE best of the show so far. I just loved season one and two, but this one was absolutely gorgeous. It is probably my favorite anime airing this summer. It was engaging, disturbing, emotional, funny, scary, and ultimately heartbreaking. I always know when a show's good because as I reflect back on it, all I can think is how sad I am that it's over and how much I wish I could watch it again not knowing what the outcome would be like.\r\nStory: This season follows the manga almost exactly. It introduces a slew of new characters, allof which are vibrant and exotic. Under the Queen's orders, Ciel is asked to investigate a number of child dissappearances that come about when the Noah's Ark Circus is in town. The first half of the show was entertaining and cool as we were being introduced to everyone. It featured Will the Reaper which was a nice touch (though who wouldn't want more Grell?), and had some great demon/reaper banter. Ciel was out of his element also which was interesting to watch. As we progressed with the story though, things started to take a dark turn, and we were treated to some of the most awesome reveals and twists solidifying this show as one of my favorites.\\n\\n\r\nAnimation: As always, it's devine. The characters are gorgeous and the scenery and colors are beautiful. The horror was well done, and graphic enough for my taste which is cool because a lot of anime I've seen usually cut away or make the blood black...this did not.  The circus itself was also gorgeous and the characters' tricks and traits were visually stunning...especially Sebastian. =)\\n\\n\r\nSound: The voice acting in this show has always been above par. Sebastian and Ciel's voice actors are mesmerizing and portray the emotions of their characters perfectly. All of the new voice actors this season were also brilliant. The OST music as well was just stunning. It was also a nice touch to add the \"Tom the piper's son\" song in giving us this goosebump feeling when Joker sings it. The opening and ending themes were both some of my favorites as well. You can't go wrong with SiD, but the ending theme (and animation) were the spotlight of the themes.\\n\\n\r\nCharacters: As I stated before, we are introduced to a wide variety of new characters in this season. At first, I was kind of upset Grell wasn't in it, but he comes in with a bang at the end...as does The Undertaker (in a breathtaking scene), and the Phantomhive servants. There's a part where Finny goes from cute and loveable, to downright scary in a matter of seconds. The beauty of this season is how much they make you care for these characters before ripping them away from you...somewhere, Yana Toboso is just laughing at us.\\n\\n\r\nOverall, I adored this season. Everything was well thought out and portrayed beautifully on screen and I just don't know what else to say...my favorite show of the summer.\\n\\n\r\n10/10\\n\\n\r\nWatched Subbed.\\n",
            "date": "2014-10-09T01:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 164167,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Animeted_love7",
                "username": "Animeted_love7"
            },
            "url": "https://myanimelist.net/reviews.php?id=164167"
        },
        {
            "content": "Akuma no Shitsuji continues onto the 3rd season with Book of Circus.\r\nThis arc takes place sometime after Madam Red's incident from the first season.\r\nI am left speechless about what to say about this season. All the things that happen in this season is just so fuutsu(normal) that i just can't think of anything unique to write about this. Oh, i just remembered something. Was there so many shotacons(lolicons being 'lolita complex' and shotacon being 'shouta complex', shouta means small boy-the male version of loli) in the 19th Century? Or is this to please the fanbase of shotacons who want to see this or that doneto shoutas? Whether it is fan service or reality, it just doesn't fit well with me. Once you notice this, you can see nothing but shoutacons and old men everywhere.\\n\\n\r\nShotacons will love this season(probably) as it has our Shota shuujinko(protagonist) Ciel Phantomhive who shows of his dizty self in the circus.\\n\\n\r\nIn the previous review of Kuroshitsuji II, i said something like 'this season is a must watch if you want to see the next season'. But, it looks like the Kuroshitsuji II is the end of the Kuroshitsuji series, at least according to the chronological order of the story.(As a side note, i haven't read the manga so i don't know if it ends then or not.)\\n\\n\r\nAs for whether you should watch this season or not, if you liked the first two seasons or if you want to complete the series, i recommend to watch this season but if you haven't watched any season yet, you can skip the series altogether as there is nothing worth mentioning about this series.",
            "date": "2015-11-27T06:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 204269,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4758709.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ryuuForte",
                "username": "ryuuForte"
            },
            "url": "https://myanimelist.net/reviews.php?id=204269"
        },
        {
            "content": "Cold stories always have an indescribable charm.\r\nObjective stories that simply narrate by favoring no one, are considered cold.\r\nStories in which the author does not create inferior supporting characters so that the main will look good are objective.\r\nKuroshitsuji: Book of Circus is a cold story like that...\r\nAnd unlike the Kuroshitsuji and Kuroshitsuji II, it is merciless.\r\nThe usual order for investigation from the Queen of England is the pretext for the story to start, an order addressed to Ciel Phantomhive and consequently to Sebastian-his one hell of a butler-containing directions for infiltrating a traveling circus squad which might be related to some recent children disappearances. In spiteof it beginning smoothly, the plot becomes a little bit heavy towards the end, deluging you with that unaltered sadness that one likes and dislikes at equal amounts.\\n\r\nKuroshitsuji is characterized by a certain charming cruelty you can not attach emotion at. Do not expect to feel the rebellious awe that takes the best of you when the protagonists win a battle at an anime such as One Piece, there will be no such thing, in the end however, you will admit that its different kind of awe is pleasant in its own way. Because amidst all of its ugliness or the ugly truth Book of Circus shows, the fleeting beauty it possesses is a quality one. As opposed to many other anime that force you to feel nice just because then characters are laughing or having fun, that beauty is genuine, letting you choose the full of grace fleeting joy you will eventually feel-along with the bitterness. \\n\\n\r\nThe quantity and art. The fine quality of the ten episodes might make you want more, nevertheless, due to the fact that they cover no more and no less than necessary, you end up satisfied with the ten as they are. Furthermore, in case you enjoy beautiful faces in your anime, Kuroshitsuji will utterly cover you at that part.\\n\\n\r\nDespite the fact that the new story is short it meanders with great detail, rendering it complete and with no vacancies that limited time usually causes. As for the characters, almost everyone is so well elaborated, at a point where nearly none of them feels unnecessary, supplementary or uninteresting, a notion that other anime consume dozens of episodes in order to achieve. More importantly, Book of Circus shows additional elements that any person whom have watched the prequels would want to know. \\n\\n\r\nAs for the direction a cartoon can have-the angle of the supposed camera, the music , the consecution of the scenes-is quite high leveled and in the sense that it won't make you tired.\\n\\n\r\nAfter all, this story is obviously the downfall, the only possible outcome the course of a soul can have when offered to a demon.\\n\r\nKuroshitsuji: Book of Circus is a tragedy, an incredibly alluring and well made tragedy...",
            "date": "2015-07-03T08:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 192151,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3933117.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Megami",
                "username": "_Megami"
            },
            "url": "https://myanimelist.net/reviews.php?id=192151"
        },
        {
            "content": "Book Of Circus is the worst thing put out by Black Butler franchise till now. But still they are pretty much enjoyable in their own way.\r\nStory: The story is quite great but the problem lie with the way it is executed. Story showcasing how poors are led into criminal world can be sensitive and dense. It just need some time to dig it roots into human mind and heart, but unfortunately BOC have tried to build such a huge story into just 10 episodes.As a audience i failed to connect myself with the story in such a less time. Once you are disconnected with storyits not possible to grow emotional attachment to it no matter how emotional the story is. \\n\r\nCharacter: Same problem lie here if you can't connect with story so obviously you won't be able to feel for characters. Introducing so many good characters at once and building just one or two of them is a shame.\\n\r\nEnjoyment: There are only few dull moment in 10 episodes it is thoroughly enjoyable. There is enough dose of funny moments and action scenes (more like brutal one sided massacre) to keep the enjoyment bar full. \\n",
            "date": "2014-09-14T08:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 160271,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3892693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedAmin",
                "username": "AhmedAmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=160271"
        },
        {
            "content": "I just completed this show, and as it happens this is my first review so I'll do my best to convey my experience and objectively evaluate the show. I will also try to not reveal key story elements as people who haven't watched the show might want to look at reviews to get an idea of what they are in for.\r\nWith all that out of the way let's dive in.\r\nStory : This show takes place after the first Kuroshitsuji (and I'm guessing this makes Kuroshitsuji II irelevant ) but not having watched it wont detract much as there is exposition to fill in the blanksfor new viewers , Old viewers are of course in context and can enjoy the triumphant return of the franchise and also know what to expect. Now the story adapts the Circus of Noah Arc from the manga in which Ciel (who is the Queen's \"guard dog\" ) is tasked with solving the mystery of serial children abductions occurring all over England,\\n\r\nthe aforementioned circus being the prime suspect since all of the abductions take place when the circus is in town. From there the story takes the usual approach, Ciel & Sebastian gather intel, identify the target and then proceed to the climactic resolution of the conflict, wrapping everything up (which usually involves their adversaries clashing with the Phantomhive household). Overall the story was enjoyable, it featured most of the things we love about the series and illustrated a rather heavy subject.which I will expand on in the character section \\n\\n\r\nCharacters : the characters in Book Of Circus are intriguing and enjoyable for the most part, in Book of circus all the Human members of the cast become illustrations of human suffering in the forms of corruption , despair and more than anything Damage as almost ALL humans that appear in Book of Circus are damaged to some extent, often in more than one ways. \\n\r\nAll of them are also tragic characters, the circus troupe is comprised of likable (for the most part) characters who began as outcasts, with no family home or money, many of them missing limbs and struggling just to stay alive , however, even with those hardships behind them their new lives are far from peaceful. Then in our main Duo, Sebastian the Demon butler himself and Ciel Phantomhive the young Earl/demon contract holder, as well as his usual entourage make up the \"protagonist\" cast.\\n\r\nWhat surprised me in book of circus is that we get a really good glimpse inside Ciel's psyche and we are reminded that out of all the characters introduced in Kuroshitsuji, Ciel is the most tragic and possibly the most damaged character, his contrast with the rest of the cast and of course with Sebastian's character (who is quite frankly just enjoying himself completely untouched by all the destruction and mayhem occuring everywhere around him) magnifies the impact of that fact. Some of the more quirky and unique recurring characters make a return in Book of circus but their screentime is minimal, overall while the characters are not perfect they are refreshing from what you see in most anime , development is decent for the amount of episodes given and unless you are one of the most elite of elitists you 'll be satisfied. \\n\\n\r\nArt & Music : art maintains this show's beautiful aesthetics and sets the tone perfectly , character designs are elaborate and detailed backgrounds are appropriate and direction is also upper tier , there are some minor bits of censoring but that's to be expected with any televised release , music is also very fitting with the opening theme in particular being one of the best in the series \\n\\n\r\nOverall I give Book Of Circus 7/10 , fans of the series are sure to enjoy it and new viewers can get a good taste of what the Black Butler franchise has to offer",
            "date": "2014-11-02T19:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 167233,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736349.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yagyuu_Mugen",
                "username": "Yagyuu_Mugen"
            },
            "url": "https://myanimelist.net/reviews.php?id=167233"
        },
        {
            "content": "Have always loved Kuroshitsuji, and the number of plot twists in the Book of Circus just seriously flipped me. I couldve never expected these unexpected turn of events, which makes the plot so much more interesting. Alot of thought has been put into each character - you can tell by the backstory and how they each react differently to the same events. Loved this, I can't wait for another to come out (I heard that Book of Murder may by coming out in October).",
            "date": "2014-09-12T06:46:00+00:00",
            "helpful_count": 11,
            "mal_id": 160011,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4006223.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hermainesay",
                "username": "Hermainesay"
            },
            "url": "https://myanimelist.net/reviews.php?id=160011"
        },
        {
            "content": "\"Kuroshitsuji: Book of Circus\" was the perfect sequel to the first.\r\nAs soon as I watched the first episode of \"BoC,\" I knew I was in for an exciting ride. This story was one of the most interesting fantasies I will ever see.\r\nMy adorable and sadistic Ciel is voiced by the talented Sakamoto, Maaya. She's voiced many characters like Crona (Soul Eater) and Kusanagi, Motoko (Ghost in the Shell). Her voices ranges anywhere from a powerful female role to a boyish one. She did not disappoint in \"BoC.\" The flaming (literally) Sebastian was voice by none other than Ono, Daisuke, whose voice should be outlawed. Onovoices characters like Heiwajima, Shizuo (Durarara!!), Smith, Erwin (Attack on Titan), and Midorima, Shintarou (Kuroko no Basket). His voice is silky smooth velvet that soothes the soul and captivates the heart. Yet again, he did a wonderful job at playing the seductive Sebastian. And lastly, I have to give a little shout out to my voice acting god, Kaji Yuki! He played the role of Finnian, and made the cute boy absolutely even more adorable. Although Finnian's a little on the deadly side.\\n\\n\r\nAs I said before, \"BoC\" is the perfect sequel. It continued the creepy aspect of its predecessor, and just had an overall wonderful mood to it. \"BoC\" continues to make English food look appetizing, and is just a well rounded story. I especially enjoyed Sebastian making fun of Ciel in one episode when they went to infiltrate the circus. It was also amusing to learn more about Ciel's past as the series progressed. The music in \"BoC\" is also soothing. It continues the classical theme, and with even capture those who do not enjoy the classical genre much. I can't say I have any dislikes other than the fact that the final episode did not close out anything. It just made me even more confused of what exactly had transpired. But the \"Book of Murder\" movie is coming out, so I'm not too worried.\\n\\n\r\n\"Book of Circus\" is a very confusing, and deep story. It keeps one on edge throughout the whole  watch. It's a good anime for those girls who want to fangirl over the two main characters. Boy might not like it as much, even if it is shounen, but they'll still enjoy it as long as they forgive Sebastian for being too hot for everyone. I very much enjoyed this series, and cannot wait until the movie comes out.\\n\\n\r\n-\\n\\n\r\nStory - 8\\n\r\nIt's very good. A little confusing from time to time, but it continues on its straightforward path. The whole concept is very well thought out, and catches the eye.\\n\\n\r\nArt - 9\\n\r\nI thought the artwork from the first series was very good -- maybe even better that \"Book of Circus'.\" In any case, there wasn't a lot of difference in artwork from the first series to this one. But whatever the matter, the art was simply beautiful and kept the dark undertones of the story. \\n\\n\r\nMusic - 8\\n\r\nThe music will always be my favorite part about this anime. However, sometimes classical music doesn't sit well with a certain audience. But I liked it and that's all that matters, right?\\n\\n\r\nCharacter - 8\\n\r\nThere was lots of character development in this series! I got to learn how much of a sadistic bastard Ciel really is, and became attached to the first string circus members. Sebastian didn't change very much. Though he is a demon and has lived thousands of years...he still thinks the best way to get an answer is through manipulation and sex. Got to see Grell though! His lovely flamboyant self was very much appreciated.\\n\\n\r\nEnjoyment - 10\\n\r\nEach week I would be excited just to sit down and watch \"Book of Circus.\" I very much enjoyed this series, and cannot wait for the \"Book of Murder\" movie to come out.\\n\\n\r\nOverall - 8.6\\n\r\nThis anime turned out to be very good. It did not suddenly become worse just because it's a sequel. I give props for that. I would have liked there to be more explanations for certain events that transpired, but oh well. I am satisfied.",
            "date": "2014-09-21T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 161459,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2733905.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Verria-Nichole",
                "username": "Verria-Nichole"
            },
            "url": "https://myanimelist.net/reviews.php?id=161459"
        },
        {
            "content": "The new Black Butler: Book of Circus is an anime adaptation to Kuroshitsuji: Noah's Ark Circus which left off after the Curry Contest Arc of Season 1 (Episode 15/Chapter 23). For those people who haven't seen Black Butler 2 yet, don't worry: that season isn't canon. For those who've already seen Black Butler 2, totally disregard that season when watching this one to fully enjoy yourself.\r\nThe ending of Black Butler 2 left many unsatisfied; however, Noah's Ark Circus made it up for me. This arc had every characteristic of a typical Black Butler arc: a dark story, psychotic characters, and a mysterious setting. However becauseof its length, this particular arc had much more to offer in terms of character development and story. However, every other aspect such as the art and sound/music stays true to the original series.\\n\\n\r\nStory:\\n\r\nThe plot is everything I expected from Black Butler, but more. Initially, it may seem like any other Black Butler arc where people get killed, kidnapped, tortured, and the perpetrator is at large where it's up to the protagonists, Ciel Phantomhive the Queen's Guard Dog and his demonic butler Sebastian Michaelis, to get to to the bottom of the crime. However, the story is more developed than previous arcs as it is the equivalent of a single season of most anime, about a dozen episodes.\\n\\n\r\nEach arc in Black Butler focuses on a particular character or group of characters. Due to this arc's length compared to some of the original series' arcs such as the Curry Contest arc, the characters' are more well-developed and invested in; therefore, the story is more developed.\\n\\n\r\nCharacters:\\n\r\nThis arc introduces a little more than half a dozen new characters. Due to most of them being circus performers, each is unique in their own way. Everyone has their own gimmick and character traits. For example, as his name implies, Joker is the most cheerful, silly, and charismatic performer among the circus folk. Initially, I was given the impression that each of them were psychos who committed crime for entertainment under the mask of a typical performer. However as the series progresses, the characters are shown to be more human than most antagonists from previous arcs who were either crazy or monsters in nature. This gave me a sense of irony as circus performers are stereotypically portrayed as freaks of nature rather than humans. This ultimately made me more emotionally invested into these characters despite being the antagonists. \\n\\n\r\nAs for recurring characters, let me just say that my perspective of the Phantomhive household and Ciel have changed quite a bit.\\n\\n\r\nArt:\\n\r\nThe art of this installment is no better nor worse than the original series'. Aside from a few differences in color and finishing touches, it is difficult to distinguish this arc's artwork to that of the original seasons. However because of that, I really had a sense of nostalgia when watching. In addition, the overall animation seems up to date, not that it was outdated a few years back. \\n\\n\r\nSound:\\n\r\nRecurring characters retain their previous voice actors, which are perfect anyway. The new characters receive voice actors that fit very well so no complaints at all on the voice department.\\n\\n\r\nThe opening theme Enamel by SID, who also did the previous Black Butler openings, builds up excitement and energy for me, which is a great aspect for opening songs and definitely did not expect less from SID. Coincidentally, the ending theme Akira by Aoki Tsuki Michite calmly concludes each episode with almost a sense of sadness and even a sense of excitement for the next episode.\\n\\n\r\nAs for the music/OST that plays throughout each episode, I honestly don't remember any song that stood out to me. Usually a certain song sticks with me for each anime I've seen, but not this one. However, don't get me wrong. This just shows that the music must've blended in nicely with the atmosphere of the corresponding scene; as a result, I never noticed them. Furthermore, this made me focus more on the scenes rather than the songs. This was also the case in the original series for me. However, it would have been nice to look forward to the release of the OST to download for my favorite song, but alas: no song stood out to me.\\n\\n\r\nEnjoyment: \\n\r\nIt's safe to say my feelings were tampered with a lot in this anime, most notably by the characters and their backgrounds. However, I absolutely love it when an anime makes me bipolar. Emotions. Feelings. Frustration. It's such an experience to have your feelings jump left and right, especially during the last few episodes where the climax is. Although it is not uncommon for an anime to affect my feelings, it is rare for an anime to do it right. This anime definitely delivered.\\n\\n\r\nOverall:\\n\r\nOverall, Black Butler: Book of Circus is undoubtedly one of the best of this season of anime. I would even venture as far as saying it is one of the best this year. Story is familiar yet different. Characters are well-developed and diverse. Art is nostalgia provoking. Sound/Music blended well with the atmosphere and suspense. Enjoyed this anime more than most anime in the past year and that's saying something because there were so many great anime in the past year. Highly recommended for those Black Butler fans out there. Also, the sequel Book of Murder is set to premier next month on October 25; therefore, you shouldn't waste time. Watch Book of Circus now!",
            "date": "2014-09-14T19:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 160357,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3065073.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/broniichan",
                "username": "broniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=160357"
        },
        {
            "content": "*may contain minor spoilers; read at your own risk*\r\nI've finally watched this after putting it off for so long. And before you think I'm some crazed fan girl who's rating way to high, just read. I promise it has nothing to do with Sebaciel.\r\nThe story is pretty basic in itself. Ciel gets a letter from the queen and he's off to obey this, just like a guard dog. And what isn't fun about a circus? Don't worry, they'll only go into town later and kidnap children for some sinister purpose! But what is this purpose? This is where I like Black Butler, it always hasthat nice element of mystery and suspense.\\n\\n\r\nAnd I commend the writers by now following the manga. Because second season was an atrocity of filler and nonsense. If you're thinking of watching it, don't. It's filled with facepalms and a plot that makes zero sense. \\n\\n\r\nDisregarding that, I think I've enjoyed my time with these 10 episodes more than I did with all of season one. I admire how the true nature of humans is exclaimed. \\n\\n\r\n\"Unlike demons, you're base, you harbor a complicated malice, you lie...You struggle desperately, knocking down others on your way...You steal and are stolen from, you make endless excuses...And still you strive to get over the hill far away.\"\\n\\n\r\nThe art for this is very stunning and fluid. The dark tones contrast pleasantly with the sharp and crisp colors. Outfits of the characters is very eye catching and unique as well.\\n\\n\r\nOne outstanding aspect of this season is the sound. Voice acting is on point as always, but that Opening and Ending song. Both are probably one the best of the summer lineup last year. \\n\\n\r\nEven though the main circus cast only had 9 episodes, I feel so impacted by them. They weren't anything special. But they all shared the same past. Human beings being rejected from society because of a physical difference. Then one day they are given a hand of kindness, but to only be stabbed in the back with that same hand holding a knife later in life.\\n\\n\r\nAll they wanted was happiness. For them, for each other. And they had all that taken away from them. They became obsessed with protecting something that wasn't even worth protecting. We are after all, only human. We do what we can to protect what is dear to us. They didn't deserve to have their life torn from their hands.\\n\\n\r\nI'm very happy with this 3rd installment of Black Butler. It tug on my heart strings. I actually cried. The last few minutes of the last episode is so beautiful. \\n\\n\r\nOverall: 9/10  \\n",
            "date": "2015-03-30T11:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 184110,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeZ0id",
                "username": "AnimeZ0id"
            },
            "url": "https://myanimelist.net/reviews.php?id=184110"
        },
        {
            "content": "Kuroshitsuji: Book of Circus is one of the animes that aired last year specifically in fall, after the second season. Now firstly, this is my thoughts on the anime, and this is my first time making a review in written form. So let's start off with it, shall we?\r\nStory: 8/10\r\nPersonally I find this story quite amusing and enjoyable. It kept my first impression of the anime show quite shocked, as the time passed by with the episodes, it kept going deeper into thought about Ciel Phantomhive's relationships with the people of the circus. Since I never have read the manga of its name, I findit very well done by going into detail per events of the show. It's ending was satisfying in the end with the simple thing left in my mind throughout the show's 10th episode.\\n\\n\r\nArt: 9/10\\n\\n\r\nAs a person who watched the Black Butler series, this quality of animation was greatly well done in terms of fluid fights and at the same time with some effects for some comedy of the episodes. The designs as always looks the same but its art shocked me the changes after a time when I watched season 1 and season 2 of the show.\\n\\n\r\nSound: 8/10\\n\\n\r\nNow why did I gave it a 8/10? well Not almost all osts of the show were great, except for a few that I really didn't like that much. As for the Opening and the Ending themes of the show, I actually love them pretty much. The Opening song along with the visuals fits perfectly, and its quite catchy as well for a person that likes beats and a rock type of song. For the ending song it was a piano type of song, but I simply love it because of the sound being played and the person singing it.\\n\\n\r\nNo complaints about the Voice Actors in this show.\\n\\n\r\nCharacters: 8/10\\n\\n\r\nThe reason why I gave the characters an 8/10 is because there are some of the new characters that haven't gotten much of a backstory to know them. But the rest we pretty much got a story related to them which in my personal opinion it makes me understand their lives back and Ciel as well got a lot of development through these 10 episodes.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nI for the most part enjoyed the show. No complains about that. The music along with the things added in this show were well done in my opinion. The only thing I didn't enjoyed was just one scene in the show, it kind of made me feel like what. But the rest of the show, had very good music, very good animation along with the other things included. \\n\\n\r\nOverall Score: 8.6/10 (Rounding it up would be a 9/10)\\n\\n\r\nA great anime and a great ride in my personal opinion of this show. Go ahead everyone and watch it! You won't be disappointed.\\n",
            "date": "2015-05-30T16:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 189203,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855721.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Wasshio",
                "username": "Wasshio"
            },
            "url": "https://myanimelist.net/reviews.php?id=189203"
        },
        {
            "content": "Book of Circus is a great series and is a great addition to the series as well as a good start point to newcomers.\r\nActual Score: 9.4\r\nStory: 10\r\nThe story revolves around a piece of the manga plot missing from the main anime known the circus arc; which is a fun story made up of your favourite characters while also introducing some new ones as well as dark and interesting story as well as circling around some events from Ciel's backstory that add more depth which also helps fit newcomers in understanding the story better as well as serving as a recap for fans already. The storyis well driven and has good pacing even though its only 10 episodes long while also keeping up with an interesting story and the comedy fans know and love.\\n\\n\r\nArt: 9\\n\r\nThe art is outstanding with well detailed characters and amazing set pieces that make the world come alive as well as well done fight scenes that will make your heart pound.\\n\\n\r\nSound: 9\\n\r\nThe opening of the anime is well done and fits the mood of the show with J-Rock band SID that set a dark atmosphere getting you ready for the show; while the ending was also well done it didn't have the same level as impact as the opening which made me neglect it fairly fast. The OST is amazing and helps portray the dark atmosphere the series portrays which is full of orchestral tones and folklore like music that fits nicely with the setting.\\n\\n\r\n Characters: 9\\n\r\nThe characters that you know and love are back as well as some fresh faces that get a decent amount of backstory that opens that character more up as well as getting decent amounts of screen time. The most notable of the new cast was Joker ring leader of the circus who gets good screen time and has a unique personality that is refreshing as well as the other characters of the circus who all have interesting personalities and appearances.   \\n",
            "date": "2014-09-12T12:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 160039,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=160039"
        },
        {
            "content": "I do not read the manga so I was looking forward to this a hell lot, I'm not a big fan of the black butler series, but it is more then worth watching. In the end I was more then satisfied and my immediate reaction was this, 'MOAR!'\r\nThe story follows the manga immediately from where it left off in season 1, after episode 15. This anime can be said to be of 9 episodes rather then 10 as the first is quite similar to season 1 episode 1.It starts of slowly and lightly; there are a lot of funny scenes that are typical of ablack butler series (perfect Sebastian's love for cats, the annoying Elizabeth, and Phantomhive's  trouble making trio..) but towards the ending the series takes on a dark path. It turns rather bloody and gruesome with a load of revelations.\\n\\n\r\nThe character development is different for different people. Some characters are done beautifully while others are just for screen-filling.(That is the right word, right?) When first stringers'' back story were revealed you can not help but feel sorry for all of them.(However I HATED that Lord Kelvin)  \\n\\n\r\nThe art is beautiful. Season 1's art wasn't impressive, season 2's was slightly better. It was elegant- but it was not suitable for a series as dark as black butler. But the art of Book of Circus (obviously)outmatched them both. It was beautiful and it suited Kuroshitsuji. The sound was awesome. I really loved the opening- easily one of my favorites.\\n\\n\r\nOverall I enjoyed this series a lot and I did not reject anything from this anime. A great anime. \\n",
            "date": "2014-09-12T05:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 160001,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3414707.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ironace",
                "username": "ironace"
            },
            "url": "https://myanimelist.net/reviews.php?id=160001"
        }
    ],
    [
        {
            "content": "this was my favorite season of kuroshitsuji though this season only had 10 episodes it didnt have really any filler episodes like last 2. the art in this anime was vibrant (what you would expect from a circus) the characters clothes and make-up were beautiful. the opening song is amazing. there were a lot of  characters crammed into 10 episodes so there wasnt room for development however there were tiny bits given about each characters past which was enough for me. the ending was a good one but left me on a cliffhanger because i wish they got more into the characters.  thisis a quick 10 episodes that were very enjoying.",
            "date": "2014-11-15T14:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 168703,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4254795.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lazyneko",
                "username": "lazyneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=168703"
        },
        {
            "content": "black butler is an anime for preteens trying to be edgy and dark. It ties to bands, \"rawr means i love you in dinosaur\", pastel hair, and piercings.\r\nDont deny it. I know you picked up this anime when you were like twelve or thirteen and immediately fell in love with either sebastian, claude, grell, or alois (no one ever falls for ciel and he's literally the protagonist of all three seasons, give my man his credit) You're nodding your head aren't you. Fast forward to the future, and you see that Book of Circus has been released, and it's \"Oh for old times' sakes, butI'm not really into this sort of thing anymore.\"\\n\\n\r\nOkay this might not apply to you, but this applied to me. This is exactly how it went down for me. I started this anime thinking that I'm going to get in touch with my middle school self, and bam. I am in love with kuroshitsuji again.  to be honest, I was a little embarrassed that I actually really liked it, because I have far moved on from my black butler t-shirts and anime fan account on instagram. (I even had a fan art of sebastian and ciel as my lock screen at one point and there were nipple clamps involved.) I would like to think I've grown from that. \\n\\n\r\nBut then I realized that this anime is fricking good, and nothing will change that, not even the memories of my cringey twelve year old self.\\n\\n\r\nLet's start off with the characters.\\n\r\nBOMB. kuroshitsuji never fails to create visually pleasing characters. true visuals. Even the creepy ones are aesthetically pleasing to the eyes. Not only that, each character is unique. They're all dark because, well, it's kuroshitsuji, what did you expect? But they were all different, quirky, and interesting to watch. You got the OG ciel, sebastian, grell, william, etc. but you also got the new ones like Doll, Snake, etc. Kuroshitsuji characters never fail to disappoint.\\n\\n\r\ntwo words. OPENING SONG.\\n\r\nI never review the opening songs of anime because it's completely irrelevant, but you are lyiiinng if you say the kuroshitsuji openings are irrelevant. I never skip them, and I'm pretty sure they're downloaded somewhere.\\n\\n\r\nPlot.\\n\r\nGOOd. 10/10 Amazing. Same ol' dark mystery sherlock holmes theme stuff. It's the same theme, but it's different from the other seasons. don't worry. good sht. i don't know what to put here without spoiling it. it's just good okay, take it from me, along with all the kuroshitsuji trash in the reviews section\\n\\n\r\nGuys. I feel like because of kuroshitsuji, i am never going to grow out of my middle school weaboo phase. Because I'm actually waiting for a new release or a new season, but seeing how it took 3-4 years, I'm going to be a functioning adult when it comes out. How the heck am I suppose to be a respected member in society when I'm still thirsting after the same old 5475973 year old demons i was thirsting after in middle school. rip. \\n\\n\r\nthis is how good the show is. The fact that it turned me all weaboo again is valid evidence.",
            "date": "2016-07-26T00:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 225020,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5295911.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lehoobae",
                "username": "lehoobae"
            },
            "url": "https://myanimelist.net/reviews.php?id=225020"
        },
        {
            "content": "From the beginning: The name of the circus. (I may be plotting, but I thought it might be a reference).\r\n\"Noah's ark was able to carry much load and served to save Noah's family.\" The circus is a way to keep all the main characters together. It is like a boat, that there is capacity for much cargo. There is a place for everyone who wants to enter, as in this case, Sebastian and Ciel, who enter the circus through information.\r\nThis bow is one of the best in my opinion. (Actually, I love the circus theme in movies and animations, from the general). Something remarkable isthat whenever an anime / movie tackles this theme, or the story is sad, or it's scary. In children's tales, there may be a happy ending. Perhaps.\\n\\n\r\nTaking advantage of what I mentioned about children's tales, there is a popular tale called \"The Pied Piper of Hamelin\" which tells the story of a man who hypnotized rats with his flute. And after not paying this man, to end the infestation of rats, he left the city, returned and began to attract children with the sound of his flute. This tale also appears in Bishoujo Senshi Sailor Moon R: The Movie. Where the flautist hypnotize the children. Likewise, it happens in Book of Circus. The circus hypnotized the children by taking them. And in their dreams, they seemed to be in a beautiful and wonderful place.\\n\\n\r\nSoon, the anime has a great story, despite a sad ending.\\n\r\nThe circus contains very cool and captivating characters (if that's how I can describe it), the whole character is cool and has an interesting ability (common circus). But of course, the character who has more prominence, the Joker! I particularly love this character.\\n\\n\r\nThe design in the characters is also great. The costumes are pretty cool. (Expected from Kuroshitsuji, usually the characters have a cool design and are very cute). The expected of Yana Toboso, I say.\\n\\n\r\nThe soundtrack is divine. Besides the OST, the opening and ending are very special. Something that Kuroshitsuji also works very well, which is the audiovisual part. There are always bands or singers of influence, which makes it even better. The cool thing is that the opening and the mv coincide with each other, because mv is as macabre as the circus.\\n\\n\r\nAnd now about the end ... A sad ending, unfortunately. I clung to the characters in the circus, even though some of them, no matter how cool, were just that. It's very sad when you discover their story. In the end, they only wanted to pay for what they had done, for they were grateful to give them life again, even if it was not their liking to do what they did. (The abduction of children, I say). I hoped the characters would live to the end. And after Book of Circus, my love for Ciel was never the same.\\n\\n\r\nWatching Kuroshitsuji Season 1: Ah, I love Ciel.\\n\r\nWatching Kuroshitsuji: Book of Circus: CIEL, I HATE YOU.\\n\\n\r\nTo conclude, I think this bow was great in 10 episodes! Certainly one of my favorites.\\n",
            "date": "2017-06-20T18:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 250497,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5205607.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MayumiMay_",
                "username": "MayumiMay_"
            },
            "url": "https://myanimelist.net/reviews.php?id=250497"
        },
        {
            "content": "[STORY: 8/10]\r\nIf this had not been made, this franchise would lose all its appeal. Luckily, we were given \"Kuroshitsuji: Book of Circus\" instead of another monstrosity such as \"Kuroshitsuji II\". A much more intriguing and enjoyable story is presented and it completely follows the manga, which definitely shows when you compare the quality of the first two shows of this series with this one.\r\n[ART: 8/10]\r\nThe art is upgraded and they waste none of it on useless fan-fictionesque scenes like \"Kuroshitsuji II\" did. The animation is great and the character designs are phenomenal when compared to previous efforts.\r\n[SOUND: 8/10]\r\nThe sound is definitely upgraded as well inthis installment. Voice actors actually care, sound effects are fitting, and the music is the best its ever been.\\n\\n\r\n[CHARACTER: 8/10]\\n\r\nThe development between the two main characters that was absent through most of the animated version of this story is back. Such a unique dynamic isn't wasted this time around and it is thoroughly enjoyable to see the events of the show play out and effect them. Other characters aren't just there to be filler too, which is definitely a plus.\\n\\n\r\n[ENJOYMENT/OVERALL: 8/10]\\n\r\n\"Kuroshitsuji: Book of Circus\" is the best iteration of the manga out of the three full-length shows available currently. Everything from the previous two is improved, whether it be the great artwork, actually pleasant audio, thoroughly engaging story, or actual character development. This is the only show from this franchise I can recommend wholeheartedly.",
            "date": "2018-05-01T18:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 279533,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6971623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/godofmankind",
                "username": "godofmankind"
            },
            "url": "https://myanimelist.net/reviews.php?id=279533"
        },
        {
            "content": "Warning: There will be a few spoilers here and there so beware.\r\nUghhhh. I literally just watched one of the most disappointing sequels anime has to offer. What sequel? Black Butler's second season. It is nothing but a fanfic turned into an anime filled with nothing but pointless fanservice. Not the worst but it's still a huge disappointment in such a beloved series like Black Butler. \r\nAnd then, in the Summer of 2014, a saving grace appeared in the anime franchise known as Black Butler: Book of Circus. The season is indeed the season 2 we deserved from Black Butler since unlike the last, was basedon an arc in the manga. And boy, it is one of the best anime sequels ever. No screw that, one of the only few sequels that is way better than the original. \\n\\n\r\nSTORY: 10/10\\n\r\nThe Noah's Arc Circus troupe has captured audiences with their dazzling performances. However, children have mysteriously gone missing around London, correlating to that of the groups' movements. Ciel Phantomhive, and his ever-faithful demon butler, Sebastian Michaelis on a new mission to find these missing children. As well as joining the circus too for an undercover. \\n\r\nThe story at first is pretty basic. People go missing and it's up to Ciel and Sebby to find them and save the day! However, it feels fresh and new as it has a lot of twists and turns throughout the whole season. It also has a good focus on the circus people which has a lot of feels when their relationship with one another shows up.  As for the ending, unlike the last season, it was somewhat bittersweet, yet it was still perfect. But we all know this isn't the end of Black Butler. By the time I'm writing this, Ciel and Sebby's adventures in the manga are far from over. Not to mention the anime itself had some followups with Book of Murder and Book of Atlantic. Anyways, the story of Book of Circus is pretty unpredictable which is good.\\n\\n\r\nCHARACTERS: 10/10\\n\r\nLet's start off with the returning characters like the main duo Ciel and Sebastian. They are back once again, but this time in a better story! They are still as good as they were. The same thing goes to the other characters like the servants, the Grim Reapers, the Indians and Ciel's other friends. Sadly, much like the last season, they have very little screen time. However, I have to add something for the servants during the last few episodes of the season. Without spoiling any details, let me just say that they go full on badass making you love them more.\\n\r\nFinally, we have the circus guys. Let me just say that they are way better than Mr Trancy and his gang. They are different in terms of looks, quirks and personality. As well as having a traumatic past that made them want to join the circus. They also have a strong bond with one another making them feel like one big family. Pretty nice of them. And then there's the villain. He may have little to no screen time, but he is the creepiest thing you can ever imagine. The new characters are quite good and some even have their times to shine. \\n\\n\r\nANIMATION: 9/10\\n\r\nBook of Circus, much like the first two seasons, is produced by A-1 Pictures. There isn't a lot to say about the animation. But I will say that after a 4-year gap between this and the last season, the animation has changed and advanced drastically. One notable example is Ciel's hair which turned lighter from the first two seasons in which he had just a dark shade of black like Sebby's. This season's animation may have had a huge improvement from the first two, but they still can't get away with crappy CGI carriages.\\n\\n\r\nSOUND: 8/10\\n\r\nOne thing I like about Black Butler's music is the fact that has a huge range of music styles between classical and jazz. It matches the show perfectly. And they still continue with that with Book of Circus. As for the opening Enamel by SID is amazingly catchy. Much like the first season's Monochrome no Kiss, it matches Black Butler's theme. The ending however, despite sounding nice doesn't really catch the viewer and say 'wow, this song's good!' And sadly Kalafina didn't return because damn I loved their songs from the first two seasons.\\n\\n\r\nDUB: 9/10\\n\r\nAnother plus is that there were no dub replacements! Woohoo! J Michael Tatum and Brina Palencia are once again back to play our favorite butler and boy duo! Same goes to the others despite some of them sounding cringey as in always.\\n\r\nSince this show is newer you'll expect a lot of newer actors voicing the new characters. The circus people on the other hand is full of talents new and old (the old ones are quite surprising once you take a look at the dub cast). Two people I have to give credit is for Matt Mercer (Joker) and Tia Ballard (Beast). When I first heard these two, I completely didn't know that is was them since Matt is known for deep voices (like Levi) and Tia is known for moe voices (like Happy the Cat). And then they completely go opposite their voice types as Joker and Beast is pretty surprising. And they do it perfectly. \\n\\n\r\nOVERALL: 10/10\\n\r\nIf you want more Ciel and Sebastian in anime, then I suggest you go watch Book of Circus! Heck you can even watch this without watching the first season. But I think you should go read the manga first though. With a twisted story full of amazing characters, Black Butler: Book of Circus is one of the best anime sequels to ever be known.\\n\\n\r\nPROS:\\n\r\n+ A huge improvement from the first two series (especially the last one)\\n\r\n+ An unpredictably twisted story\\n\r\n+ Amazing characters old and new\\n\r\n+ Improved art style\\n\r\n+ Music and dub is still as good as always\\n\\n\r\nCONS: \\n\r\n- Some new characters may have little to no screen time\\n\r\n- THEY STILL HAVE THOSE CGI CARRIAGES!\\n\\n\r\nStory: 10/10\\n\r\nCharacter: 10/10\\n\r\nAnimation: 9/10\\n\r\nSound: 8/10\\n\r\nEnjoyment: 10/10\\n\r\nOverall: 10/10\\n\\n\r\nWell this is simply one hell of a story. I am now done reviewing the Black Butler series.",
            "date": "2018-02-24T16:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 272374,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6857092.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheKawaiiToon",
                "username": "TheKawaiiToon"
            },
            "url": "https://myanimelist.net/reviews.php?id=272374"
        },
        {
            "content": "*SPOILER* (the only way to review this anime is talking about the end)\r\nSuch a good start and such a bad ending with ridicolous plot twist for fandom, ciel and sebastian trying to be as badass as incoherent. They created such good characters and interesting villain. Just to let you know the incoherence of the final plot twist, in the ep8 ciel will save one the stolen boys and then in the ep12 he will tell sebastian they where sacrificable cause they lost their mind. THEN WHY SAVE THE FIRST GUY.\r\nIm not contesting the violence, im contesting the reason of this violence. Ciel went so farthat actually disobeyed queen orders which is not credible. (what's the reason?? he was too weak? pff)\\n\r\nSebastian ,the same demon that left ciel in the first season cause of the incoherence and weakness, in the final plot-twist had a slack-jawed look .......\\n\r\nOverall a good anime start ruined by the ending trying to be alternative (and failing)\\n\r\nImho this ending has the same problem of Kuroshitsuji season 2, its written by fandom for fandom\\n\\n\r\nRECAP: Ciel will justify what he has done with the best excuse ever \"im a human\"\\n\r\nWow...this...script... =..=",
            "date": "2016-11-15T04:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 233785,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5641973.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/anemonespotte",
                "username": "anemonespotte"
            },
            "url": "https://myanimelist.net/reviews.php?id=233785"
        },
        {
            "content": "Hi again! \r\nSo, watching this season was a really pleasurable experience. \r\nStory (10) \r\nThis one has a very good thing that the previous seasons didn't have. It's canon, it was manga based. So I feel I can take it seriously. \r\nI mean, I liked the ending of the first season, I enjoyed the second season but I put that things in my hands and I think... \"where I put this in the storyline?\" because I know that the manga will lead in a different way. \r\nSo I kinda see the endings of the two seasons like alternative endings.\r\nI don't know if I already said itbut I would have prefered that the second season would just focus on Alois and Claude without putting Sebastian and amnesic Ciel on the middle too. It left things kinda messy. \\n\r\nBut back to this season: I really liked the concept and development of things. It felt more organized overall. It has mistery, has some lines to think deeply about, and actually I don't see any problem with the story to point out, really. \\n\\n\r\nArt (10)\\n\\n\r\nIt's absolutely gorgeous. It's different from the other seasons and it's not in a bad way. What got my eye first in the anime (first season) was the visuals. The art caught my eye, I read the resume, started watching, fell in love. Simple as that. And the art is still one of my major pleasures in this anime. \\n\\n\r\nSound (9,5)  \\n\\n\r\nBadass opening song and beautiful ending song? Checked \\n\r\nGood voice actors? Checked\\n\r\nCool soundtrack in general? Checked \\n\r\nYeah, it was very good!\\n\\n\r\nCharacter (8): \\n\\n\r\nOh, here I can point out a few things. \\n\r\nI really like how imperfect the characters of this anime are, I probably already said it.\\n\r\nThe old characters keep being awesome and I really grow to like some of the new ones. \\n\r\nBut there are some of the characters in the circus that didn't have their \"time of show\". I mean... what we know about Peter and Wendy for example?\\n\r\nI understand it's difficult to develop so many characters in 10 episodes, however. \\n\\n\r\nEnjoyment (10)\\n\\n\r\nOverall: 9,5 \\n",
            "date": "2017-09-09T09:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 257164,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5181252.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AppleIceCream",
                "username": "AppleIceCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=257164"
        },
        {
            "content": "Kuroshitsuji has always been a series that I can enjoy - both the manga and the show. The first two seasons were hit or miss, with the first being a lot better than the second. The first was at least decently related to the original story, except for the end (which wasn't bad, but it was definitely wasn't the greatest). \r\nAnyways, this season is very close to the arc in the manga. I did not notice too much deviation, and I believe the sub and the dub were very good. The art is the same, with the animation being a bit better. \r\nThe story stillimpacted me emotionally, the same way the manga did, and I think the producers did well in not trying to deviate this time. Also, when you're done with this one, watch Book of Murder next. It shows the events right after this series and also follows the manga almost perfectly.\\n\\n\r\nAll in all, very good.",
            "date": "2016-04-27T10:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 217291,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5295862.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zeppekihana",
                "username": "zeppekihana"
            },
            "url": "https://myanimelist.net/reviews.php?id=217291"
        },
        {
            "content": "******this is a spoiler free******\r\nYo! Lets be honest this season is really good compared to previous .\r\n And to make things clear i've watched previous seasons. \r\nStory: 8/10\r\nThe story is really interesting unlike this other seasons. Why do i say so? Firstly in previous seasons, the plots are very boring and to be truth didn't really like it  and i really don't know why i even watched 2 of them LOL . However when i knew that there was a season 3 i thought that it would be boring as well . HAHAHA i was WRONG . To find out why seriously just watchit don't worry it won't disappoint you especially if you're like me who find previous seasons boring. \\n\\n\r\nArt: 7/10\\n\r\nWell i could say that the art was normal nothing was bad as far as i could remember.\\n\\n\r\nSound: 6/10 \\n\r\nSame goes for sound nothing was good it was fine for me . But for me i don't really care about sound since i care about plot and characters more XD.\\n\\n\r\nCharacters: 8/10\\n\r\nHahahaha this time round there was more fan-service XD . Go watch it . Ciel did not really change much same goes for Sebastian in my opinion . Ciel is still as badass as ever . However previously i did not find Sebastian really attractive but after i watch this i thought im gonna noesbleed =D \\n\\n\r\nEnjoyment:7/10\\n\r\nI bet you guys can understand how much i prefer this season than previous seasons. One of the reason why i enjoyed this is because there are REALLY a lot of new things being introduced and i felt that this season is breaking through barriers that's why it is interesting :) \\n\\n\r\nOverall:7/10 \\n\r\nAlot of enjoyment , fan-service and new things this season so go ahead and watch this and change your mind that it is boring if you think like me . \\n\\n\r\nRecommended if you were disappointed like me about previous seasons . Believe me and watch this seriously . \\n",
            "date": "2014-09-26T04:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 162275,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=162275"
        },
        {
            "content": "I have read the manga till the latest chapter. Tbh, I don't really remember much about this Arc in the manga, since it was 4 years ago. When I heard about this anime is being released, my reaction is probably like other manga fans: \"Wow, I'm glad. But I'm scared\". Yes, I was afraid that the legendary A-1 Studio would ruin this series again with their \"impressive endings and plot\" (I'm looking at you, season 2). However, until this point, I have nothing to complain about it anymore. They are faithful to manga. You don't know how happy I am with this. \r\nTo old fans,there is nothing confusing about the plot. To new viewers, I don't think it's so complex that they can't handle. The studio purposed to remind everyone with previous events as a form of Sebastian's introduction or Ciel's dreams, although it's annoying to me sometimes, but I think it's necessary to catch new comers. The first episode is a usual story about daily live of our Earl and his servants. Nothing great to mention about that episode because it's kind of a filler, but it's entertaining enough to sit down and watch and enjoy Sebatian's perfection (lol). First 4 episodes are light and warm with full of comedies when Ciel and Sebastian disguise to join the circus in order to investigate. But in those comedies there are still dark moments and somewhat insane (the kidnapping scene). Then they strike you with a sudden not-expected ep 6 (you will know what I mean) and the cruelty, dark theme starts in ep 7. Ep 7 is like a turning point to its climax. \\n\\n\r\nThe animation is great and beyond other seasons so far. Ciel and Sebastian look more like in the manga. The circus scene is great, and the CG they used for that champagne scene is gorgeous! Sadly, the animation drops rapidly, from repeating the tiger's scene, to the point of episode 7. Watching Episode 7 is enough to hurt my eyes, and that is an important ep! You don't need good eyes to catch those clumsy drawing for the children in the eating scene, or the thumbnails of Ciel, Joker, and Sebastian when they are pointing gun and daggers at each other. Ep 8 returns to somewhat good animation. Hopefully they will have enough budget for the last 2 episodes and make it become memorable. I love the last chapter of this Arc in manga so wait for it. It will be even more painful with the voice acting.\\n\\n\r\nThe music is good. I love the Opening and Ending. Opening is still by SID and it's so fit with the theme, when the Ending is somewhat sad and irony (the moral behind the Ending is great, also the way it's portrayed). The Opening, when I first watched it, I was like \"it looks more like a puppet show than a circus. And yes, it's indeed a puppet show \"inside\" a circus, as these members are manipulated by \"Father\". The OST is still a little like the 2 first 2 seasons, with full of creepiness and Latin language songs (?). Although I love it and it fits so well with the story, the variety of song choices are not much and it's kind of boring. They should have some battle intense song when there are...well, battles, instead of the Latin songs.\\n\\n\r\nOverall, I like this show. There are fillers, but they are acceptable. The symbolic is great in this Arc that can make you think. We also know more about 2 Main characters and how much Ciel had gone through. So I insist people to try this out if you like a story that is funny, but dark and has philosophy at the same time. (Also handsome characters, lol)",
            "date": "2015-04-20T20:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 186122,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320833.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/glaceon_cute",
                "username": "glaceon_cute"
            },
            "url": "https://myanimelist.net/reviews.php?id=186122"
        },
        {
            "content": "I read the manga's arc of this story before this anime aired, so I'll try by best to grade the anime without making many comparisons. The art wasn't that great, and the actions scenes I looked forward to didn't exactly hit my expectations, but it was alright. I loved both the OP and the ED, especially the latter, but there was one specific track that played during the show's action scenes I couldn't stand. The characters are pretty good for what they have in a 10-episode anime, but I wish they were more explored so I could sympathize with themmore. The story was boring at first, but it got better near the end, and that's all that counts. Overall, if you'd like to watch this anime, I'd tell you to watch it, but I wouldn't immediately call upon it if someone asked for a recommendation. \\n\r\n:P",
            "date": "2014-09-20T15:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 161233,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863977.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/notactive2000000",
                "username": "notactive2000000"
            },
            "url": "https://myanimelist.net/reviews.php?id=161233"
        },
        {
            "content": "I've loved Kuroshitsuji since the beginning, though the second season left me more than a little confused, considering it went trailing off on it's own storyline rather than sticking with the manga.  However, Kuroshitsuji: Book of Circus has come back on track with the manga including my all-time favorite ark.  The art is beautiful and more crisp than season one.  The characters are utter perfection and I found myself falling in love with Kuroshitsuji all over again.\r\nI'm a fan of dark fantasy, which is why Kuroshitsuji is one of my favorites.  Sebastian and Ceil are tied together by a dark anddisturbing fate, a key factor in this ark.  The anime did an amazing job in giving the facts of Ceil's past, but also cluing in viewers who are unfamiliar with the initial story.\\n\\n\r\nOverall, this Circus ark was moving and disturbingly beautiful.  The characters are well-rounded and complex, the art is gorgeous, and you get to experience the classic Kuroshitsuji fun.  I definitely recommend this to anyone, Kuroshitsuji fan or not.",
            "date": "2015-10-07T17:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 200727,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4820667.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/alyhing",
                "username": "alyhing"
            },
            "url": "https://myanimelist.net/reviews.php?id=200727"
        },
        {
            "content": "'' ... over the hills and far away ... ''\r\nAfter the (non-canon) second season of Kuroshitsuji , the famous anime which portays the story of a demon butler and his master returns to the manga canon with Book of Circus , the season that I consider as the best one in the series so far.\r\n We begin with the story (10/10) . Book of Circus adapts the fan-favourite Noah's Ark Circus arc from the manga. Once again , there are no fillers due to the limited number of episodes , except maybe the first one , which serves as a re-introduction to the charactersfrom the fist season. After this , we immediately dive into the new mission of Ciel and Sebastian , who undercover infiltrate the Noah's Ark Circus , in order to find out the truth behind the serial children disappearances. It's a well-written story , with very good pacing and nice plot twists. I especially liked that they finally deal with one of the most interesting parts of Kuroshitsuji's story for me , the murder of Ciel's parents and what happened to Ciel after that. The whole season's story was well adapted from the manga and leads to a shocking ending , which is one of the reasons that I like more this series than other Black Butler seasons. \\n\r\n Next , we have the beautiful art (10/10) , which returns from the previous seasons refreshed with more modern animation , notably in the case of the main characters. The Victorian background is amazing as always.\\n\r\n About the sound (10/10) , once again the voice actors have done a great job. Both the old ones , like Maaya Sakamoto as Ciel and Daisuke Ono as Sebastian , and the newcomers like Mamoru Miyano as Joker. Also , we have a great new OST , where some of the most notable tracks are the homonym with the title , Book of Circus, and with the wind. As for the opening , SID comes back after the first season with another epic song (Enamel) , which has a very good editing to intrigue the viewers. The ending song (Aoki Tsuki Michite by AKIRA) is also majestic. It's better than the endings of season 2 and it can only compare with Kalafina's Lacrimosa from season 1.\\n\r\n Now , about the characters (10/10). Many of them return from the first series , like Lau and Underaker , and of course the main duet. We have finally an evolution to Sebastian's character as we see him to act more like the demon he is. He is more seductive and he tries to take what he want by any means , while we get that he protects Ciel not so much because he cares about him but more because he doesn't want to lose his prey. It's a nice diferrence from how Sebastian was in season 2.  Also , Ciel's character takes much development as we see him in a weak state , tormented by the revival of his parent's death , one of his most horrible nightmares. He is a child who needs protection , but in the same time he has to protect his role as the Queen's watchdog , so he has to be tough.  In this arc we really see why Ciel is really the best character in Kuroshitsuji. There are many new characters too , like Joker , Beast and Doll , who are so much interesting. \\n\r\n Overall , it is  a very funny series to watch , with a serious and a very dark side. As I have said before , it's the best Kuroshitsuji series so far. Maybe the first two seasons isn't for everyone , but with Book of Circus and it's sequel (Book of Murder) Kuroshitsuji becomes a really good anime that anyone (even if he isn't a Kuroshitsuji fan) can enjoy !!\\n\\n\\n\\n\\n\\n",
            "date": "2015-11-07T04:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 202854,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4810707.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AtticusIzayoi",
                "username": "AtticusIzayoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=202854"
        },
        {
            "content": "Well, this was definitely the best season thus far. Probably because the entire season was in the actual manga. Good for season three for sticking to the source material. \r\nFinally seeing Ciel's past was refreshing, especially since it paved the way for brilliant character development. Additionally, the circus troupe's characters were a delightful addition to this season, as opposed to last season where the added characters were dull (for the most part). Overall, the depth that was seen in all of the characters this season was awesome. \r\nThe only nitpick I have with season three is that we didn't see much between Sebastian and Ciel.They were essentially separated the entire time, which I suppose was the point of this season (i.e. Ciel forging his own path), but it was still sad. Also, it seemed like the appearance of new characters like Joker and Beast took away from some of the fan favorites like Grell and the Phantomhive servants. \\n\\n\r\nWhat I'm most excited for going forward is watching Ciel grow as a character and also learning more about his past. I'm not entirely sure if a fourth season has been green-lighted yet, but if it has, it will definitely be on my to-watch list. As long as there's no more filler arcs.",
            "date": "2018-07-01T21:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 282747,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=282747"
        },
        {
            "content": "This is probably my favorite season out of all the seasons of Black Butler (current to date: Book of Atlantic) and its pretty straightforward why. I'll probably just go down the line of all the requirements though. \r\nStory: Its nothing special really; Ciel and Sebastian have a problem from the Queen and they're supposed to stop it. No ifs ands or buts. I've seen many people complain that the story is incoherent from the second (which we don't talk about) and the first season, but its not really hard to put together. There are many guidelines on many websites that say after the Curry arcin the first season, STOP and then go watch Book of Circus. That's how the manga goes. \\n\\n\r\nIt follows the manga almost to an exact T (which is good because this is also one of my favorite manga arcs) with a few unimportant things missing here and there. The plot to it is good and it still very important and enjoyable. There's many things that are vague, but the further you go on into Black Butler is the more you understand what you missed from this arc. Reading the manga, everything from flashbacks to certain wording the characters use are important. \\n\\n\r\nArt: Very colorful. I don't know if different people worked on the art or if it was just the change with the times, but the art is very polished throughout all 12 episodes. \\n\\n\r\nSound: Both sub and dub are good (sounding exactly like the first and second season for both). The same voice actors and even the same band does the opening like the ones before it. There's nothing much to praise and there's nothing much to critique. The opening and the ending songs are very good.\\n\\n\r\nCharacters: Its Ciel and Sebastian. If you liked them before you'll like them now because frankly, they don't really change. The Noah's Arc Circus crew are very enjoyable from the beginning to the end. The only thing that deserves a lot of praise is the fact that the servants in the Phantomhive household get backstory and more time to show who they really are (we saw a little in season one, but that hardly counts compared to this). It happens in the anime enough for you to not question it, but I completely understand why they didn't add those parts because they were long chapters on their own. Either way it was very nice to see them more than the bumbling idiots they were in the first (and even the second) season. \\n\\n\r\nOverall Enjoyment: Like stated before, this is one of my favorite arcs in the manga, and it was very nice to see it adapted amazingly and not butchered. The only thing that stops me from giving it a 10 is the fact that neither the anime nor the manga are finished yet. Depending on the ending is if I'll bump this up or down, and the manga is nowhere near finished either. \\n\\n\r\nTruly, if you like Black Butler, then you're going to enjoy this season. Its nice to see one of my favorite mangas get the Fullmetal Alchemist treatment and it being done well. Remember to watch the first season to whatever episode the Curry Bun arc ends, and then go to Book of Circus.",
            "date": "2018-05-10T02:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 280187,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4597802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Unicorn819",
                "username": "Unicorn819"
            },
            "url": "https://myanimelist.net/reviews.php?id=280187"
        },
        {
            "content": "DISCLAIMER: This review contains minor plot spoilers, discretion is advised. They will not ruin the anime, but they may spoil or hint at a plot twist.\r\nBook of Circus was really good! I think it was a great expansion of the series, and it didn't do what some other anime do with \"LOOK CLOWNS, BOO!\" It instead actually uses different elements to provide some scare tactics, and makes the clown an actual character.\r\nStory: The story in this anime was really good, it had few plot errors or mishaps, and managed to keep me on the edge of my seat throughout its entirety. It never felt slow,or too fast, with its perfect pacing, giving you just enough time to digest the new information given to you, before feeding you even more. 9/10 for story.\\n\\n\r\nArt: The art style is consistent and the high-quality animation is as well throughout the duration of the series. The OP and ED looked especially good. 9/10 for art.\\n\\n\r\nSound: Enamel is great, as is the rest of the soundtrack. 9/10 for sound.\\n\\n\r\nCharacter: I really liked the addition of the new circus troupe characters, I don't think any of them were too cliched, and I think that they all showed some good development as the story progressed on. I absolutely loved Ciel's character development as the anime moved on and think that the \"You can't turn back\" moments were with a certain character absolute GOLD. Giving this a 10/10 on characters because I believe it deserves one.\\n\\n\r\nEnjoyment: I really enjoyed this anime (and not just because of Grell's cameos) it had a great story, and the events in the story appeared to actually have long lasting consequences for the canon universe. i look forward to seeing how it develops, 10/10 for enjoyment.\\n\\n\r\nOverall: As an overall score, I believe that this deserves a 9/10. This is factoring everything about it in, and I believe that this only just missed off of a 10, because there were still some points that did not make it prefect (even though my scoring system is a little broken and I have 10's that aren't perfect), but this anime was not able to prove that it was perfect, or resonate a deep chord/feeling within me, thus a 9/10. It was really good, and I recommend it strongly if you have seen the first 13 episodes of Kuroshitsuji season 1.",
            "date": "2017-10-21T03:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 261311,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559723.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Springball64",
                "username": "Springball64"
            },
            "url": "https://myanimelist.net/reviews.php?id=261311"
        },
        {
            "content": "After watching the second season, it took me a good while to come around to wanting to watch this season. But wow, am I glad I did. \r\nBook of Circus is the shortest of the seasons so far, but by far, I'd consider it the best. It's ten episodes and I knocked it out in a day, something I don't do often. It took me about a month to finish the first season, and even longer to finish the second one, but this, my lord.\r\nBook of Circus introduces the Noah's Ark Circus, an entertaining group of circus performers who captured my attention right away. They'reinteresting characters, and though you know they're the villains, you can't help but love them! \\n\\n\r\nSebastian and Ciel remain the same duo, maybe even slightly more entertaining than the last season. They're sent to the Noah's Ark Circus to investigate a string of missing children. Each town the circus goes too, children go missing. \\n\\n\r\nWhile remaining with the same personalities, Ciel does finally receive some incredibly well-done development. We see more into his character this season, his motivations, his fears, his past, etc.\\n\\n\r\nAs for Sebastian, he remains the same for me. He's still the same, powerful demon, his personality doesn't change much, over than that he does show some surprise this season, which was nice to see. He's never really been my favorite, but I don't hate him.\\n\\n\r\nWith the exception of Ciel and Sebastian, I found myself entirely entranced in the storylines of Joker, the leader of the Circus, and Doll, a member. For me, these characters quickly became some of my favorite in the manga/anime together. \\n\\n\r\nAs each episode goes on, the storyline only continues to get darker, but it's done in such a way that you can't help but continue. It pulls you in. I wasn't bored for a minute.\\n\\n\r\nThe ending was perfectly done, and I can't go too into without spoilers, but the animation and writing teams both did such an amazing job, I was blown out of the water. \\n\\n\r\nThe art style remains absolutely beautiful. It's vibrant, it's bright, it's clear. \\n\\n\r\nThe music fits so well, and I actually enjoyed the opening theme. It wasn't like the previous two seasons, and I didn't skip it like I normally would with an opening. It's different and it works. \\n\\n\r\nAs for the dubbing, the original cast remains great, but I found that many of the Noah's Ark Circus members fit incredibly well with the exception of Dagger. As much as I love his character, his VA wasn't my favorite.\\n\\n\r\nAfter the let down of the second season, Book of Circus made me love the series again. It's definitely on my 'rewatch' list in the near future.",
            "date": "2017-09-14T20:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 257541,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6280493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/saturnkeith",
                "username": "saturnkeith"
            },
            "url": "https://myanimelist.net/reviews.php?id=257541"
        },
        {
            "content": "I was never really the avid fan of Kuroshitsuji. I watched the first season, and it was satisfying enough, and the second season took a severe dip but was still watchable. Bored, I decided to check out Kuroshitsuji: Book of Circus. Upon completion, the best way to describe my feelings towards the series was this:\r\nMind blown. \r\nNow, I'll try to keep my review as concise as possible (though really, I'm going to be fawning all over this series). \r\nSound: (10) \r\nThe soundtrack is absolutely gorgeous. The opening song in particular, was so catchy that it was stuck in my head for months and eventually Ilearned to play it on the piano. All the pieces were wonderfully composed, serving to complement and enhance crucial moments the ambiance of the series. The soundtrack is also diverse, ranging from suspense to pleasantries. \\n\\n\r\nThe voice actors are stellar as well, and the recurring song, Tom, Tom the Piper's Son, served the overall theme well. The music was haunting and heartwrenching and terrifying and beautiful and just EVERYTHING. \\n\\n\r\nStory: (10) \\n\\n\r\nIt's like standing on a very large painting and you look to the floor. You see pretty colours and think \"oh, that looks so nice with that blue over there. What's that splatter of black there? The floor is so pretty!\" And then you're suddenly lifted off the painting where you can get a bird's eye view of the entirety of it, and you see how all the colours and lines were meant to come together in this one, big, lovely, darkly twisted masterpiece and your breath is just stolen from your lungs. \\n\\n\r\nThat's how the story felt to me. \\n\\n\r\nThe plot was indescribably, intricately well done. Everything during the first half of the series, every little action or word of the characters, had meaning to it and I loved that. One little phrase from a character that could be so easily overlooked came back to bite in the second half. There was lovely foreshadowing and hints and story building so that when the big reveal was, well, revealed, EVERYTHING made so much sense and everything came together. \\n\\n\r\nI also loved the build up of the plot. The beginning half of the series was more lighthearted and built upon the characters/setting whereas the second half was intense, suspenseful, dark, and action-packed. It was a good balance of comedy, mystery, action and even near horror. \\n\\n\r\nThe story basically has everything, from Ciel's backstory to questions of morality and themes of wistfulness and darkness and just, just...EVERYTHING (i'm overusing that word but it's true). And the sad, bittersweet, SHEER IRONY at the end that has Ciel laughing like a maniac was so brilliant. \\n\\n\r\nArt: (10)\\n\\n\r\nAbsolutely lovely, and 100% a step up from the seasons 1 and 2 of the series. \\n\\n\r\nCharacter: (10) \\n\\n\r\nCharacters have always been one of the main deciding factors of whether a show is good or not. You only care what happens in a story if you care about the characters. These characters left me speechless. \\n\\n\r\nUnique, distinct, and memorable, there was not one character I disliked. The villains were so twisted and downright terrifying, and the main characters were so complex and lovely. I loved the relationship between the troupe, as well as the little comedic bits between Sebastian, Ciel, and some of the og characters such as prince Soma or the Shinigami. \\n\\n\r\nEach character was introduced as a unique character already, and are likable even before delving more into their personalities. Wonderful, wonderful characters. \\n\\n\r\nEnjoyment: (10)\\n\\n\r\nAs an action fan, I definitely enjoyed the second half of the series slightly more than the first. Overall, however, I absolutely was astounded by this series and its sheer brilliance. \\n\\n\r\nOverall: (10) \\n\\n\r\nDefinitely recommend.",
            "date": "2017-04-12T16:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 245340,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5301086.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bravepotato",
                "username": "bravepotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=245340"
        }
    ]
]