[
    [
        {
            "content": "I love the sports genre and played soccer for many years, so I started watching this anime as a hopeful viewer. My rating started high and kept declining as the season went on because the show lacked a few essential things:\r\nWhile the show had a lot of promise, the character development was lacking. Tsukushi emulates the familiar sports trope “not very talented, but dedicated to practice every waking moment.” This was fine for me (but if you dislike that trope, run for the hills). I was interested to see how this show would set Tsukushi apart from other characters within that trope. Not only didthe writers fail to distinguish him as a unique character, they failed to write the trope very well at all. Instead of fleshing out a diverse cast, the show kept revealing new backstories for incoming rivalry teams, giving characters one or two base traits to fall back on as the story moved forward. Tsukushi doesn’t really do anything exceptional throughout the season to demonstrate how he gets better at soccer (besides running around the school a bazillion times)—he just kind of does and the viewer has to accept that because every rivalry team reacts to his mediocre performance the same way. Even though this happens in other sports anime, because he wasn’t developed very well as a character, his success falls flat. \\n\\n\r\nAs for the gameplay, well, it was a bit hard to tell they were playing soccer at all. The animation in general was sparse when it came to the action of the show, and it was clear that the writers took some liberties to spice up the plot. Not that sports anime has ever stayed realistic to the sport itself—I wasn’t looking for authentic soccer. However, the animation of the gameplay did not make up for the long-winded conversations that occurred on the field (conversations that didn’t really do much to provide insight or emotion to the viewer).  \\n\\n\r\nDays is an anime that begins with some hopeful charm and ends with dissatisfaction. \\n",
            "date": "2016-12-21T12:57:00+00:00",
            "helpful_count": 81,
            "mal_id": 236020,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760045.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/acotede",
                "username": "acotede"
            },
            "url": "https://myanimelist.net/reviews.php?id=236020"
        },
        {
            "content": "Days is a unpretentious sports anime who doesn't focus only in the game it self, but on the characters around the series, we are introduce to theirs fears and joy, Days i think is on the best character developed in sports anime then i could ever see. The art of Days is very nice, but is not the point on sports anime then i focus my avaliation, but i feel very pleasant watching the series art. The music is good, is most cliche anime ost on mix the great moments with splendorous song or their sad moments with a song that broke ours hearts. Inthe and i think Days is a great show and worth to watch if you like sports anime or not.",
            "date": "2016-12-19T10:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 235824,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5220590.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Matt_Tex",
                "username": "Matt_Tex"
            },
            "url": "https://myanimelist.net/reviews.php?id=235824"
        },
        {
            "content": "\"I want to put my life on the line to live.\"\r\n- Tsukushi Tsukamoto\r\nThis anime teaches us that no matter what don't give up...you can't give up... don't blame yourself just because it didn't work for you...you can't call yourself a loser when you have the ability to change it if you put your hardest on the line. That what it's meant to live. \r\nThis story is about a boy named Tsukamoto who is physically weak yet mentally strong.On the first day of school, he gets invited by his classmate Kazama to a soccer match at night.While playing the game Kazama finds a hidden potential withinTsukamoto.Watch him as he unravels his abilities to become a cheer-leading runner ('outstanding'). \\n\\n\r\nIt's different from all the others.\\n\r\nI like how they made the Tsukamoto a complete newbie at soccer. and the best of it that he got his own way of becoming a much of help to his team aside from being NOOB at soccer like his fresh character and his trait that can motivate his teammates.\\n\r\nLike:\"It's always exceptional idiots like him that smash the status quo.\"\\n\r\n- Hisahito Mizuki.\\n\\n\r\nI know I know that they exaggerate in his influence to the teammates but hey..... it's quite refreshing this kind of character from now and then.Right!!\\n\\n\r\nTo summarize:\\n\r\n-Story: 8/10 \\n\r\n-Art: 9/10 (they put a remarkable effort in the football skills and techniques)\\n\r\n-Sound: 8/10 (nice OP and ED)\\n\r\n-Character: 9/10 (every character has its own charm)\\n\r\n-Enjoyment: 9/10\\n\r\n-Overall: 9/10\\n",
            "date": "2017-01-05T16:38:00+00:00",
            "helpful_count": 17,
            "mal_id": 237526,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4501888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MrBouBou",
                "username": "MrBouBou"
            },
            "url": "https://myanimelist.net/reviews.php?id=237526"
        },
        {
            "content": "This is an anime that takes out every single generic sports anime aspect and jumbles it into one show. I've seen this done before with other genres of anime and it never works. The protagonist absolutely sucks at the game, and his teammates rely on his...cheering? What is this? It's like the protagonist belongs in Cheer Danshi. \r\nThen you have the captain with the Hinata Shoyou like traits (confusing lingo with his teammates) and the character holding the team together because he's the \"best.\" \r\nSeriously, this show is decent at best. I'm watching it out of just being a completionist at this point. 10 episodesin and there's nothing unique or admirable about this show. I'm hoping and hoping every episode that SOMETHING happens, but it's the same format throughout every single episode. \\n\r\nTeam starts failing, protag cheers them, they all do their best and have their harem speeches, then someone goofs up and protag goes in the game, goofs up also and everyone gets...motivated. \\n\\n\r\nOverall, I gave this a 3 because honestly, I struggled to enjoy it and it was just the same thing every episode. When the protagonist finally scores a goal, there's about five episodes left. I'm definitely not going to be watching season 2. \\n",
            "date": "2017-01-02T04:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 237253,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/whorifying",
                "username": "whorifying"
            },
            "url": "https://myanimelist.net/reviews.php?id=237253"
        },
        {
            "content": "DAYS have their up and downs. The show turns a few stereotypes into likeable characters and focuses on even fewer to keep it simple but honest. Like its art and animation: decent, enough for the job. However, the story takes an interesting start which keeps on going quite pleasantly until the end, even if there are some weaker episodes. It makes up for most of the flaws you may notice and brings something fresh to soccer anime since Ginga e kickoff!! (2012).\r\nBut it's not a revelation either: even entertaining, the story still plays with the same old ingredients; the way it's done makes the difference,most of the time at least. The show is pulled by a potentially annoying main character, wearing a bit much of an Ikari Shinji on him at times (I exaggerate a little), but, luckily, his growth looks more promising (I'm serious). Served by a nice score, the shōnen is in the mix with emphasized friendship, a bit of light drama, and the right amount of action. With some good moments in the direction and an interesting rhythm, the little inconveniences you might find will tend to fade away, or at least stay tolerable.\\n\\n\r\nIn the end, if you usually like those kind of shows, you could easily enjoy this one, it's well-enough made to keep your interest up for 24 episodes and still want more. If you usually don't, you could still give a look, it might worth a try.",
            "date": "2016-12-25T04:57:00+00:00",
            "helpful_count": 14,
            "mal_id": 236454,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418424.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DonQuigeek",
                "username": "DonQuigeek"
            },
            "url": "https://myanimelist.net/reviews.php?id=236454"
        },
        {
            "content": "I had high hopes for Days since it is a new sports anime (There needs to be more sports anime in this world). I haven't seen much of the episodes released, only to ep 7, but that's already enough for me to see that the anime isn't going anywhere soon. First off the bat, we meet Tsukushi who wants to be a soccer player and he will do anything to be a better player for the team. But what does he have to show for it? Nothing much, really. Just running. \r\nI personally don't see how running all day long will help with playing soccer,a sport involving a ball, but the anime makes it clear that by simply running, he can make the team great. No need to learn how to receive/pass the ball, dribble, or even kick a goal, because running will always somehow make the team win. \\n\\n\r\nThe repetitive problem about this anime is that they make Tsukushi so full of potential and that he can make the team achieve so much more if he were there, but he hasn't done anything to prove that. There is no build up to how he has made the team so great. For all I can see, he can be taken out of the anime and the team would do just as good because that's how important his role is in the anime. The whole story is revolving around a useless character and it's being shoved in our faces that he's a great character. I don't see that at all. \\n\\n\r\nFor me, if the kaBOOM! kaPOW!! (basically awesomeness of the anime) isn't there yet by episode 5, then the anime is just going to be one of those that drag things out. \\n\\n\r\nOverall, the anime would've been better if there was no Tsukushi.",
            "date": "2016-12-17T17:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 235686,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5908707.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Allenwalker07",
                "username": "Allenwalker07"
            },
            "url": "https://myanimelist.net/reviews.php?id=235686"
        },
        {
            "content": "I think there's a lot of merit to judging an anime not on what it tells you, but what it shows you. Days, an anime about football, or American Soccer as it's called in the rust belt, wants to tell me that football is an exciting daring sport where any boy, beefy or lanky, can play his heart out. However, the message it shows is that football is a boring sport only Europeans could love. What's far, far more important is boys' love. \r\nLook, there's only two reasons why anyone watches sports anime: to watch hot muscle boys fight each other, and to watch hotboys almost kiss each other. This anime flat out fails at the first and somewhat performs on the second. If there's a second season, we need more boys falling awkwardly on top of each other and looking into each others eyes. It's a football game, it should be happening like every other minute already.\\n\\n\r\nYou'll be too busy keeping a tally of the times the main characters almost kiss to notice anything about the sound design or the artistic direction. I can't even remember very much about the actual sports matches, and sometimes you'll see a football in the screen and think \"Why is this in my Boys' Love anime? Is it supposed to symbolize something?\" and then remember that this is supposed to be a sports anime.\\n\\n\r\nThis succeeds at being an anime. I can honestly praise it enough for that, and I probably have already praised it too much. I'd suggest watching this anime if you want to lose interest in football forever and make a transition to a sport less humiliating like lacrosse. I'd also suggest watching this if you're into boys' love because, boy oh boy, there's a lot of boy action in this anime.\\n\\n\r\nDo you remember that family guy joke, where the truck with chocolate crashes into the truck with peanut butter, and makes reeses peanut butter cups? Stop watching family guy, throw out your football, pick up a lacrosse butterfly net and watch this anime.",
            "date": "2018-09-04T07:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 288106,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MushyMallow",
                "username": "MushyMallow"
            },
            "url": "https://myanimelist.net/reviews.php?id=288106"
        },
        {
            "content": "So...sports anime...what is the essence of sports anime? People working together to achieve a sporting goal. Yeah that's part of it. Getting stronger better faster higher etc. Oh yeah that's in there. Explaining the rules of a sport to the audience. Nope, not at all important, that part is usually boring. What is the most important thing in a sporting anime is...Ganbare!!! Pretty much that. Have that word spoken at least every 5 minutes and you have yourselves a sports anime. Apart from that vital trait, for me personally, the most important part of a sports anime is the feel good aspect. When I watcha sports anime I want to feel good. And boy does Days do that.\\n\\n\r\nThere is really no negative aspect in Days, it is all about trying hard, playing hard and working together as a team. There is some training and getting stronger feel to it but nowhere near most in the genre. So if you want to watch a completely feel good anime, lots of bromance moments, lots of different characters interacting and seeing different backstories this is the anime for you. \\n\\n\r\nThe focus on the main character, Tsukamoto and how amazing he is and how hard working and how much of an impression he has made on the team can get a little clawing at times. Come on people he is a good guy and all but calm down a little already...BUT if you just sit back and enjoy the feel good vibes (subliminal messaging maybe?) of the anime, you too will eventually be brainwashed uh I mean be a willing convert into the Tsukamoto cult that is Seiseiki soccer (football). Tch, I did not have the willpower to resist the warm and fuzzies of this anime...but it feels so good I am totally cool with it.\\n\\n\r\nThe sports aspect comes secondary to the people involved and the obstacles they face. There is a lot of light comedy (which is done quite well) no fan service stuff to get in the way, the merest hint of a couple of romances (there are two girls in the anime and of course Tsukamoto is the focus for both of them, everyone loves the guy you...will...too...just...watch...and...see...resistance...futile). \\n\r\nSo this is completely light and fluffy and warm but somehow I was not put off by it, it was not sickly sweet, not to me anyway, nope I just really enjoyed it. \\n\\n\r\nThe sporting parts were based in reality, no spinning fireball super shots here, of course the talking while you are in the middle of a game parts are not at all reality based but come on this is a sports anime so having 5 minute conversations/thought process while in the middle of a play is par for the course.\\n\r\nOverall great fun, super easy to watch and one of my favourite sporting anime. \\n\r\nSo sit back and get ready to feel good, become...one...of...us...Tsukamoto...awesome...love...him...best...player...ever!\\n\\n\\n",
            "date": "2018-04-25T10:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 278975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/youkos-o-ssu",
                "username": "youkos-o-ssu"
            },
            "url": "https://myanimelist.net/reviews.php?id=278975"
        },
        {
            "content": "Keep in mind that this is my personal opinion, and you will not know if you will like the anime or not until you have watched it.\r\nThe bad stuff:\r\nThe show was a bit repetitive. It was quite subtle, but if you watch for it, many of the episodes share similar story lines, with very little happening in each. That being said, this season has 24 episodes and somehow manages a decent plot. Character development was minimal in the second half of the season, due to the vast amount of gameplay that occurred; it was inevitable that the attention would be draw away from character developmentand towards the opposing teams. The animation was a bit lacking while they played soccer and the moves themselves were practically described instead of being shown.\\n\\n\r\nThe good stuff:\\n\r\nHonestly, from a reviewer’s point of view, this show was lacking and full of clichés. However I enjoyed it very much. I liked the art style and the sound was very well done in assisting in adding emotion to the story. While it didn’t live up to my expectations I was very pleased with what I did get. It was fun to watch, and in my opinion, that is what I like the most about sports anime. \\n\\n\r\nOverall rating: 9",
            "date": "2018-01-25T16:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 269649,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6780493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xckc",
                "username": "xckc"
            },
            "url": "https://myanimelist.net/reviews.php?id=269649"
        },
        {
            "content": "This is my first review, to be honest, I never really think of writing one till I watch Days. This is quite a splendid anime that I looking towards every week. I'm sure most of you know the feel of watching an anime that you so into it and wanting it to never end or the sad feeling of wanting to watch more but you can't. Days are that type of anime that get you so excited and begging for more. I have been watching it from the day the first episode coming out and can't wait for more. The first impression of the animedoesn't really get you hook but after the first 2 episodes, I just can't stop myself from enjoying it and get frustrated that there is no more episode release. \\n\\n\r\nThe storyline in fairly common as the protagonist, start off being helpless and have no friends but after hard work, he begins to gain friends through their empathy like Naruto, overdrive etc. The art and the music itself are decent and can be improved but overall pretty good. The characters development is quite good as their improve and develop teamwork and further deepen their friendship as the story line progress. \\n\r\noverall a really well-made anime and very enjoyable. I recommend this to everyone who enjoy character development, sport and a bit of comedy. Thank you for reading",
            "date": "2017-01-04T16:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 237445,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4761955.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Deathmask277",
                "username": "Deathmask277"
            },
            "url": "https://myanimelist.net/reviews.php?id=237445"
        },
        {
            "content": "Starting off, I really hope people wouldn't pass on this anime just because of a few negative reviews. Please take note that most of the negative reviews are based off of very little episodes watched. \r\nTo be completely honest, the first 6-7 eps of DAYS had me wondering why I was still watching it. Unlike other popular anime in the sports genre, such as Haikyuu, Kuroko no Basket, Prince of Tennis etc, the main character of DAYS starts off as a total newbie at the sport. If you dislike slow development and prefer a prodigy MC right off the bat, you might want to passon this. However, if you don't mind the character development and seeing the MC grow to become even bigger and better, I almost guarantee you will enjoy DAYS. \\n\\n\r\nI'm going to make my review short and sweet, and tell you what I find to be the pros and cons of this show.\\n\\n\r\nPros:\\n\r\n- Interesting cast of characters, the main cast having very distinct personalities and roles in the game of soccer \\n\r\n- Great character and TEAM development, not only do you watch MC grow, you also get to see the whole team change for the better\\n\r\n- The art is very refreshing, and reminds me of summer. Bright colors and the art is unique to each character, which hints at their personality\\n\r\n- Sport play isn't too tacky or dramatic, but there are enough amazing plays to keep you entertained!\\n\\n\r\nCons: \\n\r\n- This might be a con, but it can also be a pro at the same time: unlike in other shows where the MC has a set goal (i.e becoming the top player, beating strong teams, etc..) DAYS focuses more on Tsukamoto (MC)'s development as a complete newbie that knows absolutely nothing about soccer to showing latent talent in the sport (future team captain maybe?) \\n\r\n- For those that show initial dislike for MC (I know I did) I urge you to continue watching as it is rewarding to see that Tsukamoto does become an impeccable underdog for his team. \\n\\n\r\nOverall, if you enjoyed Haikyuu, Kuroko, PoT, Ace of Diamond, etc...you will likely enjoy this one as well.",
            "date": "2017-01-03T14:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 237358,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3807311.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vivi-kun",
                "username": "vivi-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=237358"
        },
        {
            "content": "This show is so cringe-worthy. I feel I should spoil it to save people the trouble from watching it.\r\nJaded soccer \"genius\" spots a momma's boy and apparently decides to pass the time by introducing him to soccer, cause apparently there's merit in bringing a \"good guy\" into soccer/football (genius is a closet momma's boy). Nevermind the fact physical sports are where alpha personalities and big egos clash to enforce superior social standing above others through displays of athleticism...\r\nSo basically this sheltered momma's boy is not only a complete beginner, but also is a complete idiot. His stupidity doesn't tell him that he has no businessbeing in the sport; the opposite happens, he determines it to be his calling. He does show that he has tenacity, probably the only redeeming trait that allows others to tolerate him. Seeing this soccer newbie enjoy the smallest things somehow reignites the passion in the no-longer-jaded soccer \"genius\", and the school soccer team goes on to become a force to be reckoned with.\\n\\n\r\nRather than being bullied by the alpha guys, he's bullied by a single girl, and everyone treats it as normal. The girl even gets involved by becoming a manager.\\n\\n\r\nThe show *forces* this boy into being given air time whenever possible, and prepare to cringe from watching how people react to him. Apparently, his simple-mindedness resonates with muscle-heads, and they sort of create a weird kind of rivalry that accelerates the progress of the momma's boy, evolving him into a freak that poses some sort of unconventional threat.\\n\\n\r\nI don't like the cringe feeling, but I'm not disgusted for some reason, and end up continuing to watch. I know I can drop a high school romance the moment a cringe-worthy awkward moment pops up, but I can't figure out WTF is up with this show that got me to continue. Well, on the plus side, this anime helps set the lowest standard in anime that I could actually complete watching.",
            "date": "2017-12-17T16:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 265450,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6791040.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/dv8zen",
                "username": "dv8zen"
            },
            "url": "https://myanimelist.net/reviews.php?id=265450"
        },
        {
            "content": "I became a fangirl after episode one.  Some things about reviews to keep in mind is that they tend to be as much as people try not to, full of biases. I find that the overall score of a series doesn’t determine whether it’s good or bad.  You will notice with DAYS, you either get people who are in love with it like me or people who hated it and then the sprinkle of the neutral here and there. \r\nI’m going to warn you this is a bias review. I did start it off with an “I became a fangirl after episode one”bit after all. \\n\\n\r\nI’m the type of anime watcher where you have to hit me in the feels in order for me to like it and if you don’t hit me hard, no great animation or interesting plot is going to make me love the series. However, the instant I watched episode one of DAYS, I binged watched the rest that was on Crunchyroll that’s how hooked I got into it.\\n\\n\r\nDAYS, plays out the typical formula in sports anime. There is an amateur who develops a love for the sport, and they tend to be below average compared to their average skilled teammates with one super genius on the team as the ace. Or in the case of DAYS, a couple super bad asses. \\n\\n\r\nIf you like shounen series this one definitely plays on the whole Nakama feels with players who want to become stronger and become useful to the team. This is especially true for our below-average protagonist player Tsukamoto who lacks even the stamina just to run and chase the ball but tends to be the most critical of himself. Many characters are amazed at how far Tsukamoto has progressed with only starting to play soccer his first year of high school, but he, unlike the others, knows better than anyone the vastness of skills he lacks but that doesn’t stop him from trying his best. The series other protagonist is Kazama, Jin – the pretty boy soccer genius who is a lot more complex emotionally and mentally than he appears. These two develop a strong bond right off the bat. \\n\\n\r\nThere is an also an interesting parallel of characters between the third years and the first years who will be taking over the mantle after the third years graduate. Both of them learning and growing together. There are also interesting character development and interaction with other characters within the team and rivals from other schools.  It shows the role of each player and just how pivotal they are to a team, from the defence, to the forwards and goalie. \\n\\n\r\nNow to soccer, I find I can’t watch actual sports, as they bore me but what I love about watching DAYS is seeing what’s going on in the heads of the players. Being able to understand their mind frame and their struggles while they play. It’s beautiful. \\n\\n\r\nThere is some awkward soccer playing animation that looks bad especially when framing it at a distance but overall, the animation was beautiful. It’s not over the top but not too simple. Something very interesting about the openings in particular is that the music while very catchy and probably one of the few anime series that I took the time to listen to each episode was the animation. The opening was made up of clips and scenes from the actual anime itself which is simple but none the less beautiful than a fancy over the top OP that you tend to typically see.\\n\\n\r\nOne key point for me in this series was, that we have a disabled person in the anime! In all the anime that I have come across, there has been either little to no representation of disabled people. EVER! That to me gives this story a great plus as it shows a more diverse cast of characters.\\n\\n\r\nI have to talk about this because managers in sports anime, are useless side characters that do very little for the main plot. Until Ubukata. She is a powerhouse all her own. There are actual episodes dedicated to her character development. The freakan managers for crying out loud!!!!! She doesn’t start off as a manager but as she gets to know Tsukamoto who she originally discourages from trying to learn soccer, she starts to respect him and in my humble opinion becomes his number one fangirl. I honestly think she is falling in love with him. Who wouldn’t? He is so cute with his rosy cheeks. \\n\\n\r\nI admire this being one of the few series that makes a realistic female character who isn’t madly in love with the protagonist to the point that, that’s all her character is about. Her feelings for Tsukamoto are just one aspect too her character.\\n\\n",
            "date": "2016-12-17T17:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 235685,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3164339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/I_Love_Pikachu",
                "username": "I_Love_Pikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=235685"
        },
        {
            "content": "If you are reading this, First don't judge the anime because he is always running and weak, but that is only at first he is weak at first  and i give it a chance and still watch it until the end he became skilled because of his own effort, I almost drop this anime because i hate it that he was so weak and coudn't do anything but to run, but then i realize that i can somehow relate this in reality.. many people gave up to their dream and this anime made me realize that everyone can become stronger, I almost drop itat first because his always running and running but then i think that everyone came from a beginner until they got better! This anime has a lesson, not to give up i really hope that the second season of this anime would much be greater!",
            "date": "2017-10-30T20:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 262159,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6695536.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/meiberuM",
                "username": "meiberuM"
            },
            "url": "https://myanimelist.net/reviews.php?id=262159"
        },
        {
            "content": "Great anime... I'm not a fan of sports anime except hajime no ippo and haikyuu but this one is crazy in storytelling and character development. Really liked and waiting for next episodes to come out.\r\nThe character really gives an awww and ewww feel. It really shows that every human has up and downs in their life. \r\nAt some place, the story seems cliche, but still has his own essence of presentation.\r\nI'm just curious to see how the character will develop from a newbie to pro. And how he is going to become someone like mizuki. It's a great anime to watch and i would recommendto give it a try",
            "date": "2018-04-13T08:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 277960,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5044795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/abyss_zoro",
                "username": "abyss_zoro"
            },
            "url": "https://myanimelist.net/reviews.php?id=277960"
        },
        {
            "content": "SPOILER FREE! (sorry, my English sucks)\r\nDAYS is the series where you can learn and feels how to be a champion from scratch. This series shows you the real life of being the beginner for a soccer player (don't highly expect like MC was a typical anime superhero- well, he's not). You can feel the pain of being lost and the joyful of the victory. You get nothing easily. Hardship, crying, tired, be a loser will drag down people, but Tsukamoto shows you everything he got. The friendship between them is really awesome. Who says the fantastic football club hates the loser? If you falls down,you'll fall together. if you climb, drag the weakest up together. \\n\r\nI heard many spoilers about this anime being so lame about the characters. But, I just give it a try without any expectation and yeah it sometimes pisses me off. But I learn so many things from this anime. NEVER GIVE UP is the key to the successful!\\n\r\nI regret nothing after watched this anime.",
            "date": "2018-01-25T10:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 269605,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6742126.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/arch_senpai",
                "username": "arch_senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=269605"
        },
        {
            "content": "This is the best football anime I've ever seen. Unlike the other captain's with their magic shots and legendary status which makes wonder how are they not the best in the world, Days is actually about football, tactics are emphasized during games by very good use of far cam, moves of the players are very good, and the super duper stuff players do is actually doable and a joy to watch imaging scoring a goal as such.\r\nthe characters psychology, their drivers and their attitudes are very well structured taking into consideration their positions which gets young footballers to reflect on their own weaknesses or gamein general. I'd definitely show this to young footballers as it would make it easier to get to them, tone their game and make them start think about their game from a young age.\\n\\n\r\nThis anime is also a joy to watch, the story line is quite good, people coming together and helping each other out, all good things to instill into people.\\n\\n\r\nIf you to watch the impossible to get a certain high this is not for you, if you actually understand and like football this is a must watch.",
            "date": "2017-09-22T08:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 258292,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KINJANO",
                "username": "KINJANO"
            },
            "url": "https://myanimelist.net/reviews.php?id=258292"
        },
        {
            "content": "Out of all the sports anime I have watched, I think this is one of the best that I enjoyed. The main character wasn't annoying like the others. He may have a lot of weakness but that doesn't make him a bad character or something. The other characters also did their best. Some of them may have irritated me but that was part of the storyline but not how they were created. I hope you get the point. \r\nI have watched a lot of sports anime and I actually have standards for it. Some sports anime - well, okay - most them are outof the world or too great for their character. For example, a beginner suddenly good at it which is actually confusing. But in this anime, they showed the result of the hard work that the MC did. That's what I am looking for. There's actually anime that is just suddenly good without showing their training or something and it just confused the hell out of me and I think it doesn't just apply to me. He knows that he is the worst player in the group but he doesn't let his play be affected which is good. \\n\\n\r\nThe rest... I like the art and I enjoyed it. However, some parts are taking too long (Im not talking about the gameplays). I actually regretted watching it this early because I know the Season 2 will probably take a year or so and I've waiting for sequels for my whole life and it's actually annoying. \\n\\n\r\nI think this anime is scored 4 for a re-watch. It actually confused me that some gave low rating for this anime.",
            "date": "2017-04-04T03:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 244573,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4306771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/hoseokie",
                "username": "hoseokie"
            },
            "url": "https://myanimelist.net/reviews.php?id=244573"
        },
        {
            "content": "Days for me was a different anime. From the first 2 episodes I understand what that series is going for.The protagonist is not the best at nothing and he is trying his best but he can t compare with a lot of his friends like (Kazama, Mizuki),\r\nI liked that in this anime is not the type of anime where the protagonist does perfect at the correct time ( If you seen it you know what I mean)\r\nThe characters where great and are not filler episodes\r\nThe animation is not cute like other animes but is fitting the story.\r\nThe openings were great but the first ending wasbad not like the last one.\\n\r\nOverall is one of the best anime i ever seen",
            "date": "2018-04-12T00:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 277825,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7157176.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Francisc_",
                "username": "Francisc_"
            },
            "url": "https://myanimelist.net/reviews.php?id=277825"
        }
    ],
    [
        {
            "content": "I love the sports genre and played soccer for many years, so I started watching this anime as a hopeful viewer. My rating started high and kept declining as the season went on because the show lacked a few essential things:\r\nWhile the show had a lot of promise, the character development was lacking. Tsukushi emulates the familiar sports trope “not very talented, but dedicated to practice every waking moment.” This was fine for me (but if you dislike that trope, run for the hills). I was interested to see how this show would set Tsukushi apart from other characters within that trope. Not only didthe writers fail to distinguish him as a unique character, they failed to write the trope very well at all. Instead of fleshing out a diverse cast, the show kept revealing new backstories for incoming rivalry teams, giving characters one or two base traits to fall back on as the story moved forward. Tsukushi doesn’t really do anything exceptional throughout the season to demonstrate how he gets better at soccer (besides running around the school a bazillion times)—he just kind of does and the viewer has to accept that because every rivalry team reacts to his mediocre performance the same way. Even though this happens in other sports anime, because he wasn’t developed very well as a character, his success falls flat. \\n\\n\r\nAs for the gameplay, well, it was a bit hard to tell they were playing soccer at all. The animation in general was sparse when it came to the action of the show, and it was clear that the writers took some liberties to spice up the plot. Not that sports anime has ever stayed realistic to the sport itself—I wasn’t looking for authentic soccer. However, the animation of the gameplay did not make up for the long-winded conversations that occurred on the field (conversations that didn’t really do much to provide insight or emotion to the viewer).  \\n\\n\r\nDays is an anime that begins with some hopeful charm and ends with dissatisfaction. \\n",
            "date": "2016-12-21T12:57:00+00:00",
            "helpful_count": 81,
            "mal_id": 236020,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760045.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/acotede",
                "username": "acotede"
            },
            "url": "https://myanimelist.net/reviews.php?id=236020"
        },
        {
            "content": "Days is a unpretentious sports anime who doesn't focus only in the game it self, but on the characters around the series, we are introduce to theirs fears and joy, Days i think is on the best character developed in sports anime then i could ever see. The art of Days is very nice, but is not the point on sports anime then i focus my avaliation, but i feel very pleasant watching the series art. The music is good, is most cliche anime ost on mix the great moments with splendorous song or their sad moments with a song that broke ours hearts. Inthe and i think Days is a great show and worth to watch if you like sports anime or not.",
            "date": "2016-12-19T10:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 235824,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5220590.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Matt_Tex",
                "username": "Matt_Tex"
            },
            "url": "https://myanimelist.net/reviews.php?id=235824"
        },
        {
            "content": "\"I want to put my life on the line to live.\"\r\n- Tsukushi Tsukamoto\r\nThis anime teaches us that no matter what don't give up...you can't give up... don't blame yourself just because it didn't work for you...you can't call yourself a loser when you have the ability to change it if you put your hardest on the line. That what it's meant to live. \r\nThis story is about a boy named Tsukamoto who is physically weak yet mentally strong.On the first day of school, he gets invited by his classmate Kazama to a soccer match at night.While playing the game Kazama finds a hidden potential withinTsukamoto.Watch him as he unravels his abilities to become a cheer-leading runner ('outstanding'). \\n\\n\r\nIt's different from all the others.\\n\r\nI like how they made the Tsukamoto a complete newbie at soccer. and the best of it that he got his own way of becoming a much of help to his team aside from being NOOB at soccer like his fresh character and his trait that can motivate his teammates.\\n\r\nLike:\"It's always exceptional idiots like him that smash the status quo.\"\\n\r\n- Hisahito Mizuki.\\n\\n\r\nI know I know that they exaggerate in his influence to the teammates but hey..... it's quite refreshing this kind of character from now and then.Right!!\\n\\n\r\nTo summarize:\\n\r\n-Story: 8/10 \\n\r\n-Art: 9/10 (they put a remarkable effort in the football skills and techniques)\\n\r\n-Sound: 8/10 (nice OP and ED)\\n\r\n-Character: 9/10 (every character has its own charm)\\n\r\n-Enjoyment: 9/10\\n\r\n-Overall: 9/10\\n",
            "date": "2017-01-05T16:38:00+00:00",
            "helpful_count": 17,
            "mal_id": 237526,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4501888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MrBouBou",
                "username": "MrBouBou"
            },
            "url": "https://myanimelist.net/reviews.php?id=237526"
        },
        {
            "content": "This is an anime that takes out every single generic sports anime aspect and jumbles it into one show. I've seen this done before with other genres of anime and it never works. The protagonist absolutely sucks at the game, and his teammates rely on his...cheering? What is this? It's like the protagonist belongs in Cheer Danshi. \r\nThen you have the captain with the Hinata Shoyou like traits (confusing lingo with his teammates) and the character holding the team together because he's the \"best.\" \r\nSeriously, this show is decent at best. I'm watching it out of just being a completionist at this point. 10 episodesin and there's nothing unique or admirable about this show. I'm hoping and hoping every episode that SOMETHING happens, but it's the same format throughout every single episode. \\n\r\nTeam starts failing, protag cheers them, they all do their best and have their harem speeches, then someone goofs up and protag goes in the game, goofs up also and everyone gets...motivated. \\n\\n\r\nOverall, I gave this a 3 because honestly, I struggled to enjoy it and it was just the same thing every episode. When the protagonist finally scores a goal, there's about five episodes left. I'm definitely not going to be watching season 2. \\n",
            "date": "2017-01-02T04:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 237253,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/whorifying",
                "username": "whorifying"
            },
            "url": "https://myanimelist.net/reviews.php?id=237253"
        },
        {
            "content": "DAYS have their up and downs. The show turns a few stereotypes into likeable characters and focuses on even fewer to keep it simple but honest. Like its art and animation: decent, enough for the job. However, the story takes an interesting start which keeps on going quite pleasantly until the end, even if there are some weaker episodes. It makes up for most of the flaws you may notice and brings something fresh to soccer anime since Ginga e kickoff!! (2012).\r\nBut it's not a revelation either: even entertaining, the story still plays with the same old ingredients; the way it's done makes the difference,most of the time at least. The show is pulled by a potentially annoying main character, wearing a bit much of an Ikari Shinji on him at times (I exaggerate a little), but, luckily, his growth looks more promising (I'm serious). Served by a nice score, the shōnen is in the mix with emphasized friendship, a bit of light drama, and the right amount of action. With some good moments in the direction and an interesting rhythm, the little inconveniences you might find will tend to fade away, or at least stay tolerable.\\n\\n\r\nIn the end, if you usually like those kind of shows, you could easily enjoy this one, it's well-enough made to keep your interest up for 24 episodes and still want more. If you usually don't, you could still give a look, it might worth a try.",
            "date": "2016-12-25T04:57:00+00:00",
            "helpful_count": 14,
            "mal_id": 236454,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418424.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DonQuigeek",
                "username": "DonQuigeek"
            },
            "url": "https://myanimelist.net/reviews.php?id=236454"
        },
        {
            "content": "I had high hopes for Days since it is a new sports anime (There needs to be more sports anime in this world). I haven't seen much of the episodes released, only to ep 7, but that's already enough for me to see that the anime isn't going anywhere soon. First off the bat, we meet Tsukushi who wants to be a soccer player and he will do anything to be a better player for the team. But what does he have to show for it? Nothing much, really. Just running. \r\nI personally don't see how running all day long will help with playing soccer,a sport involving a ball, but the anime makes it clear that by simply running, he can make the team great. No need to learn how to receive/pass the ball, dribble, or even kick a goal, because running will always somehow make the team win. \\n\\n\r\nThe repetitive problem about this anime is that they make Tsukushi so full of potential and that he can make the team achieve so much more if he were there, but he hasn't done anything to prove that. There is no build up to how he has made the team so great. For all I can see, he can be taken out of the anime and the team would do just as good because that's how important his role is in the anime. The whole story is revolving around a useless character and it's being shoved in our faces that he's a great character. I don't see that at all. \\n\\n\r\nFor me, if the kaBOOM! kaPOW!! (basically awesomeness of the anime) isn't there yet by episode 5, then the anime is just going to be one of those that drag things out. \\n\\n\r\nOverall, the anime would've been better if there was no Tsukushi.",
            "date": "2016-12-17T17:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 235686,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5908707.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Allenwalker07",
                "username": "Allenwalker07"
            },
            "url": "https://myanimelist.net/reviews.php?id=235686"
        },
        {
            "content": "I think there's a lot of merit to judging an anime not on what it tells you, but what it shows you. Days, an anime about football, or American Soccer as it's called in the rust belt, wants to tell me that football is an exciting daring sport where any boy, beefy or lanky, can play his heart out. However, the message it shows is that football is a boring sport only Europeans could love. What's far, far more important is boys' love. \r\nLook, there's only two reasons why anyone watches sports anime: to watch hot muscle boys fight each other, and to watch hotboys almost kiss each other. This anime flat out fails at the first and somewhat performs on the second. If there's a second season, we need more boys falling awkwardly on top of each other and looking into each others eyes. It's a football game, it should be happening like every other minute already.\\n\\n\r\nYou'll be too busy keeping a tally of the times the main characters almost kiss to notice anything about the sound design or the artistic direction. I can't even remember very much about the actual sports matches, and sometimes you'll see a football in the screen and think \"Why is this in my Boys' Love anime? Is it supposed to symbolize something?\" and then remember that this is supposed to be a sports anime.\\n\\n\r\nThis succeeds at being an anime. I can honestly praise it enough for that, and I probably have already praised it too much. I'd suggest watching this anime if you want to lose interest in football forever and make a transition to a sport less humiliating like lacrosse. I'd also suggest watching this if you're into boys' love because, boy oh boy, there's a lot of boy action in this anime.\\n\\n\r\nDo you remember that family guy joke, where the truck with chocolate crashes into the truck with peanut butter, and makes reeses peanut butter cups? Stop watching family guy, throw out your football, pick up a lacrosse butterfly net and watch this anime.",
            "date": "2018-09-04T07:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 288106,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MushyMallow",
                "username": "MushyMallow"
            },
            "url": "https://myanimelist.net/reviews.php?id=288106"
        },
        {
            "content": "So...sports anime...what is the essence of sports anime? People working together to achieve a sporting goal. Yeah that's part of it. Getting stronger better faster higher etc. Oh yeah that's in there. Explaining the rules of a sport to the audience. Nope, not at all important, that part is usually boring. What is the most important thing in a sporting anime is...Ganbare!!! Pretty much that. Have that word spoken at least every 5 minutes and you have yourselves a sports anime. Apart from that vital trait, for me personally, the most important part of a sports anime is the feel good aspect. When I watcha sports anime I want to feel good. And boy does Days do that.\\n\\n\r\nThere is really no negative aspect in Days, it is all about trying hard, playing hard and working together as a team. There is some training and getting stronger feel to it but nowhere near most in the genre. So if you want to watch a completely feel good anime, lots of bromance moments, lots of different characters interacting and seeing different backstories this is the anime for you. \\n\\n\r\nThe focus on the main character, Tsukamoto and how amazing he is and how hard working and how much of an impression he has made on the team can get a little clawing at times. Come on people he is a good guy and all but calm down a little already...BUT if you just sit back and enjoy the feel good vibes (subliminal messaging maybe?) of the anime, you too will eventually be brainwashed uh I mean be a willing convert into the Tsukamoto cult that is Seiseiki soccer (football). Tch, I did not have the willpower to resist the warm and fuzzies of this anime...but it feels so good I am totally cool with it.\\n\\n\r\nThe sports aspect comes secondary to the people involved and the obstacles they face. There is a lot of light comedy (which is done quite well) no fan service stuff to get in the way, the merest hint of a couple of romances (there are two girls in the anime and of course Tsukamoto is the focus for both of them, everyone loves the guy you...will...too...just...watch...and...see...resistance...futile). \\n\r\nSo this is completely light and fluffy and warm but somehow I was not put off by it, it was not sickly sweet, not to me anyway, nope I just really enjoyed it. \\n\\n\r\nThe sporting parts were based in reality, no spinning fireball super shots here, of course the talking while you are in the middle of a game parts are not at all reality based but come on this is a sports anime so having 5 minute conversations/thought process while in the middle of a play is par for the course.\\n\r\nOverall great fun, super easy to watch and one of my favourite sporting anime. \\n\r\nSo sit back and get ready to feel good, become...one...of...us...Tsukamoto...awesome...love...him...best...player...ever!\\n\\n\\n",
            "date": "2018-04-25T10:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 278975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/youkos-o-ssu",
                "username": "youkos-o-ssu"
            },
            "url": "https://myanimelist.net/reviews.php?id=278975"
        },
        {
            "content": "Keep in mind that this is my personal opinion, and you will not know if you will like the anime or not until you have watched it.\r\nThe bad stuff:\r\nThe show was a bit repetitive. It was quite subtle, but if you watch for it, many of the episodes share similar story lines, with very little happening in each. That being said, this season has 24 episodes and somehow manages a decent plot. Character development was minimal in the second half of the season, due to the vast amount of gameplay that occurred; it was inevitable that the attention would be draw away from character developmentand towards the opposing teams. The animation was a bit lacking while they played soccer and the moves themselves were practically described instead of being shown.\\n\\n\r\nThe good stuff:\\n\r\nHonestly, from a reviewer’s point of view, this show was lacking and full of clichés. However I enjoyed it very much. I liked the art style and the sound was very well done in assisting in adding emotion to the story. While it didn’t live up to my expectations I was very pleased with what I did get. It was fun to watch, and in my opinion, that is what I like the most about sports anime. \\n\\n\r\nOverall rating: 9",
            "date": "2018-01-25T16:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 269649,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6780493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xckc",
                "username": "xckc"
            },
            "url": "https://myanimelist.net/reviews.php?id=269649"
        },
        {
            "content": "This is my first review, to be honest, I never really think of writing one till I watch Days. This is quite a splendid anime that I looking towards every week. I'm sure most of you know the feel of watching an anime that you so into it and wanting it to never end or the sad feeling of wanting to watch more but you can't. Days are that type of anime that get you so excited and begging for more. I have been watching it from the day the first episode coming out and can't wait for more. The first impression of the animedoesn't really get you hook but after the first 2 episodes, I just can't stop myself from enjoying it and get frustrated that there is no more episode release. \\n\\n\r\nThe storyline in fairly common as the protagonist, start off being helpless and have no friends but after hard work, he begins to gain friends through their empathy like Naruto, overdrive etc. The art and the music itself are decent and can be improved but overall pretty good. The characters development is quite good as their improve and develop teamwork and further deepen their friendship as the story line progress. \\n\r\noverall a really well-made anime and very enjoyable. I recommend this to everyone who enjoy character development, sport and a bit of comedy. Thank you for reading",
            "date": "2017-01-04T16:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 237445,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4761955.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Deathmask277",
                "username": "Deathmask277"
            },
            "url": "https://myanimelist.net/reviews.php?id=237445"
        },
        {
            "content": "Starting off, I really hope people wouldn't pass on this anime just because of a few negative reviews. Please take note that most of the negative reviews are based off of very little episodes watched. \r\nTo be completely honest, the first 6-7 eps of DAYS had me wondering why I was still watching it. Unlike other popular anime in the sports genre, such as Haikyuu, Kuroko no Basket, Prince of Tennis etc, the main character of DAYS starts off as a total newbie at the sport. If you dislike slow development and prefer a prodigy MC right off the bat, you might want to passon this. However, if you don't mind the character development and seeing the MC grow to become even bigger and better, I almost guarantee you will enjoy DAYS. \\n\\n\r\nI'm going to make my review short and sweet, and tell you what I find to be the pros and cons of this show.\\n\\n\r\nPros:\\n\r\n- Interesting cast of characters, the main cast having very distinct personalities and roles in the game of soccer \\n\r\n- Great character and TEAM development, not only do you watch MC grow, you also get to see the whole team change for the better\\n\r\n- The art is very refreshing, and reminds me of summer. Bright colors and the art is unique to each character, which hints at their personality\\n\r\n- Sport play isn't too tacky or dramatic, but there are enough amazing plays to keep you entertained!\\n\\n\r\nCons: \\n\r\n- This might be a con, but it can also be a pro at the same time: unlike in other shows where the MC has a set goal (i.e becoming the top player, beating strong teams, etc..) DAYS focuses more on Tsukamoto (MC)'s development as a complete newbie that knows absolutely nothing about soccer to showing latent talent in the sport (future team captain maybe?) \\n\r\n- For those that show initial dislike for MC (I know I did) I urge you to continue watching as it is rewarding to see that Tsukamoto does become an impeccable underdog for his team. \\n\\n\r\nOverall, if you enjoyed Haikyuu, Kuroko, PoT, Ace of Diamond, etc...you will likely enjoy this one as well.",
            "date": "2017-01-03T14:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 237358,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3807311.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vivi-kun",
                "username": "vivi-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=237358"
        },
        {
            "content": "This show is so cringe-worthy. I feel I should spoil it to save people the trouble from watching it.\r\nJaded soccer \"genius\" spots a momma's boy and apparently decides to pass the time by introducing him to soccer, cause apparently there's merit in bringing a \"good guy\" into soccer/football (genius is a closet momma's boy). Nevermind the fact physical sports are where alpha personalities and big egos clash to enforce superior social standing above others through displays of athleticism...\r\nSo basically this sheltered momma's boy is not only a complete beginner, but also is a complete idiot. His stupidity doesn't tell him that he has no businessbeing in the sport; the opposite happens, he determines it to be his calling. He does show that he has tenacity, probably the only redeeming trait that allows others to tolerate him. Seeing this soccer newbie enjoy the smallest things somehow reignites the passion in the no-longer-jaded soccer \"genius\", and the school soccer team goes on to become a force to be reckoned with.\\n\\n\r\nRather than being bullied by the alpha guys, he's bullied by a single girl, and everyone treats it as normal. The girl even gets involved by becoming a manager.\\n\\n\r\nThe show *forces* this boy into being given air time whenever possible, and prepare to cringe from watching how people react to him. Apparently, his simple-mindedness resonates with muscle-heads, and they sort of create a weird kind of rivalry that accelerates the progress of the momma's boy, evolving him into a freak that poses some sort of unconventional threat.\\n\\n\r\nI don't like the cringe feeling, but I'm not disgusted for some reason, and end up continuing to watch. I know I can drop a high school romance the moment a cringe-worthy awkward moment pops up, but I can't figure out WTF is up with this show that got me to continue. Well, on the plus side, this anime helps set the lowest standard in anime that I could actually complete watching.",
            "date": "2017-12-17T16:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 265450,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6791040.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/dv8zen",
                "username": "dv8zen"
            },
            "url": "https://myanimelist.net/reviews.php?id=265450"
        },
        {
            "content": "I became a fangirl after episode one.  Some things about reviews to keep in mind is that they tend to be as much as people try not to, full of biases. I find that the overall score of a series doesn’t determine whether it’s good or bad.  You will notice with DAYS, you either get people who are in love with it like me or people who hated it and then the sprinkle of the neutral here and there. \r\nI’m going to warn you this is a bias review. I did start it off with an “I became a fangirl after episode one”bit after all. \\n\\n\r\nI’m the type of anime watcher where you have to hit me in the feels in order for me to like it and if you don’t hit me hard, no great animation or interesting plot is going to make me love the series. However, the instant I watched episode one of DAYS, I binged watched the rest that was on Crunchyroll that’s how hooked I got into it.\\n\\n\r\nDAYS, plays out the typical formula in sports anime. There is an amateur who develops a love for the sport, and they tend to be below average compared to their average skilled teammates with one super genius on the team as the ace. Or in the case of DAYS, a couple super bad asses. \\n\\n\r\nIf you like shounen series this one definitely plays on the whole Nakama feels with players who want to become stronger and become useful to the team. This is especially true for our below-average protagonist player Tsukamoto who lacks even the stamina just to run and chase the ball but tends to be the most critical of himself. Many characters are amazed at how far Tsukamoto has progressed with only starting to play soccer his first year of high school, but he, unlike the others, knows better than anyone the vastness of skills he lacks but that doesn’t stop him from trying his best. The series other protagonist is Kazama, Jin – the pretty boy soccer genius who is a lot more complex emotionally and mentally than he appears. These two develop a strong bond right off the bat. \\n\\n\r\nThere is an also an interesting parallel of characters between the third years and the first years who will be taking over the mantle after the third years graduate. Both of them learning and growing together. There are also interesting character development and interaction with other characters within the team and rivals from other schools.  It shows the role of each player and just how pivotal they are to a team, from the defence, to the forwards and goalie. \\n\\n\r\nNow to soccer, I find I can’t watch actual sports, as they bore me but what I love about watching DAYS is seeing what’s going on in the heads of the players. Being able to understand their mind frame and their struggles while they play. It’s beautiful. \\n\\n\r\nThere is some awkward soccer playing animation that looks bad especially when framing it at a distance but overall, the animation was beautiful. It’s not over the top but not too simple. Something very interesting about the openings in particular is that the music while very catchy and probably one of the few anime series that I took the time to listen to each episode was the animation. The opening was made up of clips and scenes from the actual anime itself which is simple but none the less beautiful than a fancy over the top OP that you tend to typically see.\\n\\n\r\nOne key point for me in this series was, that we have a disabled person in the anime! In all the anime that I have come across, there has been either little to no representation of disabled people. EVER! That to me gives this story a great plus as it shows a more diverse cast of characters.\\n\\n\r\nI have to talk about this because managers in sports anime, are useless side characters that do very little for the main plot. Until Ubukata. She is a powerhouse all her own. There are actual episodes dedicated to her character development. The freakan managers for crying out loud!!!!! She doesn’t start off as a manager but as she gets to know Tsukamoto who she originally discourages from trying to learn soccer, she starts to respect him and in my humble opinion becomes his number one fangirl. I honestly think she is falling in love with him. Who wouldn’t? He is so cute with his rosy cheeks. \\n\\n\r\nI admire this being one of the few series that makes a realistic female character who isn’t madly in love with the protagonist to the point that, that’s all her character is about. Her feelings for Tsukamoto are just one aspect too her character.\\n\\n",
            "date": "2016-12-17T17:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 235685,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3164339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/I_Love_Pikachu",
                "username": "I_Love_Pikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=235685"
        },
        {
            "content": "If you are reading this, First don't judge the anime because he is always running and weak, but that is only at first he is weak at first  and i give it a chance and still watch it until the end he became skilled because of his own effort, I almost drop this anime because i hate it that he was so weak and coudn't do anything but to run, but then i realize that i can somehow relate this in reality.. many people gave up to their dream and this anime made me realize that everyone can become stronger, I almost drop itat first because his always running and running but then i think that everyone came from a beginner until they got better! This anime has a lesson, not to give up i really hope that the second season of this anime would much be greater!",
            "date": "2017-10-30T20:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 262159,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6695536.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/meiberuM",
                "username": "meiberuM"
            },
            "url": "https://myanimelist.net/reviews.php?id=262159"
        },
        {
            "content": "Great anime... I'm not a fan of sports anime except hajime no ippo and haikyuu but this one is crazy in storytelling and character development. Really liked and waiting for next episodes to come out.\r\nThe character really gives an awww and ewww feel. It really shows that every human has up and downs in their life. \r\nAt some place, the story seems cliche, but still has his own essence of presentation.\r\nI'm just curious to see how the character will develop from a newbie to pro. And how he is going to become someone like mizuki. It's a great anime to watch and i would recommendto give it a try",
            "date": "2018-04-13T08:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 277960,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5044795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/abyss_zoro",
                "username": "abyss_zoro"
            },
            "url": "https://myanimelist.net/reviews.php?id=277960"
        },
        {
            "content": "SPOILER FREE! (sorry, my English sucks)\r\nDAYS is the series where you can learn and feels how to be a champion from scratch. This series shows you the real life of being the beginner for a soccer player (don't highly expect like MC was a typical anime superhero- well, he's not). You can feel the pain of being lost and the joyful of the victory. You get nothing easily. Hardship, crying, tired, be a loser will drag down people, but Tsukamoto shows you everything he got. The friendship between them is really awesome. Who says the fantastic football club hates the loser? If you falls down,you'll fall together. if you climb, drag the weakest up together. \\n\r\nI heard many spoilers about this anime being so lame about the characters. But, I just give it a try without any expectation and yeah it sometimes pisses me off. But I learn so many things from this anime. NEVER GIVE UP is the key to the successful!\\n\r\nI regret nothing after watched this anime.",
            "date": "2018-01-25T10:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 269605,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6742126.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/arch_senpai",
                "username": "arch_senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=269605"
        },
        {
            "content": "This is the best football anime I've ever seen. Unlike the other captain's with their magic shots and legendary status which makes wonder how are they not the best in the world, Days is actually about football, tactics are emphasized during games by very good use of far cam, moves of the players are very good, and the super duper stuff players do is actually doable and a joy to watch imaging scoring a goal as such.\r\nthe characters psychology, their drivers and their attitudes are very well structured taking into consideration their positions which gets young footballers to reflect on their own weaknesses or gamein general. I'd definitely show this to young footballers as it would make it easier to get to them, tone their game and make them start think about their game from a young age.\\n\\n\r\nThis anime is also a joy to watch, the story line is quite good, people coming together and helping each other out, all good things to instill into people.\\n\\n\r\nIf you to watch the impossible to get a certain high this is not for you, if you actually understand and like football this is a must watch.",
            "date": "2017-09-22T08:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 258292,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KINJANO",
                "username": "KINJANO"
            },
            "url": "https://myanimelist.net/reviews.php?id=258292"
        },
        {
            "content": "Out of all the sports anime I have watched, I think this is one of the best that I enjoyed. The main character wasn't annoying like the others. He may have a lot of weakness but that doesn't make him a bad character or something. The other characters also did their best. Some of them may have irritated me but that was part of the storyline but not how they were created. I hope you get the point. \r\nI have watched a lot of sports anime and I actually have standards for it. Some sports anime - well, okay - most them are outof the world or too great for their character. For example, a beginner suddenly good at it which is actually confusing. But in this anime, they showed the result of the hard work that the MC did. That's what I am looking for. There's actually anime that is just suddenly good without showing their training or something and it just confused the hell out of me and I think it doesn't just apply to me. He knows that he is the worst player in the group but he doesn't let his play be affected which is good. \\n\\n\r\nThe rest... I like the art and I enjoyed it. However, some parts are taking too long (Im not talking about the gameplays). I actually regretted watching it this early because I know the Season 2 will probably take a year or so and I've waiting for sequels for my whole life and it's actually annoying. \\n\\n\r\nI think this anime is scored 4 for a re-watch. It actually confused me that some gave low rating for this anime.",
            "date": "2017-04-04T03:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 244573,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4306771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/hoseokie",
                "username": "hoseokie"
            },
            "url": "https://myanimelist.net/reviews.php?id=244573"
        },
        {
            "content": "Days for me was a different anime. From the first 2 episodes I understand what that series is going for.The protagonist is not the best at nothing and he is trying his best but he can t compare with a lot of his friends like (Kazama, Mizuki),\r\nI liked that in this anime is not the type of anime where the protagonist does perfect at the correct time ( If you seen it you know what I mean)\r\nThe characters where great and are not filler episodes\r\nThe animation is not cute like other animes but is fitting the story.\r\nThe openings were great but the first ending wasbad not like the last one.\\n\r\nOverall is one of the best anime i ever seen",
            "date": "2018-04-12T00:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 277825,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7157176.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Francisc_",
                "username": "Francisc_"
            },
            "url": "https://myanimelist.net/reviews.php?id=277825"
        }
    ]
]