[
    [
        {
            "content": "You know, I've always loved boxing. Yet i never imagined that anime series about boxing could be much more interesting than the \"real thing\". Well, actually, It's not!\r\nIn this anime you don't just have pure fight, action non-stop. NO!\r\nYou get to know each one of the characters in the series. It's like you're one part of this anime. I don't know, I've never felt it before. The \"gang\"...It always looked like I am part of it, laughing and sorrowing with them. Watching them get beat up and yet stand again.\r\nI know this review sounds like shit, and there are 100% lot better reviews then this,but I'm sorry, i can't write review about this series and not get my emotions here. You know, reviews are about scores, studying all segments of series, but this anime HAS SOUL.\\n\r\nThe characters are so vivid, and real. You have so many different people here, each one better than another, all unique in some sort of way. It blows you off. It sucks you in.\\n\\n\r\nThis anime shows that there is no just \"brute force\" in boxing. Those boxers have something that keeps them on surface, not letting them sink. And it actually shows you that this is not impossible. This is not an anime about some superhero. You can be just one of these people. With your friends, your guts, your will, will of steel. It shows you that there is nothing, NOTHING more important, NOTHING more valuable than FRIENDSHIP. It seems stupid, but that's the thing that can push you up when you feel like dying.\\n\r\nAnd you know what? Forget crap like marks. I cannot grade it. It doesn't deserve any number.\\n\r\nBecause when you put one part of your soul in something, you cannot give it any limitations. \\n\r\nI started up, thinking this review is gonna be very short.  But... When you are touched by something, you just cannot stop. And now i'm feeling a bit lighter, because I've shared this with you. I don't care if this was helpful or not. When this anime ended, I've lost part of my soul with it, but yet i learned something that cannot be learned in any school.\\n\r\n-I've learned what is the thing that makes man GREAT.\\n\r\nSimple...\\n\r\nI will never forget about this one. Enjoy you guys...",
            "date": "2010-04-27T15:50:00+00:00",
            "helpful_count": 174,
            "mal_id": 25518,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291415.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IppoSRB",
                "username": "IppoSRB"
            },
            "url": "https://myanimelist.net/reviews.php?id=25518"
        },
        {
            "content": "To start things off, I can say is that it’s about damn time that a new anime installment of Hajime no Ippo came under way. Even though the first anime series was 70 plus episodes, I felt I didn’t get enough by the time I finished watching it. To me, Ippo vs Sendo 2 was actually the beginning!!! Since then, I decided to read the manga and currently up to date on it which is now nearly 90 volumes, and I’ll say I still haven’t gotten enough!!! But moving on, to a certain extent, New Challenger for what it covers is faithful to the mangaabout 85% of the time though a few things are omitted. For example in the Date/Martinez fight, Okita fought in the undercard in the manga, but for some reason they cut it out in the anime and yet, they dedicate half of an episode to recapping Ippo’s fight with Date in the first season when they could have done something more productive instead. And I can’t deny the cut of the Kamogawa and Nekota flashback story arc. I feel I can forgive that because I think it deserves it’s own OAV or TV movie, especially under Nishimura Satoshi’s direction (which I heard is now confirmed). But for those not familiar with the manga, the first season had some cuts as well such as Mike Tyson’s story inspiring Ippo to box and Aoki painting himself black to get Ippo ready for Jason Ozuma, so omissions in this version I find aren’t too surprising as well in retrospect, but I felt the omissions were still bad ideas since those scenes did contribute something to the establishment and progression of those sections of the stories.\\n\\n\r\nNext, I felt at times the pacing was unbalanced. Sometimes things were too fast due to those omissions, sometimes things were too slow just to concentrate on certain dialogs, and there are times it was just right. But I think they did the story arcs of the Martinez and Date fight and Ippo’s fight with Hammer Nao justice. In the end, rather than cutting out some parts of the manga and having been a little reliant on some unnecessary recaps, I give the story and characters.\\n\\n\r\nThe resolution and the depths to the color are a step up from the first installment. The art isn’t as sketchy looking with the bodies, but the designs are captured wel. The fights are also faithful to the manga, but at times, I did feel it did cut some corners which I felt wasn’t as abused in the first season. I thought the corner cutting and still shots were abused in the final fight a bit more, but really didn’t overall negate my enjoyment of the fight (though I'll admit I've conjured better quality fights playing the games). I felt anime wise, the Hawk and Takamura fight didn’t live up to how Ippo vs Sendo 2 played out for those reason since Ippo vs Sendo 2 didn’t really abuse it, and brought it’s own distinction from the manga fight. \\n\\n\r\nBut the action in general is still pretty awesome and I felt the anime captured the fighting styles of some of the characters very well, especially with Itagaki and Miyata. I felt the Martinez and Date fight was breathtaking and used very excellent angles in portraying Martinez’s brutal power and crisp technique. \\n\\n\r\nOne of my main concerns is that I did not like the color schemes for some of the characters. I have played all of the Hajime no Ippo games on PS2, PSP, PSOne Wii, and DS (yeah, laugh and point and call me a fan boy) and I liked some of the color schemes given to the characters in the games. I thought the color schemes for some of the characters such as Arnie’s red and black trunks and Itagaki’s brownish-redish trunks were pretty cool, reflected their personalities, and overall just seemed to fit. While in New Challenger, they are both given blue color schemes and I feel blue as the color of trunks is kind of an abused and redundant color in Hajime no Ippo. I thought the red with Arnie really reflected his aggressive style and blue tends to be a cliché symbol that you’re level headed, I just thought it didn’t feel right.\\n\\n\r\nBefore I get into the best quality of this season, I’ll take about the most controversial and that is the music. In addition to a new director, this anime has a new composer for the background music, Deathnote’s very own Hirano Yoshihisa. With the omission of Imahori Tsuneo’s acoustics and techno, Hirano implements his more grand orchestrated and piano style though at times he will use electric guitars but I’ll get into that a little later. If I were to put the controversy of this situation in a nutshell I would say that I have seen the protests and objections to Hirano’s style and the wanting of Imahori to return gone near the levels of the Ryan Drummond fans amongst the Sonic base. I’ll admit I was taken by surprise by the new style of music. At times it works and at other times, it totally misses. I’ll agree that Hirano’s composition isn’t as good as Imahori’s nor does it live up to how he made the Deathnote soundtrack, but I always believed in the saying if it isn’t broken, don’t fix it and I felt the BGM as a whole in Hajime no Ippo was kind of done here.\\n\\n\r\nThe worst quality of the music was when Nekota and the Kamogawa crew were crying during the Takamura and Hawk fight and it was playing this lame piano music that felt really stupid. The best parts are his uses of electric guitar that sound more like something out of punch out. But yeah, I do want Imahori Tsuneo back, and this situation now makes me sympathize with the Ryan Drummond fan boys. However, Hekireki and 8AM, the respective opening and ending themes I really like a lot though not as good as 360, Inner Light, or Yuuzora no Kamihikouki, but I think they capture the spirit of Hajime no Ippo very well. \\n\\n\r\nNow time to conclude this part with the voice acting which consists of Gundam and Metal Gear Solid alumnus alike. With the exception of Kobayashi Sanae reprising the role of Mashiba Kumi, the cast from the first season is back. And the voice actor who got me most was Sakaguchi Daisuke who debuted as Uso Evin in V Gundam as Hammer Nao. I felt without him, the character would fall apart. Despite how much his appearance changed from the last time we saw him, I always thought that he was still that insecure individual as portrayed in the original manga but thanks to Sakaguchi’s acting, it captures something beyond my expectations and made him more likable in comparison to how I saw him in the manga as more of an asshole. Now I want to talk about Kumi’s new voice actor Hirata Yuka. I thought she sounded too energetic and the pitch was too seductive for the character. I always thought of her as pretty much shy and her original seiyuu captured that. Hopefully they’ll bring her back in the next installment. Another actor I enjoyed was Sugahara Masashi as Martinez. Even though he doesn’t have many lines, he sounded very intimidating, charismatic and authoritive. In a way he felt like Ivan Drago from Rocky IV.  \\n\\n\r\nAnd I’ll admit I was surprised that Ohtsuka Akio, the voice of Batou from Ghost in the Shell, Gato from Gundam 0083, as well as Solid Snake, Solidus, and Naked Snake in the Metal Gear Solid franchise as Brian Hawk who is the anti-thesis of those characters who are disciplined and formal while Hawk is pretty much an American version of Takamura. I wasn’t sure how he’d pull it off considering my familiarity with his performances as those characters so I was paying attention to how he’d do it.  But after recently re-watching Rurouni Kenshin and seeing his performance as Jin-E, I felt he could do it. I think the performance that solidified him as Hawk was when he made his speech that he wanted to impregnate all the women in Japan. He was able to bring the charisma he had as those characters as Hawk in that scene, but in a comedic, disturbing, cynical and frightening fashion all at the same time. And in another scene I felt he had to define Hawk was when he meets his trainer in the flashback and asks for his license to kill and I thought he was able to bring Hawk’s qualities to life in that as well. Still, go on Anime News Network’s or this site's section on New Challenger and you’d be surprised how these voice actors have been in both Gundam and Metal Gear Solid franchises. \\n\\n\r\nThankfully they are making another installment according to Koyama Rikiya, the voice of Takamura. At first, I was pissed as fuck about the initial announcement of 26 episodes considering how much more manga material there is to cover, so I’m pretty excited since after this installment there are more of my personal favorite fights such as Ippo vs Sawamura and Miyata vs Medgoen Dachboy. In addition to pretty much seriously serialize the series, I want Nishimura and Imahori to come back.\\n",
            "date": "2009-07-19T08:56:00+00:00",
            "helpful_count": 61,
            "mal_id": 16943,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=16943"
        },
        {
            "content": "Okay if you are reading this it must mean you are watching or interested in watching this masterpiece. Hajime no ippo is truly the BEST SPORT ANIME EVER and i can say that for certain.The first season of hajime no ippo came out in 2000 and its still rank top 5 overall so the new season will be just as good or even better with almost every member of the previous season will be working in this anime so it will truly be something else. I can pretty much say for certain that this anime will blow every other anime away cuz you can't beippo and his crazy boxing skills.\\n\\n\r\n So a little about this anime it will continue from the previous season of ippo and will add lots of twist and turns like Takamura Mamoru will finally start to challenge the world of the middleweight champion of the world and Ippo will start to have some real challenge in defending his title of featherweight champion of JAPAN. FOR MORE INFO PLZ CONTACT ME ON MY PROFILE...",
            "date": "2009-01-22T15:33:00+00:00",
            "helpful_count": 38,
            "mal_id": 11767,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/132686.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mattx017",
                "username": "mattx017"
            },
            "url": "https://myanimelist.net/reviews.php?id=11767"
        },
        {
            "content": "Overview:\r\nTime to review something that actually DOESN'T suck! Hajime no Ippo is back with a vengeance!\r\nThe sequel to Hajime no Ippo continues the tale of Ippo's rise to the top of the boxing world. While the first Ippo series started as a coming of age story in which a bullied young man must learn to stand up for himself and achieve his dreams, the sequel starts right at the action and comes out swinging furiously. However, unlike the Rocky sequels, Ippo actually manages to keep the character development, pacing, and quality storytelling that made the first Ippo good. The opponents don't simply devolve into cartooncaricature bad guys that our hero must smash...well besides Bryan Hawk. At least Hawk is hilariously goofy and fun to hate though. Also his eyebrows are only rivaled by that guy in FLCL!\\n\\n\r\nWhile the first Ippo series boasted a wide cast of likeable characters, the second Ippo series manages to even better flesh out the side characters by giving them more of their own episodes. That means I get to see more of my man Takamura! The pompadour sporting badass who is so fucking manly he punches out a bear...then cries when he realized he orphaned the bear's cubs. The only character I missed in part 2 was Alexander Volg Zangief, because I love that dude and unfortunately he isn't in part 2.\\n\\n\r\nThe animation and technical aspects of the series are clearly improved since part 1. Ippo was already a good looking anime in part 1, but in part 2 the movement is even more fluid and this actually means something when you are talking about a sports anime. If an anime revolves around high stakes gambling and playing card games, you don't need to have the most fluid motion in the world. It doesn't make any impact on how enjoyable the show is. For example, Spice and Wolf the anime about trade and economics had horrible animation and it didn't matter at all. However, in a boxing anime this improved animation was perfect cherry on top of the ice cream.\\n\\n\r\nOne thing I love about the Ippo franchise is its ability to mix comedy, emotional moments, and pulse pounding action so seamlessly together. Very few anime are able to combine these elements together quite so perfectly. Hajime no Ippo isn't some highbrow attempt at being an artistic masterpiece, so don't go into it expecting Mushishi or Tatami Galaxy. However, it is a VERY fun to watch anime and overall very well made. I would recommend this anime highly to anyone even remotely interested in sports anime.",
            "date": "2015-04-06T16:58:00+00:00",
            "helpful_count": 32,
            "mal_id": 184980,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 9,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=184980"
        },
        {
            "content": "26/26 Episodes scene\r\nThe anime still has the same feeling it use to witch is good. \r\nIt continues right where it left off from the 2 movies and even fills you in a little on the movies just in case you missed them. As one of the best story lines in all anime there is not much more I need say about the story of the second series/ season its still just as great as the first one.\r\nArt I would give it an 8 out of 10 but since they improved noticablly from the first season I gave it a 9.  ... art is kindaa prefrence thing aswell as sound\\n\\n\r\nSound the sound for the anime has always been great and well fitting for the anime they even tossed in new artist for the hole series witch means they are not slacking and just trying to give the people season after season \"quality over quantity\" the new sound does the anime well and fits in just as good as the old one did.\\n\\n\r\nCharacter the development attitude and \"spirit\" is all still there its all still good just because its a new director or w/e does not mean they are changing the story from the manga and so far no big differences really. \\n\\n\r\nOver all enjoyment since its still one of my all time favorites from season 1 to season 2 I have a hard time trying to express a real review of it. \\n\\n\r\nMost people will love this anime if you can bare watching naruto bleach or any other cleshay anime like that this anime will not dissapoint \\n\\n\r\nIf you like the anime the manga is a little different feeling to it do to the ground not shakeing like in the sendo fight but its still good... its a really long manga so i wouldent be surprised to see a third season.\\n\\n",
            "date": "2009-02-13T22:57:00+00:00",
            "helpful_count": 32,
            "mal_id": 12414,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36425.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fate9999",
                "username": "Fate9999"
            },
            "url": "https://myanimelist.net/reviews.php?id=12414"
        },
        {
            "content": "Intro: \r\nHajime no Ippo:New Challenger continues the story of Hajime no Ippo. \r\nThis show did not start out unrealistic but has gotten pregressively extremly unrealistic as it has gone on to the point of being annoying.\r\nStory: 7/10\r\nUnfortunately this second season of Hajime no Ippo was considerably weaker compared to the first season, it was not as realistic as the previous nor as enjoyable and well thought as the previous. \r\nThis season should have been named Hajime no Takamura instead of Hajime no Ippo. It focused too much on the other characters instead of focusing on Ippo. I have no problem watching 5 episodes of Takamura’sor Date’s fights but give me at least one good fight of Ippo’s. This second season ended without even one good fight from Ippo but we did see an amazing fight from Takamura. \\n\r\nIppo’s fights have become predictable and boring, following the same old pattern: Ippo gets owned> Ippo makes a good comeback> Opponent makes a comeback> Eyes glow green> Ippo defeats the opponent with his boring Dempsey Roll.\\n\\n\r\nCharacters: 7/10\\n\r\nMost of the characters are just the way they were in the first season, no further development whatsoever. When the first season ended I hoped they would further develop Ippo’s character during season 2 but nothing of that sort ever happened. I was hoping Ippo would act and behave like a pro boxer and the champion in the ring but he is still acting like a rookie, getting beat up by guys with far less experience, skills or power. In the real world, because of the way Ippo fights and the ammount of damage he receives, he would retire by the time he is 23 due to severe brain damage. , Not further developing Ippo’s character was one of the biggest mistakes and dissapointments.\\n\\n\r\nAnimation: 8/10\\n\r\nThe animation is fluid, the fight scenes are well coreographed but I feel that the original, old art was more well suited to the tone of the show.\\n\\n\r\nSound: 8/10\\n\r\nGreat opening theme, decent ending theme, nice background music but the voice of the match commentator was very annoying.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI didn’t enjoy this season very much, it is not a bad season in any way, just weaker compared to the 1st season.\\n\\n\r\nOverall: 7/10\\n\r\nThis season was nowhere close to the original, it just felt like a sad shadow of what 1st season of Hajime no Ippo was, I still recommend this series to anyone.",
            "date": "2017-02-01T08:40:00+00:00",
            "helpful_count": 14,
            "mal_id": 239652,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cinefil_original",
                "username": "Cinefil_original"
            },
            "url": "https://myanimelist.net/reviews.php?id=239652"
        },
        {
            "content": "Story: 9/10\r\nAs usual, Hajime no Ippo steps up with the excellent story telling. There is not much of Ippo actually fighting in here, which came as somewhat of a disappointment to me, but we get more in depth stories and back stories to supporting characters. And, there are some cameos from characters that we barely got to see, so that is nice. I felt like there was a little bit more focus on the matches/side characters this series around rather than the outside life, or the training, which the first season had a lot of montages of. While the lessons and values of Hajime noIppo are kind of repetitive, they do have a lot of meaning and are good things to be learned by anyone.\\n\\n\r\nThese aren't all the fights, but they are the major ones.--->\\n\\n\r\n> Miyata Ichiro vs Arnie \"Crocodile\"  Gregory for the OPBF Championship\\n\r\nWe get to see a worthwhile fight from Miyata spirit wise. They introduced this shady coach who I hate the guts of, and from the sounds of it, it seems like he'll be a semi-recurring character. Not hopeful.\\n\\n\r\n> Date Eiji vs Ricardo Martinez for the WBA Feather Weight Championship\\n\r\nFinally, Date gets a world championship revenge match against the man who defeated him seven years ago. We also get to learn a bit more in depth about him, his past, and his reason for boxing. It was pretty good.\\n\\n\r\n> Ippo Makunouchi vs Hammer Nao for the Japan Feather Weight Championship\\n\r\nWe finally get a reappearance from someone who used to appear a lot. I won't say who it is, because then I'll spoil it. This match was a sweet one. By sweet, I mean both \"touching\" (in a heartfelt way) and \"aww shit yeah.\" If you watch it, you'll get what I mean.\\n\\n\r\n> Takamura Mamoru vs Brian Hawk for the WBC Junior Middleweight Championship\\n\r\nThis match was BEAST. A definitely must watch for any Ippo fans. Brian Hawk was a bastard but he puts up a good fight. We finally get to see the mysterious Takamura's full potential, and find a bit about his past and family situation. The only problem I had with it was \"that joke\". Takamura, you shame of Japan! I felt like they went a little too far with that one. It made him hit a little too close to Brian's level of humanity.\\n\\n\r\nArt: 8/10\\n\r\nIn the beginning I wasn't really used to it, but as it went on it got better. The matches flowed more smoothly with more dynamic scenes, and were paced much better than in the beginning, which is a shame because they started off with some really big, interesting matches. I felt like it got better around Hammer Nao though. \\n\\n\r\nSound: 8/10\\n\r\nAs I imagine Hajime no Ippo to capture \"manliness\" you can imagine my disappointment when I heard the BGM and there were a lot of classic styled music. Little to none rock/guitar/synth music like the first season, whose sound track I loved. However, as the story progressed, I could see that it focused more on the Championships. The \"Kings\" you could say. Taking that in mind, the music does fit better, as it's more noble, dignified and refined than the first seasons, which was more rough, and high-strung. The BGM does get better as time goes on though.\\n\\n\r\nAlthough most of the original cast reappears, Kumi's voice does change, which was kind of off putting. Other than that, its the same cast, so no complaints.\\n\\n\r\nThe OP song is one of my favorites though, which is good since the vids took forever to load so 90% of the time I had to watch through the OP.\\n\\n\r\nCharacter: 9/10\\n\r\nEveryone in the anime gets some development, and that really makes me happy. Ippo grows stronger as he begins to realize more and more what it means to be a champion and how he can fulfill that role, Takamura's mysterious past is unraveled, and we get to see him in a better light, Coach... Well, he realizes that there is still much for him to learn and do to become a better coach. Aoki and Kimura's are kind of non-existent, but if you want to see them develop then you should watch the Kimura vs Mashiba OVA. The others you'll just have to watch to find out.\\n\\n\r\nEven though there's a huge cast, they all have depth, even if it's just to a certain point. It's pretty impressive, and they're all well done as well. While I do wish that more forgotten characters would reappear and get some spotlight (like Vorg or Hayami or Jason etc) I do understand that there probably isn't any time for that.\\n\\n\r\nEnjoyment: 9/10\\n\r\nOverall: 9/10\\n\r\nAlthough I was a bit iffy at first, Hajime no Ippo New Challenger is a great second series. It started off shaky but ended on a good note. If you feel like me when I first started it, just tell yourself to be like Ippo and them and tough it out! You'll see the light at the end of the tunnel.",
            "date": "2013-10-27T06:33:00+00:00",
            "helpful_count": 13,
            "mal_id": 118449,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123379.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/arashi-chan12",
                "username": "arashi-chan12"
            },
            "url": "https://myanimelist.net/reviews.php?id=118449"
        },
        {
            "content": "It's heartbreaking to see one of your favorite anime series end, so you can guess why I was so happy to hear that there was a sequel to Hajime no Ippo. I wasn't disappointed. New Challenger lived up, and passed, everything it should be. From the side splitting comedy, to the heartwarming matches; you'll never be let down. What New Challenger lacks in length, it makes up in perfection. You'll laugh, you'll cry, and then you'll laugh until you cry. You won't be able to pull away until the end. Yes, I was sad when I realized that New Challenger was only 26 episodes, butno, I was not disappointed. It ended right when it needed to, even if it was heartbreaking and I want to say it was too soon, but only because I love the series so much.I'm kind of hoping and praying here, but I really think they should make a 3rd installment to the series. I'm sure every other Ippo fan agrees that it would be fun to see his ride to fame and see him take the belt for Date. But that's not what we're here for. We're here for a review!\\n\\n\r\nI'm going to start with the \"enjoyment\" department, because this was truly the greatest aspect of Hajime no Ippo. Yes, the story line was amazing, and yes, the characters were outstanding. But I honestly believe the pure enjoyment you can get out of this series is the strong point in hajime no Ippo. New Challenger, no, the whole Ippo series in general, is one of few animes where I can truly say I was never bored. Never. Not once. I watched it from start to finnish within two days straight. You will never, ever, EVER, get bored of this anime. From the rich comedy that will make yours sides split, to the desperate fights, you won't want to put this down, not even for a moment.\\n\\n\r\nI'm not going to spend much time on the art because I didn't notice anything wrong. It got better from Hajime no Ippo to New Challenger, and to be honest I would have been dissapointed if it hadn't. Same thing with the sound. Seemed good nothing to be done here.\\n\\n\r\nOf course, the characters were just awesome. You have the same characters in the first installment, yet you get more depth with some of the characters. You start to understand Takamura more, which is just awesome. Because, let's be honest, who doesn't love Takamura? He's like the bad ass of all Bad asses. You also get to see a little more dealing with Date which helps you get more emotion when he passes on \"the baton\" to Ippo. Seriously, the characters were just as perfect as I expected. Maybe more?\\n\\n\r\nOverall... what could have been better? Funny, heartwarming, dramatic and if you squint you can see some romance happening with Ippo and Kumi. Maybe I would have liked to see Kumi and Ippo hook up, but hey, what can you do? I mean, yeah I suppose this was not a romance anime. And looking back on it, that might not have been a good idea. But yeah. I mean what can I say? Besides being what I felt was a little short, this anime was just awesome.",
            "date": "2012-08-14T10:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 69743,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1413119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kurasaina",
                "username": "kurasaina"
            },
            "url": "https://myanimelist.net/reviews.php?id=69743"
        },
        {
            "content": "When I wrote a review on the first season I was very glad to be able to write so many good things about it . All the expectations I had heading into the show were met . The 2nd season however didn't live up to my expectations at all .The show took away most of the things I loved about the first animated season . Let's take a look at the story first .While the first season had an amazing structure with builds and progress , this had little of that . I will deal with the progress issue in characters section but however letstalk about the pacing . The pacing was pretty inconsistent this season . The first few episodes hardly meant anything . Note that the series resumed after quite a few years and so they felt the need of putting way too many flashbacks . Hence the pacing wasn't good and the earlier episodes come of as pretty boring . The Date vs Martinez fight had little to offer as it was supposed to sell the spirit of Date and the skill of Martinez . It was supposed to be storytelling which we all knew was coming and did not draw out any excitement  . The matches in season 1 had the unpredictability factor sold and demonstrated how gaps in boxers aren't that big . This season had to tell a different story and due to the inconsistent pacing the show felt bland .The good thing about the plot is this is a Hajime no Ippo series and when a long running shounen earns our love , its not easy to lose that love .\\n\\n\r\nArt and Animation : Art is pretty good most of time . I did not like designs for a few characters such as kumi . But that is subjective . As expected modern animation gives this season a pretty good boost which it obviously needed . \\n\\n\r\nSound : I honestly felt like the soundtrack in season 1 played a huge role in selling multiple emotions , most notably the comedy .  While the show had its strong moments the lack of diversity in soundtrack is somewhat a lacking in this season . With that being said the opening and ending are good regardless .\\n\\n\r\nCharacters : The show focused pretty little on Ippo this season . His character appeared cringy in the beginning of the season where he was being presented as a fanboy of other boxers he fought . Thankfully they don't present him in a similar way in the latter episodes . Other characters were supposed to get more time to shine in this season with Takamura playing a big role . However the characters have very little progression in this season . We only get more details on character backgrounds rather than getting more character depth . We did not learn any new fighting styles , we did not get new emotions out of the sport of boxing , we did not get much change in characteristics for the majority of the characters . \\n\r\nWith that being said , the show introduced a good villain in Bryan Hawk who was pretty easy to hate . Itagaki adds to warm feeling providing kamogawa squad . Gero-Michi gets decent development although I personally wasn't a big fan of it .\\n\\n\r\nFights : This season doesn't do the best of jobs with the fights either . While the new animation helped , the intensity wasn't there . The storytelling was the focus which wasn't very interesting at any point other than maybe the Date-Martinez fight . Takamura vs Bryan Hawk was the attraction of the show which did pick up late in the season . However the tactical , realistic boxing from season 1 wasn't there for Takamura matches as they had to present him as superman and turn boxing into street fight .\\n\r\nWith that being said the story behind Hawk vs Takamura was very good . The hardships of weight management gets good exposure . So the show carries on with the good job it does with showing viewers how difficult the sport is .\\n\\n\r\nConclusion : While the season isn't as good as the first one , it brings back our favourite characters and moves their stories a step forward . The show had its vulgar comical moments and at times the cringy ones too . Which were tolerable because this is simply Hajime no Ippo . The show ends with promise as the story finally shifts focus to Ippo . The improved animation will be a huge boost for the casual audience . The show is still Hajime no Ippo and it is still enjoyable to those who loved season 1 .",
            "date": "2017-10-05T01:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 259747,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3996675.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shadmankc",
                "username": "Shadmankc"
            },
            "url": "https://myanimelist.net/reviews.php?id=259747"
        },
        {
            "content": "Hajime no Ippo: New Challenger Review\r\nStory (10/10) Outstanding  \r\nThe arcs that Hajime no Ippo: New Challenger covered in the 26 episodes it was given were outstanding. I can see why it was named \"New Challenger\" because literally almost if not every fight had to do with a Challenger going up against a title holding Champion and one would think that it would get repetitive when this is said but every single fight lives up to the build up of the setup and background story around each match arc just was well as the 75 episode season 1. \r\nArt and Animation (9/10) Great\r\nMore Specifically (9.75/10)Great+\\n\\n\r\nWith the previous season I feel having a having a bit better animation quality than this one and that one being far older than this one and almost 50 episodes longer, I would have assume that this one would have had a better animation but sadly i did not feel it it. Although it was great I did not feel it was outstanding like season 1 same thing can be said about art style. By the time I got to the final big fight of New Challenger I decided to read the manga as I watched the fight side by side and I was right. Although this may have been the case with the previous season it didn't bother me to the point where I wanted to pull up the manga and experience the fights side by side. And at first I just wanted to make sure it was being adapted well and it was but then the scenes that did have a bit of weird animation or sub-par art style I did realize that the manga did trump the anime in majority of those scenes. And I'm talking about scenes where it is a stand still shot of a punch someone may have done to their opponent so no animation behind it i felt those certain scenes could have been handled to a bit higher quality of art style since no animation is behind it and sometimes it was but about 45% of the time it was not and like I said I was reading the manga side by side and sadly I felt it wasn't done 100% justice. Now I know it may be a super nitpick and this may have been the case for the previous season like I stated before but once again like I said I felt certain scenes in both the animation and art style department was of a lower quality that I am used to from both Hajime No Ippo's previous animated season and movies and the animation studio Mad House themselves. Nonetheless I still this it's great, just not outstanding like I'm used to. \\n\\n\\n\r\nSound (10/10) Perfect\\n\\n\r\nEverything that had sound in Hajime no Ippo: New Challenger was perfect. All voice acting, background music and sound effects during punches and blows were spot on and is the reason why manga readers will go back and watch the anime since they can't get this in the manga.\\n\\n\\n\r\nCharacters (10/10) Outstanding\\n\\n\r\nAll the characters are outstanding, for a anime just about boxing we get so much great characterization and development before and even during the fights given to us in Hajime no Ippo: New Challenger. Whether it's Ippo himself or not I thought every fight challenger and champion was given good amount attention for me to care for both sides even if I may have hated one of the fighters they didn't feel like a uninteresting character, the only character during fights that you could debate that about is probably Ricardo Martinez since he barely showed any emotion and he barely got to see any background characterization about him but he served the purpose of being the representation of a character that is better than you simple as that which is realistic, sadly there's always someone better out there than you and that is was Ricardo represented so I can personally give him a pass for not showing too much character hopefully I see him in the future but I wouldn't be too mad if I didn't.\\n\\n\\n\r\nEnjoyment (10/10) Outstanding \\n\\n\r\nMy Enjoyment at the very start was great, I would say by the end I felt I was definitely satisfied with Hajime no Ippo: New Challenger and it definitely proved to me that my enjoyment for Hajime no Ippo wasn't just a one-hit-wonder.\\n\\n\\n\r\nOverall (9/10) Great \\n\r\nMore Specifically (9.95/10) Great+\\n\\n\r\nHajime no Ippo: New Challenger has proved that Hajime no Ippo is still my favorite sports anime/manga that I've experience yet. And before going into this season I knew that the manga has literally over 1000 chapters and in my head I told myself \"never will i ever read all of that\" and now by the time I picked up the manga just to read it while watching the final Takamura vs Hawk fight I thought to myself \"hmmm well after I finish Hajime no Ippo: Rising I can see myself reading it.. binge read!? probably not but I can see myself reading it in the future especailly if Mad House keeps playing around with us and not giving use another season for it I can definitely see myself in the distant future reading pass Rising. Anyway Hajime no Ippo: New Challenger is a fucking great season.",
            "date": "2017-05-07T12:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 247155,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=247155"
        },
        {
            "content": "Hajime no Ippo: New Challenger, ah this brings me back. Even though most people are probably reading this review after watching the first season, I still must address this note anyways. Yes this is about boxing, but it is about so much more than that. A love of boxing, or any sport for that matter, is not needed to enjoy this show. The Ippo anime will give you an entirely new view of boxing as a whole. I'm writing this review to try and convince at least someone to look past their anti-sport anime list to watch this. \r\nStory 10/10\r\nThe Hajime no Ippo: New Challengerstory has a different approach of other sports anime like Haikyu!! and Kuroko no Basket. The difference boxing has with volleyball and basketball is that boxing is not a team sport. The boxer has to fight for him and what he has to protect. That is why this is quite different from other sports anime. Makunouchi Ippo and the other main characters must fight their fights alone. The story of Hajime no Ippo is about a young man named Ippo and his endeavors to become the best boxer around. However, New Challenger doesn't only focus on Ippo. Many of the other main character have their own fights and their own struggles and that is why the story was so enjoyable. And of course there is also the comedy. Ippo's comedy is always top notch and this is easily one of the funniest animes to date.\\n\\n\r\nArt 9/10\\n\r\nNot really much to say for this except for the fact that it is different from the original series. The fight scenes are well done and thats all that one needs for this show.\\n\\n\r\nSound 10/10\\n\r\nHajime no Ippo: New Challenger has an entirely new soundtrack and it is AMAZING. They fit in extremely well with the fights, the comedy, and the training. Another part of the sound to praise is the opening. The opening is one of those openings where you just cant skip no matter how busy you are. It's THAT good. \\n\\n\r\nCharacter 10/10\\n\r\nIn my opinion,  characters are Hajime no Ippo's strong point. Obviously, there is our main character Ippo. Ippo has a very weird personally for a boxer. He is timid and shy. He even has trouble talking to the girl he likes. But this changes when he is in the ring. He becomes a fierce fighter and can take on anyone he sets his mind to. Another member of the kamogawa gym, Takamura Mamoru gets a lot  focus this season. Takamura is a wild beast. Yeah, that is the best way to describe him. He is a monster found in the streets  by Kamogawa and will take down any boxer in the whole word. The other members of the gym, Aoki and Kimura are also very awesome, but what I really love them for is how funny they are. Aoki is my king of comedy and I can't watch a scene with him without pissing myself laughing. The last character that needs focus in this series is Miyata. Miyata is Ippo's rival and has left the gym so he can fight Ippo eventually. Miyata has been struggling to get back in the ring and this series focuses a lot on Miyata's recovery. All these characters are extremely enjoyable and you just have to like em.\\n\\n\r\nEnjoyment 10/10\\n\r\nIppo is one of the most enjoyable anime I have ever watched. While watching it, I had to actually try to limit myself with the amount of episodes I watched so I could savor it. Ippo is the type of show to watch to put yourself in a good mood. The show just makes me happy.\\n\\n\r\nOverall 10/10\\n\r\nHaijime no Ippo: New Challenger, and its whole series, is a a gem among all anime. The story, the characters, the comedy, and of course, the boxing are taken to the next level in this anime. You'd actually have to be a fool to not check this out. Don't let the fact that it is a sports anime stop you from watching this. Most people who have watched this will say it with me, GO WATCH HAJIME NO IPPO.",
            "date": "2014-08-27T08:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 158099,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3333353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Celestrial2",
                "username": "Celestrial2"
            },
            "url": "https://myanimelist.net/reviews.php?id=158099"
        },
        {
            "content": "Story: 7/10\r\nHajime no Ippo: New Chalanger is alot better than S1. All fights had more Substance than any fight in S1. The fight between Date and ricardo was one of the best fights Hajime no Ippo had to offer together with Hawk vs Takamura.\r\nI love that besides our main character ippo every one gets to shine like Date, Aoki, Kimura, Itagaki and Takamura.\r\nCharacter: 8/10\r\nLike in S1 here in S2 the characters are all well written. I have lots of fun just watching their fights and their interactions.\r\nArt: 8/10\r\nThe art is alot better than S1. its more detailed and crisp. Some punches are visually amazing.\r\nSound: 7/10\r\nAlsothe OP and ED are very good and the ost is remarkably better than S1.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nS2 was so much more enjoyable than S1. The fights were alot better, ost was also better. All in all an improvement.\\n\\n\r\nOverall: 7.6=8/10",
            "date": "2019-01-13T11:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 298938,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4164337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sakis263",
                "username": "sakis263"
            },
            "url": "https://myanimelist.net/reviews.php?id=298938"
        },
        {
            "content": "For me Hajime no Ippo: New Challenger picks up pretty well from where it left off. I myself didn't feel like there was any hitches. It still had a lot of the important things the first series had for me.\r\nIn terms of the story it felt like Ippos kinda back-tracked a little bit, becoming a little more timid compared to how he left us at the end of the first series despite his accomplishments. That's not to say he went ALL THE WAY back to how he was in the very beginning. I'm not trying to say its bad or anything but really, it didn'tfeel like the same Machunouchi and it was a little unexpected. For me that goes throughout this installment of the show. He did take a back seat to some of the other characters this time around but still, it felt different.\\n\\n\r\nExpanding more on the story portion of this installment, I really really REALLY enjoyed the fact that this time around it wasn't all about Machunouchi. There was a lot of things happening all over the place for a few people this time around and a lot of it was enjoyable for me. Some of the stuff felt a little rushed but thats understandable because well... For one thing, this time around there was only 26 episodes, and not 75. Second is that a good portion of the \"meat and potatoes\" of a few of the fights we see this time around aren't even apart of the Kamogawa Boxing Gym so I understand that part of it. Although I do think they spent enough time building on those fights, especially the Date/Martinez fight. While the build for Date/Martinez was good I do wish they slowed the pace for the fight a little bit but that's just personal preference. They did it well for what they were trying to do in my eyes.\\n\\n\r\nFor me it was nice to see a little expansion on Takamura. He has always this super human of the show with a ego to match. This time around while his ego stayed where it was, we got to see him in a more \"human form\". I mean that in the aspects of the intense weight management he has to do before fights. This is actually the fist time we get a real look at what he has to deal with. Also this time around he doesn't just get in the ring and leave without breaking a sweat. His ego is untouched through it all though and that leaves to some unexpected comedy at times. I personally liked the aspect of hsi last fight where the animal in him (As well as Hawk) came out and it wasn't just a boxing match anymore. I wasn't expecting something like that.\\n\\n\r\nI think this was a good continuation of the series overall. Sure it might have seemed a little rushed at times, might have not been as polished around the edges as could have been and it might have been missing some of the usual \"adult humor\" from the first installment but hey, I'd say they did a really good job of keeping a great thing going. To many times do we see something great diminish in quality by a good amount when going into a sequel and I can say personally they didn't let that happen here and I appreciate it.",
            "date": "2018-01-11T13:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 268218,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Tactician",
                "username": "Tactician"
            },
            "url": "https://myanimelist.net/reviews.php?id=268218"
        }
    ],
    [
        {
            "content": "You know, I've always loved boxing. Yet i never imagined that anime series about boxing could be much more interesting than the \"real thing\". Well, actually, It's not!\r\nIn this anime you don't just have pure fight, action non-stop. NO!\r\nYou get to know each one of the characters in the series. It's like you're one part of this anime. I don't know, I've never felt it before. The \"gang\"...It always looked like I am part of it, laughing and sorrowing with them. Watching them get beat up and yet stand again.\r\nI know this review sounds like shit, and there are 100% lot better reviews then this,but I'm sorry, i can't write review about this series and not get my emotions here. You know, reviews are about scores, studying all segments of series, but this anime HAS SOUL.\\n\r\nThe characters are so vivid, and real. You have so many different people here, each one better than another, all unique in some sort of way. It blows you off. It sucks you in.\\n\\n\r\nThis anime shows that there is no just \"brute force\" in boxing. Those boxers have something that keeps them on surface, not letting them sink. And it actually shows you that this is not impossible. This is not an anime about some superhero. You can be just one of these people. With your friends, your guts, your will, will of steel. It shows you that there is nothing, NOTHING more important, NOTHING more valuable than FRIENDSHIP. It seems stupid, but that's the thing that can push you up when you feel like dying.\\n\r\nAnd you know what? Forget crap like marks. I cannot grade it. It doesn't deserve any number.\\n\r\nBecause when you put one part of your soul in something, you cannot give it any limitations. \\n\r\nI started up, thinking this review is gonna be very short.  But... When you are touched by something, you just cannot stop. And now i'm feeling a bit lighter, because I've shared this with you. I don't care if this was helpful or not. When this anime ended, I've lost part of my soul with it, but yet i learned something that cannot be learned in any school.\\n\r\n-I've learned what is the thing that makes man GREAT.\\n\r\nSimple...\\n\r\nI will never forget about this one. Enjoy you guys...",
            "date": "2010-04-27T15:50:00+00:00",
            "helpful_count": 174,
            "mal_id": 25518,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291415.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IppoSRB",
                "username": "IppoSRB"
            },
            "url": "https://myanimelist.net/reviews.php?id=25518"
        },
        {
            "content": "To start things off, I can say is that it’s about damn time that a new anime installment of Hajime no Ippo came under way. Even though the first anime series was 70 plus episodes, I felt I didn’t get enough by the time I finished watching it. To me, Ippo vs Sendo 2 was actually the beginning!!! Since then, I decided to read the manga and currently up to date on it which is now nearly 90 volumes, and I’ll say I still haven’t gotten enough!!! But moving on, to a certain extent, New Challenger for what it covers is faithful to the mangaabout 85% of the time though a few things are omitted. For example in the Date/Martinez fight, Okita fought in the undercard in the manga, but for some reason they cut it out in the anime and yet, they dedicate half of an episode to recapping Ippo’s fight with Date in the first season when they could have done something more productive instead. And I can’t deny the cut of the Kamogawa and Nekota flashback story arc. I feel I can forgive that because I think it deserves it’s own OAV or TV movie, especially under Nishimura Satoshi’s direction (which I heard is now confirmed). But for those not familiar with the manga, the first season had some cuts as well such as Mike Tyson’s story inspiring Ippo to box and Aoki painting himself black to get Ippo ready for Jason Ozuma, so omissions in this version I find aren’t too surprising as well in retrospect, but I felt the omissions were still bad ideas since those scenes did contribute something to the establishment and progression of those sections of the stories.\\n\\n\r\nNext, I felt at times the pacing was unbalanced. Sometimes things were too fast due to those omissions, sometimes things were too slow just to concentrate on certain dialogs, and there are times it was just right. But I think they did the story arcs of the Martinez and Date fight and Ippo’s fight with Hammer Nao justice. In the end, rather than cutting out some parts of the manga and having been a little reliant on some unnecessary recaps, I give the story and characters.\\n\\n\r\nThe resolution and the depths to the color are a step up from the first installment. The art isn’t as sketchy looking with the bodies, but the designs are captured wel. The fights are also faithful to the manga, but at times, I did feel it did cut some corners which I felt wasn’t as abused in the first season. I thought the corner cutting and still shots were abused in the final fight a bit more, but really didn’t overall negate my enjoyment of the fight (though I'll admit I've conjured better quality fights playing the games). I felt anime wise, the Hawk and Takamura fight didn’t live up to how Ippo vs Sendo 2 played out for those reason since Ippo vs Sendo 2 didn’t really abuse it, and brought it’s own distinction from the manga fight. \\n\\n\r\nBut the action in general is still pretty awesome and I felt the anime captured the fighting styles of some of the characters very well, especially with Itagaki and Miyata. I felt the Martinez and Date fight was breathtaking and used very excellent angles in portraying Martinez’s brutal power and crisp technique. \\n\\n\r\nOne of my main concerns is that I did not like the color schemes for some of the characters. I have played all of the Hajime no Ippo games on PS2, PSP, PSOne Wii, and DS (yeah, laugh and point and call me a fan boy) and I liked some of the color schemes given to the characters in the games. I thought the color schemes for some of the characters such as Arnie’s red and black trunks and Itagaki’s brownish-redish trunks were pretty cool, reflected their personalities, and overall just seemed to fit. While in New Challenger, they are both given blue color schemes and I feel blue as the color of trunks is kind of an abused and redundant color in Hajime no Ippo. I thought the red with Arnie really reflected his aggressive style and blue tends to be a cliché symbol that you’re level headed, I just thought it didn’t feel right.\\n\\n\r\nBefore I get into the best quality of this season, I’ll take about the most controversial and that is the music. In addition to a new director, this anime has a new composer for the background music, Deathnote’s very own Hirano Yoshihisa. With the omission of Imahori Tsuneo’s acoustics and techno, Hirano implements his more grand orchestrated and piano style though at times he will use electric guitars but I’ll get into that a little later. If I were to put the controversy of this situation in a nutshell I would say that I have seen the protests and objections to Hirano’s style and the wanting of Imahori to return gone near the levels of the Ryan Drummond fans amongst the Sonic base. I’ll admit I was taken by surprise by the new style of music. At times it works and at other times, it totally misses. I’ll agree that Hirano’s composition isn’t as good as Imahori’s nor does it live up to how he made the Deathnote soundtrack, but I always believed in the saying if it isn’t broken, don’t fix it and I felt the BGM as a whole in Hajime no Ippo was kind of done here.\\n\\n\r\nThe worst quality of the music was when Nekota and the Kamogawa crew were crying during the Takamura and Hawk fight and it was playing this lame piano music that felt really stupid. The best parts are his uses of electric guitar that sound more like something out of punch out. But yeah, I do want Imahori Tsuneo back, and this situation now makes me sympathize with the Ryan Drummond fan boys. However, Hekireki and 8AM, the respective opening and ending themes I really like a lot though not as good as 360, Inner Light, or Yuuzora no Kamihikouki, but I think they capture the spirit of Hajime no Ippo very well. \\n\\n\r\nNow time to conclude this part with the voice acting which consists of Gundam and Metal Gear Solid alumnus alike. With the exception of Kobayashi Sanae reprising the role of Mashiba Kumi, the cast from the first season is back. And the voice actor who got me most was Sakaguchi Daisuke who debuted as Uso Evin in V Gundam as Hammer Nao. I felt without him, the character would fall apart. Despite how much his appearance changed from the last time we saw him, I always thought that he was still that insecure individual as portrayed in the original manga but thanks to Sakaguchi’s acting, it captures something beyond my expectations and made him more likable in comparison to how I saw him in the manga as more of an asshole. Now I want to talk about Kumi’s new voice actor Hirata Yuka. I thought she sounded too energetic and the pitch was too seductive for the character. I always thought of her as pretty much shy and her original seiyuu captured that. Hopefully they’ll bring her back in the next installment. Another actor I enjoyed was Sugahara Masashi as Martinez. Even though he doesn’t have many lines, he sounded very intimidating, charismatic and authoritive. In a way he felt like Ivan Drago from Rocky IV.  \\n\\n\r\nAnd I’ll admit I was surprised that Ohtsuka Akio, the voice of Batou from Ghost in the Shell, Gato from Gundam 0083, as well as Solid Snake, Solidus, and Naked Snake in the Metal Gear Solid franchise as Brian Hawk who is the anti-thesis of those characters who are disciplined and formal while Hawk is pretty much an American version of Takamura. I wasn’t sure how he’d pull it off considering my familiarity with his performances as those characters so I was paying attention to how he’d do it.  But after recently re-watching Rurouni Kenshin and seeing his performance as Jin-E, I felt he could do it. I think the performance that solidified him as Hawk was when he made his speech that he wanted to impregnate all the women in Japan. He was able to bring the charisma he had as those characters as Hawk in that scene, but in a comedic, disturbing, cynical and frightening fashion all at the same time. And in another scene I felt he had to define Hawk was when he meets his trainer in the flashback and asks for his license to kill and I thought he was able to bring Hawk’s qualities to life in that as well. Still, go on Anime News Network’s or this site's section on New Challenger and you’d be surprised how these voice actors have been in both Gundam and Metal Gear Solid franchises. \\n\\n\r\nThankfully they are making another installment according to Koyama Rikiya, the voice of Takamura. At first, I was pissed as fuck about the initial announcement of 26 episodes considering how much more manga material there is to cover, so I’m pretty excited since after this installment there are more of my personal favorite fights such as Ippo vs Sawamura and Miyata vs Medgoen Dachboy. In addition to pretty much seriously serialize the series, I want Nishimura and Imahori to come back.\\n",
            "date": "2009-07-19T08:56:00+00:00",
            "helpful_count": 61,
            "mal_id": 16943,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=16943"
        },
        {
            "content": "Okay if you are reading this it must mean you are watching or interested in watching this masterpiece. Hajime no ippo is truly the BEST SPORT ANIME EVER and i can say that for certain.The first season of hajime no ippo came out in 2000 and its still rank top 5 overall so the new season will be just as good or even better with almost every member of the previous season will be working in this anime so it will truly be something else. I can pretty much say for certain that this anime will blow every other anime away cuz you can't beippo and his crazy boxing skills.\\n\\n\r\n So a little about this anime it will continue from the previous season of ippo and will add lots of twist and turns like Takamura Mamoru will finally start to challenge the world of the middleweight champion of the world and Ippo will start to have some real challenge in defending his title of featherweight champion of JAPAN. FOR MORE INFO PLZ CONTACT ME ON MY PROFILE...",
            "date": "2009-01-22T15:33:00+00:00",
            "helpful_count": 38,
            "mal_id": 11767,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/132686.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mattx017",
                "username": "mattx017"
            },
            "url": "https://myanimelist.net/reviews.php?id=11767"
        },
        {
            "content": "Overview:\r\nTime to review something that actually DOESN'T suck! Hajime no Ippo is back with a vengeance!\r\nThe sequel to Hajime no Ippo continues the tale of Ippo's rise to the top of the boxing world. While the first Ippo series started as a coming of age story in which a bullied young man must learn to stand up for himself and achieve his dreams, the sequel starts right at the action and comes out swinging furiously. However, unlike the Rocky sequels, Ippo actually manages to keep the character development, pacing, and quality storytelling that made the first Ippo good. The opponents don't simply devolve into cartooncaricature bad guys that our hero must smash...well besides Bryan Hawk. At least Hawk is hilariously goofy and fun to hate though. Also his eyebrows are only rivaled by that guy in FLCL!\\n\\n\r\nWhile the first Ippo series boasted a wide cast of likeable characters, the second Ippo series manages to even better flesh out the side characters by giving them more of their own episodes. That means I get to see more of my man Takamura! The pompadour sporting badass who is so fucking manly he punches out a bear...then cries when he realized he orphaned the bear's cubs. The only character I missed in part 2 was Alexander Volg Zangief, because I love that dude and unfortunately he isn't in part 2.\\n\\n\r\nThe animation and technical aspects of the series are clearly improved since part 1. Ippo was already a good looking anime in part 1, but in part 2 the movement is even more fluid and this actually means something when you are talking about a sports anime. If an anime revolves around high stakes gambling and playing card games, you don't need to have the most fluid motion in the world. It doesn't make any impact on how enjoyable the show is. For example, Spice and Wolf the anime about trade and economics had horrible animation and it didn't matter at all. However, in a boxing anime this improved animation was perfect cherry on top of the ice cream.\\n\\n\r\nOne thing I love about the Ippo franchise is its ability to mix comedy, emotional moments, and pulse pounding action so seamlessly together. Very few anime are able to combine these elements together quite so perfectly. Hajime no Ippo isn't some highbrow attempt at being an artistic masterpiece, so don't go into it expecting Mushishi or Tatami Galaxy. However, it is a VERY fun to watch anime and overall very well made. I would recommend this anime highly to anyone even remotely interested in sports anime.",
            "date": "2015-04-06T16:58:00+00:00",
            "helpful_count": 32,
            "mal_id": 184980,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 9,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=184980"
        },
        {
            "content": "26/26 Episodes scene\r\nThe anime still has the same feeling it use to witch is good. \r\nIt continues right where it left off from the 2 movies and even fills you in a little on the movies just in case you missed them. As one of the best story lines in all anime there is not much more I need say about the story of the second series/ season its still just as great as the first one.\r\nArt I would give it an 8 out of 10 but since they improved noticablly from the first season I gave it a 9.  ... art is kindaa prefrence thing aswell as sound\\n\\n\r\nSound the sound for the anime has always been great and well fitting for the anime they even tossed in new artist for the hole series witch means they are not slacking and just trying to give the people season after season \"quality over quantity\" the new sound does the anime well and fits in just as good as the old one did.\\n\\n\r\nCharacter the development attitude and \"spirit\" is all still there its all still good just because its a new director or w/e does not mean they are changing the story from the manga and so far no big differences really. \\n\\n\r\nOver all enjoyment since its still one of my all time favorites from season 1 to season 2 I have a hard time trying to express a real review of it. \\n\\n\r\nMost people will love this anime if you can bare watching naruto bleach or any other cleshay anime like that this anime will not dissapoint \\n\\n\r\nIf you like the anime the manga is a little different feeling to it do to the ground not shakeing like in the sendo fight but its still good... its a really long manga so i wouldent be surprised to see a third season.\\n\\n",
            "date": "2009-02-13T22:57:00+00:00",
            "helpful_count": 32,
            "mal_id": 12414,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36425.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fate9999",
                "username": "Fate9999"
            },
            "url": "https://myanimelist.net/reviews.php?id=12414"
        },
        {
            "content": "Intro: \r\nHajime no Ippo:New Challenger continues the story of Hajime no Ippo. \r\nThis show did not start out unrealistic but has gotten pregressively extremly unrealistic as it has gone on to the point of being annoying.\r\nStory: 7/10\r\nUnfortunately this second season of Hajime no Ippo was considerably weaker compared to the first season, it was not as realistic as the previous nor as enjoyable and well thought as the previous. \r\nThis season should have been named Hajime no Takamura instead of Hajime no Ippo. It focused too much on the other characters instead of focusing on Ippo. I have no problem watching 5 episodes of Takamura’sor Date’s fights but give me at least one good fight of Ippo’s. This second season ended without even one good fight from Ippo but we did see an amazing fight from Takamura. \\n\r\nIppo’s fights have become predictable and boring, following the same old pattern: Ippo gets owned> Ippo makes a good comeback> Opponent makes a comeback> Eyes glow green> Ippo defeats the opponent with his boring Dempsey Roll.\\n\\n\r\nCharacters: 7/10\\n\r\nMost of the characters are just the way they were in the first season, no further development whatsoever. When the first season ended I hoped they would further develop Ippo’s character during season 2 but nothing of that sort ever happened. I was hoping Ippo would act and behave like a pro boxer and the champion in the ring but he is still acting like a rookie, getting beat up by guys with far less experience, skills or power. In the real world, because of the way Ippo fights and the ammount of damage he receives, he would retire by the time he is 23 due to severe brain damage. , Not further developing Ippo’s character was one of the biggest mistakes and dissapointments.\\n\\n\r\nAnimation: 8/10\\n\r\nThe animation is fluid, the fight scenes are well coreographed but I feel that the original, old art was more well suited to the tone of the show.\\n\\n\r\nSound: 8/10\\n\r\nGreat opening theme, decent ending theme, nice background music but the voice of the match commentator was very annoying.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI didn’t enjoy this season very much, it is not a bad season in any way, just weaker compared to the 1st season.\\n\\n\r\nOverall: 7/10\\n\r\nThis season was nowhere close to the original, it just felt like a sad shadow of what 1st season of Hajime no Ippo was, I still recommend this series to anyone.",
            "date": "2017-02-01T08:40:00+00:00",
            "helpful_count": 14,
            "mal_id": 239652,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cinefil_original",
                "username": "Cinefil_original"
            },
            "url": "https://myanimelist.net/reviews.php?id=239652"
        },
        {
            "content": "Story: 9/10\r\nAs usual, Hajime no Ippo steps up with the excellent story telling. There is not much of Ippo actually fighting in here, which came as somewhat of a disappointment to me, but we get more in depth stories and back stories to supporting characters. And, there are some cameos from characters that we barely got to see, so that is nice. I felt like there was a little bit more focus on the matches/side characters this series around rather than the outside life, or the training, which the first season had a lot of montages of. While the lessons and values of Hajime noIppo are kind of repetitive, they do have a lot of meaning and are good things to be learned by anyone.\\n\\n\r\nThese aren't all the fights, but they are the major ones.--->\\n\\n\r\n> Miyata Ichiro vs Arnie \"Crocodile\"  Gregory for the OPBF Championship\\n\r\nWe get to see a worthwhile fight from Miyata spirit wise. They introduced this shady coach who I hate the guts of, and from the sounds of it, it seems like he'll be a semi-recurring character. Not hopeful.\\n\\n\r\n> Date Eiji vs Ricardo Martinez for the WBA Feather Weight Championship\\n\r\nFinally, Date gets a world championship revenge match against the man who defeated him seven years ago. We also get to learn a bit more in depth about him, his past, and his reason for boxing. It was pretty good.\\n\\n\r\n> Ippo Makunouchi vs Hammer Nao for the Japan Feather Weight Championship\\n\r\nWe finally get a reappearance from someone who used to appear a lot. I won't say who it is, because then I'll spoil it. This match was a sweet one. By sweet, I mean both \"touching\" (in a heartfelt way) and \"aww shit yeah.\" If you watch it, you'll get what I mean.\\n\\n\r\n> Takamura Mamoru vs Brian Hawk for the WBC Junior Middleweight Championship\\n\r\nThis match was BEAST. A definitely must watch for any Ippo fans. Brian Hawk was a bastard but he puts up a good fight. We finally get to see the mysterious Takamura's full potential, and find a bit about his past and family situation. The only problem I had with it was \"that joke\". Takamura, you shame of Japan! I felt like they went a little too far with that one. It made him hit a little too close to Brian's level of humanity.\\n\\n\r\nArt: 8/10\\n\r\nIn the beginning I wasn't really used to it, but as it went on it got better. The matches flowed more smoothly with more dynamic scenes, and were paced much better than in the beginning, which is a shame because they started off with some really big, interesting matches. I felt like it got better around Hammer Nao though. \\n\\n\r\nSound: 8/10\\n\r\nAs I imagine Hajime no Ippo to capture \"manliness\" you can imagine my disappointment when I heard the BGM and there were a lot of classic styled music. Little to none rock/guitar/synth music like the first season, whose sound track I loved. However, as the story progressed, I could see that it focused more on the Championships. The \"Kings\" you could say. Taking that in mind, the music does fit better, as it's more noble, dignified and refined than the first seasons, which was more rough, and high-strung. The BGM does get better as time goes on though.\\n\\n\r\nAlthough most of the original cast reappears, Kumi's voice does change, which was kind of off putting. Other than that, its the same cast, so no complaints.\\n\\n\r\nThe OP song is one of my favorites though, which is good since the vids took forever to load so 90% of the time I had to watch through the OP.\\n\\n\r\nCharacter: 9/10\\n\r\nEveryone in the anime gets some development, and that really makes me happy. Ippo grows stronger as he begins to realize more and more what it means to be a champion and how he can fulfill that role, Takamura's mysterious past is unraveled, and we get to see him in a better light, Coach... Well, he realizes that there is still much for him to learn and do to become a better coach. Aoki and Kimura's are kind of non-existent, but if you want to see them develop then you should watch the Kimura vs Mashiba OVA. The others you'll just have to watch to find out.\\n\\n\r\nEven though there's a huge cast, they all have depth, even if it's just to a certain point. It's pretty impressive, and they're all well done as well. While I do wish that more forgotten characters would reappear and get some spotlight (like Vorg or Hayami or Jason etc) I do understand that there probably isn't any time for that.\\n\\n\r\nEnjoyment: 9/10\\n\r\nOverall: 9/10\\n\r\nAlthough I was a bit iffy at first, Hajime no Ippo New Challenger is a great second series. It started off shaky but ended on a good note. If you feel like me when I first started it, just tell yourself to be like Ippo and them and tough it out! You'll see the light at the end of the tunnel.",
            "date": "2013-10-27T06:33:00+00:00",
            "helpful_count": 13,
            "mal_id": 118449,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123379.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/arashi-chan12",
                "username": "arashi-chan12"
            },
            "url": "https://myanimelist.net/reviews.php?id=118449"
        },
        {
            "content": "It's heartbreaking to see one of your favorite anime series end, so you can guess why I was so happy to hear that there was a sequel to Hajime no Ippo. I wasn't disappointed. New Challenger lived up, and passed, everything it should be. From the side splitting comedy, to the heartwarming matches; you'll never be let down. What New Challenger lacks in length, it makes up in perfection. You'll laugh, you'll cry, and then you'll laugh until you cry. You won't be able to pull away until the end. Yes, I was sad when I realized that New Challenger was only 26 episodes, butno, I was not disappointed. It ended right when it needed to, even if it was heartbreaking and I want to say it was too soon, but only because I love the series so much.I'm kind of hoping and praying here, but I really think they should make a 3rd installment to the series. I'm sure every other Ippo fan agrees that it would be fun to see his ride to fame and see him take the belt for Date. But that's not what we're here for. We're here for a review!\\n\\n\r\nI'm going to start with the \"enjoyment\" department, because this was truly the greatest aspect of Hajime no Ippo. Yes, the story line was amazing, and yes, the characters were outstanding. But I honestly believe the pure enjoyment you can get out of this series is the strong point in hajime no Ippo. New Challenger, no, the whole Ippo series in general, is one of few animes where I can truly say I was never bored. Never. Not once. I watched it from start to finnish within two days straight. You will never, ever, EVER, get bored of this anime. From the rich comedy that will make yours sides split, to the desperate fights, you won't want to put this down, not even for a moment.\\n\\n\r\nI'm not going to spend much time on the art because I didn't notice anything wrong. It got better from Hajime no Ippo to New Challenger, and to be honest I would have been dissapointed if it hadn't. Same thing with the sound. Seemed good nothing to be done here.\\n\\n\r\nOf course, the characters were just awesome. You have the same characters in the first installment, yet you get more depth with some of the characters. You start to understand Takamura more, which is just awesome. Because, let's be honest, who doesn't love Takamura? He's like the bad ass of all Bad asses. You also get to see a little more dealing with Date which helps you get more emotion when he passes on \"the baton\" to Ippo. Seriously, the characters were just as perfect as I expected. Maybe more?\\n\\n\r\nOverall... what could have been better? Funny, heartwarming, dramatic and if you squint you can see some romance happening with Ippo and Kumi. Maybe I would have liked to see Kumi and Ippo hook up, but hey, what can you do? I mean, yeah I suppose this was not a romance anime. And looking back on it, that might not have been a good idea. But yeah. I mean what can I say? Besides being what I felt was a little short, this anime was just awesome.",
            "date": "2012-08-14T10:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 69743,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1413119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kurasaina",
                "username": "kurasaina"
            },
            "url": "https://myanimelist.net/reviews.php?id=69743"
        },
        {
            "content": "When I wrote a review on the first season I was very glad to be able to write so many good things about it . All the expectations I had heading into the show were met . The 2nd season however didn't live up to my expectations at all .The show took away most of the things I loved about the first animated season . Let's take a look at the story first .While the first season had an amazing structure with builds and progress , this had little of that . I will deal with the progress issue in characters section but however letstalk about the pacing . The pacing was pretty inconsistent this season . The first few episodes hardly meant anything . Note that the series resumed after quite a few years and so they felt the need of putting way too many flashbacks . Hence the pacing wasn't good and the earlier episodes come of as pretty boring . The Date vs Martinez fight had little to offer as it was supposed to sell the spirit of Date and the skill of Martinez . It was supposed to be storytelling which we all knew was coming and did not draw out any excitement  . The matches in season 1 had the unpredictability factor sold and demonstrated how gaps in boxers aren't that big . This season had to tell a different story and due to the inconsistent pacing the show felt bland .The good thing about the plot is this is a Hajime no Ippo series and when a long running shounen earns our love , its not easy to lose that love .\\n\\n\r\nArt and Animation : Art is pretty good most of time . I did not like designs for a few characters such as kumi . But that is subjective . As expected modern animation gives this season a pretty good boost which it obviously needed . \\n\\n\r\nSound : I honestly felt like the soundtrack in season 1 played a huge role in selling multiple emotions , most notably the comedy .  While the show had its strong moments the lack of diversity in soundtrack is somewhat a lacking in this season . With that being said the opening and ending are good regardless .\\n\\n\r\nCharacters : The show focused pretty little on Ippo this season . His character appeared cringy in the beginning of the season where he was being presented as a fanboy of other boxers he fought . Thankfully they don't present him in a similar way in the latter episodes . Other characters were supposed to get more time to shine in this season with Takamura playing a big role . However the characters have very little progression in this season . We only get more details on character backgrounds rather than getting more character depth . We did not learn any new fighting styles , we did not get new emotions out of the sport of boxing , we did not get much change in characteristics for the majority of the characters . \\n\r\nWith that being said , the show introduced a good villain in Bryan Hawk who was pretty easy to hate . Itagaki adds to warm feeling providing kamogawa squad . Gero-Michi gets decent development although I personally wasn't a big fan of it .\\n\\n\r\nFights : This season doesn't do the best of jobs with the fights either . While the new animation helped , the intensity wasn't there . The storytelling was the focus which wasn't very interesting at any point other than maybe the Date-Martinez fight . Takamura vs Bryan Hawk was the attraction of the show which did pick up late in the season . However the tactical , realistic boxing from season 1 wasn't there for Takamura matches as they had to present him as superman and turn boxing into street fight .\\n\r\nWith that being said the story behind Hawk vs Takamura was very good . The hardships of weight management gets good exposure . So the show carries on with the good job it does with showing viewers how difficult the sport is .\\n\\n\r\nConclusion : While the season isn't as good as the first one , it brings back our favourite characters and moves their stories a step forward . The show had its vulgar comical moments and at times the cringy ones too . Which were tolerable because this is simply Hajime no Ippo . The show ends with promise as the story finally shifts focus to Ippo . The improved animation will be a huge boost for the casual audience . The show is still Hajime no Ippo and it is still enjoyable to those who loved season 1 .",
            "date": "2017-10-05T01:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 259747,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3996675.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shadmankc",
                "username": "Shadmankc"
            },
            "url": "https://myanimelist.net/reviews.php?id=259747"
        },
        {
            "content": "Hajime no Ippo: New Challenger Review\r\nStory (10/10) Outstanding  \r\nThe arcs that Hajime no Ippo: New Challenger covered in the 26 episodes it was given were outstanding. I can see why it was named \"New Challenger\" because literally almost if not every fight had to do with a Challenger going up against a title holding Champion and one would think that it would get repetitive when this is said but every single fight lives up to the build up of the setup and background story around each match arc just was well as the 75 episode season 1. \r\nArt and Animation (9/10) Great\r\nMore Specifically (9.75/10)Great+\\n\\n\r\nWith the previous season I feel having a having a bit better animation quality than this one and that one being far older than this one and almost 50 episodes longer, I would have assume that this one would have had a better animation but sadly i did not feel it it. Although it was great I did not feel it was outstanding like season 1 same thing can be said about art style. By the time I got to the final big fight of New Challenger I decided to read the manga as I watched the fight side by side and I was right. Although this may have been the case with the previous season it didn't bother me to the point where I wanted to pull up the manga and experience the fights side by side. And at first I just wanted to make sure it was being adapted well and it was but then the scenes that did have a bit of weird animation or sub-par art style I did realize that the manga did trump the anime in majority of those scenes. And I'm talking about scenes where it is a stand still shot of a punch someone may have done to their opponent so no animation behind it i felt those certain scenes could have been handled to a bit higher quality of art style since no animation is behind it and sometimes it was but about 45% of the time it was not and like I said I was reading the manga side by side and sadly I felt it wasn't done 100% justice. Now I know it may be a super nitpick and this may have been the case for the previous season like I stated before but once again like I said I felt certain scenes in both the animation and art style department was of a lower quality that I am used to from both Hajime No Ippo's previous animated season and movies and the animation studio Mad House themselves. Nonetheless I still this it's great, just not outstanding like I'm used to. \\n\\n\\n\r\nSound (10/10) Perfect\\n\\n\r\nEverything that had sound in Hajime no Ippo: New Challenger was perfect. All voice acting, background music and sound effects during punches and blows were spot on and is the reason why manga readers will go back and watch the anime since they can't get this in the manga.\\n\\n\\n\r\nCharacters (10/10) Outstanding\\n\\n\r\nAll the characters are outstanding, for a anime just about boxing we get so much great characterization and development before and even during the fights given to us in Hajime no Ippo: New Challenger. Whether it's Ippo himself or not I thought every fight challenger and champion was given good amount attention for me to care for both sides even if I may have hated one of the fighters they didn't feel like a uninteresting character, the only character during fights that you could debate that about is probably Ricardo Martinez since he barely showed any emotion and he barely got to see any background characterization about him but he served the purpose of being the representation of a character that is better than you simple as that which is realistic, sadly there's always someone better out there than you and that is was Ricardo represented so I can personally give him a pass for not showing too much character hopefully I see him in the future but I wouldn't be too mad if I didn't.\\n\\n\\n\r\nEnjoyment (10/10) Outstanding \\n\\n\r\nMy Enjoyment at the very start was great, I would say by the end I felt I was definitely satisfied with Hajime no Ippo: New Challenger and it definitely proved to me that my enjoyment for Hajime no Ippo wasn't just a one-hit-wonder.\\n\\n\\n\r\nOverall (9/10) Great \\n\r\nMore Specifically (9.95/10) Great+\\n\\n\r\nHajime no Ippo: New Challenger has proved that Hajime no Ippo is still my favorite sports anime/manga that I've experience yet. And before going into this season I knew that the manga has literally over 1000 chapters and in my head I told myself \"never will i ever read all of that\" and now by the time I picked up the manga just to read it while watching the final Takamura vs Hawk fight I thought to myself \"hmmm well after I finish Hajime no Ippo: Rising I can see myself reading it.. binge read!? probably not but I can see myself reading it in the future especailly if Mad House keeps playing around with us and not giving use another season for it I can definitely see myself in the distant future reading pass Rising. Anyway Hajime no Ippo: New Challenger is a fucking great season.",
            "date": "2017-05-07T12:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 247155,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=247155"
        },
        {
            "content": "Hajime no Ippo: New Challenger, ah this brings me back. Even though most people are probably reading this review after watching the first season, I still must address this note anyways. Yes this is about boxing, but it is about so much more than that. A love of boxing, or any sport for that matter, is not needed to enjoy this show. The Ippo anime will give you an entirely new view of boxing as a whole. I'm writing this review to try and convince at least someone to look past their anti-sport anime list to watch this. \r\nStory 10/10\r\nThe Hajime no Ippo: New Challengerstory has a different approach of other sports anime like Haikyu!! and Kuroko no Basket. The difference boxing has with volleyball and basketball is that boxing is not a team sport. The boxer has to fight for him and what he has to protect. That is why this is quite different from other sports anime. Makunouchi Ippo and the other main characters must fight their fights alone. The story of Hajime no Ippo is about a young man named Ippo and his endeavors to become the best boxer around. However, New Challenger doesn't only focus on Ippo. Many of the other main character have their own fights and their own struggles and that is why the story was so enjoyable. And of course there is also the comedy. Ippo's comedy is always top notch and this is easily one of the funniest animes to date.\\n\\n\r\nArt 9/10\\n\r\nNot really much to say for this except for the fact that it is different from the original series. The fight scenes are well done and thats all that one needs for this show.\\n\\n\r\nSound 10/10\\n\r\nHajime no Ippo: New Challenger has an entirely new soundtrack and it is AMAZING. They fit in extremely well with the fights, the comedy, and the training. Another part of the sound to praise is the opening. The opening is one of those openings where you just cant skip no matter how busy you are. It's THAT good. \\n\\n\r\nCharacter 10/10\\n\r\nIn my opinion,  characters are Hajime no Ippo's strong point. Obviously, there is our main character Ippo. Ippo has a very weird personally for a boxer. He is timid and shy. He even has trouble talking to the girl he likes. But this changes when he is in the ring. He becomes a fierce fighter and can take on anyone he sets his mind to. Another member of the kamogawa gym, Takamura Mamoru gets a lot  focus this season. Takamura is a wild beast. Yeah, that is the best way to describe him. He is a monster found in the streets  by Kamogawa and will take down any boxer in the whole word. The other members of the gym, Aoki and Kimura are also very awesome, but what I really love them for is how funny they are. Aoki is my king of comedy and I can't watch a scene with him without pissing myself laughing. The last character that needs focus in this series is Miyata. Miyata is Ippo's rival and has left the gym so he can fight Ippo eventually. Miyata has been struggling to get back in the ring and this series focuses a lot on Miyata's recovery. All these characters are extremely enjoyable and you just have to like em.\\n\\n\r\nEnjoyment 10/10\\n\r\nIppo is one of the most enjoyable anime I have ever watched. While watching it, I had to actually try to limit myself with the amount of episodes I watched so I could savor it. Ippo is the type of show to watch to put yourself in a good mood. The show just makes me happy.\\n\\n\r\nOverall 10/10\\n\r\nHaijime no Ippo: New Challenger, and its whole series, is a a gem among all anime. The story, the characters, the comedy, and of course, the boxing are taken to the next level in this anime. You'd actually have to be a fool to not check this out. Don't let the fact that it is a sports anime stop you from watching this. Most people who have watched this will say it with me, GO WATCH HAJIME NO IPPO.",
            "date": "2014-08-27T08:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 158099,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3333353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Celestrial2",
                "username": "Celestrial2"
            },
            "url": "https://myanimelist.net/reviews.php?id=158099"
        },
        {
            "content": "Story: 7/10\r\nHajime no Ippo: New Chalanger is alot better than S1. All fights had more Substance than any fight in S1. The fight between Date and ricardo was one of the best fights Hajime no Ippo had to offer together with Hawk vs Takamura.\r\nI love that besides our main character ippo every one gets to shine like Date, Aoki, Kimura, Itagaki and Takamura.\r\nCharacter: 8/10\r\nLike in S1 here in S2 the characters are all well written. I have lots of fun just watching their fights and their interactions.\r\nArt: 8/10\r\nThe art is alot better than S1. its more detailed and crisp. Some punches are visually amazing.\r\nSound: 7/10\r\nAlsothe OP and ED are very good and the ost is remarkably better than S1.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nS2 was so much more enjoyable than S1. The fights were alot better, ost was also better. All in all an improvement.\\n\\n\r\nOverall: 7.6=8/10",
            "date": "2019-01-13T11:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 298938,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4164337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sakis263",
                "username": "sakis263"
            },
            "url": "https://myanimelist.net/reviews.php?id=298938"
        },
        {
            "content": "For me Hajime no Ippo: New Challenger picks up pretty well from where it left off. I myself didn't feel like there was any hitches. It still had a lot of the important things the first series had for me.\r\nIn terms of the story it felt like Ippos kinda back-tracked a little bit, becoming a little more timid compared to how he left us at the end of the first series despite his accomplishments. That's not to say he went ALL THE WAY back to how he was in the very beginning. I'm not trying to say its bad or anything but really, it didn'tfeel like the same Machunouchi and it was a little unexpected. For me that goes throughout this installment of the show. He did take a back seat to some of the other characters this time around but still, it felt different.\\n\\n\r\nExpanding more on the story portion of this installment, I really really REALLY enjoyed the fact that this time around it wasn't all about Machunouchi. There was a lot of things happening all over the place for a few people this time around and a lot of it was enjoyable for me. Some of the stuff felt a little rushed but thats understandable because well... For one thing, this time around there was only 26 episodes, and not 75. Second is that a good portion of the \"meat and potatoes\" of a few of the fights we see this time around aren't even apart of the Kamogawa Boxing Gym so I understand that part of it. Although I do think they spent enough time building on those fights, especially the Date/Martinez fight. While the build for Date/Martinez was good I do wish they slowed the pace for the fight a little bit but that's just personal preference. They did it well for what they were trying to do in my eyes.\\n\\n\r\nFor me it was nice to see a little expansion on Takamura. He has always this super human of the show with a ego to match. This time around while his ego stayed where it was, we got to see him in a more \"human form\". I mean that in the aspects of the intense weight management he has to do before fights. This is actually the fist time we get a real look at what he has to deal with. Also this time around he doesn't just get in the ring and leave without breaking a sweat. His ego is untouched through it all though and that leaves to some unexpected comedy at times. I personally liked the aspect of hsi last fight where the animal in him (As well as Hawk) came out and it wasn't just a boxing match anymore. I wasn't expecting something like that.\\n\\n\r\nI think this was a good continuation of the series overall. Sure it might have seemed a little rushed at times, might have not been as polished around the edges as could have been and it might have been missing some of the usual \"adult humor\" from the first installment but hey, I'd say they did a really good job of keeping a great thing going. To many times do we see something great diminish in quality by a good amount when going into a sequel and I can say personally they didn't let that happen here and I appreciate it.",
            "date": "2018-01-11T13:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 268218,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284557.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Tactician",
                "username": "Tactician"
            },
            "url": "https://myanimelist.net/reviews.php?id=268218"
        }
    ]
]