[
    [
        {
            "content": "Mild spoilers ahead. More troublingly, it's lengthy as fuck.\r\nEDIT: If you take the time to read, I've explicitly mentioned I'll be scoring this a 9 like the disgusting fanboy I am. But make no mistake, 6 is what I think it deserves. I say this beforehand, since otherwise you might waste *our* time going directly to my profile on seeing the score and flaming me for 'fishing'.\r\nI wonder when it became natural for Gintama to have a score of 9 or above.\r\nEvery time a new season is announced, a few one-liners of \"X being displaced from the top 10\", or some acerbic remarks about howridiculous one franchise having so many entries in the top list is are made, and then the matter is dropped.\\n\r\nI'm perfectly aware that ratings on this site are dogshit, with trolls and boosters running rampant in equal measure. Still, Erased and Re;Zero received significant backlash on their sudden rise. Gintama was just...ignored.\\n\\n\r\nMaybe it's due to the non-confrontational fanbase. They just view haters as just being pitiable; more of a \"your loss\" viewpoint rather than a \"fuck you\" one. Trolls need triggered people to feed on, after all.\\n\r\nSaid fanbase is also loyal as fuck. Fierce doesn't even begin to cover it. Most of the current reviews are 10/10s claiming Gintama to be the best thing since sliced bread.\\n\r\nAnd I agree completely. Gintama was my first 10, my only 10, and my absolute no 1 when it comes to anime currently. But the reviews don't address the elephant in the room, a point which I'm coming to.\\n\\n\r\nThis season is shit.\\n\\n\r\nWhich is harsh, admittedly. It stands head-and-shoulders above other battle series (shounen isn't really a genre, nor is it the only one utilizing plot armour). But Gintama's standard of comparison is itself, and this season pales in comparison to the others.\\n\\n\r\nShifting tones from comedic to tension-filled is hard for any creator. Period. Forcing an audience to believe that characters surviving comic explosions can die at the hands of random mooks is a massive leap. And it is especially hard in a universe without any flashy techniques to aid the transition, like Negima or KHR.\\n\r\nHayate (the manga) has gone to shit in its final arc. Konosuba, the current comedy favourite can't really function without its comedy at all. \\n\r\nAnd yet Sorachi pulled it off with aplomb. He ratcheted the intensity higher and higher with each chapter, a near-miraculous feat. Until he perhaps took it too far.\\n\r\nSee, the SA arc was morbid. Alongside the Shogun, it was the death of Gintama's comedy, a death more hard-hitting than most characters'. Gintama basically sacrificed a part of itself to set up the drama.\\n\r\nFS was oppressive in its atmosphere. One bleak event after the another, culminating in the introduction of Utsuro, shown to be the strongest antagonist till date.\\n\\n\r\nRakuyo gave us mid-bosses. \\n\\n\r\nIn all fairness, Rakuyo is more a transition to the final arc. Plot threads involving Utsuro's identity, origin and abilities had to be resolved. Altana (foreshadowed in the Inugami arc) had to be formally introduced.\\n\r\nGintama was always short on true antagonists, and defeating Utsuro in the penultimate arc would be stupidly anticlimatic (in true Gintama fashion, but that part is dead now rip). So I understand the need to have new villains.\\n\\n\r\nThe problem is, they were given the same serious treatment reserved for Takasugi and Utsuro. I know individual fights have a lot of potential in any battle series. Each character can show the results of their training, new special moves, new deus ex machinas (Erza cough cough) etc.\\n\\n\r\nWhat they don't have any potential for is tension. \\n\\n\r\nA monkey, a mechanical tentacle monster, and a 1/3 functioning triclops with a wildly inconsistent lightsaber could have been a heap of laughs. \\n\r\nBut cheesy dialogues (not that cheesy, to my pleasant surprise, they were fairly unique) were to be had instead. It was more a case of 'could have been better' instead of 'bad'. Even with all concessions made for hype and one-liners and sword fights and whatever, when the bumbling trio blasted off the arc picked up significantly. Gintama is one of the rare SJ series I have read that has the ability to actually impart some tension to its battles, tension that prominently arrived parallel to Utsuro's arrival.\\n\r\nForced to be honest, a score of 7.5-8 would have been behind that 10.\\n\\n\r\nThen BNP came and fucked things up.\\n\\n\r\nWhere to begin with BNP? They're my favourite bunch of fuckwits, for starters. They are giving it their all, clearly. Which is why they're my favourite. But it cannot be denied they are fuckwits and I hate them.\\n\r\nIt started with a mild dislike of the new glossy artstyle. Which intensified when I realised the jokes weren't really as funny as in the manga or in previous seasons (and I wasn't any less immature--comic timing is a bitch). Skipping chapters was a fine mess slightly alleviated by the execution of the SA and FS arcs. \\n\r\nMaybe I'm just an idiotic hardhead unwilling to adapt to change. But the 2017 season has imbibed a fervent prayer in me wishing Silver Soul is not adapted by BNP.\\n\\n\r\nSee, I firmly believe Gintama is a cash cow. And the fact that a well-established cash cow is not being given sufficient budget for 12 decent quality episodes is mind-boggling. It seems the executives are going for profit margins rather than profit. \"They'll buy no matter what I try\" is a mentality I despise whole-heartedly in creators, no matter what medium.\\n\\n\r\nI'll admit that I know nothing about businesses or the anime industry. It is entirely possible I'm barking up the wrong tree. But take one look at the after battle scenes between Gintoki and Sith Lord, note the amount of flashbacks in Gintoki v Kamui and then try to tell me with a straight face that they had enough budget. Scratch enough. It felt like they had the bare minimum amount of capital required to produce 10 episodes which they stretched into 12. The fight scenes seemed surgically pruned in length. While I'm no supporter of 50-episode battles...previous seasons man, previous seasons. Even the fight scenes seem a step down from the 2011-2013 seasons, and it took a heavy toll on enjoyment, something which no other Gintama is lacking in. \\n\\n\r\nHere, I'll take a minute to question why they did not utilize any static backgrounds or other filler-type shit to conserve budget. Perhaps they felt it wouldn't fit the mood, but honestly, purely serious Gintama will never ever work after SA. A fact that Sorachi realized, seeing as the SS arc is a bucketload of laughs.\\n\r\n Even then, the Four Devas arc had a filler prior to its first episode which consisted of redubbed OVA footage. Redubbed OVA footage, which was still heavily enjoyable. Gintama is basically shit, the least they could do is use the reputation it has built up over ten years and air some planet backgrounds to ensure better quality. Eh, if they would go so far as to skip material I'm the fool for expecting stuff like that.\\n\\n\r\nAll said and done, this will probably be a 9 in my list. Rating is shit anyway, bite me. But for my true, impartial thoughts on the matter, 6 is the most suited.\\n\\n\r\nTl;dr- I spent a long time writing this, the least you could do is read it. There is no obligation, but plss.\\n\r\nk thx bai\\n",
            "date": "2017-03-27T07:39:00+00:00",
            "helpful_count": 200,
            "mal_id": 243677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6052894.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_alpha-q_",
                "username": "_alpha-q_"
            },
            "url": "https://myanimelist.net/reviews.php?id=243677"
        },
        {
            "content": "Reuploaded Review: This review is for all of Gintama. I found out about Gintama not that long ago and had my doubts during the first few episodes, but It quickly rose to my 2nd favorite anime of all time. I finished all of Gintama very fast. It was the fastest I've ever completed a long ass series. Now I am excited because this is the first time I get to watch Gintama as it airs. \r\nA huge cast of lovable characters are back to rip your heart out and spit on it while you watch in the newest season of Gintama. That's pretty much howI see Gintama. It doesn't take itself seriously, but it still manages pull off amazing story arcs. But besides from the short story arcs that tend to feel more satisfying than the majority of longrunner animes, they also have single episodes where they either make you cry rivers from laughing so hard or just straight up crying due to the sadness of their certain situations. You feel like a member of the Gintama family and you get hooked onto all the lovable characters. (Especially since everyone has wonderful voice actors that do the characters justice) You eventually even start caring about the villains too due to the reasons they turned bad and their backstories. But the comedy alone is worth watching Gintama. All those amazing story arcs are just icing on that huge ass mayonnaise cake. The comedy is on a whole different league than most comedy shows. If I were to compare its' hilarity levels to other shows, I'd probably compare it to somewhere near earlier seasons of South Park, It's Always Sunny In Philadelphia, Archer, The Office, and Parks and Recreation. All these shows have unique characters with hilarious interactions with each other so that's why I'm comparing them to Gintama. \\n\\n\r\n9/10 Story:\\n\r\nOf course the story arcs are 10/10 for me, but since story arcs aren't that huge of a percentage of Gintama, I lowered it down to 9. \\n\\n\r\n9/10 Art: \\n\r\nThe art matches the feeling of Gintama well and all characters are suited well. The only thing is that everyone literally has the same face but with different hair drawn on lol. And those random people in the crowds who have weird ass haircuts. (I'm looking at you Daigorou.)\\n\\n\r\n10/10 Sound: \\n\r\nThe theme songs, ending songs, osts, and everything is amazing. Gintama probably has the most openings on my favorite openings of all time list. Right next to Bleach and Jojo. My favorite ost in Gintama is Madao. \\n\\n\r\n10/10 Characters: \\n\r\nOf course this is 10/10. Everyone in Gintama stands out in their own way. Everyone is unique and you can't help but love them all. Even the villains..\\n\\n\r\n10/10 Enjoyment:\\n\r\nGintama is one of the most enjoying things I've ever watched. It has so much rewatch value to me and I'll be watching Gintama in the future no matter what even when it ends. \\n\\n\r\n10/10 Overall: \\n\r\nMany people hate on Gintama, but I honestly don't care. Neither do I care about the overall rating of Gintama. Even if the ratings go up or down, It wouldn't affect my enjoyment at all. To those who enjoy Gintama, make sure to enjoy this season and the possible more to come seasons till it ends. Gintama is unique and I don't see anything else that is like it at all. \\n",
            "date": "2017-02-06T08:40:00+00:00",
            "helpful_count": 116,
            "mal_id": 240033,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543563.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sterps",
                "username": "Sterps"
            },
            "url": "https://myanimelist.net/reviews.php?id=240033"
        },
        {
            "content": "While others may argue that this season was a dip in quality I would say the very opposite. When we talk about Gintama we mostly talk about its gag part but what I like more are the story like arcs with humor and not all gag arc which seems like a filler. This season focused on that very aspect. This season of Gintama has a nice story line with each episode explaining many plot holes like why people call Katsura zura (No it is not some plain nickname, it has meaning behind it), why did Yoshida Shouyo suddenly become his beloved students enemy and italso tells us more about Kagura's family. This season has sense in it which I particularly liked.\\n\r\nThe story is well written and has been nicely executed. No complains about the art in Gintama (mainstream anime mostly have the budget for good animation too). I like both the songs along with the soundtracks used in battles and other scenes. You see a lot of character development in this season of Gintama. Overall it is a 9.5 for me.\\n\r\nI would really appreciate your views on the same. Drop a comment on my wall if you feel like it.\\n\r\nThank you",
            "date": "2017-03-28T01:32:00+00:00",
            "helpful_count": 56,
            "mal_id": 243760,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2398295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gagan5867",
                "username": "gagan5867"
            },
            "url": "https://myanimelist.net/reviews.php?id=243760"
        },
        {
            "content": "Gintama is slowly coming to its end, sadly it isn't ending on a high note. With this season of Gintama the focus of the anime is moving towards ending its overarching story line which means each episode is more serious and focused on the action and backstory over what is in my opinion Gintama's biggest strength in the first place, Comedy.\r\nThe way this season is structured is very similar to the likes of One piece. The combat is basically the 2 opponents constantly monologuing and then occasionally hitting each other. Then to make it feel more intense they always seem to hit each other evenlyso the battles are always drawn out, boring and unimmersive. Then when the combat is over the rest of the episodes is littered with backstory which is yet again drawn out just like One piece. Now you see where i'm getting at, Gintama is basically becoming what it was always joking about: A generic shounen anime with the only redeeming factor is the occasional comedy that is good as always.\\n\\n\r\nSadly as a big Gintama fan i can't say i enjoy this season and for everyone that dislikes One Piece, Bleach and Dragon Ball it will probably be the same. Now i have to say that there is still a way to enjoy the end of Gintama, that is by reading the manga. The issues that are in the anime aren't really that apparent in the manga since the backstory and combat parts aren't dragged out way to long in there.",
            "date": "2017-03-27T05:32:00+00:00",
            "helpful_count": 40,
            "mal_id": 243669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4553847.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bramve",
                "username": "bramve"
            },
            "url": "https://myanimelist.net/reviews.php?id=243669"
        },
        {
            "content": "TO be honest with all of you i am a massive gintama fan.\r\nAs most shounen are literally turning into crappy and fillerly to the point you died of boredom after so many episode and the predictable plot like the power up through training or the  instant ass-PULL power or the quality of both writing and animation drop to -99 percent.Gintama is a complete oposite of most typical shounen it does not rely much on the friendship is magic bullshit(and yes it have those chessy moment but do remember the fight scene are brutal everything is real the threat to  gintoki losing(or dying) orthe death of main characters is realize and the fight that show no magical power up  is satisfiying to watch because even with the predictable plot of gin winning but how he wins is something  like the hosen fight or the utsuro fight).Gintama is hilarious in every way \\n\r\nexcept the first season ( where boring fillers are)then watch the entire series and  have a blast because even filler episodes onward are hilarious,sad,satisfiying and enjoyable.\\n\\n\r\nthe story is decent and the characters are a blast to watch from the main trio,to the shishengumi\\n\r\n,to the ninjas,aliens,madaos and etc.\\n\\n\r\nthenwhy is gintama not as hype as konusuba s2,little witch acadamia and attack on titan\\n\r\nwith that 2015 cliffhanger.\\n\\n\r\n(fuck you watch mojo)\\n",
            "date": "2017-02-13T02:55:00+00:00",
            "helpful_count": 42,
            "mal_id": 240498,
            "reviewer": {
                "episodes_seen": 300,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/winte321",
                "username": "winte321"
            },
            "url": "https://myanimelist.net/reviews.php?id=240498"
        },
        {
            "content": "When you think of Gintama, you think of its comedy and what it's known for. As like its previous season, Gintama has started to throw most of the comedy out the window in order to finish the story and thus its franchise as a whole. However, doing this is not a good thing, and in this season it is quite apparent. When you compare this to the previous one—while only being 12 episodes to 51—the dip in quality is really apparent. Would it have been better if it was more than 12 episodes? Yes, and maybe not. It would have had more time to bringin other elements it is currently missing or it could have just brought in the same old stuff that is already making it go downhill. \\n\\n\r\nThe story has taken a bit of a dive. I don't feel the same emotion as I did in the two previous arcs: Shogun Assassination Arc & Farewell, Shinsengumi Arc. They managed to actually use comedy, action, and story pretty much perfectly to what Gintama is expected to do. It wasn't underwhelming and didn't feel bland to what this season gives. Story has never been a key factor in the Gintama series when you think of it in a bigger picture, but due to the previous season, we've been leading up to an actual plot that is pushing the series to an end. There was, however, some good story progress in terms of the past with Utsuro & even more so with Kagura's family, which was welcoming as we never had any real backstory to them. Here we find out the problems centered around the family as a whole and their reasoning for the path they’ve taken.\\n\\n\r\nVisuals haven’t changed a bit and are the same as it has been for a while now. Becoming hit and miss in terms of good production. I really loved the OPs art, especially during the scene of the color changes going from black and white to actual color—representing their old selves as they move forward as they once did in the past. Nothing special about the ED in terms of art since it was just stills basically of some art of the characters with the odd movement of nothing important. It is probably one of the worst visually speaking EDs of the series. \\n\\n\r\nAs for its sound, you think of how well the studio is able to put sounds into the sound sfx, character tones throughout the series, and its OST and OP/ED. Same old, same old to be quite honest but it didn't put stuff out of place this season which was a huge plus for it. The OP was one of the better ones and had a catchy tune to it, and I said previously, the visuals of it were really well done when you look at it visually and with the music for it. However, due to the lack of subs from official translators, most people will not understand the actual lyrics and meaning behind, and so we are left in the dust to actually wonder if the song has a meaning or if it’s just there as a song. Some shows do this well, for example, while being a terribly written show, M3: Sono Kuroki Hagane had good songs for its OP/ED and it actually felt like the songs fit its dark theme. The ED, well, I don't have much of an opinion on it. It didn't sound amazing and the visuals were bland. \\n\\n\r\nThere are two key factors you look at when you watch Gintama: Did it make you laugh? Did the story progress without hindering the actual comedy tone? In the end, I rated this season lower than the previous due to it being one of the weakest seasons out of the whole franchise because of the story progression hindering the rest of what the series is known for. As a fan of the franchise, it's kind of saddening that its focusing so much on action that there's no way to put in good comedy but I guess that is to be expected as what is even worse than barely any comedy is comedy that is terribly out of placed, which this season did do at times. While I may be disappointed about this season, I still look forward to more Gintama and hope it can somehow manage to bring back the elements that this season lacked in.",
            "date": "2017-03-26T15:05:00+00:00",
            "helpful_count": 38,
            "mal_id": 243622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/611391.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrel",
                "username": "Tyrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=243622"
        },
        {
            "content": "So, what can I say about this great anime? A lot to be honest, but let's stick with the 6 points I get provided with. \r\nStory: \r\nThe story at first wouldn't seem to be as big of a point in this anime since a lot of episodes aren't really \"cannon\" but they still are, they build up the characters so much in those episodes that they just become extremely relevant again in the actual arcs. It's great.\r\nArt:\r\nThe animation in itself showed a huge improvemt since the older days which is great, and even then it the artstyle was pretty neat. \r\nSound:\r\nSounds and music are ahuge part in an anime for me, Gintama hasn't disappointed me at all in this regard by keeping it fresh with all kinds of tunes. They can be reused as much as they want, I wouldn't get sick of the music. \\n\\n\r\nCharacter:\\n\r\nNow this is a huge part of this anime as well, since there are so many characters it would normally get hard to keep track of all of them. But not in this anime, all of them are so different from one another is crazy, there isn't one character in the anime that seems like a \"normal\" character to me. \\n\\n\r\nEnjoyment:\\n\r\nThis anime has it all, action, comedy, even some romance, slice of life, robots, aliens, you want it, they got it. I wasn't even aware I liked this kind of comedy before I watched this.\\n\\n\r\nOverall:\\n\r\nAll I can say is that if you get invested in this anime you won't be able to go back to another one for a while, you'll laugh, cry, scream and most certainly enjoy it a lot!\\n\\n\r\nThank you for reading my review!",
            "date": "2017-02-28T00:16:00+00:00",
            "helpful_count": 23,
            "mal_id": 241582,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418152.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RuujiHasegawa",
                "username": "RuujiHasegawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=241582"
        },
        {
            "content": "Gintama has always been my favourite anime since all time. The anime starts with a major spoiler for those who haven't watched Gintama previously. Therefore for those who are interested to watch Gintama for the very first time, I'll just suggest you guys watching from Gintama 2015 (since I know people aren't willing to watch hundreds of episodes from Ep. 1).\r\nThe season as of right now probably won't have too much jokes as it's starting in a really serious arc. Even though their cheap jokes are still used once in awhile, it never fails to make the viewers smile, grin, or even laugh. Also, thestory keeps unraveling shocking information and it develops really well. Loyal fans of Gintama who watched from the very beginning must've been really hooked with the story's development.\\n\\n\r\nAs of art, it probably isn't as beautiful as other new animes, but it has marvelously upgraded since the start of the first episode. It is still considered a pretty good art because it certainly helped create the ambiance the creators intend. \\n\\n\r\nSeriously a 10/10 anime.",
            "date": "2017-02-25T19:16:00+00:00",
            "helpful_count": 18,
            "mal_id": 241389,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ilovendut",
                "username": "ilovendut"
            },
            "url": "https://myanimelist.net/reviews.php?id=241389"
        },
        {
            "content": "The fall of Gintama, by a fan of the series.\r\nBack in winter 2016, Gintama° was pulling out the two greatest arcs of the series. And, one of the best action-drama sequences ever seen in the shounen genre. The amateur studio BN Pictures was in a pinch with the production. Yet Sorachi's writing was shining at its brightest, pushing the series to a whole new level. After the end of the Farewell Shinsengumi arc, Sorachi had two options. He could keep pushing higher, to scale up the series' finale with the power of the previous arcs. Or he could go through the lazy writing route. Sadthing he did choose the latter.\\n\\n\r\nIt is important to note that this is the same old Gintama, at least on a surface level. The comedy, now less frequent, is still on point. The basic plotline of the \"story arcs\" still the same. Lack of comedy might turn off some fans, but it's not a problem at all. What was not done right then? Why one of my favorite titles felt so mediocre in this particular season?\\n\\n\r\nEmotional stakes. Not the lack of them, but the distance of them from the plot stakes. Picture this: A beloved one of yours turns into a evil monster. He wants to end his own misery but he can't do it himself. Then he realises the only way he could do this is to destroy planet earth. And the way he finds to achieve his goal is to provoke a universal-scale war. Now you see yourself going to a foreign planet far from home to... Do you see the problem here? We are going too many places and too far away only to get to a single point: The clash between Gintoki and Utsuro. All these light-years made plot and emotional stakes too apart from each other. Now the story is involving a lot of people, parties, places and actions. And all these have little to nothing to do with the emotional conflict. Tying emotional and plot stakes together is no easy task. Creating big ass events to see the action roll and nothing else sounds far easier, right?\\n\\n\r\nBesides, the visuals looks the same from the last cour of Gintama°. Nothing impressive, as expected from a low-budget production. One of the most disappointing aspects though, is the lack of new OSTs. Sure, they added some new sound, but they for the most reused tracks from previous seasons. Almost every major arc from the 2015 season had their own OSTs, so what happened?\\n\\n\r\nMost fans of the series will still love to their hearts this season. Shounen genre addicts can still find a good deal of enjoyment here. But, if you are one of the few people that loved Gintama for the writing gems it pulled out (aside the comedy), for poetic arcs like Mitsuba or Red Spider, for heartbreaking drama from Shogun Assassination and Farewell Shinsengumi arcs... Better stop. The next arc, Silver Soul, is by far only a bigger fest of the same meals compared to Rakuyo arc. Stop here, and save yourself from watching the fall of Gintama.",
            "date": "2017-05-13T21:50:00+00:00",
            "helpful_count": 12,
            "mal_id": 247625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5360302.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/agendator",
                "username": "agendator"
            },
            "url": "https://myanimelist.net/reviews.php?id=247625"
        },
        {
            "content": "Isn't it weird? Loving a show that has everything, in this day and age where everyone chase after this \"quality\" thing.\r\nGintama is one of those shows that when you're asked \"If you could ask for a sequel of a show, what show would it be?\" I don't know about you but I'll say Gintama over and over again. And really, my prayers have been answered, it's finally here alive and kicking, it feels pretty weird, amazingly good but weird.\r\nGintama has so many ups and downs in its storyline, we all know that, it's not until you accept the flaws in an anime and love themthat you become a real dedicating loyal fan, what we all love about this show isn't it's complex or twists or whatever it is that comes up your mind, its simply the beautiful way it does everything in it, and ladies and gentleman, this right there is a rare thing. \\n\r\nGintama knows how to make every single thing it does look good, it knows how to take a lame topic and evolve it to an incredibly interesting subject, that's just one of Gintama's magics. \\n\r\nGuys, we love Gintama because it's just the best kind of art there is, it's not about the storyline or the characters, of course Gintama is amazing with those but it's really about the enjoyment and just with that, this show is the most beautiful show I've seen.\\n\\n\r\nIf you havn't started Gintama yet - please, go ahead and give it a chance, you might be surprised, don't drop it mid-way, watch it carefully and just go on an adventure, a really funny adventure with the characters. Believe me falling in love with those guys is so natural that you won't even notice it.\\n\\n\r\nNow, for all the Gintabros around the world.\\n\r\nThe last season left a really deep hole in all of our hearts, finally we found out the truth about everything but the story was far from ending, that just punched us right in the stomach. That's why this season just kicked off right with the storyline without all the comedy that we all fell in love with.\\n\r\nThis makes the period at the end of the new season name seems real, the ending is right there.\\n\r\nBut don't you worry for now, even though the story is nearing its end, I know it, believe me I know it, what's coming next is going to be the best fucking arcs Gintama ever had.\\n\\n\r\nThe anime was cut short at the end and I really hope there will be another season in the near future, but for now - we have this short, amazing season.\\n\\n\r\nGet ready for it guys!\\n\r\nIt's going to be thrilling and really intenese. Take a deep, deep breath.\\n\r\nWe are going to worry, love, hate, feel, smile, laugh, roll on the floor laughing, cry from laughter and yes, there will be tears of sadness, I know what you're thinking, we want it to last forever, we don't want this period at the end, we want Gintoki with his stupid amazing smile on his face. \\n\r\nPlease, as you're feeling a little sad thinking about the ending, don't forget Gintoki's words:\\n\r\n\"If you've got time to fantasize about a beautiful ending, why not live beautifully until the end?\"\\n\\n\r\nThis is all guys, thx for reading.",
            "date": "2017-03-25T05:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 243468,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1219801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DavidTamir",
                "username": "DavidTamir"
            },
            "url": "https://myanimelist.net/reviews.php?id=243468"
        },
        {
            "content": "Gintama review \r\nTake a seat and let’s talk about a memorable story.\r\nA story that will not be forgotten , a story that will make laugh and cry , a story that will teach about life and a story that will teach you  about what is love and friends and how to value people that are close and dear to you. A story which every addicitive reader should know. \r\nStory 9/10 \r\nHave you ever saw a anime which can combine elements of comedy and drama and execute it’s concept and idea so well. The story is simple not much to say about it it depictselements from the history of Japan: Samurai, Katana, Edo-period arhitecture  buildings, the old Kyoto capital , Shinsegumi, Shogun, ninja, etc. Since this has parody in the genre elements of parody are added like skyscrapers mixed with old Japanese houses and aliens . This may look dumb and stupid at a first glance but all this elements are explained in the anime during the story and it leaves a strong impact for the viewer.\\n\\n\r\nGintama manages to use so well the parody elements  to fulfill it’s purpose of providing amusement to the viewer. Also these parody elements are combined with the drama and action this show has and as a pleasant surprise everything goes well avoiding the clusterfuck and helping with the progress of the story.\\n\\n\r\nThe themes that Gintama covers and abords are vast and the most important ones: family, love,human nature , parody and many more. Gintama doesn’t disappoints us in the slice of life genre at all as a contradiction it manages to execute that theme better than its parody genre.You will learn about  family , about love , about sacrifices , about teacher student relation, about friends everything told in a mature perspective to the viewer and with a well directed and balanced tone of comedy and drama.\\n\\n\r\nThe purpose of this anime is simple and it’s executed with no flaws , Gintama makes you laugh as hard as you can and in the next minute it makes you cry and in the end it makes you shout as hard as you can :”What a great anime I saw”. Like I mentioned the transition between comedy and drama is flawless because this anime takes time to explain the characters and their background story and every detail is not missed at all. \\n\\n\r\nThe pace in the beginning is slow (first 40) we get used to the characters , habits, actions and interactions , what they like what they hate etc. We are introduced to the crazy setting this story is set and explained step by step about the aliens, skyscrapers , and other residents from that parody edo setting. After that everything comes as a roler coaster and for the pleasant surprise of the viewer this is where Gintama shines the drama and actions scenes well directed. Its strange right a parody being better in the drama and action well Gintama is a balanced show so you won’t notice much of a difference in the transition between comedy drama and action.\\n\\n\r\nAt the end of each episode you will learn a lesson about life. Yes each character in this anime tells to the viewer a lesson about life , and leaves a memorable impact on the viewer.\\n\\n\r\nCharacters 10/10\\n\r\nDespite it’s  huge number of characters this show manages to develop each character and tell their background story without missing any detail. Even the minor character have their moments to shine in this anime and contribute to the development of other characters. \\n\\n\r\nWhat Gintama manages to exceed many expectations is how it uses these characters to tell the story. Practically the characters in Gintama are the story and each character tells his own story from each of his/her perspective. Gintama connects those stories and bring a meaning to the progression of the story and characters.  \\n\\n\r\nGintama doesn’t rushes at all  the character development it takes it time for each character at a slow pace adding elements of comedy and drama to the story. At first as any parody the characters are presented as gag characters and used to provide entertainment but oh boy  when the pace of the story increases those characters become irreplaceable in Gintama. Let me explain this statement , we get to know their story and circumstances , we are shown how they interact with other characters and how they influence each other directly or indirectly and we see the conclusion told by each character after their experience.   \\n\\n\r\nGintama is like a school which teaches his viewers about life and each character from Gintama is a teacher  who takes good care of his students and guides them through life.\\n\\n\r\nAnimation 8/10\\n\r\nGood animation, great fighthing scenes , and well directed drama scenes.\\n\\n\r\nSound 10/10\\n\r\nGreat ost and opening songs, the sound is well balanced between the comedy and drama  transition.\\n\\n\r\nEnjoyment 10/10\\n\r\n You will laugh until your stomach will hurt, you will cry until you will fill a bucket , you will feel connected to the characters , you will shout “I love this anime”  and in the end you will learn a lesson about life called Gintama.\\n\\n\r\nOverall 10/10\\n\r\nThis a story that you can tell to your kids and your kids to their kids and so on ……and in the end every generation will come up with the same conclusion :” Thank you for changing my life Gintama”.\\n",
            "date": "2017-04-12T04:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 245305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=245305"
        },
        {
            "content": "They made this season way too short. 12 episodes is nothing to what fans are used to. We want 30-50 episode seasons with fillers and lots of laughs - not just the cliche main story arc we all knew was coming with a joke thrown in here and there. Overall this season was way too short and way too serious. If nothing else is clear about this last season it is that we are approaching the end of another great anime and they no longer have the time or no longer want to take the time to make it as fun as it was inthe past. Please don't think I am bashing the series as a whole. This season and only this season was a let down. If this was standing on its own I would give it 10/10 but it isn't. It is standing on hundreds of episodes and years of story and laughs before this and has to feel the weight of all that greatness when it falls short. I still would consider the anime collectively, right up there with the best like One Piece / Hunter x Hunter / and Magi. No one would waste their time watching this season but no one would feel ultimately satisfied as with seasons passed either...",
            "date": "2017-04-13T00:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 245369,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1719881.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Theliel",
                "username": "Theliel"
            },
            "url": "https://myanimelist.net/reviews.php?id=245369"
        },
        {
            "content": "I have to say that this is my first time walking away from a Gintama season not completely blown away by it.  In fact, I would say that this was the weakest Gintama season of them all.  But, because its Gintama, even though it was weak for its own standard, it still made for an entertaining anime.   \r\nTo be honest, I was really kind of bored with the entire first half of the season.  It felt like more of the same Hack-N-Slash, Deus Ex Machina fights that most anime presents.  Normally, there is significantly high quality humor in thefirst portion of the series that mitigates that feeling in Gintama, but the humor was hit and miss and much lighter than an earlier seasons.  The arc was meant to be much more serious following the amazing events of the previous season with Shigeshige, but it just felt kind of droll throughout the entire first half, as the heroes mowed through a number of forgettable opponents.  They were really trying to play up the bond between Shoyo's students in the first half, but it just didn't really connect, because in my opinion, we've seen them fighting side-by-side for years now, including flashbacks.  It just wasn't as special for me as they were trying to make it seem.  \\n\\n\r\nBut, then we got to the portion of the anime with Kagura, Kamui and Umibozu, and Gintama raised the bar back to its usual level of quality.  The reason why Gintama is so well received is because while its comedic chops usually place it far beyond other action-comedies, when its time to get serious, its dramatic episodes are also some of the best you'll find.  That was the case with the tale of the Yatos.  Excellent back story, excellent fights, pretty decent resolution...(SLIGHT SPOILER)...with the exception of a frickin' miracle survival, which was quite cheap and ridiculous even for Gintama. If you get chopped in half? Die.\\n\\n\r\nOverall, however, this whole season was really just a set up for what I assume is the final season (for real this time) of Gintama.  Based upon how its set up, it looks like the final season will be pretty epic.  But, as such, it makes this season feel like the weakest season of them all.   \\n\\n\r\nI don't have to recommend whether or not you watch this.  If you're this deep into Gintama at this point, you're already going to.   \\n\\n\r\nStory: 7\\n\r\nArt: 9\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 7\\n\r\nOverall: 7\\n",
            "date": "2017-12-25T18:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 266392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266392"
        },
        {
            "content": "This was a deception for me, Gintama is my favorite anime and even if this season was not \"bad\" it was bad in comparison to the other seasons.\r\nThe 12 episode format does not suit the show at all. The story was way too fast paced so they used too many \"narrator characters\" who's sole purpose was to tell what is happening, why it is happening, why this character is badass, why this character is a super badass. There were also a whole lot of flashbacks and way less humor than in the other seasons. \r\nSidenote, I didn't like the opening nor the ending for once,sad.",
            "date": "2017-06-14T08:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 249891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/claudinou",
                "username": "claudinou"
            },
            "url": "https://myanimelist.net/reviews.php?id=249891"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nI'm going to keep this \"review\" more of a opinion of Gintama's overall and then this season specific.\r\nAnyhow. What I have always loved regarding Gintama, is its content of everything. I love the comedy, its absurd, random, can be vile, dirty, sweet, anyhow, everything. Have laughed countless times in this franchise. Also the humor they have also is heavily reference based, a.k.a parodies of different anime, shows, manga, live stuff, real world, anime production and so on. Anyhow, comedy/parody side of this franchise i absolutely love.\r\nNow, 2ndside of this show is the serious dramas, epic battle shounens and so on.. There are arcs that are fully comedy, arcs that are fully serious and mixtures of both. Serious side is usually quite dramatic and managed to somewhat tear me up now and then. Whilst the action sequences are absolute bliss as well. They are just presented in a really cool manner. And extra points when sometime the add artistic element.\\n\\n\r\nOf course it has its slice-of-life side and pseudo-romance. Those are weaker side, but ain't the focus. But when sometimes those are the \"focus\", then they are done in enjoyable method.\\n\\n\r\nTo sum up overall gintama's, I love the serious side and the silly side.\\n\\n\r\nArt and sound (voice acting/ost/op/ed) is something I loved in all gintamas across the board. They just click with me, bliss to look at, bliss to hear. Music (op/ed) specifically are hyped up and upbeat, which generally I don't like, but gintama is the exception where I love them. Art is cool, sometimes artistic, sometimes simple. It has a bit of everything that makes it enjoyable. And gore is absolutely satisfying as well. (well, the blood to be specific)\\n\\n\r\nWell, the serious side of stories in this anime are superb in my opinion. (or the overall idea of story that moves now and then). But wouldn't say comedic side of series story is any worse.  When at times comedy side has \"story\". It's usually quite enjoyable.\\n\\n\r\nRegarding characters I don't have much to say other than that variety, stereotypes of \"off-stereotypes\" is very large. As well characters with depth but as well with oddity is as well in great selection. Main team. Gintoki the lazy dirty slob with superb second side of seriousness and caring about friends/allies. Shinpachi the poor straight-man-act sidekick, who adds great value to the team. Kagura, the battle race girl that doesn't act like girl almost at all, or in another words a dirty slob girl in a sense.\\n\r\n-----------------\\n\\n\r\nNow, to this season specific.\\n\\n\r\nI found it a bit disappointing. Mainly because usually in gintama we have overly serious arcs or fully comedic, whilst this one had a bit of mixture of both, which somewhat ruined the experience. Plus the artistic presentation felt this time around a bit lacking. Maybe because of another studio, who knows. But anyhow, it didn't feel as superb. Rather than gintama it felt as watching just another good battle shounen anime in modern day with simplified animation.\\n\\n\r\nI mean it definitely was not any bad, just didn't have the punch Gintama usually has. Might be because it was short series, maybe because it focused too much moving on with story. It'll be shame to see it finalized in this manner.\\n\\n\r\nRest I pretty much loved as usual in Gintama franchise.",
            "date": "2017-08-21T04:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 255938,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255938"
        }
    ],
    [
        {
            "content": "Mild spoilers ahead. More troublingly, it's lengthy as fuck.\r\nEDIT: If you take the time to read, I've explicitly mentioned I'll be scoring this a 9 like the disgusting fanboy I am. But make no mistake, 6 is what I think it deserves. I say this beforehand, since otherwise you might waste *our* time going directly to my profile on seeing the score and flaming me for 'fishing'.\r\nI wonder when it became natural for Gintama to have a score of 9 or above.\r\nEvery time a new season is announced, a few one-liners of \"X being displaced from the top 10\", or some acerbic remarks about howridiculous one franchise having so many entries in the top list is are made, and then the matter is dropped.\\n\r\nI'm perfectly aware that ratings on this site are dogshit, with trolls and boosters running rampant in equal measure. Still, Erased and Re;Zero received significant backlash on their sudden rise. Gintama was just...ignored.\\n\\n\r\nMaybe it's due to the non-confrontational fanbase. They just view haters as just being pitiable; more of a \"your loss\" viewpoint rather than a \"fuck you\" one. Trolls need triggered people to feed on, after all.\\n\r\nSaid fanbase is also loyal as fuck. Fierce doesn't even begin to cover it. Most of the current reviews are 10/10s claiming Gintama to be the best thing since sliced bread.\\n\r\nAnd I agree completely. Gintama was my first 10, my only 10, and my absolute no 1 when it comes to anime currently. But the reviews don't address the elephant in the room, a point which I'm coming to.\\n\\n\r\nThis season is shit.\\n\\n\r\nWhich is harsh, admittedly. It stands head-and-shoulders above other battle series (shounen isn't really a genre, nor is it the only one utilizing plot armour). But Gintama's standard of comparison is itself, and this season pales in comparison to the others.\\n\\n\r\nShifting tones from comedic to tension-filled is hard for any creator. Period. Forcing an audience to believe that characters surviving comic explosions can die at the hands of random mooks is a massive leap. And it is especially hard in a universe without any flashy techniques to aid the transition, like Negima or KHR.\\n\r\nHayate (the manga) has gone to shit in its final arc. Konosuba, the current comedy favourite can't really function without its comedy at all. \\n\r\nAnd yet Sorachi pulled it off with aplomb. He ratcheted the intensity higher and higher with each chapter, a near-miraculous feat. Until he perhaps took it too far.\\n\r\nSee, the SA arc was morbid. Alongside the Shogun, it was the death of Gintama's comedy, a death more hard-hitting than most characters'. Gintama basically sacrificed a part of itself to set up the drama.\\n\r\nFS was oppressive in its atmosphere. One bleak event after the another, culminating in the introduction of Utsuro, shown to be the strongest antagonist till date.\\n\\n\r\nRakuyo gave us mid-bosses. \\n\\n\r\nIn all fairness, Rakuyo is more a transition to the final arc. Plot threads involving Utsuro's identity, origin and abilities had to be resolved. Altana (foreshadowed in the Inugami arc) had to be formally introduced.\\n\r\nGintama was always short on true antagonists, and defeating Utsuro in the penultimate arc would be stupidly anticlimatic (in true Gintama fashion, but that part is dead now rip). So I understand the need to have new villains.\\n\\n\r\nThe problem is, they were given the same serious treatment reserved for Takasugi and Utsuro. I know individual fights have a lot of potential in any battle series. Each character can show the results of their training, new special moves, new deus ex machinas (Erza cough cough) etc.\\n\\n\r\nWhat they don't have any potential for is tension. \\n\\n\r\nA monkey, a mechanical tentacle monster, and a 1/3 functioning triclops with a wildly inconsistent lightsaber could have been a heap of laughs. \\n\r\nBut cheesy dialogues (not that cheesy, to my pleasant surprise, they were fairly unique) were to be had instead. It was more a case of 'could have been better' instead of 'bad'. Even with all concessions made for hype and one-liners and sword fights and whatever, when the bumbling trio blasted off the arc picked up significantly. Gintama is one of the rare SJ series I have read that has the ability to actually impart some tension to its battles, tension that prominently arrived parallel to Utsuro's arrival.\\n\r\nForced to be honest, a score of 7.5-8 would have been behind that 10.\\n\\n\r\nThen BNP came and fucked things up.\\n\\n\r\nWhere to begin with BNP? They're my favourite bunch of fuckwits, for starters. They are giving it their all, clearly. Which is why they're my favourite. But it cannot be denied they are fuckwits and I hate them.\\n\r\nIt started with a mild dislike of the new glossy artstyle. Which intensified when I realised the jokes weren't really as funny as in the manga or in previous seasons (and I wasn't any less immature--comic timing is a bitch). Skipping chapters was a fine mess slightly alleviated by the execution of the SA and FS arcs. \\n\r\nMaybe I'm just an idiotic hardhead unwilling to adapt to change. But the 2017 season has imbibed a fervent prayer in me wishing Silver Soul is not adapted by BNP.\\n\\n\r\nSee, I firmly believe Gintama is a cash cow. And the fact that a well-established cash cow is not being given sufficient budget for 12 decent quality episodes is mind-boggling. It seems the executives are going for profit margins rather than profit. \"They'll buy no matter what I try\" is a mentality I despise whole-heartedly in creators, no matter what medium.\\n\\n\r\nI'll admit that I know nothing about businesses or the anime industry. It is entirely possible I'm barking up the wrong tree. But take one look at the after battle scenes between Gintoki and Sith Lord, note the amount of flashbacks in Gintoki v Kamui and then try to tell me with a straight face that they had enough budget. Scratch enough. It felt like they had the bare minimum amount of capital required to produce 10 episodes which they stretched into 12. The fight scenes seemed surgically pruned in length. While I'm no supporter of 50-episode battles...previous seasons man, previous seasons. Even the fight scenes seem a step down from the 2011-2013 seasons, and it took a heavy toll on enjoyment, something which no other Gintama is lacking in. \\n\\n\r\nHere, I'll take a minute to question why they did not utilize any static backgrounds or other filler-type shit to conserve budget. Perhaps they felt it wouldn't fit the mood, but honestly, purely serious Gintama will never ever work after SA. A fact that Sorachi realized, seeing as the SS arc is a bucketload of laughs.\\n\r\n Even then, the Four Devas arc had a filler prior to its first episode which consisted of redubbed OVA footage. Redubbed OVA footage, which was still heavily enjoyable. Gintama is basically shit, the least they could do is use the reputation it has built up over ten years and air some planet backgrounds to ensure better quality. Eh, if they would go so far as to skip material I'm the fool for expecting stuff like that.\\n\\n\r\nAll said and done, this will probably be a 9 in my list. Rating is shit anyway, bite me. But for my true, impartial thoughts on the matter, 6 is the most suited.\\n\\n\r\nTl;dr- I spent a long time writing this, the least you could do is read it. There is no obligation, but plss.\\n\r\nk thx bai\\n",
            "date": "2017-03-27T07:39:00+00:00",
            "helpful_count": 200,
            "mal_id": 243677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6052894.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_alpha-q_",
                "username": "_alpha-q_"
            },
            "url": "https://myanimelist.net/reviews.php?id=243677"
        },
        {
            "content": "Reuploaded Review: This review is for all of Gintama. I found out about Gintama not that long ago and had my doubts during the first few episodes, but It quickly rose to my 2nd favorite anime of all time. I finished all of Gintama very fast. It was the fastest I've ever completed a long ass series. Now I am excited because this is the first time I get to watch Gintama as it airs. \r\nA huge cast of lovable characters are back to rip your heart out and spit on it while you watch in the newest season of Gintama. That's pretty much howI see Gintama. It doesn't take itself seriously, but it still manages pull off amazing story arcs. But besides from the short story arcs that tend to feel more satisfying than the majority of longrunner animes, they also have single episodes where they either make you cry rivers from laughing so hard or just straight up crying due to the sadness of their certain situations. You feel like a member of the Gintama family and you get hooked onto all the lovable characters. (Especially since everyone has wonderful voice actors that do the characters justice) You eventually even start caring about the villains too due to the reasons they turned bad and their backstories. But the comedy alone is worth watching Gintama. All those amazing story arcs are just icing on that huge ass mayonnaise cake. The comedy is on a whole different league than most comedy shows. If I were to compare its' hilarity levels to other shows, I'd probably compare it to somewhere near earlier seasons of South Park, It's Always Sunny In Philadelphia, Archer, The Office, and Parks and Recreation. All these shows have unique characters with hilarious interactions with each other so that's why I'm comparing them to Gintama. \\n\\n\r\n9/10 Story:\\n\r\nOf course the story arcs are 10/10 for me, but since story arcs aren't that huge of a percentage of Gintama, I lowered it down to 9. \\n\\n\r\n9/10 Art: \\n\r\nThe art matches the feeling of Gintama well and all characters are suited well. The only thing is that everyone literally has the same face but with different hair drawn on lol. And those random people in the crowds who have weird ass haircuts. (I'm looking at you Daigorou.)\\n\\n\r\n10/10 Sound: \\n\r\nThe theme songs, ending songs, osts, and everything is amazing. Gintama probably has the most openings on my favorite openings of all time list. Right next to Bleach and Jojo. My favorite ost in Gintama is Madao. \\n\\n\r\n10/10 Characters: \\n\r\nOf course this is 10/10. Everyone in Gintama stands out in their own way. Everyone is unique and you can't help but love them all. Even the villains..\\n\\n\r\n10/10 Enjoyment:\\n\r\nGintama is one of the most enjoying things I've ever watched. It has so much rewatch value to me and I'll be watching Gintama in the future no matter what even when it ends. \\n\\n\r\n10/10 Overall: \\n\r\nMany people hate on Gintama, but I honestly don't care. Neither do I care about the overall rating of Gintama. Even if the ratings go up or down, It wouldn't affect my enjoyment at all. To those who enjoy Gintama, make sure to enjoy this season and the possible more to come seasons till it ends. Gintama is unique and I don't see anything else that is like it at all. \\n",
            "date": "2017-02-06T08:40:00+00:00",
            "helpful_count": 116,
            "mal_id": 240033,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543563.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sterps",
                "username": "Sterps"
            },
            "url": "https://myanimelist.net/reviews.php?id=240033"
        },
        {
            "content": "While others may argue that this season was a dip in quality I would say the very opposite. When we talk about Gintama we mostly talk about its gag part but what I like more are the story like arcs with humor and not all gag arc which seems like a filler. This season focused on that very aspect. This season of Gintama has a nice story line with each episode explaining many plot holes like why people call Katsura zura (No it is not some plain nickname, it has meaning behind it), why did Yoshida Shouyo suddenly become his beloved students enemy and italso tells us more about Kagura's family. This season has sense in it which I particularly liked.\\n\r\nThe story is well written and has been nicely executed. No complains about the art in Gintama (mainstream anime mostly have the budget for good animation too). I like both the songs along with the soundtracks used in battles and other scenes. You see a lot of character development in this season of Gintama. Overall it is a 9.5 for me.\\n\r\nI would really appreciate your views on the same. Drop a comment on my wall if you feel like it.\\n\r\nThank you",
            "date": "2017-03-28T01:32:00+00:00",
            "helpful_count": 56,
            "mal_id": 243760,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2398295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gagan5867",
                "username": "gagan5867"
            },
            "url": "https://myanimelist.net/reviews.php?id=243760"
        },
        {
            "content": "Gintama is slowly coming to its end, sadly it isn't ending on a high note. With this season of Gintama the focus of the anime is moving towards ending its overarching story line which means each episode is more serious and focused on the action and backstory over what is in my opinion Gintama's biggest strength in the first place, Comedy.\r\nThe way this season is structured is very similar to the likes of One piece. The combat is basically the 2 opponents constantly monologuing and then occasionally hitting each other. Then to make it feel more intense they always seem to hit each other evenlyso the battles are always drawn out, boring and unimmersive. Then when the combat is over the rest of the episodes is littered with backstory which is yet again drawn out just like One piece. Now you see where i'm getting at, Gintama is basically becoming what it was always joking about: A generic shounen anime with the only redeeming factor is the occasional comedy that is good as always.\\n\\n\r\nSadly as a big Gintama fan i can't say i enjoy this season and for everyone that dislikes One Piece, Bleach and Dragon Ball it will probably be the same. Now i have to say that there is still a way to enjoy the end of Gintama, that is by reading the manga. The issues that are in the anime aren't really that apparent in the manga since the backstory and combat parts aren't dragged out way to long in there.",
            "date": "2017-03-27T05:32:00+00:00",
            "helpful_count": 40,
            "mal_id": 243669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4553847.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bramve",
                "username": "bramve"
            },
            "url": "https://myanimelist.net/reviews.php?id=243669"
        },
        {
            "content": "TO be honest with all of you i am a massive gintama fan.\r\nAs most shounen are literally turning into crappy and fillerly to the point you died of boredom after so many episode and the predictable plot like the power up through training or the  instant ass-PULL power or the quality of both writing and animation drop to -99 percent.Gintama is a complete oposite of most typical shounen it does not rely much on the friendship is magic bullshit(and yes it have those chessy moment but do remember the fight scene are brutal everything is real the threat to  gintoki losing(or dying) orthe death of main characters is realize and the fight that show no magical power up  is satisfiying to watch because even with the predictable plot of gin winning but how he wins is something  like the hosen fight or the utsuro fight).Gintama is hilarious in every way \\n\r\nexcept the first season ( where boring fillers are)then watch the entire series and  have a blast because even filler episodes onward are hilarious,sad,satisfiying and enjoyable.\\n\\n\r\nthe story is decent and the characters are a blast to watch from the main trio,to the shishengumi\\n\r\n,to the ninjas,aliens,madaos and etc.\\n\\n\r\nthenwhy is gintama not as hype as konusuba s2,little witch acadamia and attack on titan\\n\r\nwith that 2015 cliffhanger.\\n\\n\r\n(fuck you watch mojo)\\n",
            "date": "2017-02-13T02:55:00+00:00",
            "helpful_count": 42,
            "mal_id": 240498,
            "reviewer": {
                "episodes_seen": 300,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/winte321",
                "username": "winte321"
            },
            "url": "https://myanimelist.net/reviews.php?id=240498"
        },
        {
            "content": "When you think of Gintama, you think of its comedy and what it's known for. As like its previous season, Gintama has started to throw most of the comedy out the window in order to finish the story and thus its franchise as a whole. However, doing this is not a good thing, and in this season it is quite apparent. When you compare this to the previous one—while only being 12 episodes to 51—the dip in quality is really apparent. Would it have been better if it was more than 12 episodes? Yes, and maybe not. It would have had more time to bringin other elements it is currently missing or it could have just brought in the same old stuff that is already making it go downhill. \\n\\n\r\nThe story has taken a bit of a dive. I don't feel the same emotion as I did in the two previous arcs: Shogun Assassination Arc & Farewell, Shinsengumi Arc. They managed to actually use comedy, action, and story pretty much perfectly to what Gintama is expected to do. It wasn't underwhelming and didn't feel bland to what this season gives. Story has never been a key factor in the Gintama series when you think of it in a bigger picture, but due to the previous season, we've been leading up to an actual plot that is pushing the series to an end. There was, however, some good story progress in terms of the past with Utsuro & even more so with Kagura's family, which was welcoming as we never had any real backstory to them. Here we find out the problems centered around the family as a whole and their reasoning for the path they’ve taken.\\n\\n\r\nVisuals haven’t changed a bit and are the same as it has been for a while now. Becoming hit and miss in terms of good production. I really loved the OPs art, especially during the scene of the color changes going from black and white to actual color—representing their old selves as they move forward as they once did in the past. Nothing special about the ED in terms of art since it was just stills basically of some art of the characters with the odd movement of nothing important. It is probably one of the worst visually speaking EDs of the series. \\n\\n\r\nAs for its sound, you think of how well the studio is able to put sounds into the sound sfx, character tones throughout the series, and its OST and OP/ED. Same old, same old to be quite honest but it didn't put stuff out of place this season which was a huge plus for it. The OP was one of the better ones and had a catchy tune to it, and I said previously, the visuals of it were really well done when you look at it visually and with the music for it. However, due to the lack of subs from official translators, most people will not understand the actual lyrics and meaning behind, and so we are left in the dust to actually wonder if the song has a meaning or if it’s just there as a song. Some shows do this well, for example, while being a terribly written show, M3: Sono Kuroki Hagane had good songs for its OP/ED and it actually felt like the songs fit its dark theme. The ED, well, I don't have much of an opinion on it. It didn't sound amazing and the visuals were bland. \\n\\n\r\nThere are two key factors you look at when you watch Gintama: Did it make you laugh? Did the story progress without hindering the actual comedy tone? In the end, I rated this season lower than the previous due to it being one of the weakest seasons out of the whole franchise because of the story progression hindering the rest of what the series is known for. As a fan of the franchise, it's kind of saddening that its focusing so much on action that there's no way to put in good comedy but I guess that is to be expected as what is even worse than barely any comedy is comedy that is terribly out of placed, which this season did do at times. While I may be disappointed about this season, I still look forward to more Gintama and hope it can somehow manage to bring back the elements that this season lacked in.",
            "date": "2017-03-26T15:05:00+00:00",
            "helpful_count": 38,
            "mal_id": 243622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/611391.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrel",
                "username": "Tyrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=243622"
        },
        {
            "content": "So, what can I say about this great anime? A lot to be honest, but let's stick with the 6 points I get provided with. \r\nStory: \r\nThe story at first wouldn't seem to be as big of a point in this anime since a lot of episodes aren't really \"cannon\" but they still are, they build up the characters so much in those episodes that they just become extremely relevant again in the actual arcs. It's great.\r\nArt:\r\nThe animation in itself showed a huge improvemt since the older days which is great, and even then it the artstyle was pretty neat. \r\nSound:\r\nSounds and music are ahuge part in an anime for me, Gintama hasn't disappointed me at all in this regard by keeping it fresh with all kinds of tunes. They can be reused as much as they want, I wouldn't get sick of the music. \\n\\n\r\nCharacter:\\n\r\nNow this is a huge part of this anime as well, since there are so many characters it would normally get hard to keep track of all of them. But not in this anime, all of them are so different from one another is crazy, there isn't one character in the anime that seems like a \"normal\" character to me. \\n\\n\r\nEnjoyment:\\n\r\nThis anime has it all, action, comedy, even some romance, slice of life, robots, aliens, you want it, they got it. I wasn't even aware I liked this kind of comedy before I watched this.\\n\\n\r\nOverall:\\n\r\nAll I can say is that if you get invested in this anime you won't be able to go back to another one for a while, you'll laugh, cry, scream and most certainly enjoy it a lot!\\n\\n\r\nThank you for reading my review!",
            "date": "2017-02-28T00:16:00+00:00",
            "helpful_count": 23,
            "mal_id": 241582,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418152.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RuujiHasegawa",
                "username": "RuujiHasegawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=241582"
        },
        {
            "content": "Gintama has always been my favourite anime since all time. The anime starts with a major spoiler for those who haven't watched Gintama previously. Therefore for those who are interested to watch Gintama for the very first time, I'll just suggest you guys watching from Gintama 2015 (since I know people aren't willing to watch hundreds of episodes from Ep. 1).\r\nThe season as of right now probably won't have too much jokes as it's starting in a really serious arc. Even though their cheap jokes are still used once in awhile, it never fails to make the viewers smile, grin, or even laugh. Also, thestory keeps unraveling shocking information and it develops really well. Loyal fans of Gintama who watched from the very beginning must've been really hooked with the story's development.\\n\\n\r\nAs of art, it probably isn't as beautiful as other new animes, but it has marvelously upgraded since the start of the first episode. It is still considered a pretty good art because it certainly helped create the ambiance the creators intend. \\n\\n\r\nSeriously a 10/10 anime.",
            "date": "2017-02-25T19:16:00+00:00",
            "helpful_count": 18,
            "mal_id": 241389,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ilovendut",
                "username": "ilovendut"
            },
            "url": "https://myanimelist.net/reviews.php?id=241389"
        },
        {
            "content": "The fall of Gintama, by a fan of the series.\r\nBack in winter 2016, Gintama° was pulling out the two greatest arcs of the series. And, one of the best action-drama sequences ever seen in the shounen genre. The amateur studio BN Pictures was in a pinch with the production. Yet Sorachi's writing was shining at its brightest, pushing the series to a whole new level. After the end of the Farewell Shinsengumi arc, Sorachi had two options. He could keep pushing higher, to scale up the series' finale with the power of the previous arcs. Or he could go through the lazy writing route. Sadthing he did choose the latter.\\n\\n\r\nIt is important to note that this is the same old Gintama, at least on a surface level. The comedy, now less frequent, is still on point. The basic plotline of the \"story arcs\" still the same. Lack of comedy might turn off some fans, but it's not a problem at all. What was not done right then? Why one of my favorite titles felt so mediocre in this particular season?\\n\\n\r\nEmotional stakes. Not the lack of them, but the distance of them from the plot stakes. Picture this: A beloved one of yours turns into a evil monster. He wants to end his own misery but he can't do it himself. Then he realises the only way he could do this is to destroy planet earth. And the way he finds to achieve his goal is to provoke a universal-scale war. Now you see yourself going to a foreign planet far from home to... Do you see the problem here? We are going too many places and too far away only to get to a single point: The clash between Gintoki and Utsuro. All these light-years made plot and emotional stakes too apart from each other. Now the story is involving a lot of people, parties, places and actions. And all these have little to nothing to do with the emotional conflict. Tying emotional and plot stakes together is no easy task. Creating big ass events to see the action roll and nothing else sounds far easier, right?\\n\\n\r\nBesides, the visuals looks the same from the last cour of Gintama°. Nothing impressive, as expected from a low-budget production. One of the most disappointing aspects though, is the lack of new OSTs. Sure, they added some new sound, but they for the most reused tracks from previous seasons. Almost every major arc from the 2015 season had their own OSTs, so what happened?\\n\\n\r\nMost fans of the series will still love to their hearts this season. Shounen genre addicts can still find a good deal of enjoyment here. But, if you are one of the few people that loved Gintama for the writing gems it pulled out (aside the comedy), for poetic arcs like Mitsuba or Red Spider, for heartbreaking drama from Shogun Assassination and Farewell Shinsengumi arcs... Better stop. The next arc, Silver Soul, is by far only a bigger fest of the same meals compared to Rakuyo arc. Stop here, and save yourself from watching the fall of Gintama.",
            "date": "2017-05-13T21:50:00+00:00",
            "helpful_count": 12,
            "mal_id": 247625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5360302.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/agendator",
                "username": "agendator"
            },
            "url": "https://myanimelist.net/reviews.php?id=247625"
        },
        {
            "content": "Isn't it weird? Loving a show that has everything, in this day and age where everyone chase after this \"quality\" thing.\r\nGintama is one of those shows that when you're asked \"If you could ask for a sequel of a show, what show would it be?\" I don't know about you but I'll say Gintama over and over again. And really, my prayers have been answered, it's finally here alive and kicking, it feels pretty weird, amazingly good but weird.\r\nGintama has so many ups and downs in its storyline, we all know that, it's not until you accept the flaws in an anime and love themthat you become a real dedicating loyal fan, what we all love about this show isn't it's complex or twists or whatever it is that comes up your mind, its simply the beautiful way it does everything in it, and ladies and gentleman, this right there is a rare thing. \\n\r\nGintama knows how to make every single thing it does look good, it knows how to take a lame topic and evolve it to an incredibly interesting subject, that's just one of Gintama's magics. \\n\r\nGuys, we love Gintama because it's just the best kind of art there is, it's not about the storyline or the characters, of course Gintama is amazing with those but it's really about the enjoyment and just with that, this show is the most beautiful show I've seen.\\n\\n\r\nIf you havn't started Gintama yet - please, go ahead and give it a chance, you might be surprised, don't drop it mid-way, watch it carefully and just go on an adventure, a really funny adventure with the characters. Believe me falling in love with those guys is so natural that you won't even notice it.\\n\\n\r\nNow, for all the Gintabros around the world.\\n\r\nThe last season left a really deep hole in all of our hearts, finally we found out the truth about everything but the story was far from ending, that just punched us right in the stomach. That's why this season just kicked off right with the storyline without all the comedy that we all fell in love with.\\n\r\nThis makes the period at the end of the new season name seems real, the ending is right there.\\n\r\nBut don't you worry for now, even though the story is nearing its end, I know it, believe me I know it, what's coming next is going to be the best fucking arcs Gintama ever had.\\n\\n\r\nThe anime was cut short at the end and I really hope there will be another season in the near future, but for now - we have this short, amazing season.\\n\\n\r\nGet ready for it guys!\\n\r\nIt's going to be thrilling and really intenese. Take a deep, deep breath.\\n\r\nWe are going to worry, love, hate, feel, smile, laugh, roll on the floor laughing, cry from laughter and yes, there will be tears of sadness, I know what you're thinking, we want it to last forever, we don't want this period at the end, we want Gintoki with his stupid amazing smile on his face. \\n\r\nPlease, as you're feeling a little sad thinking about the ending, don't forget Gintoki's words:\\n\r\n\"If you've got time to fantasize about a beautiful ending, why not live beautifully until the end?\"\\n\\n\r\nThis is all guys, thx for reading.",
            "date": "2017-03-25T05:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 243468,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1219801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DavidTamir",
                "username": "DavidTamir"
            },
            "url": "https://myanimelist.net/reviews.php?id=243468"
        },
        {
            "content": "Gintama review \r\nTake a seat and let’s talk about a memorable story.\r\nA story that will not be forgotten , a story that will make laugh and cry , a story that will teach about life and a story that will teach you  about what is love and friends and how to value people that are close and dear to you. A story which every addicitive reader should know. \r\nStory 9/10 \r\nHave you ever saw a anime which can combine elements of comedy and drama and execute it’s concept and idea so well. The story is simple not much to say about it it depictselements from the history of Japan: Samurai, Katana, Edo-period arhitecture  buildings, the old Kyoto capital , Shinsegumi, Shogun, ninja, etc. Since this has parody in the genre elements of parody are added like skyscrapers mixed with old Japanese houses and aliens . This may look dumb and stupid at a first glance but all this elements are explained in the anime during the story and it leaves a strong impact for the viewer.\\n\\n\r\nGintama manages to use so well the parody elements  to fulfill it’s purpose of providing amusement to the viewer. Also these parody elements are combined with the drama and action this show has and as a pleasant surprise everything goes well avoiding the clusterfuck and helping with the progress of the story.\\n\\n\r\nThe themes that Gintama covers and abords are vast and the most important ones: family, love,human nature , parody and many more. Gintama doesn’t disappoints us in the slice of life genre at all as a contradiction it manages to execute that theme better than its parody genre.You will learn about  family , about love , about sacrifices , about teacher student relation, about friends everything told in a mature perspective to the viewer and with a well directed and balanced tone of comedy and drama.\\n\\n\r\nThe purpose of this anime is simple and it’s executed with no flaws , Gintama makes you laugh as hard as you can and in the next minute it makes you cry and in the end it makes you shout as hard as you can :”What a great anime I saw”. Like I mentioned the transition between comedy and drama is flawless because this anime takes time to explain the characters and their background story and every detail is not missed at all. \\n\\n\r\nThe pace in the beginning is slow (first 40) we get used to the characters , habits, actions and interactions , what they like what they hate etc. We are introduced to the crazy setting this story is set and explained step by step about the aliens, skyscrapers , and other residents from that parody edo setting. After that everything comes as a roler coaster and for the pleasant surprise of the viewer this is where Gintama shines the drama and actions scenes well directed. Its strange right a parody being better in the drama and action well Gintama is a balanced show so you won’t notice much of a difference in the transition between comedy drama and action.\\n\\n\r\nAt the end of each episode you will learn a lesson about life. Yes each character in this anime tells to the viewer a lesson about life , and leaves a memorable impact on the viewer.\\n\\n\r\nCharacters 10/10\\n\r\nDespite it’s  huge number of characters this show manages to develop each character and tell their background story without missing any detail. Even the minor character have their moments to shine in this anime and contribute to the development of other characters. \\n\\n\r\nWhat Gintama manages to exceed many expectations is how it uses these characters to tell the story. Practically the characters in Gintama are the story and each character tells his own story from each of his/her perspective. Gintama connects those stories and bring a meaning to the progression of the story and characters.  \\n\\n\r\nGintama doesn’t rushes at all  the character development it takes it time for each character at a slow pace adding elements of comedy and drama to the story. At first as any parody the characters are presented as gag characters and used to provide entertainment but oh boy  when the pace of the story increases those characters become irreplaceable in Gintama. Let me explain this statement , we get to know their story and circumstances , we are shown how they interact with other characters and how they influence each other directly or indirectly and we see the conclusion told by each character after their experience.   \\n\\n\r\nGintama is like a school which teaches his viewers about life and each character from Gintama is a teacher  who takes good care of his students and guides them through life.\\n\\n\r\nAnimation 8/10\\n\r\nGood animation, great fighthing scenes , and well directed drama scenes.\\n\\n\r\nSound 10/10\\n\r\nGreat ost and opening songs, the sound is well balanced between the comedy and drama  transition.\\n\\n\r\nEnjoyment 10/10\\n\r\n You will laugh until your stomach will hurt, you will cry until you will fill a bucket , you will feel connected to the characters , you will shout “I love this anime”  and in the end you will learn a lesson about life called Gintama.\\n\\n\r\nOverall 10/10\\n\r\nThis a story that you can tell to your kids and your kids to their kids and so on ……and in the end every generation will come up with the same conclusion :” Thank you for changing my life Gintama”.\\n",
            "date": "2017-04-12T04:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 245305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=245305"
        },
        {
            "content": "They made this season way too short. 12 episodes is nothing to what fans are used to. We want 30-50 episode seasons with fillers and lots of laughs - not just the cliche main story arc we all knew was coming with a joke thrown in here and there. Overall this season was way too short and way too serious. If nothing else is clear about this last season it is that we are approaching the end of another great anime and they no longer have the time or no longer want to take the time to make it as fun as it was inthe past. Please don't think I am bashing the series as a whole. This season and only this season was a let down. If this was standing on its own I would give it 10/10 but it isn't. It is standing on hundreds of episodes and years of story and laughs before this and has to feel the weight of all that greatness when it falls short. I still would consider the anime collectively, right up there with the best like One Piece / Hunter x Hunter / and Magi. No one would waste their time watching this season but no one would feel ultimately satisfied as with seasons passed either...",
            "date": "2017-04-13T00:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 245369,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1719881.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Theliel",
                "username": "Theliel"
            },
            "url": "https://myanimelist.net/reviews.php?id=245369"
        },
        {
            "content": "I have to say that this is my first time walking away from a Gintama season not completely blown away by it.  In fact, I would say that this was the weakest Gintama season of them all.  But, because its Gintama, even though it was weak for its own standard, it still made for an entertaining anime.   \r\nTo be honest, I was really kind of bored with the entire first half of the season.  It felt like more of the same Hack-N-Slash, Deus Ex Machina fights that most anime presents.  Normally, there is significantly high quality humor in thefirst portion of the series that mitigates that feeling in Gintama, but the humor was hit and miss and much lighter than an earlier seasons.  The arc was meant to be much more serious following the amazing events of the previous season with Shigeshige, but it just felt kind of droll throughout the entire first half, as the heroes mowed through a number of forgettable opponents.  They were really trying to play up the bond between Shoyo's students in the first half, but it just didn't really connect, because in my opinion, we've seen them fighting side-by-side for years now, including flashbacks.  It just wasn't as special for me as they were trying to make it seem.  \\n\\n\r\nBut, then we got to the portion of the anime with Kagura, Kamui and Umibozu, and Gintama raised the bar back to its usual level of quality.  The reason why Gintama is so well received is because while its comedic chops usually place it far beyond other action-comedies, when its time to get serious, its dramatic episodes are also some of the best you'll find.  That was the case with the tale of the Yatos.  Excellent back story, excellent fights, pretty decent resolution...(SLIGHT SPOILER)...with the exception of a frickin' miracle survival, which was quite cheap and ridiculous even for Gintama. If you get chopped in half? Die.\\n\\n\r\nOverall, however, this whole season was really just a set up for what I assume is the final season (for real this time) of Gintama.  Based upon how its set up, it looks like the final season will be pretty epic.  But, as such, it makes this season feel like the weakest season of them all.   \\n\\n\r\nI don't have to recommend whether or not you watch this.  If you're this deep into Gintama at this point, you're already going to.   \\n\\n\r\nStory: 7\\n\r\nArt: 9\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 7\\n\r\nOverall: 7\\n",
            "date": "2017-12-25T18:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 266392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266392"
        },
        {
            "content": "This was a deception for me, Gintama is my favorite anime and even if this season was not \"bad\" it was bad in comparison to the other seasons.\r\nThe 12 episode format does not suit the show at all. The story was way too fast paced so they used too many \"narrator characters\" who's sole purpose was to tell what is happening, why it is happening, why this character is badass, why this character is a super badass. There were also a whole lot of flashbacks and way less humor than in the other seasons. \r\nSidenote, I didn't like the opening nor the ending for once,sad.",
            "date": "2017-06-14T08:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 249891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/claudinou",
                "username": "claudinou"
            },
            "url": "https://myanimelist.net/reviews.php?id=249891"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nI'm going to keep this \"review\" more of a opinion of Gintama's overall and then this season specific.\r\nAnyhow. What I have always loved regarding Gintama, is its content of everything. I love the comedy, its absurd, random, can be vile, dirty, sweet, anyhow, everything. Have laughed countless times in this franchise. Also the humor they have also is heavily reference based, a.k.a parodies of different anime, shows, manga, live stuff, real world, anime production and so on. Anyhow, comedy/parody side of this franchise i absolutely love.\r\nNow, 2ndside of this show is the serious dramas, epic battle shounens and so on.. There are arcs that are fully comedy, arcs that are fully serious and mixtures of both. Serious side is usually quite dramatic and managed to somewhat tear me up now and then. Whilst the action sequences are absolute bliss as well. They are just presented in a really cool manner. And extra points when sometime the add artistic element.\\n\\n\r\nOf course it has its slice-of-life side and pseudo-romance. Those are weaker side, but ain't the focus. But when sometimes those are the \"focus\", then they are done in enjoyable method.\\n\\n\r\nTo sum up overall gintama's, I love the serious side and the silly side.\\n\\n\r\nArt and sound (voice acting/ost/op/ed) is something I loved in all gintamas across the board. They just click with me, bliss to look at, bliss to hear. Music (op/ed) specifically are hyped up and upbeat, which generally I don't like, but gintama is the exception where I love them. Art is cool, sometimes artistic, sometimes simple. It has a bit of everything that makes it enjoyable. And gore is absolutely satisfying as well. (well, the blood to be specific)\\n\\n\r\nWell, the serious side of stories in this anime are superb in my opinion. (or the overall idea of story that moves now and then). But wouldn't say comedic side of series story is any worse.  When at times comedy side has \"story\". It's usually quite enjoyable.\\n\\n\r\nRegarding characters I don't have much to say other than that variety, stereotypes of \"off-stereotypes\" is very large. As well characters with depth but as well with oddity is as well in great selection. Main team. Gintoki the lazy dirty slob with superb second side of seriousness and caring about friends/allies. Shinpachi the poor straight-man-act sidekick, who adds great value to the team. Kagura, the battle race girl that doesn't act like girl almost at all, or in another words a dirty slob girl in a sense.\\n\r\n-----------------\\n\\n\r\nNow, to this season specific.\\n\\n\r\nI found it a bit disappointing. Mainly because usually in gintama we have overly serious arcs or fully comedic, whilst this one had a bit of mixture of both, which somewhat ruined the experience. Plus the artistic presentation felt this time around a bit lacking. Maybe because of another studio, who knows. But anyhow, it didn't feel as superb. Rather than gintama it felt as watching just another good battle shounen anime in modern day with simplified animation.\\n\\n\r\nI mean it definitely was not any bad, just didn't have the punch Gintama usually has. Might be because it was short series, maybe because it focused too much moving on with story. It'll be shame to see it finalized in this manner.\\n\\n\r\nRest I pretty much loved as usual in Gintama franchise.",
            "date": "2017-08-21T04:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 255938,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255938"
        }
    ]
]