[
    [
        {
            "content": "Four seasons of foodgasm. At some point, I’d think Shokugeki no Souma (Food Wars) needed a break from its run. Let’s face it…the anime at this point has lost some steam since the previous seasons. What started as an experience of food ecstasy is now more about who is the best. If you want to beat the best, you have to be the best. That’s pretty much a general idea of this season as the Polar Star residents face off against the Elite 10, a group of students who are considered the best of culinary arts at Totsuki Culinary Academy.\r\nThis season didn’t take long toget straight to the point. We already know that Erina has defected from her Father’s clutches and allied herself with Souma. However, Erina is now in a conflict on whether she truly wants to cook. The season explores her character as we see how Souma can positively influence her as he did to others. Thanks to Souma, Erina regains her confidence and plays an invaluable role for the Polar Star residents. That is to say though, I’m not a big fan of Erina. She debuted in the show with a huge ego and a dogmatic attitude. However, this season shows Erina in a different light. She has changed and is now much easier to make friends with. It actually changed my impression on her as well as she values characters more than just their cooking. On the other hand, I’m not too pleased that some major characters got put on the sidelines to focus on her. I’m looking at you, Megumi.\\n\\n\r\nWatching this season also made me realize that Souma is also improving a lot since the previous seasons. He proves this by going up against one of his archrivals, Akira Hayama. If you remember from the previous seasons, the two went head to head in a previous Shokugeki that ended up with Akira taking the victory. This season pits the two against each other once more in a match to see who the better man is. And once again, it’s not hard to see how Souma positively influences Akira. However, the main conflict in the series isn’t just about winning or losing. It’s about standing up against Azami, someone who holds the academy under an iron fist. For Souma and his friends, they want to prove to the world what cooking really means. To do that, the season chronicles the rivalries between the Polar Star students (aka rebels) against the Elite 10. With only 12 episodes, it soon became obvious that the season isn’t enough to cover everything. It’s too bad really since I was looking forward to some of the more hyped Shokugeki battles. On the other hand, this season puts more value into the characters. It explores their past and almost feel like a character study. Characters that we don’t know too much about such as Nene and Azami gets their own background stories. Furthermore, the season makes us care more about what’s really at stake. Sometimes, it’s not just about being the best.\\n\\n\r\nLike previous seasons, you will witness a lot of exotic food. A short list includes bear meat, salmon, soba, among others. The style of this season is very similar to the previous with the info dump on the food along with the judges’ reactions. To no one’s surprise, this season indulges on foodgasm whenever the opportunity presents itself. And what better way to do that with the Elite 10’s talents? Indeed, expect over exaggerated moments from the best of the best showing why they are so feared and respected. \\n\\n\r\nAs a fan of the franchise, I’d say the fourth season is an improvement over the third. It became self-aware with the story’s pacing and decided to pour more value into the characters rather than rushing the plot. It’s a clever move as I’m sure fans doesn’t want to see a half-assed adaptation. While the latest season may not be the best, it still worth the time to indulge yourself into.",
            "date": "2018-06-24T09:32:00+00:00",
            "helpful_count": 90,
            "mal_id": 282095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282095"
        },
        {
            "content": "*Minimum Spoiler Foodgasmic Review*\r\nIf you did not watch S1 or S2 or S3 then go watch them ASAP before reading this! \r\nTL;DR: This season has more exploding clothes and foodgasms by packing some hype, some humour, some fan service, all while having the shittiest animation in all 4 seasons for the longest 24 minutes of your life. What more do you want? Grab a bowl, pull down your pants and start watching! \r\n[Story: 3/10 , Characters: 4/10, Art: 2/10, Sound: 3/10, Enjoyment: 4/10]\r\n\"It's time for you to go. Go figure out what you've got\" - Yukihira Jouichirou\r\nShounen genre is great. Shounen genre with food andfan service is even better. But if it can't execute it well then boy does it suck hard. As a huge fan of SnS, fans of this manga will be so let down this season with their lackluster display of commitment from JC Staff. In short, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen (boy are the names getting longer as each season getting shittier) was pretty much a train wreck that could not live up to the manga potential and kept derailing from it's path of what made this series so amazing when it first came out. If the previous season had it's flaws well this season definitely did their utmost best to further highlight their flaws. Fortunately, SnS somehow manages to make the fans happy albeit it's crappy plot arcs and dismal animation laziness. I guess if you show enough chibis and titties constantly moaning in foodgasms, people will turn the blind eye and plow through this show.   \\n\\n\r\nThe story continues off from where it left of last season since this is the second part of that. The Polar Star Rebels are waging war against Azami's dystopian gourmet food heaven. Azami is trying to kick them out of the academy by hosting shokugeki where the odds are always stacked against them but with the power of plot armour our heroes shall prevail... or will they? Seriously this show isn't that unpredictable anymore but it does have slight surprises here and there to keep your umami game strong. I guess it's good they didn't deviate much from the manga but if only they could amp up the hype before each shokugeki or food exams it would make them really exciting to watch. It almost felt rushed. Atleast the season ends well and sets up better for the upcoming season. \\n\\n\r\n\"Don't think of unnecessary things, just make a dish that suits you!\" - Yukihira Souma\\n\\n\r\nThe best part about SnS was always the cast. Despite having a huge cast, it always managed to make everyone useful. But since that's hard and studio was lazy, they just cut it in half. Don't worry it makes sense the way they did it and those that did get cut weren't really that useful except for moaning uncontrollably while losing all their clothes in the process. Anyways, the dialogues between casts were spicy and the major cast at display did great to showcase their justifications for their cause but if it keeps getting displayed using chibis it sort of loses value. Like usual, the major villain is of course, Azami. Although, his villainous purpose makes somewhat sense now from last season but a weak villain is still a weak villain. He just wants people to eat gourmet food. Erina was interesting this season. She has more knowledge than half the teachers in the academy it seems. However, the best character is probably Isshiki. The dude was the saving grace this show needed. If you watch it, you will know why. \\n\\n\r\n\"Let's have some quiet, shall we?\" - Satoshi Isshiki\\n\\n\r\nAside from the linear driven plot and stale characters, this show really fell flat in its animation quality again. Atleast last season the show sort of put in effort. This season zero effort. They just kept doing pans and zooms with coloured manga panels. Even the delicious mouth-watering clothes-exploding food felt boring to look at. If the pans and zooms were too much, they just drew chibis because animating background scenes just became that bloody difficult for them. It was just painful to watch. It feels as the season progresses, the budget invested in the quality of animation drops. As usual, compared to the battle scenes of first season to battle scenes in this season, there are significant evidence for animation laziness. Even the fan service is lacking to the point where all people can enjoy are the different stiches for different characters in that show. I mean, you know this show succeeds in exploding clothes and fan service. Give the fans what they want. Regardless of the poor animation quality, at least the opening and ending songs were slightly better but the background music was somewhat decent. Like always, the major saving grace are the seiyuus. Time after time, they are doing a phenomenal job. Azami's seiyuu really stood out this season. Rest were good as well. \\n\\n\r\n\"No matter the hurdle, you face it with a smile. You'll stare at your own weakness straight into the eye for as long as you have to.\" - Saiba Jouichirou \\n\\n\r\nOverall, SnS S3 Part 2 is an ecchi shounen anime about food that is only worth watching since you have committed yourself to watching the other 3 seasons. If you aren't a dedicated fan of this show, don't even bother. Just go read the manga. I rather your money go to the mangaka than this pathetic excuse for an anime. There is another season on the way and hopefully if they can redeem themselves from fixing the mistakes they made in season 3 then maybe, just maybe, this show will once again be worth watching. At this point, Naruto fillers had better animation than this anime. Ultimately, it's not a bad show. Just binge it on the side if you feel like it. Last review I said, \"if one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food.\" Well, S3 Part 2 is the horrible food your gf makes but you still eat it to make her happy.  It's still enjoyable to eat but we all know why you are eating it. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!",
            "date": "2018-06-24T09:51:00+00:00",
            "helpful_count": 57,
            "mal_id": 282097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=282097"
        },
        {
            "content": "All aboard the foodgasm train!\r\nShokugeki no Souma: San no Sara - Toutsuki Ressha-hen continues on from the Third Plate to the Totsuki Ressha-hen where things goes straight up a Hokkaido Tournament arc.\r\nLA does have some small gripes with this arc so LA might just start with that.\r\nThe first should be.......the animation, ohh no, no so much as the overall designs and the beautifully made foods or anything, but to it's animation direction, which Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen's excessive use of panning, LA didn't notice but it shows in excess in this arc and ohh boy was it annoying at times,most probably because Yoshitomo Yonetani, the director of this season wanted to make it like your reading the manga considering the amount of panning but man does it grated on LA when it's been used every time it could. Next would be how rushed this arc was from skipping battles being the most obvious and quickly wanting to get the small bulk of the more serious battles, sure Shokugeki no Souma has done this with it's previous seasons, but this was in new setting and newer form of tournaments, not to mention higher stakes due to the entire Azami dictatorship in place. Finally would be because of the rushed paced, the ending well..ended abruptly, as LA was expecting this arc to FINISH the Totsuki Ressha-hen arc and ohh LA doesn't know...FINISH the tournament instead of leaving it hanging, heck LA would be fine if there was another season...to the third season (hmmm the naming of the next season is gonna be crazy long) anyways this feels REALLY similar to Mahou Shoujo Lyrical Nanoha ViVid's tournament was cut short and NEVER revealed again what the last half was like, LA just hopes Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen doesn't do the same. \\n\\n\r\nOn the other side of the spectrum, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen did great in terms of characters, especially when it concerns Erina Nakiri and this is the season where she SHINES, from being the narcissistic tsundere to being the Rebel Queen standing up to her father, she probably gets the most development in this arc and once again proving LA's best waifu once again and favorite character of the anime (and this season!) for LA along with her father Azami who gets a bit of backstory to how he became how he did alongside Jouchirou Yukihira in the process of it. Now Souma himself gains more development what with Jouchirou's backstory being told and what the entire Azami deal is with him, but alot of people might once again say that Souma ALWAYS wins his bouts thus no character development, well no, as he learns more and more to be a better chef with the new challenges he faces and he's also a pillar of support to Erina as well. Erina might get the majority of the development in terms of character this season, but Souma gets more in terms of cooking. Once again, Shokugeki no Souma manages to make the food impressively tasty looking even for animated food and the animation does have certain flourishes when it CAN do it outside of excessive panning, seriously besides the panning, the animation was well pretty detailed for the most part and LA loved it all round EVEN it's typical comedic moments.\\n\\n\r\nShokugeki no Souma: San no Sara - Toutsuki Ressha-hen does bring in at the very least some backstory to the Elite Ten mainly Terunori Kuga and Nene Kinokuni this season AND even give Akira Hayama and Satoshi Isshiki something quite outside their typical character to go through. Seriously Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen's main strength is in it's characters and how they develop them further.\\n\\n\r\nIn terms of voice acting, well it's still the same voice cast as before and LA has settled with Hisako Kanemoto as Erina Nakiri by this season and this feels like coming full circle but with Hisako Kanemoto going aboard and taking a hiatus does that mean Risa Taneda gets her role BACK as Erina Nakiri? well IF there's another season...anyways, LA enjoyed the voice cast for the most part with Shizuka Ito as Rindou being a constant pleasure to hear with her witty and genki personality 100% and Kana Hanazawa as Nene with her typical deadpan serious vocals being put on her was fine, but LA would give MVP's this season to Hisako Kanemoto and Shizuka Ito this season, LA bias as fuck but LA doesn't care.\\n\\n\r\nLA was expecting Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen to be a 2 cour and expected it ohh LA doesn't know...complete the tournament it set out to build up but even with this seaosn's misgivings such as it's excessive panning, rushed pacing and the finale being just cut off during a freakin' tournament arc, LA is just a diehard Shokugeki no Souma fan to the point that it's strengths of beautiful animation when it can bring it out especially in it's food and eccentric character designs, major character development on countless characters from Erina Nakiri to Azami and Jouchirou and even some development of Souma as a chef AND character as well as some minor characters getting the limelight in a different light altogether just makes up for it.\\n\\n\r\nLA still being an utter fan of this series and bias might come into play for LA's overall feelings to this season but LA will NOT omit the serious flaws this season actually has and LA hopes that if Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen actually gets another season that it learns from this season, flourish and make it more exciting and maybe even better and make the remaining tournament arc all the more greater!\\n\\n\r\nThis train for LA isn't stopping and LA hopes this train keeps going..............just refurbished and more exciting.",
            "date": "2018-06-24T16:33:00+00:00",
            "helpful_count": 23,
            "mal_id": 282128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282128"
        },
        {
            "content": "While Shokugeki no Souma is overall a decent show, it bothers me how increasingly contrived the plot and setting are becoming with the addition of Central as the series' new overarching villain. \r\nCentral forces certain rules and regulations on the students and restricts their freedom of expression while cooking. They also attempt to sabotage certain students attempts at passing their final exams. It's true that Souma and his friends have always been underdogs, but this just seems like overkill. Constantly having bad things happen to the main cast because practically the entire cooking world is against them isn't entertaining-- it's honestly cruel, and isn't reallyfun to watch.\\n\\n\r\nIt's also incredibly boring to see anime scenes directly cut and paste from the manga, with no movement or action being implemented to actually make use of the animation medium. There are SO many still shots and camera pans while characters just stand there and talk. Why animate Shokugeki no Souma if you're just going to keep everything still and listless, and not give any sort of dynamic to what happens in the manga panels?\\n\\n\r\nAll said and done, there isn't anything technically wrong with cour 2 of season 3. The art, sound, and characters are all fine. However, because of the jarring shift in plot and setting, as well as the lack of novelty in the animated adaptation itself, my enjoyment of this show has definitely gone down from previous seasons.\\n\\n\r\nOverall: 7/10",
            "date": "2018-05-01T20:21:00+00:00",
            "helpful_count": 21,
            "mal_id": 279544,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4982590.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/khattikeri",
                "username": "khattikeri"
            },
            "url": "https://myanimelist.net/reviews.php?id=279544"
        },
        {
            "content": "Continuing from what the story of the proud, funny and excellent chef Yukihira Souma and his gang from Food Wars: The Third Plate, the anime is back from its over the top food-gasm. Although this second course of the Third Plate seems quite good, we still have to consider that J.C Staff clearly disappoints us yet again by putting the waiting card to our eyes.\r\nThe story starts of with Central's preparation along with Polar Star Members preparing for defense. We get to see from the first episode the development of Nakiri Erina, who rebels against her father's doing towards Central's success. We were given episodeswhere the rebels have to push through the limits. Learning everything and then comes down the fight.\\n\\n\r\nTypical Food Wars anime word is \"Shokugeki\" and we are given a few only this second half. Although one of it was very exciting. The fight with Souma against Hayama Akira is how we see Souma develop through his cooking from his defeat at the Autumn Elections. We see how he could go to an extent to find ingredients just to beat the heck out of his rival and we also see Hayama being the spice master himself although, what was different in the two sides was inspiration.\\n\\n\r\nSouma turning defeat into victory while Hayama being controlled by Central and not going through his own cooking was the turning point. Back stories are typical to every anime and we finally get to see the back story of Souma's dad Jouichiro, where it told how Erina's father Azami turned into a beast and planned Central. We get answers to questions from the last season which is the first half and some good shokugekis on this second bout, although here comes the ending of this second course.\\n\\n\r\nLike the first half ending at the half of the series and making the fans wait for months, we get the waiting game again, stopping it in the very moment where things gets to the interesting parts. If you are a Shokugeki fan, you know its disappointing to see that the part where you have been wanted to animate for so long, and its just so near to you, leaves you again and makes you wait for months again to continue. It is annoying for me as a fan of the anime to wait although what can we do? I have to give credit to the openings and endings though. From the past Shokugeki franchises, this one is at the same level of goodness and it should be. Its good song and good visuals. Speaking of good visuals, the art didn't change that much and the ecchi foodgasm still lives up to the height. Overall, this second cours was exciting but came crashing down as the fact that we won't get to see what lies ahead of the rest of the fight against Central.",
            "date": "2018-06-24T10:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 282102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=282102"
        },
        {
            "content": "This a review in progress people. So lets get straight to it. \r\nPlot:- This show is still interesting as ever. Hasn't failed to deliever entertainment just like the previous seasons. Not gonna spoil anything. If you liked the previous seasons you're gonna like this. \r\nSound:- Its decent but not that great. Moving on. \r\nArt:- Here's what people who loved the previous seasons are triggered about. The art is not pretty. its not so bad that you gotta drop the show(nobody gonna drop this show ever lol) , but its bad considering the high standards of the previous seasons. its still good but average. We justhave to wait and see if anything improves or not. \\n\\n\r\nOverall:- Show is still interesting and gripping as ever plot-wise (tho its still way too early to say anything, till now its been great). Art quality has decreased a bit from last season, average good but not great.  Other than that, everything is fine. Nothing else to get triggered about. If you don't care about art and animation and just want to enjoy the show, you're all good. overall a really enjoyable show. Highly recommended.\\n",
            "date": "2018-05-20T20:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 281049,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6184395.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ashes_",
                "username": "Ashes_"
            },
            "url": "https://myanimelist.net/reviews.php?id=281049"
        },
        {
            "content": "I'm going to have a hard time waiting for the next season of this anime. \r\nThe suspense, action, and drama in this half of season three is unmatched by any other arc of Shokugeki no Soma. It is quite a lot to follow as there is a lot of new information thrown at you all at once, but it's amazing nonetheless. \r\nThese final twelve episodes will finally answer some questions you may have had about the more mysterious characters in the series. Isshiki and Joichiro are a couple examples of that. The battles get way more intense, and the sense of comradery between former adversariesis formed. \\n\\n\r\nBesides all that, the singular best thing about this half of the season is the fact that we get to see some serious development from Erina. The friendships and bonds she forms with everyone is truly awesome. \\n\\n\r\nI'd also like to add here that this season as whole provided, not only a darker storyline, but a more touching one. Those two aspects are what I'm hoping to see carried over into the fourth season. Here's hoping it comes soon!",
            "date": "2018-06-25T20:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 282243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=282243"
        },
        {
            "content": "Oh shit another sequel has just ended, and we're left to wait for another sequel,  anyways, nothing sooo far has changed after the 4th sequel, Polar Star Dormitory Roques were still not done with them Elite 10 yet, and it'll probably take a couple of more sequel to end it unless JC Staff plans to extend it by introducing another batch of cocky cooks who were out to duke it out with Yukihira, the only things that were different here was seeing Erina resigning her seat from the elit 10 and so as the streker elite 10 Isshiki Satoshi. also the setting has change,no longer in campus. As for the ART category of this anime, well, just like it's sequel, we still see then judges or anybody who tasted any food being show in a metaphoring naked glory, but sometime them tasters would be in some obnoxious customs to exhibits some for of ecstasy, still there were some panty services around, like that of Nene Kinokuni, pretty sure that every time a guy sees it would have a field day,,,,,SHIT!Despite of it all, the excitement is starting to waiver where it can be compared to eating curry everyday and staring to get tired of it that you would wanna, just throw it to the dogs WOOOF! So this is how I see this:\\n\\n\r\nStory-Mediocre 5: Still the same shit where even as 3 Elit 10 has lost, also the part where roque muscle guy Tousuke Megishima beating elite 10 whomever she is wasn't shown, which is quite unfair.\\n\\n\r\nArt-Mediocre 5: Still the same shit where you see some of those metaphoric ecstasy of satisfaction where the judges goes naked and some occasional panty services , and btw no nipples and no still nao hairy pussies.\\n\\n\r\nSound-Good 7: It may still maintains the usual voice actors whom were doing who, but the score was for the opening and closing theme.\\n\\n\r\nCharacter- Mediocre 5: Still the same shit, and I need not say more.\\n\\n\r\nEnjoyment- Good 7: Since I still find it entertaining, but barely. \\n\\n\r\nOverall-Mediocre 5: Watch it as a chore. \\n\\n",
            "date": "2018-06-25T13:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 282203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=282203"
        },
        {
            "content": "I must say that this show have lost the flame that it ones had with me.\r\nI enjoyed the first season, but they don`t really evolve.... The Food that Souma made in the beginning was already being potrait as amazing, and it kept on going, and for me at least, it does not really feel like he is getting better. And even though the main cast is lovable, the rest sucks... The judges ALWAYS gets hyped up, but end up saying the same thinks and acting like the judges before them.\r\nAnd there is limits to how amazing you can make food, because in the end itis just food, and it is also very limited to descripe. It always come out as \"There is more aroma in this one\" or \"UUUH THE TEXTURE IS AMAZING\" and just keeps on going while there clothes gets ripped off.\\n\\n\r\nthere were a constant kind of creativity over the show in the start, but now its just\" This dude makes better food, just because he does\".... It would be more amazing, if they change it up a little. Like let a judge say \"Uh this is bad food because bla bla\" but that never happense.... All the food is amazing, everything is on the top...\\n\\n\r\nit just dont work for me anymore... If it was not because of a certain episode, this season would have just been very bad and not enjoyable for me...\\n\r\nUnless you guys are food freaks, i do not recomend watching this... it just follow the same formular, and in theory they could make this a serie that would never end, because that is how little that is actually happening...",
            "date": "2018-10-30T17:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 293019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505525.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BartTheDrake",
                "username": "BartTheDrake"
            },
            "url": "https://myanimelist.net/reviews.php?id=293019"
        },
        {
            "content": "As we encroach ever further towards the maga's more recent arcs, Shokugeki no Souma has proved itself to be as popular as ever by pulling off yet another half cliffhanger by separating a major arc into two separate seasons.  So, how does this second half of the third season stack up to what we've seen previously?  Well, poorly.  At least by comparison.\r\nStory:\r\nPreviously on Shokugeki no Souma, all of Tootsuki Academy is now taken over by Azami Nakiri, Erina's father who has instilled a regime on the cooking academy that gets rid of competition within the students by sacrificing their own individuality as chefs and cooksand turning them into carbon copies of each other in order to make it so that 'Central's' gourmet is the only gourmet food that's worth existing and everything else is considered as 'animal feed' by comparison.  As Souma and his friends reject this concept of being forced to give up their individuality and creativity as chefs, they are branded as rebels, and fight back against the regime to continue staking their claim in the culinary world.\\n\\n\r\nThis section of the story is what I consider to be the series's slow descent from the high pedestal it's been put on.  This is largely due to the typical shonen problem of 'escalation', where in order to keep the show's traction, the stakes have to be shot up through the roof in order to keep viewer interest.  By this point, the story has made it abundantly clear that it's going for a \"Us vs. Them\" mentality where the entire school badmouths and spends an exorbitant amount of resources in order to defeat the main characters, which has an obvious outcome because there's still a series to make.  As such, the show paints such a black and white picture of the whole situation that I find it difficult to sympathize even with the protagonists cause by this point it's kind of obvious what's going to happen, whereas previously, the show focused primarily on a numerous amount of rival-based characters, which with the way these characters and the story were written, did not have as predictable of an outcome as it could've had.\\n\\n\r\nOn the flipside though, the show still manages to pull off a great number of food battles which, while predictable, do excel in the fact that each round of bouts provides new and interesting culinary information, as well as a good deal of character info and backstory that 'humanizes' the bosses, even though we're not going to see them much after their space in the limelight is over.  Both Souma and Erina are great examples of this happening, as their characters and personal growth do gain some significant changes that otherwise wouldn't be present.  That being said, I feel as though Erina has the more significant of the two since unlike Souma, she has more noticeable changes outside of the customary food tournaments, which given her introductory character at the start of the series, is a very welcome change.\\n\\n\r\nAll that being said, I still find it difficult to give the show any deserving praise because Shokugeki has funneled itself in such a hole where in order to continue the story, the stakes are more or less their 'way of life' being put on the line, and that to me has very little value because there's in no way shape or form is that of all things going to be lost in a super mainstream shonen jump series; it's just not going to happen.  Because of this, it feels like Shokugeki is just going through the stages of a popular shonen, and that's a shame considering how much more well-written the series was in previous arcs by comparison.\\n\\n\r\nOverview:\\n\r\n+ Useful characterization for its cast\\n\r\n-  Super high stakes devalue story quality\\n\r\n-  Kind of predictable\\n\\n\r\nCharacters:\\n\\n\r\nThere's not much to be said for the characters beyond what we see with Erina and Souma.  Much of the series's devotion to character development is focused on these two as they're the primary main characters of the series.  Souma more or less develops by learning from his past mistakes and using those as stepping stones to get better, whereas Erina spends much of her time in the limelight devoted to developing a better personality separate to the haughty queen schtick she's been pulling for almost four seasons now.  So for them, there's a clear improvement in character quality and is a commendable effort to make for better characters.\\n\\n\r\nHowever, everyone else sort of suffers from a lack of meaningful development outside of the customary 'Shokugeki'.  Most of the rest of the cast is thrown to the wayside because they needed a way to add even MORE stakes to the equation (as if getting expelled wasn't enough), and the few members that do stay behind more or less get attention put onto them only when they're cooking.  Sure their points are interesting, and enemy characters/people we've know but don't know too much about do get backstories and more depth added to them, but in reality, they only get the much needed characterization during specific times.  Any other time aside from that is sacrificed for more Central shenanigans where everyone has a hate boner for the MC just because he wants to cook the stuff that he wants to cook.\\n\\n\r\nOverview:\\n\r\n+ MCs get more development\\n\r\n+ Side cast members get development\\n\r\n- Side cast development happens only during selected times\\n\\n\r\nArt:\\n\\n\r\nThis might honestly be the least animation-heavy shonen series I've seen in a long time.  While J.C. Staff has been exceptional at being consistent in art quality for both the show and especially the various dishes that the characters' make, the appearance of which is beyond appetizing, there's...not actually that much animation going on.\\n\\n\r\nMore specifically, the show plays a lot like a slideshow, as the camera changes so often to different characters giving their various inputs on the situation that when you stop to think about it, the show has hardly ANY animation to it aside from basic lip movement to get the characters to talk.  Sure you still get your foodgasms, and those in no way shape or form have disappeared or have lowered their presence in the show, but even that I feel has been subjected to the 'slideshow' problem as the show primarily consists of stills and cutaways.\\n\\n\r\nPart of this I feel can be blamed on the original paneling of the manga and how that's structured, but regardless, the transition isn't great from a visual standard, and it's weird to think that a slice of life moe show probably has more frames devoted to animation than a supposed battle shonen.  Food for thought.\\n\\n\r\nOverview:\\n\r\n+  Good artwork\\n\r\n-  Almost no actual animation\\n\\n\r\nSound:\\n\\n\r\nPersonally I found the tracks and everything to not be that noticeable.  I find this to be a recurring thing with Shokugeki no Souma's OST, as the OP's and ED's get less and less memorable and impressive as time goes on with each season.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nThis and the Central Arc is by far my least favorite arc in the Shokugeki series.  This is primarily due to the fact that the show escalates the stakes in the show so quickly so fast, that as a viewer, I sit in shock asking myself, \"What on earth happened?\"  Think about this, prior to this, the series was on the moon festival arc, where students participated in a food festival and made money/showed off what they were capable of at a yearly event.  Then in the blink of an eye, the entire school government changes to the highest ranks having all of the power, every existing club on campus gets gutted for no other reason but \"Glory to Central\", and roughly half of the season is dedicated to purposely handicap and try to expel students for wanting to pursue their own interests.  I realize there's actually a reason for why Azami abolishes the current school structure in favor for Central (no matter how stupid it is), but really, what the actual fuck happened?\\n\\n\r\nBecause of this, I don't find it easy to sympathize with any of the rival characters this time than I did previously before.  Sure they do the usual cooking smacktalk and dick measuring to prove that they're better than the MC before they even get near a stove or hold a knife, but there's just something that was more satisfying about someone like Subaru or Kuga from before fighting against Souma than this time around with his current round of opponents.  I think it's primarily because the show's stakes during previous arcs were less intense, and losing a bout wasn't the end of the world.  Souma didn't face expulsion as commonly as he does this time around, and making that one change makes it that much harder for the MC of a shonen series to lose because if you do that, the series is basically over.  Backstories are nice, but the glaring problem of such overwhelming adversity equal to \"You vs. The World\" makes it any difficult for me to find any enjoyment when something this major becomes a central point of the plot.\\n\\n\r\nAs such, I find this section of Shokugeki to be less quality than previous arcs, finding myself in a weird spot at recommending this for people.  It has its good points sure, but all of that is overshadowed by the fact that the show has such vehement hatred for the main characters, which makes it hard to even consider the other side as probably good people.  A shame since burning rivalries was such a core component of the show prior that made things so much more exciting when two interesting characters go head to head, locked in food combat to prove who truly is the better chef.  All of that magic feels like it's gone a bit, and that's why I feel like the series as a whole is falling in a downward spiral.",
            "date": "2018-07-10T14:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 283649,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=283649"
        },
        {
            "content": "First of all I am kinda tired of hearing the same stuff about SNS's latest season from different people on different media platforms. I mean let's be honest 80% of the stuff they say it's copy paste from each other or some elitist view about the show....we all know what they say so I won't talk about that instead I will say what has this show accomplished so far especially in this Second Cour. So let's tell the truth cu's that's what a review is supposed to do right?\r\nWell Erina has characterization across those 24 episodes , she is not  anymore the girl whoalways bumps  each day head to head  with Souma becoming annoying at some point.She is a character part of this enjoyable and great nowadays show but not any kind of character one who has a weakness which makes her more human like more relatable for viewer. The people from the Polar Dorm have development, the Elite ten are not a mystery anymore ,Alice has characterization, Joichiro has characterization, Azami has characterization....Everyone has in this current season .....Even some unresolved past things regarding the main character are solved in this season.....\\n\\n\r\nI am hearing left and right the same thing about how Souma's gang has become strong from nowhere or how Souma beats his opponents from nothing.....well let me clarify you one thing for those who didn't quite understood were all that development came from.....As a sns fan you probably remember season 2 the Autumn Selection and Stagiare Arc...Well from those arcs and plus Erina's guiding and knowledge about cuisine that she shared with the people from the Polar Dorm in the current season all together are a fair and justified way of development for the characters.\\n\\n\r\nLet's not forget the fact that Souma's hardworking and recipies tried  over and over again each night with no sleep, the France cuisine knowledge he gained from Master Shinomya during the Stagiare Arc all of those stuff helped him developed his own cooking. And I think it's about time he beat someone  in this season don't you think so?As he did ..... \\n\\n\r\nThe  foodgasms decreased in this season, instead we have symbolism to depict the current cooking style and art of cooking for each character and as a plus it gives you a fair amount of how epic this show is! The Elite ten had some characterization during the Shokugeki Team battle to give you an example the way they used the duel between Nene and Souma adding Ishiki into the mix to depict his bond with Nene and their own cooking style that made them what they are today as chiefs. Let;s be honest with our ownself, the moment was damn emotional and epic at the same time! As expect form SNS!\\n\\n\r\nEnjoyment has always been a + factor for this anime and  regarding that this season doesn't disappoints at all, the heartwarming moments combined with the flashbacks and ost depicting the road each character has chosen and what they have accomplished as cooking chiefs gives me each time the reason to say:\"GOAT GOAT GOAT \" and cry of happiness and sadness! The most important factor are the detailed recipes and the way this show expands and explores the cuisine world making it very easy and accessible for the viewer to understand and for that I am glad Jc Staff adapted the source material!\\n\\n\r\nI can talk about the tone of the color used for each flashback , about the ost used about the symbolism about the VA which everything is done in harmony but that will be a bore fest so I will let you see it with your own eyes cu's you know the saying:\"Practice is the mother of all things!\".\\n\\n\\n\r\nEnjoyment  + Symbolism + Suspense in each episode + Detailed Recipes + Heartwarming moments+ Great characters this season is the perfect recipe to watch a good show!\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-06-25T07:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 282164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282164"
        },
        {
            "content": "This show is still as ugly as sin. I'm not hating on the show: I loved the first two seasons. Objectively speaking, it is impossible for any experienced anime viewer to say that this show actually looks good visually. The key frames are consistently static and It is a rare occurrence that you actually see any animation asides from lip flaps and the constant. sliding. of. the. camera. This season is literally a sliding powerpoint presentation. If the show actually had even decent animation this wouldn't bother me so much. The art is the absolute worst part of this half of the third season. \r\nIfyou're questioning my reasoning, watch one episode of the first or second season and compare it to an episode from this season and pay attention to what is actually happening on screen. Notice that nothing is actually happening asides from sliding camera pans.\\n\\n\r\nThe overall trope showcasing the underdog/secret overdog reforming the system as well as the theme of pristine, heartless, haute cuisine v.s. personal, self expressive cooking has always been the lifeblood and undercurrent of SnS. It doesn't knock you in the head screaming in your ear that it has these themes. There was at least some subtlety to it and respected the viewer's intelligence. But this season, the show just shoves it front and center making the most basic, black and white scenario. The whole \"rebels\" of polar star vs Central just was beyond basic. Took away all forms of subtlety to the show's theme. Given, this is probably the manga's fault.\\n\\n\r\nAnd following the dumbing down of themes, episode structure has somehow gotten even blander than the first half of this season. It's always the same buildup and payoff, with stakes that are nonexistent to the viewer. Oh, the stakes are there. It's just that we've become completely numbed to the \"If Soma doesn't win this, he'll be EXPELLED!!\" threat. \\n\\n\r\nThe fact the show is still apparently just as popular as the prior two seasons will give the creators no incentive to bump up the standards.",
            "date": "2018-05-15T22:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 280667,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6040311.jpg",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yenrz1345",
                "username": "yenrz1345"
            },
            "url": "https://myanimelist.net/reviews.php?id=280667"
        },
        {
            "content": "Once again, Shokugeki no Souma has been amazing. I remember back to when I was shiny new to anime and refused to watch it because it was too ecchi and I shake my head at myself. The fanservice is back this season but it's still more of a funny aspect of the show than anything serious so it's still fine.\r\nThe biggest reason I loved this season was the character development. Talking about some of the characters before this season started - especially Erina - I was frustrated to realise there was such little development going on from season to season. I wanted Yukahira to stopbeing quite such a mystery and and I wanted Erina to do more than flip her hair and be elitist. I got it! We get info on Joichiro's time at Toutsuki and Erina gets growth like crazy.\\n\\n\r\nI'm not sure if this would make sense to just jump in but for fans of the series it's very much worth the watch. I'd also highly recommend going back and watching the first seasons if you haven't. You'll learn lots about food and be entertained!",
            "date": "2018-06-26T18:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 282311,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6908771.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hikari-Are",
                "username": "Hikari-Are"
            },
            "url": "https://myanimelist.net/reviews.php?id=282311"
        },
        {
            "content": "STORY - 7\r\nART - 7\r\nSOUND - 8\r\nCHARACTER - 8\r\nENJOYMENT - 7\r\nPart two for the third season of Shokugeki no Souma continues to gush out the lustre of stomach-filling nourishment to fill our appetites up. This time, The Third Plate: Totsuki Train Arc is a sugary sensation dripping with all the sweetness enough to entice many sweet-toothed hungers out there. But perhaps, this is a diabetic obsession. After all, a little too much sprinkle calls for a sickly toothache, and we probably don't want that right?\r\nLooking back to the first season, a slope that shows a burning rise in temperature and conflict had been drawn.A show turned from lighthearted to highly competitive, even more so after the Elite Ten entered the fray. And here we are, with what is currently the biggest obstacle these students, the Rebels, have to face. Azami and his organization named Central. To face off against a single system is definitely an interesting concept. It added more challenge, and integrated a blazing desire to not let cooking fall into the hands of the wrong person. But this meant the lighthearted food galore and foodgasms were reduced, a trade-off which smoked out one of the appealing core this series had. To add more to this oversweetened candy, fast pacing was present, especially in early episodes. This awkward flow of information felt rushed and prevented enjoyment from reaching its peak. While it's a loss, it didn't awash everything completely and finding enjoyment here was definitely possible. With the threatening presence of Central, the effect they had on various characters were shown. There's a beautiful testimony found in cooking where no matter the level of talent, as long as you have the passion for it, cooking can be fun. It's a contrast to Azami's quite far-fetched philosophy. His history did explain why he has this view, but it's clear that his feelings towards culinary industry as a rotten world is a trigger for those from the Rebel side. Particularly for his own daughter, Erina. Her developmental progress as she gradually changed into a better person around her newfound friends was inspiring. That's why this second cour is a show of emotional investment. A highlighting of the passionate ideals for cooking found in different people, both from the entertaining to the more appalling ones.\\n\\n\r\nStepping back to see what the sweet looked like in appearance, the rich and vibrant colors were all it took to get your teeth on it. Every scene, brightened up and attractive, will definitely lure passing eyes towards it. But there's a production fault within the sweet. With the fast pacing in the narrative, the show was visually affected by the quick changes in scenes, creating a rush of information. There's a disappearance in dynamism for the animation. It was quite a downgrade and looked more like static poses compared to its prequels. J.C.Staff tried to justify the lack of movement by panning the shots more often than needed which only achieved the opposite effect. Distraction was what came out of it and it's certainly not good for a fast-paced anime. On a more positive note, every culinary dish were presented with mouthwatering temptations, sparkling deliciousness with details. Whoever drew them truly have the power to make everyone hungry. We'll definitely drool alright. There was also the much-loved humor that didn't lost most of its appeal. At least they got the expression and comedic chibiness right, a nice touch to squeeze in a bit of much-needed laughter among the waves of drama. Amplified by the voice actors, whether it's the funny or the more emotional moments, certain tones in the character's voice helped convey the correct effect at the right time. So there will be times when you are laughing at one bit but was immediately put back into seriousness without a break in integrity, all thanks to the voice-acting. While no new soundtracks played as this is still the second cour, it was not needed. This series has the perfect soundtracks to evoke the emotions of cooking. Each scene were backed up well by the soundtracks, enough to even make a cooking show intense.\\n\\n\r\nThe Third Plate: Totsuki Train Arc is the cotton candy of Shokugeki no Souma. You can feel its fluffy and light texture, but exposed to the air for too long and it'll turn into a sticky crystallization of sugary flavors. I don't know about you but I like my cotton candy how I like my velvety blanket. But oh well, I wouldn't mind gobbling it up even with the annoying stickiness. It's still a yummy confection at the end of the day.",
            "date": "2018-06-24T15:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 282126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=282126"
        },
        {
            "content": "I Love Shokugeki No Souma so much (Masterpiece) my favorite character is Saiba Yukihira and Erina Nakiri Plus Alice Nakiri, Arato Hisako, Korukiba Ryu, Hayama Akira.......... But the season of Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen\r\n; i tought this season finished at least with 24 episode (12 episode so short) i don't understand what the hell with you guys (Tsukuda Yuuto) FUUUUUUUUUUUCK IT???!!!!!!!!!!!!!\r\n\"It's time for you to go. Go figure out what you've got\" - Yukihira Jouichirou\r\nShounen genre is great. Shounen genre with food and fan service is even better. But if it can't execute it well then boy does it suckhard. As a huge fan of SnS, fans of this manga will be so let down this season with their lackluster display of commitment from JC Staff. In short, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen (boy are the names getting longer as each season getting shittier) was pretty much a train wreck that could not live up to the manga potential and kept derailing from it's path of what made this series so amazing when it first came out. If the previous season had it's flaws well this season definitely did their utmost best to further highlight their flaws. Fortunately, SnS somehow manages to make the fans happy albeit it's crappy plot arcs and dismal animation laziness. I guess if you show enough chibis and titties constantly moaning in foodgasms, people will turn the blind eye and plow through this show. \\n\\n\r\nThe story continues off from where it left of last season since this is the second part of that. The Polar Star Rebels are waging war against Azami's dystopian gourmet food heaven. Azami is trying to kick them out of the academy by hosting shokugeki where the odds are always stacked against them but with the power of plot armour our heroes shall prevail... or will they? Seriously this show isn't that unpredictable anymore but it does have slight surprises here and there to keep your umami game strong. I guess it's good they didn't deviate much from the manga but if only they could amp up the hype before each shokugeki or food exams it would make them really exciting to watch. It almost felt rushed. Atleast the season ends well and sets up better for the upcoming season. \\n\\n\r\n\"Don't think of unnecessary things, just make a dish that suits you!\" - Yukihira Souma\\n\\n\r\nThe best part about SnS was always the cast. Despite having a huge cast, it always managed to make everyone useful. But since that's hard and studio was lazy, they just cut it in half. Don't worry it makes sense the way they did it and those that did get cut weren't really that useful except for moaning uncontrollably while losing all their clothes in the process. Anyways, the dialogues between casts were spicy and the major cast at display did great to showcase their justifications for their cause but if it keeps getting displayed using chibis it sort of loses value. Like usual, the major villain is of course, Azami. Although, his villainous purpose makes somewhat sense now from last season but a weak villain is still a weak villain. He just wants people to eat gourmet food. Erina was interesting this season. She has more knowledge than half the teachers in the academy it seems. However, the best character is probably Isshiki. The dude was the saving grace this show needed. If you watch it, you will know why. \\n\\n\r\n\"Let's have some quiet, shall we?\" - Satoshi Isshiki\\n\\n\r\nAside from the linear driven plot and stale characters, this show really fell flat in its animation quality again. Atleast last season the show sort of put in effort. This season zero effort. They just kept doing pans and zooms with coloured manga panels. Even the delicious mouth-watering clothes-exploding food felt boring to look at. If the pans and zooms were too much, they just drew chibis because animating background scenes just became that bloody difficult for them. It was just painful to watch. It feels as the season progresses, the budget invested in the quality of animation drops. As usual, compared to the battle scenes of first season to battle scenes in this season, there are significant evidence for animation laziness. Even the fan service is lacking to the point where all people can enjoy are the different stiches for different characters in that show. I mean, you know this show succeeds in exploding clothes and fan service. Give the fans what they want. Regardless of the poor animation quality, at least the opening and ending songs were slightly better but the background music was somewhat decent. Like always, the major saving grace are the seiyuus. Time after time, they are doing a phenomenal job. Azami's seiyuu really stood out this season. Rest were good as well. \\n\\n\r\n\"No matter the hurdle, you face it with a smile. You'll stare at your own weakness straight into the eye for as long as you have to.\" - Saiba Jouichirou \\n\\n\r\nOverall, SnS S3 Part 2 is an ecchi shounen anime about food that is only worth watching since you have committed yourself to watching the other 3 seasons. If you aren't a dedicated fan of this show, don't even bother. Just go read the manga. I rather your money go to the mangaka than this pathetic excuse for an anime. There is another season on the way and hopefully if they can redeem themselves from fixing the mistakes they made in season 3 then maybe, just maybe, this show will once again be worth watching. At this point, Naruto fillers had better animation than this anime. Ultimately, it's not a bad show. Just binge it on the side if you feel like it. Last review I said, \"if one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food.\" Well, S3 Part 2 is the horrible food your gf makes but you still eat it to make her happy. It's still enjoyable to eat but we all know why you are eating it. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!\\n\r\nI found this review Helpful",
            "date": "2018-06-25T02:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 282148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6063520.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mehdielmoufid",
                "username": "mehdielmoufid"
            },
            "url": "https://myanimelist.net/reviews.php?id=282148"
        },
        {
            "content": "This has definitely been the weakest season so far imo. Felt extremely rushed and the worst part has to be how they've just cut out practically all the actual COOKING in a cooking shounen show. Heck that's like half of the reason I enjoy the series so much.\r\nAlso still scratching my head about how they were making the team shokugeki out to be a match where teamwork plays a big role (wasn't that the point of the Saiba vs Dojima practice match) only for there to be absolutely ZERO teamwork in the actual team shokugeki.\r\nAnother downside of this season has definitely been the pacing. Feltway too rushed imo. I know that this arc is apparently dragged on too slowly in the manga, but the anime's solution of just blasting through the content is not any better. The biggest victim of this would have to be the actual cooking in the shokugeki's. Only giving us a little (and later on, none at all) of the cooking process and then just jumping into the judging stage doesn't give the victories as much weight. Also didn't like how they skipped a whole section of Yukihira and co. gathering up their team for the final match (though this is apparently how the manga did it).\\n\\n\r\nIf it gets any more seasons, it'll have to step up to the level of the previous seasons to have me come back to this show cause this season definitely has soured me to the adaptation as a whole.",
            "date": "2018-06-25T01:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 282145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3328399.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chisel",
                "username": "Chisel"
            },
            "url": "https://myanimelist.net/reviews.php?id=282145"
        },
        {
            "content": "First review status here. On the flip side this continuation of Shokugeki no Souma has created a whole new athmosphere of intensity! More battles, more action, and even higher odds. Considering this has officially turned to the battlefield instead of a simple slice of life, the over all plot intensifies.\r\nPersonally i love this style of art and by spending the last seasons on character development, this one took advantage of that prior knowledge and really sparks the beauty behind each characters development. \r\nI love to recommend this season to several of my friends and I honestly would recommend it to probably everyone because its justa bunch of fun and really does show the awesome jam packed battle that food wars have become!",
            "date": "2019-03-18T18:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 303821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6250528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hondakun2008",
                "username": "Hondakun2008"
            },
            "url": "https://myanimelist.net/reviews.php?id=303821"
        },
        {
            "content": "I finally understand why sequel seasons get higher ratings; not only does the audience shrink to those who liked the previous seasons (mostly), but the writing gets more polished and more focused.\r\nHere, with the 3rd season, we see this in full play: energy, entertaining plot twists and suspense.\r\nStory & Characters: 7/10\r\nI'm grouping these together because they're similar. If you were to describe the plot, it's essentially a shonen with cooking. The characters are those you'd find in any standard anime of this genre: always supportive, optimistic, good always triumphs etc etc. But that's something we learn in season 1.\r\nNo, we've stuck around til season 3because it's not about the end result, but the journey - and this is usually what makes and breaks your standard shounen as well. The have added depth and cliff hanger after cliff hanger, that just throws you deeper into a world you didn't think had the potential for depth. \\n\\n\r\nCharacters who were \"tsundere\" get their backstories, new characters come into play and shake up the old, bringing in some new. And of course, it's always interesting seeing how the old and familiar characters deal in their separate ways with said 'new'. You really see how imaginative the creator is, and how they truly know how write, to keep us hooked on a plot purely about cooking. \\n\\n\r\nArt: 10/10\\n\\n\r\nThis is the shining star of the show. The brilliant and broad color palette elevates the show to another level. The finished dishes produced are so incredibly appealing, so mouth-watering, and so beautifully animated that we can show these dishes to people who have never seen anime. Even they will be able to appreciate just how well animated it is - and showing outsiders anime is not something one can easily do ;)\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nShokugeki no Souma truly encaptures everything an anime is: unrealistically colorful, full of too much energy and keeps you hooked through the entire thing. It does what every good show should do: have you clicking on 'Next Episode'. \\n\r\nIt's fast paced, and full of feel good moments, that even though corny at times, doesn't stop you from feeling helplessly satisfied.\\n\\n\r\nThis is a show I'll greatly miss, and I have no doubt I'll be seeing a sequel soon enough.",
            "date": "2019-01-08T16:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 298469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312651.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/itssimplyme",
                "username": "itssimplyme"
            },
            "url": "https://myanimelist.net/reviews.php?id=298469"
        },
        {
            "content": "Shokugeki No Soma is a strange beast. It annoys me, but makes me laugh all the same. It's like one of those annoying friends who keep on bugging you, but you can't help but like them a little.\r\nStory: The story in Shokugeki No Soma is the low point of the series, meaning, there isn't much story. Soma wants to become a better chef than his dad and ends up going to a high class culinary school. The plot is simple, but it works. In the world of Shokugeki No Soma people settle a lot of their disputes through food battles, which have people make extremereactions according to the food. This ends up with mostly being ecchi stuff, like people losing their clothing, but can be fun (\"Oops. I turned into a young girl for a second\" hint hint). Tragically, I think the writers must have had a hard time writing about food as it mostly boils down to \"The umami of this works well with the umami of that. The sourness enhances the umami. Umami this, umami that...\". It's like 90% of all taste is suddenly umami. I call that \"bullshit\" or \"horse crap\".\\n\r\nArt & Sound: The shows art style is nice and flexible, switching fluently between detailed drawings and a more simplistic style (usually when the character aren't acting seriously or for comedic relief). This is well done and goes well with the show. Also, the food is nicely drawn and kinda makes me hungry sometimes. The sound is also very well done, with nice voice acting and good sound effects.\\n\r\nCharacters: The character are a diverse trope filled with most of the stereotypical characters, some mixes and a few, a bit, original. They are enjoyable enough, but usually doesn't get you too invested in their lives.\\n\r\nOverall: Shokugeki no Soma annoys me often, especially with way they describe flavors, but it's a fun watch with enough to keep me watching it all the way. If you're not super against flashing of skin (with awkwardly placed light beams or items placed in front of the more daring areas) or drawn underwear, and want some, over the top, extreme comedy this is a nice watch. Intensive, mostly brainless fun.\\n\r\nEnjoy!",
            "date": "2018-12-06T14:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 295358,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=295358"
        },
        {
            "content": "Episodes: 7/12\r\nWon't watch anymore\r\nWhen I first watched shokugeki no soma I was excited and interested in the story and its characters. The music is amazing and memorable, it really uplifts the scenes and the tense food battles. And parts of me still want to finish the anime and see where it leads but this third season of Shokugeki no soma follows the same formula as the other seasons and at this point, it became predictable and almost boring.\r\nThis is an ecchi anime so you should know what to expect but in my point of view, there was one ecchi scene which took it too far.Some could call it \"pedophilia\" Maybe it was meant as a bad comedy joke but it made me feel very uncomfortable and I can't bring myself to support this anime anymore.",
            "date": "2018-12-05T12:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 295312,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4985411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rhan",
                "username": "Rhan"
            },
            "url": "https://myanimelist.net/reviews.php?id=295312"
        }
    ],
    [
        {
            "content": "Four seasons of foodgasm. At some point, I’d think Shokugeki no Souma (Food Wars) needed a break from its run. Let’s face it…the anime at this point has lost some steam since the previous seasons. What started as an experience of food ecstasy is now more about who is the best. If you want to beat the best, you have to be the best. That’s pretty much a general idea of this season as the Polar Star residents face off against the Elite 10, a group of students who are considered the best of culinary arts at Totsuki Culinary Academy.\r\nThis season didn’t take long toget straight to the point. We already know that Erina has defected from her Father’s clutches and allied herself with Souma. However, Erina is now in a conflict on whether she truly wants to cook. The season explores her character as we see how Souma can positively influence her as he did to others. Thanks to Souma, Erina regains her confidence and plays an invaluable role for the Polar Star residents. That is to say though, I’m not a big fan of Erina. She debuted in the show with a huge ego and a dogmatic attitude. However, this season shows Erina in a different light. She has changed and is now much easier to make friends with. It actually changed my impression on her as well as she values characters more than just their cooking. On the other hand, I’m not too pleased that some major characters got put on the sidelines to focus on her. I’m looking at you, Megumi.\\n\\n\r\nWatching this season also made me realize that Souma is also improving a lot since the previous seasons. He proves this by going up against one of his archrivals, Akira Hayama. If you remember from the previous seasons, the two went head to head in a previous Shokugeki that ended up with Akira taking the victory. This season pits the two against each other once more in a match to see who the better man is. And once again, it’s not hard to see how Souma positively influences Akira. However, the main conflict in the series isn’t just about winning or losing. It’s about standing up against Azami, someone who holds the academy under an iron fist. For Souma and his friends, they want to prove to the world what cooking really means. To do that, the season chronicles the rivalries between the Polar Star students (aka rebels) against the Elite 10. With only 12 episodes, it soon became obvious that the season isn’t enough to cover everything. It’s too bad really since I was looking forward to some of the more hyped Shokugeki battles. On the other hand, this season puts more value into the characters. It explores their past and almost feel like a character study. Characters that we don’t know too much about such as Nene and Azami gets their own background stories. Furthermore, the season makes us care more about what’s really at stake. Sometimes, it’s not just about being the best.\\n\\n\r\nLike previous seasons, you will witness a lot of exotic food. A short list includes bear meat, salmon, soba, among others. The style of this season is very similar to the previous with the info dump on the food along with the judges’ reactions. To no one’s surprise, this season indulges on foodgasm whenever the opportunity presents itself. And what better way to do that with the Elite 10’s talents? Indeed, expect over exaggerated moments from the best of the best showing why they are so feared and respected. \\n\\n\r\nAs a fan of the franchise, I’d say the fourth season is an improvement over the third. It became self-aware with the story’s pacing and decided to pour more value into the characters rather than rushing the plot. It’s a clever move as I’m sure fans doesn’t want to see a half-assed adaptation. While the latest season may not be the best, it still worth the time to indulge yourself into.",
            "date": "2018-06-24T09:32:00+00:00",
            "helpful_count": 90,
            "mal_id": 282095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282095"
        },
        {
            "content": "*Minimum Spoiler Foodgasmic Review*\r\nIf you did not watch S1 or S2 or S3 then go watch them ASAP before reading this! \r\nTL;DR: This season has more exploding clothes and foodgasms by packing some hype, some humour, some fan service, all while having the shittiest animation in all 4 seasons for the longest 24 minutes of your life. What more do you want? Grab a bowl, pull down your pants and start watching! \r\n[Story: 3/10 , Characters: 4/10, Art: 2/10, Sound: 3/10, Enjoyment: 4/10]\r\n\"It's time for you to go. Go figure out what you've got\" - Yukihira Jouichirou\r\nShounen genre is great. Shounen genre with food andfan service is even better. But if it can't execute it well then boy does it suck hard. As a huge fan of SnS, fans of this manga will be so let down this season with their lackluster display of commitment from JC Staff. In short, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen (boy are the names getting longer as each season getting shittier) was pretty much a train wreck that could not live up to the manga potential and kept derailing from it's path of what made this series so amazing when it first came out. If the previous season had it's flaws well this season definitely did their utmost best to further highlight their flaws. Fortunately, SnS somehow manages to make the fans happy albeit it's crappy plot arcs and dismal animation laziness. I guess if you show enough chibis and titties constantly moaning in foodgasms, people will turn the blind eye and plow through this show.   \\n\\n\r\nThe story continues off from where it left of last season since this is the second part of that. The Polar Star Rebels are waging war against Azami's dystopian gourmet food heaven. Azami is trying to kick them out of the academy by hosting shokugeki where the odds are always stacked against them but with the power of plot armour our heroes shall prevail... or will they? Seriously this show isn't that unpredictable anymore but it does have slight surprises here and there to keep your umami game strong. I guess it's good they didn't deviate much from the manga but if only they could amp up the hype before each shokugeki or food exams it would make them really exciting to watch. It almost felt rushed. Atleast the season ends well and sets up better for the upcoming season. \\n\\n\r\n\"Don't think of unnecessary things, just make a dish that suits you!\" - Yukihira Souma\\n\\n\r\nThe best part about SnS was always the cast. Despite having a huge cast, it always managed to make everyone useful. But since that's hard and studio was lazy, they just cut it in half. Don't worry it makes sense the way they did it and those that did get cut weren't really that useful except for moaning uncontrollably while losing all their clothes in the process. Anyways, the dialogues between casts were spicy and the major cast at display did great to showcase their justifications for their cause but if it keeps getting displayed using chibis it sort of loses value. Like usual, the major villain is of course, Azami. Although, his villainous purpose makes somewhat sense now from last season but a weak villain is still a weak villain. He just wants people to eat gourmet food. Erina was interesting this season. She has more knowledge than half the teachers in the academy it seems. However, the best character is probably Isshiki. The dude was the saving grace this show needed. If you watch it, you will know why. \\n\\n\r\n\"Let's have some quiet, shall we?\" - Satoshi Isshiki\\n\\n\r\nAside from the linear driven plot and stale characters, this show really fell flat in its animation quality again. Atleast last season the show sort of put in effort. This season zero effort. They just kept doing pans and zooms with coloured manga panels. Even the delicious mouth-watering clothes-exploding food felt boring to look at. If the pans and zooms were too much, they just drew chibis because animating background scenes just became that bloody difficult for them. It was just painful to watch. It feels as the season progresses, the budget invested in the quality of animation drops. As usual, compared to the battle scenes of first season to battle scenes in this season, there are significant evidence for animation laziness. Even the fan service is lacking to the point where all people can enjoy are the different stiches for different characters in that show. I mean, you know this show succeeds in exploding clothes and fan service. Give the fans what they want. Regardless of the poor animation quality, at least the opening and ending songs were slightly better but the background music was somewhat decent. Like always, the major saving grace are the seiyuus. Time after time, they are doing a phenomenal job. Azami's seiyuu really stood out this season. Rest were good as well. \\n\\n\r\n\"No matter the hurdle, you face it with a smile. You'll stare at your own weakness straight into the eye for as long as you have to.\" - Saiba Jouichirou \\n\\n\r\nOverall, SnS S3 Part 2 is an ecchi shounen anime about food that is only worth watching since you have committed yourself to watching the other 3 seasons. If you aren't a dedicated fan of this show, don't even bother. Just go read the manga. I rather your money go to the mangaka than this pathetic excuse for an anime. There is another season on the way and hopefully if they can redeem themselves from fixing the mistakes they made in season 3 then maybe, just maybe, this show will once again be worth watching. At this point, Naruto fillers had better animation than this anime. Ultimately, it's not a bad show. Just binge it on the side if you feel like it. Last review I said, \"if one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food.\" Well, S3 Part 2 is the horrible food your gf makes but you still eat it to make her happy.  It's still enjoyable to eat but we all know why you are eating it. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!",
            "date": "2018-06-24T09:51:00+00:00",
            "helpful_count": 57,
            "mal_id": 282097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=282097"
        },
        {
            "content": "All aboard the foodgasm train!\r\nShokugeki no Souma: San no Sara - Toutsuki Ressha-hen continues on from the Third Plate to the Totsuki Ressha-hen where things goes straight up a Hokkaido Tournament arc.\r\nLA does have some small gripes with this arc so LA might just start with that.\r\nThe first should be.......the animation, ohh no, no so much as the overall designs and the beautifully made foods or anything, but to it's animation direction, which Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen's excessive use of panning, LA didn't notice but it shows in excess in this arc and ohh boy was it annoying at times,most probably because Yoshitomo Yonetani, the director of this season wanted to make it like your reading the manga considering the amount of panning but man does it grated on LA when it's been used every time it could. Next would be how rushed this arc was from skipping battles being the most obvious and quickly wanting to get the small bulk of the more serious battles, sure Shokugeki no Souma has done this with it's previous seasons, but this was in new setting and newer form of tournaments, not to mention higher stakes due to the entire Azami dictatorship in place. Finally would be because of the rushed paced, the ending well..ended abruptly, as LA was expecting this arc to FINISH the Totsuki Ressha-hen arc and ohh LA doesn't know...FINISH the tournament instead of leaving it hanging, heck LA would be fine if there was another season...to the third season (hmmm the naming of the next season is gonna be crazy long) anyways this feels REALLY similar to Mahou Shoujo Lyrical Nanoha ViVid's tournament was cut short and NEVER revealed again what the last half was like, LA just hopes Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen doesn't do the same. \\n\\n\r\nOn the other side of the spectrum, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen did great in terms of characters, especially when it concerns Erina Nakiri and this is the season where she SHINES, from being the narcissistic tsundere to being the Rebel Queen standing up to her father, she probably gets the most development in this arc and once again proving LA's best waifu once again and favorite character of the anime (and this season!) for LA along with her father Azami who gets a bit of backstory to how he became how he did alongside Jouchirou Yukihira in the process of it. Now Souma himself gains more development what with Jouchirou's backstory being told and what the entire Azami deal is with him, but alot of people might once again say that Souma ALWAYS wins his bouts thus no character development, well no, as he learns more and more to be a better chef with the new challenges he faces and he's also a pillar of support to Erina as well. Erina might get the majority of the development in terms of character this season, but Souma gets more in terms of cooking. Once again, Shokugeki no Souma manages to make the food impressively tasty looking even for animated food and the animation does have certain flourishes when it CAN do it outside of excessive panning, seriously besides the panning, the animation was well pretty detailed for the most part and LA loved it all round EVEN it's typical comedic moments.\\n\\n\r\nShokugeki no Souma: San no Sara - Toutsuki Ressha-hen does bring in at the very least some backstory to the Elite Ten mainly Terunori Kuga and Nene Kinokuni this season AND even give Akira Hayama and Satoshi Isshiki something quite outside their typical character to go through. Seriously Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen's main strength is in it's characters and how they develop them further.\\n\\n\r\nIn terms of voice acting, well it's still the same voice cast as before and LA has settled with Hisako Kanemoto as Erina Nakiri by this season and this feels like coming full circle but with Hisako Kanemoto going aboard and taking a hiatus does that mean Risa Taneda gets her role BACK as Erina Nakiri? well IF there's another season...anyways, LA enjoyed the voice cast for the most part with Shizuka Ito as Rindou being a constant pleasure to hear with her witty and genki personality 100% and Kana Hanazawa as Nene with her typical deadpan serious vocals being put on her was fine, but LA would give MVP's this season to Hisako Kanemoto and Shizuka Ito this season, LA bias as fuck but LA doesn't care.\\n\\n\r\nLA was expecting Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen to be a 2 cour and expected it ohh LA doesn't know...complete the tournament it set out to build up but even with this seaosn's misgivings such as it's excessive panning, rushed pacing and the finale being just cut off during a freakin' tournament arc, LA is just a diehard Shokugeki no Souma fan to the point that it's strengths of beautiful animation when it can bring it out especially in it's food and eccentric character designs, major character development on countless characters from Erina Nakiri to Azami and Jouchirou and even some development of Souma as a chef AND character as well as some minor characters getting the limelight in a different light altogether just makes up for it.\\n\\n\r\nLA still being an utter fan of this series and bias might come into play for LA's overall feelings to this season but LA will NOT omit the serious flaws this season actually has and LA hopes that if Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen actually gets another season that it learns from this season, flourish and make it more exciting and maybe even better and make the remaining tournament arc all the more greater!\\n\\n\r\nThis train for LA isn't stopping and LA hopes this train keeps going..............just refurbished and more exciting.",
            "date": "2018-06-24T16:33:00+00:00",
            "helpful_count": 23,
            "mal_id": 282128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282128"
        },
        {
            "content": "While Shokugeki no Souma is overall a decent show, it bothers me how increasingly contrived the plot and setting are becoming with the addition of Central as the series' new overarching villain. \r\nCentral forces certain rules and regulations on the students and restricts their freedom of expression while cooking. They also attempt to sabotage certain students attempts at passing their final exams. It's true that Souma and his friends have always been underdogs, but this just seems like overkill. Constantly having bad things happen to the main cast because practically the entire cooking world is against them isn't entertaining-- it's honestly cruel, and isn't reallyfun to watch.\\n\\n\r\nIt's also incredibly boring to see anime scenes directly cut and paste from the manga, with no movement or action being implemented to actually make use of the animation medium. There are SO many still shots and camera pans while characters just stand there and talk. Why animate Shokugeki no Souma if you're just going to keep everything still and listless, and not give any sort of dynamic to what happens in the manga panels?\\n\\n\r\nAll said and done, there isn't anything technically wrong with cour 2 of season 3. The art, sound, and characters are all fine. However, because of the jarring shift in plot and setting, as well as the lack of novelty in the animated adaptation itself, my enjoyment of this show has definitely gone down from previous seasons.\\n\\n\r\nOverall: 7/10",
            "date": "2018-05-01T20:21:00+00:00",
            "helpful_count": 21,
            "mal_id": 279544,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4982590.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/khattikeri",
                "username": "khattikeri"
            },
            "url": "https://myanimelist.net/reviews.php?id=279544"
        },
        {
            "content": "Continuing from what the story of the proud, funny and excellent chef Yukihira Souma and his gang from Food Wars: The Third Plate, the anime is back from its over the top food-gasm. Although this second course of the Third Plate seems quite good, we still have to consider that J.C Staff clearly disappoints us yet again by putting the waiting card to our eyes.\r\nThe story starts of with Central's preparation along with Polar Star Members preparing for defense. We get to see from the first episode the development of Nakiri Erina, who rebels against her father's doing towards Central's success. We were given episodeswhere the rebels have to push through the limits. Learning everything and then comes down the fight.\\n\\n\r\nTypical Food Wars anime word is \"Shokugeki\" and we are given a few only this second half. Although one of it was very exciting. The fight with Souma against Hayama Akira is how we see Souma develop through his cooking from his defeat at the Autumn Elections. We see how he could go to an extent to find ingredients just to beat the heck out of his rival and we also see Hayama being the spice master himself although, what was different in the two sides was inspiration.\\n\\n\r\nSouma turning defeat into victory while Hayama being controlled by Central and not going through his own cooking was the turning point. Back stories are typical to every anime and we finally get to see the back story of Souma's dad Jouichiro, where it told how Erina's father Azami turned into a beast and planned Central. We get answers to questions from the last season which is the first half and some good shokugekis on this second bout, although here comes the ending of this second course.\\n\\n\r\nLike the first half ending at the half of the series and making the fans wait for months, we get the waiting game again, stopping it in the very moment where things gets to the interesting parts. If you are a Shokugeki fan, you know its disappointing to see that the part where you have been wanted to animate for so long, and its just so near to you, leaves you again and makes you wait for months again to continue. It is annoying for me as a fan of the anime to wait although what can we do? I have to give credit to the openings and endings though. From the past Shokugeki franchises, this one is at the same level of goodness and it should be. Its good song and good visuals. Speaking of good visuals, the art didn't change that much and the ecchi foodgasm still lives up to the height. Overall, this second cours was exciting but came crashing down as the fact that we won't get to see what lies ahead of the rest of the fight against Central.",
            "date": "2018-06-24T10:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 282102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=282102"
        },
        {
            "content": "This a review in progress people. So lets get straight to it. \r\nPlot:- This show is still interesting as ever. Hasn't failed to deliever entertainment just like the previous seasons. Not gonna spoil anything. If you liked the previous seasons you're gonna like this. \r\nSound:- Its decent but not that great. Moving on. \r\nArt:- Here's what people who loved the previous seasons are triggered about. The art is not pretty. its not so bad that you gotta drop the show(nobody gonna drop this show ever lol) , but its bad considering the high standards of the previous seasons. its still good but average. We justhave to wait and see if anything improves or not. \\n\\n\r\nOverall:- Show is still interesting and gripping as ever plot-wise (tho its still way too early to say anything, till now its been great). Art quality has decreased a bit from last season, average good but not great.  Other than that, everything is fine. Nothing else to get triggered about. If you don't care about art and animation and just want to enjoy the show, you're all good. overall a really enjoyable show. Highly recommended.\\n",
            "date": "2018-05-20T20:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 281049,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6184395.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ashes_",
                "username": "Ashes_"
            },
            "url": "https://myanimelist.net/reviews.php?id=281049"
        },
        {
            "content": "I'm going to have a hard time waiting for the next season of this anime. \r\nThe suspense, action, and drama in this half of season three is unmatched by any other arc of Shokugeki no Soma. It is quite a lot to follow as there is a lot of new information thrown at you all at once, but it's amazing nonetheless. \r\nThese final twelve episodes will finally answer some questions you may have had about the more mysterious characters in the series. Isshiki and Joichiro are a couple examples of that. The battles get way more intense, and the sense of comradery between former adversariesis formed. \\n\\n\r\nBesides all that, the singular best thing about this half of the season is the fact that we get to see some serious development from Erina. The friendships and bonds she forms with everyone is truly awesome. \\n\\n\r\nI'd also like to add here that this season as whole provided, not only a darker storyline, but a more touching one. Those two aspects are what I'm hoping to see carried over into the fourth season. Here's hoping it comes soon!",
            "date": "2018-06-25T20:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 282243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=282243"
        },
        {
            "content": "Oh shit another sequel has just ended, and we're left to wait for another sequel,  anyways, nothing sooo far has changed after the 4th sequel, Polar Star Dormitory Roques were still not done with them Elite 10 yet, and it'll probably take a couple of more sequel to end it unless JC Staff plans to extend it by introducing another batch of cocky cooks who were out to duke it out with Yukihira, the only things that were different here was seeing Erina resigning her seat from the elit 10 and so as the streker elite 10 Isshiki Satoshi. also the setting has change,no longer in campus. As for the ART category of this anime, well, just like it's sequel, we still see then judges or anybody who tasted any food being show in a metaphoring naked glory, but sometime them tasters would be in some obnoxious customs to exhibits some for of ecstasy, still there were some panty services around, like that of Nene Kinokuni, pretty sure that every time a guy sees it would have a field day,,,,,SHIT!Despite of it all, the excitement is starting to waiver where it can be compared to eating curry everyday and staring to get tired of it that you would wanna, just throw it to the dogs WOOOF! So this is how I see this:\\n\\n\r\nStory-Mediocre 5: Still the same shit where even as 3 Elit 10 has lost, also the part where roque muscle guy Tousuke Megishima beating elite 10 whomever she is wasn't shown, which is quite unfair.\\n\\n\r\nArt-Mediocre 5: Still the same shit where you see some of those metaphoric ecstasy of satisfaction where the judges goes naked and some occasional panty services , and btw no nipples and no still nao hairy pussies.\\n\\n\r\nSound-Good 7: It may still maintains the usual voice actors whom were doing who, but the score was for the opening and closing theme.\\n\\n\r\nCharacter- Mediocre 5: Still the same shit, and I need not say more.\\n\\n\r\nEnjoyment- Good 7: Since I still find it entertaining, but barely. \\n\\n\r\nOverall-Mediocre 5: Watch it as a chore. \\n\\n",
            "date": "2018-06-25T13:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 282203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=282203"
        },
        {
            "content": "I must say that this show have lost the flame that it ones had with me.\r\nI enjoyed the first season, but they don`t really evolve.... The Food that Souma made in the beginning was already being potrait as amazing, and it kept on going, and for me at least, it does not really feel like he is getting better. And even though the main cast is lovable, the rest sucks... The judges ALWAYS gets hyped up, but end up saying the same thinks and acting like the judges before them.\r\nAnd there is limits to how amazing you can make food, because in the end itis just food, and it is also very limited to descripe. It always come out as \"There is more aroma in this one\" or \"UUUH THE TEXTURE IS AMAZING\" and just keeps on going while there clothes gets ripped off.\\n\\n\r\nthere were a constant kind of creativity over the show in the start, but now its just\" This dude makes better food, just because he does\".... It would be more amazing, if they change it up a little. Like let a judge say \"Uh this is bad food because bla bla\" but that never happense.... All the food is amazing, everything is on the top...\\n\\n\r\nit just dont work for me anymore... If it was not because of a certain episode, this season would have just been very bad and not enjoyable for me...\\n\r\nUnless you guys are food freaks, i do not recomend watching this... it just follow the same formular, and in theory they could make this a serie that would never end, because that is how little that is actually happening...",
            "date": "2018-10-30T17:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 293019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505525.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BartTheDrake",
                "username": "BartTheDrake"
            },
            "url": "https://myanimelist.net/reviews.php?id=293019"
        },
        {
            "content": "As we encroach ever further towards the maga's more recent arcs, Shokugeki no Souma has proved itself to be as popular as ever by pulling off yet another half cliffhanger by separating a major arc into two separate seasons.  So, how does this second half of the third season stack up to what we've seen previously?  Well, poorly.  At least by comparison.\r\nStory:\r\nPreviously on Shokugeki no Souma, all of Tootsuki Academy is now taken over by Azami Nakiri, Erina's father who has instilled a regime on the cooking academy that gets rid of competition within the students by sacrificing their own individuality as chefs and cooksand turning them into carbon copies of each other in order to make it so that 'Central's' gourmet is the only gourmet food that's worth existing and everything else is considered as 'animal feed' by comparison.  As Souma and his friends reject this concept of being forced to give up their individuality and creativity as chefs, they are branded as rebels, and fight back against the regime to continue staking their claim in the culinary world.\\n\\n\r\nThis section of the story is what I consider to be the series's slow descent from the high pedestal it's been put on.  This is largely due to the typical shonen problem of 'escalation', where in order to keep the show's traction, the stakes have to be shot up through the roof in order to keep viewer interest.  By this point, the story has made it abundantly clear that it's going for a \"Us vs. Them\" mentality where the entire school badmouths and spends an exorbitant amount of resources in order to defeat the main characters, which has an obvious outcome because there's still a series to make.  As such, the show paints such a black and white picture of the whole situation that I find it difficult to sympathize even with the protagonists cause by this point it's kind of obvious what's going to happen, whereas previously, the show focused primarily on a numerous amount of rival-based characters, which with the way these characters and the story were written, did not have as predictable of an outcome as it could've had.\\n\\n\r\nOn the flipside though, the show still manages to pull off a great number of food battles which, while predictable, do excel in the fact that each round of bouts provides new and interesting culinary information, as well as a good deal of character info and backstory that 'humanizes' the bosses, even though we're not going to see them much after their space in the limelight is over.  Both Souma and Erina are great examples of this happening, as their characters and personal growth do gain some significant changes that otherwise wouldn't be present.  That being said, I feel as though Erina has the more significant of the two since unlike Souma, she has more noticeable changes outside of the customary food tournaments, which given her introductory character at the start of the series, is a very welcome change.\\n\\n\r\nAll that being said, I still find it difficult to give the show any deserving praise because Shokugeki has funneled itself in such a hole where in order to continue the story, the stakes are more or less their 'way of life' being put on the line, and that to me has very little value because there's in no way shape or form is that of all things going to be lost in a super mainstream shonen jump series; it's just not going to happen.  Because of this, it feels like Shokugeki is just going through the stages of a popular shonen, and that's a shame considering how much more well-written the series was in previous arcs by comparison.\\n\\n\r\nOverview:\\n\r\n+ Useful characterization for its cast\\n\r\n-  Super high stakes devalue story quality\\n\r\n-  Kind of predictable\\n\\n\r\nCharacters:\\n\\n\r\nThere's not much to be said for the characters beyond what we see with Erina and Souma.  Much of the series's devotion to character development is focused on these two as they're the primary main characters of the series.  Souma more or less develops by learning from his past mistakes and using those as stepping stones to get better, whereas Erina spends much of her time in the limelight devoted to developing a better personality separate to the haughty queen schtick she's been pulling for almost four seasons now.  So for them, there's a clear improvement in character quality and is a commendable effort to make for better characters.\\n\\n\r\nHowever, everyone else sort of suffers from a lack of meaningful development outside of the customary 'Shokugeki'.  Most of the rest of the cast is thrown to the wayside because they needed a way to add even MORE stakes to the equation (as if getting expelled wasn't enough), and the few members that do stay behind more or less get attention put onto them only when they're cooking.  Sure their points are interesting, and enemy characters/people we've know but don't know too much about do get backstories and more depth added to them, but in reality, they only get the much needed characterization during specific times.  Any other time aside from that is sacrificed for more Central shenanigans where everyone has a hate boner for the MC just because he wants to cook the stuff that he wants to cook.\\n\\n\r\nOverview:\\n\r\n+ MCs get more development\\n\r\n+ Side cast members get development\\n\r\n- Side cast development happens only during selected times\\n\\n\r\nArt:\\n\\n\r\nThis might honestly be the least animation-heavy shonen series I've seen in a long time.  While J.C. Staff has been exceptional at being consistent in art quality for both the show and especially the various dishes that the characters' make, the appearance of which is beyond appetizing, there's...not actually that much animation going on.\\n\\n\r\nMore specifically, the show plays a lot like a slideshow, as the camera changes so often to different characters giving their various inputs on the situation that when you stop to think about it, the show has hardly ANY animation to it aside from basic lip movement to get the characters to talk.  Sure you still get your foodgasms, and those in no way shape or form have disappeared or have lowered their presence in the show, but even that I feel has been subjected to the 'slideshow' problem as the show primarily consists of stills and cutaways.\\n\\n\r\nPart of this I feel can be blamed on the original paneling of the manga and how that's structured, but regardless, the transition isn't great from a visual standard, and it's weird to think that a slice of life moe show probably has more frames devoted to animation than a supposed battle shonen.  Food for thought.\\n\\n\r\nOverview:\\n\r\n+  Good artwork\\n\r\n-  Almost no actual animation\\n\\n\r\nSound:\\n\\n\r\nPersonally I found the tracks and everything to not be that noticeable.  I find this to be a recurring thing with Shokugeki no Souma's OST, as the OP's and ED's get less and less memorable and impressive as time goes on with each season.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nThis and the Central Arc is by far my least favorite arc in the Shokugeki series.  This is primarily due to the fact that the show escalates the stakes in the show so quickly so fast, that as a viewer, I sit in shock asking myself, \"What on earth happened?\"  Think about this, prior to this, the series was on the moon festival arc, where students participated in a food festival and made money/showed off what they were capable of at a yearly event.  Then in the blink of an eye, the entire school government changes to the highest ranks having all of the power, every existing club on campus gets gutted for no other reason but \"Glory to Central\", and roughly half of the season is dedicated to purposely handicap and try to expel students for wanting to pursue their own interests.  I realize there's actually a reason for why Azami abolishes the current school structure in favor for Central (no matter how stupid it is), but really, what the actual fuck happened?\\n\\n\r\nBecause of this, I don't find it easy to sympathize with any of the rival characters this time than I did previously before.  Sure they do the usual cooking smacktalk and dick measuring to prove that they're better than the MC before they even get near a stove or hold a knife, but there's just something that was more satisfying about someone like Subaru or Kuga from before fighting against Souma than this time around with his current round of opponents.  I think it's primarily because the show's stakes during previous arcs were less intense, and losing a bout wasn't the end of the world.  Souma didn't face expulsion as commonly as he does this time around, and making that one change makes it that much harder for the MC of a shonen series to lose because if you do that, the series is basically over.  Backstories are nice, but the glaring problem of such overwhelming adversity equal to \"You vs. The World\" makes it any difficult for me to find any enjoyment when something this major becomes a central point of the plot.\\n\\n\r\nAs such, I find this section of Shokugeki to be less quality than previous arcs, finding myself in a weird spot at recommending this for people.  It has its good points sure, but all of that is overshadowed by the fact that the show has such vehement hatred for the main characters, which makes it hard to even consider the other side as probably good people.  A shame since burning rivalries was such a core component of the show prior that made things so much more exciting when two interesting characters go head to head, locked in food combat to prove who truly is the better chef.  All of that magic feels like it's gone a bit, and that's why I feel like the series as a whole is falling in a downward spiral.",
            "date": "2018-07-10T14:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 283649,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=283649"
        },
        {
            "content": "First of all I am kinda tired of hearing the same stuff about SNS's latest season from different people on different media platforms. I mean let's be honest 80% of the stuff they say it's copy paste from each other or some elitist view about the show....we all know what they say so I won't talk about that instead I will say what has this show accomplished so far especially in this Second Cour. So let's tell the truth cu's that's what a review is supposed to do right?\r\nWell Erina has characterization across those 24 episodes , she is not  anymore the girl whoalways bumps  each day head to head  with Souma becoming annoying at some point.She is a character part of this enjoyable and great nowadays show but not any kind of character one who has a weakness which makes her more human like more relatable for viewer. The people from the Polar Dorm have development, the Elite ten are not a mystery anymore ,Alice has characterization, Joichiro has characterization, Azami has characterization....Everyone has in this current season .....Even some unresolved past things regarding the main character are solved in this season.....\\n\\n\r\nI am hearing left and right the same thing about how Souma's gang has become strong from nowhere or how Souma beats his opponents from nothing.....well let me clarify you one thing for those who didn't quite understood were all that development came from.....As a sns fan you probably remember season 2 the Autumn Selection and Stagiare Arc...Well from those arcs and plus Erina's guiding and knowledge about cuisine that she shared with the people from the Polar Dorm in the current season all together are a fair and justified way of development for the characters.\\n\\n\r\nLet's not forget the fact that Souma's hardworking and recipies tried  over and over again each night with no sleep, the France cuisine knowledge he gained from Master Shinomya during the Stagiare Arc all of those stuff helped him developed his own cooking. And I think it's about time he beat someone  in this season don't you think so?As he did ..... \\n\\n\r\nThe  foodgasms decreased in this season, instead we have symbolism to depict the current cooking style and art of cooking for each character and as a plus it gives you a fair amount of how epic this show is! The Elite ten had some characterization during the Shokugeki Team battle to give you an example the way they used the duel between Nene and Souma adding Ishiki into the mix to depict his bond with Nene and their own cooking style that made them what they are today as chiefs. Let;s be honest with our ownself, the moment was damn emotional and epic at the same time! As expect form SNS!\\n\\n\r\nEnjoyment has always been a + factor for this anime and  regarding that this season doesn't disappoints at all, the heartwarming moments combined with the flashbacks and ost depicting the road each character has chosen and what they have accomplished as cooking chiefs gives me each time the reason to say:\"GOAT GOAT GOAT \" and cry of happiness and sadness! The most important factor are the detailed recipes and the way this show expands and explores the cuisine world making it very easy and accessible for the viewer to understand and for that I am glad Jc Staff adapted the source material!\\n\\n\r\nI can talk about the tone of the color used for each flashback , about the ost used about the symbolism about the VA which everything is done in harmony but that will be a bore fest so I will let you see it with your own eyes cu's you know the saying:\"Practice is the mother of all things!\".\\n\\n\\n\r\nEnjoyment  + Symbolism + Suspense in each episode + Detailed Recipes + Heartwarming moments+ Great characters this season is the perfect recipe to watch a good show!\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-06-25T07:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 282164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282164"
        },
        {
            "content": "This show is still as ugly as sin. I'm not hating on the show: I loved the first two seasons. Objectively speaking, it is impossible for any experienced anime viewer to say that this show actually looks good visually. The key frames are consistently static and It is a rare occurrence that you actually see any animation asides from lip flaps and the constant. sliding. of. the. camera. This season is literally a sliding powerpoint presentation. If the show actually had even decent animation this wouldn't bother me so much. The art is the absolute worst part of this half of the third season. \r\nIfyou're questioning my reasoning, watch one episode of the first or second season and compare it to an episode from this season and pay attention to what is actually happening on screen. Notice that nothing is actually happening asides from sliding camera pans.\\n\\n\r\nThe overall trope showcasing the underdog/secret overdog reforming the system as well as the theme of pristine, heartless, haute cuisine v.s. personal, self expressive cooking has always been the lifeblood and undercurrent of SnS. It doesn't knock you in the head screaming in your ear that it has these themes. There was at least some subtlety to it and respected the viewer's intelligence. But this season, the show just shoves it front and center making the most basic, black and white scenario. The whole \"rebels\" of polar star vs Central just was beyond basic. Took away all forms of subtlety to the show's theme. Given, this is probably the manga's fault.\\n\\n\r\nAnd following the dumbing down of themes, episode structure has somehow gotten even blander than the first half of this season. It's always the same buildup and payoff, with stakes that are nonexistent to the viewer. Oh, the stakes are there. It's just that we've become completely numbed to the \"If Soma doesn't win this, he'll be EXPELLED!!\" threat. \\n\\n\r\nThe fact the show is still apparently just as popular as the prior two seasons will give the creators no incentive to bump up the standards.",
            "date": "2018-05-15T22:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 280667,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6040311.jpg",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yenrz1345",
                "username": "yenrz1345"
            },
            "url": "https://myanimelist.net/reviews.php?id=280667"
        },
        {
            "content": "Once again, Shokugeki no Souma has been amazing. I remember back to when I was shiny new to anime and refused to watch it because it was too ecchi and I shake my head at myself. The fanservice is back this season but it's still more of a funny aspect of the show than anything serious so it's still fine.\r\nThe biggest reason I loved this season was the character development. Talking about some of the characters before this season started - especially Erina - I was frustrated to realise there was such little development going on from season to season. I wanted Yukahira to stopbeing quite such a mystery and and I wanted Erina to do more than flip her hair and be elitist. I got it! We get info on Joichiro's time at Toutsuki and Erina gets growth like crazy.\\n\\n\r\nI'm not sure if this would make sense to just jump in but for fans of the series it's very much worth the watch. I'd also highly recommend going back and watching the first seasons if you haven't. You'll learn lots about food and be entertained!",
            "date": "2018-06-26T18:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 282311,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6908771.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hikari-Are",
                "username": "Hikari-Are"
            },
            "url": "https://myanimelist.net/reviews.php?id=282311"
        },
        {
            "content": "STORY - 7\r\nART - 7\r\nSOUND - 8\r\nCHARACTER - 8\r\nENJOYMENT - 7\r\nPart two for the third season of Shokugeki no Souma continues to gush out the lustre of stomach-filling nourishment to fill our appetites up. This time, The Third Plate: Totsuki Train Arc is a sugary sensation dripping with all the sweetness enough to entice many sweet-toothed hungers out there. But perhaps, this is a diabetic obsession. After all, a little too much sprinkle calls for a sickly toothache, and we probably don't want that right?\r\nLooking back to the first season, a slope that shows a burning rise in temperature and conflict had been drawn.A show turned from lighthearted to highly competitive, even more so after the Elite Ten entered the fray. And here we are, with what is currently the biggest obstacle these students, the Rebels, have to face. Azami and his organization named Central. To face off against a single system is definitely an interesting concept. It added more challenge, and integrated a blazing desire to not let cooking fall into the hands of the wrong person. But this meant the lighthearted food galore and foodgasms were reduced, a trade-off which smoked out one of the appealing core this series had. To add more to this oversweetened candy, fast pacing was present, especially in early episodes. This awkward flow of information felt rushed and prevented enjoyment from reaching its peak. While it's a loss, it didn't awash everything completely and finding enjoyment here was definitely possible. With the threatening presence of Central, the effect they had on various characters were shown. There's a beautiful testimony found in cooking where no matter the level of talent, as long as you have the passion for it, cooking can be fun. It's a contrast to Azami's quite far-fetched philosophy. His history did explain why he has this view, but it's clear that his feelings towards culinary industry as a rotten world is a trigger for those from the Rebel side. Particularly for his own daughter, Erina. Her developmental progress as she gradually changed into a better person around her newfound friends was inspiring. That's why this second cour is a show of emotional investment. A highlighting of the passionate ideals for cooking found in different people, both from the entertaining to the more appalling ones.\\n\\n\r\nStepping back to see what the sweet looked like in appearance, the rich and vibrant colors were all it took to get your teeth on it. Every scene, brightened up and attractive, will definitely lure passing eyes towards it. But there's a production fault within the sweet. With the fast pacing in the narrative, the show was visually affected by the quick changes in scenes, creating a rush of information. There's a disappearance in dynamism for the animation. It was quite a downgrade and looked more like static poses compared to its prequels. J.C.Staff tried to justify the lack of movement by panning the shots more often than needed which only achieved the opposite effect. Distraction was what came out of it and it's certainly not good for a fast-paced anime. On a more positive note, every culinary dish were presented with mouthwatering temptations, sparkling deliciousness with details. Whoever drew them truly have the power to make everyone hungry. We'll definitely drool alright. There was also the much-loved humor that didn't lost most of its appeal. At least they got the expression and comedic chibiness right, a nice touch to squeeze in a bit of much-needed laughter among the waves of drama. Amplified by the voice actors, whether it's the funny or the more emotional moments, certain tones in the character's voice helped convey the correct effect at the right time. So there will be times when you are laughing at one bit but was immediately put back into seriousness without a break in integrity, all thanks to the voice-acting. While no new soundtracks played as this is still the second cour, it was not needed. This series has the perfect soundtracks to evoke the emotions of cooking. Each scene were backed up well by the soundtracks, enough to even make a cooking show intense.\\n\\n\r\nThe Third Plate: Totsuki Train Arc is the cotton candy of Shokugeki no Souma. You can feel its fluffy and light texture, but exposed to the air for too long and it'll turn into a sticky crystallization of sugary flavors. I don't know about you but I like my cotton candy how I like my velvety blanket. But oh well, I wouldn't mind gobbling it up even with the annoying stickiness. It's still a yummy confection at the end of the day.",
            "date": "2018-06-24T15:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 282126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=282126"
        },
        {
            "content": "I Love Shokugeki No Souma so much (Masterpiece) my favorite character is Saiba Yukihira and Erina Nakiri Plus Alice Nakiri, Arato Hisako, Korukiba Ryu, Hayama Akira.......... But the season of Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen\r\n; i tought this season finished at least with 24 episode (12 episode so short) i don't understand what the hell with you guys (Tsukuda Yuuto) FUUUUUUUUUUUCK IT???!!!!!!!!!!!!!\r\n\"It's time for you to go. Go figure out what you've got\" - Yukihira Jouichirou\r\nShounen genre is great. Shounen genre with food and fan service is even better. But if it can't execute it well then boy does it suckhard. As a huge fan of SnS, fans of this manga will be so let down this season with their lackluster display of commitment from JC Staff. In short, Shokugeki no Souma: San no Sara - Toutsuki Ressha-hen (boy are the names getting longer as each season getting shittier) was pretty much a train wreck that could not live up to the manga potential and kept derailing from it's path of what made this series so amazing when it first came out. If the previous season had it's flaws well this season definitely did their utmost best to further highlight their flaws. Fortunately, SnS somehow manages to make the fans happy albeit it's crappy plot arcs and dismal animation laziness. I guess if you show enough chibis and titties constantly moaning in foodgasms, people will turn the blind eye and plow through this show. \\n\\n\r\nThe story continues off from where it left of last season since this is the second part of that. The Polar Star Rebels are waging war against Azami's dystopian gourmet food heaven. Azami is trying to kick them out of the academy by hosting shokugeki where the odds are always stacked against them but with the power of plot armour our heroes shall prevail... or will they? Seriously this show isn't that unpredictable anymore but it does have slight surprises here and there to keep your umami game strong. I guess it's good they didn't deviate much from the manga but if only they could amp up the hype before each shokugeki or food exams it would make them really exciting to watch. It almost felt rushed. Atleast the season ends well and sets up better for the upcoming season. \\n\\n\r\n\"Don't think of unnecessary things, just make a dish that suits you!\" - Yukihira Souma\\n\\n\r\nThe best part about SnS was always the cast. Despite having a huge cast, it always managed to make everyone useful. But since that's hard and studio was lazy, they just cut it in half. Don't worry it makes sense the way they did it and those that did get cut weren't really that useful except for moaning uncontrollably while losing all their clothes in the process. Anyways, the dialogues between casts were spicy and the major cast at display did great to showcase their justifications for their cause but if it keeps getting displayed using chibis it sort of loses value. Like usual, the major villain is of course, Azami. Although, his villainous purpose makes somewhat sense now from last season but a weak villain is still a weak villain. He just wants people to eat gourmet food. Erina was interesting this season. She has more knowledge than half the teachers in the academy it seems. However, the best character is probably Isshiki. The dude was the saving grace this show needed. If you watch it, you will know why. \\n\\n\r\n\"Let's have some quiet, shall we?\" - Satoshi Isshiki\\n\\n\r\nAside from the linear driven plot and stale characters, this show really fell flat in its animation quality again. Atleast last season the show sort of put in effort. This season zero effort. They just kept doing pans and zooms with coloured manga panels. Even the delicious mouth-watering clothes-exploding food felt boring to look at. If the pans and zooms were too much, they just drew chibis because animating background scenes just became that bloody difficult for them. It was just painful to watch. It feels as the season progresses, the budget invested in the quality of animation drops. As usual, compared to the battle scenes of first season to battle scenes in this season, there are significant evidence for animation laziness. Even the fan service is lacking to the point where all people can enjoy are the different stiches for different characters in that show. I mean, you know this show succeeds in exploding clothes and fan service. Give the fans what they want. Regardless of the poor animation quality, at least the opening and ending songs were slightly better but the background music was somewhat decent. Like always, the major saving grace are the seiyuus. Time after time, they are doing a phenomenal job. Azami's seiyuu really stood out this season. Rest were good as well. \\n\\n\r\n\"No matter the hurdle, you face it with a smile. You'll stare at your own weakness straight into the eye for as long as you have to.\" - Saiba Jouichirou \\n\\n\r\nOverall, SnS S3 Part 2 is an ecchi shounen anime about food that is only worth watching since you have committed yourself to watching the other 3 seasons. If you aren't a dedicated fan of this show, don't even bother. Just go read the manga. I rather your money go to the mangaka than this pathetic excuse for an anime. There is another season on the way and hopefully if they can redeem themselves from fixing the mistakes they made in season 3 then maybe, just maybe, this show will once again be worth watching. At this point, Naruto fillers had better animation than this anime. Ultimately, it's not a bad show. Just binge it on the side if you feel like it. Last review I said, \"if one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food.\" Well, S3 Part 2 is the horrible food your gf makes but you still eat it to make her happy. It's still enjoyable to eat but we all know why you are eating it. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!\\n\r\nI found this review Helpful",
            "date": "2018-06-25T02:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 282148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6063520.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mehdielmoufid",
                "username": "mehdielmoufid"
            },
            "url": "https://myanimelist.net/reviews.php?id=282148"
        },
        {
            "content": "This has definitely been the weakest season so far imo. Felt extremely rushed and the worst part has to be how they've just cut out practically all the actual COOKING in a cooking shounen show. Heck that's like half of the reason I enjoy the series so much.\r\nAlso still scratching my head about how they were making the team shokugeki out to be a match where teamwork plays a big role (wasn't that the point of the Saiba vs Dojima practice match) only for there to be absolutely ZERO teamwork in the actual team shokugeki.\r\nAnother downside of this season has definitely been the pacing. Feltway too rushed imo. I know that this arc is apparently dragged on too slowly in the manga, but the anime's solution of just blasting through the content is not any better. The biggest victim of this would have to be the actual cooking in the shokugeki's. Only giving us a little (and later on, none at all) of the cooking process and then just jumping into the judging stage doesn't give the victories as much weight. Also didn't like how they skipped a whole section of Yukihira and co. gathering up their team for the final match (though this is apparently how the manga did it).\\n\\n\r\nIf it gets any more seasons, it'll have to step up to the level of the previous seasons to have me come back to this show cause this season definitely has soured me to the adaptation as a whole.",
            "date": "2018-06-25T01:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 282145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3328399.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chisel",
                "username": "Chisel"
            },
            "url": "https://myanimelist.net/reviews.php?id=282145"
        },
        {
            "content": "First review status here. On the flip side this continuation of Shokugeki no Souma has created a whole new athmosphere of intensity! More battles, more action, and even higher odds. Considering this has officially turned to the battlefield instead of a simple slice of life, the over all plot intensifies.\r\nPersonally i love this style of art and by spending the last seasons on character development, this one took advantage of that prior knowledge and really sparks the beauty behind each characters development. \r\nI love to recommend this season to several of my friends and I honestly would recommend it to probably everyone because its justa bunch of fun and really does show the awesome jam packed battle that food wars have become!",
            "date": "2019-03-18T18:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 303821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6250528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hondakun2008",
                "username": "Hondakun2008"
            },
            "url": "https://myanimelist.net/reviews.php?id=303821"
        },
        {
            "content": "I finally understand why sequel seasons get higher ratings; not only does the audience shrink to those who liked the previous seasons (mostly), but the writing gets more polished and more focused.\r\nHere, with the 3rd season, we see this in full play: energy, entertaining plot twists and suspense.\r\nStory & Characters: 7/10\r\nI'm grouping these together because they're similar. If you were to describe the plot, it's essentially a shonen with cooking. The characters are those you'd find in any standard anime of this genre: always supportive, optimistic, good always triumphs etc etc. But that's something we learn in season 1.\r\nNo, we've stuck around til season 3because it's not about the end result, but the journey - and this is usually what makes and breaks your standard shounen as well. The have added depth and cliff hanger after cliff hanger, that just throws you deeper into a world you didn't think had the potential for depth. \\n\\n\r\nCharacters who were \"tsundere\" get their backstories, new characters come into play and shake up the old, bringing in some new. And of course, it's always interesting seeing how the old and familiar characters deal in their separate ways with said 'new'. You really see how imaginative the creator is, and how they truly know how write, to keep us hooked on a plot purely about cooking. \\n\\n\r\nArt: 10/10\\n\\n\r\nThis is the shining star of the show. The brilliant and broad color palette elevates the show to another level. The finished dishes produced are so incredibly appealing, so mouth-watering, and so beautifully animated that we can show these dishes to people who have never seen anime. Even they will be able to appreciate just how well animated it is - and showing outsiders anime is not something one can easily do ;)\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nShokugeki no Souma truly encaptures everything an anime is: unrealistically colorful, full of too much energy and keeps you hooked through the entire thing. It does what every good show should do: have you clicking on 'Next Episode'. \\n\r\nIt's fast paced, and full of feel good moments, that even though corny at times, doesn't stop you from feeling helplessly satisfied.\\n\\n\r\nThis is a show I'll greatly miss, and I have no doubt I'll be seeing a sequel soon enough.",
            "date": "2019-01-08T16:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 298469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312651.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/itssimplyme",
                "username": "itssimplyme"
            },
            "url": "https://myanimelist.net/reviews.php?id=298469"
        },
        {
            "content": "Shokugeki No Soma is a strange beast. It annoys me, but makes me laugh all the same. It's like one of those annoying friends who keep on bugging you, but you can't help but like them a little.\r\nStory: The story in Shokugeki No Soma is the low point of the series, meaning, there isn't much story. Soma wants to become a better chef than his dad and ends up going to a high class culinary school. The plot is simple, but it works. In the world of Shokugeki No Soma people settle a lot of their disputes through food battles, which have people make extremereactions according to the food. This ends up with mostly being ecchi stuff, like people losing their clothing, but can be fun (\"Oops. I turned into a young girl for a second\" hint hint). Tragically, I think the writers must have had a hard time writing about food as it mostly boils down to \"The umami of this works well with the umami of that. The sourness enhances the umami. Umami this, umami that...\". It's like 90% of all taste is suddenly umami. I call that \"bullshit\" or \"horse crap\".\\n\r\nArt & Sound: The shows art style is nice and flexible, switching fluently between detailed drawings and a more simplistic style (usually when the character aren't acting seriously or for comedic relief). This is well done and goes well with the show. Also, the food is nicely drawn and kinda makes me hungry sometimes. The sound is also very well done, with nice voice acting and good sound effects.\\n\r\nCharacters: The character are a diverse trope filled with most of the stereotypical characters, some mixes and a few, a bit, original. They are enjoyable enough, but usually doesn't get you too invested in their lives.\\n\r\nOverall: Shokugeki no Soma annoys me often, especially with way they describe flavors, but it's a fun watch with enough to keep me watching it all the way. If you're not super against flashing of skin (with awkwardly placed light beams or items placed in front of the more daring areas) or drawn underwear, and want some, over the top, extreme comedy this is a nice watch. Intensive, mostly brainless fun.\\n\r\nEnjoy!",
            "date": "2018-12-06T14:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 295358,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=295358"
        },
        {
            "content": "Episodes: 7/12\r\nWon't watch anymore\r\nWhen I first watched shokugeki no soma I was excited and interested in the story and its characters. The music is amazing and memorable, it really uplifts the scenes and the tense food battles. And parts of me still want to finish the anime and see where it leads but this third season of Shokugeki no soma follows the same formula as the other seasons and at this point, it became predictable and almost boring.\r\nThis is an ecchi anime so you should know what to expect but in my point of view, there was one ecchi scene which took it too far.Some could call it \"pedophilia\" Maybe it was meant as a bad comedy joke but it made me feel very uncomfortable and I can't bring myself to support this anime anymore.",
            "date": "2018-12-05T12:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 295312,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4985411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rhan",
                "username": "Rhan"
            },
            "url": "https://myanimelist.net/reviews.php?id=295312"
        }
    ],
    [
        {
            "content": "I would say this anime is for people who love anime where there is competition for cooking an epic battle to fight or to bring back justice and peace in this for the character's school in the other seasons. I loved this series of anime because this tells some people life lesson as the main character is looked down upon as he surprises other. this is really fun to watch. this has a great story as he faces some challenges that are hard the pass and sometimes tries to but fail. the main character has characteristics and lessons has this makes him better and strongeras he helps his friends and enemies to be better and make them understand their mistakes\\n\r\n hopefully, the company keeps making and writing this anime.\\n",
            "date": "2018-09-16T01:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 289135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/davshin",
                "username": "davshin"
            },
            "url": "https://myanimelist.net/reviews.php?id=289135"
        },
        {
            "content": "So central allows the elite 10 to use their creative freedom to create dishes that will defeat the 'rebellious' students that are fighting for the importance of creative freedom.... that really doesn't make sense lol \r\nIf central is really trying to prove a point they should've had the elite 10 defeat the rebellious students using their conformist recipes... \r\nHonestly I'm getting tired of shokugeki no souma, it's always just one battle after another on an endless loop. The character progression is slow and frankly I'm getting tired of some of them. The show seemed promising at first but it's been a few years and Ican't even remember why I was so hooked on this show in the first place. Hopefully the next season will be more interesting...",
            "date": "2018-08-20T16:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 286998,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4341473.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/oxogen",
                "username": "oxogen"
            },
            "url": "https://myanimelist.net/reviews.php?id=286998"
        },
        {
            "content": "There are subtle spoilers. I believe people that didn't saw the anime wouldn't understand them, but if you are a Mastermind, be careful. \r\n     With growing popularity, Food Wars has become one of the most expected series of each year, but with the coming of the 3rd season, criticism has increased. It’s very comprehensible that the quality of the animation decreased – didn’t know if the studio lacks funds – but I can’t understand how people actually say the plot used to be great and nowadays you can compare it with any shitty basic shounen anime.\\n\\n\r\n     In my view the story of this arc was the result a very rich background narrative and this is why I loved this part so much. \\n\\n\r\n     The difficulty in achieving mastery, or the way to mastery was one of the most interesting themes of the whole franchise. As once said Aristotle: “We are what we repeatedly do. Excellence, then, is not an act, but a habit.” This leads us to the idea that we can achieve our goals by practicing, and its right, we can. But, as I daydream every time I see this quote, maybe Aristotle warned us in one of his lost works, that Excellence has its own legs.  It means to raise your skills is not like a race looking for a perpetual medal or a static arrival. It seems to be closer to an impossible running with hundreds of coyotes and a fragile roadrunner. This can sounds contradictory but Saiba Jouichiro can prove it’s right. He is the ultimate example of a man, who tried to pursuit the highest levels, but no matter what he tried, people never were satisfied. That’s why being the first one is not a privilege of some chosen genius, but the result of an incessant conflict.\\n\r\n     At the start we were all made to think the stay at Tootsuki would be hellish as the central idea of a Shokugeki looks like an unfair betting. You can’t learn in an anarchistic scenario comparable with the Hobbesian bellum omnium contra omnes (war of all against all). \\n\r\n     But in fact there have never been such “state of nature” and the series shows us how the characters can relate with each other as they are “diamonds to be honed”, and the spontaneous shocks with each other makes them shine brighter, or to paraphrase the song: “cause we’re still rough diamonds on the road”.  Even so, we can believe the day a day on Tootsuki Gakuen seems like anarchy, but what a beautiful one.  \\n\\n\r\n     This kind of “twist” seemed to me as a shy cat hidden in the shadows waiting for brushing your leg when you turn backwards. It was comfortable, surprising and joyful.  We just discovered that if Shokugeki is a monster, it is not a bloodcurdling way of imposing the will of the strong, but a brave mother bear protecting his puppies. \\n\\n\r\n     At this point the normal “elite” viewer is thinking on how conveniently the main characters has this sense of empathy towards the academy while other characters just want to support Azami’s Ideal because they are non-important characters. I think this is quite funny. Of course it seems like a normal shounen counter-revolutionary arc, it’s what it is, but this time done correctly. Just think a little bit on how convenient it is for you – a normal student – to stop competing with “very talented genius cockers” to survive in a hellish academy and start following a well oriented cocking project that promised to “democratize” mastery.  \\n\\n\r\n      You can look thought it and perceive almost none of the Elite 10 council has a reason for supporting Azami.  They just want a comfortable position to continue their work and training. No one really believes Azami will create a perfect cuisine and everyone would adopt it, they just want everyone to cock what they want because they believe they are the bests. \\n\r\n     At the end Azami team are the real “elitists” since they can’t refute the “honed diamond” principle and they use and abuse of it to create the perfect team for his cuisine instrumentality project, while the rest of the students are just puppets to this porpoise. He wants to protect them from the beast so called \"Shokugeki\" by taming the students. The way how he admired Jouichirou’s “Shura’s trend” can help us to understand his way of thinking. It also proves his psychopathic Godly cuisine ambition. It all turns back to the “diamonds on the road” statement. Azami’s road looks like Jouichirou’s sandstorm path, while Soma’s road would be in a very cheerful, wooded and graceful village.  Azami can just see the progress in front of a corpse pile where he could escalate to the sky. He can’t see it in a form of a bashful roadrunner. \\n\\n\r\n    His ideology promised to revolutionize Japan’s cuisine, but what he did was to kill the magical link between the creator and the creation, stifle the entrepreneur spirit and transforming artists into proletarians.  \\n\\n\\n\\n",
            "date": "2018-08-16T17:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 286645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4422425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ImenonoawaiDream",
                "username": "ImenonoawaiDream"
            },
            "url": "https://myanimelist.net/reviews.php?id=286645"
        }
    ]
]