[
    [
        {
            "content": "Natsume Yuujinchou San builds on its solid foundation, continuing to weave a heartwarming tale for all viewers. The over-arching theme has evolved from one of loneliness, to acceptance, and finally to warmth over these three seasons, and this one seems to be the most gentle, most stirring, and most impactful yet. \r\nStory:\r\nThe storytelling remains largely episodic, and while each episode may be rather unconnected to the previous, they all reveal much about the protagonist. This season has seen a clear shift, from the more Youkai-centred storytelling of the first two seasons to one focused on the exploration of Natsume's character and his past, giving viewersa more complete picture of Natsume.\\n\\n\r\nArt:\\n\r\nThe art remains soft and unobtrusive, and the animation is fluid. While this is not breathtaking material, it complements the simplicity of the anime, and undoubtedly leaves viewers satisfied. \\n\\n\r\nSound:\\n\r\nLike the art, the sound works closely with the overall theme of the anime, and is gentle, atmospheric and flowing. Voice acting is top notch, and emotional levels are kept at just the right level, for viewers to be able to relate to the characters, yet never allowing the anime to degenerate into angst and melodrama. \\n\\n\r\nCharacter:\\n\r\nRarely do we have a hero who is selfless yet discerning, strong yet frail; rarely, do we have a protagonist so real. Natsume is not one who defies all logic and overcomes insuperable odds, but is one faced with hesitations and uncertainties like the rest of us. \\n\\n\r\nThe supporting characters also hold their own, especially the greedy and increasing obese Nyanko-sensei. Despite their rather short screen time and lack of recurrence,the Youkais are also well developed and believable, each with their own story to tell. Overall, the characters are all colourful, well thought-out and add their own distinctive touches to the story. \\n\\n\r\nEnjoyment:\\n\r\nNatsume Yuujinchou San follows its predecessors in presenting viewers with something relaxing, poignant and thought provoking. \\n\\n\r\nOverall:\\n\r\nDespite the high bar set by the first two seasons, Natsume Yuujinchou San lives up to, and even surpasses all expectations. With a more pronounced touch of optimism than the last two seasons, the show really gave all viewers what they wanted deep in their hearts: to see Natsume get his 'happily ever after'.",
            "date": "2011-08-08T01:34:00+00:00",
            "helpful_count": 127,
            "mal_id": 40963,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109686.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jen9204",
                "username": "Jen9204"
            },
            "url": "https://myanimelist.net/reviews.php?id=40963"
        },
        {
            "content": "We continue to view the journey of Takeshi Natsume, an orphaned teenage boy with the ability to communicate with spirits (not dead people?).\r\nNatsume inherited a 'book fo friends' from his lat, also psycic grandmother. This book is a product of his granny's mischeif, who made a hobbie of seeking out and sealing the identity of spirits to gain control over them; since this book harbours so many glorified slaves, Natsume is a target for:\r\n- spirits who want their identity back\r\n- spirits who wish to do harm\r\n- spirts who want control over sealed spirits\r\nWhilst Natsume works hard to free the pleasant ones from the book, healso has to avoid and/or fight of threats.\\n\\n\r\nJust one ep', yet the quality is as great as it has always been.\\n\r\nThere are many reasons to give this series a high rating before even watching, as it does what many others don't do, for example:\\n\\n\r\nCharacter type...\\n\r\nHow many anime's have we all watched were females are either; irratic,  over-emmotional wreacks or mousey moes', whilst the males are either; standoffish a.k.a 'cool', or level headed yet goofy?\\n\r\nThese popular character types aren't components within this series.\\n\\n\r\nNatsume himself is a pleasant, hard working individual with equally pleasant friends we see now and again, all who could easily be classed as a 'nerd' in other series's, yet their good attitudes are the norm in this series.\\n\\n\r\nAnother common element is the typical 'teen angst'; moody h=behaviour and the rush to attain 'relationship' status whilst in a rush to 'grow up' and ensure allies don't so much as act their age. \\n\r\nThis isn't appaent here either; Natsume seems to enjoy his life with his gaurdians and doesn't treat (the few) females that appear like another species.\\n\\n\r\nPeril...\\n\r\nPeril can strike at any time, as Natsume is constantly in danger, even his mentor Madara clamis to want to take Nautsume's life at some point.\\n\r\nA variety of spirits seeking him out; some being good, some being not-so-nice, are part of life for Takeshi Natsume.\\n\r\nStill, the series manages to be pleasant enough to watch at any age; something a tad unusual these days.\\n\\n\r\nThis series sums up, in the first episode, what 'Natsume Yuujinchou' is all about, there's no reason not to watch.\\n\\n\r\nWhat makes this series differ from the previous two you may ask?\\n\r\nIn this series, things are going well for Natsume; we see him mixing with more humans and having a general positive outlook on things* that have upset him previously, however, his new found 'peace' is bitter sweet, as threats he isn't really prepared for are now coming his way, his new found possitivity isn't doing him much favours at the moment.",
            "date": "2011-07-06T08:16:00+00:00",
            "helpful_count": 57,
            "mal_id": 38750,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=38750"
        },
        {
            "content": "NOTE: Since the content in all three seasons is similar enough that they don't warrant separate reviews, they will all be covered here. The fourth will be edited in when it finishes, unless it differs heavily from the first three by the end of its run.\r\nNatsume Yuujinchou covers a familiar kind of story. We are presented with a teenage boy, who is unusually airy and doesn't socialize much, and frequently seems to be looking intently at things that aren't there. As you may have guessed, Natsume sees dead people. Well, not exactly... he can see Youkai, a kind of spirit told of in Japanese folklore.\r\nManyof the Youkai themselves seem to possess an unusual interest in Natsume. One day, as a pair of Youkai are chasing him, he accidentally breaks a seal containing a powerful Youkai... one that knows why Natsume is being chased. You see, his grandmother Reiko had the same gift as him, and used to go around beating up Youkai and making them give away their names to her (which allowed her to command them), which she collected in a book, the titular Yuujinchou (Book of Friends). And now that Reiko is dead, Natsume has to attempt to return the names, but without losing the book in the process. And his new Youkai friend Madara has agreed to help protect him, as long as he is entitled to the book upon Natsume's natural passing.\\n\\n\r\nWhat is really impressive about Natsume Yuujinchou is that, from that plot summary there, you will mostly likely think of many other series from various different mediums that follow a similar blueprint. And yet Natsume is significantly better than them. Natsume, as a series, takes on this theme with a brilliant level of poignancy. Rather than being a generic shonen action series as it so easily could have been (many of the bare bones of the series show parallels to Bleach, for example), Natsume is more concerned with telling the stories of each of these Youkai. While there is the occasional flash of action, this is never really the point. It's extremely refreshing to see a premise so frequently used for nothing more than cheap kicks done so beautifully. It even strikes something of a contrast with excellent series such as Mushishi and Mononoke, in that while these are focused on the abnormality of the creatures the series is based around, Yuujinchou is far more down to earth and human-feeling.\\n\\n\r\nPlotwise, this series is episodic, with the episodes focusing on individual youkai, with the stories not generally intertwining or crossing more than one episode (though there are exceptions). Almost all of the episodes are excellent, though there's two or three I didn't really care for. The second season in particular ups the quality of these, with the last four standing out as being firmly the best out of both seasons. There's not really anything in the way of an overarching plot or any clear goal, but it's all tied together through the furthering of Natsume's character and the additional insights into Reiko which we see through the Youkai's memories, both of which are excellent features of the series.\\n\\n\r\nThe characterisation in this series is truly unique. Every character is very down-to-earth and believable, and yet not quite your everyday average Joe either. They all have distinctive personalities, and yet feel totally natural. The character designs are much the same way: simple-looking, but effective and distinctive. The only characters who are consistently in every episode are Natsume himself, and his Youkai bodyguard Madara A.K.A Nyanko-sensei. Madara is mostly comic relief, but effectively so. In his true form he's much easier to take seriously, which is often used to good effect. Natsume, on the other hand, is definitely the pinnacle of the aforementioned style. He doesn't really have a clear, character-defining moment or trait, which initially makes him seem like an uninteresting character. However, the more you get to know him, the better a character he seems. He is slowly but surely characterised through musings and realizations gathered through his experiences with all the Youkai he meets, painting a subtle yet excellent portrait of his character. In the third season, this reaches it's peak, as he slowly comes to not only accept, but value his unique circumstances and all the friends he's made because of it.\\n\\n\r\nIn terms of production, the animation is superb. Oddly, though, it's quite restrained about it. Aside from some really beautiful, picturesque background art, it doesn't attempt to beat you over the head with its visuals, letting them stay in the background but subtly lending a lot to the series. In the second season especially, though, it dishes out quite a few animation bumps in some of the series more excellent moments, when it really needs to be rendered better. With this, combined with an excellent character art style, Natsume Yuujinchou just plain looks beautiful all-round. Musically, the OST does much the same as the art: it is distinct, amazing, perfectly fitting, but not overbearing. The music is invariably perfectly matched to the tone of the scene rather than being used to create the tone. The voice acting is all-round excellent, but my only problem with it is, strangely enough, Natsume himself. Hiroshi Kamiya was, in my opinion, a poor choice of casting. He does, however, put in an excellent performance which is hardly surprising given how good of an actor he is, but his voice seems terribly unfit to the role, and far more suited to more average and highly strung protagonists like those he usually plays, as opposed to the awkward, airy Natsume. Still, it's hardly distracting.\\n\\n\r\nIf I have any real complaint about Natsume Yuujinchou, it's that almost every episode's plot is built from a random contrivance. Generally, Natsume encounters something vital to the plot of the episode by sheer coincidence that is not directly tied to the plot at all. It's not terribly distracting, but it's done repeatedly and always seems far too convenient.\\n\\n\r\nNonetheless, Natsume Yuujinchou is an excellent series. It's a calming, relaxing show that simply does its job well. The second and third seasons are better than the first, with the second having better standalone episodes, along with better art and directing than the other two, and the third contributing more to the overall story and Natsume's development. Which season is the best is really a question of style vs. substance.\\n\\n\r\nFinal Words: Something I would solidly recommend to anyone looking for a calming, soothing anime.\\n\\n\r\nStory/Plot: 8/10\\n\r\nCharacters: 8/10\\n\r\nAnimation/Art: 10/10\\n\r\nMusic: 10/10\\n\r\nActing: 8/10\\n\\n\r\nSeason One Overall: 8/10\\n\r\nSeason Two Overall: 9/10\\n\r\nSeason Three Overall: 9/10\\n\\n\r\nFor Fans Of: Mushi-shi, XxXHoLic",
            "date": "2012-02-03T03:17:00+00:00",
            "helpful_count": 49,
            "mal_id": 53101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=53101"
        },
        {
            "content": "Although many believe a happy ending is most often times not a \"good ending\" I would beg to differ. In this season, Natsume not only presses towards the future, but shows flashbacks of the past. I was thrilled to see more of Natsume's past because it enabled me to fill some of the mysteries behind his past. \r\nI can't help but praise this anime on it's ability to take repetitive situations, and make them unique. Natsume almost always gets into trouble, but not in a logical way. The scenario is often the same, a youkai wants to hurt him or request his assistance. Yet eachend result is different, whilst simultaneously being slightly similar. Albeit slightly similar, the satisfaction the viewer feels is still high. There's a notable sense of growth and development within each interaction This anime is so relaxing and does such a great job at catching the viewers attention.\\n\\n\r\nThe characters are perfection, the support characters continue to grow. They're so realistic and heartfelt.\\n\\n\r\nSadly there's only one more season after this. I expect it to be spectacular.",
            "date": "2013-07-04T01:08:00+00:00",
            "helpful_count": 45,
            "mal_id": 103723,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=103723"
        },
        {
            "content": "Natsume Yuujinchou’s presentation style is distinctly episodic, meaning that the external conflicts in themselves don’t add up to much. However, there remains a strong undercurrent of Natsume’s character development throughout as he grows from being a lonely boy to a self-assured young man. As such, what makes the viewing experience so worthwhile is the subtle touch of delicate dilemmas and enchanting atmospheres.\r\nSince he was a child, Natsume Takashi has always been able to see supernatural beings that others could not. As a result, many people around him have either thought he was crazy or treated him as a sign of bad luck, which has ledto him being somewhat of a loner. All of this would change once he got his hands on a strange book that belonged to his grandmother, Reiko, and contains the names of all the spirits that his grandmother had contracted into helping her. Natsume, accompanied by Madara, a spirit who disguises himself as the large cat, making new friends in the process and learning how to live in harmony with humans and spirits.\\n\\n\r\nNatsume Yuujinchou San's animation was decently fluid, especially when it came to the movement of the youkai. The colour palate for the show wasn't too bright or overpowering, yet the subtle colours remain versatile and can do a nice job of setting up a mood or tone for a certain scene. As always, the Youkai that appear each have their own unique character designs that could range from simple to complex and silly to graceful, giving their supernatural world a diverse feel. The details put into the show make things beautiful. And the animation during the \"magic\" scenes flow so well and just seem so serene it really changes the atmosphere from an action to a spiritual feel. \\n\\n\r\nThe ED of the show is rather slow and peaceful like the series itself; the singing and lyrics are full of emotion. The OP is good too, however the ED is more memorable because of its melodies. Overall, the soundtrack was excellent.\\n\\n\r\nThe background music is really nice and also does a great job of giving a tone or mood to a scene which is a job well done for the soundtrack.\\n\\n\r\nThe voice characters are well acted and always suitable, but the best performances belong to the spirits. Be they comic relief or frightening foes, their intonations are so spot-on that they remain emotionally engaging throughout.\\n\\n\r\nWhere this story especially excels is in the introduction of one-off characters. \\n\\n\r\nNatsume was generally quiet and reserved, he's one of those guys with one of those skills that not many others possess and make him look crazy. So in reaction to that he keeps it a secret and is very much to himself. However he's different than most other protagonist in these situations. He doesn't completely shut himself off from the world on purpose. \\n\\n\r\nThe spirits themselves are fleshed out rather well because each one has a distinct personality and detailed background which gives them a human quality that makes it easier for the audience to empathize with them.\\n\\n\r\nYou'll sit back at the end of each episode and reflect on the fleeting poignant moments experienced minutes ago. \\n\r\nThis is a series that’s full of heart; it’s compassionate, emotional, but still ultimately upbeat.\\n\\n\r\nNatsume Yuujinchou San has this subdued and enchanting setting, the series shines brightest in the way it draws out the viewer’s emotions as it tells its stories while developing its cast to the fullest. As such, people looking for a relaxing, wonderful series that goes into the realms of magical realism should definitely give this title a shot.",
            "date": "2013-04-12T23:38:00+00:00",
            "helpful_count": 20,
            "mal_id": 93559,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2157233.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NonOtaku",
                "username": "NonOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=93559"
        },
        {
            "content": "Natsume Yuujinchou San shows the continuation of Natsume and nyanko sensei's adventures.\r\nStory : 9\r\nAs well as progressing with the anime's storyline,the third season gives us a deeper look into Natsume's past and how he came to meet and decided to live with his current foster parents.Also,as the episodes go on,Natsume is seen dealing with even more powerful youkai,which makes the show really interesting as to how Natsume will deal with them every time.FInally,this season shows Natsume developing more friendships and making his bonds with his human friends even more powerful,gradually realizing that both youkai and humans matter to him a lot.\r\nArt : 9\r\nWhile the show'sart style is a frequently-used one nowadays,it feels really peculiar in a good way,probably because of the beautiful scenery of the show.\\n\r\nSound : 9\\n\r\nThe music of the show fits perfectly the mood of it,although it kinda feels nostalgic,something that I hope will change in season 4.\\n\r\nCharacter : 10\\n\r\nAll characters in the anime,including the minor ones,are explored in full detail throughout the season (as well as the previous seasons) which makes them feel very real and fresh.A notable characteristic is the diversity of backgrounds that the characters have,which works as an advantage for the show,in that everyone can relate to at least one of the characters.\\n\r\nEnjoyment : 10\\n\r\nI OFTEN pause my player when watching an anime.In the case of Natsume Yuujinchou however,I don't even notice how 22 minutes go by every time.That is a great plus,since the show is neither boring nor tiresome.\\n\r\nOverall : 10\\n\r\nI am really looking forward to season 4 and hope that you will enjoy the 3rd season as much as I did!",
            "date": "2011-09-26T16:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 44229,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/192064.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Akuma-Shitsuji",
                "username": "Akuma-Shitsuji"
            },
            "url": "https://myanimelist.net/reviews.php?id=44229"
        },
        {
            "content": "If you were to summarize Natsume Yuujinchou San in one word it would be boring. After the first couple of episodes you have basically watched them all as Natsume Yuujinchou San is repetitiveness in its purest form. \r\nThe story and characters themselves lack any kind of depth. When watching the show I wondered what this show actually had going for it. Action scenes with the youkai? No, even the worst action type anime can match it. Pathos heavy storytelling? No, none of the stories were emotional enough to actually make any impact. I can't think of a single redeeming factor for this show, it justscreams mediocrity. \\n\\n\r\nBut I could ignore every single flaw with this series if it hadn't been for the protagonist being such a blockhead. \\n\\n\r\nIf you are unsure whether you'll like this snoozefest you can watch a 2-4 episodes and you've basically watched them all. If you're uninterested you saved yourself time to watch other shows.",
            "date": "2019-04-16T19:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 306487,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7588545.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Omnimaniac",
                "username": "Omnimaniac"
            },
            "url": "https://myanimelist.net/reviews.php?id=306487"
        },
        {
            "content": "This season finally gave me what I was looking for from this anime, and I'm so happy it did because it was amazing.\r\nSo, my absolute favorite thing about this season was, finally, Natsume's character development. It was wonderfully done as it took elements from the stories we were seeing from the youkai and also elements we'd already heard but not had elaboration on. Essentially, Natsume was able to tell the story of his past through his present, and that made it really entertaining to watch.\r\nAnother thing I loved about this season is that the youkai got a lot more grit. The anime still kept itsgentle charm, but the youkai still were scarier and more intense than in previous seasons. It's down to personal taste, ultimately, but I really liked that aspect of this season. \\n\\n\r\nI haven't really talked about the art before, but this season really solidified the reasons I love the style, regardless of how simple it is. The movements of the characters are so smooth and nice to see, especially when it's something small like them turning their heads or their facial expressions. It's a bit weird to talk about, but it makes the characters come to life in a way other anime characters don't.\\n\\n\r\nOverall, this anime just keeps getting better and better. It's got one of the best anime soundtracks I've ever heard, the main character is starting to be fleshed out with conflicts and struggles, and the story feels more like it's heading toward a slightly bigger and more permanent picture rather than the week-to-week youkai stuff. I'm loving it, and I can't wait to keep going. This season was the best yet!",
            "date": "2019-02-27T21:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 302593,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302593"
        },
        {
            "content": "After waiting two seemingly very long years, a sequel is finally here. Oh! I genuinely miss this series. Though, at the beginning they will explain it a little bit but still you wouldn’t understand it much less appreciates how great this series is if you haven’t seen the previous seasons.\r\nThe different stories are polish even more. I could say that it lived up to the greatness of the stories from the previous seasons. It is more dramatic, heart-warming, and touching especially when Natsume’s past is revealed. Things get a lot more exciting and interesting when Natsume has to deal with bothersome and extremely irritating exorcists.Very few can really balance a serious drama, heart-warming, and touching yet so funny series which I strongly believe why this series is so famous even with a not so spectacular plot it has like those famous shounen series of today. \\n\\n\r\nIs it me? Or Nyanko-seinsei seems a little bigger and fatter now? And for some reason, he’s a lot cuter and fluffier. His a lot more hilarious as well. This time, not only the supernatural creatures but some recurring characters are explored more so we get to see more of their stories. I love that this time not only the supernatural creatures are the focus of the story but some of the characters as well. It really balances Natsume’s relationship with both worlds. I just love his families and friends who really accept him despite knowing that he still keeps everything to himself. It is very dramatic yet so touching. Some of Natsume’s past is revealed and we can see how sad and unfortunate his past is. It is really great that now he has some really important friends and family who accepts him, both human and supernatural creatures. Finally, Natsume is gradually letting others know about the youkais and ayakashis. He no longer shoulders everything to himself because he already has people who accept and love him for who he is. You can really see how his character gets better. His more open to others, talkative, optimistic, and more importantly happier. And because of that, his a lot closer both to humans and the supernatural creatures. \\n\\n\r\nBut of course, after quite sometime after the last season, the animation is even better now. I love that they maintain the style of the ending animation like the previous seasons. And as always, this series has one of the best sounds amongst today’s animes.\\n\\n\r\nI strongly believe that this time, this series is way even better. Every element of it is polish even more; from the genres it has, the stories, characters, styles, and even the sounds. It genuinely surpasses the greatness of the previous ones. I could definitely say that it is so worth the wait. Though I am so grateful that they are making so many seasons for this series, I would have really love it more if they make more episodes for every season. I am going to wait for the sequel even if it will take so many years!\\n",
            "date": "2012-12-09T08:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 79680,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79680"
        },
        {
            "content": "Natsume yuujinchou san, the third installment of the beloved series, brings the same lightheartedness and melancholy known throughout the series. \r\nLike it's previous seasons, it is largely episodic minus a few two part episodes. The plot of this season also differs in area. Whereas the first season focused on Natsume coming to terms with youkai, the second season with him becoming rather fond of youkai, to now, the third installment, with him having to choose between youkai and humans: Who does he care about more?\r\nThe season offers more insight into his grandmother, and continues the exploration of youkai, each one a marvelous story, every oneonly giving Nastume more development and growth as a person, and therefore to us, a character. \\n\\n\r\nThe Art and sound are still the same, as to say wonderful. The art is well drawn, and though not particularity amazing, it is, as always, memorable, especially when you consider the character designs, specifically the youkai. Natsume himself, though a memorable drawn character, looks fairly similar to many other anime characters, like the twins from Kimi to Boku. The youkai however, are for the most part memorable, though season 3 suffers from an entire memorable cast that made season 1 especially brilliant. \\n\\n\r\nThe animation is the same: Fluid and never dull, and though the season lacks a real sort of action, you can appreciate the animation when it does. Certainly nothing to be fanatic about, but not something to laugh at either. \\n\\n\r\nThe sound, as stated above, is continually amazing and heart warming. Many pieces throughout instill an emotion in your heart, and each one pieces together nicely with the particular event happening in the episode. Imagine a horror movie with suspenseful music. That's how you know it's suspenseful.\\n\\n\r\nAgain, characters here in the 3rd series are largely likable, and Natsume nor Madara never suffers. They even add some new ones, such as a particular villain who, like true nastume yuujinchou tradition, is never really violent violent. The show, after all, is more peaceful than anything.  However unlike previous seasons, youkai introduced are either boring, unimportant or memorable, and I would say in my opinion, out of the 13 episodes, I can only bring up 5. The show also focuses less on Natsume's frieds, who you actually like because of their banter, comic relief, heart warming attitudes towards natsume & the friendship they provide to an otherwise lonely teen. Lonliness is less of a focus now, especially as the season develops. He becomes more caring towards his foster family and sees them now as cherished people, who he can accept as father and mother. \\n\\n\r\nOverall, if you enjoyed the first two seasons, you will enjoy this one, but do understand that in no way shape or form will this be like the first season. Imagine a team that at the start won a championship, but the next 3 years they went from losing in the finals, to losing in the 3rd round, to losing in the second round, but every time, they made it to the finals. \\n\\n\r\nNatsume yuujinchou san is still a good team, they just aren't great anymore.",
            "date": "2015-10-02T14:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 200359,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=200359"
        },
        {
            "content": "-Kon’nichiwa Mina-san!! Have you already watched Natsume Yuujicnhou by Yuki Midorikawa-sama? This anime will give you a refreshing feeling that is rare to find, some says that you can compare it to Mushishi. Well talking about that is another story.Talking about our main review Natsume Yuujinchou is about the boy named natsume Takashi an adopted child of the childless but kind couple Touku and Shirugen Furijawa and also about the sadness and the longing for someone to understand him despite of his ability to see and communicate with the Ayakashi or Yokai as they said. And as the days go by he started to learnthe what-about of the Ayakashi with the help of Madara also known as Nyanko-sensei.\\n\r\nIt also has a prequel in titled “Zoku Natsume Yuujinchou”. In this season his journey to give back the names of every Ayakashi within the Yuujinchou also known as the “The Book of Friends” that he inherited to his grandmother Reiko Natsume, a strong and naughty girl in her days continues as he, little by little understand the differences and the sameness of the Ayakashi and the human. At the last episode of ZNY Natsume Stated that;\\n\r\n“It doesn’t matter whether they’re human or Ayakahi.”\\n\r\n“What’s Important is they’re precious to you.”\\n\r\n“You should accept them as they are and the feelings and joy that come with it, without hesitation.”\\n\r\nIt shows that natsume had used to live and understand to live both with human and Ayakashi. He discovered that both have sames somehow in someways.\\n\r\nWill there be a third Season?? Oh I’m really happy to say YES!! It will begin airing on July 4, 2011!!! In Titled Natsume Yuujinchou-San. Want a Shoujo in its genre? You’re wish has granted!!\\n\\n\r\nthis review can be seen in my wordpress\\n\r\nhttp://irock7444.wordpress.com/",
            "date": "2012-04-06T12:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 58063,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1235191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/soul7444",
                "username": "soul7444"
            },
            "url": "https://myanimelist.net/reviews.php?id=58063"
        }
    ],
    [
        {
            "content": "Natsume Yuujinchou San builds on its solid foundation, continuing to weave a heartwarming tale for all viewers. The over-arching theme has evolved from one of loneliness, to acceptance, and finally to warmth over these three seasons, and this one seems to be the most gentle, most stirring, and most impactful yet. \r\nStory:\r\nThe storytelling remains largely episodic, and while each episode may be rather unconnected to the previous, they all reveal much about the protagonist. This season has seen a clear shift, from the more Youkai-centred storytelling of the first two seasons to one focused on the exploration of Natsume's character and his past, giving viewersa more complete picture of Natsume.\\n\\n\r\nArt:\\n\r\nThe art remains soft and unobtrusive, and the animation is fluid. While this is not breathtaking material, it complements the simplicity of the anime, and undoubtedly leaves viewers satisfied. \\n\\n\r\nSound:\\n\r\nLike the art, the sound works closely with the overall theme of the anime, and is gentle, atmospheric and flowing. Voice acting is top notch, and emotional levels are kept at just the right level, for viewers to be able to relate to the characters, yet never allowing the anime to degenerate into angst and melodrama. \\n\\n\r\nCharacter:\\n\r\nRarely do we have a hero who is selfless yet discerning, strong yet frail; rarely, do we have a protagonist so real. Natsume is not one who defies all logic and overcomes insuperable odds, but is one faced with hesitations and uncertainties like the rest of us. \\n\\n\r\nThe supporting characters also hold their own, especially the greedy and increasing obese Nyanko-sensei. Despite their rather short screen time and lack of recurrence,the Youkais are also well developed and believable, each with their own story to tell. Overall, the characters are all colourful, well thought-out and add their own distinctive touches to the story. \\n\\n\r\nEnjoyment:\\n\r\nNatsume Yuujinchou San follows its predecessors in presenting viewers with something relaxing, poignant and thought provoking. \\n\\n\r\nOverall:\\n\r\nDespite the high bar set by the first two seasons, Natsume Yuujinchou San lives up to, and even surpasses all expectations. With a more pronounced touch of optimism than the last two seasons, the show really gave all viewers what they wanted deep in their hearts: to see Natsume get his 'happily ever after'.",
            "date": "2011-08-08T01:34:00+00:00",
            "helpful_count": 127,
            "mal_id": 40963,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109686.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jen9204",
                "username": "Jen9204"
            },
            "url": "https://myanimelist.net/reviews.php?id=40963"
        },
        {
            "content": "We continue to view the journey of Takeshi Natsume, an orphaned teenage boy with the ability to communicate with spirits (not dead people?).\r\nNatsume inherited a 'book fo friends' from his lat, also psycic grandmother. This book is a product of his granny's mischeif, who made a hobbie of seeking out and sealing the identity of spirits to gain control over them; since this book harbours so many glorified slaves, Natsume is a target for:\r\n- spirits who want their identity back\r\n- spirits who wish to do harm\r\n- spirts who want control over sealed spirits\r\nWhilst Natsume works hard to free the pleasant ones from the book, healso has to avoid and/or fight of threats.\\n\\n\r\nJust one ep', yet the quality is as great as it has always been.\\n\r\nThere are many reasons to give this series a high rating before even watching, as it does what many others don't do, for example:\\n\\n\r\nCharacter type...\\n\r\nHow many anime's have we all watched were females are either; irratic,  over-emmotional wreacks or mousey moes', whilst the males are either; standoffish a.k.a 'cool', or level headed yet goofy?\\n\r\nThese popular character types aren't components within this series.\\n\\n\r\nNatsume himself is a pleasant, hard working individual with equally pleasant friends we see now and again, all who could easily be classed as a 'nerd' in other series's, yet their good attitudes are the norm in this series.\\n\\n\r\nAnother common element is the typical 'teen angst'; moody h=behaviour and the rush to attain 'relationship' status whilst in a rush to 'grow up' and ensure allies don't so much as act their age. \\n\r\nThis isn't appaent here either; Natsume seems to enjoy his life with his gaurdians and doesn't treat (the few) females that appear like another species.\\n\\n\r\nPeril...\\n\r\nPeril can strike at any time, as Natsume is constantly in danger, even his mentor Madara clamis to want to take Nautsume's life at some point.\\n\r\nA variety of spirits seeking him out; some being good, some being not-so-nice, are part of life for Takeshi Natsume.\\n\r\nStill, the series manages to be pleasant enough to watch at any age; something a tad unusual these days.\\n\\n\r\nThis series sums up, in the first episode, what 'Natsume Yuujinchou' is all about, there's no reason not to watch.\\n\\n\r\nWhat makes this series differ from the previous two you may ask?\\n\r\nIn this series, things are going well for Natsume; we see him mixing with more humans and having a general positive outlook on things* that have upset him previously, however, his new found 'peace' is bitter sweet, as threats he isn't really prepared for are now coming his way, his new found possitivity isn't doing him much favours at the moment.",
            "date": "2011-07-06T08:16:00+00:00",
            "helpful_count": 57,
            "mal_id": 38750,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=38750"
        },
        {
            "content": "NOTE: Since the content in all three seasons is similar enough that they don't warrant separate reviews, they will all be covered here. The fourth will be edited in when it finishes, unless it differs heavily from the first three by the end of its run.\r\nNatsume Yuujinchou covers a familiar kind of story. We are presented with a teenage boy, who is unusually airy and doesn't socialize much, and frequently seems to be looking intently at things that aren't there. As you may have guessed, Natsume sees dead people. Well, not exactly... he can see Youkai, a kind of spirit told of in Japanese folklore.\r\nManyof the Youkai themselves seem to possess an unusual interest in Natsume. One day, as a pair of Youkai are chasing him, he accidentally breaks a seal containing a powerful Youkai... one that knows why Natsume is being chased. You see, his grandmother Reiko had the same gift as him, and used to go around beating up Youkai and making them give away their names to her (which allowed her to command them), which she collected in a book, the titular Yuujinchou (Book of Friends). And now that Reiko is dead, Natsume has to attempt to return the names, but without losing the book in the process. And his new Youkai friend Madara has agreed to help protect him, as long as he is entitled to the book upon Natsume's natural passing.\\n\\n\r\nWhat is really impressive about Natsume Yuujinchou is that, from that plot summary there, you will mostly likely think of many other series from various different mediums that follow a similar blueprint. And yet Natsume is significantly better than them. Natsume, as a series, takes on this theme with a brilliant level of poignancy. Rather than being a generic shonen action series as it so easily could have been (many of the bare bones of the series show parallels to Bleach, for example), Natsume is more concerned with telling the stories of each of these Youkai. While there is the occasional flash of action, this is never really the point. It's extremely refreshing to see a premise so frequently used for nothing more than cheap kicks done so beautifully. It even strikes something of a contrast with excellent series such as Mushishi and Mononoke, in that while these are focused on the abnormality of the creatures the series is based around, Yuujinchou is far more down to earth and human-feeling.\\n\\n\r\nPlotwise, this series is episodic, with the episodes focusing on individual youkai, with the stories not generally intertwining or crossing more than one episode (though there are exceptions). Almost all of the episodes are excellent, though there's two or three I didn't really care for. The second season in particular ups the quality of these, with the last four standing out as being firmly the best out of both seasons. There's not really anything in the way of an overarching plot or any clear goal, but it's all tied together through the furthering of Natsume's character and the additional insights into Reiko which we see through the Youkai's memories, both of which are excellent features of the series.\\n\\n\r\nThe characterisation in this series is truly unique. Every character is very down-to-earth and believable, and yet not quite your everyday average Joe either. They all have distinctive personalities, and yet feel totally natural. The character designs are much the same way: simple-looking, but effective and distinctive. The only characters who are consistently in every episode are Natsume himself, and his Youkai bodyguard Madara A.K.A Nyanko-sensei. Madara is mostly comic relief, but effectively so. In his true form he's much easier to take seriously, which is often used to good effect. Natsume, on the other hand, is definitely the pinnacle of the aforementioned style. He doesn't really have a clear, character-defining moment or trait, which initially makes him seem like an uninteresting character. However, the more you get to know him, the better a character he seems. He is slowly but surely characterised through musings and realizations gathered through his experiences with all the Youkai he meets, painting a subtle yet excellent portrait of his character. In the third season, this reaches it's peak, as he slowly comes to not only accept, but value his unique circumstances and all the friends he's made because of it.\\n\\n\r\nIn terms of production, the animation is superb. Oddly, though, it's quite restrained about it. Aside from some really beautiful, picturesque background art, it doesn't attempt to beat you over the head with its visuals, letting them stay in the background but subtly lending a lot to the series. In the second season especially, though, it dishes out quite a few animation bumps in some of the series more excellent moments, when it really needs to be rendered better. With this, combined with an excellent character art style, Natsume Yuujinchou just plain looks beautiful all-round. Musically, the OST does much the same as the art: it is distinct, amazing, perfectly fitting, but not overbearing. The music is invariably perfectly matched to the tone of the scene rather than being used to create the tone. The voice acting is all-round excellent, but my only problem with it is, strangely enough, Natsume himself. Hiroshi Kamiya was, in my opinion, a poor choice of casting. He does, however, put in an excellent performance which is hardly surprising given how good of an actor he is, but his voice seems terribly unfit to the role, and far more suited to more average and highly strung protagonists like those he usually plays, as opposed to the awkward, airy Natsume. Still, it's hardly distracting.\\n\\n\r\nIf I have any real complaint about Natsume Yuujinchou, it's that almost every episode's plot is built from a random contrivance. Generally, Natsume encounters something vital to the plot of the episode by sheer coincidence that is not directly tied to the plot at all. It's not terribly distracting, but it's done repeatedly and always seems far too convenient.\\n\\n\r\nNonetheless, Natsume Yuujinchou is an excellent series. It's a calming, relaxing show that simply does its job well. The second and third seasons are better than the first, with the second having better standalone episodes, along with better art and directing than the other two, and the third contributing more to the overall story and Natsume's development. Which season is the best is really a question of style vs. substance.\\n\\n\r\nFinal Words: Something I would solidly recommend to anyone looking for a calming, soothing anime.\\n\\n\r\nStory/Plot: 8/10\\n\r\nCharacters: 8/10\\n\r\nAnimation/Art: 10/10\\n\r\nMusic: 10/10\\n\r\nActing: 8/10\\n\\n\r\nSeason One Overall: 8/10\\n\r\nSeason Two Overall: 9/10\\n\r\nSeason Three Overall: 9/10\\n\\n\r\nFor Fans Of: Mushi-shi, XxXHoLic",
            "date": "2012-02-03T03:17:00+00:00",
            "helpful_count": 49,
            "mal_id": 53101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=53101"
        },
        {
            "content": "Although many believe a happy ending is most often times not a \"good ending\" I would beg to differ. In this season, Natsume not only presses towards the future, but shows flashbacks of the past. I was thrilled to see more of Natsume's past because it enabled me to fill some of the mysteries behind his past. \r\nI can't help but praise this anime on it's ability to take repetitive situations, and make them unique. Natsume almost always gets into trouble, but not in a logical way. The scenario is often the same, a youkai wants to hurt him or request his assistance. Yet eachend result is different, whilst simultaneously being slightly similar. Albeit slightly similar, the satisfaction the viewer feels is still high. There's a notable sense of growth and development within each interaction This anime is so relaxing and does such a great job at catching the viewers attention.\\n\\n\r\nThe characters are perfection, the support characters continue to grow. They're so realistic and heartfelt.\\n\\n\r\nSadly there's only one more season after this. I expect it to be spectacular.",
            "date": "2013-07-04T01:08:00+00:00",
            "helpful_count": 45,
            "mal_id": 103723,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=103723"
        },
        {
            "content": "Natsume Yuujinchou’s presentation style is distinctly episodic, meaning that the external conflicts in themselves don’t add up to much. However, there remains a strong undercurrent of Natsume’s character development throughout as he grows from being a lonely boy to a self-assured young man. As such, what makes the viewing experience so worthwhile is the subtle touch of delicate dilemmas and enchanting atmospheres.\r\nSince he was a child, Natsume Takashi has always been able to see supernatural beings that others could not. As a result, many people around him have either thought he was crazy or treated him as a sign of bad luck, which has ledto him being somewhat of a loner. All of this would change once he got his hands on a strange book that belonged to his grandmother, Reiko, and contains the names of all the spirits that his grandmother had contracted into helping her. Natsume, accompanied by Madara, a spirit who disguises himself as the large cat, making new friends in the process and learning how to live in harmony with humans and spirits.\\n\\n\r\nNatsume Yuujinchou San's animation was decently fluid, especially when it came to the movement of the youkai. The colour palate for the show wasn't too bright or overpowering, yet the subtle colours remain versatile and can do a nice job of setting up a mood or tone for a certain scene. As always, the Youkai that appear each have their own unique character designs that could range from simple to complex and silly to graceful, giving their supernatural world a diverse feel. The details put into the show make things beautiful. And the animation during the \"magic\" scenes flow so well and just seem so serene it really changes the atmosphere from an action to a spiritual feel. \\n\\n\r\nThe ED of the show is rather slow and peaceful like the series itself; the singing and lyrics are full of emotion. The OP is good too, however the ED is more memorable because of its melodies. Overall, the soundtrack was excellent.\\n\\n\r\nThe background music is really nice and also does a great job of giving a tone or mood to a scene which is a job well done for the soundtrack.\\n\\n\r\nThe voice characters are well acted and always suitable, but the best performances belong to the spirits. Be they comic relief or frightening foes, their intonations are so spot-on that they remain emotionally engaging throughout.\\n\\n\r\nWhere this story especially excels is in the introduction of one-off characters. \\n\\n\r\nNatsume was generally quiet and reserved, he's one of those guys with one of those skills that not many others possess and make him look crazy. So in reaction to that he keeps it a secret and is very much to himself. However he's different than most other protagonist in these situations. He doesn't completely shut himself off from the world on purpose. \\n\\n\r\nThe spirits themselves are fleshed out rather well because each one has a distinct personality and detailed background which gives them a human quality that makes it easier for the audience to empathize with them.\\n\\n\r\nYou'll sit back at the end of each episode and reflect on the fleeting poignant moments experienced minutes ago. \\n\r\nThis is a series that’s full of heart; it’s compassionate, emotional, but still ultimately upbeat.\\n\\n\r\nNatsume Yuujinchou San has this subdued and enchanting setting, the series shines brightest in the way it draws out the viewer’s emotions as it tells its stories while developing its cast to the fullest. As such, people looking for a relaxing, wonderful series that goes into the realms of magical realism should definitely give this title a shot.",
            "date": "2013-04-12T23:38:00+00:00",
            "helpful_count": 20,
            "mal_id": 93559,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2157233.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NonOtaku",
                "username": "NonOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=93559"
        },
        {
            "content": "Natsume Yuujinchou San shows the continuation of Natsume and nyanko sensei's adventures.\r\nStory : 9\r\nAs well as progressing with the anime's storyline,the third season gives us a deeper look into Natsume's past and how he came to meet and decided to live with his current foster parents.Also,as the episodes go on,Natsume is seen dealing with even more powerful youkai,which makes the show really interesting as to how Natsume will deal with them every time.FInally,this season shows Natsume developing more friendships and making his bonds with his human friends even more powerful,gradually realizing that both youkai and humans matter to him a lot.\r\nArt : 9\r\nWhile the show'sart style is a frequently-used one nowadays,it feels really peculiar in a good way,probably because of the beautiful scenery of the show.\\n\r\nSound : 9\\n\r\nThe music of the show fits perfectly the mood of it,although it kinda feels nostalgic,something that I hope will change in season 4.\\n\r\nCharacter : 10\\n\r\nAll characters in the anime,including the minor ones,are explored in full detail throughout the season (as well as the previous seasons) which makes them feel very real and fresh.A notable characteristic is the diversity of backgrounds that the characters have,which works as an advantage for the show,in that everyone can relate to at least one of the characters.\\n\r\nEnjoyment : 10\\n\r\nI OFTEN pause my player when watching an anime.In the case of Natsume Yuujinchou however,I don't even notice how 22 minutes go by every time.That is a great plus,since the show is neither boring nor tiresome.\\n\r\nOverall : 10\\n\r\nI am really looking forward to season 4 and hope that you will enjoy the 3rd season as much as I did!",
            "date": "2011-09-26T16:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 44229,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/192064.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Akuma-Shitsuji",
                "username": "Akuma-Shitsuji"
            },
            "url": "https://myanimelist.net/reviews.php?id=44229"
        },
        {
            "content": "If you were to summarize Natsume Yuujinchou San in one word it would be boring. After the first couple of episodes you have basically watched them all as Natsume Yuujinchou San is repetitiveness in its purest form. \r\nThe story and characters themselves lack any kind of depth. When watching the show I wondered what this show actually had going for it. Action scenes with the youkai? No, even the worst action type anime can match it. Pathos heavy storytelling? No, none of the stories were emotional enough to actually make any impact. I can't think of a single redeeming factor for this show, it justscreams mediocrity. \\n\\n\r\nBut I could ignore every single flaw with this series if it hadn't been for the protagonist being such a blockhead. \\n\\n\r\nIf you are unsure whether you'll like this snoozefest you can watch a 2-4 episodes and you've basically watched them all. If you're uninterested you saved yourself time to watch other shows.",
            "date": "2019-04-16T19:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 306487,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7588545.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Omnimaniac",
                "username": "Omnimaniac"
            },
            "url": "https://myanimelist.net/reviews.php?id=306487"
        },
        {
            "content": "This season finally gave me what I was looking for from this anime, and I'm so happy it did because it was amazing.\r\nSo, my absolute favorite thing about this season was, finally, Natsume's character development. It was wonderfully done as it took elements from the stories we were seeing from the youkai and also elements we'd already heard but not had elaboration on. Essentially, Natsume was able to tell the story of his past through his present, and that made it really entertaining to watch.\r\nAnother thing I loved about this season is that the youkai got a lot more grit. The anime still kept itsgentle charm, but the youkai still were scarier and more intense than in previous seasons. It's down to personal taste, ultimately, but I really liked that aspect of this season. \\n\\n\r\nI haven't really talked about the art before, but this season really solidified the reasons I love the style, regardless of how simple it is. The movements of the characters are so smooth and nice to see, especially when it's something small like them turning their heads or their facial expressions. It's a bit weird to talk about, but it makes the characters come to life in a way other anime characters don't.\\n\\n\r\nOverall, this anime just keeps getting better and better. It's got one of the best anime soundtracks I've ever heard, the main character is starting to be fleshed out with conflicts and struggles, and the story feels more like it's heading toward a slightly bigger and more permanent picture rather than the week-to-week youkai stuff. I'm loving it, and I can't wait to keep going. This season was the best yet!",
            "date": "2019-02-27T21:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 302593,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302593"
        },
        {
            "content": "After waiting two seemingly very long years, a sequel is finally here. Oh! I genuinely miss this series. Though, at the beginning they will explain it a little bit but still you wouldn’t understand it much less appreciates how great this series is if you haven’t seen the previous seasons.\r\nThe different stories are polish even more. I could say that it lived up to the greatness of the stories from the previous seasons. It is more dramatic, heart-warming, and touching especially when Natsume’s past is revealed. Things get a lot more exciting and interesting when Natsume has to deal with bothersome and extremely irritating exorcists.Very few can really balance a serious drama, heart-warming, and touching yet so funny series which I strongly believe why this series is so famous even with a not so spectacular plot it has like those famous shounen series of today. \\n\\n\r\nIs it me? Or Nyanko-seinsei seems a little bigger and fatter now? And for some reason, he’s a lot cuter and fluffier. His a lot more hilarious as well. This time, not only the supernatural creatures but some recurring characters are explored more so we get to see more of their stories. I love that this time not only the supernatural creatures are the focus of the story but some of the characters as well. It really balances Natsume’s relationship with both worlds. I just love his families and friends who really accept him despite knowing that he still keeps everything to himself. It is very dramatic yet so touching. Some of Natsume’s past is revealed and we can see how sad and unfortunate his past is. It is really great that now he has some really important friends and family who accepts him, both human and supernatural creatures. Finally, Natsume is gradually letting others know about the youkais and ayakashis. He no longer shoulders everything to himself because he already has people who accept and love him for who he is. You can really see how his character gets better. His more open to others, talkative, optimistic, and more importantly happier. And because of that, his a lot closer both to humans and the supernatural creatures. \\n\\n\r\nBut of course, after quite sometime after the last season, the animation is even better now. I love that they maintain the style of the ending animation like the previous seasons. And as always, this series has one of the best sounds amongst today’s animes.\\n\\n\r\nI strongly believe that this time, this series is way even better. Every element of it is polish even more; from the genres it has, the stories, characters, styles, and even the sounds. It genuinely surpasses the greatness of the previous ones. I could definitely say that it is so worth the wait. Though I am so grateful that they are making so many seasons for this series, I would have really love it more if they make more episodes for every season. I am going to wait for the sequel even if it will take so many years!\\n",
            "date": "2012-12-09T08:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 79680,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79680"
        },
        {
            "content": "Natsume yuujinchou san, the third installment of the beloved series, brings the same lightheartedness and melancholy known throughout the series. \r\nLike it's previous seasons, it is largely episodic minus a few two part episodes. The plot of this season also differs in area. Whereas the first season focused on Natsume coming to terms with youkai, the second season with him becoming rather fond of youkai, to now, the third installment, with him having to choose between youkai and humans: Who does he care about more?\r\nThe season offers more insight into his grandmother, and continues the exploration of youkai, each one a marvelous story, every oneonly giving Nastume more development and growth as a person, and therefore to us, a character. \\n\\n\r\nThe Art and sound are still the same, as to say wonderful. The art is well drawn, and though not particularity amazing, it is, as always, memorable, especially when you consider the character designs, specifically the youkai. Natsume himself, though a memorable drawn character, looks fairly similar to many other anime characters, like the twins from Kimi to Boku. The youkai however, are for the most part memorable, though season 3 suffers from an entire memorable cast that made season 1 especially brilliant. \\n\\n\r\nThe animation is the same: Fluid and never dull, and though the season lacks a real sort of action, you can appreciate the animation when it does. Certainly nothing to be fanatic about, but not something to laugh at either. \\n\\n\r\nThe sound, as stated above, is continually amazing and heart warming. Many pieces throughout instill an emotion in your heart, and each one pieces together nicely with the particular event happening in the episode. Imagine a horror movie with suspenseful music. That's how you know it's suspenseful.\\n\\n\r\nAgain, characters here in the 3rd series are largely likable, and Natsume nor Madara never suffers. They even add some new ones, such as a particular villain who, like true nastume yuujinchou tradition, is never really violent violent. The show, after all, is more peaceful than anything.  However unlike previous seasons, youkai introduced are either boring, unimportant or memorable, and I would say in my opinion, out of the 13 episodes, I can only bring up 5. The show also focuses less on Natsume's frieds, who you actually like because of their banter, comic relief, heart warming attitudes towards natsume & the friendship they provide to an otherwise lonely teen. Lonliness is less of a focus now, especially as the season develops. He becomes more caring towards his foster family and sees them now as cherished people, who he can accept as father and mother. \\n\\n\r\nOverall, if you enjoyed the first two seasons, you will enjoy this one, but do understand that in no way shape or form will this be like the first season. Imagine a team that at the start won a championship, but the next 3 years they went from losing in the finals, to losing in the 3rd round, to losing in the second round, but every time, they made it to the finals. \\n\\n\r\nNatsume yuujinchou san is still a good team, they just aren't great anymore.",
            "date": "2015-10-02T14:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 200359,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=200359"
        },
        {
            "content": "-Kon’nichiwa Mina-san!! Have you already watched Natsume Yuujicnhou by Yuki Midorikawa-sama? This anime will give you a refreshing feeling that is rare to find, some says that you can compare it to Mushishi. Well talking about that is another story.Talking about our main review Natsume Yuujinchou is about the boy named natsume Takashi an adopted child of the childless but kind couple Touku and Shirugen Furijawa and also about the sadness and the longing for someone to understand him despite of his ability to see and communicate with the Ayakashi or Yokai as they said. And as the days go by he started to learnthe what-about of the Ayakashi with the help of Madara also known as Nyanko-sensei.\\n\r\nIt also has a prequel in titled “Zoku Natsume Yuujinchou”. In this season his journey to give back the names of every Ayakashi within the Yuujinchou also known as the “The Book of Friends” that he inherited to his grandmother Reiko Natsume, a strong and naughty girl in her days continues as he, little by little understand the differences and the sameness of the Ayakashi and the human. At the last episode of ZNY Natsume Stated that;\\n\r\n“It doesn’t matter whether they’re human or Ayakahi.”\\n\r\n“What’s Important is they’re precious to you.”\\n\r\n“You should accept them as they are and the feelings and joy that come with it, without hesitation.”\\n\r\nIt shows that natsume had used to live and understand to live both with human and Ayakashi. He discovered that both have sames somehow in someways.\\n\r\nWill there be a third Season?? Oh I’m really happy to say YES!! It will begin airing on July 4, 2011!!! In Titled Natsume Yuujinchou-San. Want a Shoujo in its genre? You’re wish has granted!!\\n\\n\r\nthis review can be seen in my wordpress\\n\r\nhttp://irock7444.wordpress.com/",
            "date": "2012-04-06T12:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 58063,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1235191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/soul7444",
                "username": "soul7444"
            },
            "url": "https://myanimelist.net/reviews.php?id=58063"
        }
    ]
]