[
    [
        {
            "content": "The second season of Kekkai Sensen is more of the same show from 2015. If you liked the first season, you will probably like this one as well. If you did not like the first season, chances are high your opinion will not change. Style over substance - the anime.\r\nSTORY: Bizarre, aimless and minimalistic.\r\nKekkai Sensen & Beyond is a simple case of the week show. There is no overarching plotline, 1.5 episodes of overall story progression is a major letdown. Each episode is concatenation of bizarre events mixed with introduction of Libra members, who did not get attention in the first season. Those small andisolated stories are random to a degree, that you could think anything can happen in this city.  In the process the show cannot establish its internal rules or boundaries for the world it is presenting and seems aimless. I mean if there are Vampires and Demons, why not highly advanced space bacteria? \\n\r\nThere are numerous attempts to do humor, however most jokes, especially the physical ones, don't land; the whole ep 10 is one ongoing joke, which overstayed its welcome. The show tries to do meta humor with a lot of references of other shows: Inception ep 4, HxH ep 6 and more, however subpar writing transforms it in cheap rip-offs.\\n\\n\r\nCHARACTERS: Wide as a sea, shallow as a puddle. \\n\r\nKekkai Sensen & Beyond will often dedicate one whole episode to a character, and yet it somehow manages to tell almost nothing about the person in spotlight. Those episodes focus too much on the case and not the character, so that only one or two attributes can be added to a character description, leaving them paper thin. Afterwards their screen time will be reduced to nothing per episode. \\n\r\nThere are not many occasions when the whole (or some) cast is in one room and bounces of each other in a snappy dialogue, a setting I would like to see because it actually advances characters and shows relationships. Zapp and Chain got their moments, sadly those are rare and far between. \\n\r\nI don’t remember Leo being this annoying in the first season. He is still a damsel in distress, but now he is mostly targeted by random thugs for his pocket money and not some higher beings for his God’s eyes. \\n\r\nBut Sonic is still the best and steals the spotlight in every frame.  \\n\\n\r\nART & ANIMATION: All that glitter is not gold.\\n\r\nBackgrounds are detailed and character models are appealing, although the later ones will be off model from time to time. \\n\r\nThe animation of action scenes is somewhat sparse. Those will often consist of stylish freeze frames, most notably in ep 2 or 6. However, from time to time the viewer is spoiled with beautiful sakuga, like in ep 5. All in all, Kekkai Sensen & Beyond draws attention with its high production values, but cannot deliver consistently high quality visuals. \\n\\n\r\nMUSIC: Some big shoes to fill.\\n\r\nThe first season had very memorably music, especially the end theme, so that reaching the same quality was a very difficult task. Background music and original voice acting are still amazing.\\n",
            "date": "2017-12-24T14:20:00+00:00",
            "helpful_count": 105,
            "mal_id": 266274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5539735.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/NoizyFrog",
                "username": "NoizyFrog"
            },
            "url": "https://myanimelist.net/reviews.php?id=266274"
        },
        {
            "content": "Watching some over the top action anime these days can really fill anyone with a dose of popcorn entertainment. There’s popular Marvel based movies coming out each year, book adaptations that turned into cultural influence, and iconic Hollywood stars that made history in the film industry. Then, there was Kekkai Sensen. Remember Spring 2015? Among the many action based shows, Kekkai Sensen stood out as a show that stylized action and violence to present a storyteller of supernatural gimmicks. Well guess what? Bones is back at it again and made sure that Kekkai Sensen is here to talk about for 2017.\r\nI’m not going to lie.Kekkai Sensen’s return didn’t come as a total surprise given the popularity of the manga in Japan. What started out as a one-shot by Yasuhiro Nighthow became a serialized manga and eventually turned into this animated action flick. Known for his work Trigun and Gungrave, Kekkai Sensen had to make a name for itself. It did just that through the incredibly addicting storytelling and characters. To make things even better, the franchise adapted Nighthow’s style of humor, the type that can hook anyone in with just how over the top it can be.\\n\\n\r\nTitled as “Kekkai Sensen & Beyond”, the sequel starts off in the aftermath of the first season. Some time has passed and once again, we are introduced to the city of Hellsalem’s Lot. From the first few episodes, we see that Leo’s life is still as hectic as you can imagine. It doesn’t long at all for the sequel to get you into the mood again as the pilot episode reintroduces the humor of the franchise. Episode 2 also gives an insight on the backstory of Hellsalem’s Lot that is more than just an exposition. It’s told through meaningful dialogues and gives the viewers a better understanding of its world setting. Indeed, Kekkai Sensen’s world fiction is colorful and has always bought a fascination to me. \\n\\n\r\nNow, here’s the curious part about Kekkai Sensen. Who is your favorite character? Maybe you like the typical main protagonist, Leo. Perhaps someone as crazy as Zapp is on your list to look out for. Or maybe, someone that was overlooked from season 1 like K.K or Gilbert? Thankfully, Kekkai Sensen & Beyond gets to work at bringing those characters to attention. The first season heavily focused on the core members of Libra. However, this sequel brings to light with storytelling about the other characters too. Some of the noticeable examples are Chain, Gilbert, K.K., and even Zed. It’s interesting to see what these characters do during their free time and honestly, it bought more interest to them. For instance, did you know that Chain and her fellow comrades (a member of the Invisible Werewolf) still had an old nemesis who wanted revenge? Ever curious about what K.K’s family life is like and relationship with her son? Or even, Zed. The man has been really an outcast but in this sequel, he gets a nice spotlight with is background storytelling. I can also confess that seeing Gilbert go beyond his duty as a combat butler was highly entertaining. It reminds me of the Gotham/Batman-style action that became iconic from American culture. \\n\\n\r\nThat being said, I can’t say the storytelling is always great at selling its plot. Some of the later episodes can be a bit tedious and even boring to watch. Two episodes in particular (as a 2-episode arc) in the latter half of the show gave me a weak impression. It focused on one of Leo’s friends (Riel) that I just couldn’t bring myself to enjoy watching. Not mention, Riel’s personality isn’t interesting to watch either despite the friendship he shares with Leo. In addition, it also felt inevitable that the sequel would bring back important characters from the first season. Leo’s sister Michella is a prime example. There have been several flashbacks throughout the sequel that shows how important she is to his life. It’s hard for me to say this but while it’s important to get to her character’s story, it doesn’t feel that impactful. Sure it’s important to see her again but did we really need two episodes to focus on her? I’ve only read parts of the manga so this came to me as more of letdown than as a blessing. Still, the series does maintain a decent pace mostly thanks to the character cast, stylistic episode adventures, and excessive humor.\\n\\n\r\nBones is back at it again and Hellsalem’s Lot is looking better than ever. Just like season 1, this sequel makes attention to detail as one of its highlights. The complexity of the cities, advanced technology of abnormal sci-fi elements, and the even everyday objects makes its mark. It really excels at making its world feel alive. Character designs still gives a sense of style to themselves and we also get to see the hardcore action that bought so much entertainment like the first season. Fan service is mostly presented through the action sequences as the characters showcase their unique powers. The key selling point is how they influence outcomes and interacting with certain situations. I also can’t stress this enough but when it comes to action, Kekkai Sensen knows how to hit the bull’s eye to give the viewers what it wants.\\n\\n\r\nWhile I can’t say Kekkai Sensen & Beyond’s theme songs are as creative as the first season’s, it still gives a memorable impression to showcase the talent of the directors. What really drew my interest towards technical aspects of the show is the OST. The mixture of jazz, eerie, orchestral, and melancholic music really synchronizes well with each other. \\n\\n\r\nAfter watching this show, it’s easy to say that Kekkai Sensen still has what it takes to deliver entertainment. It had the capability of expanding its plot even with episodic adventures while giving side characters their own stories. However, I will say that the sequel isn’t as impactful compared to the first season. At some point, you may feel like the show tried to showcase everything and has nothing more to offer. I had that feeling at some point especially in the final few episodes. Still, give the sequel a try. It’s a series celebrating the work of Yasuhiro Nighthow that opens the doors to fun.\\n",
            "date": "2017-12-23T10:29:00+00:00",
            "helpful_count": 65,
            "mal_id": 266117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=266117"
        },
        {
            "content": "[Re-Submission]\r\nI'll try and explain why this isn't a good sequel, at all. [Spoiler Free]\r\nI'd just like to get it out of the way that I'm watching this hot off the heels of the first season, as I binged the first and second season in about a day. The details of which are still very fresh in my mind.\r\nThis is also the second season of Kekkai Sensen, so I'm assuming you're familiar with the story.\r\nWhy does Kekkai Sensen 2 fail as a sequel? To put it bluntly, it's because this season is much more episodic in nature. \r\nIn the first season, almost every episode leading upto the finale had something to do with or laid down the subtext for the overarching plot of the story, which culminated in a satisfying, if a bit hollow ending. It was still episodic, but was also eluding to the bigger picture.\\n\\n\r\nThe second season has failed to do this mostly and has felt flatter and less engaging because of it. \\n\\n\r\nThis is a spoiler free review, but the plot point that ended up being the finale was the exact one I thought it was in my preliminary review, and was only mentioned a grand total of about two minutes before the final two episodes.\\n\\n\r\nEvery other episode just feels like exposition and world building that are just loosely strung together without any grounding in a plot structure. \\n\\n\r\nThat's why I feel like this fails as a sequel, it feels like a bunch of OVA episodes mashed together.",
            "date": "2017-12-24T11:19:00+00:00",
            "helpful_count": 55,
            "mal_id": 266254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3299155.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vyxria",
                "username": "Vyxria"
            },
            "url": "https://myanimelist.net/reviews.php?id=266254"
        },
        {
            "content": "Story (2/10)\r\nExcept for the last two episodes, there is no plot in none of the 10 episodes. Some are just background of Libra members (4,6,7), others are nonsense ( 1,8,9) and some are rushed (2,3,10). The episodes 8 and 9 are the worst of the season. The episodic episodes feels like a bunch of OVA mixed together.\r\nArt (7/10)\r\nIn this aspect the show in much better than the other options. The fights have very good animation and the colour is beautiful.\r\nSound (6/10)\r\nBesides the opening and the ending, i don't remember much of the soundrack. \r\nCharacters (3/10)\r\nDespite the show have episodes dedicated to Libra members, after that,their presence feels nonexistent. Also they still are some Libra members that barely know anything. Leo is undeveloped until the last two episodes, he is just beaten all the time. Klaus feels more a background character in most episodes unlike the first season. Zapp have less screen. Steven in the only character in this season that was well treated. \\n\\n\r\nThe villains: all are generic, boring and are the same just with different designs. The Blood Breed of episode 10 and the villain of the last two episodes are the only with personality in the entire season. They are so bad written that i just remember the villains of the first season. Aligura and  Femt barely appears despite being in the opening. \\n\\n\\n\r\nEnjoyment (3/10)\\n\\n\r\nI don't like most of the episodes. Nearly all the episodes are just the same: some generic villain do something against a Libra member → characters try to finding them or do something to defeat them→ explosions everywhere and the generic villain is defeated. Even in the background episodes this happens.\\n\\n\r\nOverall \\n\\n\r\nI don't like this season. Despite the first season was average (5/10), this season feels more chaotic and a wasted of time in most of the 10 episodes. This season handled very bad the villains and forget Femt and Aligura. Only for the animation and the last two episodes, my score for Kekkai Sensen & Beyond is 4/10.\\n\\n\\n\\n\\n\\n",
            "date": "2017-12-23T19:25:00+00:00",
            "helpful_count": 53,
            "mal_id": 266186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6468118.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nurguburu",
                "username": "Nurguburu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266186"
        },
        {
            "content": "I was honestly, truly looking forward to the new kekkai sensen season. My friend and I absolutely adored the first season. It had the right amount of craziness and enough plot to keep us going. Because of how great the first season was, we both went into this with high expectations. But this season... has been a train wreck.\r\nWith only 3 episodes left, I have very little hope that there's going to be a truly satisfying ending. Seeing the preview for the next episode even further solidifies my feeling.\r\nThe format has been that of an episodic anime, where something that happens in one episode doesn'treally correlate with another. Nothing connects. There's very little actual story going on. We're getting GREAT episodes that focus on one character at a time where we learn about a specific character, but that's all Beyond has going for it. \\n\\n\r\nThere's nothing building up. No story other than \"yeah crazy shit is happening again\". We're being introduced to new characters that I can't feel anything for because, again, we only focus on them for like one episode and that's it.\\n\\n\r\nFor the most part, Kekkai Sensen and Beyond is nice if you're wanting a snapshot of one of the main cast's day in everyday life. But you're also missing very little if you choose to skip around.",
            "date": "2017-12-03T12:14:00+00:00",
            "helpful_count": 42,
            "mal_id": 264448,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717363.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/chekkit",
                "username": "chekkit"
            },
            "url": "https://myanimelist.net/reviews.php?id=264448"
        },
        {
            "content": "The first season of this show is one of my favorites of all time. The wild and crazy antics that Leo goes through on top of a deeply connected story was amazing so I had high hopes coming into this. The story is basically about the aftermath of a fallout which connected new york to another world to state it quickly. This season lacks the continuity that the first season had. It is more like a series of OVAs so far. The show also feels toned down compared to the first season the antics aren't as frequent or heavy but they are still there andjust as enjoyable. \\n\\n\r\nThe art is also really good. It is one of the staples of this show for me since anything can happen at any time. The show doesn't limit itself so, the art supports it very well because it has to. The characters designs and when people use their powers are enough to get you to watch the show on their own if you didn't much for anything else.\\n\\n\r\nThe first season's music was amazing all the way through. I spam the soundtrack in the car all the time and this season doesn't fall far behind in quality but it isn't as good and that's not saying a lot. Every song you hear makes you happy and fits the scenes well.\\n\\n\r\nThis season focuses less on Leo and more on the side characters so far giving everyone their own episodes and I love it. Chain is laid back and good for parties despite are ultimate badassness, Zapp is as stupid as always and etc. you can't help but love everyone and it's nice getting to know them more as the main plot of this story ended last season and this whole show could have stopped there and left you satisfied. It makes you wonder if we do get to an actual story or stick to this OVA like format.\\n\\n\r\nI enjoy the crap out of this show and am never disappointed as we move on.   Overall I give it a 8 because as much as love this I admit it's not perfect. It might make bring more score up if we get that serious side back but for now... You should watch this if you loved the first season you will enjoy this too but don't start here you won't get into it.",
            "date": "2017-10-29T12:49:00+00:00",
            "helpful_count": 37,
            "mal_id": 262042,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049264.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlueEclispe",
                "username": "BlueEclispe"
            },
            "url": "https://myanimelist.net/reviews.php?id=262042"
        },
        {
            "content": "Kekkai Sensen is... a fairly unique show by today's standards. It fills a niche category that doesn't pop up every season, and is even more rarely well done: that of the episodic action series. Instead of a linear plotline, Kekkai Sensen instead focuses on worldbuilding through mostly one-off episodes, shifting its focal point to different characters around the protagonist in order to further pull you, the viewer, into their world. While this style alienates some viewers of the show, for me it reminds me of the first season of Darker than Black, a series I greatly enjoyed (we don't talk about the second season). Whilethese shows both had overarching plot points, the majority of both shows are spent covering fun, self contained stories that pop up each episode. Both of these shows greatest strengths were their world concepts, and this episodic structure is part of what invests the viewer into these inventive settings.\\n\\n\r\nAnd what a world Kekkai Sensen gives us - Hellsalem's Lot; a crossdimensional apocalyptic version of New York City. This strange dystopia, along with the eccentric but lively main cast, provide an exceptional vehicle for a show of this kind. The city is painstakingly animated, with bustling streets providing a true of sense of reality to a show drunk on fantasy. The main cast, while relatively shallow so far save for the main character, are nonetheless enjoyable, quirky, and distinctive, further flavoring an unconventional setting with suitably strange individuals. \\n\\n\r\nThis show is a joyride. It rolls out a wacky combination of action, political intrigue, and humor. The rule of cool is constantly in effect, and with BONES animating it, you can bet your bottom dollar that it looks fantastic. While this show is far from perfect, its flaws are more than overshadowed by its strengths. This show's top priority is fun, and for me it has captured that in every episode so far. My favorite episode so far was about a mushroom person with a burger addiction, and if that's not fun and wacky, I don't know what is.\\n\\n\r\nThis show is well done, but based on its unique formatting is certainly not everyone's cup of tea. If your favorite episode of Cowboy Bebop was Toys in the Attic, you'll most likely enjoy this show. If you're looking for something more plot driven rather than character/world driven, you'll most likely find this show frustrating. Personally? I'm having a blast.",
            "date": "2017-10-30T13:43:00+00:00",
            "helpful_count": 32,
            "mal_id": 262121,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5430414.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/joschmo11",
                "username": "joschmo11"
            },
            "url": "https://myanimelist.net/reviews.php?id=262121"
        },
        {
            "content": "Its not Kekkai Sensen Season 2. It is Kekkai Sensen and Beyond!...\r\nThe first season of Kekkai Sensen was aired last Spring 2015 and gave us a good plotline of the characters of Libra. With the story on point in season 1 up to the end, it was a good anime on my perspective. Then here comes Kekkai Sensen and Beyond. The season 2 of the hit anime and I, to be honest cannot really decide which is better. Thus, I compared both of them for this review and come up that it is without a doubt there is a great difference. \r\nStory:\r\nBeyond starts of withLeonardo reflecting the past event that happened to obtain his \"All Seeing Eyes Of God\" power. In season 1 we are hinted about his sister's involvement on the eyes of Leonardo although we were never showed the history, riddle or anything about it (except its abilities prior to combat). This anime this season gave us a clue or a hint already in the very start that Beyond's objective will be focusing on uncovering some details about the mystery eyes of Leonardo. Though I was surprised that it didnt get along with the storyline of the first Kekkai Sensen. Instead of rushing to the objective (which is uncovering any details about the eyes), it offered us backgrounds on each and every member of Libra. To be fair, I really don't like this type of things in anime like reflecting or having side story and all but it turns out that Beyond gave me or gave you a good impression to every single character. Enjoying there fun moments and feeling their struggles when they have problems. For example, I was amazed by how awesome Gilbert Altstein was in the episode he was feature. He looks like Alfred from Batman on that time. In season 1 it looks to me that he is just a trustworthy butler but I was surprised by it. Also, the story behind Obrien Zed, is also a quite emotional and informative on how he interacts with others. Even though these are all good stories in an episode or two, I have one question. Why not just turn this stories of every Libra members as specials or OVA's?\\n\r\nHere's the point. The storyline is quite confusing in Beyond. At first we were given a certain clue about the storyline. Hinting us that this will be Leonardo's spotlight again but different as he will be encountering a secret about his eyes, or his sister. But that idea got temporarily dispose and replaced by stories of each characters. I am not against it that much because I, to be honest enjoyed there own episodes, but along that characters should try to solve the main conflict little by little, though this was never seen until episode 11 - 12 (which is a fight about those eyes). Although despite of all this, the action of the story is still mindblowing and fun to watch as it gets intense on every episode.\\n\\n\r\nCharacters:\\n\r\nThe characters are the same and still being one of the best groups in anime. I still love it when especially when they say their moves like \"Lance Of Absolute Zero\" by Steven. The whackiness of Leonardo and Zapp are still onpoint that makes Beyond have a bit of comedy tint on it.\\n\\n\r\nArt:\\n\r\nThe art never changed, thus it is a good thing as the art on season 1 of Kekkai Sensen is already perfect for the story. The visuals of when they say their moves (the japanese letters striking to your screen) never gets old and the effects of the action parts.\\n\\n\r\nSound:\\n\r\nSeason 1 opening and ending is indeed better than this one though the jazz soundtrack of season 1 is reflected to season 2 which gives us a nostalgic atmosphere. The jazz fits the aerosphere of mood on situations. Though I said that opening and ending of season 1 was better, I still can't stand that the new openings and endings are quite plausible as they are unique as well. \\n\\n\r\nOverall thoughts and Enjoyment\\n\r\nKekkai Sensen and Beyond brought me back to when I watched the season 1. How I judge it if it was better than it is quite difficult because the enjoyment level is quite indeed very good for me but the storyline and outlining the conflicts is always important on storytelling. And that whats lacking Beyond. It maybe enjoyable although a story... is a story. Overall, I enjoyed Beyond but not as I enjoyed season 1 of Kekkai Sensen. Even though its like this, I still highly recommend you to watch it. If you still didnt watch Season 1 then go ahead and then watch Season 2.",
            "date": "2017-12-23T13:22:00+00:00",
            "helpful_count": 27,
            "mal_id": 266140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=266140"
        },
        {
            "content": "Kekkai Sensen & Beyond or Blood Blockade Battlefront & Beyond or BBB & B is back! (That's alot of B's)\r\nThe very first thing LA would mention about this second season is the absences of Rie Matsumoto, the director of the first season who brought that zany flair she added to Kekkai Sensen that will be sorely missed in this season but nonetheless, this season helmed by Shigehito Takayanagi (Director of Dagashi Kashi and both season of The World God Only Knows) tries to emulate Rie's vision in his own way as well as pay respects to Rie all into this second season with great results.\r\nForone, Kekkai Sensen's episodic nature is back and takes a more character focused narrative this season by bringing us perspective from the various main characters of Libra and giving us their daily lives of them.\\n\\n\r\nThe funniest thing is, many of the episodes even pays homage to media references (which is probably Yasuhiro Nightow's influence, the author of Kekkai Sensen), from paying homage to Batman, Akira and Godzilla among others.\\n\\n\r\nCharacter-wise the development of the minor cast of Libra was a good step, from Gilbert F. Altstein, Chain Sumeragi, K.K, Zed and Steven A. Starphase. LA's favourite would be a tie between K.K and Chain's episodes and involvement in several of the off-handed non main character focused episodes. LA felt that Klaus didn't get as much as the rest of the cast though he was linked to a Demon Hospital episode that had at least showed his resolve before Hellsalem's Lots actually became a thing. Now Leo's actual character focused episode doesn't show up until the final 2 episodes of Beyond and it involving Michella, you know it was gonna get serious. Before all that it hinted us the audience that Leo wanted to get rid of the curse of his All Seeing Eyes and culminated into the final episodes into something as bombastically intense as it did, with a villain Leo faces who surpasses him in terms of supernatural power.\\n\\n\r\nAnimation and voice acting wise, it has all the feel of the first season, with the crisp and zany battles that Libra goes through and all the alien nature of the anime taken as normalcy. The animation done by Bones is once again great and consistent all throughout from both the first season and this one. Voice acting wise, LA thought Yuu Kobayashi and Ai Orikasa got to use more of their acting chops during this season and it paid off. Daisuke Sakaguchi who voiced Leo is his normal yet zany self and his over-exacerbated reactions are great as always. What's great for the voice cast for LA would be Nana Mizuki as Michella and in voicing Leo's kind hearted sister (LA says this as Nana usually voices the badass character) but LA has this thing with Nana Mizuki where LA can't displace Nana Mizuki from Tsubasa from Symphogear, but nonetheless with all this rambling, the voice cast is expected greatness.\\n\\n\r\nSo if you thinking with the change of directors and change of plot focus would deter you from liking this season of Kekkai Sensen, LA would say you can rest easy as it still has the same vibe to the original and given the character development to Libra actually working it's own advantage, the same animation studio pegging this season and the voice cast being as amazing as always, Beyond quite honestly eviscerated any notion that this season would go down on the wayside with what passion, homages and emulate the first season to this season own unique greatness!",
            "date": "2017-12-23T15:39:00+00:00",
            "helpful_count": 18,
            "mal_id": 266158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=266158"
        },
        {
            "content": "Okay incoming 1 episode reviewer here, don't take me too seriously:\r\nHA this is shit BUT IT'S GREAT. This is approved by someone with S1 in his top 5 favorites. I'll be honest: This season is 100% imitations of Rie Matsumoto's OG style for season 1and no lie; it's only 1 ep in so I may be completely wrong but this style is everything I wanted in a second season against all my expectations WOOP...\r\nOkay well MAL requires me to submit a longer review so I will, just give some of my general thoughts to please the overlords. But here's my general idea after watching justa bit of it (remember one episode is all I got!):\\n\\n\r\nThe art this everything from S1, as well as the music; the music is from the same composer at least so its fantastic. That's more a credit to Bones than the director they hired to take over for Rie (Dagashi Kashi director incoming, brace yourselves) but somehow, SOMEHOW... Shigehito Takayanagi has captured the original series' magic. It may be he's simply riding on studio Bones' incredible style but it's working. \\n\\n\r\nBottom line: If you loved Kekkai Sensen S1 give this one a chance; it defied my expectations (which were quite low coming in). We'll see if this keeps up but so far I'm in for the long haul.\\n\\n\r\nI'll gladly update this review as more episodes come out (that's fun right?), and I do hope this keeps the wacky off-the-cuff-fun and quality it's shown so far.\\n",
            "date": "2017-10-29T21:06:00+00:00",
            "helpful_count": 18,
            "mal_id": 262074,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3306771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LordFabio",
                "username": "LordFabio"
            },
            "url": "https://myanimelist.net/reviews.php?id=262074"
        },
        {
            "content": "There's a lot of reviews on the frontpage that seem to point a pretty negative light on this second season of Kekkai Sensen, and while the points they bring up are valid, I feel like judging Kekkai Sensen based off a conventional anime framework doesn't really do it justice, especially considering how ambitious it is as a series.\r\nStory: This anime is episodic and unlike the first season which developed the plot throughout the season, the second season only contributes to the main plot in the last two episodes. This is perfectly fine as Kekkai Sensen at its absolute best is 1-2 episodes per arc. Thesimplicity of each arc and how it fleshes out each character can be described as efficient. The pacing never feels too slow, and even when its going too fast, it plays into the theme of a chaotic mood that is perfect for the setting of Hellsalem's Lot. While the stories aren't the best, they pave the way for something more important which is leaving the watcher at awe with the world and how the characters interact with it. Compared to the first season, I feel like the later episodes weren't bogged down to fit the whole black/white arc and that I preferred how each of the episodes had its own \"Hero's Journey\". To criticize Kekkai Sensen for this format seems absolutely ridiculous, as fast pace is important to the overall mood of kekkai sensen and plenty of successful anime have employed the same method with conflicts being introduced and resolved within the same episode. \\n\\n\r\nArt: The animation is like the first season. Stylistically, the style matches the fast paced anime style. The action scenes look fluid and there's no real ambiguity with what's happening. However, the animation doesn't stand out as much as the other strengths, and there are a lot of still frames that look horrendous with regards to proportions. \\n\\n\r\nSound: First season had one of the best soundtrack in modern anime, and the second season also delivers. The soundtrack fits the mood and the pure variety is enough to be impressed by what Kekkai Sensen brings to the table in terms of audio. My only complaint is that the soundtrack doesn't seem too big of an upgrade from the first season, and I really miss the old ED :(\\n\\n\r\nCharacter: Kekkai Sensen has static characters, but that doesn't mean these characters are bad by any means. Many of the episodes in Kekkai Sensen were meant to not develop already established characters like a lot of these reviewers claim, but rather to give insight to the nuances these characters display. Chain during season 1 was a straight laced no nonsense tough girl, but in season 2 she feels infinitely more human and personable. Steven was cool in season 1, but in season 2 he feels infinitely more dangerous and ominous. These are just a couple of examples, and while some of these characters still come off as flat, there are enough characters to like that aren't cookie cutter tropes. \\n\\n\r\nEnjoyment: Since this is the etc option of MAL, I'll just talk about the best quality of Kekkai Sensen which is the fact that the setting and world building are top notch. While Kekkai Sensen isn't special in terms of the metrics we measure regular anime, the amount of cohesion that fits into the universe makes this a real treat. The episodic format, multiple static format, high tempo music, and even the animation all play into a beautiful romp committed to crazy characters in a equally crazy world and their hi jinks. \\n\\n",
            "date": "2017-12-28T09:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 266643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kitsune_Goon",
                "username": "Kitsune_Goon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266643"
        },
        {
            "content": "Awesome sequel to season 1, I have to say I preferred this season a lot more to season 1. Like season 1, there was a great selection of BGM and OP/ED, which reflect the mood of the anime. The way in which the soundtrack was woven into the animation alone should be reason for watching this sequel\r\nSome of its downfalls are that the finale of the anime didn't have a lot of foreshadowing to it (technically hints were dropped since season 1, but this could have been with more emphasis). Would also have loved to learn more about the power he was given and whyhe was given it - questions that haven't quite been answered in either season.\\n\\n\r\nHowever, this is redeemed with the main character's growth. A lot of development can be seen in how the protagonist struggles to better himself. His actions slowly start to take influence from the people he admires. He has certainly become a comfortable Libra member, and has definitely become part of HL despite how \"normal\" he is. Furthermore, I enjoyed taking a look at each individual member's lives. The anime does not go into deep, soppy backstories, so these episodes gave us enough to build on the characters and yet leave us wanting more. Beautifully written, fantastic direction and animation; eagerly hoping there is a 3rd season.",
            "date": "2017-12-28T11:08:00+00:00",
            "helpful_count": 10,
            "mal_id": 266652,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5787421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fahiemoon",
                "username": "Fahiemoon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266652"
        },
        {
            "content": "To be fair, I am biased towards this anime.  I loved the first season of it, because it was so off-the-wall and against every standard, run-of-the-mill series you generally see out of the industry today.  No high schools, no love triangles, no moe, no cliffhangers, no training regimens, no by-the-numbers plot.  The anime is absolutely insane, disjointed, bizarre, and creative, while still being able to deliver a cohesive storytelling experience, which excellent characters, tons of over-the-top action, and a main character in Leo Watch, that while weak, isn't too weak to be annoying and will man up when need be.  Youcan get behind him as a vulnerable MC.   \\n\\n\r\nThis is one of my favorite series ever, so in that regard I go into Season 2 already deeply swayed in favor of the anime.   Season 2 didn't disappoint me, but I can definitely see where people might have complaints.  This season, it didn't really tell a overarching story like Season 1 did, which followed Leonardo Watch coming to Hellsalem's Lot in order to find a way to help himself and his sister.  This season was more of an ode to each individual supporting character, with the final episodes focusing on Leo and Michella.  As such, it may seem all over the place as it was very episodic, which you rarely see in anime today.  As someone who has seen so much anime that I get sick of the normal way animes present themselves, it was refreshing to me, but I can see where it may irritate others.   \\n\\n\r\nFor me, the Kekkai Sensen team was already one of my favorite teams out there, so delving into the back stories of some of them really helped to flush out the entire cast and make the team even more likable for me.  They particularly did a good job with KK and Chain Sumeragi.  I went from not really caring much about KK, to really enjoying her.  I believe that this was the main purpose of the creators of the anime, to get fans more acquainted with each supporting character, so they will be more invested in them going forward in Season 3.   For me, it definitely worked, but again, it may irritate some.   \\n\\n\r\nAs with the first season, the soundtrack was outstanding.  Because Kekkai Sensen is so focused on not being like other animes, the soundtrack is also much different.  They blend in a lot of Chillhop, alternative rock, jazz, and top it off with a killer intro called \"Fake Town\".  I kept playing the intro over and over just to hear Fake Town.  It's so good.  This is one of those animes where I look up the OST so I can get some of the sounds I hear on it, similar to Samurai Champloo.  \\n\\n\r\nMy one complaint about the creative process is that I never really have cared much for the artwork of Kekkai Sensen.  It's not bad, but it's not particularly great, either.  At times it can look a little cheap when it comes to the character designs of the inhabitants of Hellsalem's Lot, but I am sure that's also by design, as well.  It's just not my particular cup of tea.          \\n\\n\r\nAt the end of the day, if you're a huge fan of Kekkai Sensen like I am, you're going to love this anime, especially if you were like me and wanted to see more of the cast get screen time in the first season.  If you were on the fence in the first season, you may not care for this one or its episodic, disjointed nature.   I loved it, though.  \\n\\n\r\nStory: 10\\n\r\nArt: 6\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 10\\n\r\nOverall: 9",
            "date": "2017-12-23T15:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 266152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266152"
        },
        {
            "content": "Kekkai Sensen & beyond was an enjoyable second season. Given so, I'd like to elaborate on where I felt it did well, and what held it back.\r\nIn terms of the shows entertainment value I found this installment to be quite enjoyable. The action scenes were intense and well animated, the humor was not overdone nor out of place, and subtlety placed throughout the show. \r\nThis season gave us a small look into the backstories of many side characters who lacked depth from the first season and this, i believe, was a good touch.\r\nArt and sound were solid but not exceptional, but i certainly liked theopenning and many charecter models for the Hellsalems lot inhabitants. \\n\\n\r\nThe main complaint I have for the show is its episodic nature. While I dont mind episodic shows, Kekkai Sensen's original series felt like it had a storyline progressing throughout, which this season lacked. While we learned more and more about charecters, Michella, and the events of the city, I would have liked a larger picture plot line or some additional convergences between stories. In my personal opinion, a show with such entertaining episodes was fine, but after each episode I merely would discard my conviction or emotional connection knowing most of the remaining show given some small arcs would start fresh.\\n\\n\r\nOverall, I award the show a 7. I found it enjoyable with clever characters, some fine humor, and decent action scenes, but felt the lack of emotional connection to the events and characters held me from loving the show more. In a way this show reminded me of Bungo stray dogs, which also has a fun cast, and semi episodic nature of crime solving, but this show thrived in a more comidic sense plot wise unlike the darker counterpart. In all, for a fun show with a few laughs and some well animated action, I'd say give it a try!",
            "date": "2017-12-23T12:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 266126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4405431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shaboigon",
                "username": "Shaboigon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266126"
        },
        {
            "content": "ok, i dont usually write reviews but i have to do it this time because this show is getting a lot of negativity by people\r\nkekkai sensen season 1 had a \"plot\" and that plot was anime original, as a result of that...the anime couldn't focus on characters that much\r\nseason 2 does just that, it gives insight about characters and does some world-building \r\nthis is one of the best sequels i have ever seen\r\nart: good job studio bones...action scenes are really good!\r\nmusic: really great, fits the theme of the anime, we also got some soundtracks like tortoise knight which are different from others \r\noverall...i really enjoyedmyself",
            "date": "2017-12-28T01:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 266609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5551082.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/necro_dancer",
                "username": "necro_dancer"
            },
            "url": "https://myanimelist.net/reviews.php?id=266609"
        },
        {
            "content": "Season 2 is over. I had ups and downs with this season, but the ending shows it again: I just love Kekkai Sensen. The comedy, the action... just a very cool combination! This Season focused on Backgroundstorys and other Characters. Yes, it was a little annoying to see little stories and not a big one. BUT all these parts made a really overall season.\r\nThe ending was very good, because Leo don´t have these depressions about his sister anymore.\r\nI highly recommend it, but i think that season 1 was a little bit better. it isnt 10/10, not 9... but a very good 8 and I WANTA THIRD SEASON :D",
            "date": "2017-12-23T15:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 266159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5590060.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TylerPilz",
                "username": "TylerPilz"
            },
            "url": "https://myanimelist.net/reviews.php?id=266159"
        },
        {
            "content": "Hellsalem's Lot - the city where the human world and the alterworld intersects. Commotions are never bizarre in the city's everyday life as a plethora of different creatures crawl upon it. As two \"distinct\" worlds collide, a secret organization, Libra, maintains the balance of these two realms. After White sacrificed herself to protect the barriers of Hellsalem's Lot, what destiny lies upon the men behind Libra?\r\nKekkai Sensen & Beyond starts after the events of the Spring 2015 anime Kekkai Sensen, with Leonardo Watch continuing his daily life in Hellsalem's Lot to support his younger sister Michella. Traversing every weirdness this city has to offer, hesoon unearths about a very important possession he has. Surely, two years and two seasons is an enough break for BONES. Also considering other projects the studio has (e.g. Boku no Hero Academia 2nd Season), BONES is ready to offer the continuity the tales of Hellsalem's Lot.\\n\\n\r\nStory (9/10):\\n\r\nThe story is a plain narrative of Leonardo's life with Libra and their action-packed missions. There's nothing new in the series, putting its genre in consideration, but it didn't fail in giving life by inserting some comedy sketches, especially with Zapp. Some parts of the first half lack substance and clear motivation to keep the viewer watching. (Yup - I fell asleep in those parts). But the second half regained my interest in the series with some cheeses BONES has been hiding.\\n\\n\r\nArt (9/10):\\n\r\nAs expected, BONES never fails to reconstruct New York City into an urban realm full of supernatural identities. The character designs have been improved as well as the setting.\\n\\n\r\nSound (10/10):\\n\r\nThe insert songs were so great. They encompassed the whole mood of the situation, especially the awesome parts where the Libra pose but inserted a slow and dramatic song, which contrasts initially but with depth, the scenes were just soothing and awesome. The score is good with the fight scenes. Unison Square Garden once again turn the hypes up with the OP theme, as well as the disco and dance ED theme.\\n\\n\r\nCharacter (10/10):\\n\r\nCharacters have been greatly improved since the first season. Aside from the design, the backstory and depth of each are unquestionable. \\n\\n\r\nEnjoyment (9/10):\\n\r\nI enjoyed.\\n\\n\r\nOverall (9/10):\\n\r\nBONES deserves an applause with this series. I would not call it a masterpiece, but it deserves to be appreciated by the many. What a great way to fill the gaps before ending the year. And expecting more in the next season, if there is.",
            "date": "2017-12-28T02:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 266613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6024561.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aikii-kun",
                "username": "Aikii-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=266613"
        },
        {
            "content": "I love this show.\r\nStory: 6/10\r\nWeakest Aspect since there is no overarching story but instead a bunch of mini-stories which while extremely good left me unsatisfied and hoping for a season 3. Thus given a serviceable rating.\r\nArt: 8/10 It's bones. The characters are elastic, expressive and the animation is always on point. However nothing overwhelmingly standout.\r\nSound: 8/10 Brilliant OP and ED. Good soundtrack, well used. The soundtrack for the battle in the last episode was particularly standout.\r\nCharacter: 9/10 Everyone in this series is a treasure. If there had been a tad more character growth and character arcs this would be a 10.\r\nEnjoyment: 9/10 God this seriesis just so much fun!\\n\\n\r\nOverall: 8/10\\n\\n\r\nIf this series continues and reaches a proper conclusion and white comes back in some capacity. This series will become a 10/10 in season 3, I have no doubt. Hopefully that comes to pass.",
            "date": "2018-01-11T08:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 268196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6099977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheonlyRoggol",
                "username": "TheonlyRoggol"
            },
            "url": "https://myanimelist.net/reviews.php?id=268196"
        },
        {
            "content": "I Prefer to call this season to be a long OVA between season 1 and season 2 (if ever comes).\r\nThere probably will be people who expected the story of the anime to go on more seriously and wanted the anime to be more focused on the main story line in this season. In that case they will be disappointed because most of the episodes are about characters and their own personal stuff and the writer is trying to get us to feel more close to the characters.A reason maybe that we couldn't find the time to know most of them in the first season becauseof the story going so fast on.\\n\\n\r\nBut if you enjoy the environment ,characters and the main story itself and don't care about the story going on that much, you're gonna like this season.",
            "date": "2017-12-24T09:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 266249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5453815.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/All-Hail-Lelouch",
                "username": "All-Hail-Lelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=266249"
        },
        {
            "content": "Preface: Most reviews break down into categories to assign a numerical rank too (sound, story, art, etc),  so to change it up my reviews will be focus on what works, doesn't work, and what kind of viewer I think would enjoy this series. \r\nIntroduction\r\nI have never had a love hate relationship with a series as I do with the two seasons of Kekkai Sensen.  I find this series bounces back and forth from getting me invested into the character drama and then to leaving me behind with a bunch of events that have no stakes to them.  It's beyond colourful in allthe right ways, but then blinds us with too much colour.  Kekkai Sensen & Beyond or Blood Blockade Battlefront Beyond is such a roller coaster that it either leaves me either breathless or with whiplash. \\n\\n\\n\\n\\n\r\nA fun ride (what works):\\n\\n\r\nI love this cast, the Libra gang is colourful, diverse, easily stand out from each other, yet their chemistry is flawless. The show never stops to explain these guy's interactions, it just shows them to you, and they feel real and natural. Some episodes spend more time flushing out these wonderful characters and while the episodic nature is problematic (talk about this later), I can happily say there isn't a single character based story that is boring in comparison to the others. The writing, animation, and voice actors knock these characters out of the park every time.  If there is one thing you should learn from this show, is this is how you create a interesting and diverse cast. \\n\\n\r\nThe serious moments/episodes. The moment this shows decides to slow down a tad, focus on something tangible with stakes, is it awesome. Not going into spoiler territory, but when Kekkai Sensen manages to find out how to showcase it's crazy world in a grounded perspective, it is truly unique. The shame is these moments are far and few between, and can only be really explored in a spoiler full essay format, then a review. However, the two episode finale is a great example of this and if you make it through the first 10 episodes, the ending is pretty solid reward. \\n\\n\\n\\n\r\nI'm afraid of heights (What doesn't work) \\n\\n\r\nThis show has a tendency to more often then not leave me scratching my head confounded, confused, and curious as to why I should care.  While the wacky destructive events of the Salem's Lot is undeniably important to theme, setting, and general feel of the show, the second season has a tendency to take it too far. We had season 1 to establish the setting pretty solidly, we really don't need to have how \"hilarious\" and \"chaotic\" this place is constantly beaten over our heads. It all just ends up feeling like destruction for comedic value, and that joke only has so much reusable value. \\n\\n\r\n Additionally a second season is building on what the predecessor established, but this really isn't the case here. To be honest you could probably take most of these episodes and insert them randomly into season 1, and wouldn't feel all that lost (more then you already were).  While certain Libra members did become more defined in this season, it was really more flushing out there history, not their present/future. The stuff that is present day happens in their own little bubbles you're never worried about something bad happening in let's say episode 4, will affect the character or the world in episode 10.  While this formula does typically work for episodic storytelling, their isn't even single episode growth displayed in any episode. This leaves you wondering what was the point of having this specific story shown to the viewer? It all just feels filler at the end of the day. The episodic format is also hindered since season 1 did have a sort of story advancement to it, which makes the fact season 2 is running in place stand out that much more by comparison. \\n\\n\\n\\n\r\nAm I tall enough for this ride? (Viewer recommendation)\\n\\n\r\nThis is not an anime for new comers to the medium. This anime sort of requires a bit of history and knowledge about anime customs to appreciate this.  While Kekkai Sensen isn't a meta-narrative, it does require you to already possess the ability to suspend your disbelief on a lot of levels in way western shows would never force you too, while needing to stay grounded at the same time. \\n\\n\r\nThat being said if you're a more seasoned anime viewer and looking for something to shake up the standards in ways similar to Studio Trigger (Gurren Laggan, Kill la Kill, etc), Kekkai Sensen maybe just what you're looking for. Just don't expect a masterpiece or a lot of consistency in your viewing, for better or worse.",
            "date": "2018-03-07T10:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 273283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3357707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/spartan_073",
                "username": "spartan_073"
            },
            "url": "https://myanimelist.net/reviews.php?id=273283"
        }
    ],
    [
        {
            "content": "The second season of Kekkai Sensen is more of the same show from 2015. If you liked the first season, you will probably like this one as well. If you did not like the first season, chances are high your opinion will not change. Style over substance - the anime.\r\nSTORY: Bizarre, aimless and minimalistic.\r\nKekkai Sensen & Beyond is a simple case of the week show. There is no overarching plotline, 1.5 episodes of overall story progression is a major letdown. Each episode is concatenation of bizarre events mixed with introduction of Libra members, who did not get attention in the first season. Those small andisolated stories are random to a degree, that you could think anything can happen in this city.  In the process the show cannot establish its internal rules or boundaries for the world it is presenting and seems aimless. I mean if there are Vampires and Demons, why not highly advanced space bacteria? \\n\r\nThere are numerous attempts to do humor, however most jokes, especially the physical ones, don't land; the whole ep 10 is one ongoing joke, which overstayed its welcome. The show tries to do meta humor with a lot of references of other shows: Inception ep 4, HxH ep 6 and more, however subpar writing transforms it in cheap rip-offs.\\n\\n\r\nCHARACTERS: Wide as a sea, shallow as a puddle. \\n\r\nKekkai Sensen & Beyond will often dedicate one whole episode to a character, and yet it somehow manages to tell almost nothing about the person in spotlight. Those episodes focus too much on the case and not the character, so that only one or two attributes can be added to a character description, leaving them paper thin. Afterwards their screen time will be reduced to nothing per episode. \\n\r\nThere are not many occasions when the whole (or some) cast is in one room and bounces of each other in a snappy dialogue, a setting I would like to see because it actually advances characters and shows relationships. Zapp and Chain got their moments, sadly those are rare and far between. \\n\r\nI don’t remember Leo being this annoying in the first season. He is still a damsel in distress, but now he is mostly targeted by random thugs for his pocket money and not some higher beings for his God’s eyes. \\n\r\nBut Sonic is still the best and steals the spotlight in every frame.  \\n\\n\r\nART & ANIMATION: All that glitter is not gold.\\n\r\nBackgrounds are detailed and character models are appealing, although the later ones will be off model from time to time. \\n\r\nThe animation of action scenes is somewhat sparse. Those will often consist of stylish freeze frames, most notably in ep 2 or 6. However, from time to time the viewer is spoiled with beautiful sakuga, like in ep 5. All in all, Kekkai Sensen & Beyond draws attention with its high production values, but cannot deliver consistently high quality visuals. \\n\\n\r\nMUSIC: Some big shoes to fill.\\n\r\nThe first season had very memorably music, especially the end theme, so that reaching the same quality was a very difficult task. Background music and original voice acting are still amazing.\\n",
            "date": "2017-12-24T14:20:00+00:00",
            "helpful_count": 105,
            "mal_id": 266274,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5539735.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/NoizyFrog",
                "username": "NoizyFrog"
            },
            "url": "https://myanimelist.net/reviews.php?id=266274"
        },
        {
            "content": "Watching some over the top action anime these days can really fill anyone with a dose of popcorn entertainment. There’s popular Marvel based movies coming out each year, book adaptations that turned into cultural influence, and iconic Hollywood stars that made history in the film industry. Then, there was Kekkai Sensen. Remember Spring 2015? Among the many action based shows, Kekkai Sensen stood out as a show that stylized action and violence to present a storyteller of supernatural gimmicks. Well guess what? Bones is back at it again and made sure that Kekkai Sensen is here to talk about for 2017.\r\nI’m not going to lie.Kekkai Sensen’s return didn’t come as a total surprise given the popularity of the manga in Japan. What started out as a one-shot by Yasuhiro Nighthow became a serialized manga and eventually turned into this animated action flick. Known for his work Trigun and Gungrave, Kekkai Sensen had to make a name for itself. It did just that through the incredibly addicting storytelling and characters. To make things even better, the franchise adapted Nighthow’s style of humor, the type that can hook anyone in with just how over the top it can be.\\n\\n\r\nTitled as “Kekkai Sensen & Beyond”, the sequel starts off in the aftermath of the first season. Some time has passed and once again, we are introduced to the city of Hellsalem’s Lot. From the first few episodes, we see that Leo’s life is still as hectic as you can imagine. It doesn’t long at all for the sequel to get you into the mood again as the pilot episode reintroduces the humor of the franchise. Episode 2 also gives an insight on the backstory of Hellsalem’s Lot that is more than just an exposition. It’s told through meaningful dialogues and gives the viewers a better understanding of its world setting. Indeed, Kekkai Sensen’s world fiction is colorful and has always bought a fascination to me. \\n\\n\r\nNow, here’s the curious part about Kekkai Sensen. Who is your favorite character? Maybe you like the typical main protagonist, Leo. Perhaps someone as crazy as Zapp is on your list to look out for. Or maybe, someone that was overlooked from season 1 like K.K or Gilbert? Thankfully, Kekkai Sensen & Beyond gets to work at bringing those characters to attention. The first season heavily focused on the core members of Libra. However, this sequel brings to light with storytelling about the other characters too. Some of the noticeable examples are Chain, Gilbert, K.K., and even Zed. It’s interesting to see what these characters do during their free time and honestly, it bought more interest to them. For instance, did you know that Chain and her fellow comrades (a member of the Invisible Werewolf) still had an old nemesis who wanted revenge? Ever curious about what K.K’s family life is like and relationship with her son? Or even, Zed. The man has been really an outcast but in this sequel, he gets a nice spotlight with is background storytelling. I can also confess that seeing Gilbert go beyond his duty as a combat butler was highly entertaining. It reminds me of the Gotham/Batman-style action that became iconic from American culture. \\n\\n\r\nThat being said, I can’t say the storytelling is always great at selling its plot. Some of the later episodes can be a bit tedious and even boring to watch. Two episodes in particular (as a 2-episode arc) in the latter half of the show gave me a weak impression. It focused on one of Leo’s friends (Riel) that I just couldn’t bring myself to enjoy watching. Not mention, Riel’s personality isn’t interesting to watch either despite the friendship he shares with Leo. In addition, it also felt inevitable that the sequel would bring back important characters from the first season. Leo’s sister Michella is a prime example. There have been several flashbacks throughout the sequel that shows how important she is to his life. It’s hard for me to say this but while it’s important to get to her character’s story, it doesn’t feel that impactful. Sure it’s important to see her again but did we really need two episodes to focus on her? I’ve only read parts of the manga so this came to me as more of letdown than as a blessing. Still, the series does maintain a decent pace mostly thanks to the character cast, stylistic episode adventures, and excessive humor.\\n\\n\r\nBones is back at it again and Hellsalem’s Lot is looking better than ever. Just like season 1, this sequel makes attention to detail as one of its highlights. The complexity of the cities, advanced technology of abnormal sci-fi elements, and the even everyday objects makes its mark. It really excels at making its world feel alive. Character designs still gives a sense of style to themselves and we also get to see the hardcore action that bought so much entertainment like the first season. Fan service is mostly presented through the action sequences as the characters showcase their unique powers. The key selling point is how they influence outcomes and interacting with certain situations. I also can’t stress this enough but when it comes to action, Kekkai Sensen knows how to hit the bull’s eye to give the viewers what it wants.\\n\\n\r\nWhile I can’t say Kekkai Sensen & Beyond’s theme songs are as creative as the first season’s, it still gives a memorable impression to showcase the talent of the directors. What really drew my interest towards technical aspects of the show is the OST. The mixture of jazz, eerie, orchestral, and melancholic music really synchronizes well with each other. \\n\\n\r\nAfter watching this show, it’s easy to say that Kekkai Sensen still has what it takes to deliver entertainment. It had the capability of expanding its plot even with episodic adventures while giving side characters their own stories. However, I will say that the sequel isn’t as impactful compared to the first season. At some point, you may feel like the show tried to showcase everything and has nothing more to offer. I had that feeling at some point especially in the final few episodes. Still, give the sequel a try. It’s a series celebrating the work of Yasuhiro Nighthow that opens the doors to fun.\\n",
            "date": "2017-12-23T10:29:00+00:00",
            "helpful_count": 65,
            "mal_id": 266117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=266117"
        },
        {
            "content": "[Re-Submission]\r\nI'll try and explain why this isn't a good sequel, at all. [Spoiler Free]\r\nI'd just like to get it out of the way that I'm watching this hot off the heels of the first season, as I binged the first and second season in about a day. The details of which are still very fresh in my mind.\r\nThis is also the second season of Kekkai Sensen, so I'm assuming you're familiar with the story.\r\nWhy does Kekkai Sensen 2 fail as a sequel? To put it bluntly, it's because this season is much more episodic in nature. \r\nIn the first season, almost every episode leading upto the finale had something to do with or laid down the subtext for the overarching plot of the story, which culminated in a satisfying, if a bit hollow ending. It was still episodic, but was also eluding to the bigger picture.\\n\\n\r\nThe second season has failed to do this mostly and has felt flatter and less engaging because of it. \\n\\n\r\nThis is a spoiler free review, but the plot point that ended up being the finale was the exact one I thought it was in my preliminary review, and was only mentioned a grand total of about two minutes before the final two episodes.\\n\\n\r\nEvery other episode just feels like exposition and world building that are just loosely strung together without any grounding in a plot structure. \\n\\n\r\nThat's why I feel like this fails as a sequel, it feels like a bunch of OVA episodes mashed together.",
            "date": "2017-12-24T11:19:00+00:00",
            "helpful_count": 55,
            "mal_id": 266254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3299155.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vyxria",
                "username": "Vyxria"
            },
            "url": "https://myanimelist.net/reviews.php?id=266254"
        },
        {
            "content": "Story (2/10)\r\nExcept for the last two episodes, there is no plot in none of the 10 episodes. Some are just background of Libra members (4,6,7), others are nonsense ( 1,8,9) and some are rushed (2,3,10). The episodes 8 and 9 are the worst of the season. The episodic episodes feels like a bunch of OVA mixed together.\r\nArt (7/10)\r\nIn this aspect the show in much better than the other options. The fights have very good animation and the colour is beautiful.\r\nSound (6/10)\r\nBesides the opening and the ending, i don't remember much of the soundrack. \r\nCharacters (3/10)\r\nDespite the show have episodes dedicated to Libra members, after that,their presence feels nonexistent. Also they still are some Libra members that barely know anything. Leo is undeveloped until the last two episodes, he is just beaten all the time. Klaus feels more a background character in most episodes unlike the first season. Zapp have less screen. Steven in the only character in this season that was well treated. \\n\\n\r\nThe villains: all are generic, boring and are the same just with different designs. The Blood Breed of episode 10 and the villain of the last two episodes are the only with personality in the entire season. They are so bad written that i just remember the villains of the first season. Aligura and  Femt barely appears despite being in the opening. \\n\\n\\n\r\nEnjoyment (3/10)\\n\\n\r\nI don't like most of the episodes. Nearly all the episodes are just the same: some generic villain do something against a Libra member → characters try to finding them or do something to defeat them→ explosions everywhere and the generic villain is defeated. Even in the background episodes this happens.\\n\\n\r\nOverall \\n\\n\r\nI don't like this season. Despite the first season was average (5/10), this season feels more chaotic and a wasted of time in most of the 10 episodes. This season handled very bad the villains and forget Femt and Aligura. Only for the animation and the last two episodes, my score for Kekkai Sensen & Beyond is 4/10.\\n\\n\\n\\n\\n\\n",
            "date": "2017-12-23T19:25:00+00:00",
            "helpful_count": 53,
            "mal_id": 266186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6468118.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nurguburu",
                "username": "Nurguburu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266186"
        },
        {
            "content": "I was honestly, truly looking forward to the new kekkai sensen season. My friend and I absolutely adored the first season. It had the right amount of craziness and enough plot to keep us going. Because of how great the first season was, we both went into this with high expectations. But this season... has been a train wreck.\r\nWith only 3 episodes left, I have very little hope that there's going to be a truly satisfying ending. Seeing the preview for the next episode even further solidifies my feeling.\r\nThe format has been that of an episodic anime, where something that happens in one episode doesn'treally correlate with another. Nothing connects. There's very little actual story going on. We're getting GREAT episodes that focus on one character at a time where we learn about a specific character, but that's all Beyond has going for it. \\n\\n\r\nThere's nothing building up. No story other than \"yeah crazy shit is happening again\". We're being introduced to new characters that I can't feel anything for because, again, we only focus on them for like one episode and that's it.\\n\\n\r\nFor the most part, Kekkai Sensen and Beyond is nice if you're wanting a snapshot of one of the main cast's day in everyday life. But you're also missing very little if you choose to skip around.",
            "date": "2017-12-03T12:14:00+00:00",
            "helpful_count": 42,
            "mal_id": 264448,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717363.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/chekkit",
                "username": "chekkit"
            },
            "url": "https://myanimelist.net/reviews.php?id=264448"
        },
        {
            "content": "The first season of this show is one of my favorites of all time. The wild and crazy antics that Leo goes through on top of a deeply connected story was amazing so I had high hopes coming into this. The story is basically about the aftermath of a fallout which connected new york to another world to state it quickly. This season lacks the continuity that the first season had. It is more like a series of OVAs so far. The show also feels toned down compared to the first season the antics aren't as frequent or heavy but they are still there andjust as enjoyable. \\n\\n\r\nThe art is also really good. It is one of the staples of this show for me since anything can happen at any time. The show doesn't limit itself so, the art supports it very well because it has to. The characters designs and when people use their powers are enough to get you to watch the show on their own if you didn't much for anything else.\\n\\n\r\nThe first season's music was amazing all the way through. I spam the soundtrack in the car all the time and this season doesn't fall far behind in quality but it isn't as good and that's not saying a lot. Every song you hear makes you happy and fits the scenes well.\\n\\n\r\nThis season focuses less on Leo and more on the side characters so far giving everyone their own episodes and I love it. Chain is laid back and good for parties despite are ultimate badassness, Zapp is as stupid as always and etc. you can't help but love everyone and it's nice getting to know them more as the main plot of this story ended last season and this whole show could have stopped there and left you satisfied. It makes you wonder if we do get to an actual story or stick to this OVA like format.\\n\\n\r\nI enjoy the crap out of this show and am never disappointed as we move on.   Overall I give it a 8 because as much as love this I admit it's not perfect. It might make bring more score up if we get that serious side back but for now... You should watch this if you loved the first season you will enjoy this too but don't start here you won't get into it.",
            "date": "2017-10-29T12:49:00+00:00",
            "helpful_count": 37,
            "mal_id": 262042,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049264.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlueEclispe",
                "username": "BlueEclispe"
            },
            "url": "https://myanimelist.net/reviews.php?id=262042"
        },
        {
            "content": "Kekkai Sensen is... a fairly unique show by today's standards. It fills a niche category that doesn't pop up every season, and is even more rarely well done: that of the episodic action series. Instead of a linear plotline, Kekkai Sensen instead focuses on worldbuilding through mostly one-off episodes, shifting its focal point to different characters around the protagonist in order to further pull you, the viewer, into their world. While this style alienates some viewers of the show, for me it reminds me of the first season of Darker than Black, a series I greatly enjoyed (we don't talk about the second season). Whilethese shows both had overarching plot points, the majority of both shows are spent covering fun, self contained stories that pop up each episode. Both of these shows greatest strengths were their world concepts, and this episodic structure is part of what invests the viewer into these inventive settings.\\n\\n\r\nAnd what a world Kekkai Sensen gives us - Hellsalem's Lot; a crossdimensional apocalyptic version of New York City. This strange dystopia, along with the eccentric but lively main cast, provide an exceptional vehicle for a show of this kind. The city is painstakingly animated, with bustling streets providing a true of sense of reality to a show drunk on fantasy. The main cast, while relatively shallow so far save for the main character, are nonetheless enjoyable, quirky, and distinctive, further flavoring an unconventional setting with suitably strange individuals. \\n\\n\r\nThis show is a joyride. It rolls out a wacky combination of action, political intrigue, and humor. The rule of cool is constantly in effect, and with BONES animating it, you can bet your bottom dollar that it looks fantastic. While this show is far from perfect, its flaws are more than overshadowed by its strengths. This show's top priority is fun, and for me it has captured that in every episode so far. My favorite episode so far was about a mushroom person with a burger addiction, and if that's not fun and wacky, I don't know what is.\\n\\n\r\nThis show is well done, but based on its unique formatting is certainly not everyone's cup of tea. If your favorite episode of Cowboy Bebop was Toys in the Attic, you'll most likely enjoy this show. If you're looking for something more plot driven rather than character/world driven, you'll most likely find this show frustrating. Personally? I'm having a blast.",
            "date": "2017-10-30T13:43:00+00:00",
            "helpful_count": 32,
            "mal_id": 262121,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5430414.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/joschmo11",
                "username": "joschmo11"
            },
            "url": "https://myanimelist.net/reviews.php?id=262121"
        },
        {
            "content": "Its not Kekkai Sensen Season 2. It is Kekkai Sensen and Beyond!...\r\nThe first season of Kekkai Sensen was aired last Spring 2015 and gave us a good plotline of the characters of Libra. With the story on point in season 1 up to the end, it was a good anime on my perspective. Then here comes Kekkai Sensen and Beyond. The season 2 of the hit anime and I, to be honest cannot really decide which is better. Thus, I compared both of them for this review and come up that it is without a doubt there is a great difference. \r\nStory:\r\nBeyond starts of withLeonardo reflecting the past event that happened to obtain his \"All Seeing Eyes Of God\" power. In season 1 we are hinted about his sister's involvement on the eyes of Leonardo although we were never showed the history, riddle or anything about it (except its abilities prior to combat). This anime this season gave us a clue or a hint already in the very start that Beyond's objective will be focusing on uncovering some details about the mystery eyes of Leonardo. Though I was surprised that it didnt get along with the storyline of the first Kekkai Sensen. Instead of rushing to the objective (which is uncovering any details about the eyes), it offered us backgrounds on each and every member of Libra. To be fair, I really don't like this type of things in anime like reflecting or having side story and all but it turns out that Beyond gave me or gave you a good impression to every single character. Enjoying there fun moments and feeling their struggles when they have problems. For example, I was amazed by how awesome Gilbert Altstein was in the episode he was feature. He looks like Alfred from Batman on that time. In season 1 it looks to me that he is just a trustworthy butler but I was surprised by it. Also, the story behind Obrien Zed, is also a quite emotional and informative on how he interacts with others. Even though these are all good stories in an episode or two, I have one question. Why not just turn this stories of every Libra members as specials or OVA's?\\n\r\nHere's the point. The storyline is quite confusing in Beyond. At first we were given a certain clue about the storyline. Hinting us that this will be Leonardo's spotlight again but different as he will be encountering a secret about his eyes, or his sister. But that idea got temporarily dispose and replaced by stories of each characters. I am not against it that much because I, to be honest enjoyed there own episodes, but along that characters should try to solve the main conflict little by little, though this was never seen until episode 11 - 12 (which is a fight about those eyes). Although despite of all this, the action of the story is still mindblowing and fun to watch as it gets intense on every episode.\\n\\n\r\nCharacters:\\n\r\nThe characters are the same and still being one of the best groups in anime. I still love it when especially when they say their moves like \"Lance Of Absolute Zero\" by Steven. The whackiness of Leonardo and Zapp are still onpoint that makes Beyond have a bit of comedy tint on it.\\n\\n\r\nArt:\\n\r\nThe art never changed, thus it is a good thing as the art on season 1 of Kekkai Sensen is already perfect for the story. The visuals of when they say their moves (the japanese letters striking to your screen) never gets old and the effects of the action parts.\\n\\n\r\nSound:\\n\r\nSeason 1 opening and ending is indeed better than this one though the jazz soundtrack of season 1 is reflected to season 2 which gives us a nostalgic atmosphere. The jazz fits the aerosphere of mood on situations. Though I said that opening and ending of season 1 was better, I still can't stand that the new openings and endings are quite plausible as they are unique as well. \\n\\n\r\nOverall thoughts and Enjoyment\\n\r\nKekkai Sensen and Beyond brought me back to when I watched the season 1. How I judge it if it was better than it is quite difficult because the enjoyment level is quite indeed very good for me but the storyline and outlining the conflicts is always important on storytelling. And that whats lacking Beyond. It maybe enjoyable although a story... is a story. Overall, I enjoyed Beyond but not as I enjoyed season 1 of Kekkai Sensen. Even though its like this, I still highly recommend you to watch it. If you still didnt watch Season 1 then go ahead and then watch Season 2.",
            "date": "2017-12-23T13:22:00+00:00",
            "helpful_count": 27,
            "mal_id": 266140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=266140"
        },
        {
            "content": "Kekkai Sensen & Beyond or Blood Blockade Battlefront & Beyond or BBB & B is back! (That's alot of B's)\r\nThe very first thing LA would mention about this second season is the absences of Rie Matsumoto, the director of the first season who brought that zany flair she added to Kekkai Sensen that will be sorely missed in this season but nonetheless, this season helmed by Shigehito Takayanagi (Director of Dagashi Kashi and both season of The World God Only Knows) tries to emulate Rie's vision in his own way as well as pay respects to Rie all into this second season with great results.\r\nForone, Kekkai Sensen's episodic nature is back and takes a more character focused narrative this season by bringing us perspective from the various main characters of Libra and giving us their daily lives of them.\\n\\n\r\nThe funniest thing is, many of the episodes even pays homage to media references (which is probably Yasuhiro Nightow's influence, the author of Kekkai Sensen), from paying homage to Batman, Akira and Godzilla among others.\\n\\n\r\nCharacter-wise the development of the minor cast of Libra was a good step, from Gilbert F. Altstein, Chain Sumeragi, K.K, Zed and Steven A. Starphase. LA's favourite would be a tie between K.K and Chain's episodes and involvement in several of the off-handed non main character focused episodes. LA felt that Klaus didn't get as much as the rest of the cast though he was linked to a Demon Hospital episode that had at least showed his resolve before Hellsalem's Lots actually became a thing. Now Leo's actual character focused episode doesn't show up until the final 2 episodes of Beyond and it involving Michella, you know it was gonna get serious. Before all that it hinted us the audience that Leo wanted to get rid of the curse of his All Seeing Eyes and culminated into the final episodes into something as bombastically intense as it did, with a villain Leo faces who surpasses him in terms of supernatural power.\\n\\n\r\nAnimation and voice acting wise, it has all the feel of the first season, with the crisp and zany battles that Libra goes through and all the alien nature of the anime taken as normalcy. The animation done by Bones is once again great and consistent all throughout from both the first season and this one. Voice acting wise, LA thought Yuu Kobayashi and Ai Orikasa got to use more of their acting chops during this season and it paid off. Daisuke Sakaguchi who voiced Leo is his normal yet zany self and his over-exacerbated reactions are great as always. What's great for the voice cast for LA would be Nana Mizuki as Michella and in voicing Leo's kind hearted sister (LA says this as Nana usually voices the badass character) but LA has this thing with Nana Mizuki where LA can't displace Nana Mizuki from Tsubasa from Symphogear, but nonetheless with all this rambling, the voice cast is expected greatness.\\n\\n\r\nSo if you thinking with the change of directors and change of plot focus would deter you from liking this season of Kekkai Sensen, LA would say you can rest easy as it still has the same vibe to the original and given the character development to Libra actually working it's own advantage, the same animation studio pegging this season and the voice cast being as amazing as always, Beyond quite honestly eviscerated any notion that this season would go down on the wayside with what passion, homages and emulate the first season to this season own unique greatness!",
            "date": "2017-12-23T15:39:00+00:00",
            "helpful_count": 18,
            "mal_id": 266158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=266158"
        },
        {
            "content": "Okay incoming 1 episode reviewer here, don't take me too seriously:\r\nHA this is shit BUT IT'S GREAT. This is approved by someone with S1 in his top 5 favorites. I'll be honest: This season is 100% imitations of Rie Matsumoto's OG style for season 1and no lie; it's only 1 ep in so I may be completely wrong but this style is everything I wanted in a second season against all my expectations WOOP...\r\nOkay well MAL requires me to submit a longer review so I will, just give some of my general thoughts to please the overlords. But here's my general idea after watching justa bit of it (remember one episode is all I got!):\\n\\n\r\nThe art this everything from S1, as well as the music; the music is from the same composer at least so its fantastic. That's more a credit to Bones than the director they hired to take over for Rie (Dagashi Kashi director incoming, brace yourselves) but somehow, SOMEHOW... Shigehito Takayanagi has captured the original series' magic. It may be he's simply riding on studio Bones' incredible style but it's working. \\n\\n\r\nBottom line: If you loved Kekkai Sensen S1 give this one a chance; it defied my expectations (which were quite low coming in). We'll see if this keeps up but so far I'm in for the long haul.\\n\\n\r\nI'll gladly update this review as more episodes come out (that's fun right?), and I do hope this keeps the wacky off-the-cuff-fun and quality it's shown so far.\\n",
            "date": "2017-10-29T21:06:00+00:00",
            "helpful_count": 18,
            "mal_id": 262074,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3306771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LordFabio",
                "username": "LordFabio"
            },
            "url": "https://myanimelist.net/reviews.php?id=262074"
        },
        {
            "content": "There's a lot of reviews on the frontpage that seem to point a pretty negative light on this second season of Kekkai Sensen, and while the points they bring up are valid, I feel like judging Kekkai Sensen based off a conventional anime framework doesn't really do it justice, especially considering how ambitious it is as a series.\r\nStory: This anime is episodic and unlike the first season which developed the plot throughout the season, the second season only contributes to the main plot in the last two episodes. This is perfectly fine as Kekkai Sensen at its absolute best is 1-2 episodes per arc. Thesimplicity of each arc and how it fleshes out each character can be described as efficient. The pacing never feels too slow, and even when its going too fast, it plays into the theme of a chaotic mood that is perfect for the setting of Hellsalem's Lot. While the stories aren't the best, they pave the way for something more important which is leaving the watcher at awe with the world and how the characters interact with it. Compared to the first season, I feel like the later episodes weren't bogged down to fit the whole black/white arc and that I preferred how each of the episodes had its own \"Hero's Journey\". To criticize Kekkai Sensen for this format seems absolutely ridiculous, as fast pace is important to the overall mood of kekkai sensen and plenty of successful anime have employed the same method with conflicts being introduced and resolved within the same episode. \\n\\n\r\nArt: The animation is like the first season. Stylistically, the style matches the fast paced anime style. The action scenes look fluid and there's no real ambiguity with what's happening. However, the animation doesn't stand out as much as the other strengths, and there are a lot of still frames that look horrendous with regards to proportions. \\n\\n\r\nSound: First season had one of the best soundtrack in modern anime, and the second season also delivers. The soundtrack fits the mood and the pure variety is enough to be impressed by what Kekkai Sensen brings to the table in terms of audio. My only complaint is that the soundtrack doesn't seem too big of an upgrade from the first season, and I really miss the old ED :(\\n\\n\r\nCharacter: Kekkai Sensen has static characters, but that doesn't mean these characters are bad by any means. Many of the episodes in Kekkai Sensen were meant to not develop already established characters like a lot of these reviewers claim, but rather to give insight to the nuances these characters display. Chain during season 1 was a straight laced no nonsense tough girl, but in season 2 she feels infinitely more human and personable. Steven was cool in season 1, but in season 2 he feels infinitely more dangerous and ominous. These are just a couple of examples, and while some of these characters still come off as flat, there are enough characters to like that aren't cookie cutter tropes. \\n\\n\r\nEnjoyment: Since this is the etc option of MAL, I'll just talk about the best quality of Kekkai Sensen which is the fact that the setting and world building are top notch. While Kekkai Sensen isn't special in terms of the metrics we measure regular anime, the amount of cohesion that fits into the universe makes this a real treat. The episodic format, multiple static format, high tempo music, and even the animation all play into a beautiful romp committed to crazy characters in a equally crazy world and their hi jinks. \\n\\n",
            "date": "2017-12-28T09:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 266643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kitsune_Goon",
                "username": "Kitsune_Goon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266643"
        },
        {
            "content": "Awesome sequel to season 1, I have to say I preferred this season a lot more to season 1. Like season 1, there was a great selection of BGM and OP/ED, which reflect the mood of the anime. The way in which the soundtrack was woven into the animation alone should be reason for watching this sequel\r\nSome of its downfalls are that the finale of the anime didn't have a lot of foreshadowing to it (technically hints were dropped since season 1, but this could have been with more emphasis). Would also have loved to learn more about the power he was given and whyhe was given it - questions that haven't quite been answered in either season.\\n\\n\r\nHowever, this is redeemed with the main character's growth. A lot of development can be seen in how the protagonist struggles to better himself. His actions slowly start to take influence from the people he admires. He has certainly become a comfortable Libra member, and has definitely become part of HL despite how \"normal\" he is. Furthermore, I enjoyed taking a look at each individual member's lives. The anime does not go into deep, soppy backstories, so these episodes gave us enough to build on the characters and yet leave us wanting more. Beautifully written, fantastic direction and animation; eagerly hoping there is a 3rd season.",
            "date": "2017-12-28T11:08:00+00:00",
            "helpful_count": 10,
            "mal_id": 266652,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5787421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fahiemoon",
                "username": "Fahiemoon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266652"
        },
        {
            "content": "To be fair, I am biased towards this anime.  I loved the first season of it, because it was so off-the-wall and against every standard, run-of-the-mill series you generally see out of the industry today.  No high schools, no love triangles, no moe, no cliffhangers, no training regimens, no by-the-numbers plot.  The anime is absolutely insane, disjointed, bizarre, and creative, while still being able to deliver a cohesive storytelling experience, which excellent characters, tons of over-the-top action, and a main character in Leo Watch, that while weak, isn't too weak to be annoying and will man up when need be.  Youcan get behind him as a vulnerable MC.   \\n\\n\r\nThis is one of my favorite series ever, so in that regard I go into Season 2 already deeply swayed in favor of the anime.   Season 2 didn't disappoint me, but I can definitely see where people might have complaints.  This season, it didn't really tell a overarching story like Season 1 did, which followed Leonardo Watch coming to Hellsalem's Lot in order to find a way to help himself and his sister.  This season was more of an ode to each individual supporting character, with the final episodes focusing on Leo and Michella.  As such, it may seem all over the place as it was very episodic, which you rarely see in anime today.  As someone who has seen so much anime that I get sick of the normal way animes present themselves, it was refreshing to me, but I can see where it may irritate others.   \\n\\n\r\nFor me, the Kekkai Sensen team was already one of my favorite teams out there, so delving into the back stories of some of them really helped to flush out the entire cast and make the team even more likable for me.  They particularly did a good job with KK and Chain Sumeragi.  I went from not really caring much about KK, to really enjoying her.  I believe that this was the main purpose of the creators of the anime, to get fans more acquainted with each supporting character, so they will be more invested in them going forward in Season 3.   For me, it definitely worked, but again, it may irritate some.   \\n\\n\r\nAs with the first season, the soundtrack was outstanding.  Because Kekkai Sensen is so focused on not being like other animes, the soundtrack is also much different.  They blend in a lot of Chillhop, alternative rock, jazz, and top it off with a killer intro called \"Fake Town\".  I kept playing the intro over and over just to hear Fake Town.  It's so good.  This is one of those animes where I look up the OST so I can get some of the sounds I hear on it, similar to Samurai Champloo.  \\n\\n\r\nMy one complaint about the creative process is that I never really have cared much for the artwork of Kekkai Sensen.  It's not bad, but it's not particularly great, either.  At times it can look a little cheap when it comes to the character designs of the inhabitants of Hellsalem's Lot, but I am sure that's also by design, as well.  It's just not my particular cup of tea.          \\n\\n\r\nAt the end of the day, if you're a huge fan of Kekkai Sensen like I am, you're going to love this anime, especially if you were like me and wanted to see more of the cast get screen time in the first season.  If you were on the fence in the first season, you may not care for this one or its episodic, disjointed nature.   I loved it, though.  \\n\\n\r\nStory: 10\\n\r\nArt: 6\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 10\\n\r\nOverall: 9",
            "date": "2017-12-23T15:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 266152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266152"
        },
        {
            "content": "Kekkai Sensen & beyond was an enjoyable second season. Given so, I'd like to elaborate on where I felt it did well, and what held it back.\r\nIn terms of the shows entertainment value I found this installment to be quite enjoyable. The action scenes were intense and well animated, the humor was not overdone nor out of place, and subtlety placed throughout the show. \r\nThis season gave us a small look into the backstories of many side characters who lacked depth from the first season and this, i believe, was a good touch.\r\nArt and sound were solid but not exceptional, but i certainly liked theopenning and many charecter models for the Hellsalems lot inhabitants. \\n\\n\r\nThe main complaint I have for the show is its episodic nature. While I dont mind episodic shows, Kekkai Sensen's original series felt like it had a storyline progressing throughout, which this season lacked. While we learned more and more about charecters, Michella, and the events of the city, I would have liked a larger picture plot line or some additional convergences between stories. In my personal opinion, a show with such entertaining episodes was fine, but after each episode I merely would discard my conviction or emotional connection knowing most of the remaining show given some small arcs would start fresh.\\n\\n\r\nOverall, I award the show a 7. I found it enjoyable with clever characters, some fine humor, and decent action scenes, but felt the lack of emotional connection to the events and characters held me from loving the show more. In a way this show reminded me of Bungo stray dogs, which also has a fun cast, and semi episodic nature of crime solving, but this show thrived in a more comidic sense plot wise unlike the darker counterpart. In all, for a fun show with a few laughs and some well animated action, I'd say give it a try!",
            "date": "2017-12-23T12:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 266126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4405431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shaboigon",
                "username": "Shaboigon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266126"
        },
        {
            "content": "ok, i dont usually write reviews but i have to do it this time because this show is getting a lot of negativity by people\r\nkekkai sensen season 1 had a \"plot\" and that plot was anime original, as a result of that...the anime couldn't focus on characters that much\r\nseason 2 does just that, it gives insight about characters and does some world-building \r\nthis is one of the best sequels i have ever seen\r\nart: good job studio bones...action scenes are really good!\r\nmusic: really great, fits the theme of the anime, we also got some soundtracks like tortoise knight which are different from others \r\noverall...i really enjoyedmyself",
            "date": "2017-12-28T01:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 266609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5551082.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/necro_dancer",
                "username": "necro_dancer"
            },
            "url": "https://myanimelist.net/reviews.php?id=266609"
        },
        {
            "content": "Season 2 is over. I had ups and downs with this season, but the ending shows it again: I just love Kekkai Sensen. The comedy, the action... just a very cool combination! This Season focused on Backgroundstorys and other Characters. Yes, it was a little annoying to see little stories and not a big one. BUT all these parts made a really overall season.\r\nThe ending was very good, because Leo don´t have these depressions about his sister anymore.\r\nI highly recommend it, but i think that season 1 was a little bit better. it isnt 10/10, not 9... but a very good 8 and I WANTA THIRD SEASON :D",
            "date": "2017-12-23T15:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 266159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5590060.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TylerPilz",
                "username": "TylerPilz"
            },
            "url": "https://myanimelist.net/reviews.php?id=266159"
        },
        {
            "content": "Hellsalem's Lot - the city where the human world and the alterworld intersects. Commotions are never bizarre in the city's everyday life as a plethora of different creatures crawl upon it. As two \"distinct\" worlds collide, a secret organization, Libra, maintains the balance of these two realms. After White sacrificed herself to protect the barriers of Hellsalem's Lot, what destiny lies upon the men behind Libra?\r\nKekkai Sensen & Beyond starts after the events of the Spring 2015 anime Kekkai Sensen, with Leonardo Watch continuing his daily life in Hellsalem's Lot to support his younger sister Michella. Traversing every weirdness this city has to offer, hesoon unearths about a very important possession he has. Surely, two years and two seasons is an enough break for BONES. Also considering other projects the studio has (e.g. Boku no Hero Academia 2nd Season), BONES is ready to offer the continuity the tales of Hellsalem's Lot.\\n\\n\r\nStory (9/10):\\n\r\nThe story is a plain narrative of Leonardo's life with Libra and their action-packed missions. There's nothing new in the series, putting its genre in consideration, but it didn't fail in giving life by inserting some comedy sketches, especially with Zapp. Some parts of the first half lack substance and clear motivation to keep the viewer watching. (Yup - I fell asleep in those parts). But the second half regained my interest in the series with some cheeses BONES has been hiding.\\n\\n\r\nArt (9/10):\\n\r\nAs expected, BONES never fails to reconstruct New York City into an urban realm full of supernatural identities. The character designs have been improved as well as the setting.\\n\\n\r\nSound (10/10):\\n\r\nThe insert songs were so great. They encompassed the whole mood of the situation, especially the awesome parts where the Libra pose but inserted a slow and dramatic song, which contrasts initially but with depth, the scenes were just soothing and awesome. The score is good with the fight scenes. Unison Square Garden once again turn the hypes up with the OP theme, as well as the disco and dance ED theme.\\n\\n\r\nCharacter (10/10):\\n\r\nCharacters have been greatly improved since the first season. Aside from the design, the backstory and depth of each are unquestionable. \\n\\n\r\nEnjoyment (9/10):\\n\r\nI enjoyed.\\n\\n\r\nOverall (9/10):\\n\r\nBONES deserves an applause with this series. I would not call it a masterpiece, but it deserves to be appreciated by the many. What a great way to fill the gaps before ending the year. And expecting more in the next season, if there is.",
            "date": "2017-12-28T02:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 266613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6024561.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aikii-kun",
                "username": "Aikii-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=266613"
        },
        {
            "content": "I love this show.\r\nStory: 6/10\r\nWeakest Aspect since there is no overarching story but instead a bunch of mini-stories which while extremely good left me unsatisfied and hoping for a season 3. Thus given a serviceable rating.\r\nArt: 8/10 It's bones. The characters are elastic, expressive and the animation is always on point. However nothing overwhelmingly standout.\r\nSound: 8/10 Brilliant OP and ED. Good soundtrack, well used. The soundtrack for the battle in the last episode was particularly standout.\r\nCharacter: 9/10 Everyone in this series is a treasure. If there had been a tad more character growth and character arcs this would be a 10.\r\nEnjoyment: 9/10 God this seriesis just so much fun!\\n\\n\r\nOverall: 8/10\\n\\n\r\nIf this series continues and reaches a proper conclusion and white comes back in some capacity. This series will become a 10/10 in season 3, I have no doubt. Hopefully that comes to pass.",
            "date": "2018-01-11T08:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 268196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6099977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheonlyRoggol",
                "username": "TheonlyRoggol"
            },
            "url": "https://myanimelist.net/reviews.php?id=268196"
        },
        {
            "content": "I Prefer to call this season to be a long OVA between season 1 and season 2 (if ever comes).\r\nThere probably will be people who expected the story of the anime to go on more seriously and wanted the anime to be more focused on the main story line in this season. In that case they will be disappointed because most of the episodes are about characters and their own personal stuff and the writer is trying to get us to feel more close to the characters.A reason maybe that we couldn't find the time to know most of them in the first season becauseof the story going so fast on.\\n\\n\r\nBut if you enjoy the environment ,characters and the main story itself and don't care about the story going on that much, you're gonna like this season.",
            "date": "2017-12-24T09:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 266249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5453815.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/All-Hail-Lelouch",
                "username": "All-Hail-Lelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=266249"
        },
        {
            "content": "Preface: Most reviews break down into categories to assign a numerical rank too (sound, story, art, etc),  so to change it up my reviews will be focus on what works, doesn't work, and what kind of viewer I think would enjoy this series. \r\nIntroduction\r\nI have never had a love hate relationship with a series as I do with the two seasons of Kekkai Sensen.  I find this series bounces back and forth from getting me invested into the character drama and then to leaving me behind with a bunch of events that have no stakes to them.  It's beyond colourful in allthe right ways, but then blinds us with too much colour.  Kekkai Sensen & Beyond or Blood Blockade Battlefront Beyond is such a roller coaster that it either leaves me either breathless or with whiplash. \\n\\n\\n\\n\\n\r\nA fun ride (what works):\\n\\n\r\nI love this cast, the Libra gang is colourful, diverse, easily stand out from each other, yet their chemistry is flawless. The show never stops to explain these guy's interactions, it just shows them to you, and they feel real and natural. Some episodes spend more time flushing out these wonderful characters and while the episodic nature is problematic (talk about this later), I can happily say there isn't a single character based story that is boring in comparison to the others. The writing, animation, and voice actors knock these characters out of the park every time.  If there is one thing you should learn from this show, is this is how you create a interesting and diverse cast. \\n\\n\r\nThe serious moments/episodes. The moment this shows decides to slow down a tad, focus on something tangible with stakes, is it awesome. Not going into spoiler territory, but when Kekkai Sensen manages to find out how to showcase it's crazy world in a grounded perspective, it is truly unique. The shame is these moments are far and few between, and can only be really explored in a spoiler full essay format, then a review. However, the two episode finale is a great example of this and if you make it through the first 10 episodes, the ending is pretty solid reward. \\n\\n\\n\\n\r\nI'm afraid of heights (What doesn't work) \\n\\n\r\nThis show has a tendency to more often then not leave me scratching my head confounded, confused, and curious as to why I should care.  While the wacky destructive events of the Salem's Lot is undeniably important to theme, setting, and general feel of the show, the second season has a tendency to take it too far. We had season 1 to establish the setting pretty solidly, we really don't need to have how \"hilarious\" and \"chaotic\" this place is constantly beaten over our heads. It all just ends up feeling like destruction for comedic value, and that joke only has so much reusable value. \\n\\n\r\n Additionally a second season is building on what the predecessor established, but this really isn't the case here. To be honest you could probably take most of these episodes and insert them randomly into season 1, and wouldn't feel all that lost (more then you already were).  While certain Libra members did become more defined in this season, it was really more flushing out there history, not their present/future. The stuff that is present day happens in their own little bubbles you're never worried about something bad happening in let's say episode 4, will affect the character or the world in episode 10.  While this formula does typically work for episodic storytelling, their isn't even single episode growth displayed in any episode. This leaves you wondering what was the point of having this specific story shown to the viewer? It all just feels filler at the end of the day. The episodic format is also hindered since season 1 did have a sort of story advancement to it, which makes the fact season 2 is running in place stand out that much more by comparison. \\n\\n\\n\\n\r\nAm I tall enough for this ride? (Viewer recommendation)\\n\\n\r\nThis is not an anime for new comers to the medium. This anime sort of requires a bit of history and knowledge about anime customs to appreciate this.  While Kekkai Sensen isn't a meta-narrative, it does require you to already possess the ability to suspend your disbelief on a lot of levels in way western shows would never force you too, while needing to stay grounded at the same time. \\n\\n\r\nThat being said if you're a more seasoned anime viewer and looking for something to shake up the standards in ways similar to Studio Trigger (Gurren Laggan, Kill la Kill, etc), Kekkai Sensen maybe just what you're looking for. Just don't expect a masterpiece or a lot of consistency in your viewing, for better or worse.",
            "date": "2018-03-07T10:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 273283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3357707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/spartan_073",
                "username": "spartan_073"
            },
            "url": "https://myanimelist.net/reviews.php?id=273283"
        }
    ],
    [
        {
            "content": "Kekkai Sensen&Beyond was a great anime!☆ \r\nI was hyped about the 2nd season to air and it did. I was disapointed at all.\r\nTo start of Leo didn't change, was the same goofy and clumsy character and had consciousness. Meaning he cared about the close ones amd fight for the justice! (I like these types of characters)\r\nThe art was as awsome like the 1st season (thankgod) it was eyecandy* \r\nI learned more about them and their past so it did bring me close to them as a viewer. \r\nAbout the location where it took place New York was totally accurate! The living there is crazy ashell XD! It was represent really well (Good job staff)\\n\r\nTo sum up the brother-sister love is so cute and really inspiring! To see in the anime that family has a tight bond with each other! It's great represantion! \\n\r\nGive a chance to see this show and you will not be disapointed!",
            "date": "2018-01-02T06:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 267183,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4616357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nemurasan",
                "username": "Nemurasan"
            },
            "url": "https://myanimelist.net/reviews.php?id=267183"
        },
        {
            "content": "If like me,you like the first season and were delighted to see the MC change and expect some modification in his character after: having to fight against people he know and his \"girlfriend\" being kill. Nope, you will be disappointed, for most of the season it's like White never existed and Leonardo personality is the same as in ep 2 of s1. The episode in themself aren't that bad but they feel like a bunch of OVA and you can probably see them in whatever order you want, but while some are decent some just feel like filler and see no character or plot devlopement.And what seem to be important vilain and a large part of the big plot of kekkai sensen : the blood breed, are none existent they're just the generic vilain of the episode. To conclude it's acceptable in itself and bad as a second seson.",
            "date": "2018-06-20T13:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 281681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5717527.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Oriotiar",
                "username": "Oriotiar"
            },
            "url": "https://myanimelist.net/reviews.php?id=281681"
        },
        {
            "content": "Overall (8/10)\r\nI don't usually write Reviews. But so many people sayin' this season is so bad. That's exaggeration. that might discourage people to watch the anime :3 I just don't want them to miss this. It's definitely worth watching.\r\nEverything is good, funny and i love the humor of this anime.\r\nThe deliver is Great too .\r\nBut tbh Season 1 is better.\r\nwhy?\r\nThis season 2 is like there is no actual plot :3\r\nThey introduce a new character such a the butler, fight some people planning to create Blood breed soldiers and Drama time with Leonardo's bestfriend. I prefer if they add some story of Leo and White(Mary Macbeth)or Black(William Macbeth) or maybe about the 13 Kings .. but Everything is different every episode except the Last two episode (11/12)\\n\\n\r\nI was Expecting them to fight Femt *King of Depravity* though. \\n\\n\r\nI give it a passing score so waiting and hoping for a Season 3 of this anime !",
            "date": "2018-03-25T10:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 275020,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6516011.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tian_Desu",
                "username": "Tian_Desu"
            },
            "url": "https://myanimelist.net/reviews.php?id=275020"
        },
        {
            "content": "I absolutely adored first season, and more Kekkai Sensen is always great, but as a sequel this just doesn't bring much to the table. \r\nI am currently 8 episodes in (watching in dub) out of this 12 episode season, and I have yet to see any semblance of an overarching plot. The season is, as of yet, entirely comprised of side stories focusing and building on each character of the main cast. Now don't get me wrong, I very much appreciate this; one of the main flaws with first season was how little love some of the characters got. However, with the way this isstructured, it is much better suited as a side series or OVA's rather than a legitimate sequel. I'm still enjoying the heck out of it, but the lack of any actual plot is a major bummer. \\n\\n\r\nWill update when the season is over, but I doubt my opinion will change much. \\n\\n\r\nUPDATE: After finishing the show, it unfortunately finished how I expected it to. The last couple episodes are the only meaningful plot movement you get, and even then it felt underwhelming. This show is still loads of entertainment, just not what I wanted out of a sequel.",
            "date": "2017-12-11T12:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 264987,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3504841.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Forte_",
                "username": "Forte_"
            },
            "url": "https://myanimelist.net/reviews.php?id=264987"
        },
        {
            "content": "The second season of Kekkai Sensen: in my opinion better than season 1\r\nStory: 6\r\nSo let's start off with the story. Compared to the first season, this season was in my opinion better paced and executed. Of course, it was still chaotic, but that's the whole concept of this series. The story in this season was easier to understand and we got more background information on each character of this series, which I also really liked. Still, there is unfortunately no overarching plot over the whole series, but just I still enjoyed watching each and every episode of it.\r\nArt: 9\r\nThen let's talk about the art. Justlike in season 1, the animation this season was also great. The visuals were again on point and I really like the urban, New York-ish style. The details in the scenery and action scenes were still on point and I really liked it.\\n\\n\r\nSound: 8\\n\r\nThe soundtrack used in this series in mostly based on jazz, which really gives off a chill vibe and gives you again straight away the feeling of an urban environment. Sometimes accompanied with great vocals and I found it very pleasant to listen to and a great addition to this series.\\n\\n\r\nCharacter: 6\\n\r\nThis season you got more background information on every character which made them more relatable. I already really liked the main character, but the further I watched this series the more I also started to like the side characters. Each person has its own unique personality and they are all very likable. You also got to see a bit of character development in the main character, which also made this season a bit better than the previous one.\\n\\n\\n\\n\r\nSo overall, I really enjoyed this season and I give it an 8. Yes, there is no real plot and is their an end goal in this series? Probably not. But there is something in this series, which made me want to continue watching. Every episode has its own story, which were all very exciting. And I personally really liked the main character and how he interacts with everyone around him. If you liked the first season, I would definitely recommend you to watch this season as well and if you didn't like the first season, I wouldn't recommend it, because the concept is still the same as the previous season but I would say that it's better executed overall this time.\\n\\n",
            "date": "2018-04-26T08:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 279052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6983555.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CheeseApple",
                "username": "CheeseApple"
            },
            "url": "https://myanimelist.net/reviews.php?id=279052"
        },
        {
            "content": "I love the first season, this one? There is lack of progression and no overarching story making me question myself why I still want to continue this series. Every next episode I constantly trying to find the overall story or what this anime trying to accomplish, hoping that the next episode will finally give me a reason to stay but no... It's one of those shows where every episode is a contained story, just like the first season the difference is in the first season there is progress and an overarching story in the background that builds up till the last episode. There's none ofthat here, it failed to present a story and it looks like the writer just improvise along the way. It focused too much on the side characters like they dedicate this one episode to one side character and on the next episode they dedicate it to another side character to flesh out these characters more and then completely forgets them on the later episodes. They go back to these cardboard cutouts of their characters. Leo, Zapp, Klaus and Zed are still the characters that carries this movie. The \"Villains\" here are just pathetic compared to black from the first season. There is also this tone in the series that's somewhat inconsistent. Like some cute alien brutally eats a person. The physics is out of the roof, characters surviving falls that will break their bones it's basically a cartoon. Let's talk about Leo, Leo seriously needs to be buffed. The \"All seeing eye\" is so underpowered in this show that Leo always getting his ass whooped and there's nothing wrong getting his ass whooped but at least give him a chance to fight back. They gave him an electric baton, that's cool right? The good thing about the show that makes it somewhat watchable is the art style, animation and sountrack just like the first season but it's not enough to carry this series. If there's going to be a season 3? Give black more screen time and bring white back maybe as a villain this time. Drop the 13 kings crap.",
            "date": "2018-04-05T21:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 277059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7130387.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/KurisuDaineru",
                "username": "KurisuDaineru"
            },
            "url": "https://myanimelist.net/reviews.php?id=277059"
        },
        {
            "content": "I love jazz. Of all the genres of music, jazz can provide the most soothing, the most thrilling, the most strangely apt backdrop to an anime. Cowboy Bebop paid homage to jazz and did it brilliantly. Pardon me for saying this, but I strongly aver that Kekkai Sensen, season two (S2) especially, is a modern successor to Bebop as jazz made manifest in anime. Obviously it’s not as good as Bebop, but in terms of possessing its own flair and panache, Kekkai Sensen stands out like Bebop does. Both anime are stylish and know it. I loved it, I loved the music, I loved thebarrage of characters for Libra techniques, I loved the crazy hectic random culture of Hellsalem’s Lot.\\n\\n\r\nLet me explain precisely why I love this show.\\n\\n\r\n~THE MUSIC~\\n\r\nThe opening brings you back immediately to Libra and the antics of Hellsalem’s Lot. Sung by the guys that did the ending for season 1, you’re swept back into the hectic crazy awesomeness of Kekkai Sensen. Good, but not as good as the ending. Performed by DAOKO and Yasuyuki Okamura, this cacophony of sound and bright colors all mashed together with the characters, concluding with a succession of briefly shown images important to the plot, followed by Libra walking away in style. Brilliant.\\n\\n\r\nBut as superb as the OP/ED are, the SOUNDTRACK is even better. Perhaps one of the soundtracks most aptly suited to an anime I’ve seen so far. With songs sung in Japanese, English, French, German, and Spanish, backed by jazz and piano, the music operators behind this show… they had fun. Kekkai Sensen is, without a doubt, an anime that was fun to make. Often you see little tidbits sprinkled throughout the events of the show that don’t really contribute to the plot, but do add to the cake of Kekkai Sensen (or should I say, Cakeai Sensen). An orange alien octopus humanoid rapping by himself in a street corner. A winged draconian beast moving lazily through the sky in the background. Such moments that develop the world and fill out the sense of wonder are akin to Miyazaki’s proclivity for worldbuilding in that manner. The show is primarily episodic, and the lack of any seriously cohesive plot is intentional; it’s not about “plot” so much as “setting” for Cakeai Sensen, the unpredictably randomness of Hellsalem’s Lot. Not every narrative has to have a plot that carries throughout, there is a strong reason why shows like Cowboy Bebop and Mushishi exist.\\n\\n\r\nPardon the digression. Cakeai Sensen’s OST is so soothing, and melancholy, and upbeat, and just… perfect. It’s great for listening too on its own, and the jazz. The jazz is great, as all jazz is, for having that seemingly unplanned and arbitrary discourse that yet manages to sound right. Loved it.\\n\\n\r\n~THE FIGHTS~\\n\r\nOr should I say, the blood techniques. These guys are intense. Makes Deadman Wonderland look like a bunch of kids spilling blood for fun. When saying your techniques aloud before using them is cool. Panache. Flair. Elan. The thudding of kanji for each move. The emblazonment of a giant cross of scarlet. The fang hunter vs. the Blood Breed.\\n\\n\r\n~THE ANIMATION~\\n\r\nPerhaps Bones’ best work, after Bungou Stray Dogs S2. Many times when a background is resplendent with a whole gamut of varied kinds of humanoids/monsters, they’re all moving or walking or doing whatever. This keeps the otherwise typically still two-dimensionality when presenting large backdrops out of the picture, literally. The fights as I mentioned are sweet, the colors are superbly mixed, the New York-like city scenery is wonderful, the depiction of the All-seeing Eyes of the Gods is solid, and so on. Very well done.\\n\\n\r\n~THE CHARACTERS~\\n\r\nAlmost all of the Libra members, the main ones that is, are accounted for. Each is given an episode for some development and side-plot, so by the end you’re liking them even more. Each one is unique in his or her own right and brings value to Libra.\\n\\n\r\n~HELLSALEM’S LOT~\\n\r\nI want to live here. Of course I’d need Leo’s luck for avoiding a terrible death time and time again, but seeing the largest individual in the world stroll by now and then or have burgers with aliens or running from cute enormous monsters on a daily basis would be wicked awesome. It’s crazy when you stop to recognize that New York City is the only place on Earth subject to this chaos. The Big Apple just got bigger, wilder, and all the more delicious.\\n\\n\r\nI want more cake. I need more Kekkai Sensen. It’s fun, it’s crazy, the music is ambrosia for my ears.",
            "date": "2018-01-20T14:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 269158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5559530.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Julius_Light",
                "username": "Julius_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=269158"
        },
        {
            "content": "\"Kekkai Sensen & Beyond\" , also known as \"A gathering of 12 ova's whose connection to the original kekkai sensen is abissmal\", is a perfect watch for everyone that is yet to experience the well written, deeply touching and refreshing art piece that the first series is to behold. Infact, anyone gone through the King of Despair Arc would find this attempt at milking the kekkai cow laughable at most.\r\nThe story is entirely inexistent, characters are one-dimensional and as shallow as it gets, bearing little to no weight in the episodical plot and, as a result, they don't undergo any kind of evolution. Where somewould blame the episodical nature though, i think that, even with that system, awesome results can be achieved (go see ep.3 of Kekkai Sensen and the Klauss character establishment, personally I  cried)That said, the writers at least tried to lure the original fans through well positioned baits such as the sparce showings of the ghostly ex-\"best girl\" and the hairy she-detective's character analysis. \\n\\n\r\nThe art doesn't feel as impressive as the first series' one, even though some episodes truly show off the show  potential (flying butler's car-thing). Intro and outro are pretty cool, especially the latter, but the whole thing doesn't hold a candle to, who would have ever thought, the amazing combination of the first instalment.\\n\\n\r\nIn the end, be it because of the remarkable love that i feel towards the original series or because of the actual unremarkableness (is that a word?) of the sequel, the only taste left in my mouth is bitter (not even sugar song to bitter step).",
            "date": "2017-12-30T16:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 266911,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Crostino",
                "username": "Crostino"
            },
            "url": "https://myanimelist.net/reviews.php?id=266911"
        },
        {
            "content": "I really love the first season and thought it did everything right! it is of one my favorites but Beyond felt boring at times! It felt very dull and while there were great moments overall it was a very dreadful experience! it was a let down considering the excitement that was building! The Animation and Music were amazing as everyone expected but story wise it felt very stale and the main villain was introduced too late unlike the king of despair which they built to the entire first season! It felt way too laid back and did get me to care! Everyone was back andthey didn't really good on the character stuff! They developed characters who really needed it (Like Chain and Zed) and did a fantastic job with Leo where he shines once again as a fun likable main character! The last two episodes are amazing and build great suspense which I think is what the rest season was lacking",
            "date": "2018-10-16T20:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 291913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7499234.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xman9amin9",
                "username": "xman9amin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=291913"
        },
        {
            "content": "Kekkai Sensen & Beyond is just what you would expect from Leo and Libra, a mixture of action, comedy and mystery, but with the added benefit of answering some of lingering questions of the previous season !\r\nStory: (7/10)\r\nI DISAGREE wholeheartedly with the other reviews that argue that S2 has no plot. Kekkai Sensen in general is a melting pot of sensory overload, from the monsters, explosions to everyday mundane life in the city. \r\nBoth season 1 and 2 do not follow an overarching plot format until strictly speaking ep 10-12 for S1 and ep 11-12 for S2. In both seasons, there are episodes dedicated tocertain characters, although S2 takes a more direct approach. What &Beyond does better though is that they follow the source material more accurately, without the anime original characters like White and Black that come off as a bit forced IMO. \\n\r\nAside:  Ep 3 of S2 essentially encapsulates the greatness of Kekkai Sensen; a story about Libra members, who are constantly exposing themselves and those close to them in danger, which to us viewers is exciting, but also puts into perspective the challenge of their nichijou.\\n\\n\r\nArt: (8/10)\\n\r\nThe art was one of the most consistent aspects of both seasons. Bones does a really great job with keeping the character designs clean and detailed for the action scenes. S2 Episode 2 especially, it felt like I was watching a Kekkai Sensen movie. The combination of art and sound was quite marvelous, you will have to wait and see for yourself guys!\\n\\n\r\nSound: (7/10)\\n\r\nTo be fair, S1 had more OSTs that stood out for me, especially On My Own by Ai Ninomiya during the burger episode! Still, this season still delivers, albeit not at the level of S1. \\n\\n\r\nCharacter: (9/10)\\n\r\nWow!\\n\r\nWhat this second season does so well, which was lacking from the first is some context for what each character is about, their circumstances as well as their struggle with everyday life. What do I mean by this?\\n\r\nThe first season dabbled in what it meant to be a member of Libra. We see that characters for the most part are balancing their jobs with surviving in Hellsalem's Lot. But where it falls short is what happens behind the scenes... who are these people? why are they in Libra at all, and what makes them interesting to begin with. In season 2 we FINALLY get episodes dedicated to certain characters that shed some light on who they are when they aren't playing advocates for peace.\\n\\n\r\nEnjoyment: (8/10) \\n\r\nThe separate episodes to dedicated Libra members was definitely a breath of fresh air, and gives perspective into a side of them which we did not see previously. 9/10\\n\r\nEpisode 3 on Stephen, Leo and Chain was done exceptionally well and deserves merit. \\n\r\nStill, the ending arc, which is quite pivotal to the storyline felt a little rushed. 7/10\\n\r\n All in all, I feel this season is a good segway into future material. \\n\\n\r\nOverall: (8/10)\\n\r\nWhile the first season focuses more on Leo and the anime original storyline with White and Black, the second delves further into the separate Libra members, and gives us more depth into character development. Both seasons have their appeal, although I preferred S2 more for how it seemed to fit the series better. Would definitely recommend to watch!",
            "date": "2018-07-05T01:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 283023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/herrickluk",
                "username": "herrickluk"
            },
            "url": "https://myanimelist.net/reviews.php?id=283023"
        },
        {
            "content": "Alright alright, i have no background in writing reviews and what not, but i wanted to add my 2 cents.\r\nWhen it comes to the story......WE ALL KNOW ITS WEAK.\r\nI didnt specifically watch this show because the plot line was strong and gripping.  It did pull at some heart strings a few times, and they definitely could have done more with Leo, but overall its one of those shows you just watch to enjoy. (season 1 definitely did better story wise).\r\nFor me what made it was the art  and comedy.  I could just see the amount of time and effort that went intocreating the scenes, the people, the (aliens?) monsters, etc. \\n\r\nThen cue in some always amazing fighting scenes......yeah always a good time.  \\n\r\nI feel if you solely judge this show on its weaknesses you may miss out on a lot of the enjoyment.  Just sit back and laugh at the completely ludicrous events that happen so sporadically.  Lots happens in this city :)\\n\r\nSurprisingly, this was a show my whole family within a variety of ages enjoyed.\\n\\n\r\nYes lots of parts could have been better.\\n\r\nI know tons of people treasure a story...i know...i love anime shows with great story lines too...\\n\r\nBut i also enjoy a small collection of shows that I watch just to be impressed visually and get me laughing and this one fits that bill.\\n\\n\r\nOh and Leo is freaking adorable lol.",
            "date": "2018-03-07T08:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 273273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dekugon22",
                "username": "Dekugon22"
            },
            "url": "https://myanimelist.net/reviews.php?id=273273"
        },
        {
            "content": "The sequel to Kekkai Sensen, this show stays true to the original's flair, but seems to be just a bit more serious and a bit less chaotic overall.\r\nStory:\r\nThe series breaks into multiple arcs, which don't overlap much from the surface level, and this allows for some nice intermittent conflict resolution like you get from the typical episodic series. The quick change in pacing makes the series feel all the more chaotic, which I believe was the intention, and it makes the whole series feel all the more alive. On top of this, the story manages to get very serious and intense, keeping the viewer onthe edge of their seat, despite the inherent goofiness of the show. 8/10.\\n\\n\r\nArt:\\n\r\nKeeping the same style present in the previous series, the show has an inky yet zany comic book feel. The style of this show can't be understated, though it might take some getting used to if you don't liked stylized animation. The overall quality of the art has neither improved nor deteriorated from the original. 9/10\\n\\n\r\nSound:\\n\r\nThe opening and ending tracks both stand in the shadows of their predecessors, but are very good in their own right. The music that plays during the episodes is good, fits well with the style, and doesn't distract one bit. The English voice cast in both the original Japanese and English dub are good, but nothing exceptional. Overall, the sound work was done very well. 7/10\\n\\n\r\nCharacters:\\n\r\nThis is where the series surprised me the most. The original had fun and interesting characters, but many of them lacked depth. This season however, many of those characters get some exciting development. The spotlight is taken off of our main character Leo for long enough to really give the side characters time to shine. Chain in particular gets a ton of screen time. Every bit we learn about the characters is done in a fun and engaging way as well. This is the only category where the series did better than the original by so much. 8/10\\n\\n\r\nEnjoyment:\\n\r\nI can't say it enough, this show is FUN!!! If you watched the original, it's more of the same crazy stuff, but it still feels fresh and fun. Some of the plot points are a bit over-the-top and cliche, but this is done to great effect, and the overall flow of the series gains a lot from it. Kekkai Sensen has always shined brightest in this category, and still does. 9/10\\n\\n\r\nOverall:\\n\r\nIf you liked the original, don't expect the exact same tone from this series, but still expect to enjoy it. Beyond does a great job at following in the footsteps of the original, without just rehashing the same old tricks. A fun ride, and a memorable one at that! 8/10",
            "date": "2018-02-17T02:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 271718,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020712.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EclipsedArchon",
                "username": "EclipsedArchon"
            },
            "url": "https://myanimelist.net/reviews.php?id=271718"
        },
        {
            "content": "Here we go again, after a very fun and confusing 1st season Blood Blockade Battlefront & Beyond released a 2nd season. I became big fan of this series cuz although it's plot was all over the place it was such a joy to watch with a lot of great action, interesting characters, and cool music. Entering this season I was hoping it would focus on giving us more info on some of the characters(Libra in particular)cuz we didn't get much of it in the previous season. Plus I wanted the series to be given a set plot for it to focus on that way itcan improve the pacing. If the series did both of us we could've be given a masterpiece, but did it do it ?? Once again it was a 12 episode season and after finishing it here's what I thought.***contains MINOR spoilers***\\n\\n\\n\r\nStory:7/10\\n\r\nIn terms of pacing season two is very much the same as its first season. Like season one the series starts off by using an episodic pattern and then towards the end it gives us an overarching plot. Clearly the show's biggest strength here is when it sticks to the episodic pattern and focuses on character interactions cuz the series is so good at giving its audience entertaining and funny moments with a bunch of exciting fights. This season also focused more on giving the side characters their own episodes where we learn more about them which is something I heavily appreciated. We were given an episode of an event that occurred during the big collapse which I felt was important cuz it showed us how some humans like newcomer Luciana Esteves gained supernatural upgrades. The show does however still suffers from exposition, for example everyone makes a big deal of Leo's eye power but we're never given its full extend which leaves you kinda wonder what's the big deal ?? And we're still never shown how the Libra members were given their powers either. In the last two episodes the main plot was revealed to be about Leo and Michelle and although it's a part we wanted to see it wasn't given enough build up to make the episode finale much of an impact. The series needs to be given more episodes/time to in order for us to explore everything and for build up that way we can be truly invested.\\n\\n\r\nArt:10/10\\n\r\nThis is an area where its 1st heavily excelled at and it exceeds once again. But then again it's Studio Bones so what do ya expect. The show once again does a great job at portraying Hellsalem's Lot by showing stunning shots of the city's skyscrapers, subways, and streets. There was also an absolute astounding image in the season finale where the series captures a lake and my god not only was it beautiful but it looked so real. The show's look really gives you that modern New York vibe with the use of technology like iPhones and television. Like the previous season the animation did a great job at handling the action scenes only this time there were actually MORE explosions to emphasize the destruction. The action never slows down it's very fast paced and never once does the series look dull. It's a very cool and attractive looking anime and it's another prime example on how Bones handles its given work.\\n\\n\r\nSound:9/10\\n\r\nWhile the music is still great it wasn't as great as the first season unfortunately. This was mainly due to the opening and ending themes, while I find both to be good they just weren't as awesome as the two from season one. Even so, the ending theme of this season \"Step Up Love\" done by DAOKO and Yasuyuki Okamura has been nominated for best ending song by this year's crunchyroll Anime Awards so the community finds it great. The same composer, Taisei Iwasaki does the music so the season still contains the great background music from its first season. My personal favorite track would be \"World Goes Round\" as it reminded me so much of a 90's R&B song and it sounded great. Once again the voice acting is terrific, majority of the cast is the same except for Zed's as his VA was changed to Chris Wekhamp for w.e reason. I highly recommend for this to be watched in English as it contains some beloved voice actors such as Aaron Dismuke(Leo) and J. Michael Tatum(Steven) and they all put on fine performances.\\n\\n\r\nCharacter:9/10\\n\r\nSo did this season improve the characterization from the first season, thankfully yes. This season finally gave us insight and backgrounds on the Libra members that we've wanted. Characters like Chain, Steven, K.K., Gilbert, and Zed are all interesting and got their own episodes where we learned about them. As we already knew Chain is the sexy sadist who's an invisible werewolf who likes to beat up Zapp every once in awhile. Now we know that she's apart of an all female assassination squad who each have the same powers that she has. We were also given a glimpse of her home life, she appears to be a slob who leave's her apartment very messy and loves to drink Blue Moon, plus she seems to have a crush on Steven. As for Gilbert we already knew he's Klaus' butler but we've learned that he's a badass mummy looking man who has superhuman regeneration which is the only reason why he's still alive. Aside from that he can also kick some serious ass who owns a bat mobile like vehicle, so he's Bruce Wayne and Alfred all in one I mean how cool is that !! Zed who's half man, half fish is given a backstory of his own we're given how much of a chill and lovable guy he is as he goes job hunting so he can balance out Libra's funds. Now I could sit here explain more about the others but I don't wanna give away too much, just know that this season gave the cast more depth and insight that made them more relatable and understanding. And Im real proud at this. I do however wish we get more of Femt who's been hinted that he might potentially be the show's central villain.\\n\\n\\n\r\nFinal Verdict: 8.7/10\\n\\n\\n\r\nPros\\n\\n\r\n+Continues to excel in its episodic route that keeps the series to be fun and cool\\n\r\n+Improved character devolvement that helps the cast become relatable\\n\r\n+Art and style continues to look great and really stands out\\n\r\n+Those badass signature moves never gets old !!\\n\\n\\n\r\nCons\\n\\n\r\n-Lack of story arcs\\n\r\n-Series as a whole still suffers from exposition\\n\r\n-It's too short give us more !!\\n\\n\\n\r\nBlood Blockade Battlefront & Beyond continues to keep the series fun and exciting. It has goofy funny moments, beautiful deep moments, great fight scenes, happy scenes, and sad scenes. From an entertainment standpoint this series never failed and thanks to its character development it made this enjoyable cast even better. From a story perspective however it's still a lil disappointing, it keeps throwing plots at the end that make you ask, \"Why don't they focus on setting it up rather than just throwing it in ??' This series is a perfect example of an anime that's too short, and it has so much potential to be just a mere 24 episode series. As of now we don't know if a season 3 is gonna happen I hope so cuz the series doesn't look wrapped up at all plus we NEED more. If this show can live up to it's potential by handling its story better this could really be a masterpiece. In conclusion, this season was slightly better and it has many moments on why we loved it in the first place so it's safe to say that it won't disappoint anyone.",
            "date": "2018-02-08T14:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 271059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6245345.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/saiyan_og",
                "username": "saiyan_og"
            },
            "url": "https://myanimelist.net/reviews.php?id=271059"
        },
        {
            "content": "Blood Battle Blockade & Beyond (or B3&B)\r\nIt’s more of the same, what’s not to love?\r\nThere’s no real point in me sitting here giving a detailed review on BBB s2 when it is so nearly identical to s1. If you liked s1, you’ll almost certainly like s2, and that’s basically all there is to it.\r\nActually, wait up a sec. There is a caveat, don’t go into s2 expecting it to have any real plot until the last 2 episodes (so yeah, the same formula as the first season). If you go into it expecting the series to move on with the storyline presented at the verybeginning of the series (because, we are at the second season now after all), you will be disappointed and view all the mindless episodic fun as filler – which will ruin your enjoyment. So don’t go into it with that mindset. Enjoy B3&B for the mindless fun it is (there are actually a couple of surprisingly deep episodes too, where we get to explore the backstories of the other cast members), and then, when they do actually get to the plot (right at the end of the series), you won’t feel like it’s been thrown in out of nowhere.\\n\\n\r\nEnjoy! 😊 XD\\n",
            "date": "2018-01-03T06:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 267285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=267285"
        },
        {
            "content": "Wow, I've procrastinated this final review for a while now. \r\nI'm not one to criticize much a lot, so this is mainly just my final thoughts. \r\nI'm just gonna go out and say that I really enjoyed this season. As a person who enjoys episodic shows, BBB&B is one of my absolute favorite episodic series. Each episode was a total blast and getting to see most of the minor and supporting characters shine was a nice touch. I'm glad this season's director did quite a good job, but man, do I miss Rie's touch to BBB. \r\nWhile as much as I love this season, there'sa few things that I'm not the happiest about. Most of it deals with some elements of the story, and how some things felt... off? Underwhelming elements mostly. The occasional moments where some things don't add onto a character or plot of an episode. But that's mostly just me with the final episode. I'd say more about that single episode, but I won't go into it. That's an episode discussion after all. \\n\\n\r\nOf course, I have to write about the music and soundtrack for this series, being a person who loved the music last season. I really have to thank the composer this season for making such an amazing soundtrack. It's absolutely amazing. The soundtrack is honestly one of my favorite parts of this season, if not my absolute favorite.\\n\\n\r\nFinal thoughts: \\n\r\nBBB isn't everyone's cup of tea, but it's something that just's pure fun and action rolled up into one. (An action sitcom, now that I think about it *laughing in the distance*)",
            "date": "2018-01-02T10:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 267202,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5984173.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/_frappucino",
                "username": "_frappucino"
            },
            "url": "https://myanimelist.net/reviews.php?id=267202"
        },
        {
            "content": "This is the Mass Effect 2 of the Kekkai Sensen series. \r\nIn the first season, we are introduced to our universe, its major players and the themes, both philosophical and phantasmagorical, that bind this series together. It's a wild ride, and it really gets at the heart of the human condition -- it's through fantasy that it makes its greatest statements about reality.\r\nIn this second season, the focus is on character development. Each of the important characters introduced in the first season is given an expose into what makes them tick -- the deeper issues that both differentiate them, and also bind them together asa team. The focus is not on Leonardo Watch this time, though he is still very much the MC of the series. Instead of following his life, which makes up the extensive bulk of the first seasons, we see him through the snippets of life he brings to /other/ characters' perspectives. I agree with the series creators -- Leonardo Watch is established well enough, now lets see how he fits into the lives of all the people he's touched.\\n\\n\r\nIf I had to guess, the next season will be the series conclusion. We have been given a glimpse into how Leonardo's sister will come into play, though I will leave out the details to keep this review spoiler free. If this is the series' Mass Effect 2, the next season will be its Mass Effect 3, and I think we can expect big things to happen. There is definitely something to be said for the Bioware formula, and though I'm sure any likeness to it in this series' structure are purely coincidental, I think we will most appreciate what this season has set up for us when it pays off in its entirety next season. \\n\\n\r\nThat's not to say that this season is purely build-up -- it has plenty of stand-alone strength. But I vehemently disagree with the assertion that this season feels like filler. I think that's a disservice to what is, in my estimation, a solid season. That all being said, the first season is stronger overall -- it's hard to beat the sucker punch that the first season laid down on the Spring and Summer of 2015, but that's no reason to give this season a low rating -- and I think that's reflected in this season's current ranking as the #358 anime season of all time (a position of potentially deceptive prestige on a list that spans more than ten thousand anime seasons to date.)\\n\\n\r\nThe bottom line is: it's well worth the watch. No pun intended",
            "date": "2017-12-31T18:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 267037,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1436445.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Celic",
                "username": "Celic"
            },
            "url": "https://myanimelist.net/reviews.php?id=267037"
        },
        {
            "content": "I wasn't intending to watch it... I didn't watch first season, so I just wanted to take a look at episode 1 of this 2nd, to see if it was worth go fot the 1st...\r\n...and then, that \"Fake Town, baby\" OP got me from the throat and brains and now I'm here.\r\nI saw the entire \"& Beyond\" season before even a glimpse of season 1 or mangas.\r\n... so, my opinion is based almost entirely on Season 2 itself. I'm barely reachin' ep. 3 at Se01, by now.\r\nAnd here it is:\r\nNightow is a genius.\r\nNightow is nuts.\r\nI didn't think so in Trigun ( I haven't watched Gungrave)... here he has made that very clear to me.\\n\\n\r\nHellSalem's Lot is the most absurdly immersive city than I have experienced in an Anime exceptis excipiendis Otomo's Neo-Tokyo; practically another character of the plot with a greater weight than most of the human/demoniac ones.\\n\\n\r\nThis serie is like a Garage Rock song performed by the London Philharmonic under a bipolar Bushman producer ...\\n\r\n... and I'm falling short...\\n\\n\r\nHe managed to integrate 3D in a way more subtle fashion he did at 1st season (so far I saw it) and worked on light and environments 'til obsessive levels.\\n\r\nThere are scenes I must replay 'cause I was so caught up in the ambients I barely knew what the characters were doing\\n\\n\r\nThe endless mix of multicultural meta-references permeating art, music, dialogues and even \"extras\" walking the streets is soooo exhausting ... I am unable to follow them all or remember them all ... my poor wits utterly fail.\\n\\n\r\nIn addition; dude enjoys getting the audience into rhythm and emotion roller coasters using  narrative ways odder and weirder than a purple dog with Balrog horns.\\n\\n\r\nIn the 1st season looks like everything was more linear; here we got a bunch of autoconclusive OVAs, alternatively starred by each one of the Libra (including the butler and some-guy-that-happens-he-was-around-there-for-no-reason).\\n\r\nNot too clear where anything is goin' on; more alike the original manga, I've been told.\\n\\n\r\nThe polyglot battle techniques (originally spelled in Japanese, English, German and Spanish)... they are perhaps what I like the least ... my bad; action is dynamic and spreads adrenaline until splashing the 4th wall.\\n\\n\r\nOST easily into my Top-3 of the Year:\\n\r\nEach song and theme has been specifically composed, played and delivered just for a precise moment of the show.\\n\r\nEach song and theme goes from \"More than Average\" to \"Great!\"\\n\\n\r\nBizarre, asymmetric, chaotic, plain,  lisergic, delicate, raw, world-wider, stupid, genious...\\n\\n\r\nSay more; you'll probably be right whathever the adjective you choose.\\n\\n\r\nI could go on for several more pages, but I am a compassionate man and we are at Christmas Times.\\n\\n\r\nSo Happy New Year to all of you.",
            "date": "2017-12-31T01:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 266961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6806406.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ElHespiritu",
                "username": "ElHespiritu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266961"
        },
        {
            "content": "Kekkai sensen & Beyond splits into 2 parts in these 12 episodes.\r\nThe first part is more story focused around Leonardo and thats episodes 1,11 and 12 and the second part are the episodes between them which involve the rest of the Libra characters and helps as some short of character development.\r\nThe first part and especially the last 2 episodes are for me the most enjoyable episodes of the whole season .And that is because they were focused around Leonardo and his sister Michella.\r\nI would really like to see more story involving Claus but that didnt happen on this season at least.\r\nThe second part is theepisodic one around the rest of the libra members like Chain,Steven,K.K or even Gilbert.We  get 1 to 2 episodes focusing on each one of them without having any connections between them.\\n\r\nI really liked the fact that they showed more of Gilbert for example but whats the point since we dont see him being involved in anything in the rest of Kekkai?Same goes for the doctor or Dog.\\n\r\nAnd the only reason i complain about this is because of fact that the season has only 12 episodes.\\n\r\nWe barely saw any of the thirteen kings except from Fempt.\\n\\n\r\nIn terms of art direction and music/sound there is nothing to complain about as they are as good as the first season. I wish Kekkai Sensen % beyond was more story focused with more episodes.",
            "date": "2017-12-25T07:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 266342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6655231.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fulgore",
                "username": "Fulgore"
            },
            "url": "https://myanimelist.net/reviews.php?id=266342"
        }
    ]
]