[
    [
        {
            "content": "How refreshing. After slapping the Demon King's shit around and stealing his daughter, our beloved hero Akatsuki returns from fantasy-land as an overpowered motherfucker. He rides lightning-charged motorcycles, gets bitches, makes em' piss, and crushes others using only his testosterone. A refreshing character and premise indeed, but does refreshing exempt the rest of the show from being mediocre?\r\nStory\r\n'Tis a rare thing, my Pappy once said, to find a show with enough courage to stray from your average cut and paste framework. So the protagonist goes in and comes out with the belligerent demon armies dry humping the ground he walks on... then what? We seethat protagonist use his new found badassery to engage in shennanigans like putting assholes in their place, or stealing girls underwear? Sign me the fuck up. And while this is surely present in Hagure, behind the scenes there stirs a new disturbance just begging the hero to be brought back into the whole \"We are the secret organization. You don't even meet our standards. Wahahaha.\" trope. \"But Selsica!\" You argue \"It didn't reach that point in the anime, and we'll probably never get a second season!\" Ahhh how right you are, but that brings up another point. Good stories have an ending, a conclusion that ties together the relationships, plot, and ultimately, the world of the series, leaving you with a feeling of bubbling warmth. Not the kind of bubbling warmth you find after eating a week old bean burrito either. In conclusion, interesting premise, bad execution.\\n\\n\r\nArt\\n\\n\r\nGood character designs make shows more enjoyable. Beautiful animation makes shows more enjoyable. This is a fact. Akatsuki looks buff, powerful, and ready to rip a dinosaur in half and piss on its face. But then, so do the girls (minus a loli). I loved the damn show, but it could have been much nicer to watch. Anime is a visual medium, so love should be put into making the visuals decent. Oh, and this show has ecchi up the ass. I can see the studio in their planning stage: \"How much of this shit can we put in before it's considered a hentai?\" \"Well son, we'll cross that bridge when it comes.\"\\n\\n\r\nSound\\n\\n\r\nFitting, yet unmemorable.\\n\\n\r\nCharacters\\n\\n\r\nFirst, the obvious reason to watch the show. Akatsuki. A good protagonist drives the plot, he is not swept along by it. And Akatsuki drives the plot through motherfucking 6-inch walls of steel. However, good protagonists are also developed, which is a tad hard to do when the development stage of the story is confined to past-tense conversations between the fantasy worlds denizens. That aside, Akatsuki has been one of the better protagonists this season. In fact he's SO powerful you can't help but feel the enemies aren't really much of a challenge, or in his friends case, much help. He overshadows the others by a large margin, adding some predictability to the show.\\n\\n\r\nTL;DR... Uhhh, I mean Overall\\n\\n\r\nDespite my criticisms, I enjoyed Hagure Yuusha immensely. You like a good ol' fashioned shonen? Pick this up. Your hand feelin' a little antsy after that break up? Pick this up. You tired of pussy MC's? Pick this show right the hell up, because alphas are a rare commodity nowadays. The show is decent for what it is, but it isn't going to go breaking any records any time soon.",
            "date": "2012-10-02T17:44:00+00:00",
            "helpful_count": 414,
            "mal_id": 73943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287865.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Selsica",
                "username": "Selsica"
            },
            "url": "https://myanimelist.net/reviews.php?id=73943"
        },
        {
            "content": "Have you gotten pissed at those wimpy leads that always hesitate before doing anything?\r\nHave you gotten annoyed at the fricken insane power ups and power of friendship crap?\r\nIf the answer is yes, this anime is the perfect break for you.\r\nStory-9\r\nThere hasn't been much of a storyline yet except there is foreshadowing for great things to come. \r\nArt-8\r\nIt's ok. Pretty nice but not my favorite.\r\nCharacter-9\r\nThe main character stands out like a star. The chosen hero, who gained powers in another demension. Sounds cheesy. He's way overpowered but instead of being scared of it, he uses it. He is a pervert but it does not change thefact that he is kind to those around him and is not a complete clueless idiot.\\n\r\nEnjoyment-9 \\n\r\nFor me, each episode was packed of fun and excitement awaiting for what would happen next. Doubt everyone is like me but I'm sure some of you will appreciate it.\\n\r\nThis anime is for those shounen lovers who enjoy watching kick ass and stupid ecchi comedy. As long as you don't expect too much, you'll probably enjoy it.",
            "date": "2012-07-29T11:09:00+00:00",
            "helpful_count": 236,
            "mal_id": 68039,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=68039"
        },
        {
            "content": "Hagure Yuusha no Estetica, or The Aesthetics of Gary Stu as it's pronounced in English is anything but good.\nWe are introduced to a main character that for once, isn't your stereotypical shy guy and has the balls to back up what ever is thrown at him. That may start off as promising, but it loses its charm by the 2nd episode. When a character is overpowered at introduction, there's not much direction you can lead the story. So where does the series head to? Tits. I'm starting to think the anime industry's answer to budget restraints is always going to lead straight to female breasts,as it sure ain't going to the script writers.\\n\\n\nHagure starts off where most stories end. Hero beats demon king, goes home and everyone lives happily ever after. Well it's supposed to. What the series entails is of what happens after all that's been done with supposed hero. To be honest with you, my first impressions episode 1 was a sign of promise as it's rarely told through anime or any forms of medium that I know of(bar sequels), yet unfortunately it fails miserably as each episode goes by. \\n\\n\nWe are derailed from the minimal plot the series offers and instead are provided with 75% of the anime showing how awesome the main character is supposed to be(and I say this derogatively), and the remainder of  each and every episode on how the heroine is shy about her breast(whilst having little clothing on). They 'try' to show some character development with the supporting cast, but it never comes to fruition due to the MC upstaging each and every one of them whenever he gets a chance to.\\n\\n\nThe art and animation for the series is mediocre and the music feels like something from a cheap JRPG. \\n\\n\nAll in all, Hagure is a time waster and is best viewed when you really are left with nothing better to watch or plainly just bored. It does not need you to put your thinking caps on and if anything, would be best served as fodder for AMV enthusiasts.",
            "date": "2012-09-10T21:23:00+00:00",
            "helpful_count": 84,
            "mal_id": 72075,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218106.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TensaiShonen",
                "username": "TensaiShonen"
            },
            "url": "https://myanimelist.net/reviews.php?id=72075"
        },
        {
            "content": "Story: Action with huge tits? 10/10\r\nAnimation & sound: Awesome boob physics and moans? 10/10\r\nCharacters: Hunk that grabs tits and steals underwear for no reason, huge busty chicks, and even a loli! What more can you ask for? 10/10\r\nEnjoyment: had some good faps, saw some tits and lesbian scenes, OBVIOUSLY I ENJOYED!!10/10\r\nOverall: Good appetizer before i go watch some real porn/hentai. 10/10\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nWell, I think it was quite obvious that everything I wrote above were just jokes, or is it? Hagure Yuusha no Estetica seemed like a very promising anime when I first saw it. Now that i’ve watched it though, i’ll have to say that judginga book by its cover is a very fitting saying as to what this anime is. I was utterly disappointed as to what is has become, as it had a great concept and could’ve been a good anime. But what exactly went wrong? \\n\\n\r\nStory: This is the biggest fault of the anime. I remember when I first read the description of this anime from a website. It says that “Hero defeats bad guy. Good triumphs over evil. The end. Or, at least that's how it usually goes. But what happens after the hero goes home? Our hero, Ohtorizawa Akatsuki, is about to find out that sometimes the greatest adventure starts once happily ever after ends.”. Now, with a description like that, I couldn’t help but be curious. At first, I thought that this could probably be the setting of a good comedy, or maybe he hasn’t really defeated the demon king and that this would become a good shounen anime. After I watched the first few episodes though, I realised that I was completely wrong. While I was watching the first episode, the first thing that hit me was “what in the world is this guy doing, stealing panties and stuff?”. Of course, I was ok with that, as i’ve seen a lot of anime with those kind of stuff. Then somewhere in the middle of that episode, some girl with huge, uncensored tits suddenly appears out of nowhere. Of course, I also wasn’t fazed by this, as I thought that “ok, i’ve seen this somewhere before. Ranma ½ did some titty flashes too but it turned out as a good anime.”. But as i got deeper into this anime, I realized one thing. THIS IS NEITHER A COMEDY NOR A SHOUNEN ANIME, IT’S A DAMN ECCHI ANIME! Ok, so it is an ecchi anime, i’ve watched some ecchi animes, but this one is just terrible. It has an absolutely terrible plot, or it doesn’t have an actual plot, for that matter. It seems that whoever made this anime just makes a couple of scenarios that will lead into either the main character grabbing and flashing some tits and stealing underwear. Action, which was supposed to be its main theme, was just used as an excuse to make the female characters wear skimpy outfits and FUCKING BIKINI ARMOR. In other words, instead of using its potential to become a great anime, it just resorted to fanservice and tits to hook its viewers. Although it does have an actual plot, which is that some secret organization is planning to do nasty stuff with the main character right in the middle of it, it just becomes second priority for the people who made this crap, as it seems that they try to add ecchi even in the most serious scenes. I mean seriously, so the lead main character got poisoned and is losing body heat. Sounds like a serious situation? Well, what does female lead character do? SHE STRIPS AND HUGS THE MAIN LEAD CHARACTERS, THAT’S WHAT! So yeah, in conclusion, I would give this anime a 3/10 for the story for reasons that I should have explained clearly above.\\n\\n\r\nAnimation and sound: The only good thing about this anime. The animation was smooth and clean, the mouth syncs properly with the voice and the OP and the background music was good enough, although nothing special. This is the only criteria that I could give a 7/10, as it is neither fantastic nor mediocre.\\n\\n\r\nCharacters: I don’t think that there is a need to even discuss this. The characters are just about as interesting as a potato, or a rock as not make it sound so degrading for the potatoes. They are just pathetic excuses for the makers of this anime to make ecchi scenes. I mean, every girl in this series have like F-cup boobs, with the exception of one Loli. Heck, they even made a background story for the main character, that he was trained in things like finding and fitting the right size of bras for concubines. Since there really isn’t much to discuss about this criteria anymore than what is mentioned above, I would just give it a 2/10 and get it over with.\\n\\n\r\nEnjoyment: Unlike my joke review, no, I didn’t enjoy this anime. There is no story to enjoy, characters are very boring, and it is an utter waste of time. I give it a 1/10.\\n\\n\r\nOverall: Very rarely do I give a score below 6 to any anime, but this anime doesn’t deserve anything higher than a 3, so I would give it a 2/10 for being a complete waste of my time. \\n\\n\r\nIf you have read the entire review and are not mentally retarded, then please don’t watch this anime as it is a complete waste of time unless you have some other plans. :ifyouknowwhatimean: DAMMIT, I WANT 240 MINUTES OF MY LIFE BACK! \\n\\n\r\nThank you very, very much for reading this review. If it has helped you in any way, please leave a comment on my page. Now, if you are one of those people who think that this anime is great, then do post a comment on my page so I can save you from your own stupidity. Anyway, thanks for bearing with me and reading my entire review :))\\n",
            "date": "2012-10-19T07:09:00+00:00",
            "helpful_count": 71,
            "mal_id": 75309,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463167.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nateal",
                "username": "Nateal"
            },
            "url": "https://myanimelist.net/reviews.php?id=75309"
        },
        {
            "content": "I never had much of an affinity for big breasts. I find myself to be more of an ass man. Hagure Yuusha no Estetica had both however.\r\nI can't say I had high expectations for Hagure Yuusha no Estetica, it really falls flat on its face plot wise like most other series' in the ecchi genre. It was plagued by an abundance of fast selling nudity fan service.\r\nI have to admit the exposition got off to a fast start. The concept of people crossing different dimensions and learning skills from other worlds isn't a new one.  The cast centers around a school specifically made forthem to flex their abilities from the other worlds, essentially they are further trained to be soldiers for different governments. The school has a caste system based solely on their different abilities and they are placed accordingly, A-class being the highest. The plot was pretty much what you would expect from a school setting: character interaction, a beach episode and a little this and that. Rushing an opening like throwing a couple of kids into this type of school probably wasn't the best move. Opening the audience up to additional information about their alternate dimensions would have been insightful.  However, I feel with no real conflict resolution this opened up for more seasons.\\n\\n\r\nI found the plot itself to be boring after the first couple episodes. It wasn't that it was bad it was just predictable.\\n\\n\r\nA majority of the characters had a fast introduction and the plot got off with a fast start. Miu and Akatsuki are immediately placed into B-class, with a promise of advancement to A-class. But bone heads will be bone heads and Akatsuki tried to pick fights with everyone in sight. He manages to offend almost every person he comes in contact with. He sets his sights on beating the student council and everything builds up around this concept. In the other world they plot on killing Miu to suppress her people and that takes up the last few episodes. In the end good guy wins and bad guy losses. Like I said before, it was just too typical and it ended up being boring. More focus could have been given on a Akatsuki and student council relationship rather than miix in cross world plots.\\n\\n\r\nTo me a majority of the characters were duds, most of the episodes were centered around Akatsuki the macho main who isn't afraid of copping a feel.\\n\\n\r\nI didn't find myself liking any of the characters, the only notable one would most likely be Akatsuki. I would categorize this under harems and like most harems the female leads have an array of different personalities. Its a simple character formula so it doesn't stand out. You have a macho lead surrounded by bishoujo or pretty girls and he slowly wins over their hearts one by one. Aside from his unique talents and over the top mental and physical prowess he is a standard lead, so its fair but not exciting. Simply put, too much attention was given to him.\\n\\n\r\nI felt the studio tried to animate the battles but they seemed to focus more on the fan-service and this derailed the series for the most part. The sound effects for some of the spells being cast and battles didn't feel like they fit either. You probably found yourself drooling over Miu or some other chunky breasted girl. The studio did a fair job at character animations and scene settings. I don't really have much to say about much of either the scores or animation.\\n\\n\r\nThis killed some time but ultimately it just wasn't good enough.",
            "date": "2012-09-23T00:15:00+00:00",
            "helpful_count": 51,
            "mal_id": 73003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=73003"
        },
        {
            "content": "\"Anime was a mistake\"\r\n-Hayao Miyazaki\r\nHave you ever wanted to know exactly what happens after the hero slays the enemy and saves the day? Well, Studio Arms (Elfen Lied) attempted to tackle this very question with their 2012 adaptation of the light novel, Aesthetica of a Rogue Hero. With a rather unique premise as a backbone, I was very curious to see what this series was about. Unfortunately, what followed was a lewd, generic insult to anime fans everywhere, with more breast development than character development. Join me as I chart the fanservice waters and explore one of the worst anime I’ve seen to date.\r\nThe storysounds promising from the start. It begins with our conceited, overpowered protagonist Akatsuki leaving a foreign land to which he was summoned to defeat an evil Dark Lord. Instead of taking home a trinket as a souvenir for his efforts, he decides to go a few steps further and kidnap the vanquished Lord’s daughter as his own personal “consolation prize” (first indicator that this dude’s probably an arrogant prick). Once they return to Earth, he and Miu are “forced” to join BABEL, a school focused on extracting and enhancing the skills Akatsuki and others learned during their time in the foreign land of Alayzard.\\n\\n\r\nNow I’ve never really delved into the ecchi genre, so I figured Aesthetica would be a decent place to start, given the cocky nature of the main character. The main problem is that the writers spend an unnecessary amount of time justifying Akatsuki’s lecherous actions, that it amplifies the perverted nature of the show. If he grabs a girl’s breasts, he’s just trying to show her how to make use of cleavage. If he steals a girl’s panties, he’s just trying to prove a point. These moments are so prolific early on that you end up not taking the show seriously. The amount of ecchi moments are plentiful too, with a unique mix of lesbians, random crotch-grabbing and heinous nudity to go around. And some of the scenes I was downright ashamed to watch, including an excerpt involving Akatsuki using his divine powers to cause three girls to pee themselves to prevent one from being embarrassed. I can’t even make this stuff up. I can see why the light novel is so popular around Japan…\\n\\n\r\nMost of the show’s 12 episodes are eaten up exploring the generic cast, and by the time the real story comes into play near the end, Aesthetica has already lost its steam. Any inkling of hope I had for the serious elements to play out were eradicated by the copious amounts of fanservice plaguing the anime’s beginning. The overpowering nature of Akatsuki also eliminates any feeling of drama throughout the series. Much like Sora and Shiro from No Game No Life, the battles are over before they begin, leaving much less opportunity for suspense from a viewer’s perspective. Most efforts at backstories are waived off to promote more ecchi scenes or are truncated due to the series’ short run. Considering it’s been five years since Aesthetica’s release, I don’t see a sequel in the works either, so the five of you out there that actually enjoyed the show can wait with bated breath.\\n\\n\r\nWhen I first saw Akatsuki, I was delighted. Finally we get a protagonist who isn’t shy around women and doesn’t get caught up in melodramatic inner monologues! But, it only took an episode for him to show his true colors, and before long I despised his presumptuous personality. Egotistical doesn’t even begin to describe him, and you could even go as far as to call him sexually sadistic. Akatsuki is so much better than everyone else in the show that they seem almost irrelevant. Generic iterations of various tropes are scattered throughout Aesthetica, leading the viewers to feel cheapened by the lazy writing. Miu has her fair share of, um well, “development” (aka, tits) but again this is overshadowed by the extraneous amount of time spent on Akatsuki’s perverted acts. The whole show is like some kind of messed up harem where instead of having girls fawning over him, they’re forced onto him against their will. But instead of hating him for what he does, he always finds a loophole excuse or convenience to make it okay. It’s almost as though the writers are saying to their viewers, “It’s okay to grope women as long as you make up a good reason!” Truly disgusting.\\n\\n\r\nThe animation is a constant reminder of what Studio ARMS is not known for. It’s one of the same reasons I didn’t care for Elfen Lied. Everyone that’s not a main character is a pain to look at, as the models are a generic wreck. Even the protagonists leave a lot to be desired in the art department. The action scene’s animation was lackluster at best, and had some framing issues. Honestly, the most accurate part of the entire anime is the nudity. Depravity at its finest. The animation in the OP reminded me a bit of the old Dead or Alive Extreme Volleyball games with all of the breast bouncing. I should’ve known then to run for the hills.\\n\\n\r\nThe music in Aesthetica is reminiscent of something I’d hear in a cheesy DDR ripoff. It’s BAD. It’s almost as though the creators went down a sorted list of cheapest to most expensive when it came to purchasing the musical rights of the tracks here. At least the ecchi-ness helps drown some of it out. The ED is better, but still misses the mark for me. All of these begin to blur together after awhile. On a positive note, the English dub is actually pretty good. It incorporates some better known actors and is casted well. Some of the translations were altered to make them a bit more Westernized, but nothing really detracted from the scenes.\\n\\n\r\nTo make a long story short, Aesthetica of a Rogue Hero is NOT a good show. It’s inexcusably perverted, lacks any character development and has a story that fizzles out faster than a middle school relationship. I guess if you were really bored or just looking for a terrible series to put things into perspective, then this could be a potential option for you. Just make sure you come in without any other expectations than tits. Lots and lots of tits. As always, thanks for reading!\\n\\n\r\nStory-3\\n\r\nArt-3\\n\r\nSound-2\\n\r\nCharacters-2\\n\r\nEnjoyment-2\\n\r\nOverall-2.3",
            "date": "2017-02-22T12:09:00+00:00",
            "helpful_count": 31,
            "mal_id": 241145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=241145"
        },
        {
            "content": "When entering the ecchi genre, you generally know just what you’re going to get: a heavy reliance on fanservice and a ton of slapstick and sexual humor. Obviously, it doesn’t usually make for a compelling and intelligent show. But that’s not to say that all ecchi anime are bad. In fact, some ecchi anime can end up being pretty funny and charming; with at least a few characters that don’t make you want to shove knives in your ears every time they open their mouths. And then there’s the other kind of ecchi anime. It’s the kind that is self-aware if its suckiness and triesto compensate with over the top, sometimes fetishy, fanservice that straddles the line between ecchi and hentai. In the end, you won’t remember its story, characters, or humor. Instead, you’ll only remember its shockingly inappropriate fanservice that practically screams “trying too hard!”\\n\\n\r\nCan you guess which type Hagure Yuusha no Aestetica is?\\n\\n\r\nHagure Yuusha is a tale of silliness, fanservice, and magic. Its conception was handled by studio Arms, perhaps most (in)famous nowadays for their other sexually charged series Ikkitousen and Queen’s Blade. Hagure Yuusha shares many similarities with both of these series. \\n\\n\r\nThe story begins where the typical fantasy tale usually ends: at the end of an intense battle with the demon king. After our hero Akatsuki Ousawa’s triumphant victory, he takes the demon king’s daughter, Miu, and heads back home to his own dimension. Now fully equipped with magical powers, he and Miu are sent to a special high school for magic users named Babel. Dramatic duels with mysterious opponents out for Ousawa’s blood, magical mayhem, and high school hilarity ensue. \\n\\n\r\nTo be honest, Hagure Yuusha had an excellent setup. Its story had a vast amount of potential with a world whose lore and politics are completely pushed to the side in favor of panty shots and tits. The creators had a lot of room to work with the world but they refused to. For example, we don’t learn much about the differences between the dimensions. Apparently Babel is a special school where kids returning from another dimension are stuffed so they can be monitored. Therefore, we can assume that Akatsuki’s world is one where magic users are the exception, not the rule. Yet we never hear about the other dimensions that the other characters come from, or how their worlds influence their personalities or mannerisms. And what of Akatsuki’s relationship with Queen Risty? None of this is ever expanded upon.  Even if the creators had half-assed some backstories and explanations on the lore and world, it still would have been a much better show than what it is now. But instead we get tits. It’s one thing to give bare bones explanations when it’s an ecchi comedy, because then you expect mostly humor and not much else. But Hagure Yuusha sporadically jumps between wanting to make us laugh, wanting to turn us on, and wanting us to take it seriously. But the plot resembles something from a really bad JRPG, so when it wants to be taken seriously, its pretty hard for the viewer to do that.\\n\\n\r\nThe characters don’t fare much better either. They are all extremely bland and boring, making it very hard to care about them or this show for that matter. Akatsuki Ousawa is indeed the one who steals the show here, though that’s not really hard when you have such a pathetic cast. He is lauded as a “badass” and “refreshing” simply because he’s not some wimpy male lead and can actually back up all the smack he talks. True, he isn’t your typical “super skinny or super fat loser who plays video games well, then has girls throwing their panties at him” archetype. But that doesn’t mean he’s a good character. He is one dimensional, obnoxious, and showcases throughout the anime that he may even be intellectually inept.\\n\\n\r\nTake the second episode for example. He and the other female protagonists get locked in a gym closet. Kuzuha has to pee quite badly. They say out loud that she could use earth magic to make a toilet. Instead, Ousawa uses his magic mumbo jumbo to make the other two girls feel what Kuzuha is feeling and really have to pee too, because…because. After biting Kuzuha’s ear, all three girls pee themselves. They then proceed to beat him up. Honestly, this is probably one of the most memorable scenes in the anime, but for all the wrong reasons. Why the hell couldn’t they just make a toilet like they said literally a few seconds ago? Oh right, omorashi fanservice.\\n\\n\r\nThen the justification used for his actions (“he made himself the bad guy so I could make friends!”) is almost insulting to the viewer’s intelligence. Remember kids, if you want to make friends, pee yourselves in unison! \\n\\n\r\nFace it; he’s only a small step above your usual wish fulfillment protagonists. The only thing that puts him slightly above the typical wish fulfillment protagonist is, once again, that he’s not some frail looking little flower that is overpowered for some inexplicable reason that defies logic. \\n\\n\r\nThe female characters aren’t much better. Miu is a girl who is very shy about her body, but somehow always ends up groped or exposed. It would have been interesting to learn about her backstory. Something worth noting is that she’s a demon but looks human. Could her mother have been a human? Clearly the creators thought, “Who cares about that! Let’s get her naked!”\\n\\n\r\nKuzuha is the loli class chairman and Chikage Izumi is the raging tomboy lesbian. Her actual introduction in the show is her molesting another female student in a gym closet. We learn little to nothing about these characters. The rest of the supporting cast are unimportant and hardly worth mentioning. Their only real purpose is to be curbstomped by Akatsuki and nothing more.\\n\\n\r\nIn addition to being one dimensional and boring, the character’s motivations and actions aren’t really given reason. Nor do they make any sense. One example: Akatsuki kills Miu’s father. Why in the world does she not hate him? Why does she end up falling in love with him? It’s also hard to pinpoint a character’s motivation when we get little to no backstory on them or when they have such boring and flat personalities. The characters don’t seem like much more than dolls.\\n\\n\r\nWith all this disappointment, we should at least be able to turn to the action and violence for comfort right? Wrong. The animation is pretty bad, looking quite dated for its time. The character’s heads look far too small for their bodies. And they all look like pallet swaps of each other with different hairstyles and varying breast sizes. The coloring looks incredibly flat and unreasonably bright. The fight scenes are lazily animated and unexciting. Couple that with the fact that Akatsuki dominates every opponent fairly quickly and you’ve got yourself some boring fight scenes. The music is also nothing spectacular, ranging from mediocre to bad.\\n\\n\r\nOverall, this show is pretty terrible on all counts. It had so much potential to be something excellent. Or at least decent, if they had just tried a little. Or it could have been one of those ecchi shows that you know isn’t all that good, but it ends up being humorous and charming nonetheless. Unfortunately, Hagure Yuusha isn’t funny, it isn’t endearing, and it’s just not enjoyable. It’s like a bad JRPG in anime form that tries to pull off a laughable plot with a straight face. Or a bad hentai without the sex. The only thing you’ll remember when you’re done are the inappropriate fanservice scenes, because those definitely push the envelope.\\n\\n\r\nThere are better ecchi anime out there. There are far better action anime out there. There is also porn, which has sex, which Hagure Yuusha acts likes it’s going to show you but never does. \\n\\n\r\nGo find those splendid titles and leave tripe like this where it belongs.\\n",
            "date": "2013-05-31T15:32:00+00:00",
            "helpful_count": 31,
            "mal_id": 99159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1565209.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LuckyKrystal",
                "username": "LuckyKrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=99159"
        },
        {
            "content": "Finally!!!!!!!!!!!!!! a anime where the main character isn't a cry baby, or a weak punk who doesnt know how to use his power. The main character is a boss, he is already strong, he knows he is strong and he pretty much kicks every ones ass. He is not shy of girls so you will see him act more manly instead of having gallons of blood squirt out his nose. This is pretty much a dream anime come true, need more like this.",
            "date": "2012-09-03T11:20:00+00:00",
            "helpful_count": 27,
            "mal_id": 71507,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1177091.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NegativeD",
                "username": "NegativeD"
            },
            "url": "https://myanimelist.net/reviews.php?id=71507"
        },
        {
            "content": "Here are my initial impressions of this anime Please note that my score could go up/ down as the series progresses.\r\nThe story could become something interesting. After defeating the 'bad guy' of this medieval type world of magic, Akatsuki goes back home to a more modern scenery, taking a girl Miu- the daughter of the demon king with him. Another mystery set up is the organisation Babel, which is supposedly set up to protect the young returning from another world and a prophecy which concerns Akatsuki. \r\nThe characters are also interesting, especially the protagonist Akatsuki. It's refreshing to see the main guy taking charge ofthings. Miu is also an interesting character, it reamins to be seen why Akatsuki took her with him and what role she will have. She doesn't seem to be the typical passive character that needs to be saved constantly, but we'll see.\\n\\n\r\nI have no problems with the art, it's decent, but i wouldn't say it particularly stands out for me. The voice work is above average and it's a great cast i would say. The music is okay, the opening & ending tunes not really to my taste, but it sets the tone quite well.\\n\\n\r\nOne of the main issues with this, is the amount of fanservice, it may not suit some people. From just the first episode we already see Akatsuki taking the bras of several maids and a lot of shots of Miu's body and chest. I have a feeling it'll only increase. I am only worried because this story could be something worth watching, but sometimes i feel fanservice can lower the impact and quality.\\n\\n\r\nWill i keep watching? Most likely. The first episode has definitely shown a lot of potential in introducing the characters and the story. The question is will this become an awesome anime or will it be let down by the fanservice factor?",
            "date": "2012-07-06T08:48:00+00:00",
            "helpful_count": 22,
            "mal_id": 65483,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211009.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/chihayatohru",
                "username": "chihayatohru"
            },
            "url": "https://myanimelist.net/reviews.php?id=65483"
        },
        {
            "content": "Story 7/10: This starts out with a another main protagonist (which all harem anime has), and he is fighting stuff, so then finds a girl or to be exact offered a girl so guidance, because he felt sorry for her (won't tell you why), then he travels back to his own world and this is based again where they recruit \"teenaged\" soldiers and put them in \"high school\" quite frankly i like this idea of a set up, story's nothing new and there a flashbacks to cover when happened before the first episode.\r\nArt 8/10: The art i found pretty good or so, but here andso, i don't know if this is in art, but you have a big chested pretend little sister, the eyes look like the anime tokimeki memorial but the rest is art is fairly basic for 2012 \\n\\n\r\nSound 8/10: The sound effects are quite good considering this is a anime with magic, action and swords and stuff, but the op and ed are not really quite catchy\\n\\n\r\nCharacter 9/10: You got some heroines listed right here: You got a pink haired girl who is like a little sister to the main protagonist and she has big melons (lol melons), you got a girl younger than her grade but thank god not too young and she's duh flat chested, you got a girl who's a lesbian, and you got a student council member who swears to get revenge on the main protagonist, Now the main protagonist is actually in my top 10 characters, he's loveable, he's a cool character and he's a bit of a perv but not the ugly ones but the cool ones example Usui, Takumi from kaichou wa maid-sama!, he is probably the most strongest character and he can be a ladies man or a man who gets scolded by girls. \\n\\n\r\nEnjoyment 9/10: This anime has some laughs, ecchi scenes (actually a lot) and some action, if you find females getting embarrass as a laugh or something perverted than that counts as comedy (it does for me), fan service heck you find a lot of that in there, action yep\\n\\n\r\nOverall 9/10: I gave it a 10 in my list but for you guys you probably want to give it a 9/10, it's funny, enjoyable and has fan service so i recommend this to harem, ecchi, comedy and action lovers, you won't say GOD THIS ANIME IS THE BEST but you remember it in your year of 2012",
            "date": "2012-08-13T11:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 69649,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1294513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mech66",
                "username": "mech66"
            },
            "url": "https://myanimelist.net/reviews.php?id=69649"
        },
        {
            "content": "The most important thing to mention to people before they begin watching this anime is that there is no season 2 and that the anime stops very abruptly at episode 12. (At the time my thoughts were \"OMFG did the anime really just drop dead somewhere in the middle/beginning of the story?\") Luckily there is some of the translated light novel on baka-tsuki if you like reading.\r\nThe second most important thing is that it is certainly an ecchi anime. There were so many bras, panties and breasts that I'm amazed it's not hentai. \r\nStory\r\nI initially thought that it was solely a parody show making funstories that start with a hero being summoned to another world (it also included the stereotypical Demon Lord too). Beyond that parody the premise seemed interesting and the story might have been able to develop further, but everything was thrown to hell after the anime's untimely demise at episode 12. I'm still bitter and in a partial state of shock having had the anime end in the middle of nowhere.\\n\\n\r\nArt 7/10\\n\r\nThe art can be divided into three different types.\\n\r\nScene 1: Underwear, Girls trying to hide their naked bodies, Akatsuki(MC) doing lewd sh*t\\n\r\nScene 2: Glowing magic circles for casting spells\\n\r\nScene 3: Akatsuki punching things or whacking things with his hefty Demonlordsword\\n\\n\r\nSound\\n\r\nAfter listening to the soundtrack the music was pretty well done. The quality was consistent throughout the entire show. My favourite song was Kichiku Panic from the beach episode. I recommend listening to a few songs from the soundtrack on youtube. Usually, anime beach episodes are a sin against all people with functioning brains, but it was probably the best beach episode I have seen.\\n\\n\r\nCharacters\\n\r\nThe characters are rather mediocre except for Ousawa Akatsuki (Protagonist) who managed to dazzle me with his outrageous testosterone infused muscles, friendliness, kindness, and diabolical ecchiness. If Akatsuki wasn't such a nice guy at heart and rippling with composed bold style I would condemn him to hell for his crimes against defenseless girls. He isn't the retarded silly type of pervert that is the norm for ecchi shows. He's some kind of frightening, diabolical, ecchi, domination machine that girls can't escape from.  \\n\\n\r\nThe females are just typical weakly manufactured harem girls that didn't get enough development because the anime ended so suddenly.\\n\\n\r\nThe males all received less character development and are very shallow/static.\\n\\n\r\nEnjoyment\\n\r\nEnjoyment is the ultimatum I suppose. The enjoyment that I take away with me after having completed 12 episodes are the following few things\\n\r\n(1) An interesting premise to think about\\n\r\n(2) A few decent small battles and action scenes\\n\r\n(3) A new perspective on ecchi protagonists and some laughs\\n\\n\r\nThe anime did leave me wanting more, but there is no more. There probably never will be. RIP Hagure Anime\\n\\n",
            "date": "2015-08-21T19:13:00+00:00",
            "helpful_count": 14,
            "mal_id": 196719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441660.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Scholek",
                "username": "Scholek"
            },
            "url": "https://myanimelist.net/reviews.php?id=196719"
        },
        {
            "content": "I decided to watch this anime on a whim. \r\nI liked the picture I thought it was pretty bad ass so I started watching it.\r\nI still don't know what made me watch all 12 episodes.\r\n First episode was actually quite promising; We had flashbacks, very busty young girl, quite good looking hero, and somewhat promising story.\r\nSecond episode was fair enough too.\r\nAfterwards.. I think that my stubborn nature made me watch it until the very end, but it was very painful. Nothing in this anime made me say that it was at least decent to watch. \r\nWe have once again hero who defeats everything,not to forgetvery powerful. We have big breasted women in entire anime,I mean everything I see is breast breast and some more breast. Oh and panties.\\n\r\nI mean, I don't have anything against that, but not in that amount.\\n\r\nI am not even thinking about watching side story they made.\\n\r\nMajority of the things from the beginning that made the story interesting was left forgotten and never returned to.\\n\r\nThat was mainly the reason why I didn't like it at all. It could be very promising by my  opinion. \\n",
            "date": "2014-05-11T09:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 142997,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768613.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ame_Gasai",
                "username": "Ame_Gasai"
            },
            "url": "https://myanimelist.net/reviews.php?id=142997"
        },
        {
            "content": "Though the series is still airing this anime is extremely well done, it is one of the few ongoing series that I've actually bothered to look forward to and remember to watch as it comes out. \r\nThe main character finally is a strong lead who does as he pleases instead of a weak, clueless guy, who in almost every episode (assuming your watching a show where you don't have to wait till the last three episodes for the story to progress) is to scared to do anything though it is obvious he has the chance (I dont know about you but hesitation when the momentis right has never happened to at least 99% of guys and takes me out of the story)\\n\r\nin short (besides that the main character getting away with almost no punishments and the obvious fictitious parts) this anime can seem realistic and doesnt leave you thinking \"I could have done that better\" \\n\r\nA+",
            "date": "2012-08-23T17:26:00+00:00",
            "helpful_count": 12,
            "mal_id": 70705,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/inumaster10",
                "username": "inumaster10"
            },
            "url": "https://myanimelist.net/reviews.php?id=70705"
        },
        {
            "content": "When this anime first came out, I read the synopsis for it and thought this is probably only going to be a meh anime. I wasn't going to watch it at first but 3 month after I first heard of it I decided to check it out on one boring school day with nothing to do but to play with my phone. I fell in love with this anime the first episode.\r\nThe thing that caught my eye about this anime is the main character and the concepts of the story. The main character is just....awesome. He is strong, smart, understanding, confident, relaxed, funny, fun, perverted,open minded, serious, honorable and most important of all selfless. Analyzing him makes it pretty epic. He is like the title suggests a rogue hero, and a true hero like the anime suggests. All he wants to do is to make people happy and protect innocence (which i feel is represented by girls in here) from everything that dare make it unhappy. He doesn't need gratitude. He gladly shoulders this burden to protect innocence knowing he will have to make great sacrifices (suffering others pain to help them, taking on all the problems by himself, physical injuries etc.) and the only reward he will get is happiness of others. His goal is realistic understanding that he is only a man doing only as much as he can physically do but still always testing his limits to improve himself so he can do more. Rules or laws do not stop him. He knows what is more important and must be done. He is my hero now. He is everything that I always try to be so I guess that is why he appeals to me so much when I watched this show.\\n\\n\r\nThe setting is pretty awesome. Its society has both magic and technology. The structure of government is uniquely built with a feeling that babel is has all the power. It also includes other dimensions which are medieval by appearance and has their own government. The dimensions seem to know of each other's existence which I thought is interesting to see how they would interact. The concept leaves much to wonder on and therefore a lot of mystery and potential. This is still only season 1 and I can't wait for season 2.\\n\\n\r\nThe story itself is quite entertaining. The story has a lot of little everyday events that you can relate too. I found them funny yet surprisingly on topic. The story topic is suppose to be about the aesthetics of a rogue hero, or the appreciation of the concept of a \"rogue hero\" and from the 12 episodes I feel I had great appreciation of what a rogue hero is. The only thing that could be better is if they move the main plot along a little faster but it is too hard to tell at this point to know if they are or not. Need to know how relevant the information they are showing in season 1 are to the plot to know for sure.",
            "date": "2012-11-13T15:19:00+00:00",
            "helpful_count": 12,
            "mal_id": 77411,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1651743.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hobosontrains",
                "username": "hobosontrains"
            },
            "url": "https://myanimelist.net/reviews.php?id=77411"
        },
        {
            "content": "I could go into a lot about this series, but I wont. It's not worth it.\r\nVoice acting was fair, Music was ok, had good Opening song. Art and animation was find. Now let get to the point, skip this anime. There are ton of anime out there, that can give better enjoyment then this anime could dream to. To sum it up what this anime has to offer is basic borderline hentai and some RPG elements. The fan serves is horrible , I usually don't mine it at all but in this one it take way from what little story this anime has to offer.Characters, I'll give that the main was some what interesting but rest of the cast has been seen and done, nothing special or interesting about them. I really had hard time watch this one all the way through, it's was pretty boring. But worst part of this anime is plot. The person who wrote must of been going for dual story with fantasy world plot and real world plot. Which would been fine they choice focus one at time. When I watch the first episode I felt throw into story, which would be fine if they had give some explanation later into story but that never happen. When you get to the part about the reason these kids end up into other worlds and how when they come back they are draft as student become soldiers. It this part of plot that is totally fuck up. It make no sense and seem to make less sense as go through the anime. Next major issue is that anime can't seem to stick to the two major plot at all and seem to go through form one side plot that has no important what so every to story, to next meaningless plot. You have episode where he get motorcycle, that that point, so he can look cool not that actually important to plot. The series in last 3rd jump back into one of the major stories but at this point I could care less because they didn't build the character or the conflict for me to get behind it. So sum up the story was is basically role up piece of garage. Only reason I watch series all way through, so I could used the element I did like for re-wright in my head. From the original there was not much to go on. So over all this series has element that been done, useless fan serve, and can't seem make up mind about which plot it want you to fellow. In other words, this skip this anime. It doesn't deserve a second season. Total Bomb.",
            "date": "2013-04-02T23:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 92169,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26612.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SamMan",
                "username": "SamMan"
            },
            "url": "https://myanimelist.net/reviews.php?id=92169"
        },
        {
            "content": "I will say it right now, simple and clear. This show is fine but its main character is not. I suspect the main character is the reason this show has garnered popularity but please listen to my points when I get to him.\r\nStory:\r\nWell as of right now there isn't too much to talk about here. The setting is decently original with people disappearing into fantasy worlds only to reappear with their powers intact. This part of the story is glanced over so I doubt we'll be going any deeper into this element of the show, which is a shame because it's really the only originalplot point the show has. The plot point itself is probably no less than an excuse to have people gain powers in the real world.\\n\\n\r\nSadly nothing else about the story has remotely piqued my interest, which is not good for a series that's 6 episodes in. Generally a show should have some kind of hook on the first or even the second episode. Hagure Yuusha no Estetica is failed to deliver much plot substance at all and the hints it does drop are both uninteresting and half-assed.\\n\\n\\n\r\nArt:\\n\\n\r\nThe art is of course, great. Many shows today have really done a fantastic job with keeping all the different anime very appealing to look at. I can watch a few episodes and not notice any kind of glitches or hiccups which is nice.\\n\\n\r\nThe spells are pretty generic, using the same spell circles you see very where now-a-days but it's not necessarily a bad thing. The effects that accompanies the spells are also very well done which at this point is to be expected.\\n\\n\\n\r\nSound:\\n\\n\r\nSound is a very similar story to art. The standard for it is very high and most anime reaches it with Hagure Yuusha no Estetica being no exception. The sounds and music fits the scene nicely however I have yet to notice any particular tracks that I like.\\n\\n\\n\r\nCharacters:\\n\\n\r\nNow this is where it gets really frustrating. I know everyone loves the main character because he's the exact opposite of those wimpy characters we frequently get. I understand that completely, wimpy characters are unappealing and annoying. However this is NOT and excuse to do what Hagure Yuusha no Estetica has done.\\n\\n\r\nAkatsuki: To put it bluntly, he's a Gary Stu (if you're unfamiliar with the term, please reference Google). He's like an OC (original character) straight out of a bad fanfic. He is much too over powered for his environment which can sometimes be entertaining if handled correctly. It is not handled at all well in this anime. Akatsuki flaunts his power many times over the past 6 episodes, with every successive feat becoming more predictable than the last. Sadly this makes his antics boring and stale. He's a one-trick-pony that just mows through challenges which is boring to watch. Hopefully the fights will be less one sided when some stronger enemies come forth but this also brings up my next point.\\n\\n\r\nThe show itself is a god damn love letter to Ousawa. The show basically just runs on scenes that make Ousawa out to be the mega bad-ass. A good example of this is\\n\r\n*SPOILER* \\n\r\nin episode 6 where he inexplicably appears out of no where on the roof top to save the little girl from the bad guy.\\n\r\n*END SPOILER*\\n\r\nWe get nearly no exposition or any real form of explanation as to why he was there. The show just wants us to believe he either appeared from thin air or was somehow in the vehicle when it got on the roof. Like I said, no exposition. It was just an excuse to give Akatsuki another \"I'm a good guy\" scene.\\n\\n\r\nThe final point I have is that he lacks a strong personality. Sure, he can crush everything under his pinky, but other than that it's really boring. The only interesting parts of his personality are extremely rushed and very poorly placed. Examples of this would be\\n\r\n*SPOILER*\\n\r\nwhen he become the \"reverse\" bully to the red haired character (I'm sorry, I can't seem to remember his name). The whole thing about him being this self imposed judicator would be a great character trait were it developed a little more. We know nothing of why he feels that bullies should be punished, which in turn makes it come off as a poorly chosen trait with the sole purpose of \"making him look cool\".\\n\\n\r\nAnother example I will bring up is his anger towards the mentioning of his father. It comes out of no where, is only brought up for a second and does little to get me interested in the story of his father. Again this could be an interesting character trait if handled differently, like in a time where he really couldn't get something done. It would let us have at least a little bit of insight into why he needs to surpass his father and why we should care. But no, like everything else he just skips right through any sign of challenge. Which is another thing, we don't know why Akatsuki can ride the bike now or what changed except that he got slightly angrier. There was virtually 4 minutes of build-up and *boom* suddenly the thing that floored him 2 minutes ago was suddenly obeying his every command.\\n\r\n*END SPOILER*\\n\\n\r\nIn closing, Ousawa is much like what you'd find a grade school student day dreaming about with his friends. Remember those conversations you had when you were a kid and trying to think of a \"cool\" character? \"He should have like these razor sharp teethe that can rip through anything!\" \"YEAH and he needs flames on his back that burn everything a mile around him!\" \"And then he needs these big spikes on his legs that are indestructible.\" \"Then he needs red eyes that shoot lasers.\" \"He should ride around on this hover board too which goes like faster than light.\" That's generally how I assume the creation of Ousawa went, of course without the grade school ideas but with the same mindset.\\n\\n\\n\r\nKuzuha: By far my favorite character in the show. She's not only flawed in that she has emotional issues she needs to deal with, but her resentment of her situation is entirely understandable. These flaws make characters deeper the more a show wants to go into these ideas. In turn the character becomes much more interesting.\\n\\n\r\nMiu: She's your basic female protagonist, not that that's a bad thing. There's not much to talk about other than her troubles with her father and Akatsuki but I assume we will delve further into the topic as the series goes.\\n\\n\r\nChikage: She's interesting mostly because of a certain scene (you'll know it when you see it). She's basically just there to promote the echiness of the series which is fine.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nI really want to enjoy the series because it has potential but that main character annoys me so greatly. If he was handled at all better I'd easily put this show as a favorite for the season, but otherwise my enjoyment of the show is greatly hampered.\\n\\n\\n\r\nOverall:\\n\\n\r\nI can only give it a 6 because I do actually enjoy it but I notice myself clenching my teethe from time to time which is not a good sign. If you do in fact like the main character then that is up to you. Personally I just can't stand him.",
            "date": "2012-08-11T01:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 69391,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/940633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Deotay",
                "username": "Deotay"
            },
            "url": "https://myanimelist.net/reviews.php?id=69391"
        },
        {
            "content": "Hagure is a ecchi-based action/fantasy for those tired of wimpy, \"nice\" male leads. However, it is also a series only for those who can tolerate thin character development and a story trying to foreshadow a second season so badly that you might as well just wait until the next season comes out.\r\nThe story shares the dimension-travel theme of other shows such as Zero no Tsukaima and Astarotte no Omocha. The main difference being the lack of Rie Kugumiya and a much more blunt approach to the ecchi; the main lead here is strong enough not to be a victim of violent acts of retribution forhis openly perverse nature (though he displays it in a much more controlled fashion than the lead in Sora no Otoshimono). However, this refreshing change of lead personality is just wasted on a wish washy plot line full of inconsistencies, plot holes, and purposefully-unanswered mysterious questions. If you're looking for a stronger male lead who is not afraid to express his perverse nature, look to Onizuka. If you're looking for just a male lead that can stand up on his own, Campione gives this series a run for its money as well. If you do somehow decide to delve into this series, be prepared for a very lackluster story line.\\n\\n\r\nAnimation:\\n\r\nWhile there isn't anything atrocious here, the animation isn't what I'd call good. The color scheme gives the series a slightly childish feel despite the story trying (at times) to portray a more somber mood. As for the characters, there's something about their facial styling that is off putting. As for ecchi, the main hero has the ability to undress female characters (almost similar to the protagonist in DxD's ability, though Akatsuki can remove articles intact). He also has the ability to control the flow of chi in people, and thus can basically \"control\" how people \"feel\". You can interpret that one as you see fit. Expect plenty of groping, bouncy parts, and panty shots.\\n\\n\r\nThere is a decent amount of action in this series, but the choreography is average at best and there is neither seriousness nor gore (dragon implodes upon death? what is this Mortal Kombat Annihilation?). The majority of the fighting is analogous to laser spamming in certain Gundam series; basically you see large swaths of colored energy being hurled between contenders.\\n\\n\r\nSound:\\n\r\nThe series has completely forgettable music all around. OP and ED are both action-sounding rock pieces, the ED being the slightly better of the pair. BGM has one or so unique pieces (for ecchi moments), but pretty much your standard fare.\\n\\n\r\nTo be honest, the only reason why I considered watching this was the outstanding list of VAs. Also to be honest, I have no idea how this show got so many good VAs signed on, as the characters are so cookie-cutter that none of the VAs even had a chance to drive any life into their roles. Kana Hanazawa voicing a very quiet, orderly character? Ami Koshimizu getting virtually three lines in the entire series? Marina Inoue in a tsundere role is probably the only one that was a good fit.\\n\\n\r\nStory:\\n\r\nAs mentioned in the intro, this series' setting is hinged on dimensional travel. In this case, kids are mysteriously transported to another world where they become RPG heroes, eventually returning to Earth with a wide variety of magical and physical abilities. These students are somehow gathered and placed in a school called Babel (of course we're not supposed to ask why or how). Our protagonist is one such student, who just returned from the other world having defeated the last demon king and taking \"ownership\" of the demon king's daughter (as the king's final request). The story follows Akatsuki as he and Miu adjusts to life at Babel.\\n\\n\r\nThe best way to describe the story is that it is analogous to DBZ had Goku started out at Namek as a SS3. There's just no point to it as the hero is already so strong that there is nowhere to grow. All the character relations and \"important\" friendships are meaningless as the \"hero\" ends up saving everyone. Every. Single. Time. To the point where one asks \"why even bother?\" The show tries to keep the viewer interested by occasionally hinting that there is a secret organization with potentially other beings at Akatsuki's level, but nothing ever comes from it other than hooks to try to get you to watch the second season- but if the first series is any hint at how well the production will go for the second season, please count me out.\\n\\n\r\nThe story starts out in a slice-of-life, episodic progression before moving on to the \"final\" arc starting halfway through the show. It builds to an eventual climax with an all-too-predictable outcome. The main plot line aside, there are just too many other subplots going on concurrently (the mysterious organization, occurrences in the other world, etc.) that are just thrown at the viewer as if we were some multi-core processor able to context switch seamlessly between subplots. Ranting aside, the execution of the story was overall significantly sub par.\\n\\n\r\nCharacter:\\n\r\nTo be honest, this ought to be a continuation of the rant from above, but I'll spare you and just say \"more of the same\". There are way too many characters thrown in seeming for the lolz, and the antagonist is so cliche that you'd have thought he came from something over a decade ago. All the characters (Miu aside) lack any depth whatsoever, almost as if the show is purposely hiding details. Character relationships also feel shallow, the deepest probably being Chikage's yuri feelings towards Miyu. As mentioned in the sound section, the great VA talent is truly wasted on these characters.\\n\\n\r\nValue:\\n\r\nSome may rate this series highly because of this section alone. I'll agree, the male lead is a refreshing change from the wimpy lot. However, he overshadows all other aspects of the show to such a degree that he single handedly undermines the story as well as the importance of the other characters. Watch this series only for the fan service; otherwise, be prepared to be disappointed.",
            "date": "2015-11-13T00:03:00+00:00",
            "helpful_count": 8,
            "mal_id": 203262,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203262"
        },
        {
            "content": "I've got to say that I really enjoyed watching the series, my only problem with it was that there were a few occasions that I found that the dialogue was a bit boring.\r\nThe fight scenes were great! The main character is a real badass, and knows it!\r\nI'd really recommend others to watch it!",
            "date": "2015-08-24T13:00:00+00:00",
            "helpful_count": 7,
            "mal_id": 196940,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4829791.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/stahlnacht",
                "username": "stahlnacht"
            },
            "url": "https://myanimelist.net/reviews.php?id=196940"
        },
        {
            "content": "Looking for a totally mediocre but enjoyable fantasy and action anime? well I think Hagure Yuusha No Estetica is for you!\r\nI went into this anime during the summer 2012 season with the normal expectation of a totally floppy and cliche harem and action anime...well it wasnt. In a way you had the makings of such an anime but in the end the main male protagonist and action scenes followed by a well thought out pacing for the storyline.\r\nThe main attraction for this anime is the main male protagonist, Ousawa Akatsuki who is a badass , strong, pervert and invincible. basically he is a main leadwith a harem with enough backbone and ability to defend himself as well. He stands out from the normal wimpy and weak MCs with a harem.\\n\r\nThroughout the anime , his heroics and basic ethics is something to be admired and enjoyed as he cruises through fights and challenges with a calm demeanor. \\n\r\nHis other quality would be his pervy side...where he can strip women of their underwear without them even realizing it. which makes him a totally pervert and entertain male audiences with all the ecchi element.\\n\\n\r\nThe circles of girls in his *Harem* , though i would say the romantic hints in this anime is pretty few with only certain girls showing obvious affection for him, the most obvious of which is his little sister, Ousawa Miu( not blood-related) and the tsundere vice president, Haruka. \\n\\n\r\nThe storyline is nothing really impressive...( you can read synopsis on MAL and you can guess the basic storyline once you start the anime). Like I said, the most interesting aspect of this anime is the Main star lead, Akatsuki and the pacing of the story. Every episode does just enough to let the story progress , though the occasional side episodes comes up, the progession doesnt really slows down to zero. The fight scenes were solid and well paced as well and most of all its BELIEVABLE and does not end off abruptly.\\n\\n\r\nTowards the end of the anime, you will see this anime is a genuine fantasy and action anime with a strong MC and would have found it totally enjoyable like me ;D though it would depend on your personal taste as well.",
            "date": "2015-04-02T07:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 184477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311221.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MinnaDess",
                "username": "MinnaDess"
            },
            "url": "https://myanimelist.net/reviews.php?id=184477"
        },
        {
            "content": "Ahhhhhhhh!  That's all that needs to be said.\r\nBut to add some more:\r\nTired of all the pussy main characters?  Tired of authors redefining the main characters at whim?  Tired of nothing but boobs when you want action?\r\nHagure Yuusha no Estetica is like a direct response to \"Hey we want something bad-ass for once!\"  I watched the first episode and was hooked. \r\nAkatsuki is simply the man I aim to be.  Complete bad-ass-ery from start to finish in every single episode.  Another strong point is Akatsuki's power - while he is over-powered, he opted to train in a different fighting stylethan the typical magic user.  It brought back some memories of DBZ, especially in fight scenes - which there was no lack of.\\n\\n\r\nThe art is more than decent enough, same with sound.  All the characters were interesting and entertaining.\\n\\n\r\nThe story was beautiful.  It's original, but unfortunately it does not look like we'll get another season.  It could have been better in terms of 'execution' as other reviewers have said, though that does not take away from the fact that this anime was completely amazing and we could use a hell of lot more like this one.\\n\\n\r\nI definitely recommend any shonen lover to watch this anime.  \\n\\n\r\nBTW, its nothing close to HighSchool DXD in terms of 'hentai', I see the hints of it as testament to Akatuski's bad-ass-ery.",
            "date": "2014-03-01T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 134299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rikkotec",
                "username": "rikkotec"
            },
            "url": "https://myanimelist.net/reviews.php?id=134299"
        }
    ],
    [
        {
            "content": "How refreshing. After slapping the Demon King's shit around and stealing his daughter, our beloved hero Akatsuki returns from fantasy-land as an overpowered motherfucker. He rides lightning-charged motorcycles, gets bitches, makes em' piss, and crushes others using only his testosterone. A refreshing character and premise indeed, but does refreshing exempt the rest of the show from being mediocre?\r\nStory\r\n'Tis a rare thing, my Pappy once said, to find a show with enough courage to stray from your average cut and paste framework. So the protagonist goes in and comes out with the belligerent demon armies dry humping the ground he walks on... then what? We seethat protagonist use his new found badassery to engage in shennanigans like putting assholes in their place, or stealing girls underwear? Sign me the fuck up. And while this is surely present in Hagure, behind the scenes there stirs a new disturbance just begging the hero to be brought back into the whole \"We are the secret organization. You don't even meet our standards. Wahahaha.\" trope. \"But Selsica!\" You argue \"It didn't reach that point in the anime, and we'll probably never get a second season!\" Ahhh how right you are, but that brings up another point. Good stories have an ending, a conclusion that ties together the relationships, plot, and ultimately, the world of the series, leaving you with a feeling of bubbling warmth. Not the kind of bubbling warmth you find after eating a week old bean burrito either. In conclusion, interesting premise, bad execution.\\n\\n\r\nArt\\n\\n\r\nGood character designs make shows more enjoyable. Beautiful animation makes shows more enjoyable. This is a fact. Akatsuki looks buff, powerful, and ready to rip a dinosaur in half and piss on its face. But then, so do the girls (minus a loli). I loved the damn show, but it could have been much nicer to watch. Anime is a visual medium, so love should be put into making the visuals decent. Oh, and this show has ecchi up the ass. I can see the studio in their planning stage: \"How much of this shit can we put in before it's considered a hentai?\" \"Well son, we'll cross that bridge when it comes.\"\\n\\n\r\nSound\\n\\n\r\nFitting, yet unmemorable.\\n\\n\r\nCharacters\\n\\n\r\nFirst, the obvious reason to watch the show. Akatsuki. A good protagonist drives the plot, he is not swept along by it. And Akatsuki drives the plot through motherfucking 6-inch walls of steel. However, good protagonists are also developed, which is a tad hard to do when the development stage of the story is confined to past-tense conversations between the fantasy worlds denizens. That aside, Akatsuki has been one of the better protagonists this season. In fact he's SO powerful you can't help but feel the enemies aren't really much of a challenge, or in his friends case, much help. He overshadows the others by a large margin, adding some predictability to the show.\\n\\n\r\nTL;DR... Uhhh, I mean Overall\\n\\n\r\nDespite my criticisms, I enjoyed Hagure Yuusha immensely. You like a good ol' fashioned shonen? Pick this up. Your hand feelin' a little antsy after that break up? Pick this up. You tired of pussy MC's? Pick this show right the hell up, because alphas are a rare commodity nowadays. The show is decent for what it is, but it isn't going to go breaking any records any time soon.",
            "date": "2012-10-02T17:44:00+00:00",
            "helpful_count": 414,
            "mal_id": 73943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287865.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Selsica",
                "username": "Selsica"
            },
            "url": "https://myanimelist.net/reviews.php?id=73943"
        },
        {
            "content": "Have you gotten pissed at those wimpy leads that always hesitate before doing anything?\r\nHave you gotten annoyed at the fricken insane power ups and power of friendship crap?\r\nIf the answer is yes, this anime is the perfect break for you.\r\nStory-9\r\nThere hasn't been much of a storyline yet except there is foreshadowing for great things to come. \r\nArt-8\r\nIt's ok. Pretty nice but not my favorite.\r\nCharacter-9\r\nThe main character stands out like a star. The chosen hero, who gained powers in another demension. Sounds cheesy. He's way overpowered but instead of being scared of it, he uses it. He is a pervert but it does not change thefact that he is kind to those around him and is not a complete clueless idiot.\\n\r\nEnjoyment-9 \\n\r\nFor me, each episode was packed of fun and excitement awaiting for what would happen next. Doubt everyone is like me but I'm sure some of you will appreciate it.\\n\r\nThis anime is for those shounen lovers who enjoy watching kick ass and stupid ecchi comedy. As long as you don't expect too much, you'll probably enjoy it.",
            "date": "2012-07-29T11:09:00+00:00",
            "helpful_count": 236,
            "mal_id": 68039,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=68039"
        },
        {
            "content": "Hagure Yuusha no Estetica, or The Aesthetics of Gary Stu as it's pronounced in English is anything but good.\nWe are introduced to a main character that for once, isn't your stereotypical shy guy and has the balls to back up what ever is thrown at him. That may start off as promising, but it loses its charm by the 2nd episode. When a character is overpowered at introduction, there's not much direction you can lead the story. So where does the series head to? Tits. I'm starting to think the anime industry's answer to budget restraints is always going to lead straight to female breasts,as it sure ain't going to the script writers.\\n\\n\nHagure starts off where most stories end. Hero beats demon king, goes home and everyone lives happily ever after. Well it's supposed to. What the series entails is of what happens after all that's been done with supposed hero. To be honest with you, my first impressions episode 1 was a sign of promise as it's rarely told through anime or any forms of medium that I know of(bar sequels), yet unfortunately it fails miserably as each episode goes by. \\n\\n\nWe are derailed from the minimal plot the series offers and instead are provided with 75% of the anime showing how awesome the main character is supposed to be(and I say this derogatively), and the remainder of  each and every episode on how the heroine is shy about her breast(whilst having little clothing on). They 'try' to show some character development with the supporting cast, but it never comes to fruition due to the MC upstaging each and every one of them whenever he gets a chance to.\\n\\n\nThe art and animation for the series is mediocre and the music feels like something from a cheap JRPG. \\n\\n\nAll in all, Hagure is a time waster and is best viewed when you really are left with nothing better to watch or plainly just bored. It does not need you to put your thinking caps on and if anything, would be best served as fodder for AMV enthusiasts.",
            "date": "2012-09-10T21:23:00+00:00",
            "helpful_count": 84,
            "mal_id": 72075,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218106.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TensaiShonen",
                "username": "TensaiShonen"
            },
            "url": "https://myanimelist.net/reviews.php?id=72075"
        },
        {
            "content": "Story: Action with huge tits? 10/10\r\nAnimation & sound: Awesome boob physics and moans? 10/10\r\nCharacters: Hunk that grabs tits and steals underwear for no reason, huge busty chicks, and even a loli! What more can you ask for? 10/10\r\nEnjoyment: had some good faps, saw some tits and lesbian scenes, OBVIOUSLY I ENJOYED!!10/10\r\nOverall: Good appetizer before i go watch some real porn/hentai. 10/10\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nWell, I think it was quite obvious that everything I wrote above were just jokes, or is it? Hagure Yuusha no Estetica seemed like a very promising anime when I first saw it. Now that i’ve watched it though, i’ll have to say that judginga book by its cover is a very fitting saying as to what this anime is. I was utterly disappointed as to what is has become, as it had a great concept and could’ve been a good anime. But what exactly went wrong? \\n\\n\r\nStory: This is the biggest fault of the anime. I remember when I first read the description of this anime from a website. It says that “Hero defeats bad guy. Good triumphs over evil. The end. Or, at least that's how it usually goes. But what happens after the hero goes home? Our hero, Ohtorizawa Akatsuki, is about to find out that sometimes the greatest adventure starts once happily ever after ends.”. Now, with a description like that, I couldn’t help but be curious. At first, I thought that this could probably be the setting of a good comedy, or maybe he hasn’t really defeated the demon king and that this would become a good shounen anime. After I watched the first few episodes though, I realised that I was completely wrong. While I was watching the first episode, the first thing that hit me was “what in the world is this guy doing, stealing panties and stuff?”. Of course, I was ok with that, as i’ve seen a lot of anime with those kind of stuff. Then somewhere in the middle of that episode, some girl with huge, uncensored tits suddenly appears out of nowhere. Of course, I also wasn’t fazed by this, as I thought that “ok, i’ve seen this somewhere before. Ranma ½ did some titty flashes too but it turned out as a good anime.”. But as i got deeper into this anime, I realized one thing. THIS IS NEITHER A COMEDY NOR A SHOUNEN ANIME, IT’S A DAMN ECCHI ANIME! Ok, so it is an ecchi anime, i’ve watched some ecchi animes, but this one is just terrible. It has an absolutely terrible plot, or it doesn’t have an actual plot, for that matter. It seems that whoever made this anime just makes a couple of scenarios that will lead into either the main character grabbing and flashing some tits and stealing underwear. Action, which was supposed to be its main theme, was just used as an excuse to make the female characters wear skimpy outfits and FUCKING BIKINI ARMOR. In other words, instead of using its potential to become a great anime, it just resorted to fanservice and tits to hook its viewers. Although it does have an actual plot, which is that some secret organization is planning to do nasty stuff with the main character right in the middle of it, it just becomes second priority for the people who made this crap, as it seems that they try to add ecchi even in the most serious scenes. I mean seriously, so the lead main character got poisoned and is losing body heat. Sounds like a serious situation? Well, what does female lead character do? SHE STRIPS AND HUGS THE MAIN LEAD CHARACTERS, THAT’S WHAT! So yeah, in conclusion, I would give this anime a 3/10 for the story for reasons that I should have explained clearly above.\\n\\n\r\nAnimation and sound: The only good thing about this anime. The animation was smooth and clean, the mouth syncs properly with the voice and the OP and the background music was good enough, although nothing special. This is the only criteria that I could give a 7/10, as it is neither fantastic nor mediocre.\\n\\n\r\nCharacters: I don’t think that there is a need to even discuss this. The characters are just about as interesting as a potato, or a rock as not make it sound so degrading for the potatoes. They are just pathetic excuses for the makers of this anime to make ecchi scenes. I mean, every girl in this series have like F-cup boobs, with the exception of one Loli. Heck, they even made a background story for the main character, that he was trained in things like finding and fitting the right size of bras for concubines. Since there really isn’t much to discuss about this criteria anymore than what is mentioned above, I would just give it a 2/10 and get it over with.\\n\\n\r\nEnjoyment: Unlike my joke review, no, I didn’t enjoy this anime. There is no story to enjoy, characters are very boring, and it is an utter waste of time. I give it a 1/10.\\n\\n\r\nOverall: Very rarely do I give a score below 6 to any anime, but this anime doesn’t deserve anything higher than a 3, so I would give it a 2/10 for being a complete waste of my time. \\n\\n\r\nIf you have read the entire review and are not mentally retarded, then please don’t watch this anime as it is a complete waste of time unless you have some other plans. :ifyouknowwhatimean: DAMMIT, I WANT 240 MINUTES OF MY LIFE BACK! \\n\\n\r\nThank you very, very much for reading this review. If it has helped you in any way, please leave a comment on my page. Now, if you are one of those people who think that this anime is great, then do post a comment on my page so I can save you from your own stupidity. Anyway, thanks for bearing with me and reading my entire review :))\\n",
            "date": "2012-10-19T07:09:00+00:00",
            "helpful_count": 71,
            "mal_id": 75309,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463167.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nateal",
                "username": "Nateal"
            },
            "url": "https://myanimelist.net/reviews.php?id=75309"
        },
        {
            "content": "I never had much of an affinity for big breasts. I find myself to be more of an ass man. Hagure Yuusha no Estetica had both however.\r\nI can't say I had high expectations for Hagure Yuusha no Estetica, it really falls flat on its face plot wise like most other series' in the ecchi genre. It was plagued by an abundance of fast selling nudity fan service.\r\nI have to admit the exposition got off to a fast start. The concept of people crossing different dimensions and learning skills from other worlds isn't a new one.  The cast centers around a school specifically made forthem to flex their abilities from the other worlds, essentially they are further trained to be soldiers for different governments. The school has a caste system based solely on their different abilities and they are placed accordingly, A-class being the highest. The plot was pretty much what you would expect from a school setting: character interaction, a beach episode and a little this and that. Rushing an opening like throwing a couple of kids into this type of school probably wasn't the best move. Opening the audience up to additional information about their alternate dimensions would have been insightful.  However, I feel with no real conflict resolution this opened up for more seasons.\\n\\n\r\nI found the plot itself to be boring after the first couple episodes. It wasn't that it was bad it was just predictable.\\n\\n\r\nA majority of the characters had a fast introduction and the plot got off with a fast start. Miu and Akatsuki are immediately placed into B-class, with a promise of advancement to A-class. But bone heads will be bone heads and Akatsuki tried to pick fights with everyone in sight. He manages to offend almost every person he comes in contact with. He sets his sights on beating the student council and everything builds up around this concept. In the other world they plot on killing Miu to suppress her people and that takes up the last few episodes. In the end good guy wins and bad guy losses. Like I said before, it was just too typical and it ended up being boring. More focus could have been given on a Akatsuki and student council relationship rather than miix in cross world plots.\\n\\n\r\nTo me a majority of the characters were duds, most of the episodes were centered around Akatsuki the macho main who isn't afraid of copping a feel.\\n\\n\r\nI didn't find myself liking any of the characters, the only notable one would most likely be Akatsuki. I would categorize this under harems and like most harems the female leads have an array of different personalities. Its a simple character formula so it doesn't stand out. You have a macho lead surrounded by bishoujo or pretty girls and he slowly wins over their hearts one by one. Aside from his unique talents and over the top mental and physical prowess he is a standard lead, so its fair but not exciting. Simply put, too much attention was given to him.\\n\\n\r\nI felt the studio tried to animate the battles but they seemed to focus more on the fan-service and this derailed the series for the most part. The sound effects for some of the spells being cast and battles didn't feel like they fit either. You probably found yourself drooling over Miu or some other chunky breasted girl. The studio did a fair job at character animations and scene settings. I don't really have much to say about much of either the scores or animation.\\n\\n\r\nThis killed some time but ultimately it just wasn't good enough.",
            "date": "2012-09-23T00:15:00+00:00",
            "helpful_count": 51,
            "mal_id": 73003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=73003"
        },
        {
            "content": "\"Anime was a mistake\"\r\n-Hayao Miyazaki\r\nHave you ever wanted to know exactly what happens after the hero slays the enemy and saves the day? Well, Studio Arms (Elfen Lied) attempted to tackle this very question with their 2012 adaptation of the light novel, Aesthetica of a Rogue Hero. With a rather unique premise as a backbone, I was very curious to see what this series was about. Unfortunately, what followed was a lewd, generic insult to anime fans everywhere, with more breast development than character development. Join me as I chart the fanservice waters and explore one of the worst anime I’ve seen to date.\r\nThe storysounds promising from the start. It begins with our conceited, overpowered protagonist Akatsuki leaving a foreign land to which he was summoned to defeat an evil Dark Lord. Instead of taking home a trinket as a souvenir for his efforts, he decides to go a few steps further and kidnap the vanquished Lord’s daughter as his own personal “consolation prize” (first indicator that this dude’s probably an arrogant prick). Once they return to Earth, he and Miu are “forced” to join BABEL, a school focused on extracting and enhancing the skills Akatsuki and others learned during their time in the foreign land of Alayzard.\\n\\n\r\nNow I’ve never really delved into the ecchi genre, so I figured Aesthetica would be a decent place to start, given the cocky nature of the main character. The main problem is that the writers spend an unnecessary amount of time justifying Akatsuki’s lecherous actions, that it amplifies the perverted nature of the show. If he grabs a girl’s breasts, he’s just trying to show her how to make use of cleavage. If he steals a girl’s panties, he’s just trying to prove a point. These moments are so prolific early on that you end up not taking the show seriously. The amount of ecchi moments are plentiful too, with a unique mix of lesbians, random crotch-grabbing and heinous nudity to go around. And some of the scenes I was downright ashamed to watch, including an excerpt involving Akatsuki using his divine powers to cause three girls to pee themselves to prevent one from being embarrassed. I can’t even make this stuff up. I can see why the light novel is so popular around Japan…\\n\\n\r\nMost of the show’s 12 episodes are eaten up exploring the generic cast, and by the time the real story comes into play near the end, Aesthetica has already lost its steam. Any inkling of hope I had for the serious elements to play out were eradicated by the copious amounts of fanservice plaguing the anime’s beginning. The overpowering nature of Akatsuki also eliminates any feeling of drama throughout the series. Much like Sora and Shiro from No Game No Life, the battles are over before they begin, leaving much less opportunity for suspense from a viewer’s perspective. Most efforts at backstories are waived off to promote more ecchi scenes or are truncated due to the series’ short run. Considering it’s been five years since Aesthetica’s release, I don’t see a sequel in the works either, so the five of you out there that actually enjoyed the show can wait with bated breath.\\n\\n\r\nWhen I first saw Akatsuki, I was delighted. Finally we get a protagonist who isn’t shy around women and doesn’t get caught up in melodramatic inner monologues! But, it only took an episode for him to show his true colors, and before long I despised his presumptuous personality. Egotistical doesn’t even begin to describe him, and you could even go as far as to call him sexually sadistic. Akatsuki is so much better than everyone else in the show that they seem almost irrelevant. Generic iterations of various tropes are scattered throughout Aesthetica, leading the viewers to feel cheapened by the lazy writing. Miu has her fair share of, um well, “development” (aka, tits) but again this is overshadowed by the extraneous amount of time spent on Akatsuki’s perverted acts. The whole show is like some kind of messed up harem where instead of having girls fawning over him, they’re forced onto him against their will. But instead of hating him for what he does, he always finds a loophole excuse or convenience to make it okay. It’s almost as though the writers are saying to their viewers, “It’s okay to grope women as long as you make up a good reason!” Truly disgusting.\\n\\n\r\nThe animation is a constant reminder of what Studio ARMS is not known for. It’s one of the same reasons I didn’t care for Elfen Lied. Everyone that’s not a main character is a pain to look at, as the models are a generic wreck. Even the protagonists leave a lot to be desired in the art department. The action scene’s animation was lackluster at best, and had some framing issues. Honestly, the most accurate part of the entire anime is the nudity. Depravity at its finest. The animation in the OP reminded me a bit of the old Dead or Alive Extreme Volleyball games with all of the breast bouncing. I should’ve known then to run for the hills.\\n\\n\r\nThe music in Aesthetica is reminiscent of something I’d hear in a cheesy DDR ripoff. It’s BAD. It’s almost as though the creators went down a sorted list of cheapest to most expensive when it came to purchasing the musical rights of the tracks here. At least the ecchi-ness helps drown some of it out. The ED is better, but still misses the mark for me. All of these begin to blur together after awhile. On a positive note, the English dub is actually pretty good. It incorporates some better known actors and is casted well. Some of the translations were altered to make them a bit more Westernized, but nothing really detracted from the scenes.\\n\\n\r\nTo make a long story short, Aesthetica of a Rogue Hero is NOT a good show. It’s inexcusably perverted, lacks any character development and has a story that fizzles out faster than a middle school relationship. I guess if you were really bored or just looking for a terrible series to put things into perspective, then this could be a potential option for you. Just make sure you come in without any other expectations than tits. Lots and lots of tits. As always, thanks for reading!\\n\\n\r\nStory-3\\n\r\nArt-3\\n\r\nSound-2\\n\r\nCharacters-2\\n\r\nEnjoyment-2\\n\r\nOverall-2.3",
            "date": "2017-02-22T12:09:00+00:00",
            "helpful_count": 31,
            "mal_id": 241145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=241145"
        },
        {
            "content": "When entering the ecchi genre, you generally know just what you’re going to get: a heavy reliance on fanservice and a ton of slapstick and sexual humor. Obviously, it doesn’t usually make for a compelling and intelligent show. But that’s not to say that all ecchi anime are bad. In fact, some ecchi anime can end up being pretty funny and charming; with at least a few characters that don’t make you want to shove knives in your ears every time they open their mouths. And then there’s the other kind of ecchi anime. It’s the kind that is self-aware if its suckiness and triesto compensate with over the top, sometimes fetishy, fanservice that straddles the line between ecchi and hentai. In the end, you won’t remember its story, characters, or humor. Instead, you’ll only remember its shockingly inappropriate fanservice that practically screams “trying too hard!”\\n\\n\r\nCan you guess which type Hagure Yuusha no Aestetica is?\\n\\n\r\nHagure Yuusha is a tale of silliness, fanservice, and magic. Its conception was handled by studio Arms, perhaps most (in)famous nowadays for their other sexually charged series Ikkitousen and Queen’s Blade. Hagure Yuusha shares many similarities with both of these series. \\n\\n\r\nThe story begins where the typical fantasy tale usually ends: at the end of an intense battle with the demon king. After our hero Akatsuki Ousawa’s triumphant victory, he takes the demon king’s daughter, Miu, and heads back home to his own dimension. Now fully equipped with magical powers, he and Miu are sent to a special high school for magic users named Babel. Dramatic duels with mysterious opponents out for Ousawa’s blood, magical mayhem, and high school hilarity ensue. \\n\\n\r\nTo be honest, Hagure Yuusha had an excellent setup. Its story had a vast amount of potential with a world whose lore and politics are completely pushed to the side in favor of panty shots and tits. The creators had a lot of room to work with the world but they refused to. For example, we don’t learn much about the differences between the dimensions. Apparently Babel is a special school where kids returning from another dimension are stuffed so they can be monitored. Therefore, we can assume that Akatsuki’s world is one where magic users are the exception, not the rule. Yet we never hear about the other dimensions that the other characters come from, or how their worlds influence their personalities or mannerisms. And what of Akatsuki’s relationship with Queen Risty? None of this is ever expanded upon.  Even if the creators had half-assed some backstories and explanations on the lore and world, it still would have been a much better show than what it is now. But instead we get tits. It’s one thing to give bare bones explanations when it’s an ecchi comedy, because then you expect mostly humor and not much else. But Hagure Yuusha sporadically jumps between wanting to make us laugh, wanting to turn us on, and wanting us to take it seriously. But the plot resembles something from a really bad JRPG, so when it wants to be taken seriously, its pretty hard for the viewer to do that.\\n\\n\r\nThe characters don’t fare much better either. They are all extremely bland and boring, making it very hard to care about them or this show for that matter. Akatsuki Ousawa is indeed the one who steals the show here, though that’s not really hard when you have such a pathetic cast. He is lauded as a “badass” and “refreshing” simply because he’s not some wimpy male lead and can actually back up all the smack he talks. True, he isn’t your typical “super skinny or super fat loser who plays video games well, then has girls throwing their panties at him” archetype. But that doesn’t mean he’s a good character. He is one dimensional, obnoxious, and showcases throughout the anime that he may even be intellectually inept.\\n\\n\r\nTake the second episode for example. He and the other female protagonists get locked in a gym closet. Kuzuha has to pee quite badly. They say out loud that she could use earth magic to make a toilet. Instead, Ousawa uses his magic mumbo jumbo to make the other two girls feel what Kuzuha is feeling and really have to pee too, because…because. After biting Kuzuha’s ear, all three girls pee themselves. They then proceed to beat him up. Honestly, this is probably one of the most memorable scenes in the anime, but for all the wrong reasons. Why the hell couldn’t they just make a toilet like they said literally a few seconds ago? Oh right, omorashi fanservice.\\n\\n\r\nThen the justification used for his actions (“he made himself the bad guy so I could make friends!”) is almost insulting to the viewer’s intelligence. Remember kids, if you want to make friends, pee yourselves in unison! \\n\\n\r\nFace it; he’s only a small step above your usual wish fulfillment protagonists. The only thing that puts him slightly above the typical wish fulfillment protagonist is, once again, that he’s not some frail looking little flower that is overpowered for some inexplicable reason that defies logic. \\n\\n\r\nThe female characters aren’t much better. Miu is a girl who is very shy about her body, but somehow always ends up groped or exposed. It would have been interesting to learn about her backstory. Something worth noting is that she’s a demon but looks human. Could her mother have been a human? Clearly the creators thought, “Who cares about that! Let’s get her naked!”\\n\\n\r\nKuzuha is the loli class chairman and Chikage Izumi is the raging tomboy lesbian. Her actual introduction in the show is her molesting another female student in a gym closet. We learn little to nothing about these characters. The rest of the supporting cast are unimportant and hardly worth mentioning. Their only real purpose is to be curbstomped by Akatsuki and nothing more.\\n\\n\r\nIn addition to being one dimensional and boring, the character’s motivations and actions aren’t really given reason. Nor do they make any sense. One example: Akatsuki kills Miu’s father. Why in the world does she not hate him? Why does she end up falling in love with him? It’s also hard to pinpoint a character’s motivation when we get little to no backstory on them or when they have such boring and flat personalities. The characters don’t seem like much more than dolls.\\n\\n\r\nWith all this disappointment, we should at least be able to turn to the action and violence for comfort right? Wrong. The animation is pretty bad, looking quite dated for its time. The character’s heads look far too small for their bodies. And they all look like pallet swaps of each other with different hairstyles and varying breast sizes. The coloring looks incredibly flat and unreasonably bright. The fight scenes are lazily animated and unexciting. Couple that with the fact that Akatsuki dominates every opponent fairly quickly and you’ve got yourself some boring fight scenes. The music is also nothing spectacular, ranging from mediocre to bad.\\n\\n\r\nOverall, this show is pretty terrible on all counts. It had so much potential to be something excellent. Or at least decent, if they had just tried a little. Or it could have been one of those ecchi shows that you know isn’t all that good, but it ends up being humorous and charming nonetheless. Unfortunately, Hagure Yuusha isn’t funny, it isn’t endearing, and it’s just not enjoyable. It’s like a bad JRPG in anime form that tries to pull off a laughable plot with a straight face. Or a bad hentai without the sex. The only thing you’ll remember when you’re done are the inappropriate fanservice scenes, because those definitely push the envelope.\\n\\n\r\nThere are better ecchi anime out there. There are far better action anime out there. There is also porn, which has sex, which Hagure Yuusha acts likes it’s going to show you but never does. \\n\\n\r\nGo find those splendid titles and leave tripe like this where it belongs.\\n",
            "date": "2013-05-31T15:32:00+00:00",
            "helpful_count": 31,
            "mal_id": 99159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1565209.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LuckyKrystal",
                "username": "LuckyKrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=99159"
        },
        {
            "content": "Finally!!!!!!!!!!!!!! a anime where the main character isn't a cry baby, or a weak punk who doesnt know how to use his power. The main character is a boss, he is already strong, he knows he is strong and he pretty much kicks every ones ass. He is not shy of girls so you will see him act more manly instead of having gallons of blood squirt out his nose. This is pretty much a dream anime come true, need more like this.",
            "date": "2012-09-03T11:20:00+00:00",
            "helpful_count": 27,
            "mal_id": 71507,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1177091.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NegativeD",
                "username": "NegativeD"
            },
            "url": "https://myanimelist.net/reviews.php?id=71507"
        },
        {
            "content": "Here are my initial impressions of this anime Please note that my score could go up/ down as the series progresses.\r\nThe story could become something interesting. After defeating the 'bad guy' of this medieval type world of magic, Akatsuki goes back home to a more modern scenery, taking a girl Miu- the daughter of the demon king with him. Another mystery set up is the organisation Babel, which is supposedly set up to protect the young returning from another world and a prophecy which concerns Akatsuki. \r\nThe characters are also interesting, especially the protagonist Akatsuki. It's refreshing to see the main guy taking charge ofthings. Miu is also an interesting character, it reamins to be seen why Akatsuki took her with him and what role she will have. She doesn't seem to be the typical passive character that needs to be saved constantly, but we'll see.\\n\\n\r\nI have no problems with the art, it's decent, but i wouldn't say it particularly stands out for me. The voice work is above average and it's a great cast i would say. The music is okay, the opening & ending tunes not really to my taste, but it sets the tone quite well.\\n\\n\r\nOne of the main issues with this, is the amount of fanservice, it may not suit some people. From just the first episode we already see Akatsuki taking the bras of several maids and a lot of shots of Miu's body and chest. I have a feeling it'll only increase. I am only worried because this story could be something worth watching, but sometimes i feel fanservice can lower the impact and quality.\\n\\n\r\nWill i keep watching? Most likely. The first episode has definitely shown a lot of potential in introducing the characters and the story. The question is will this become an awesome anime or will it be let down by the fanservice factor?",
            "date": "2012-07-06T08:48:00+00:00",
            "helpful_count": 22,
            "mal_id": 65483,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211009.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/chihayatohru",
                "username": "chihayatohru"
            },
            "url": "https://myanimelist.net/reviews.php?id=65483"
        },
        {
            "content": "Story 7/10: This starts out with a another main protagonist (which all harem anime has), and he is fighting stuff, so then finds a girl or to be exact offered a girl so guidance, because he felt sorry for her (won't tell you why), then he travels back to his own world and this is based again where they recruit \"teenaged\" soldiers and put them in \"high school\" quite frankly i like this idea of a set up, story's nothing new and there a flashbacks to cover when happened before the first episode.\r\nArt 8/10: The art i found pretty good or so, but here andso, i don't know if this is in art, but you have a big chested pretend little sister, the eyes look like the anime tokimeki memorial but the rest is art is fairly basic for 2012 \\n\\n\r\nSound 8/10: The sound effects are quite good considering this is a anime with magic, action and swords and stuff, but the op and ed are not really quite catchy\\n\\n\r\nCharacter 9/10: You got some heroines listed right here: You got a pink haired girl who is like a little sister to the main protagonist and she has big melons (lol melons), you got a girl younger than her grade but thank god not too young and she's duh flat chested, you got a girl who's a lesbian, and you got a student council member who swears to get revenge on the main protagonist, Now the main protagonist is actually in my top 10 characters, he's loveable, he's a cool character and he's a bit of a perv but not the ugly ones but the cool ones example Usui, Takumi from kaichou wa maid-sama!, he is probably the most strongest character and he can be a ladies man or a man who gets scolded by girls. \\n\\n\r\nEnjoyment 9/10: This anime has some laughs, ecchi scenes (actually a lot) and some action, if you find females getting embarrass as a laugh or something perverted than that counts as comedy (it does for me), fan service heck you find a lot of that in there, action yep\\n\\n\r\nOverall 9/10: I gave it a 10 in my list but for you guys you probably want to give it a 9/10, it's funny, enjoyable and has fan service so i recommend this to harem, ecchi, comedy and action lovers, you won't say GOD THIS ANIME IS THE BEST but you remember it in your year of 2012",
            "date": "2012-08-13T11:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 69649,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1294513.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mech66",
                "username": "mech66"
            },
            "url": "https://myanimelist.net/reviews.php?id=69649"
        },
        {
            "content": "The most important thing to mention to people before they begin watching this anime is that there is no season 2 and that the anime stops very abruptly at episode 12. (At the time my thoughts were \"OMFG did the anime really just drop dead somewhere in the middle/beginning of the story?\") Luckily there is some of the translated light novel on baka-tsuki if you like reading.\r\nThe second most important thing is that it is certainly an ecchi anime. There were so many bras, panties and breasts that I'm amazed it's not hentai. \r\nStory\r\nI initially thought that it was solely a parody show making funstories that start with a hero being summoned to another world (it also included the stereotypical Demon Lord too). Beyond that parody the premise seemed interesting and the story might have been able to develop further, but everything was thrown to hell after the anime's untimely demise at episode 12. I'm still bitter and in a partial state of shock having had the anime end in the middle of nowhere.\\n\\n\r\nArt 7/10\\n\r\nThe art can be divided into three different types.\\n\r\nScene 1: Underwear, Girls trying to hide their naked bodies, Akatsuki(MC) doing lewd sh*t\\n\r\nScene 2: Glowing magic circles for casting spells\\n\r\nScene 3: Akatsuki punching things or whacking things with his hefty Demonlordsword\\n\\n\r\nSound\\n\r\nAfter listening to the soundtrack the music was pretty well done. The quality was consistent throughout the entire show. My favourite song was Kichiku Panic from the beach episode. I recommend listening to a few songs from the soundtrack on youtube. Usually, anime beach episodes are a sin against all people with functioning brains, but it was probably the best beach episode I have seen.\\n\\n\r\nCharacters\\n\r\nThe characters are rather mediocre except for Ousawa Akatsuki (Protagonist) who managed to dazzle me with his outrageous testosterone infused muscles, friendliness, kindness, and diabolical ecchiness. If Akatsuki wasn't such a nice guy at heart and rippling with composed bold style I would condemn him to hell for his crimes against defenseless girls. He isn't the retarded silly type of pervert that is the norm for ecchi shows. He's some kind of frightening, diabolical, ecchi, domination machine that girls can't escape from.  \\n\\n\r\nThe females are just typical weakly manufactured harem girls that didn't get enough development because the anime ended so suddenly.\\n\\n\r\nThe males all received less character development and are very shallow/static.\\n\\n\r\nEnjoyment\\n\r\nEnjoyment is the ultimatum I suppose. The enjoyment that I take away with me after having completed 12 episodes are the following few things\\n\r\n(1) An interesting premise to think about\\n\r\n(2) A few decent small battles and action scenes\\n\r\n(3) A new perspective on ecchi protagonists and some laughs\\n\\n\r\nThe anime did leave me wanting more, but there is no more. There probably never will be. RIP Hagure Anime\\n\\n",
            "date": "2015-08-21T19:13:00+00:00",
            "helpful_count": 14,
            "mal_id": 196719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441660.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Scholek",
                "username": "Scholek"
            },
            "url": "https://myanimelist.net/reviews.php?id=196719"
        },
        {
            "content": "I decided to watch this anime on a whim. \r\nI liked the picture I thought it was pretty bad ass so I started watching it.\r\nI still don't know what made me watch all 12 episodes.\r\n First episode was actually quite promising; We had flashbacks, very busty young girl, quite good looking hero, and somewhat promising story.\r\nSecond episode was fair enough too.\r\nAfterwards.. I think that my stubborn nature made me watch it until the very end, but it was very painful. Nothing in this anime made me say that it was at least decent to watch. \r\nWe have once again hero who defeats everything,not to forgetvery powerful. We have big breasted women in entire anime,I mean everything I see is breast breast and some more breast. Oh and panties.\\n\r\nI mean, I don't have anything against that, but not in that amount.\\n\r\nI am not even thinking about watching side story they made.\\n\r\nMajority of the things from the beginning that made the story interesting was left forgotten and never returned to.\\n\r\nThat was mainly the reason why I didn't like it at all. It could be very promising by my  opinion. \\n",
            "date": "2014-05-11T09:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 142997,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768613.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ame_Gasai",
                "username": "Ame_Gasai"
            },
            "url": "https://myanimelist.net/reviews.php?id=142997"
        },
        {
            "content": "Though the series is still airing this anime is extremely well done, it is one of the few ongoing series that I've actually bothered to look forward to and remember to watch as it comes out. \r\nThe main character finally is a strong lead who does as he pleases instead of a weak, clueless guy, who in almost every episode (assuming your watching a show where you don't have to wait till the last three episodes for the story to progress) is to scared to do anything though it is obvious he has the chance (I dont know about you but hesitation when the momentis right has never happened to at least 99% of guys and takes me out of the story)\\n\r\nin short (besides that the main character getting away with almost no punishments and the obvious fictitious parts) this anime can seem realistic and doesnt leave you thinking \"I could have done that better\" \\n\r\nA+",
            "date": "2012-08-23T17:26:00+00:00",
            "helpful_count": 12,
            "mal_id": 70705,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/inumaster10",
                "username": "inumaster10"
            },
            "url": "https://myanimelist.net/reviews.php?id=70705"
        },
        {
            "content": "When this anime first came out, I read the synopsis for it and thought this is probably only going to be a meh anime. I wasn't going to watch it at first but 3 month after I first heard of it I decided to check it out on one boring school day with nothing to do but to play with my phone. I fell in love with this anime the first episode.\r\nThe thing that caught my eye about this anime is the main character and the concepts of the story. The main character is just....awesome. He is strong, smart, understanding, confident, relaxed, funny, fun, perverted,open minded, serious, honorable and most important of all selfless. Analyzing him makes it pretty epic. He is like the title suggests a rogue hero, and a true hero like the anime suggests. All he wants to do is to make people happy and protect innocence (which i feel is represented by girls in here) from everything that dare make it unhappy. He doesn't need gratitude. He gladly shoulders this burden to protect innocence knowing he will have to make great sacrifices (suffering others pain to help them, taking on all the problems by himself, physical injuries etc.) and the only reward he will get is happiness of others. His goal is realistic understanding that he is only a man doing only as much as he can physically do but still always testing his limits to improve himself so he can do more. Rules or laws do not stop him. He knows what is more important and must be done. He is my hero now. He is everything that I always try to be so I guess that is why he appeals to me so much when I watched this show.\\n\\n\r\nThe setting is pretty awesome. Its society has both magic and technology. The structure of government is uniquely built with a feeling that babel is has all the power. It also includes other dimensions which are medieval by appearance and has their own government. The dimensions seem to know of each other's existence which I thought is interesting to see how they would interact. The concept leaves much to wonder on and therefore a lot of mystery and potential. This is still only season 1 and I can't wait for season 2.\\n\\n\r\nThe story itself is quite entertaining. The story has a lot of little everyday events that you can relate too. I found them funny yet surprisingly on topic. The story topic is suppose to be about the aesthetics of a rogue hero, or the appreciation of the concept of a \"rogue hero\" and from the 12 episodes I feel I had great appreciation of what a rogue hero is. The only thing that could be better is if they move the main plot along a little faster but it is too hard to tell at this point to know if they are or not. Need to know how relevant the information they are showing in season 1 are to the plot to know for sure.",
            "date": "2012-11-13T15:19:00+00:00",
            "helpful_count": 12,
            "mal_id": 77411,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1651743.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hobosontrains",
                "username": "hobosontrains"
            },
            "url": "https://myanimelist.net/reviews.php?id=77411"
        },
        {
            "content": "I could go into a lot about this series, but I wont. It's not worth it.\r\nVoice acting was fair, Music was ok, had good Opening song. Art and animation was find. Now let get to the point, skip this anime. There are ton of anime out there, that can give better enjoyment then this anime could dream to. To sum it up what this anime has to offer is basic borderline hentai and some RPG elements. The fan serves is horrible , I usually don't mine it at all but in this one it take way from what little story this anime has to offer.Characters, I'll give that the main was some what interesting but rest of the cast has been seen and done, nothing special or interesting about them. I really had hard time watch this one all the way through, it's was pretty boring. But worst part of this anime is plot. The person who wrote must of been going for dual story with fantasy world plot and real world plot. Which would been fine they choice focus one at time. When I watch the first episode I felt throw into story, which would be fine if they had give some explanation later into story but that never happen. When you get to the part about the reason these kids end up into other worlds and how when they come back they are draft as student become soldiers. It this part of plot that is totally fuck up. It make no sense and seem to make less sense as go through the anime. Next major issue is that anime can't seem to stick to the two major plot at all and seem to go through form one side plot that has no important what so every to story, to next meaningless plot. You have episode where he get motorcycle, that that point, so he can look cool not that actually important to plot. The series in last 3rd jump back into one of the major stories but at this point I could care less because they didn't build the character or the conflict for me to get behind it. So sum up the story was is basically role up piece of garage. Only reason I watch series all way through, so I could used the element I did like for re-wright in my head. From the original there was not much to go on. So over all this series has element that been done, useless fan serve, and can't seem make up mind about which plot it want you to fellow. In other words, this skip this anime. It doesn't deserve a second season. Total Bomb.",
            "date": "2013-04-02T23:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 92169,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26612.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SamMan",
                "username": "SamMan"
            },
            "url": "https://myanimelist.net/reviews.php?id=92169"
        },
        {
            "content": "I will say it right now, simple and clear. This show is fine but its main character is not. I suspect the main character is the reason this show has garnered popularity but please listen to my points when I get to him.\r\nStory:\r\nWell as of right now there isn't too much to talk about here. The setting is decently original with people disappearing into fantasy worlds only to reappear with their powers intact. This part of the story is glanced over so I doubt we'll be going any deeper into this element of the show, which is a shame because it's really the only originalplot point the show has. The plot point itself is probably no less than an excuse to have people gain powers in the real world.\\n\\n\r\nSadly nothing else about the story has remotely piqued my interest, which is not good for a series that's 6 episodes in. Generally a show should have some kind of hook on the first or even the second episode. Hagure Yuusha no Estetica is failed to deliver much plot substance at all and the hints it does drop are both uninteresting and half-assed.\\n\\n\\n\r\nArt:\\n\\n\r\nThe art is of course, great. Many shows today have really done a fantastic job with keeping all the different anime very appealing to look at. I can watch a few episodes and not notice any kind of glitches or hiccups which is nice.\\n\\n\r\nThe spells are pretty generic, using the same spell circles you see very where now-a-days but it's not necessarily a bad thing. The effects that accompanies the spells are also very well done which at this point is to be expected.\\n\\n\\n\r\nSound:\\n\\n\r\nSound is a very similar story to art. The standard for it is very high and most anime reaches it with Hagure Yuusha no Estetica being no exception. The sounds and music fits the scene nicely however I have yet to notice any particular tracks that I like.\\n\\n\\n\r\nCharacters:\\n\\n\r\nNow this is where it gets really frustrating. I know everyone loves the main character because he's the exact opposite of those wimpy characters we frequently get. I understand that completely, wimpy characters are unappealing and annoying. However this is NOT and excuse to do what Hagure Yuusha no Estetica has done.\\n\\n\r\nAkatsuki: To put it bluntly, he's a Gary Stu (if you're unfamiliar with the term, please reference Google). He's like an OC (original character) straight out of a bad fanfic. He is much too over powered for his environment which can sometimes be entertaining if handled correctly. It is not handled at all well in this anime. Akatsuki flaunts his power many times over the past 6 episodes, with every successive feat becoming more predictable than the last. Sadly this makes his antics boring and stale. He's a one-trick-pony that just mows through challenges which is boring to watch. Hopefully the fights will be less one sided when some stronger enemies come forth but this also brings up my next point.\\n\\n\r\nThe show itself is a god damn love letter to Ousawa. The show basically just runs on scenes that make Ousawa out to be the mega bad-ass. A good example of this is\\n\r\n*SPOILER* \\n\r\nin episode 6 where he inexplicably appears out of no where on the roof top to save the little girl from the bad guy.\\n\r\n*END SPOILER*\\n\r\nWe get nearly no exposition or any real form of explanation as to why he was there. The show just wants us to believe he either appeared from thin air or was somehow in the vehicle when it got on the roof. Like I said, no exposition. It was just an excuse to give Akatsuki another \"I'm a good guy\" scene.\\n\\n\r\nThe final point I have is that he lacks a strong personality. Sure, he can crush everything under his pinky, but other than that it's really boring. The only interesting parts of his personality are extremely rushed and very poorly placed. Examples of this would be\\n\r\n*SPOILER*\\n\r\nwhen he become the \"reverse\" bully to the red haired character (I'm sorry, I can't seem to remember his name). The whole thing about him being this self imposed judicator would be a great character trait were it developed a little more. We know nothing of why he feels that bullies should be punished, which in turn makes it come off as a poorly chosen trait with the sole purpose of \"making him look cool\".\\n\\n\r\nAnother example I will bring up is his anger towards the mentioning of his father. It comes out of no where, is only brought up for a second and does little to get me interested in the story of his father. Again this could be an interesting character trait if handled differently, like in a time where he really couldn't get something done. It would let us have at least a little bit of insight into why he needs to surpass his father and why we should care. But no, like everything else he just skips right through any sign of challenge. Which is another thing, we don't know why Akatsuki can ride the bike now or what changed except that he got slightly angrier. There was virtually 4 minutes of build-up and *boom* suddenly the thing that floored him 2 minutes ago was suddenly obeying his every command.\\n\r\n*END SPOILER*\\n\\n\r\nIn closing, Ousawa is much like what you'd find a grade school student day dreaming about with his friends. Remember those conversations you had when you were a kid and trying to think of a \"cool\" character? \"He should have like these razor sharp teethe that can rip through anything!\" \"YEAH and he needs flames on his back that burn everything a mile around him!\" \"And then he needs these big spikes on his legs that are indestructible.\" \"Then he needs red eyes that shoot lasers.\" \"He should ride around on this hover board too which goes like faster than light.\" That's generally how I assume the creation of Ousawa went, of course without the grade school ideas but with the same mindset.\\n\\n\\n\r\nKuzuha: By far my favorite character in the show. She's not only flawed in that she has emotional issues she needs to deal with, but her resentment of her situation is entirely understandable. These flaws make characters deeper the more a show wants to go into these ideas. In turn the character becomes much more interesting.\\n\\n\r\nMiu: She's your basic female protagonist, not that that's a bad thing. There's not much to talk about other than her troubles with her father and Akatsuki but I assume we will delve further into the topic as the series goes.\\n\\n\r\nChikage: She's interesting mostly because of a certain scene (you'll know it when you see it). She's basically just there to promote the echiness of the series which is fine.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nI really want to enjoy the series because it has potential but that main character annoys me so greatly. If he was handled at all better I'd easily put this show as a favorite for the season, but otherwise my enjoyment of the show is greatly hampered.\\n\\n\\n\r\nOverall:\\n\\n\r\nI can only give it a 6 because I do actually enjoy it but I notice myself clenching my teethe from time to time which is not a good sign. If you do in fact like the main character then that is up to you. Personally I just can't stand him.",
            "date": "2012-08-11T01:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 69391,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/940633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Deotay",
                "username": "Deotay"
            },
            "url": "https://myanimelist.net/reviews.php?id=69391"
        },
        {
            "content": "Hagure is a ecchi-based action/fantasy for those tired of wimpy, \"nice\" male leads. However, it is also a series only for those who can tolerate thin character development and a story trying to foreshadow a second season so badly that you might as well just wait until the next season comes out.\r\nThe story shares the dimension-travel theme of other shows such as Zero no Tsukaima and Astarotte no Omocha. The main difference being the lack of Rie Kugumiya and a much more blunt approach to the ecchi; the main lead here is strong enough not to be a victim of violent acts of retribution forhis openly perverse nature (though he displays it in a much more controlled fashion than the lead in Sora no Otoshimono). However, this refreshing change of lead personality is just wasted on a wish washy plot line full of inconsistencies, plot holes, and purposefully-unanswered mysterious questions. If you're looking for a stronger male lead who is not afraid to express his perverse nature, look to Onizuka. If you're looking for just a male lead that can stand up on his own, Campione gives this series a run for its money as well. If you do somehow decide to delve into this series, be prepared for a very lackluster story line.\\n\\n\r\nAnimation:\\n\r\nWhile there isn't anything atrocious here, the animation isn't what I'd call good. The color scheme gives the series a slightly childish feel despite the story trying (at times) to portray a more somber mood. As for the characters, there's something about their facial styling that is off putting. As for ecchi, the main hero has the ability to undress female characters (almost similar to the protagonist in DxD's ability, though Akatsuki can remove articles intact). He also has the ability to control the flow of chi in people, and thus can basically \"control\" how people \"feel\". You can interpret that one as you see fit. Expect plenty of groping, bouncy parts, and panty shots.\\n\\n\r\nThere is a decent amount of action in this series, but the choreography is average at best and there is neither seriousness nor gore (dragon implodes upon death? what is this Mortal Kombat Annihilation?). The majority of the fighting is analogous to laser spamming in certain Gundam series; basically you see large swaths of colored energy being hurled between contenders.\\n\\n\r\nSound:\\n\r\nThe series has completely forgettable music all around. OP and ED are both action-sounding rock pieces, the ED being the slightly better of the pair. BGM has one or so unique pieces (for ecchi moments), but pretty much your standard fare.\\n\\n\r\nTo be honest, the only reason why I considered watching this was the outstanding list of VAs. Also to be honest, I have no idea how this show got so many good VAs signed on, as the characters are so cookie-cutter that none of the VAs even had a chance to drive any life into their roles. Kana Hanazawa voicing a very quiet, orderly character? Ami Koshimizu getting virtually three lines in the entire series? Marina Inoue in a tsundere role is probably the only one that was a good fit.\\n\\n\r\nStory:\\n\r\nAs mentioned in the intro, this series' setting is hinged on dimensional travel. In this case, kids are mysteriously transported to another world where they become RPG heroes, eventually returning to Earth with a wide variety of magical and physical abilities. These students are somehow gathered and placed in a school called Babel (of course we're not supposed to ask why or how). Our protagonist is one such student, who just returned from the other world having defeated the last demon king and taking \"ownership\" of the demon king's daughter (as the king's final request). The story follows Akatsuki as he and Miu adjusts to life at Babel.\\n\\n\r\nThe best way to describe the story is that it is analogous to DBZ had Goku started out at Namek as a SS3. There's just no point to it as the hero is already so strong that there is nowhere to grow. All the character relations and \"important\" friendships are meaningless as the \"hero\" ends up saving everyone. Every. Single. Time. To the point where one asks \"why even bother?\" The show tries to keep the viewer interested by occasionally hinting that there is a secret organization with potentially other beings at Akatsuki's level, but nothing ever comes from it other than hooks to try to get you to watch the second season- but if the first series is any hint at how well the production will go for the second season, please count me out.\\n\\n\r\nThe story starts out in a slice-of-life, episodic progression before moving on to the \"final\" arc starting halfway through the show. It builds to an eventual climax with an all-too-predictable outcome. The main plot line aside, there are just too many other subplots going on concurrently (the mysterious organization, occurrences in the other world, etc.) that are just thrown at the viewer as if we were some multi-core processor able to context switch seamlessly between subplots. Ranting aside, the execution of the story was overall significantly sub par.\\n\\n\r\nCharacter:\\n\r\nTo be honest, this ought to be a continuation of the rant from above, but I'll spare you and just say \"more of the same\". There are way too many characters thrown in seeming for the lolz, and the antagonist is so cliche that you'd have thought he came from something over a decade ago. All the characters (Miu aside) lack any depth whatsoever, almost as if the show is purposely hiding details. Character relationships also feel shallow, the deepest probably being Chikage's yuri feelings towards Miyu. As mentioned in the sound section, the great VA talent is truly wasted on these characters.\\n\\n\r\nValue:\\n\r\nSome may rate this series highly because of this section alone. I'll agree, the male lead is a refreshing change from the wimpy lot. However, he overshadows all other aspects of the show to such a degree that he single handedly undermines the story as well as the importance of the other characters. Watch this series only for the fan service; otherwise, be prepared to be disappointed.",
            "date": "2015-11-13T00:03:00+00:00",
            "helpful_count": 8,
            "mal_id": 203262,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203262"
        },
        {
            "content": "I've got to say that I really enjoyed watching the series, my only problem with it was that there were a few occasions that I found that the dialogue was a bit boring.\r\nThe fight scenes were great! The main character is a real badass, and knows it!\r\nI'd really recommend others to watch it!",
            "date": "2015-08-24T13:00:00+00:00",
            "helpful_count": 7,
            "mal_id": 196940,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4829791.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/stahlnacht",
                "username": "stahlnacht"
            },
            "url": "https://myanimelist.net/reviews.php?id=196940"
        },
        {
            "content": "Looking for a totally mediocre but enjoyable fantasy and action anime? well I think Hagure Yuusha No Estetica is for you!\r\nI went into this anime during the summer 2012 season with the normal expectation of a totally floppy and cliche harem and action anime...well it wasnt. In a way you had the makings of such an anime but in the end the main male protagonist and action scenes followed by a well thought out pacing for the storyline.\r\nThe main attraction for this anime is the main male protagonist, Ousawa Akatsuki who is a badass , strong, pervert and invincible. basically he is a main leadwith a harem with enough backbone and ability to defend himself as well. He stands out from the normal wimpy and weak MCs with a harem.\\n\r\nThroughout the anime , his heroics and basic ethics is something to be admired and enjoyed as he cruises through fights and challenges with a calm demeanor. \\n\r\nHis other quality would be his pervy side...where he can strip women of their underwear without them even realizing it. which makes him a totally pervert and entertain male audiences with all the ecchi element.\\n\\n\r\nThe circles of girls in his *Harem* , though i would say the romantic hints in this anime is pretty few with only certain girls showing obvious affection for him, the most obvious of which is his little sister, Ousawa Miu( not blood-related) and the tsundere vice president, Haruka. \\n\\n\r\nThe storyline is nothing really impressive...( you can read synopsis on MAL and you can guess the basic storyline once you start the anime). Like I said, the most interesting aspect of this anime is the Main star lead, Akatsuki and the pacing of the story. Every episode does just enough to let the story progress , though the occasional side episodes comes up, the progession doesnt really slows down to zero. The fight scenes were solid and well paced as well and most of all its BELIEVABLE and does not end off abruptly.\\n\\n\r\nTowards the end of the anime, you will see this anime is a genuine fantasy and action anime with a strong MC and would have found it totally enjoyable like me ;D though it would depend on your personal taste as well.",
            "date": "2015-04-02T07:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 184477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311221.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MinnaDess",
                "username": "MinnaDess"
            },
            "url": "https://myanimelist.net/reviews.php?id=184477"
        },
        {
            "content": "Ahhhhhhhh!  That's all that needs to be said.\r\nBut to add some more:\r\nTired of all the pussy main characters?  Tired of authors redefining the main characters at whim?  Tired of nothing but boobs when you want action?\r\nHagure Yuusha no Estetica is like a direct response to \"Hey we want something bad-ass for once!\"  I watched the first episode and was hooked. \r\nAkatsuki is simply the man I aim to be.  Complete bad-ass-ery from start to finish in every single episode.  Another strong point is Akatsuki's power - while he is over-powered, he opted to train in a different fighting stylethan the typical magic user.  It brought back some memories of DBZ, especially in fight scenes - which there was no lack of.\\n\\n\r\nThe art is more than decent enough, same with sound.  All the characters were interesting and entertaining.\\n\\n\r\nThe story was beautiful.  It's original, but unfortunately it does not look like we'll get another season.  It could have been better in terms of 'execution' as other reviewers have said, though that does not take away from the fact that this anime was completely amazing and we could use a hell of lot more like this one.\\n\\n\r\nI definitely recommend any shonen lover to watch this anime.  \\n\\n\r\nBTW, its nothing close to HighSchool DXD in terms of 'hentai', I see the hints of it as testament to Akatuski's bad-ass-ery.",
            "date": "2014-03-01T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 134299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rikkotec",
                "username": "rikkotec"
            },
            "url": "https://myanimelist.net/reviews.php?id=134299"
        }
    ],
    [
        {
            "content": "Ok let's make this Quick...\r\nI watched this series, finished it.. This series has a lot of good sides.. Good animation, good girls, good story..\r\nI would like to comment on the following points that I noticed in the series..\r\nStory (8)\r\nThis series has a good story.. It's a combination of school life, fantasy, action etc.. You know.. the generic genres in creating a shonen anime.. But, of course, this kind of elements will always be a hit..\r\nEven though the story was good.. there's this kind of boring parts in the series.. You know.. things that didn't really matter in the main story and stuff..\r\nOverall, just finish it...\r\nArt(8)\\n\r\nNo question about the art.. I noticed that the Art style of this series is somewhat the same with the animation of Legend of Legendary Heroes.. The animation of Akatsuki and the other characters are good... Just saying..\\n\\n\r\nSound (5)\\n\r\nYou know what.. I am a kind of person who likes songs that will make my heart jump or make my head bang... The theme songs of this series didn't gave me that feeling.. Well, it does not affect the main series after all.. Just saying..\\n\\n\r\nCharacter (7)\\n\r\nI'm going to say that Akatsuki, the main guy, is awesome.. He is the type of main character wherein his power was established at the start of the series.. You can sense the awesomeness from it.. Aside from the awesomeness, there's this good looking aura that makes the character more suitable to the perfect hero type..\\n\\n\r\nHmm... Then here comes Miyuu.. the so-called sister of Akatsuki wherein in reality sense they are not siblings (SPOILER ALERT: Miyuu is a daughter of someone whose identity is very great).. OK, I really want to voice out my opinions about this... If I'm going to recreate the story of the series, I will not make Miyuu the sister of Akatsuki.. Why? It's because of the potential love team that can happen between them.. That's what the poster is trying to tell us... Damn poster!! You did a good job of turning my head upside down!!\\n\\n\r\nBottom Line is that, if there will be a Ecchi scene between Akatsuki and Miyuu, it is better to write that they are not siblings... AHAHA! Just saying...\\n\\n\r\nEnjoyment (8)\\n\r\nI think I have 3 reasons why I enjoyed this series\\n\r\n1) Action scenes  \\n\r\n2) Potential sequel season - Well if you finished watching this, you will definitely sense that there's more to it..\\n\r\n2) The skill of Akatsuki - Akatsuki has a special perverted technique that utilizes the speed of hands.. That's great... Check it.. HAHAHA\\n\\n\r\nOverall\\n\r\nI'm sure you noticed that there's more to the series... The series will give a lot of clues about what's going to happen next.. In my opinion, when I finished the series, there are things that didn't satisfy me.. Looking at the bright side of it, it awakened a sudden urge inside of me that I must watch the sequel... if there's a sequel.. The series did a good job of making me craving for more..\\n\\n\r\nI'm sure you're going to feel it..\\n\\n\r\nWell, that's all\\n\\n\r\nLightningSnow :)",
            "date": "2012-10-25T09:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 75881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lightningsnow",
                "username": "lightningsnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=75881"
        },
        {
            "content": "Edit: I came back to this review.  Reviewed the review, and decided that I was too lenient on it.\r\nWe'll get straight to the point here, I am somewhat tolerant of the MC.  Sure, he's on the far other side of the spectrum when it comes to harem mains, but that's not exactly a good thing either.  I'll get to that later:\r\nStory: 1\r\nThere is no story.  If someone asked you what it was about, all you can say is this: Over powered main character literally plays with girls until episode 10.  That's it.  There is no overarching main plot, welluntil episode 10, there are numerous subplots though.  Pathetic romance plots and one actually very notable inner conflict in the main girl (Miyu).  Other than that, it's the very definition of EPISODIC.  And it's not even good episodic\\n\\n\r\nP.S. They left room for season 2.  Which we're probably not going to get because the author is busy with Shinmai Maou no New Testament...or something else. \\n\\n\r\nArt: 3\\n\r\nNothing too good, nothing too bad.  Average.  Character designs are good though.  They do laze at some episodes though, lowering the detail a noticeable amount.\\n\\n\r\nActually scratch that, the art is pretty bad.  It was one of the reasons I actually dropped the show after half way through the first episode.  Kinda wish I kept it dropped.\\n\\n\r\nSound: 5\\n\r\nAverage.  No comment.  OP and Endings are what you would expect.\\n\\n\r\nCharacter: 3\\n\r\nAnd probably my most controversial rating.  The characters.  They're all stock characters.  There's the tsundere, the easily embarrassed main girl, the perverted girl and the class president that is actually the most normal out of them all.  Then there's the main character.  He's actually a \"good\" main character, though I do have a few issues with him as a person, I won't let that affect my ratings (and so...his personality affected my ratings).  He's boring.  He's cool (arguably), he's funny, and he's BORINGLY over powered.  He gets no character development, he gets NOTHING.  He remains the same throughout the entire season.  And he's STUPIDLY strong too.  He's the type of strong that makes you go like, \"Yerp, he's going to win.  Oh, he's going to win again.  Yup...winning...again.\"  That's how strong he is.  I would compare him to Saitama (OPM), but they actually make a joke out of Saitama.  He has ABSOLUTELY no reason to be this strong.\\n\\n\r\nEnjoyment: 6\\n\r\nDespite the crap I said and the low ratings, I actually did enjoy this, a little.  The humor was nice even though it didn't make me laugh (I don't laugh to anime for some reason).  You'd like the humor and the situations each character gets into.  It's actually the only reason I kept on watching.  The fight scenes however, they're something to be desired.  You never really care what happens to the characters in fights since - well - we all know what's going to happen.  MC somehow wins because plot armor and he's OP (even the OVA crossover with Queen's Blade illustrates this).\\n\\n\r\nOverall: 3\\n\r\nThere is NO story (until like...10).  The art is average.  The sound is average and forgettable.  The characters are stock and one Gary Sue.  We get a FAIR amount of enjoyment out of it, though don't expect much out of...well anything.  It's almost like a poorly written author self-insert when you think about it.  The type of situations you day dream.\\n\\n\r\nOverall, this show is crap.  After coming back and reevaluating my review, I can firmly say that this show is garbage and the author is right to keep it on hiatus and work on better things (Shinmai Maou).",
            "date": "2015-12-06T06:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 204904,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4974141.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sonicfanx1",
                "username": "Sonicfanx1"
            },
            "url": "https://myanimelist.net/reviews.php?id=204904"
        },
        {
            "content": "This anime tries to do to many different things. It tries to be funny but I didn't laugh once while watching the show. It tries to be action packed but the main hero is so overpowered it isn't interesting and you find yourself not caring about the outcome. This show also decides to be an ecchi anime, but the ecchi aspect of the show isn't the main point it  just ends up making the show worse. The show had an interesting concept, but it just ends up becoming a mess. The art was pretty good. The sound was fine nothing special but Funimation didproduce a good dub. The characters were poorly written and I didn't care about any of them. I really did not like this anime, but I don't think this anime is necessarily bad it's just about average.",
            "date": "2015-03-01T14:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 181470,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4338989.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChocolateGIjoe",
                "username": "ChocolateGIjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=181470"
        },
        {
            "content": "Story: Amazing story even though it ended abruptly. This was a very engrossing anime that took a new spin on the \"hero from another world\" type of anime where those same other-worldly heroes end up back home\r\nArt: Visually pleasing, modern anime style.\r\nSound: Nothing too stunning but overall pleasing, including average intro/outro soundtracks.\r\nCharacter: The main characters were surprisingly well-developed in such a short amount of time with seemingly little background episodes. This leaves the viewer with a cast of \"old friends\" who you find yourself not wanting to say goodbye to at the final episode.\r\nEnjoyment: Overall a slightly different twist on the over-powered pervy male protagonist.A strong plot with just the right amount of ecchi/fanservice added in with comedy and seriousness to boot.\\n\\n\r\nOverall: A well balanced, great weekend anime, however it was far too short with the amount of depth the characters and plot were given.",
            "date": "2014-11-30T15:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 170527,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4288037.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lord_Aragorn",
                "username": "Lord_Aragorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=170527"
        },
        {
            "content": "Its definitely a breath of fresh air in many aspects from your typical action/fantasy series.  Definitely a strong male lead who isn't afraid of harassing the nearby girls.  However, it shoots itself in the foot as it feels like we've been shoe horned into a confusing plot line which is described as vaguely as possible to try and make the show look cool.  \r\nThe characters are definitely the shows most redeeming feature as the protagonist is the complete opposite of the shy ecchi harems you normally see.  He is portrayed as a panty snatcher, molester, and peeper in a good light.Its kinda hard to describe but the girl victims do the kya screams while believing that he isn't really a bad guy at heart.  However its merely a fresh twist on an old cliche to be honest.  As the show goes on you get somewhat tired of his antics.  Its like an original idea that was really poorly done to be honest.  \\n\\n\r\nAs far as the harem and ecchi bits go, its the picture perfect cliche of the harem/ecchi genres.  However like I said, the daring protagonist who openly gropes his harem girls to their chagrin does add a fresh twist to it.  \\n\\n\r\nThe art and sound is pretty standard.  Nothing particularly high tech, but nothing particularly bad either.  Basically very little is animated in each of the scenes.  Its an ecchi thrown out their because people will buy ecchis no matter what.  \\n\\n\r\nThe story is by far the worst part of the show.  The entire time I watched it I felt like they just threw out one half explained idea after another.  They throw in new characters who's back stories are left a complete mystery but they are treated like front row side characters.  They add in all kinds of weird plot elements which are never explained past being introduced.  The whole thing felt so sloppy I was tempted to drop it half way even though I consider myself to be a part of the niche audience this show was aimed at....",
            "date": "2013-02-18T01:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 87117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DarkD1",
                "username": "DarkD1"
            },
            "url": "https://myanimelist.net/reviews.php?id=87117"
        },
        {
            "content": "I can say this was a great anime. There were gaps and holes and a lot of things i didn't like but i was thoroughly entertained the entire time! First I would like to say I haven't read the novels an all speculation is based solely upon the anime. What I can say from the start is it takes some getting used to knowing that there is this massive back story that we didn't get to see and that there could be enough content for a prequel season however after the fourth episode that stopped bothering me as some things were being explained. I likedthat they used flashbacks but didn't completely kill you with them. They were moderate and gave the info they needed to.\\n\\n\r\nThe only thing I disliked about the anime was throughout the first half it was almost entirely fan service with only a little action. Sure one would expect it to have ecchi in it but i was expecting much more action. I dove into this anime expecting a lot of action and got a lot of boobs. Not that it is a major complaint since this was however satisfied very quickly after the first few episodes. the anime was a little spotty with the story, a plot never really made itself present. At points it seemed like we were getting glimpses of a plot but in then turned out to be miniscule with the constant revealings of other plot points. \\n\\n\r\nGOD FUCKING DAMN! Akatsuki's badass level is OFF THE CHARTS! I love this character quite a bit. He has amazing power and the author didn't screw up by making him overpowered because in fact the author made him unable to use magic bearing a weakness however he is just so badass that he turned his weakness into a strength. All the other characters are very well thought through although none are as captivating.\\n\\n\r\nThey really did kind of force a second season and I really hope we get one! I don't necessarily like reading action light novels because much of it is visual so I hope the anime adaptation carries on. Many things were left lingering and I feel as though this season was barely scratching the surface because the only time a clear plot was in fact introduced was at the very end of the season. They left way too many things lingering but that's because they were probably just following the novels. This anime is well worth watching and I really hope we will get to see a second season.",
            "date": "2015-01-02T14:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 175795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1421291.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/djl1010",
                "username": "djl1010"
            },
            "url": "https://myanimelist.net/reviews.php?id=175795"
        },
        {
            "content": "Great series, but canned after first season.\r\n1. Story - The episodes are full of action, with plenty of funny moments and few dull ones. There is a little bit too much fan service in the show for me personally, but I'm sure others will love all the boob and panty shots. I think they expected this to go for several seasons, so much of the overall story is an unknown.\r\n2. Art - Okay, I thought some of the characters faces looked a bit too round and for some reason, whenever faces are like this, they seem lacking in detail. They also use hair colours likepink and green.\\n\\n\r\n3. Characters - The protagonist Akatsuki is a cocky jerk, but still comes off as cool rather than a perverted creep. The lead female, Miu is a little whiny at times and she has ridiculous sized breasts. She doesn't seem to do much besides provide fanservice and need rescuing. Even so, I grew to like her character more towards then end of the story. The only other character of note is Haruka. Haruka came across as a bit of a bitch at first, which made it more fun watching Akatsuki mess with her. I grew to like her character quite a bit though. \\n\\n\r\n4. Overall - An enjoyable action comedy, marred by the fact it got cancelled after the first season. \\n\r\nYou will probably enjoy this if you liked High School DxD, Testament of New Sister Devil, Sekirei or Maken Ki.\\n\\n",
            "date": "2016-01-13T05:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 208423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5125927.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jezza_G",
                "username": "Jezza_G"
            },
            "url": "https://myanimelist.net/reviews.php?id=208423"
        },
        {
            "content": "If you like overpowered heroes and overpowering ecchi, you'll like this.  It has a lot of interesting pieces, but doesn't utilize them, instead focusing too much on the sex stuff.  A lot of parts can actually be considered softcore hentai in my opinion.  \r\nI enjoy the overpowered hero genre, which is why I am disappointed in this.  The series sets up a number of possible plots that could fill a second season on their own, but it has never had a sequel and really doesn't deserve one.  \r\nI would say it's worth one view and then can be forgotten, butit's definitely not for everyone.",
            "date": "2017-04-13T19:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 245429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dunedane",
                "username": "Dunedane"
            },
            "url": "https://myanimelist.net/reviews.php?id=245429"
        },
        {
            "content": "**Some Mild Spoilers**\r\n This anime is something else. It's like they decided to build a story around a character that can be likable but can also be despised all at the same time, but strangely enough it works and it is what really got me to enjoy this anime to begin with.\r\nThis anime tells the tale of a character that at the very first episode he conquers and defeats a dark lord and fulfills a promise to the dark lord to look after his daughter. Once he returns to his home world he takes the dark lord's daughter back with him. This anime strictly focuseson the antics of him and and the dark lord's daughter as they return to Earth and they get enrolled into this school because of their skills in combat and magic. Unfortunately things are never that simple and bringing the dark lord's daughter into another world brings its own share of problems.\\n\\n\r\nThe story of this anime is forgettable because it leaves way too many loose ends and while by the end of it the main aspect of the story is tied up it does end on a cliffhanger without anything being truly resolved. All throughout this anime, it constantly builds toward a confrontation between two characters and unfortunately it this conflict does not happen. This anime literally leaves you with more questions than answers but ultimately it gives you one hell of a ride.\\n\\n\r\nI think the biggest thing working towards the enjoyment of this anime is the character development of the main hero. I'm so use to male and female protagonists being reluctant heroes and trying to find their place in the world that they are presented in. This guy however, knows he is strong and he is definitely one of the most pompous, arrogant, and egotistical heroes you'll ever meet and his fair share of overly perverted moments can make him a very despicable character. If you look past the surface of the main character you can see that his heart is in the right place because he truly does care about the people around him, he does take the burden of trying to do it all without putting anyone's life in danger, and he truly believes he is doing the right thing when it comes to protecting the weak. This anime has some pretty hilarious laugh out loud moment that revolve around our titular main character especially when it comes to him contributing to the fan-service of this anime.\\n\\n\r\nUnfortunately we come to biggest strike against this anime which is the uncomfortable amount of fan-service and its definitely not going to shy away from it. Can we please at least have one episode where any of the female characters aren't completely naked. The thing its totally expected to have a little bit of fan-service in most anime, but this one definitely has the most out of any anime I've watched. I think the worse thing is that it really straddles that line between something that is considered r rated to something that may be considered x-rated. It never goes past that line but it comes pretty damn close. If you like your anime with a lot of fan-service, than you'll get your fix with this anime.\\n\\n\r\nThe main hero is the real strength of this anime because he parades around the story like an epic bad-ass and its actually a different take on a hero than most anime that I've seen and it does have potential but it never has the length to reach that potential especially with its story. With the humour and the majority of the action focused on this character, its interesting to have a main character in an anime that you can like and hate all in the same moment. I wasn't fond of the ending and opening songs of this anime but overall I did enjoy the action and the humour. Overall, sometimes all it can take is just one character to make an anime really enjoyable. If it wasn't for this character than this anime would of been an uncomfortable snore-fest.",
            "date": "2019-05-01T20:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 307605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4402761.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheCompletionist",
                "username": "TheCompletionist"
            },
            "url": "https://myanimelist.net/reviews.php?id=307605"
        },
        {
            "content": "My number one ecchi harem male lead anime.\r\nThe art is kind of old IMO and I wish for more \"modern\" art style but once you get hooked, you stay hooked on all of it.\r\nOusawa Akatsuki is probably the best male lead of all the anime I've seen. And I've seen LOT of them, especially from this genre. \r\nI like the story LOT, which is saying much because other anime have kind of always highschool bla bla meh stories. This one has a captivating story and I regret not knowing more of it because not much is shown as his life before the story this animeis based on.\\n\\n\r\nHe is perverted, honest, masculine and no pushover. He always knows what to do, when to do it and how to do it. Some critique though is that he is kind of a stone statue in some ways. He doesn't show desire too much and is kind of condescending if you dislike his attitude. But that's personal taste IMO.\\n\\n\r\nI desperately want more seasons, but I doubt they will come.\\n\r\nI would DEFINITELY recommend it to people that like this genre.",
            "date": "2015-03-03T09:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 181623,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=181623"
        },
        {
            "content": "Hagure Yuusha No Estetica.\r\nWell it's not the best show out there, but it's also not the worst.  I'f anything It will be a hit or miss show with you.  With a low bar for hit's, by this I mean that even if this show appeals to you, you'll most likely end up ratting it an 8-6 at best.\r\nPlot 4/10\r\nBy far the weakest element here, the only reason I'm giving it a 4 is because I can tell they really tried to add a real story to this.  Unfortunately despite there attempts people will find the story to be somewhat annoying, as thecharacters are constantly referring to events that we have never seen.  there are no alliterative flashbacks, and at some point the viewer will start to wish they were watching the story of what happened before the demon king was killed, because that sounds a lot more interesting the whats going on now.\\n\\n\r\nart 4/5\\n\\n\r\nthe art is fine, BUT O MY GOD DO YOU HAVE TO MAKE YOUR PICTURES SO BRIGHT.  And i'm not talking shiny bright i'm talking diluting your pictures with a extra shade of white.  \\n\\n\r\nAlso I'm not a fan of how some of the characters faces are fat.\\n\\n\r\ncharacters 7/5\\n\\n\r\nKuzuha. the saving grace of this show, you have no idea what a relief it is to watch a show, and see that the main character is not a pussy. \\n\\n\r\n-bad guy in front of you, i'm going to beat his face in.  \\n\r\n-girls with bathing suits, fuck consequences i'm taking those off.  \\n\\n\r\nIn terms of what the designers wanted they nailed the badass part down perfectly and that counts for a lot with me A LOT.  That being said I still can't figure out why he was such a ass in the begining…\\n\\n\r\nmusic 5/5\\n\\n\r\nnot much stands out. but it does it's job",
            "date": "2012-08-24T07:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 70751,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1313729.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HD_survivor",
                "username": "HD_survivor"
            },
            "url": "https://myanimelist.net/reviews.php?id=70751"
        },
        {
            "content": "Lion Tamers! We try again to like another harem anime.\r\nI managed to marathon all 12 episodes in less than 2-days, which was fairly easy, because then I skipped most of the opening music, and closing music. All of which was really not very good. I even went against my own principles in marathoning the show, just to try to find good things about the show.\r\nAs some of you know, I dislike j-pop hi-speed rhythm music. While theses musical pieces were made to sound reminiscent of \"Unbreakable Machine Doll' the end product was not anywhere near as memorable. The singer for the opening theme song, wasquite good, and I felt sorry for her; as she was stuck trying to make something out of a song played more than twice as fast as necessary. \\n\\n\r\nThere was actually a tune, and almost had some noticeable harmonies there, but most of the things I was willing to like about the songs, was hidden in all the screaming guitars, and hi-speed playback. It almost felt like the music composers and arrangers had it in their minds to hide the good parts intentionally. Oh well, these people that annoyed me, and my musical sensibilities should be horsewhipped, but I'm killing too much time already in talking about the unmemorable music.\\n\\n\r\nI DID however like the soundtrack sounds and musical riffs. Not bad at all. There! I said it. Something good about the show.\\n\\n\r\n***\\n\\n\r\nNow I want to talk about the Story. I will save the characters for last. I know, that's backwards, even for me, but there's some bass-ackwards stuff in this anime anyways. And I'll get to that too.\\n\\n\r\nThis story does have a few items that are clearly innovative. But the plot I wanted to see was the one they hinted at thru the whole anime, and we never got to see it. And we never will. Don'tcha just hate that? We'll get to that, but let's get to the main story.\\n\\n\r\nOkay, I'm not gonna get into a lot of story specifics, but I do want to mention a few basic ideas from the plotline, in passing, that I found interesting. Careful about the phrase \"May you live in interesting times. \" This was an old Roman curse. So careful what you wish for.\\n\\n\r\nAnyhow, we have a inter-dimensional rift story here, where people from other places come into a second place (always the same first destination), chase girls, sometimes even a queen or a princess or two (most of the new arrivals are male Americans, I love that (grin)), then they get bored and go home. No apparent offspring launched out at me as a viewer. So all is fun and games.\\n\\n\r\nAnd oh yea, when you're in this other land, you have to learn weird old english, in the floweriest of terms. If you don't speak as they do, they turn to their fellows and say things like; \"Avast, hast thy knave lost his reason, or mayhaps he is a stranger!\" Which of course confuses our visitor, and in the case of our main character, prompts hm to bash a fellow in the face, or strip a girl from her undies. \\n\\n\r\nWhich they would not have been wearing in such a backward culture anyway. People tended to be, in past eras, let's see, how do I put this; oh yea, Rita Rudner had a great phrase \"... Naked under my cloths ...\" Undies were not present, even for rich people. But without the undies, we would have lost more than half of the fan-service. Which I like, as long as people don't get hurt from it, or gets in the way of telling the story. Which happens in this story. A lot!!!\\n\\n\r\nLet's describe the culture as best we can. I counted a lot of women in this show. And some fellows, but mostly women. After all, if one expects to have harems in any culture, you would want a culture that contains sufficient women that most men who want a harem can have one. Right?\\n\\n\r\nAnd not one of these women can be over the age of 22, and none of them can be fat, and they can only be flat-chested if they are under the age of 14. And the male population are inconsiderate bastards, almost uniformly; which these females mostly go head over heals over. Cool! There's reality for yah!\\n\\n\r\nBoth worlds, Earth (maybe, just a guess) and this other place, operate in the above fashion, although the Earth demographic seems to be slightly more balanced. But not by much, barely noticeable.\\n\\n\r\nLook folks, I like a little fantasy as much as the next fellow, but this is stretching a lot of my ability to suspend disbelief.\\n\\n\r\n***\\n\\n\r\nNow I wanna talk about dialog. I like good dialog. But I have to say, when the male hero is talking his future girlfriend out of committing suicide, it is a good idea to keep one eye on that giant ***Dragon*** trying to fry you two to atoms. This is exactly what happened in one of many scenes, which began to resemble a Shakespearian rendition of Hamlet;\\n\\n\r\n \"Alas, poor Yorick! I knew him, Horatio: a fellow\\n\r\nof infinite jest, of most excellent fancy: he hath\\n\r\nborne me on his back a thousand times; and now, how\\n\r\nabhorred in my imagination it is! my gorge rims at\\n\r\nit. Here hung those lips that I have kissed I know\\n\r\nnot how oft. Where be your gibes now? your\\n\r\ngambols? your songs? your flashes of merriment,\\n\r\nthat were wont to set the table on a roar? Not one\\n\r\nnow, to mock your own grinning? quite chap-fallen?\\n\r\nNow get you to my lady's chamber, and tell her, let\\n\r\nher paint an inch thick, to this favour she must\\n\r\ncome; make her laugh at that. Prithee, Horatio, tell\\n\r\nme one thing.\"\\n\\n\r\nMeaning, in not to make too much a point on it, there was too much dialog, in about half the episodes. And the dialog was irrationally placed at points, where large speeches got in the way of timely and pressing events. Like big fights, or strong conflicted differences of opinion.\\n\\n\r\n***\\n\\n\r\nAnd now I get to the characters and their juxtaposition. What we have here is a form of double reversal of roles here.\\n\\n\r\nThe male lead is Goku, from DBZ. I realize that is very brief, but there is literally nothing else. He even glows in the dark like Goku when he gets really, really annoyed. He postures like Goku. He has the bravado of Goku. He even yells often about needing 'more power' or the lack of it, and makes insinuations that imply that it would be nice if he could strangle his opponent to death, it would make him quite happy, like Goku.\\n\\n\r\nThe female lead, playing his non-related sister from the other world, plays a meek and mild little person, that before the end of the show grows into a person who isn't bashful about anything (she gets her fear muscle completely burned out of her by the events of the anime).\\n\\n\r\nMeanwhile, this little cutie is the biggest chested girl in the anime, of course; and shapely, quite pretty and has a nice little sweet name \"Miu\". Sounds like the cutest little lap-kitten on the face of the earth. And she becomes this little piece of heaven, as the show runs along.\\n\\n\r\nMind you, she is the daughter of the nastiest Dark Lord and King of the dark and putrified forests of the other place. Yep, she's just gonna be sweetness and light, upon everybody she meets. I believe, I believe; yes I believe I will have another piece of pie. The authors have GOT to be kidding me.\\n\\n\r\nWe have a lesbian girl who attempts rape of at least one girl in the locker room of their school, and everybody is just fine with that. Putting aside she's lesbian, that's still unwanted physical assault. Lemme try that again. That is unwanted physical assault. And should have gotten her expelled and jailed. If a fella had done that in the show, he would have had a wonderful view out his window at the graybar hotel.\\n\\n\r\nWe have an entire student body government that behaves like the Nazi High Command. And that never changes through the whole anime, even when they begin to see reason. They're still rude, officious, crass, and generally ill mannered. Oh yea, I fergot. They lean towards dumb as lawn fertilizer, eventually taking all their productive leads from our main hero, with strong misgivings, and still blaming him for everything.\\n\\n\r\n****\\n\\n\r\nWere there things I liked? Yep! I liked that Miu was is a lovely sweet girl that can be talked into anything, because she trusts. A rare and pleasant characteristic. I didn't believe it for one second, but it was cute.\\n\\n\r\nI liked the artwork, most of which was the stuff which has become standard fair from Funimation, Lantis, etc.\\n\\n\r\nI liked that our crass and irritating super hero from the funny-farm does actually feel some responsibility for his actions. It's hard to find, and he wrecks havok upon all observers, including his own friends, by doing something really, really thoughtless. A lot! But if he wasn't that lovable guy we have known and enjoyed, hell most of that fan-service would never have got off the ground.\\n\\n\r\nOh! I almost left out a complete thought. Shame on me. The hinted at subplot is the one I wanted to see. Not more of. It should have been the material for the entire main plot, and now requires a second season to actually do anything about. Which we will never get.\\n\\n\r\nThat plot is the hinted at Star-Chamber, operated by Kyouya Hikami, a very potentially mean element, and subplotted again by  Motoharu Kaitou. Ostensibly these characters and others, are involved in silencing opposition to stable governments all over the world, via the use of their superior super-magic. The sub-text is one of domination of lesser mages, and the destruction of all forces that would contest their power.\\n\\n\r\nBut we don't get to see that. And as I've said, we won't either. Oh well, nuts.\\n\\n\r\nI give \"Hagure Yuusha no Aesthetica\" a strong 6.\\n\\n",
            "date": "2015-06-18T16:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 190574,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KD7BWB",
                "username": "KD7BWB"
            },
            "url": "https://myanimelist.net/reviews.php?id=190574"
        },
        {
            "content": "As various others have mentioned, this anime has a main character who isn't wimpy, which is a great change from the usual. It's also the opposite of some fantasy stories where someone is thrown into another world and has to gain powers to save it. Instead, Akatsuki has already been through this, and is ready to return home after defeating a demon lord. What is more interesting is that this is a common event, and there is a school, aptly called Babel where people hone their skills from other worlds. \r\nThe main character can't use magic, but can manipulate the \"energy\" of his opponents bodies,which is also something new. He also doesn't give the speeches about friendship etc that other shounen heroes tend to give. He stands up for the weak, is a pervert and has power. \\n\r\nThe anime itself has elements of fantasy/magical/supernatural, ecchi, and harem. The harem part I usually hate, but it's not so bad here, if predictable. The ecchi is a bit pathetic in how they bring it up in most episodes. I usually love fantasy/magic anime, but I'm still unsure about this one. \\n\r\nI'm beginning to think I'll be disappointed in the second half of the series. \\n\\n\r\nStory- 6\\n\r\nAfter 7 episodes there still isn't much of one, but there seem to be some interesting developments thus far. It will either turn out grossly predictable, or will have some sort of interesting twist, hard to say so far.  There has been some interesting foreshadowing of events to come, and some characters who may not be all they seem, but the story thus far seems more \"how can we get Miu naked?\"... I don't care about fan service most of the time, but to dedicate an entire episode to her picking out a bra and getting her breasts fondled by a shopkeeper and the guy who is posing has her brother... yeah, it's just pathetic. The most recent episode I stopped watching after the girls entered a contest of tag that results in removing someones bathing suit. It's just stupid to dedicate 2 episodes (thus far) out of 12 to fanservice. You have an interesting story, develop it! If you want fanservice, fine, but you can include it while developing a story...\\n\\n\r\nCharacter- 7\\n\r\nThe main character is a welcome change from similar guys in his position. However, he tends to rub me the wrong way sometimes. I still like him though, it's nice to see a main male character that's tough and has elements of fanservice. Little is known about him, thus far he has been revealed to be arrogant, strong, perverted and with some intelligence. But he has to be the one to save the day, which is a little too predictable.  Like in a recent episode where I thought we would get so see some different characters kick ass, out he comes, completely out of nowhere to save the day. You're allowed to have more than one kick ass character! He's the \"bad boy\" type, who secretly has a kind heart. \\n\r\nHaruka is perhaps the most predictable of female characters. She's the bitchy annoying one that gets in embarrassing situations while having it in for the main character, but then will eventually develop feelings for him.  \\n\r\nThe characters just aren't that great. I like the new blonde guy, because he seems to have his own agenda, but otherwise they are all pretty predictable. \\n\\n\r\nArt and sound are fine, the art isn't as good as many I've seen, but not too bad either. As for enjoyment, thus far I'd give it a 6, but I'm hoping it will be able to change that in the second half!\\n",
            "date": "2012-08-22T00:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 70571,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/247399.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Galactic_Kitten",
                "username": "Galactic_Kitten"
            },
            "url": "https://myanimelist.net/reviews.php?id=70571"
        },
        {
            "content": "This was a pretty good anime. I really love the characters and the story is decent. It has epic powers and fights. The nudity in it was very sexy also. Another thing I like about it is some of the characters were voiced by some of the people that voiced characters from anime that I really love. The main character is such a bad ass especially with his fists. The anime has a good amount of comedy scenes. The only bad thing about it is how they ended it\r\nIf you want a great action anime with sexy ecchi scenes then this is the anime foryou.",
            "date": "2018-01-22T19:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 269380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6027366.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Patrick_Anime",
                "username": "Patrick_Anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=269380"
        },
        {
            "content": "3rd review. Please treat me well.\r\nThis could've been good. This could've been an actual honest-to-gods properly done good harem anime.... Where did it all go wrong???\r\nStory: 3\r\nThis story had an interesting backdrop where a hero finished mopping up the demon lord and brought back his daughter as souvenir. So where did it go wrong?? Well first off, they started the series off right when he was leaving the fantasy realm after defeating the demon lord, therefore he was already immensely powerful, so powerful that he could potentially win every single battle, single-handedly. Here was an MC that could literally be god due to how powerfulhe is. A good comparison would be to say that his rpg gaming level is 99. Or perhaps... \"Vegeta. What does the scouter say about his power level?\" \"It's over 9000!\" But seriously... It might as well have been that way. He may not be one of THOSE current conventional hero MCs, where they are emo edgelord \"badasses\" that they have a fancy sabers and wields lots of powerful spells making them pseudo mage knight or \"Hero\" class, because he can't use magic at all. But instead he got something else.... Something that renders magic almost completely obsolete. A martial arts ability called the Linked Energy Manipulation. Have you ever heard of the \"plot armor\", where a character can never truly die or know defeat? If you have, know that that ability that he wields is what I dubb with my own little coin term as the \"plot sword\", where an item/tool/weapon/ability is so powerful, it might as well be on the level of godlike ability that cannot be overcome. And that's exactly what that ability was. It made him... Nigh invincible. Able to perform feats that is almost on the level of Dragonball Z... So don't let that huge black sword on the cover shot of the series fool you. That's just the bait. And also despite its cool colors and whatnot, its design is pretty ugly in terms of badass looking anime swords... Anyways, his real power comes from that ability, which he even boasts it as such himself. And that makes him do a lot of things from swiping girls' underwears without them noticing or feeling a thing or him giving the beat-down to every opponent he ever faces. So if you're expecting some kind of character development or progression by walking alongside him to his goal of fame and glory? Pft. Forget it. He was already there. It's like arriving late to a party while almost everything is gone. Now it's just the slight after-party you would have to settle for. And that's what this all was. There was no serious threat or overarching story. He just came back, got enrolled into a mandatory school, just so he can fight them? And they want to see if he's the so-called \"true hero\"??? Anyways, this story was brought together all so poorly that when the ending came... One could be left wondering \"What did I just watch? And what can I take from all of this?\". Another sad thing was that he was mainly in a futuristic Japan setting where technology and society has progressed a lot esp when recognizing the existence of many other worlds/dimensions including the fantasy one that he conquered. Unfortunately the world he went back home was not much explored beyond his school. And the fantasy realm was almost left forgotten until the literal \"tune-in next season\" cliffhanger cliche at the end that foreshadowed its importance. But otherwise.... A complete mess. \\n\r\nA good potential material of a backdrop plot, don't get me wrong. But it was all done SO poorly. I mean a powerful sentient bike where it only ever accepted his father, but somehow accepted him in mere seconds and off-screen no less? WTF????\\n\\n\r\nArt: 8\\n\r\nThe art was honestly VERY good. Everything looked bright and shiny as to give off some kind of majesty or high quality. Of course, it's not on the level of a AAA anime, but it got the job done. Even the ecchi scenes were very engaging. If you know what I mean. \\n\\n\r\nSound: 4\\n\r\nHonestly can't remember the music. And I just watched it for the first time few weeks ago. That should tell you how impressionable it was. The voice acting and sound effects were fine I guess. But nothing that stood out and made me say \"OMG!\".\\n\\n\r\nCharacter: 3\\n\r\nOh here we go. Other than the story, this is the main bread and butter. \\n\r\n... And they utterly disappointed. His attitude is one of arrogance and confidence. But don't expect some development because he never gets into a vulnerable spot. Of course, that makes some Western audiences go all googly-eyes for a char like him that is not emo edge lord or a walking mess or sissy MC. But as such... He is not very relatable at all. He might as well be the Sylvester Stallone of anime where he can commando everything if he wants to and gets the girl in the end. Utter walking mass of muscle perfection. Which is a doubled edged sword, since not everyone is not looking for a male fantasy power trip or already perfected/flawless character. Then there is the main heroine. If you're looking for a character development there, then nope. She only falls for him like a good damsel in distress would. But she offers little to no help in terms of battles or overall plot progression. She tends to be more of a nuisance, like that the princess that keeps getting captured and you gotta go and reluctantly save. That's how \"good\" of a character she is. Otherwise she's worst than main heroine of other Yuusha anime, the one where the MC couldn't be a hero and instead had to get a job. Because as I said, she offers very little to the story since the MC is strong enough to protect her and save the world all in one day. So she's the titular damsel in distress while only being good for eye candy... Although she's pretty much the ONLY main eyecandy. Since like the other yuusha anime I mentioned, she shares same parallels with that main heroine Phino, where their tits are the only tits that matter. You can clearly see and witness all of the hugeness (since it's some kind of unwritten anime rule that main heroines gotta be busty as hell) and shape of their breasts, to even their nipples. But.... That leaves no room for other girls. Sure, there are other girls who get stripped, but nothing is shown that leaves less for the imagination. And worst of all is Kuzuha. She's barely to no reveal at all because of the nature of her character design (her being a small girl aka loli)\\n\r\nAnd there's not much to say about other chars since they are usually pushed off to the sideline, while the MAIN FOCUS and treat that the anime is trying to keep pushing fans towards is the MH aka Miu.... \\n\\n\r\n\"Only Miu deserves your unworth eyes, peasants. Look upon her splendor!\"\\n\r\n-This anime\\n\\n\r\nSeriously, if you are looking for character development or plethora of nice girls being out on display as nice treats for your eyes? Too bad you only get Miu. This is not DxD or even Trinity Seven. \\n\\n\r\nEnjoyment: 2\\n\r\nStory sucked. Character development was very little. Fanservice was so one-sided by favoring a lot towards MH. Honestly I had hoped to see more interactions with cute Kuzuha and pretty Haruka, but alas beyond that single ep of them being the main focus, it was not meant to be. And even in their \"dedicated\" ep, you could count on Miu to be there constantly to be the distracting main attraction that you just can't escape...\\n\\n\r\nOverall: 2\\n\r\nTerrible... This could've been so good! This could've actually had a future more or less the same as Trinity Seven or even better. But it utterly failed...\\n\r\nSad too because this hero could've prolly owned his own harem if he wanted to... If he stopped focusing too much on the MH. I mean I know they are MHs for a reason, but it give a break please. This is why anime harems are never a true thing and can never be truly realized as a harem. It's all a sham. After all, daytime/evening animes or non-hentai animes and games couldn't dare to show polygamy of all things. Therefore, stick with MH because.... They are the MH!\\n\\n\r\nAnyways, as I have mentioned how the MC is fist swinging terminator commando. He was like made for Western audiences. And as such him and his pathetic series did not fare well with our Japanese counterparts and thus bombed so bad that a 2nd season is nowhere in sight. And I for one say good riddance. Even though it left the series on a cliff-hanger, I don't have much hopes or expectations out of a series and MC that is just MH crazed and obsessed. This was one of those hopeful bets that you place on with all of your spending on because it looked so promising, but it quickly became a gut-wrenching train wreck or should I say a \"wrecking ball\" of an anime..... This is definitely by far one of the most guiltiest pleasure animes I have ever seen. And not necessarily a good kind either. If I had to compare it to a game, this wasn't God of War. This was Gears of War... That bad.\\n\r\nSo I suggest that whoever wishes to see a MC to not be a ssisy for once and take names and make all of the girls his hoes, then go ahead. But don't expect much beyond the MH, which he switches his laser targeting to, and any sort of good story. Because there is almost none. Just fanservice up the butt. And only plot to advance the story to make a cliffhanger to have people watch this and stay interested beyond the tits...",
            "date": "2017-09-03T23:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 256853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2652905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/YuriShipper",
                "username": "YuriShipper"
            },
            "url": "https://myanimelist.net/reviews.php?id=256853"
        },
        {
            "content": "Decent harem show after all. Of course you'll probably forget about it after several months, but during show itself you'll have great enjoyment. \r\nStory and plot part were never strong sides of harems, same applies to this one. Story is fair enough to maintain interest. What is kinda unusual is strong main character, this is so refreshing after watching tons of harems with useless main male chars. \r\nIf you want to watch another harem show with cool main male character, decent art and sound, fantasy background, then this show is for you",
            "date": "2013-01-13T13:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 83585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DragonFire",
                "username": "DragonFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=83585"
        },
        {
            "content": "First let may say this was a great anime to watch i enjoyed it, made me laugh and it just awesome... Genres: Action, Drama, Ecchi, Fantasy, Magic, Romance and School life\r\nStory:\r\nIts about a man named Akatsuki who beats a demon king or lord. Right before the lord or king dies he tells Akatsuki to take his daughter with him and to protect her. so Akatsuki takes Miu to his the lords daughter to his world and there is were they meet new friends and start their new life \r\nArt:\r\nThe animation was great there was no problems with the images or the backgrounds.\r\nCharacters:\r\n there's five maincharacters i already mentioned two Akatsuki and miu the rest you have to find out for your self and there's 11 supporting characters  \\n\\n\r\nLike i said i loved this anime i hope this helps you guys and give this anime a try for those who haven't seen it and let if this review helps",
            "date": "2013-01-23T17:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 84633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1962098.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sora760",
                "username": "Sora760"
            },
            "url": "https://myanimelist.net/reviews.php?id=84633"
        },
        {
            "content": "The show basically has its good aspects and bad aspects. The bad aspects would definitely be that the animation and sound were mediocre, the voice acting however was good. For an anime in 2012, and an action anime at that, the animation could have been MUCH better....more colorful, better fluid movements of the characters and so on, instead, it looked pretty much like a \"normal anime\" from 2006, especially when you compare the fact that 2006 brought out some good graphical animes (if i remember correctly). Another ridiculous aspect of the show was the nudity....the sheer amount of nudity was COMPLETELY UNNECESSARY. Even the fanserviceand ecchi scenes were overkill, yet at times important. I mean I get Akatsuki building character and relationships based on his EXTREME YET COOL pervertedness,  but the nude scenes were not necessary for any of them.\\n\\n\r\nThing is though, despite the fact that the animation and sound sucked, the story was REALLY DEEP. It was INSANELY INTERESTING, whereby there is not only room for a prequel; but a sequel is ALMOST A MUST. I mean the reason this show MAY get a bad score by other reviewers is simply for the fact that \"IT ENDED WAY TOO EARLY FOR ANY RECOGNITION\". Its basically like watching one piece or naruto and ending it in the first 13 episodes.....with ONLY that much it basically crap. I'm pretty sure that if this show continued, more people would see the worth of it; its story gives room for a BUNCH of arcs while centering around the main plot of well....real earth with its superpowered organizations. All in all, the story has a 10 point (out of 10) potential, which 12 episodes alone CAN NEVER BRING OUT. So despite the fact that the 12 episodes were NOT THAT GREAT, the potential WAS EPIC. That attributes to the high score that I gave this show.\\n\\n\r\nIn terms of characters, well the class president was interesting, so was the lesbian though she wasn't THAT interesting, MIU was a typical idiot when she was ready but other than that there was potential for her, and the vice president was okay I guess, though she was USUALLY annoying throughout. The blonde hair guy (can't remember his name) was REALLY COOL and mysterious, and I really wanted to see more of him. AND THEN THERE'S AKATSUKI........two words \"EPIC BADASS\". ON EVERY CONCEIVABLE LEVEL this guy was EPIC; in fighting he was SUPREME, in planning/strategizing/reading people he was EPIC, in his way to attract people was ALSO EPIC. This is the HERO WE'VE BEEN WAITING FOR. I mean he is UNPREDICTABLY PREDICTABLE....what I mean by this is YOU KNOW HE IS GOING TO WIN IN THE END, BUT HOW HE DOES IT IS LIKE \"DAMN DIDN'T SEE THAT COMING\". He is simply EPIC and FOR him alone, the score for this show went up higher due to \"THE RULE OF COOL\". The \"RULE OF COOL\" states that when a main character is SO BADASS despite the show being.....okay.....the show gets a higher rating (past shows were cowboy bebop and trigun.....they were great shows but were even greater due to the main characters).....that said Hagure Yuusha is definately a WATCH, BUT only a BUY if the series actually continues, because if it does it would be MEMORABLE IF THE STORY IS TOLD RIGHT!",
            "date": "2012-10-30T07:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 76275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1179185.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/akatsukikaras",
                "username": "akatsukikaras"
            },
            "url": "https://myanimelist.net/reviews.php?id=76275"
        },
        {
            "content": "My last review was one for the best. It seems fair to have one, in which in my opinion is one of the worst.\r\nThis anime, though I can't believe, was finished. Completed. Done. Processed. Though it may be that way, no information can be recalled as I try, with effort and reluctance, to write this review.\r\nThe plot found in MAL is all that I could remember, even some, I was reminded.\r\nIn short, this was very forgettable as I have seen this series just this year. That's just no good. Normally so. \r\nThe story is graded 3. As the powerful cool kid deals this encounters withwhims, many overrated scenarios come to play. Girls, left and right, of all kinds would fall. Enemies strong as they may be, was put down with clear predictability. This was as direct and straight as a horizon, and clearly, the outcome, like a boat floating a mile away, can be seen by anyone with eyes.\\n\\n\r\nThe art is 5. Ordinary and bland. Incomparable from most anime. Perhaps the style is chosen best for the story. Having an ordinary eye for art, I failed to see the difference.\\n\\n\r\nThe sound is 6. The sound seems good. With expertise the same as in art category, you can't trust me in this too.\\n\\n\r\nEnjoyment is the lowest it could ever be. As I think back, I still can't believed I completed this. I make a list of anime I watched and completed and that's how I this got a review. Being an unforgotten anime, I considered that very bad.\\n\\n\r\nThanks for reading.",
            "date": "2016-12-26T15:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 236595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743422.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/animeBee1ver",
                "username": "animeBee1ver"
            },
            "url": "https://myanimelist.net/reviews.php?id=236595"
        },
        {
            "content": "Hey folks, this will be a review for Hagure Yuusha no Aesthetica. This is one of those shows that seems like it would be an example of \"why anime is crap\". However the show is pretty enjoyable.\r\nThe story is jumpy and rather simple feeling for how long they drag it out. People sometimes disappear into another dimension, which seems to be a fantasy world with demon lords and heroes. Sometimes the people that disappear return and are admitted into a special school to train them up to be used by the military. Our main character returns from this other world along side the demon lordsdaughter and enrolls into this academy.\\n\\n\r\nFrom here the story seems to be mostly guess work. Hints are dropped about our main character. Side characters intervene and elude to some hidden and secretive society. The good news is that none of this really matters to what makes this show a fun one to watch.\\n\\n\r\nThe art isn't bad, but not outstanding. There are echhi bits and breasts. Some of the soundtrack was actually pretty engaging but not much else to write home about.\\n\\n\r\nThe characters are simply fodder for our main character to show off with. The demon lords daughter is a busty shy and simple girl, the class president is the smart grade school loli, and the lesbian tomboy girl is the third main side character. Most of these characters will have situations develop around them in which the main character can swoop in and save them from. Most of the saving I should point out is talking and being kind and bringing everyone together, with some naughty things thrown in the mix.\\n\\n\r\nNow I enjoyed this anime the first time I saw it and this time was also enjoyable. It wont win awards for story, or deep characters. People get to wrapped up in that stuff and don't allow for these simple shows to be entertaining.  Akatsuki(the main character), is the definition of OP, and manliness. Throw a situation at him and he will knock it out of the park in the simplest and most envy inducing way. Tsundere Vice president making your life difficult, steal her panties and shut her up. School bully making a fuss and interrupting your conversation, kick his ass and bully him for the rest of the show. Someone poisons you, heal yourself with chi. The list goes on. \\n\\n\r\nI like intelligent story and thought provoking characters as much as the next person. However its really nice to shut off your brain and have a show present itself without the normal tedious interruptions. A typical weaker MC would take 2 or 3 episodes to deal with a situation that might not even take Akatsuki 5 minutes. This show does suffer some big drawbacks. The dialog, pacing and general story telling are completely awful. However as mentioned above this show isn't about that. If your unsure about the show, simply watch the first episode and see what you think of the initial fight.\\n\\n\r\nTLDR: Stupid but fun show. One of the most op main characters of all time, doing things like an op main character should. Poor story, and pacing.",
            "date": "2016-12-20T22:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 235969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=235969"
        }
    ],
    [
        {
            "content": "Note: This review goes with the impression that there is no sequel main to this show, if one is made you should not read my review!\r\nFeels like the same thing we always get from these fanservice animes. One main male character surrounded by a lot of different sized female characters. And of course at the very end of the show is a cliffhanger that you have to now wait to see more (which may or may not happen, even if the whole show is better of with more). Especially when the main characters teleport to a different land and rolls the credits immediately screams fora fucking sequel! Which is most anime we don't really see more than one!",
            "date": "2014-06-19T11:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 147551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=147551"
        },
        {
            "content": "Hagure Yuusha no Estetica\r\nselling points=OVERPOWERED HERO and FUN\r\n, This anime is an enigma... the story was bad, the fan service was dreadful and the art was nothing special in fact i didn't like how some faces were depicted.\r\nBUT I HAD A F******* BLAST!\r\nthis anime has been tailored to all the needs of a dude, although i resent all the fat otakus drawling and faping over the characters i must say i enjoyed each and everyone of them. The main charater is STUPIDLY over powered and i like that i don't know its jsut fun for a change, he doesn't care much for anything so hejust has fun 24/7 he may be a pervert but in this world he makes it work.\\n\\n\r\nThe cliff hanger at the end makes me cry at night i want a second season but i dont think its coming BUT if you want fun then this is the anime for you,!",
            "date": "2014-06-16T05:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 147213,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3800077.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Artoxz",
                "username": "Artoxz"
            },
            "url": "https://myanimelist.net/reviews.php?id=147213"
        }
    ]
]