[
    [
        {
            "content": "So far, this adaptation has been a massive disappointment. \r\nA-1 pictures are known for their generic character designs and cutting corners when it comes to animation, so when adapting a game as stylistically brilliant Persona 5 it was obvious they wouldn't live up to the game’s highs. I never expected it to excel or even match the game’s quality, but with a director as talented as Masashi Ishihama (Shinsekai Yori) expectations were raised and this adaptation’s first six episodes have flown far below them. \r\nStory: 5/10\r\nA 100+ hour game stuffed into 24 episodes will inevitably have pacing issues, and this has its fair share. Thestory is rushed as hell, but so far it has given us the most important information to give us a surface level understanding of the world and plot. Any depth the game's story offered is for the most part missing. The themes of adults in positions of power abusing their roles have been boiled down to “grown-ups bad, kids good”. Like most of this adaptation, any half-hearted attempts at storytelling feel like a low effort recap to advertise the much better video game. \\n\\n\r\nCharacter: 3/10\\n\r\nWe have only met Ryuji, Ann, Morgana, Yusuke, and the quiet main character called Ren in this adaptation. They all feel like cardboard cutouts with a fraction of the personalities of the game's counterparts. Trying to stay as faithful as possible to the game has hamstrung the character arcs, story beats are trimmed down or skipped entirely so we can't get a sense of who the main cast are from this show. The game itself was not perfect with characterization either, which is expectedly not fixed in this adaptation due to the insistence on staying as faithful as possible rather than letting the anime stand on its own merits. \\n\\n\r\nThere’s plenty of inconsistencies in their arcs and annoying quirks that made some of them hard to like before they received development. These annoying quirks, like Ryuji’s obnoxious attitude and lack of self-awareness, become almost all there is to the characters. There just isn't enough time for each cast member to be developed beyond a surface level.   \\n\\n\r\nEven those inconsistencies in development are already appearing. In episode 4 Ann announces she’s finally free of the twisted pervert Kamoshida who was sexually objectifying her, but because this is a lovely A-1 Pictures anime, the camera is constantly shoved uncomfortably close to her butt. You could argue plenty of fanservice is necessary for the studio to secure a budget, but it is so opposite to the message the game was trying to convey. Effectively undoing any development that came from what should have been the most monumental battle in the first quarter of the show. \\n\\n\r\nArt: 3/10\\n\r\nAction scenes are where the series looks the worst. It constantly uses this laughable shortcut of zooming in and out on unanimated shots to reuse them at a different resolution in a later scene. There’s somehow less animation than the game, and what we see tends to be worse. Look no further than the ‘epic’ boss battle in episode 5, what should have been amazing was stilted by hideous CGI that looked even worse than what was used in the game. The action is so boring to watch too because there are next to no stakes, usually, the Phantom Thieves are fighting random mobs but even the boss goes down so quickly. \\n\\n\r\nThe fight choreography is even worse, the whole battle scene where Ryuji awakens his persona is the worst case of it. There is next to no fight choreography at all, hits don't even feel like hits, it's more like colors flying around with sound effects added over it. And somehow the all all-out-attack is so much worse than the game’s even though it was practically ripped straight from it.\\n\\n\r\nCharacter designs are the best part of the visuals because they’re lifted straight from the game, but they only look good when they’re totally motionless or on an animation loop (very often). When there's not much movement and/or character close-ups look really good but by that logic, you should just play the game.\\n\\n\r\nThere’s also plenty of ugly CGI random people walking in the background. In episode 2 Ren and his teacher are talking in a hallway, and there’s a giant CGI student trying desperately to walk without looking like a robot but its so obvious he was stuck on there last minute with zero quality control to fix him. He looks ridiculously unpolished and the perspective is all messed up, he goes past two girls standing near a door and he looks twice as large as them.\\n\\n\r\nSound: 6/10\\n\r\nPersona 5's OST is amazing, but here it's lifted straight out of the game and overused with not care for if it fits the scene or not (usually it doesn’t). You can easily tell when they use stock sound effects, deafening the punchy effects of the game’s combat for the sake of something easier on the ears but infinitely more forgettable. Yes, they fixed the OP and it is decent now, but the ED is still just a still image with limbs and hair being animated to look like the main cast is walking. It looks so uncanny, a completely still image would have at least not distracted from the pretty good song. \\n\\n\r\nOverall: 4/10\\n\r\nI honestly can’t see this getting any better, but I love the game and respect the director enough to see if it can repair the story/character issues. I’m not expecting the art to get better because it seems as though they’re stretching the budget out to meet 24 episodes. \\n\\n\r\nIf they try to simplify the character designs to be more fitting to a TV anime budget rather than solely faithful to the game, it may become more manageable for A-1 to animate. Also, I've referred to CloverWorks as A-1 a few times, there's no difference. It's a subsidiary of A-1 so they're the same.",
            "date": "2018-05-12T10:22:00+00:00",
            "helpful_count": 81,
            "mal_id": 280379,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=280379"
        },
        {
            "content": "Unfortunately for game anime adaptations, they have a steep hill to climb to recapture the magic you get from playing through them.\r\nPersona 5, another addition to the long time SMT/Persona series was a huge success in both the west and in Japan. It won 2017 Game Awards “RPG of the Year” And was ranked at was of the top games of the year by many gaming outlets. Even with that, the anime was considered a disappointment from the start. With its cheap animation, off-pacing at times, and generally its lack of what made the game special.\r\nHowever, my expectations played a part in the viewing experience.It was clear from the start that this wasn’t going to be like the game at all, as most game adaptations never are. Persona 5’s stand alone story is not what made the game special, rather just one factor. I wasn’t coming into this expecting what I got from the game, and neither should you. As I do see where most the criticism comes from, the root of it is from people who compare to the game, this probably isn’t a fair way to look at it. The game was made by thousands of more people, have had years to develop, and is generally taken more serious. This was a direct result of poor animation, bad pacing, and cutting out parts of the game. The anime should be given some slack in that regard.\\n\\n\r\nWith all that being said, I am not trying to defend the bad parts of the P5 anime. They are noticeably apparent, and part of why it led to widespread hate of the P5 anime. The animation is sometimes shit. The CG usage was often bad, especially in the background characters walking around. The faraway faces are sometimes laughable. And although the pacing is considerably better in the second half of the show, the beginning is way too fast. Usually I wouldn’t give these issues a pass, but like I said since it was mainly being compared to the game I do. People who haven’t played the game probably won’t see that much of an issue in these.\\n\\n\r\nIn many cases however, what likely appealed to you in the game should transition into the anime. If you like the characters, they will translate nicely. And of course, the music does as well. Chances are you didn’t complete everything in the game unless you played it through multiple times, so some of what you will be seeing from the characters could be a new experience. The character development was taken from the ‘confidant’ system so if you didn’t complete everyone’s confidant or maybe just were not paying attention you could be seeing new content. That along with the actual anime exclusive scenes, like seeing some of the characters in new situations, or seeing them given more backstory like showing them as children, gives the anime merit to watch even if you have played the game, a common criticism.\\n\\n\r\nThere isn’t always something to say about P5TA. Largely because it is just doing what it was supposed to. There are both good and bad parts. If you want to experience the game but don’t want the time investment of playing through all of it, (and trust me, the game is huge) than this might be for you. If you are a fan of the game, than this might be for you. It doesn’t necessarily show everything the game has to offer, but doesn’t do anything too bad to diminish it either.\\n\\n\r\nYou shouldn’t think too hard about this one.\\n",
            "date": "2018-09-29T10:44:00+00:00",
            "helpful_count": 55,
            "mal_id": 290393,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6554590.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dotta",
                "username": "dotta"
            },
            "url": "https://myanimelist.net/reviews.php?id=290393"
        },
        {
            "content": "Persona 5 is the newest addition to the Shin Megami Tensei franchise. Its source material had around 5 hours worth of actual content like is implied in its name, yet playing the whole thing takes around 140 hours because it's a classic J-RPG game that relies on repeating the same thing 18500 times. \r\nUnfortunate for the fans of the game, the anime end up being 26 episodes long when it should have been 500, and unfortunate for anime fans, the anime end up being 26 episodes long when it should have been 13.\r\nAs far as fillers go, filler is canon content I mean, Persona 5is full of slice of life nonsense that has nothing to do with anything. People fighting over pieces of bread and talking about their dreams just to make sure the pacing will become harder to comprehend than the popularity of the franchise itself. \\n\\n\r\nWhat is directorship? is what I found myself often asking when seeing how Persona 5 is build to be nothing but a collection of random scenes that were edited together without any consistency or flow that makes the next scene related to the former one. Screen transitions seem to be some sort of \"worst animated cabbage\" meme when the focus goes from pan fights in the middle of the day to a scene where we drink coffee in the evening to a bully scene and finally returns to a scene where the actual pan is being eaten in a time that seems to be the very next day. The shots mainly remind me of Resident Evil The Final Chapter (movie) where the camera angle could change 45 times a minute over the same scene except here it changes from scene to another in ludicrous tempo. Visual storytelling at its finest. Bravo. \\n\\n\r\nOur main characters are incredibly random. They mainly remind me of Suicide Squad. By Suicide Squad, I mean every superhero movie ever because that thing was exactly as good as they all are. The real mc is some sort of mixture of Robin Hood and Jesus. The female lead appears very mysterious, but the real mystery is why would anyone care. She is pretty hot, tho. The blonde dude is like spiderman but sassy. All the other girls were just swag, but gladfully there was like 7 beach episodes so they really had time showing off their naked bodies as it's not like they had anything else to show. None of the side characters feel like genuine persons, they are more like NPC's who only exist for the main characters... oh wait. \\n\\n\r\nWhat is this series all about even, you ask. And that's what I am still wondering. Teenagers with stand powers are participating inside some sort of fighting tournament shonen storyline that mainly reminds me of Katekyou Hitman Reborn (we even have the same mascot here) except the comedy was replaced with some type of combination of angst and edgy, the villains are evil adults, the actual events are Robin Hood with superpowers and most of it is slice of life. As epic as it might sound, what it really sounded like was a wet fart. \\n\\n\r\nThe only good thing about the game itself was the OST. Unfortunately, voice acting is always at louder volume than the OST, and SFX above all else. Boy don't we love it when explosions cover the music. It really fits the definition of a background music because instead of trying to make the series better by using the songs to their full potential, they are just there hanging in the background. It's pretty much a stupid decision. \\n\\n\r\nOur art is at least pretty fun if not otherwise impressive. Villains wearing strings and cloaks made of fur offer the most original content in the entire series. Some of the leather suits were also pretty sexy. Especially the art room looked cool as fudge. Too bad its overall screen time totaled 3 seconds. Like literally. Not that even these things would be worth of praising in a series that had some other merits. Pretty much all side characters follow the \"spot the main character\" tier filler/design.",
            "date": "2018-09-29T09:08:00+00:00",
            "helpful_count": 51,
            "mal_id": 290383,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=290383"
        },
        {
            "content": "LOOK HOW FAR WE'VE COMMMMMEEEEEEEEEEEE\r\nHoy lads, I was quite excited to see my first review make it front page so thanks for that but now that the anime is done I guess I have to write this again. Most of my opinions haven't really changed so bits and pieces will remain the same. Swearing to Brahman didn't really help save this anime and P5A only slightly picked itself up towards later episodes. Atlus still should not be tolerating this kind of quality and I do sincerely hope they get out of whatever sort of contract they're in before they decide to ruin another property. \r\nLet'sbegin, no spoilers. As someone who is passionate about the Megami Tensei franchise as a whole, and adore the Persona entries, I felt obligated to just... say what I'm thinking, give a little rant ya' feel? Aight, cool. Let's go. \\n\\n\r\nP5 was my game of the year last year and is one of my favourites in MT as a whole. Lots of things they could work on, but nevertheless it's a brilliant entry with a brilliant story, characters, art, music, etc.. If you're wondering whether or not the *game* is worth your time, then yes. It probably is. Please don't go looking at this anime for your answers because, well for fuck's sake, you won't find them here.\\n\\n\\n\r\nANIMATION: \\n\\n\r\nLet's start with the big one. The animation is hilariously poor and it kind of pisses me off. The P3, P4 and to an extent DeSu properties have been treated quite nicely (except for P4G which was atrocious and made me want to die), and hardly did I ever cringe at any 1 frame. P5 however. Heh heh heh... uh, well let's just say I've made a separate Discord to Jack Bros that just holds a bunch of cropped screencaps of characters.\\n\\n\r\nFrom the awkward running cycles shown in the first couple of minutes of the first episode to the new, overly lazy All-Out Attack meme scene of the second episode and out of place CGI characters roam the corridors and street to episode 12's (~9:30) scene where they tried to zoom out on a character but the character layer and the background layer were done to two different levels of zoom so basically the kind of shit I accidentally did in my 2011 YouTube videos and like how the fuck can this go unnoticed my god. I'mma take a breather. And we back. Okay. I also liked when they got too lazy to animate Makoto so they brought out a low quality P5 model in episode 11. \\n\\n\r\nWhoever is animating this bullshit is in it for the monetary gain. They've been given one of the most well received RPG franchises and it just seems like they don't give a shit about it. Ironic considering P5's story. \\n\\n\\n\r\nSOUND:\\n\\n\r\nShoji Meguro is still a god with music. Whatever he creates makes me the very happy. The first opening song is brilliant, the second opening song is brilliant, the ending song is brilliant; Lyn's voice is just great and Shoji knows how to create music. What little new stuff I've heard has also been pretty good. Actually using his music at the right moments however is a different story. I'm primarily thinking of the Ryuji awakening scene at the moment, the song choice and awkward sync made me (personally) cringe a little and took away from what should have been a very powerful moment for the character, like it was in game. \\n\\n\r\nOn top of all this, episode (12) had begun using P5D music, in particular the Jazztronik remix of Wake Up and ATLUS Konishi's Blooming Villain. Considering P5D was released like a week ago from this episode's release, their inclusions made me feel like the episode had only been completed recently, implying it was rushed. They might've gotten the rights to such music beforehand, but I personally believe they would've used more remixes in earlier episodes had this been the case. I had a discussion with a friend about this and they said it could've been a marketing strategy for Dancing but using random songs doesn't seem like it would accomplish anything in my personal opinion.\\n\\n\r\nGuess I should also mention that the sound design in terms of effects and ambiance is quite poor. I made a note of episode 16 having used stock sound effects, or what sounded as such, but either way it sounded very unprofessional and cheap. \\n\\n\\n\r\nSTORY:\\n\\n\r\nThe pacing feels awfully fast and unnatural, with them cutting out a bunch of stuff that ultimately added to the game's story and development of characters. They cut out the part where Kamoshida asks Ren if he wants a ride where he says \"Nah\" and that. That. I was sitting there, anticipating the \"nah\" but they didn't do it and I was just blue balled y'know. Cried a little even. Jokes aside, with 24 episodes I thought they'd not need to be rushing but look how that turned out with that 2 episode extension. Tips for next time: focus on filtering out the stupid long and drawn out shots of the fucking rain. \\n\\n\r\nAlso as a quick note, watched the show on Crunchyroll where they awkwardly linked Kamoshida to being in a train accident in the first episode or something and then relate that accident indirectly to the phantom thieves... which never happened in the game nor really happens in the anime. It was just worded really poorly.\\n\\n\r\nI like how they ended the show with an ambiguous ending, did we get the \"good ending\" or the \"bad ending\" thing; obviously leading to their OVA but it was nifty none-the-less... at least in theory lmao. They've said they're going to sway away from the original ending with the OVA so when I heard they left on a note of ambiguity I got a bit of a hard on. But from the looks of it, they set up the good ending pretty well so don't know what to expect now.\\n\\n\\n\r\nCHARACTERS:\\n\\n\r\nIn my personal opinion, Persona typically does its characters really well -- formulating them in such a way that makes them more human than just characters playing their part in a story. However in P5A, they're... well gee, they not done very well lads.\\n\\n\r\nRen (the protagonist) comes off initially as this angsty, edgy and depressed teen, and with such dialogue options from the game as \"Please look after me\" and \"Hell yeah I'm into older women\", you kind of desire that silly aspect of the character especially when they did it with Yu in the P4 anime. Of course, Ren as a character is up to interpretation so I can't really say it's \"wrong\". The other characters though, well yes I can.\\n\\n\r\nSojiro feels so monotone and boring. The first couple of moments in the game set him up as a character who doesn't want to bother with your shit effectively helping to establish one of the best character development arcs in the story. He just sort of feels 'there' in the anime, to progress the story when we need him to. Ryuji was fine until his rushed awakening and overreaction to Ren's story. There's something about him but I cannot put my finger on it just yet. Morgana is there, Igor looks dumb, Mishima didn't get hit by a ball, and I can finally understand why Shiho wanted to jump.\\n\\n\r\nAnn is definitely the worst change though. Ann's whole arc was supposed to be about her feelings towards objectification and slowly acknowledging herself as an attractive individual, using that fact for good. But what happens the episode after she goes on her whole \"don't objectify me\" spiel? They objectify her. :clap: :clap: Constant fanservicey shots, close ups of the icky unmentionables, you name it.\\n\\n\\n\r\nOVERALL:\\n\\n\r\nThis show has been making me very sad and I'm not entirely hopeful for Dark Sun. There's nothing much more to say except that I hope Atlus start giving their properties back to competent studios. Tune in next time for when I show you how to hack into the Pentagon using only Futaba's social link.",
            "date": "2018-09-29T21:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 290455,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4507751.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggesus",
                "username": "ggesus"
            },
            "url": "https://myanimelist.net/reviews.php?id=290455"
        },
        {
            "content": "I immediately say that, I have not played the game, because I have only a PC and no consoles, but in good time back I already heard the sea a good comment about this game, most said that the game is worth it and the time went so fast that an animation about this game was already appearing and I decided to start watching this piece of work..... ok lets start with>>>>>>>>>>>>>>>-OP intro- 9/10- impressive and interesting created, I really liked it.\r\nStory 7/10- For the moment everything is fine except for the main storyline- he has not yet appeared (although it was shown whose oneof the main hero is in the interrogation room and he tells for some organization a story about own life= That could be fragment of the main story) but our heroes have enough working side missions so I can not understand what will happen next, for the moment I am satisfied with everything, YES there are things I would like to ask a question but I think the answers I will receive soon.\\n\\n\r\nArt 7/10- I even like this kind of drawing, though the legs seem a little too long, but it satisfies me.... the fighting episodes could have been much better, because at the moment it looks like 5/10 but overall 7/10 I hope that in further episodes it will improve.\\n\\n\r\nSound 7/10- I've seen console gameplay in youtube and the sounds are taken from the game and music could also be.\\n\\n\r\nCharacter 6/10- To date, there is too little information about each of the main characters for the moment I like just two of them (Morgana and Amamiya Ren) 24 episodes uhhhhhh..... I hope that it will be enough time to tell more about each other.\\n\\n\r\nEnjoyment 10/10- I watched 6 episodes in 2 days, for the moment I feel good.\\n\\n\r\nOverall 8/10- I have not played the game but I like- Persona 5 the Animation\\n\\n\r\nBonus- Maybe sometime in the future, I will buy a console and will play this masterpiece.",
            "date": "2018-05-20T11:58:00+00:00",
            "helpful_count": 31,
            "mal_id": 281018,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magaiverix",
                "username": "magaiverix"
            },
            "url": "https://myanimelist.net/reviews.php?id=281018"
        },
        {
            "content": "It's no secret that adaptations from video games tend to suck. Which is understandable due to it being difficult to cram so much storytelling into another form of media and condense it. There is also the fact that they bring the problems of the video game and try to adapt it into another form of media with those problems. Some examples include the adaptation of characters, their backstories, personalities and glossing over key plot points, believing that the viewer or reader already knows the details. \r\nNow I've always admired the Persona games as an outsider since I have never played the games. So this wasa chance to inspect the story of a Persona game through the ease of use of watching it in anime form. But instead of judging and comparing it to the Persona game, I will judge it on its own merits and see how good it is as an anime and how it has been translated while still acknowledging it is an adaption. Spoiler alert, it didn't do well. \\n\\n\r\nSit back, relax and google what the f**k a Persona is as I present to the anime review for Persona 5: The Animation. Lets begin. \\n\\n\\n\r\nStory: 4/10\\n\\n\r\nThe story begins with our main protagonist Ren Amamiya leaping around and trying to escape a casino until he is stopped and captured by the authorities. From there, someone comes into the interrogation room. An investigator by the name of Sae Niijuma tells Ren that she is willing to help Ren plead not guilty if he tells her everything about the Phantom thieves and their actions. The Phantom thieves are a vigilante group that steals peoples' \"hearts\" to confess their sins to everyone that they have wronged. From there we see the events that have led to this moment and get acquainted to the Phantom thieves, their motivations and their desired goals to see justice against horrible people. \\n\\n\r\nThe shows story structure is very formulaic. The phantom thieves encounter a very horrible person, get closer to them, change their heart, add a new recruit to the phantom thieves and move on to a bigger target. Every. Single. Time. There is some downtime between these in order to get attached to our characters more, which is good. Having downtime between these helps balance the pace out so we are not just going around in circles. But it doesn't change the fact that these castle raids to change peoples' hearts are boring to watch over and over again with only slight deviation. Not only do you know what is going to happen, but there is little variation between them on how it is structured. \\n\\n\r\nAnd while I say the pace is balanced, it is also unbalanced as these castle raids have so many cutaways that it makes it all feel rushed and we don't get concrete buildup to it all when they encounter the final boss of the area. Context is key here as it helps flesh out the story and characters, but rushing to the important bits leaves the impression that nothing else is important other than this scene that we are trying to get to in order to show you this cool scene. \\n\\n\\n\r\nCharacters: 5/10\\n\\n\r\nMan, Ren is such a boring and bland character. I know portraying silent protagonists is hard but their personalities are driven by their actions and by you, the player. But translating that into an anime is very difficult. Instead, Ren resorts to being a near silent protagonist. The problem is that being a near silent protagonist, you are relying on your actions to speak for you, which is something the this show doesn't do. Ren does nothing interesting outside of the Phantom Thieves to expand and personalise his character. Too many times the anime cuts the meat off the side activities to help expand Ren's character. This leaves a main protagonist mind you, with no personality whatsoever as he merely just agrees and nods to other characters. \\n\\n\r\nNow does the rest of the cast share this same problem? Wellllll, not really. Individually, they do have their own personality traits to make them interesting but they are much better when they are together and these multiple personalities integrate with one another. They also get expanded upon in an episode dedicated to them to develop them more, which is something that Ren doesn't get unfortunately. The entire Phantom Thieves group hides Ren's lack of a personality by having multiple different personalities in the group work together to achieve the same goal. There individual personalities though. While they are better than Ren's personality (which isn't saying much), they do start to become a bit stale and boring. As well as some of the characters personality traits start to blend into one another as the show goes on. \\n\\n\\n\r\nAnimation: 5.5/10\\n\\n\r\nWell it certainly captures the Persona style but in execution, it does fall flat. It feels like there were many cutbacks and so the overall animation quality has dropped from what I was expecting. Too many cutaways affected the fight scenes to make them feel lackluster and not capture the overall feel of watching these awesome moves be portrayed effectively. Instead, they just feel like they don't have as much of an impact as they should. This is especially true in the finishing manoeuvre sequence as it really feels lackluster. On the bright side though, the art style is rock solid and really does capture the Persona series which thank god it does because Persona is styled like an anime after all. There is also a good amount of CGI used in this show as well and while I don't think it looks horrible, it isn't great looking either; it's just okay. \\n\\n\\n\r\nSound: 9/10 \\n\\n\r\nSound is the one area I have little to no complaints about. The OST has a very cool style to it and it really does stand out. From calm, collective soundtracks, to alert soundtracks to battle soundtracks. Each of them is distinct from one another and I can immediately recognise which one is playing at that moment. So at least this part of the anime is solid. \\n\\n\r\nLikewise the openings do help set a tone and are enjoyable to listen to. Both opening 1, \"BREAK IN TO BREAK OUT\" by Lyn and opening 2, \"Dark Sun...\" by Lyn as well are probably where the animation style actually shines and is well choreographed. While Dark sun took a little bit to get going for me, it is still enjoyable to watch and listen to. But Break in to Break out, for me, is the better of the two due to not having scenes ripped straight from the episodes before hand and the song being more fun to listen to due to its better build up towards the chorus. \\n\\n\r\nThe endings, while also having good songs to listen to, is hampered down by simple animation as all it features is the cast just walking side by side, looking ahead of them, doing nothing else. I mean I know that it is meant to calm the viewer after watching the episode but it is boring to watch. But I still watched them because the songs were enjoyable to listen to. \\n\\n\\n\r\nConclusion\\n\\n\r\nFor me, Persona 5: the animation feels like a half assed attempt to adapt the game into an anime. Everything feels rushed as to say this is a summary of what the story is. For someone that has not played Persona 5 like myself, that's disappointing. I wanted an alternative to experience the Persona 5 story and characters, not a cheap way to make an anime while Persona 5 is still somewhat relevant before it gets swarmed by other big name games. It is a disappointment to me and I imagine many others and is a poor adaptation of an otherwise fantastic game. Unless you never played Persona 5 and you are really curious or a diehard Persona fan, you can skip this one. \\n\\n\\n\r\nMy Personal Enjoyment: 5/10\\n\\n\r\nOverall score: 5.7/10  Recommendation: Don't Bother\\n\\n",
            "date": "2018-09-29T09:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 290385,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6787406.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Snapshot426",
                "username": "Snapshot426"
            },
            "url": "https://myanimelist.net/reviews.php?id=290385"
        },
        {
            "content": "I'm not going to waste my time with the introduction piece of the review so I'm just going to start with the review.\r\nThe story follows Ren Amamiya who is sent to Tokyo to stay with family associate Sojiro Sakura and attend Shujin Academy during his year-long probation. After his arrival, he is drawn into the Velvet Room, where Igor warns him that he must \"rehabilitate\" to avoid forthcoming ruin, and grants him access to a supernatural mobile app that leads the protagonist into the Metaverse and from there him along with his group of friends that he recruits must now steal corruption from the hearts of adultsin an attempt to reform the city under a group called the Phantom Thieves.\\n\\n\r\nPersona 5 the Animation is a 26 episode anime and yep alarm bells should be ringing. We haven't got a great record of Video Game Adaptations especially as of late with the lacklustre Danganronpa animes. However, I went into Persona 5 The  Animation with an open mind because I thought that maybe this video game adaptation would work. It had director Masashi Ishihama who previously directed the critically acclaimed Shinsekai Yori. Plus the daybreak's OVA for Persona 5 was pretty good. I was actually excited.\\n\\n\r\nHowever, my excitement was immediately thrown out the window when I saw A1 Pictures. For those who haven't caught on, I hate A1 Pictures. I hate the studio with passion. I honestly believe that A1 Pictures is the most incompetent studio I have ever seen. Yes A1 did make some good shows that I really liked like The Idolm@sters, Magi, Shinekai Yori, Your Lie in April and Wotaku but the problem with A1 is that they made a truckload of mediocre, forgettable and terrible shows to a point where a lot of these bad shows seemed to represent A1 as a whole leaving a lot of good shows in the dust.\\n\\n\r\nI also don't want to speak about video games adaptations done by A1 Pictures because I heard nothing but awful things about them.\\n\\n\r\nI know that A1 Pictures did the Daybreak's ova back in 2016 and it was pretty solid but I never expected A1 Pictures to pass the TV series to Cloverworks aka A1's sub-studio until the studio split they own ways in October 2018.\\n\\n\r\nHowever, this show was released before A1 and Cloverworks went they own meaning this series despite being done by Cloverworks it still had that nasty A1 stench that I hated.\\n\\n\r\nAm not going to pull any punches with this one the story was awful and here's why.\\n\\n\r\nTo start off with the elephant of the room is the pacing. Good god the pacing. Not going to lie this has got to be some of the worst pacings I have ever seen in anime because not only the show is ridiculously inconstant with it's pacing as it either way too slow or way too fast but it also screws up the overall narrative as well the emotional story elements.\\n\\n\r\nFor example, in the game, Shino attempts suicide being raped by Kamoshida. It was an emotional moment in the early game of Persona 5 that was meant to showcase how screwed up the adults in the universe of Persona 5. It also gave Ann, Ryuji and Akira the motivation to act against Kamoshida.\\n\r\nIn the anime, it just happens in fin air. No tension, no proper build up whatsoever, nothing.\\n\r\nThis doesn't end where the show also outright skip various story elements that were meant to develop the characters. Even if you haven't played the games you can easily tell that the show is skipping and rushing many story aspects and as a result of that many of the story elements just feel awkward disjointed and forced.\\n\\n\r\nAs a fan of the games, I felt insulted of how the show completely butchers and ruins everything that made the game so great in the first. Let's not talk about the social life aspects of the series because they do not exist. The biggest mistake of Persona 5 the Animation was how it adapted to a story that needed at least 51 episodes compared to 26 episodes that it actually got\\n\\n\r\nThe final nail of the coffin was the ending. That ending alone was a big middle finger to the viewer as the show just ends in a very crappy way that feels unsatisfying as hell. I am aware that the series is getting an ova sometime soon but this is no excuse especially when we watched 26 of this rushed, awkward and poorly animated shit show that barely respects its source material.\\n\r\nBy the way, the Dark Sun OVA is not much better.\\n\\n\r\nThe characters in Persona 5 are just lifeless husks of the game counterparts. Not only the character development is rushed beyond belief but they somehow made theses once interesting, well written and likeable characters and turned them into bland stereotypes. To save myself the misery and pain I will be ending the character selection of the review because if the show can even respect its characters than why should I.\\n\\n\r\nNow if thought the story and characters in Persona 5 The Animation were bad enough you ain't seen nothing yet because this is where the show officially hits rock bottom.\\n\r\nWhere the hell does I begin with this dumpster fire.\\n\r\nFirst up the art style compared to the game looks like it was fished out of the toilet. Not only the show looks unappealing as well with its shitty background scenery, horrible lightning and uninspired character designs that look like the came out in early 2000 of anime but the art inconstantly is busted beyond belief where throughout the 26 episodes characters would constantly go off the model. \\n\\n\r\nThe animation is even worse. I have never seen animation this lazy and lifeless since Black Clover and The Kings Game.\\n\r\nAlmost every single scene and fights in this show are all horrendously animated to the absolute core.\\n\r\nAlso, we don't speak about the shows horrendous attempt of using CGI. Good God was it awful to look at.\\n\r\nThe final nail of the coffin of this shit show was the all-out attacks which are frankly some of the worst pieces of animation I have ever seen in any anime. Every single all-out attack in this show feels like it was animated by college drop out who barely know anything about style when making this sequence in Adobe After Effects.\\n\r\nNot even the beautiful fan-service scenes can save this shitty production.\\n\\n\r\nIf there was anything good to come out of Persona 5 The Animation it would be the soundtrack. Despite the soundtrack being straight up taken from the game, it was still a great listen.\\n\r\nThe first opening theme BREAK IN TO BREAK OUT\" by Lyn is a fantastic opening theme for the show. While it was nowhere near as awesome as Wake Up, Get Up, Get Out its still a great song that perfectly captures the style of the series.\\n\r\nThe second opening theme Dark Sun by Lyn is a pretty solid opening theme in its own right however until the final episode I didn't like the fact that they reused footage from previous episodes into the opening visuals. However, the opening visuals for the last episode were awesome as it really showed off what the show could have been production values-wise.\\n\r\nThe ending themes were good but not that memorable.\\n\\n\r\nThe voice acting was pretty okay as well however I feel like the Seiyuus didn't put much effort compared to the game counterpart. There is no English Dub for this show from the time of this review so if you're a fan of the Persona 5 dub well you're out of luck.\\n\\n\r\nPersona 5 The Animation is a total waste of time and effort. I honestly don't know what the hell was the director and Cloverworks were thinking during the production because they took everything that made Persona 5 so awesome and manages it screw it all up. The story is a rushed and poorly directed mess that is filled with horrific pacing that barely tells of what is going on. The characters are nothing but empty shells of the game counterparts and the visuals were horrendous beyond belief. The only good thing to come out from this scrapheap of a show was the music and the openings.\\n\\n\r\nIf you haven't played Persona 5 and have a PS3/PS4 do your self a favour. Go buy it right now. If you don't have a PS4 or PS3 you can either save up for one or watch other anime with the same episode length like Neon Genesis Evangelion, Cowboy Bebop, Nichijou Rainbow: Nisha Rokubou no Shichinin, Ghost in the Shell: Stand Alone Complex and the list goes on.\\n\\n\r\nHonestly out of all the game anime adaptations why is it Inazuma Eleven and Gungrave were the only one to get it right while others like Persona and Ace Attorney have to suffer. Such a shame.\\n\r\nCloverworks you may now be separated by the EA of anime studios A1 Pictures but you better redeem yourselves in future anime projects because you now have a lot of potential to be a competent studio. Don't let me down Cloverworks.",
            "date": "2019-02-08T15:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 301193,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 1,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=301193"
        },
        {
            "content": "Persona 5 was one of the best RPGS I've ever played in my life, sensational gameplay the story is very good, have very few holes and plot twists sensational.\r\nThe characters are great super well developed, as long as the player has an interest in socializing with a certain character.\r\nAlready in the adaptation made by CloverWorks was different, first of all in the adaptation they decided to adapt 26 episodes until near the end of the game, which would be about 80 hours of history inside the game, of course it was very rushado, the problem is that Person 5 is a slow game that hasthe essence of making your own lifestyle within Tokyo with your own choices in the course of the game, taking that essence and accelerating the pace ends up leaving the feeling of everything being very superficial, whether in the relationship of the characters , at work, at school, in dungeons when he has fights, even in striking moments he can not deepen the scene in which the original had, was much worse. They did not know to take advantage of the characters of the game that can make you more curious about the history of each one and wanting to sympathize more and more, already in the adaptation they left very superficial the characters even more in their interaction with the protagonist, you simply do not care about they. The dramatic scenes and even the comedy scenes did not look good on the adaptation, without any impact, totally superficial, they just happen without a good break.\\n\\n\\n\r\nThe production was a fiasco, mainly in the fights, they could not pass the style of the fights that have in the game, outside that they tried to recreate the style of \"All out Attack\" that is one of the most stylish things of the game and was ridiculous,\\n\r\nthey failed to get a sense of epic battles against the bosses, they used almost no perk within the battles, and they changed certain\\n\r\nost of certain battles that got horrible. In the quieter parts he had many times that unnecessarily bent the design of the characters, besides the color palettes that did not use well. The dubbing is the same as it is very good. The ost used the same of the game that is sensational, and some new ones that were very good, but they were not always able to combine certain osts with the storyboard, in general it was mediocre.\\n\\n\r\nHe had some cool things, like a better situation in the game that got a little superficial, usually in moments with minor characters in certain scenes, but in general it lacked a lot of character to stand out or receive a better polish inside the story, it was only played for say that there is that character inside that world that is something that the game does not do and has every reason for the character is present in that world.\\n\\n\r\nConclusion:\\n\r\nSometimes it is very cool to follow without commitment and without worrying about the details, after all I like a lot when it involves anything of persona 5, but Persona 5 is much more than that.\\n\r\nIf you are looking for a good experience with the story and the characters and especially the fights, play the game, that anime is just a small attempt to do marketing with the game that fails miserably.",
            "date": "2018-09-30T17:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 290550,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5833936.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GianisSenpai",
                "username": "GianisSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=290550"
        },
        {
            "content": "For a game that's about \"stealing your heart\", Persona 5: The Animation on the other hand was nowhere close to capture LA's heart...\r\nLA only recently gotten into Persona 4: The Animation LA was hyped about Persona 5 as LA didn't play the game, so the anime was a good look into Persona 5, however...\r\nPersona 5: The Animation on the basis tries to relive the events of the game, truncating any of the minor events, and with that LA will at least say that trying to cram in a 90 to 120 hour game into a 26 episode anime IS gonna have these kind of limitations,but for what it's worth, Persona 5 did ok if a bit rushed in some of it's arcs. Persona 5: The Animation is inflicted with the video game curse in some sense but not in the way you'd think.\\n\\n\r\nPersona 5's plot revolves around the \"Phantom Thieves\" a group who is able to change the hearts of people and is led by Akira Kur- Ren Amamiya  voiced by Jun Fukuyama, the \"Joker\", but as they continue to gather more members, a bigger plot is brewing that leads Ren to being captured by the police and where the narrative structure of Ren retelling his adventures of changing people's hearts comes into play. Now the narrative structure is fine in some ways, a sorta in media res of Ren retelling his events to Sae Nijima, the detective questioning Ren all throughout the anime and the framing of how Ren got to where he is now is intriguing as well how he built up the Phantom Thieves and the members as well.\\n\\n\r\nPersona 5's characters are also immensely interesting to say the least, Ren has some personality to back him up though not the same as Yu from Persona 4 but nonetheless that and Persona 5 compared to Persona 4 have different levels of seriousness and playfulness in store. Due to Persona 5 going through many of the character arcs of the main cast (mainly the Phantom Thieves of course) we do get to see the Phantom Thieves develop through their issues or dilemma mostly through defeating the person or entity that troubles them in the \"villains palaces\" as a result. With that being said, LA was massively torn between two characters as LA's favorite character...either Makoto Nijima voiced by Rina Satou, the student council president and her views on \"justice\" tested during her arc (AND she's a badass) and Futaba Sakura voiced by Aoi Yuuki, a hikkimori who has a rather tragic backstory involving her mother and LA could relate to her in some sense due to this. LA's runner up was Ann Takamaki voiced by Nana Mizuki but nonetheless with the anime focusing alot on it's characters and their growth and arcs, made the main cast of the Phantom Thieves likable and memorable in a ways.\\n\\n\r\nPersona 5: The Animation's plot as LA aforementioned is was rushed and this was from a person who didn't play the games, each of the character arcs and \"palaces\" did have some decent screentime, but not alot of downtime much like Persona 4 and how they dealt with their dungeons, we at best get montages of the Phantom thieves traversing through the palaces, but in terms of battles, it's mostly one mob or monster then goes straight into the boss in question one or two episodes later. All LA means by \"no downtime\", is that the Phantom thieves doesn't have some breathing room in between palaces, though in some defence to this, Yuusuke Kitagawa voiced by Tomokazu Sugita and Makoto Nijima got \"some\" breathing room in between but still, it was rushed to say the least and this was even with a 26 episode timeframe!\\n\\n\r\nSo if the characters were done well and the plot's structure had some rushed pacing, what really crippled it?, yeah...the animation is a bit subpar alot of the time. The animation studio CloverWorks round the halfway point, you could easily tell the derpy faces as well as cutting corners ALOT and it just gradually keeps showing up in the later episodes, sure the animation had some sense of detail in it's palaces and it's character designs being visually striking but for the animation to dip and not fully recover by the end of it was disappointing to say the least. The animation was subpar and was probably the biggest detriment to the anime overall.\\n\\n\r\nWith that Persona 5: The Animation had a major problems but it's small little details that ruined Persona 5: The Animation from being in the same league as something like Persona 4 and LA loved that adaptation. Look, to most of the detractors of Persona 5: The Animation, you just can't cram a 120 hour game into a 26 episode runtime, there is BOUND to be some truncations, BUT for first timers who haven't played the game, it's actually a decent look into the game, with the story being structurally sound besides some pacing issues, characters who are memorable and develop them as the anime goes along BUT where Persona 5: The Animation falls flat is it's animation and that is just something LA can't ignore.\\n\\n\r\nPersona 5: The Animation you got some problems but your fine as an adaptation, being by the book in adapting the plot of the game well, but where the video game curse comes in is not having a convoluted stories and superfluous characters and the such but for what a simple thing as not having the drive in making the animation as great as could be as well as occasional rushed pacing, LA WANTED to love ya but by the end of watching it all, all LA felt was a dull thud in what could had been a great adaptation rivaling Persona 4: The Animation, yes LA was disappointed by this adaptation but not outright hate it as it had some strengths to it but nonetheless...\\n\\n\r\nPersona 5: The Animation your not misguided just mismanaged...",
            "date": "2018-09-29T12:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 290411,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=290411"
        },
        {
            "content": "{Spoilers}\r\nI had higher hopes. I played the game so I know the storyline already, but when I watched the anime it was boring and messy. If you want a better story, you should just watch the gameplay.\r\n{Story 8/10}\r\nI gave story 8/10 not because of the anime but because of the idea. Sadly the anime didn't portray it well and had many scenes were I just got bored and stopped. \r\n{Art 4/10}\r\nHorrible art, messy and bad, and in each episode there are probably 20 pictures were the characters look stupid and deformed. I hoped they would use the anime scenes from the game and use themfor the same events in the anime but they decided to redraw them instead and make it look 20x worse. (I know there are probably copyright issues)\\n\\n\r\n{Sound 8/10}\\n\r\nThe voice actors are fine, they sound similar enough to the game, and had e same amazing music that I love in persona.\\n\\n\r\n{Character 9/10}\\n\r\nI love the characters! Amazing Amazing Amazing characters, except for the art. I love futaba and Ann, and Main Protagonist, but It's not really related to the anime seeing that its just characters from the game.\\n\\n\r\n{Enjoyment 5/10}\\n\r\nLike I said before, there are many times I got bored and watched a different anime. There are scenes that just go on and on and they go through palaces way to quickly.\\n\\n\r\n{Overall 6/10}\\n\r\nThe anime had cute scenes but overall it sucked. Watch/play the game, don't watch the anime unless you want to make an AMV. :3",
            "date": "2018-12-17T23:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 296030,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7632590.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cyxnnn",
                "username": "Cyxnnn"
            },
            "url": "https://myanimelist.net/reviews.php?id=296030"
        },
        {
            "content": "Persona 5 is a good game but does the anime do it's part and show how good the game is? Yes and no. The first episode is one of the best episodes in the show with it's fast pace. The rest of the show should have followed the fast pacing of the first episode but had major pacing issues. Too slow for some parts and way to fast on others. The palace episodes are about one to one in a half episodes which are pretty good lengths. The outlier here is the very first palace which is in the first four episodes but this worksbecause the game had me in the first palace for about 10 hours. Enough about pacing, lets talk about the story.\\n\\n\r\nThe Story follows the story of the game pretty well. There are some anime original scenes which were a nice touch to the anime for someone who played the game before. The story follows the Phantom Thieves which are a group of people who \"steal the hearts of corrupt people\". They do this because they want the world to be a better place for everyone.  That's about it for the story other than the social links or \"confidants\". Confidants are people that help out the leader of the Phantom Thieves in any way they can like the doctor waifu, Tae Takemi. There kinda there in the show but there more on a back burner this time unlike the Persona 4 anime. \\n\\n\r\nThe art of Persona 5 is amazing! but the anime tries too hard to be like Persona 5. The all out attacks were bad at first but improved over time. The animation in the show was kinda lackluster but to be fair, CloverWorks did make the show and their literally A1 Pictures 2. I can't complain too much because this show did air every week without fail. \\n\\n\r\nThe sound is also amazing. The openings are great and the anime original songs are awesome. they actually fit the themes of Persona 5. \\n\\n\r\nThe characters are the same from the game so there's not much to be said about them. Ren is the main character and I wanted to see him as a character in this and not a self insert like the game but, this kinda fell flat and didn't happen like it did in Persona 4 the animation with Yu Narukami. \\n\\n\r\nEnjoyment varies person to person. I think this was very enjoyable because knowing what happens and how they adapted this almost gives me a thrill because this is a first for me. Playing the source materials first makes me feel like, \"hey, this scene could have went like this instead of that\". Other than that, the anime original things gave me a good feel.\\n\\n\r\nOverall I gave this a 8.6 out of 10 (9 for rounding). It was a fun watch and didn't mind all the \"mistakes\" with the show.\\n\\n\r\nThis is my first MAL review. Feel free to give me feedback if I plan to do another review.\\n\\n",
            "date": "2018-09-29T17:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 290431,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176115.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RiccyKid",
                "username": "RiccyKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=290431"
        },
        {
            "content": "just play persona 5 its a 10/10 game\r\n they somehow managed to ruin everything good about p5\r\nstory 4/10: the story fells rushed  wierd pacing and they somehow ruined the main storyline of the game cause off course a 100+ hours game wont fit in a 24 ep show so they cut alot of corners\r\ncharacter 4/10: well they decided to  cut almost all of the characters personality and development so they are all  deep like the dead sea \r\nsound 7/10: the game sound truck is good but used incorrectly in a way that makes the scene fell weird  and the new trucksare bad\\n\r\nArt: 3/10\\n\r\nAction scenes are where the series looks the worst. It constantly uses this laughable shortcut of zooming in and out on unanimated shots to reuse them at a different resolution in a later scene. There’s somehow less animation than the game, and what we see tends to be worse. Look no further than the ‘epic’ boss battle in episode 5, what should have been amazing was stilted by hideous CGI that looked even worse than what was used in the game. The action is so boring to watch too because there are next to no stakes, usually, the Phantom Thieves are fighting random mobs but even the boss goes down so quickly. \\n\\n\r\nThe fight choreography is even worse, the whole battle scene where Ryuji awakens his persona is the worst case of it. There is next to no fight choreography at all, hits don't even feel like hits, it's more like colors flying around with sound effects added over it. And somehow the all all-out-attack is so much worse than the game’s even though it was practically ripped straight from it.\\n\\n\r\nCharacter designs are the best part of the visuals because they’re lifted straight from the game, but they only look good when they’re totally motionless or on an animation loop (very often). When there's not much movement and/or character close-ups look really good but by that logic, you should just play the game.\\n\\n\r\nThere’s also plenty of ugly CGI random people walking in the background. In episode 2 Ren and his teacher are talking in a hallway, and there’s a giant CGI student trying desperately to walk without looking like a robot but its so obvious he was stuck on there last minute with zero quality control to fix him. He looks ridiculously unpolished and the perspective is all messed up, he goes past two girls standing near a door and he looks twice as large as them.\\n\r\nenjoyment 1/10: how can u enjoy one of seeing one of the best games in the last 8 years getting gutted\\n\r\nover all 3/10\\n",
            "date": "2018-07-30T18:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 285198,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/genjimainFhanzo",
                "username": "genjimainFhanzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=285198"
        },
        {
            "content": "\"I am thou... Thou art I ... From the sea of thy soul I come ... Call upon my name, and release thy rage! Show the strength of thy will to ascertain all on thine own, though thou be chained to Hell itself! I am the pillager of twilight, Arséne!\"\r\nSo I recently got into the Megami Tensei multiverse. I knew it existed for a couple years, heck I even played Persona 2 (Innocent Sin) for the original Playstation. Back then I really had no idea wtf half the demons and spells were, how to pronounce character names, or why Hitler was in the fucking game,but I remember it being one of my favorite games. However I wasn't able to play 3 due to stupid laws not letting me buy the game due to my age. Gee thanks a lot America. I got into the whole multiverse more recently with some YouTubers I watch streaming Persona 5. I loved watching them play, and recently I was able to convince my Mom to buy the game for me. But until then, I kinda had nothing to do. I wanted to play the game myself and it just so happened that an anime would be produced. My naïve mind was ecstatic. I thought it was good, until I got my own copy and relived watching videos, but in my own hands. Looking back now, this anime adaptation is a complete trainwreck.\\n\\n\r\nStory: The story here is a watered down version of the game. A lot of the nuance is taken out and some of the plotlines are straightout censored for TV. Apparently we can't say pedophile gym teacher is a pedophile, so we cut out half of his fucking character.  Well anyways here is the plot of the game. Your character is a student on probation due to an assault case from some asshole rapist, and he moves to coffe-dad's café , and he's a regular student by day, and a heart stealing phantom thief by night. No this is not a shitty porno despite how cheesy that last part sounds. Basically the protag makes accomplices and recruits other thieves, and a talking cat who screams at him to go to bed. The thieves steal the evil will from the hearts of the corrupt and reform society. That's what the anime basically portrays the plot as. A lot of the nuance from the game is gone. A lot of the dicking around that you and your friends go through in town during the day is gone. The school life is also gone. Its pretty much just an action story now.  For cutting out important elements and nuance it gets a 7/10, at least it tries to tell the game's story.\\n\\n\r\nArt: \"I would like your honest opinion if you would...\"-Kitagawa Yusuke\\n\r\nLets talk about the production a bit first. The game's animated cutscenes were produced by Production I.G. a high end studio, while the anime is A-1  Pictures. The A-1 version looks cheap and neutered compared to the beauty of the game's cutscenes. Yusuke does not approve. The CGI also looks like dog shit. Look up A-1 pictures animation and you'll get some pretty bad results. 5/10 Madarame did it.\\n\\n\r\nSound: The sound in the anime is actually pretty good. Most of the actors and actresses from the Japanese game have returned. Sadly some of the cast has recently passed away, so they will not be heard in the anime. A lot of the music is lifted straight from the game. You will start singing along to some catchy tunes such as \"Beneath the Mask\", \"Last Surprise\", and \"Life Will Change\". Its pretty good! 9/10 some songs are missing.\\n\\n\r\nThe characters are from the game, but slightly watered down. As an elitist I give this a 7/10 due to me loving the nuance in the game.\\n\\n\r\nThis anime gets a 6/10 as it tried to adapt the game well, but failed miserably due to time constraintants. Don't watch it unless you are gonna watch the Abridged Parody I am producing.\\n\\n\\n",
            "date": "2018-06-20T18:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 281701,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6698691.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LSSJ_Gaming",
                "username": "LSSJ_Gaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=281701"
        },
        {
            "content": "Persona 5 was one of the best games that I have ever played, and was a hit both in Japan and in the West upon its release, and continues to gather attention with spin offs and possible sequels based upon the loveable characters the game presents you with, along with the fantastic music crafted by Shoji Meguro (which luckily makes its way into this animated adaption).\r\nIt was a hard job to handle, cramming a 90-100 hour game into only 26 episodes, but as we have seen with Persona 4 the Animation (also handled by A1 Pictures), it can be done well. \r\nBut wherever the previousanimated series succeeded, this series failed. Miserably.\\n\\n\r\nThe pacing of the entire anime is laughable, with exposition being either crammed into a few short sentences or not even brought up at all until it is only just relevant. The fight scenes are animated very poorly, with the pace of the fights all over the place and the art itself mediocre at best.\\n\\n\r\nDue to the poor pacing, many story moments are rushed over, and some of the truly important moments for character development and plot are give to few time for us to sink in the information or even care about the story it is presenting.\\n\\n\r\nThis anime left a bad taste in my mouth, and when i reached the end of it's 26 episode run (along with two OVA episodes to complete the story in a rushed manner), i felt as though another trip through the PS4 title was needed to experience the story the way it was meant to be done.",
            "date": "2019-04-21T08:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 306822,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GrimmusReaperino",
                "username": "GrimmusReaperino"
            },
            "url": "https://myanimelist.net/reviews.php?id=306822"
        },
        {
            "content": "You cannot condense 95 hours worth of content and story into a 26 episode anime.\r\nThe anime adaptation of Persona 5 was so boring I couldn't finish it. \r\nThe show was trying to be like the game and because of that it was terrible.\r\n- The pacing was off because arcs that take in game hours to pan out happen in at most an hour in this show.\r\n- The few fight scenes were just boring to watch.\r\n- Characters had no development what-so-ever in the short amount of time that I watched this show.\r\nThe only good thing about this show is that Dark Sun was a good song.I didn't get that far in the anime to hear it \"live,\" but I did hear it on YouTube.\\n\\n\r\nIt's not like a Persona adaptation into an anime can be bad. The original Persona 4 The Animation was fantastic in my opinion because it wanted to focus on the humor and the general fun time that was at the core of Persona 4, yet it didn't try to be exactly like the game. With the P5A that can't be said, and it just falls flat.",
            "date": "2018-12-31T08:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 297585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7677562.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AntarcticRuler",
                "username": "AntarcticRuler"
            },
            "url": "https://myanimelist.net/reviews.php?id=297585"
        },
        {
            "content": "(Please note this review is from someone who played the RPG before so it might be a little bit biased)\r\nThis anime is good...\r\nWell, it should've been.\r\nBut no, they had to just to ruin a wonderful piece of work into an average adaptation\r\nLet me tell you why, all of the cons cover up all the pros!\r\nLet us start with the plot, if you compare it with 280+ hours of gameplay to this anime, the thing they did is actually good, but it still confuses anime-only viewers, such as why Joker get the other personas without even us seeing him getting that persona. The problem is thatthe anime doesn't get too much of a battle development, and the only scenes we see them battle is when they battle a boss or something! And hoo boy, they're even OVERPOWERED on those scenes, without us even seeing them train! \\n\r\nBut anyways, let's expand on the plot, to be honest, even IF they did skip the battle scenes, they handled the main story pretty good. My only complaint is that they shouldn't have forced confidant scenes and Akechi scenes into the anime, as it is unnecessary and it takes up minutes of precious main story time. \\n\r\nHowever, towards the end of the anime, they rushed through the story, causing the anime-only viewers get too confused, that is the result of including a long battle scene, therefore, they should've planned the anime first before announcing it as 26 episode, because 26 episodes can't handle all of that.\\n\\n\r\nNow let's discuss about the animation and sound, \\n\r\nThe animation? Hoo boy, we don't talk about that here, it was disgustingly horrible. You could obviously tell they didn't have a lot of budget for this anime. Lack of frames, unfinished sprites, name them all. But, the animation improves as the episodes goes by, although only a bit. But, trust me the animation was unbearable to look at in the first few episodes.\\n\r\nThe soundtrack in this anime was good, nice opening, nice ending, but in the first few episodes (AGAIN), they forced in background music from the game, making the atmosphere awkward.\\n\\n\r\nWhat can I say for this anime?\\n\r\n5/10, Hoo boy. This was like a test anime for cloverworks, it improved each episode, even by a bit.\\n\\n\r\ntl;dr improving things each episode, shitty first few episodes and a forced conclusion.\\n\\n\r\nThanks for reading and goodbye.",
            "date": "2018-09-30T02:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 290474,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5060027.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuOne",
                "username": "OtakuOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=290474"
        },
        {
            "content": "This adaptation is riddled with issues, ranging from fairly minor to really irksome, but my biggest problem with it is the direction.\r\nSeiji Kishi did P4: The Animation a hell of a lot of justice. It may not have had the biggest budget or the highest-quality art, but the slice-of-life episodes were hilarious, and there were several really memorable (and emotional) action scenes. One need only recall the remarkably well-handled summer episodes, which retold several social link arcs in a really entertaining and satisfying manner, to realize the core strengths of the show. The anime ended up capturing the tone of the game perfectly and, forwhat it's worth, the pacing was alright (the game itself is certainly not much better in that regard). \\n\\n\r\nI could go on - what about Yu Narukami, whose nonchalant and deadpan lines from the game carried over seamlessly into the show, and occasionally ended up being even funnier? He's a prime example of how to go about constructing the personality of an originally silent protagonist. Not to mention he even goes through a little arc of his own that wasn't present in the game.\\n\\n\r\nAnd here we have P5 the Animation, which starts out at a lightning-fast pace. Not too different from P4. I can certainly forgive that to an extent, as it's standard introductory episodes fare. But in this case the build-up to the Kamoshida conflict (and the aftermath) feels so rushed, that what is considered by many the most poignant act in the game turns out to be the first real low point of the show. The production values are at their worst around this point as well.\\n\\n\r\nThankfully, the show begins to pick up with Yusuke's arc. The pacing slows down a bit. Goro gets some significant screen time to himself and his encounters with the Phantom Thieves, which makes sense considering the conflict of ideals which the story has to establish before it can move forward. Makoto is no less likable either and her design looks great. The main characters' confidant arcs which have been included thus far get resolved within an episode or two, whereas the other confidants have been shown in a few scenes, occasionally aiding the Phantom Thieves (as is the case with Ohya), and I can only assume they are going to have their stories fleshed out sooner or later. Kawakami's encounter as a maid with Ren was actually funnier than the game and she's somehow even more adorable.\\n\\n\r\nOur protagonist Ren doesn't quite match up to his game self. While he retains the semblances of a lovable dork, he's missing those snide dialogue choices from the game, and actually doesn't speak that much relative to the other characters at all. I can't fault his representation here too much, as keeping the protagonist's blank-slate character was a reasonable decision, if a bit on the safe side. \\n\\n\r\nBefore I go any further, what do you think are the P3/4/5 games actually about? The typical response would be a cross between a dating sim and a dungeon crawler with demons. So why haven't the creators of this show sought to adapt both these aspects?\\n\\n\r\nSee, the Persona v demon battles are embarrassingly short and poorly animated. This is assuming there is an animated battle taking place on-screen, as they haven't even bothered doing most of them. To the average fan of the games, this feels unfortunately alienating. P5 is even lengthier than P4, yet it's possible the former will end up having fewer episodes than the latter, for which I find there's absolutely no excuse. Of course they'd rather fill the episodes with more story, but this begs the question of why the series was planned like that in the first place. Knowing P5 replaced shadows with classic SMT demons, each with its own quirky personality, it wouldn't hurt to see them in action a little more.\\n\\n\r\nThe game is also known and loved for how stylish it is. But the moment the anime tries to emulate some of that style, you know you're getting mixed results at best. There's no need to include the red-black transitions that tell us that a day has gone by or the characters are moving to a new place. And that all-out attack animation has yet to be neatly animated. The art in general is alright, although the show creates an atmosphere that's not nearly as evocative or moody like that of the game.\\n\\n\r\nI do hope the show ultimately gets the treatment it deserves. It's not a terribly boring watch by any means - just really disappointing to big-time fans.",
            "date": "2018-07-09T05:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 283508,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/for_soren",
                "username": "for_soren"
            },
            "url": "https://myanimelist.net/reviews.php?id=283508"
        },
        {
            "content": "I went into this anime expecting the worst as I had nightmares with the god-awful animation of the OVA but it was a pleasant surprise to see the animation was actually halfway decent (compared to the OVA) for what its worth. It's nothing groundbreaking but it works. The animation is a bit stiff to my liking but it must be because I'm coming straight off the heals of binging Violet Evergarden (I highly doubt it) but the aesthetics are right on point (I am in love with the look of the velvet room.). You won't get most of the character development as the story hasto be condensed to 12 hours or so. The metaverse is not as good as I wanted it to be but I'm content with this adaptation. It's still very enjoyable if you're able to overlook most of the bad CG and shortcuts the animators took to make this possible. Can't wait for the next episode\\n\r\nP.S. #AkiraForever",
            "date": "2018-05-13T05:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 280462,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jimmyedagawa78",
                "username": "jimmyedagawa78"
            },
            "url": "https://myanimelist.net/reviews.php?id=280462"
        },
        {
            "content": "I wonder if i am justifying the 8 rating i gave but please there be a season 2.\r\nThis review is coming from someone who has never played the game before or pretty much any game using the console. If i see this purely from an anime POV with no source material to fall back on, i would say its a fairly decent story with some average CG for action scenes The story is also well paced and it has some interesting premise. The ending was also unexpected. \r\nStory: If i compare P5A with P4A, the former has at least a semblance of a plot whilethe latter was fragmented too much to the point that i lost coherence of the plot with each episode towards the later half of the season. On the bright side, it was fun watching this slice of life anime as it explored dark themes coupled with an interesting supernatural backstory.\\n\\n\r\nArt: The character art has some justice done on them. But i cannot say the same for the animation. The CG for battle scenes alone were so out of place that even an amateur like me could see how the 3D effect was ruining the animation itself. I am not a fan of this style of graphics.\\n\\n\r\nCharacter: I want to like Ren not only for his character design but also for his personality but he spoke so less and he just had not translated his inside-the-palace charisma onto his real life image. Like P4A before, the main players of the 'phantom thieves' are too docile to accept the persona and become a part of the team. I saw no resistance or betrayal of sorts that develop the characters. Ann who is vehement not be objectified invariably gets a persona which is the very definition of sexism. \\n\\n\r\nAkechi: Sometimes i felt like i was watching a conversation between kira and L. Only that akechi's suspicion on Ren did not amount to a 3 percent chance he could be a phantom thief. I loved the ending though. While i did expect something along those lines, honestly i could not predict how the animators executed it though. So its obvious i am looking forward to a season 2.\\n\\n\r\nStory: Similar to P4A the story style is same with the main chara entering a different dimension or metaverse. There is no point in trying to figure out anime logic. they can change the feelings without that person actually knowing that is heart has been invaded through some inexplicable means. The more confusing part is how they interact with desires itself which somehow is able to recognize ppl and situations. The explanations were of little to no help.In short this anime has created a series of NPCs of the characters as well. The story plays a lot by the ear. Everything is safe or if it was the animators' s idea to make it viewer friendly at the same time brushing against darker themes like abuse and such.\\n\\n\r\nOverall: Loved the building up of suspense. i understand why this gets all the hate but for all the animus that ever stuck to the source material, this is no so bad. Without perceiving at P5A as an adaptation of a popular game i was easily kept entertained for the two days i spent binging on this. I dont mind recommending to those who have never played this game but want some near cool anime to watch for this season.\\n",
            "date": "2018-10-26T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 292635,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5500800.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/akirakishitani",
                "username": "akirakishitani"
            },
            "url": "https://myanimelist.net/reviews.php?id=292635"
        },
        {
            "content": "TL;DR: Works better as a companion to the game, anime original scenes or changes from the game are generally pretty good but the rest can be seen as average in terms of writing. Art is mediocre overall but gets better too late. Enjoyable if a Persona fan, just don't expect P4A 2.0\r\nPersona 5 the Animation has been the subject of ridicule with the quality of the art and animation along with the rushing of a 100+ hour game into 26 episodes plus an unspecified amount of OVAs later on, and from this you would think that CloverWorks has somehow managed to make the worst animeof the year. As someone who loved the game and somewhat enjoyed the anime, I disagree.\\n\\n\r\nLet me explain.\\n\\n\r\nStory\\n\\n\r\nThe same as the game that's being adapted, a few changes to some major events that, in my mind, fix some areas of the game that I found a bit off (such as the existence of the betrayal being revealed in the first 15 minutes of the game and the Okumura arc). The rest of it is around or below average, especially near the beginning with the Kamoshida arc being horribly rushed, with a silver lining in that the writing seemed to improve as the series continued.\\n\\n\r\nArt\\n\\n\r\nBelow average for the most part, with some standouts in the final few episodes. Poor animation (particularly All-Out Attacks and the use of CG outside of bosses) and art are everywhere in this adaptation, so the less said the better. The second set of visuals for both OPs and the final few episodes stand out as good art from this adaptation.\\n\\n\r\nSound\\n\\n\r\nThe game's soundtrack with sometimes weird timings and mixing along with a few anime original tracks, both instrumentals and ones with Lyn again providing vocals.\\n\\n\\n\r\nCharacter\\n\\n\r\nHere's where things get interesting. On one hand, Ren Amamiya is quite a boring character compared to the Joker of the game, particularly if you liked to pick the joke options, and is a huge let down to me after the P4 and P3 animes' portrayals of their protagonists (he has a few moments but despite them there's no redeeming his writing). The other characters, however, get expanded upon and have anime original moments that are actually good. Goro Akechi's friendship/rivalry with Ren sees heavy expansion to the point that they can be considered as having a connection instead of one line and a confidant rank up like in the game. The entire party seems to interact with each other more too, like the anime's addition of Ann and Makoto's friendship after the Kaneshiro arc.\\n\\n\r\nOverall\\n\\n\r\nIt's good I guess. I feel as if you'd have a much better time in watching this after completing the game as while the general quality of the series ranges from average to poor the new content, whether its original scenes or changes to the game's script, were generally the highlights of what could have been a massive dump on a great game",
            "date": "2018-10-11T06:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 291478,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7029028.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShadowStealer7",
                "username": "ShadowStealer7"
            },
            "url": "https://myanimelist.net/reviews.php?id=291478"
        }
    ],
    [
        {
            "content": "So far, this adaptation has been a massive disappointment. \r\nA-1 pictures are known for their generic character designs and cutting corners when it comes to animation, so when adapting a game as stylistically brilliant Persona 5 it was obvious they wouldn't live up to the game’s highs. I never expected it to excel or even match the game’s quality, but with a director as talented as Masashi Ishihama (Shinsekai Yori) expectations were raised and this adaptation’s first six episodes have flown far below them. \r\nStory: 5/10\r\nA 100+ hour game stuffed into 24 episodes will inevitably have pacing issues, and this has its fair share. Thestory is rushed as hell, but so far it has given us the most important information to give us a surface level understanding of the world and plot. Any depth the game's story offered is for the most part missing. The themes of adults in positions of power abusing their roles have been boiled down to “grown-ups bad, kids good”. Like most of this adaptation, any half-hearted attempts at storytelling feel like a low effort recap to advertise the much better video game. \\n\\n\r\nCharacter: 3/10\\n\r\nWe have only met Ryuji, Ann, Morgana, Yusuke, and the quiet main character called Ren in this adaptation. They all feel like cardboard cutouts with a fraction of the personalities of the game's counterparts. Trying to stay as faithful as possible to the game has hamstrung the character arcs, story beats are trimmed down or skipped entirely so we can't get a sense of who the main cast are from this show. The game itself was not perfect with characterization either, which is expectedly not fixed in this adaptation due to the insistence on staying as faithful as possible rather than letting the anime stand on its own merits. \\n\\n\r\nThere’s plenty of inconsistencies in their arcs and annoying quirks that made some of them hard to like before they received development. These annoying quirks, like Ryuji’s obnoxious attitude and lack of self-awareness, become almost all there is to the characters. There just isn't enough time for each cast member to be developed beyond a surface level.   \\n\\n\r\nEven those inconsistencies in development are already appearing. In episode 4 Ann announces she’s finally free of the twisted pervert Kamoshida who was sexually objectifying her, but because this is a lovely A-1 Pictures anime, the camera is constantly shoved uncomfortably close to her butt. You could argue plenty of fanservice is necessary for the studio to secure a budget, but it is so opposite to the message the game was trying to convey. Effectively undoing any development that came from what should have been the most monumental battle in the first quarter of the show. \\n\\n\r\nArt: 3/10\\n\r\nAction scenes are where the series looks the worst. It constantly uses this laughable shortcut of zooming in and out on unanimated shots to reuse them at a different resolution in a later scene. There’s somehow less animation than the game, and what we see tends to be worse. Look no further than the ‘epic’ boss battle in episode 5, what should have been amazing was stilted by hideous CGI that looked even worse than what was used in the game. The action is so boring to watch too because there are next to no stakes, usually, the Phantom Thieves are fighting random mobs but even the boss goes down so quickly. \\n\\n\r\nThe fight choreography is even worse, the whole battle scene where Ryuji awakens his persona is the worst case of it. There is next to no fight choreography at all, hits don't even feel like hits, it's more like colors flying around with sound effects added over it. And somehow the all all-out-attack is so much worse than the game’s even though it was practically ripped straight from it.\\n\\n\r\nCharacter designs are the best part of the visuals because they’re lifted straight from the game, but they only look good when they’re totally motionless or on an animation loop (very often). When there's not much movement and/or character close-ups look really good but by that logic, you should just play the game.\\n\\n\r\nThere’s also plenty of ugly CGI random people walking in the background. In episode 2 Ren and his teacher are talking in a hallway, and there’s a giant CGI student trying desperately to walk without looking like a robot but its so obvious he was stuck on there last minute with zero quality control to fix him. He looks ridiculously unpolished and the perspective is all messed up, he goes past two girls standing near a door and he looks twice as large as them.\\n\\n\r\nSound: 6/10\\n\r\nPersona 5's OST is amazing, but here it's lifted straight out of the game and overused with not care for if it fits the scene or not (usually it doesn’t). You can easily tell when they use stock sound effects, deafening the punchy effects of the game’s combat for the sake of something easier on the ears but infinitely more forgettable. Yes, they fixed the OP and it is decent now, but the ED is still just a still image with limbs and hair being animated to look like the main cast is walking. It looks so uncanny, a completely still image would have at least not distracted from the pretty good song. \\n\\n\r\nOverall: 4/10\\n\r\nI honestly can’t see this getting any better, but I love the game and respect the director enough to see if it can repair the story/character issues. I’m not expecting the art to get better because it seems as though they’re stretching the budget out to meet 24 episodes. \\n\\n\r\nIf they try to simplify the character designs to be more fitting to a TV anime budget rather than solely faithful to the game, it may become more manageable for A-1 to animate. Also, I've referred to CloverWorks as A-1 a few times, there's no difference. It's a subsidiary of A-1 so they're the same.",
            "date": "2018-05-12T10:22:00+00:00",
            "helpful_count": 81,
            "mal_id": 280379,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=280379"
        },
        {
            "content": "Unfortunately for game anime adaptations, they have a steep hill to climb to recapture the magic you get from playing through them.\r\nPersona 5, another addition to the long time SMT/Persona series was a huge success in both the west and in Japan. It won 2017 Game Awards “RPG of the Year” And was ranked at was of the top games of the year by many gaming outlets. Even with that, the anime was considered a disappointment from the start. With its cheap animation, off-pacing at times, and generally its lack of what made the game special.\r\nHowever, my expectations played a part in the viewing experience.It was clear from the start that this wasn’t going to be like the game at all, as most game adaptations never are. Persona 5’s stand alone story is not what made the game special, rather just one factor. I wasn’t coming into this expecting what I got from the game, and neither should you. As I do see where most the criticism comes from, the root of it is from people who compare to the game, this probably isn’t a fair way to look at it. The game was made by thousands of more people, have had years to develop, and is generally taken more serious. This was a direct result of poor animation, bad pacing, and cutting out parts of the game. The anime should be given some slack in that regard.\\n\\n\r\nWith all that being said, I am not trying to defend the bad parts of the P5 anime. They are noticeably apparent, and part of why it led to widespread hate of the P5 anime. The animation is sometimes shit. The CG usage was often bad, especially in the background characters walking around. The faraway faces are sometimes laughable. And although the pacing is considerably better in the second half of the show, the beginning is way too fast. Usually I wouldn’t give these issues a pass, but like I said since it was mainly being compared to the game I do. People who haven’t played the game probably won’t see that much of an issue in these.\\n\\n\r\nIn many cases however, what likely appealed to you in the game should transition into the anime. If you like the characters, they will translate nicely. And of course, the music does as well. Chances are you didn’t complete everything in the game unless you played it through multiple times, so some of what you will be seeing from the characters could be a new experience. The character development was taken from the ‘confidant’ system so if you didn’t complete everyone’s confidant or maybe just were not paying attention you could be seeing new content. That along with the actual anime exclusive scenes, like seeing some of the characters in new situations, or seeing them given more backstory like showing them as children, gives the anime merit to watch even if you have played the game, a common criticism.\\n\\n\r\nThere isn’t always something to say about P5TA. Largely because it is just doing what it was supposed to. There are both good and bad parts. If you want to experience the game but don’t want the time investment of playing through all of it, (and trust me, the game is huge) than this might be for you. If you are a fan of the game, than this might be for you. It doesn’t necessarily show everything the game has to offer, but doesn’t do anything too bad to diminish it either.\\n\\n\r\nYou shouldn’t think too hard about this one.\\n",
            "date": "2018-09-29T10:44:00+00:00",
            "helpful_count": 55,
            "mal_id": 290393,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6554590.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dotta",
                "username": "dotta"
            },
            "url": "https://myanimelist.net/reviews.php?id=290393"
        },
        {
            "content": "Persona 5 is the newest addition to the Shin Megami Tensei franchise. Its source material had around 5 hours worth of actual content like is implied in its name, yet playing the whole thing takes around 140 hours because it's a classic J-RPG game that relies on repeating the same thing 18500 times. \r\nUnfortunate for the fans of the game, the anime end up being 26 episodes long when it should have been 500, and unfortunate for anime fans, the anime end up being 26 episodes long when it should have been 13.\r\nAs far as fillers go, filler is canon content I mean, Persona 5is full of slice of life nonsense that has nothing to do with anything. People fighting over pieces of bread and talking about their dreams just to make sure the pacing will become harder to comprehend than the popularity of the franchise itself. \\n\\n\r\nWhat is directorship? is what I found myself often asking when seeing how Persona 5 is build to be nothing but a collection of random scenes that were edited together without any consistency or flow that makes the next scene related to the former one. Screen transitions seem to be some sort of \"worst animated cabbage\" meme when the focus goes from pan fights in the middle of the day to a scene where we drink coffee in the evening to a bully scene and finally returns to a scene where the actual pan is being eaten in a time that seems to be the very next day. The shots mainly remind me of Resident Evil The Final Chapter (movie) where the camera angle could change 45 times a minute over the same scene except here it changes from scene to another in ludicrous tempo. Visual storytelling at its finest. Bravo. \\n\\n\r\nOur main characters are incredibly random. They mainly remind me of Suicide Squad. By Suicide Squad, I mean every superhero movie ever because that thing was exactly as good as they all are. The real mc is some sort of mixture of Robin Hood and Jesus. The female lead appears very mysterious, but the real mystery is why would anyone care. She is pretty hot, tho. The blonde dude is like spiderman but sassy. All the other girls were just swag, but gladfully there was like 7 beach episodes so they really had time showing off their naked bodies as it's not like they had anything else to show. None of the side characters feel like genuine persons, they are more like NPC's who only exist for the main characters... oh wait. \\n\\n\r\nWhat is this series all about even, you ask. And that's what I am still wondering. Teenagers with stand powers are participating inside some sort of fighting tournament shonen storyline that mainly reminds me of Katekyou Hitman Reborn (we even have the same mascot here) except the comedy was replaced with some type of combination of angst and edgy, the villains are evil adults, the actual events are Robin Hood with superpowers and most of it is slice of life. As epic as it might sound, what it really sounded like was a wet fart. \\n\\n\r\nThe only good thing about the game itself was the OST. Unfortunately, voice acting is always at louder volume than the OST, and SFX above all else. Boy don't we love it when explosions cover the music. It really fits the definition of a background music because instead of trying to make the series better by using the songs to their full potential, they are just there hanging in the background. It's pretty much a stupid decision. \\n\\n\r\nOur art is at least pretty fun if not otherwise impressive. Villains wearing strings and cloaks made of fur offer the most original content in the entire series. Some of the leather suits were also pretty sexy. Especially the art room looked cool as fudge. Too bad its overall screen time totaled 3 seconds. Like literally. Not that even these things would be worth of praising in a series that had some other merits. Pretty much all side characters follow the \"spot the main character\" tier filler/design.",
            "date": "2018-09-29T09:08:00+00:00",
            "helpful_count": 51,
            "mal_id": 290383,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=290383"
        },
        {
            "content": "LOOK HOW FAR WE'VE COMMMMMEEEEEEEEEEEE\r\nHoy lads, I was quite excited to see my first review make it front page so thanks for that but now that the anime is done I guess I have to write this again. Most of my opinions haven't really changed so bits and pieces will remain the same. Swearing to Brahman didn't really help save this anime and P5A only slightly picked itself up towards later episodes. Atlus still should not be tolerating this kind of quality and I do sincerely hope they get out of whatever sort of contract they're in before they decide to ruin another property. \r\nLet'sbegin, no spoilers. As someone who is passionate about the Megami Tensei franchise as a whole, and adore the Persona entries, I felt obligated to just... say what I'm thinking, give a little rant ya' feel? Aight, cool. Let's go. \\n\\n\r\nP5 was my game of the year last year and is one of my favourites in MT as a whole. Lots of things they could work on, but nevertheless it's a brilliant entry with a brilliant story, characters, art, music, etc.. If you're wondering whether or not the *game* is worth your time, then yes. It probably is. Please don't go looking at this anime for your answers because, well for fuck's sake, you won't find them here.\\n\\n\\n\r\nANIMATION: \\n\\n\r\nLet's start with the big one. The animation is hilariously poor and it kind of pisses me off. The P3, P4 and to an extent DeSu properties have been treated quite nicely (except for P4G which was atrocious and made me want to die), and hardly did I ever cringe at any 1 frame. P5 however. Heh heh heh... uh, well let's just say I've made a separate Discord to Jack Bros that just holds a bunch of cropped screencaps of characters.\\n\\n\r\nFrom the awkward running cycles shown in the first couple of minutes of the first episode to the new, overly lazy All-Out Attack meme scene of the second episode and out of place CGI characters roam the corridors and street to episode 12's (~9:30) scene where they tried to zoom out on a character but the character layer and the background layer were done to two different levels of zoom so basically the kind of shit I accidentally did in my 2011 YouTube videos and like how the fuck can this go unnoticed my god. I'mma take a breather. And we back. Okay. I also liked when they got too lazy to animate Makoto so they brought out a low quality P5 model in episode 11. \\n\\n\r\nWhoever is animating this bullshit is in it for the monetary gain. They've been given one of the most well received RPG franchises and it just seems like they don't give a shit about it. Ironic considering P5's story. \\n\\n\\n\r\nSOUND:\\n\\n\r\nShoji Meguro is still a god with music. Whatever he creates makes me the very happy. The first opening song is brilliant, the second opening song is brilliant, the ending song is brilliant; Lyn's voice is just great and Shoji knows how to create music. What little new stuff I've heard has also been pretty good. Actually using his music at the right moments however is a different story. I'm primarily thinking of the Ryuji awakening scene at the moment, the song choice and awkward sync made me (personally) cringe a little and took away from what should have been a very powerful moment for the character, like it was in game. \\n\\n\r\nOn top of all this, episode (12) had begun using P5D music, in particular the Jazztronik remix of Wake Up and ATLUS Konishi's Blooming Villain. Considering P5D was released like a week ago from this episode's release, their inclusions made me feel like the episode had only been completed recently, implying it was rushed. They might've gotten the rights to such music beforehand, but I personally believe they would've used more remixes in earlier episodes had this been the case. I had a discussion with a friend about this and they said it could've been a marketing strategy for Dancing but using random songs doesn't seem like it would accomplish anything in my personal opinion.\\n\\n\r\nGuess I should also mention that the sound design in terms of effects and ambiance is quite poor. I made a note of episode 16 having used stock sound effects, or what sounded as such, but either way it sounded very unprofessional and cheap. \\n\\n\\n\r\nSTORY:\\n\\n\r\nThe pacing feels awfully fast and unnatural, with them cutting out a bunch of stuff that ultimately added to the game's story and development of characters. They cut out the part where Kamoshida asks Ren if he wants a ride where he says \"Nah\" and that. That. I was sitting there, anticipating the \"nah\" but they didn't do it and I was just blue balled y'know. Cried a little even. Jokes aside, with 24 episodes I thought they'd not need to be rushing but look how that turned out with that 2 episode extension. Tips for next time: focus on filtering out the stupid long and drawn out shots of the fucking rain. \\n\\n\r\nAlso as a quick note, watched the show on Crunchyroll where they awkwardly linked Kamoshida to being in a train accident in the first episode or something and then relate that accident indirectly to the phantom thieves... which never happened in the game nor really happens in the anime. It was just worded really poorly.\\n\\n\r\nI like how they ended the show with an ambiguous ending, did we get the \"good ending\" or the \"bad ending\" thing; obviously leading to their OVA but it was nifty none-the-less... at least in theory lmao. They've said they're going to sway away from the original ending with the OVA so when I heard they left on a note of ambiguity I got a bit of a hard on. But from the looks of it, they set up the good ending pretty well so don't know what to expect now.\\n\\n\\n\r\nCHARACTERS:\\n\\n\r\nIn my personal opinion, Persona typically does its characters really well -- formulating them in such a way that makes them more human than just characters playing their part in a story. However in P5A, they're... well gee, they not done very well lads.\\n\\n\r\nRen (the protagonist) comes off initially as this angsty, edgy and depressed teen, and with such dialogue options from the game as \"Please look after me\" and \"Hell yeah I'm into older women\", you kind of desire that silly aspect of the character especially when they did it with Yu in the P4 anime. Of course, Ren as a character is up to interpretation so I can't really say it's \"wrong\". The other characters though, well yes I can.\\n\\n\r\nSojiro feels so monotone and boring. The first couple of moments in the game set him up as a character who doesn't want to bother with your shit effectively helping to establish one of the best character development arcs in the story. He just sort of feels 'there' in the anime, to progress the story when we need him to. Ryuji was fine until his rushed awakening and overreaction to Ren's story. There's something about him but I cannot put my finger on it just yet. Morgana is there, Igor looks dumb, Mishima didn't get hit by a ball, and I can finally understand why Shiho wanted to jump.\\n\\n\r\nAnn is definitely the worst change though. Ann's whole arc was supposed to be about her feelings towards objectification and slowly acknowledging herself as an attractive individual, using that fact for good. But what happens the episode after she goes on her whole \"don't objectify me\" spiel? They objectify her. :clap: :clap: Constant fanservicey shots, close ups of the icky unmentionables, you name it.\\n\\n\\n\r\nOVERALL:\\n\\n\r\nThis show has been making me very sad and I'm not entirely hopeful for Dark Sun. There's nothing much more to say except that I hope Atlus start giving their properties back to competent studios. Tune in next time for when I show you how to hack into the Pentagon using only Futaba's social link.",
            "date": "2018-09-29T21:34:00+00:00",
            "helpful_count": 28,
            "mal_id": 290455,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4507751.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggesus",
                "username": "ggesus"
            },
            "url": "https://myanimelist.net/reviews.php?id=290455"
        },
        {
            "content": "I immediately say that, I have not played the game, because I have only a PC and no consoles, but in good time back I already heard the sea a good comment about this game, most said that the game is worth it and the time went so fast that an animation about this game was already appearing and I decided to start watching this piece of work..... ok lets start with>>>>>>>>>>>>>>>-OP intro- 9/10- impressive and interesting created, I really liked it.\r\nStory 7/10- For the moment everything is fine except for the main storyline- he has not yet appeared (although it was shown whose oneof the main hero is in the interrogation room and he tells for some organization a story about own life= That could be fragment of the main story) but our heroes have enough working side missions so I can not understand what will happen next, for the moment I am satisfied with everything, YES there are things I would like to ask a question but I think the answers I will receive soon.\\n\\n\r\nArt 7/10- I even like this kind of drawing, though the legs seem a little too long, but it satisfies me.... the fighting episodes could have been much better, because at the moment it looks like 5/10 but overall 7/10 I hope that in further episodes it will improve.\\n\\n\r\nSound 7/10- I've seen console gameplay in youtube and the sounds are taken from the game and music could also be.\\n\\n\r\nCharacter 6/10- To date, there is too little information about each of the main characters for the moment I like just two of them (Morgana and Amamiya Ren) 24 episodes uhhhhhh..... I hope that it will be enough time to tell more about each other.\\n\\n\r\nEnjoyment 10/10- I watched 6 episodes in 2 days, for the moment I feel good.\\n\\n\r\nOverall 8/10- I have not played the game but I like- Persona 5 the Animation\\n\\n\r\nBonus- Maybe sometime in the future, I will buy a console and will play this masterpiece.",
            "date": "2018-05-20T11:58:00+00:00",
            "helpful_count": 31,
            "mal_id": 281018,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6490648.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magaiverix",
                "username": "magaiverix"
            },
            "url": "https://myanimelist.net/reviews.php?id=281018"
        },
        {
            "content": "It's no secret that adaptations from video games tend to suck. Which is understandable due to it being difficult to cram so much storytelling into another form of media and condense it. There is also the fact that they bring the problems of the video game and try to adapt it into another form of media with those problems. Some examples include the adaptation of characters, their backstories, personalities and glossing over key plot points, believing that the viewer or reader already knows the details. \r\nNow I've always admired the Persona games as an outsider since I have never played the games. So this wasa chance to inspect the story of a Persona game through the ease of use of watching it in anime form. But instead of judging and comparing it to the Persona game, I will judge it on its own merits and see how good it is as an anime and how it has been translated while still acknowledging it is an adaption. Spoiler alert, it didn't do well. \\n\\n\r\nSit back, relax and google what the f**k a Persona is as I present to the anime review for Persona 5: The Animation. Lets begin. \\n\\n\\n\r\nStory: 4/10\\n\\n\r\nThe story begins with our main protagonist Ren Amamiya leaping around and trying to escape a casino until he is stopped and captured by the authorities. From there, someone comes into the interrogation room. An investigator by the name of Sae Niijuma tells Ren that she is willing to help Ren plead not guilty if he tells her everything about the Phantom thieves and their actions. The Phantom thieves are a vigilante group that steals peoples' \"hearts\" to confess their sins to everyone that they have wronged. From there we see the events that have led to this moment and get acquainted to the Phantom thieves, their motivations and their desired goals to see justice against horrible people. \\n\\n\r\nThe shows story structure is very formulaic. The phantom thieves encounter a very horrible person, get closer to them, change their heart, add a new recruit to the phantom thieves and move on to a bigger target. Every. Single. Time. There is some downtime between these in order to get attached to our characters more, which is good. Having downtime between these helps balance the pace out so we are not just going around in circles. But it doesn't change the fact that these castle raids to change peoples' hearts are boring to watch over and over again with only slight deviation. Not only do you know what is going to happen, but there is little variation between them on how it is structured. \\n\\n\r\nAnd while I say the pace is balanced, it is also unbalanced as these castle raids have so many cutaways that it makes it all feel rushed and we don't get concrete buildup to it all when they encounter the final boss of the area. Context is key here as it helps flesh out the story and characters, but rushing to the important bits leaves the impression that nothing else is important other than this scene that we are trying to get to in order to show you this cool scene. \\n\\n\\n\r\nCharacters: 5/10\\n\\n\r\nMan, Ren is such a boring and bland character. I know portraying silent protagonists is hard but their personalities are driven by their actions and by you, the player. But translating that into an anime is very difficult. Instead, Ren resorts to being a near silent protagonist. The problem is that being a near silent protagonist, you are relying on your actions to speak for you, which is something the this show doesn't do. Ren does nothing interesting outside of the Phantom Thieves to expand and personalise his character. Too many times the anime cuts the meat off the side activities to help expand Ren's character. This leaves a main protagonist mind you, with no personality whatsoever as he merely just agrees and nods to other characters. \\n\\n\r\nNow does the rest of the cast share this same problem? Wellllll, not really. Individually, they do have their own personality traits to make them interesting but they are much better when they are together and these multiple personalities integrate with one another. They also get expanded upon in an episode dedicated to them to develop them more, which is something that Ren doesn't get unfortunately. The entire Phantom Thieves group hides Ren's lack of a personality by having multiple different personalities in the group work together to achieve the same goal. There individual personalities though. While they are better than Ren's personality (which isn't saying much), they do start to become a bit stale and boring. As well as some of the characters personality traits start to blend into one another as the show goes on. \\n\\n\\n\r\nAnimation: 5.5/10\\n\\n\r\nWell it certainly captures the Persona style but in execution, it does fall flat. It feels like there were many cutbacks and so the overall animation quality has dropped from what I was expecting. Too many cutaways affected the fight scenes to make them feel lackluster and not capture the overall feel of watching these awesome moves be portrayed effectively. Instead, they just feel like they don't have as much of an impact as they should. This is especially true in the finishing manoeuvre sequence as it really feels lackluster. On the bright side though, the art style is rock solid and really does capture the Persona series which thank god it does because Persona is styled like an anime after all. There is also a good amount of CGI used in this show as well and while I don't think it looks horrible, it isn't great looking either; it's just okay. \\n\\n\\n\r\nSound: 9/10 \\n\\n\r\nSound is the one area I have little to no complaints about. The OST has a very cool style to it and it really does stand out. From calm, collective soundtracks, to alert soundtracks to battle soundtracks. Each of them is distinct from one another and I can immediately recognise which one is playing at that moment. So at least this part of the anime is solid. \\n\\n\r\nLikewise the openings do help set a tone and are enjoyable to listen to. Both opening 1, \"BREAK IN TO BREAK OUT\" by Lyn and opening 2, \"Dark Sun...\" by Lyn as well are probably where the animation style actually shines and is well choreographed. While Dark sun took a little bit to get going for me, it is still enjoyable to watch and listen to. But Break in to Break out, for me, is the better of the two due to not having scenes ripped straight from the episodes before hand and the song being more fun to listen to due to its better build up towards the chorus. \\n\\n\r\nThe endings, while also having good songs to listen to, is hampered down by simple animation as all it features is the cast just walking side by side, looking ahead of them, doing nothing else. I mean I know that it is meant to calm the viewer after watching the episode but it is boring to watch. But I still watched them because the songs were enjoyable to listen to. \\n\\n\\n\r\nConclusion\\n\\n\r\nFor me, Persona 5: the animation feels like a half assed attempt to adapt the game into an anime. Everything feels rushed as to say this is a summary of what the story is. For someone that has not played Persona 5 like myself, that's disappointing. I wanted an alternative to experience the Persona 5 story and characters, not a cheap way to make an anime while Persona 5 is still somewhat relevant before it gets swarmed by other big name games. It is a disappointment to me and I imagine many others and is a poor adaptation of an otherwise fantastic game. Unless you never played Persona 5 and you are really curious or a diehard Persona fan, you can skip this one. \\n\\n\\n\r\nMy Personal Enjoyment: 5/10\\n\\n\r\nOverall score: 5.7/10  Recommendation: Don't Bother\\n\\n",
            "date": "2018-09-29T09:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 290385,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6787406.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Snapshot426",
                "username": "Snapshot426"
            },
            "url": "https://myanimelist.net/reviews.php?id=290385"
        },
        {
            "content": "I'm not going to waste my time with the introduction piece of the review so I'm just going to start with the review.\r\nThe story follows Ren Amamiya who is sent to Tokyo to stay with family associate Sojiro Sakura and attend Shujin Academy during his year-long probation. After his arrival, he is drawn into the Velvet Room, where Igor warns him that he must \"rehabilitate\" to avoid forthcoming ruin, and grants him access to a supernatural mobile app that leads the protagonist into the Metaverse and from there him along with his group of friends that he recruits must now steal corruption from the hearts of adultsin an attempt to reform the city under a group called the Phantom Thieves.\\n\\n\r\nPersona 5 the Animation is a 26 episode anime and yep alarm bells should be ringing. We haven't got a great record of Video Game Adaptations especially as of late with the lacklustre Danganronpa animes. However, I went into Persona 5 The  Animation with an open mind because I thought that maybe this video game adaptation would work. It had director Masashi Ishihama who previously directed the critically acclaimed Shinsekai Yori. Plus the daybreak's OVA for Persona 5 was pretty good. I was actually excited.\\n\\n\r\nHowever, my excitement was immediately thrown out the window when I saw A1 Pictures. For those who haven't caught on, I hate A1 Pictures. I hate the studio with passion. I honestly believe that A1 Pictures is the most incompetent studio I have ever seen. Yes A1 did make some good shows that I really liked like The Idolm@sters, Magi, Shinekai Yori, Your Lie in April and Wotaku but the problem with A1 is that they made a truckload of mediocre, forgettable and terrible shows to a point where a lot of these bad shows seemed to represent A1 as a whole leaving a lot of good shows in the dust.\\n\\n\r\nI also don't want to speak about video games adaptations done by A1 Pictures because I heard nothing but awful things about them.\\n\\n\r\nI know that A1 Pictures did the Daybreak's ova back in 2016 and it was pretty solid but I never expected A1 Pictures to pass the TV series to Cloverworks aka A1's sub-studio until the studio split they own ways in October 2018.\\n\\n\r\nHowever, this show was released before A1 and Cloverworks went they own meaning this series despite being done by Cloverworks it still had that nasty A1 stench that I hated.\\n\\n\r\nAm not going to pull any punches with this one the story was awful and here's why.\\n\\n\r\nTo start off with the elephant of the room is the pacing. Good god the pacing. Not going to lie this has got to be some of the worst pacings I have ever seen in anime because not only the show is ridiculously inconstant with it's pacing as it either way too slow or way too fast but it also screws up the overall narrative as well the emotional story elements.\\n\\n\r\nFor example, in the game, Shino attempts suicide being raped by Kamoshida. It was an emotional moment in the early game of Persona 5 that was meant to showcase how screwed up the adults in the universe of Persona 5. It also gave Ann, Ryuji and Akira the motivation to act against Kamoshida.\\n\r\nIn the anime, it just happens in fin air. No tension, no proper build up whatsoever, nothing.\\n\r\nThis doesn't end where the show also outright skip various story elements that were meant to develop the characters. Even if you haven't played the games you can easily tell that the show is skipping and rushing many story aspects and as a result of that many of the story elements just feel awkward disjointed and forced.\\n\\n\r\nAs a fan of the games, I felt insulted of how the show completely butchers and ruins everything that made the game so great in the first. Let's not talk about the social life aspects of the series because they do not exist. The biggest mistake of Persona 5 the Animation was how it adapted to a story that needed at least 51 episodes compared to 26 episodes that it actually got\\n\\n\r\nThe final nail of the coffin was the ending. That ending alone was a big middle finger to the viewer as the show just ends in a very crappy way that feels unsatisfying as hell. I am aware that the series is getting an ova sometime soon but this is no excuse especially when we watched 26 of this rushed, awkward and poorly animated shit show that barely respects its source material.\\n\r\nBy the way, the Dark Sun OVA is not much better.\\n\\n\r\nThe characters in Persona 5 are just lifeless husks of the game counterparts. Not only the character development is rushed beyond belief but they somehow made theses once interesting, well written and likeable characters and turned them into bland stereotypes. To save myself the misery and pain I will be ending the character selection of the review because if the show can even respect its characters than why should I.\\n\\n\r\nNow if thought the story and characters in Persona 5 The Animation were bad enough you ain't seen nothing yet because this is where the show officially hits rock bottom.\\n\r\nWhere the hell does I begin with this dumpster fire.\\n\r\nFirst up the art style compared to the game looks like it was fished out of the toilet. Not only the show looks unappealing as well with its shitty background scenery, horrible lightning and uninspired character designs that look like the came out in early 2000 of anime but the art inconstantly is busted beyond belief where throughout the 26 episodes characters would constantly go off the model. \\n\\n\r\nThe animation is even worse. I have never seen animation this lazy and lifeless since Black Clover and The Kings Game.\\n\r\nAlmost every single scene and fights in this show are all horrendously animated to the absolute core.\\n\r\nAlso, we don't speak about the shows horrendous attempt of using CGI. Good God was it awful to look at.\\n\r\nThe final nail of the coffin of this shit show was the all-out attacks which are frankly some of the worst pieces of animation I have ever seen in any anime. Every single all-out attack in this show feels like it was animated by college drop out who barely know anything about style when making this sequence in Adobe After Effects.\\n\r\nNot even the beautiful fan-service scenes can save this shitty production.\\n\\n\r\nIf there was anything good to come out of Persona 5 The Animation it would be the soundtrack. Despite the soundtrack being straight up taken from the game, it was still a great listen.\\n\r\nThe first opening theme BREAK IN TO BREAK OUT\" by Lyn is a fantastic opening theme for the show. While it was nowhere near as awesome as Wake Up, Get Up, Get Out its still a great song that perfectly captures the style of the series.\\n\r\nThe second opening theme Dark Sun by Lyn is a pretty solid opening theme in its own right however until the final episode I didn't like the fact that they reused footage from previous episodes into the opening visuals. However, the opening visuals for the last episode were awesome as it really showed off what the show could have been production values-wise.\\n\r\nThe ending themes were good but not that memorable.\\n\\n\r\nThe voice acting was pretty okay as well however I feel like the Seiyuus didn't put much effort compared to the game counterpart. There is no English Dub for this show from the time of this review so if you're a fan of the Persona 5 dub well you're out of luck.\\n\\n\r\nPersona 5 The Animation is a total waste of time and effort. I honestly don't know what the hell was the director and Cloverworks were thinking during the production because they took everything that made Persona 5 so awesome and manages it screw it all up. The story is a rushed and poorly directed mess that is filled with horrific pacing that barely tells of what is going on. The characters are nothing but empty shells of the game counterparts and the visuals were horrendous beyond belief. The only good thing to come out from this scrapheap of a show was the music and the openings.\\n\\n\r\nIf you haven't played Persona 5 and have a PS3/PS4 do your self a favour. Go buy it right now. If you don't have a PS4 or PS3 you can either save up for one or watch other anime with the same episode length like Neon Genesis Evangelion, Cowboy Bebop, Nichijou Rainbow: Nisha Rokubou no Shichinin, Ghost in the Shell: Stand Alone Complex and the list goes on.\\n\\n\r\nHonestly out of all the game anime adaptations why is it Inazuma Eleven and Gungrave were the only one to get it right while others like Persona and Ace Attorney have to suffer. Such a shame.\\n\r\nCloverworks you may now be separated by the EA of anime studios A1 Pictures but you better redeem yourselves in future anime projects because you now have a lot of potential to be a competent studio. Don't let me down Cloverworks.",
            "date": "2019-02-08T15:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 301193,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 1,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=301193"
        },
        {
            "content": "Persona 5 was one of the best RPGS I've ever played in my life, sensational gameplay the story is very good, have very few holes and plot twists sensational.\r\nThe characters are great super well developed, as long as the player has an interest in socializing with a certain character.\r\nAlready in the adaptation made by CloverWorks was different, first of all in the adaptation they decided to adapt 26 episodes until near the end of the game, which would be about 80 hours of history inside the game, of course it was very rushado, the problem is that Person 5 is a slow game that hasthe essence of making your own lifestyle within Tokyo with your own choices in the course of the game, taking that essence and accelerating the pace ends up leaving the feeling of everything being very superficial, whether in the relationship of the characters , at work, at school, in dungeons when he has fights, even in striking moments he can not deepen the scene in which the original had, was much worse. They did not know to take advantage of the characters of the game that can make you more curious about the history of each one and wanting to sympathize more and more, already in the adaptation they left very superficial the characters even more in their interaction with the protagonist, you simply do not care about they. The dramatic scenes and even the comedy scenes did not look good on the adaptation, without any impact, totally superficial, they just happen without a good break.\\n\\n\\n\r\nThe production was a fiasco, mainly in the fights, they could not pass the style of the fights that have in the game, outside that they tried to recreate the style of \"All out Attack\" that is one of the most stylish things of the game and was ridiculous,\\n\r\nthey failed to get a sense of epic battles against the bosses, they used almost no perk within the battles, and they changed certain\\n\r\nost of certain battles that got horrible. In the quieter parts he had many times that unnecessarily bent the design of the characters, besides the color palettes that did not use well. The dubbing is the same as it is very good. The ost used the same of the game that is sensational, and some new ones that were very good, but they were not always able to combine certain osts with the storyboard, in general it was mediocre.\\n\\n\r\nHe had some cool things, like a better situation in the game that got a little superficial, usually in moments with minor characters in certain scenes, but in general it lacked a lot of character to stand out or receive a better polish inside the story, it was only played for say that there is that character inside that world that is something that the game does not do and has every reason for the character is present in that world.\\n\\n\r\nConclusion:\\n\r\nSometimes it is very cool to follow without commitment and without worrying about the details, after all I like a lot when it involves anything of persona 5, but Persona 5 is much more than that.\\n\r\nIf you are looking for a good experience with the story and the characters and especially the fights, play the game, that anime is just a small attempt to do marketing with the game that fails miserably.",
            "date": "2018-09-30T17:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 290550,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5833936.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GianisSenpai",
                "username": "GianisSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=290550"
        },
        {
            "content": "For a game that's about \"stealing your heart\", Persona 5: The Animation on the other hand was nowhere close to capture LA's heart...\r\nLA only recently gotten into Persona 4: The Animation LA was hyped about Persona 5 as LA didn't play the game, so the anime was a good look into Persona 5, however...\r\nPersona 5: The Animation on the basis tries to relive the events of the game, truncating any of the minor events, and with that LA will at least say that trying to cram in a 90 to 120 hour game into a 26 episode anime IS gonna have these kind of limitations,but for what it's worth, Persona 5 did ok if a bit rushed in some of it's arcs. Persona 5: The Animation is inflicted with the video game curse in some sense but not in the way you'd think.\\n\\n\r\nPersona 5's plot revolves around the \"Phantom Thieves\" a group who is able to change the hearts of people and is led by Akira Kur- Ren Amamiya  voiced by Jun Fukuyama, the \"Joker\", but as they continue to gather more members, a bigger plot is brewing that leads Ren to being captured by the police and where the narrative structure of Ren retelling his adventures of changing people's hearts comes into play. Now the narrative structure is fine in some ways, a sorta in media res of Ren retelling his events to Sae Nijima, the detective questioning Ren all throughout the anime and the framing of how Ren got to where he is now is intriguing as well how he built up the Phantom Thieves and the members as well.\\n\\n\r\nPersona 5's characters are also immensely interesting to say the least, Ren has some personality to back him up though not the same as Yu from Persona 4 but nonetheless that and Persona 5 compared to Persona 4 have different levels of seriousness and playfulness in store. Due to Persona 5 going through many of the character arcs of the main cast (mainly the Phantom Thieves of course) we do get to see the Phantom Thieves develop through their issues or dilemma mostly through defeating the person or entity that troubles them in the \"villains palaces\" as a result. With that being said, LA was massively torn between two characters as LA's favorite character...either Makoto Nijima voiced by Rina Satou, the student council president and her views on \"justice\" tested during her arc (AND she's a badass) and Futaba Sakura voiced by Aoi Yuuki, a hikkimori who has a rather tragic backstory involving her mother and LA could relate to her in some sense due to this. LA's runner up was Ann Takamaki voiced by Nana Mizuki but nonetheless with the anime focusing alot on it's characters and their growth and arcs, made the main cast of the Phantom Thieves likable and memorable in a ways.\\n\\n\r\nPersona 5: The Animation's plot as LA aforementioned is was rushed and this was from a person who didn't play the games, each of the character arcs and \"palaces\" did have some decent screentime, but not alot of downtime much like Persona 4 and how they dealt with their dungeons, we at best get montages of the Phantom thieves traversing through the palaces, but in terms of battles, it's mostly one mob or monster then goes straight into the boss in question one or two episodes later. All LA means by \"no downtime\", is that the Phantom thieves doesn't have some breathing room in between palaces, though in some defence to this, Yuusuke Kitagawa voiced by Tomokazu Sugita and Makoto Nijima got \"some\" breathing room in between but still, it was rushed to say the least and this was even with a 26 episode timeframe!\\n\\n\r\nSo if the characters were done well and the plot's structure had some rushed pacing, what really crippled it?, yeah...the animation is a bit subpar alot of the time. The animation studio CloverWorks round the halfway point, you could easily tell the derpy faces as well as cutting corners ALOT and it just gradually keeps showing up in the later episodes, sure the animation had some sense of detail in it's palaces and it's character designs being visually striking but for the animation to dip and not fully recover by the end of it was disappointing to say the least. The animation was subpar and was probably the biggest detriment to the anime overall.\\n\\n\r\nWith that Persona 5: The Animation had a major problems but it's small little details that ruined Persona 5: The Animation from being in the same league as something like Persona 4 and LA loved that adaptation. Look, to most of the detractors of Persona 5: The Animation, you just can't cram a 120 hour game into a 26 episode runtime, there is BOUND to be some truncations, BUT for first timers who haven't played the game, it's actually a decent look into the game, with the story being structurally sound besides some pacing issues, characters who are memorable and develop them as the anime goes along BUT where Persona 5: The Animation falls flat is it's animation and that is just something LA can't ignore.\\n\\n\r\nPersona 5: The Animation you got some problems but your fine as an adaptation, being by the book in adapting the plot of the game well, but where the video game curse comes in is not having a convoluted stories and superfluous characters and the such but for what a simple thing as not having the drive in making the animation as great as could be as well as occasional rushed pacing, LA WANTED to love ya but by the end of watching it all, all LA felt was a dull thud in what could had been a great adaptation rivaling Persona 4: The Animation, yes LA was disappointed by this adaptation but not outright hate it as it had some strengths to it but nonetheless...\\n\\n\r\nPersona 5: The Animation your not misguided just mismanaged...",
            "date": "2018-09-29T12:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 290411,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=290411"
        },
        {
            "content": "{Spoilers}\r\nI had higher hopes. I played the game so I know the storyline already, but when I watched the anime it was boring and messy. If you want a better story, you should just watch the gameplay.\r\n{Story 8/10}\r\nI gave story 8/10 not because of the anime but because of the idea. Sadly the anime didn't portray it well and had many scenes were I just got bored and stopped. \r\n{Art 4/10}\r\nHorrible art, messy and bad, and in each episode there are probably 20 pictures were the characters look stupid and deformed. I hoped they would use the anime scenes from the game and use themfor the same events in the anime but they decided to redraw them instead and make it look 20x worse. (I know there are probably copyright issues)\\n\\n\r\n{Sound 8/10}\\n\r\nThe voice actors are fine, they sound similar enough to the game, and had e same amazing music that I love in persona.\\n\\n\r\n{Character 9/10}\\n\r\nI love the characters! Amazing Amazing Amazing characters, except for the art. I love futaba and Ann, and Main Protagonist, but It's not really related to the anime seeing that its just characters from the game.\\n\\n\r\n{Enjoyment 5/10}\\n\r\nLike I said before, there are many times I got bored and watched a different anime. There are scenes that just go on and on and they go through palaces way to quickly.\\n\\n\r\n{Overall 6/10}\\n\r\nThe anime had cute scenes but overall it sucked. Watch/play the game, don't watch the anime unless you want to make an AMV. :3",
            "date": "2018-12-17T23:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 296030,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7632590.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cyxnnn",
                "username": "Cyxnnn"
            },
            "url": "https://myanimelist.net/reviews.php?id=296030"
        },
        {
            "content": "Persona 5 is a good game but does the anime do it's part and show how good the game is? Yes and no. The first episode is one of the best episodes in the show with it's fast pace. The rest of the show should have followed the fast pacing of the first episode but had major pacing issues. Too slow for some parts and way to fast on others. The palace episodes are about one to one in a half episodes which are pretty good lengths. The outlier here is the very first palace which is in the first four episodes but this worksbecause the game had me in the first palace for about 10 hours. Enough about pacing, lets talk about the story.\\n\\n\r\nThe Story follows the story of the game pretty well. There are some anime original scenes which were a nice touch to the anime for someone who played the game before. The story follows the Phantom Thieves which are a group of people who \"steal the hearts of corrupt people\". They do this because they want the world to be a better place for everyone.  That's about it for the story other than the social links or \"confidants\". Confidants are people that help out the leader of the Phantom Thieves in any way they can like the doctor waifu, Tae Takemi. There kinda there in the show but there more on a back burner this time unlike the Persona 4 anime. \\n\\n\r\nThe art of Persona 5 is amazing! but the anime tries too hard to be like Persona 5. The all out attacks were bad at first but improved over time. The animation in the show was kinda lackluster but to be fair, CloverWorks did make the show and their literally A1 Pictures 2. I can't complain too much because this show did air every week without fail. \\n\\n\r\nThe sound is also amazing. The openings are great and the anime original songs are awesome. they actually fit the themes of Persona 5. \\n\\n\r\nThe characters are the same from the game so there's not much to be said about them. Ren is the main character and I wanted to see him as a character in this and not a self insert like the game but, this kinda fell flat and didn't happen like it did in Persona 4 the animation with Yu Narukami. \\n\\n\r\nEnjoyment varies person to person. I think this was very enjoyable because knowing what happens and how they adapted this almost gives me a thrill because this is a first for me. Playing the source materials first makes me feel like, \"hey, this scene could have went like this instead of that\". Other than that, the anime original things gave me a good feel.\\n\\n\r\nOverall I gave this a 8.6 out of 10 (9 for rounding). It was a fun watch and didn't mind all the \"mistakes\" with the show.\\n\\n\r\nThis is my first MAL review. Feel free to give me feedback if I plan to do another review.\\n\\n",
            "date": "2018-09-29T17:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 290431,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176115.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RiccyKid",
                "username": "RiccyKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=290431"
        },
        {
            "content": "just play persona 5 its a 10/10 game\r\n they somehow managed to ruin everything good about p5\r\nstory 4/10: the story fells rushed  wierd pacing and they somehow ruined the main storyline of the game cause off course a 100+ hours game wont fit in a 24 ep show so they cut alot of corners\r\ncharacter 4/10: well they decided to  cut almost all of the characters personality and development so they are all  deep like the dead sea \r\nsound 7/10: the game sound truck is good but used incorrectly in a way that makes the scene fell weird  and the new trucksare bad\\n\r\nArt: 3/10\\n\r\nAction scenes are where the series looks the worst. It constantly uses this laughable shortcut of zooming in and out on unanimated shots to reuse them at a different resolution in a later scene. There’s somehow less animation than the game, and what we see tends to be worse. Look no further than the ‘epic’ boss battle in episode 5, what should have been amazing was stilted by hideous CGI that looked even worse than what was used in the game. The action is so boring to watch too because there are next to no stakes, usually, the Phantom Thieves are fighting random mobs but even the boss goes down so quickly. \\n\\n\r\nThe fight choreography is even worse, the whole battle scene where Ryuji awakens his persona is the worst case of it. There is next to no fight choreography at all, hits don't even feel like hits, it's more like colors flying around with sound effects added over it. And somehow the all all-out-attack is so much worse than the game’s even though it was practically ripped straight from it.\\n\\n\r\nCharacter designs are the best part of the visuals because they’re lifted straight from the game, but they only look good when they’re totally motionless or on an animation loop (very often). When there's not much movement and/or character close-ups look really good but by that logic, you should just play the game.\\n\\n\r\nThere’s also plenty of ugly CGI random people walking in the background. In episode 2 Ren and his teacher are talking in a hallway, and there’s a giant CGI student trying desperately to walk without looking like a robot but its so obvious he was stuck on there last minute with zero quality control to fix him. He looks ridiculously unpolished and the perspective is all messed up, he goes past two girls standing near a door and he looks twice as large as them.\\n\r\nenjoyment 1/10: how can u enjoy one of seeing one of the best games in the last 8 years getting gutted\\n\r\nover all 3/10\\n",
            "date": "2018-07-30T18:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 285198,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/genjimainFhanzo",
                "username": "genjimainFhanzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=285198"
        },
        {
            "content": "\"I am thou... Thou art I ... From the sea of thy soul I come ... Call upon my name, and release thy rage! Show the strength of thy will to ascertain all on thine own, though thou be chained to Hell itself! I am the pillager of twilight, Arséne!\"\r\nSo I recently got into the Megami Tensei multiverse. I knew it existed for a couple years, heck I even played Persona 2 (Innocent Sin) for the original Playstation. Back then I really had no idea wtf half the demons and spells were, how to pronounce character names, or why Hitler was in the fucking game,but I remember it being one of my favorite games. However I wasn't able to play 3 due to stupid laws not letting me buy the game due to my age. Gee thanks a lot America. I got into the whole multiverse more recently with some YouTubers I watch streaming Persona 5. I loved watching them play, and recently I was able to convince my Mom to buy the game for me. But until then, I kinda had nothing to do. I wanted to play the game myself and it just so happened that an anime would be produced. My naïve mind was ecstatic. I thought it was good, until I got my own copy and relived watching videos, but in my own hands. Looking back now, this anime adaptation is a complete trainwreck.\\n\\n\r\nStory: The story here is a watered down version of the game. A lot of the nuance is taken out and some of the plotlines are straightout censored for TV. Apparently we can't say pedophile gym teacher is a pedophile, so we cut out half of his fucking character.  Well anyways here is the plot of the game. Your character is a student on probation due to an assault case from some asshole rapist, and he moves to coffe-dad's café , and he's a regular student by day, and a heart stealing phantom thief by night. No this is not a shitty porno despite how cheesy that last part sounds. Basically the protag makes accomplices and recruits other thieves, and a talking cat who screams at him to go to bed. The thieves steal the evil will from the hearts of the corrupt and reform society. That's what the anime basically portrays the plot as. A lot of the nuance from the game is gone. A lot of the dicking around that you and your friends go through in town during the day is gone. The school life is also gone. Its pretty much just an action story now.  For cutting out important elements and nuance it gets a 7/10, at least it tries to tell the game's story.\\n\\n\r\nArt: \"I would like your honest opinion if you would...\"-Kitagawa Yusuke\\n\r\nLets talk about the production a bit first. The game's animated cutscenes were produced by Production I.G. a high end studio, while the anime is A-1  Pictures. The A-1 version looks cheap and neutered compared to the beauty of the game's cutscenes. Yusuke does not approve. The CGI also looks like dog shit. Look up A-1 pictures animation and you'll get some pretty bad results. 5/10 Madarame did it.\\n\\n\r\nSound: The sound in the anime is actually pretty good. Most of the actors and actresses from the Japanese game have returned. Sadly some of the cast has recently passed away, so they will not be heard in the anime. A lot of the music is lifted straight from the game. You will start singing along to some catchy tunes such as \"Beneath the Mask\", \"Last Surprise\", and \"Life Will Change\". Its pretty good! 9/10 some songs are missing.\\n\\n\r\nThe characters are from the game, but slightly watered down. As an elitist I give this a 7/10 due to me loving the nuance in the game.\\n\\n\r\nThis anime gets a 6/10 as it tried to adapt the game well, but failed miserably due to time constraintants. Don't watch it unless you are gonna watch the Abridged Parody I am producing.\\n\\n\\n",
            "date": "2018-06-20T18:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 281701,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6698691.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LSSJ_Gaming",
                "username": "LSSJ_Gaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=281701"
        },
        {
            "content": "Persona 5 was one of the best games that I have ever played, and was a hit both in Japan and in the West upon its release, and continues to gather attention with spin offs and possible sequels based upon the loveable characters the game presents you with, along with the fantastic music crafted by Shoji Meguro (which luckily makes its way into this animated adaption).\r\nIt was a hard job to handle, cramming a 90-100 hour game into only 26 episodes, but as we have seen with Persona 4 the Animation (also handled by A1 Pictures), it can be done well. \r\nBut wherever the previousanimated series succeeded, this series failed. Miserably.\\n\\n\r\nThe pacing of the entire anime is laughable, with exposition being either crammed into a few short sentences or not even brought up at all until it is only just relevant. The fight scenes are animated very poorly, with the pace of the fights all over the place and the art itself mediocre at best.\\n\\n\r\nDue to the poor pacing, many story moments are rushed over, and some of the truly important moments for character development and plot are give to few time for us to sink in the information or even care about the story it is presenting.\\n\\n\r\nThis anime left a bad taste in my mouth, and when i reached the end of it's 26 episode run (along with two OVA episodes to complete the story in a rushed manner), i felt as though another trip through the PS4 title was needed to experience the story the way it was meant to be done.",
            "date": "2019-04-21T08:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 306822,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GrimmusReaperino",
                "username": "GrimmusReaperino"
            },
            "url": "https://myanimelist.net/reviews.php?id=306822"
        },
        {
            "content": "You cannot condense 95 hours worth of content and story into a 26 episode anime.\r\nThe anime adaptation of Persona 5 was so boring I couldn't finish it. \r\nThe show was trying to be like the game and because of that it was terrible.\r\n- The pacing was off because arcs that take in game hours to pan out happen in at most an hour in this show.\r\n- The few fight scenes were just boring to watch.\r\n- Characters had no development what-so-ever in the short amount of time that I watched this show.\r\nThe only good thing about this show is that Dark Sun was a good song.I didn't get that far in the anime to hear it \"live,\" but I did hear it on YouTube.\\n\\n\r\nIt's not like a Persona adaptation into an anime can be bad. The original Persona 4 The Animation was fantastic in my opinion because it wanted to focus on the humor and the general fun time that was at the core of Persona 4, yet it didn't try to be exactly like the game. With the P5A that can't be said, and it just falls flat.",
            "date": "2018-12-31T08:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 297585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7677562.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AntarcticRuler",
                "username": "AntarcticRuler"
            },
            "url": "https://myanimelist.net/reviews.php?id=297585"
        },
        {
            "content": "(Please note this review is from someone who played the RPG before so it might be a little bit biased)\r\nThis anime is good...\r\nWell, it should've been.\r\nBut no, they had to just to ruin a wonderful piece of work into an average adaptation\r\nLet me tell you why, all of the cons cover up all the pros!\r\nLet us start with the plot, if you compare it with 280+ hours of gameplay to this anime, the thing they did is actually good, but it still confuses anime-only viewers, such as why Joker get the other personas without even us seeing him getting that persona. The problem is thatthe anime doesn't get too much of a battle development, and the only scenes we see them battle is when they battle a boss or something! And hoo boy, they're even OVERPOWERED on those scenes, without us even seeing them train! \\n\r\nBut anyways, let's expand on the plot, to be honest, even IF they did skip the battle scenes, they handled the main story pretty good. My only complaint is that they shouldn't have forced confidant scenes and Akechi scenes into the anime, as it is unnecessary and it takes up minutes of precious main story time. \\n\r\nHowever, towards the end of the anime, they rushed through the story, causing the anime-only viewers get too confused, that is the result of including a long battle scene, therefore, they should've planned the anime first before announcing it as 26 episode, because 26 episodes can't handle all of that.\\n\\n\r\nNow let's discuss about the animation and sound, \\n\r\nThe animation? Hoo boy, we don't talk about that here, it was disgustingly horrible. You could obviously tell they didn't have a lot of budget for this anime. Lack of frames, unfinished sprites, name them all. But, the animation improves as the episodes goes by, although only a bit. But, trust me the animation was unbearable to look at in the first few episodes.\\n\r\nThe soundtrack in this anime was good, nice opening, nice ending, but in the first few episodes (AGAIN), they forced in background music from the game, making the atmosphere awkward.\\n\\n\r\nWhat can I say for this anime?\\n\r\n5/10, Hoo boy. This was like a test anime for cloverworks, it improved each episode, even by a bit.\\n\\n\r\ntl;dr improving things each episode, shitty first few episodes and a forced conclusion.\\n\\n\r\nThanks for reading and goodbye.",
            "date": "2018-09-30T02:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 290474,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5060027.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuOne",
                "username": "OtakuOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=290474"
        },
        {
            "content": "This adaptation is riddled with issues, ranging from fairly minor to really irksome, but my biggest problem with it is the direction.\r\nSeiji Kishi did P4: The Animation a hell of a lot of justice. It may not have had the biggest budget or the highest-quality art, but the slice-of-life episodes were hilarious, and there were several really memorable (and emotional) action scenes. One need only recall the remarkably well-handled summer episodes, which retold several social link arcs in a really entertaining and satisfying manner, to realize the core strengths of the show. The anime ended up capturing the tone of the game perfectly and, forwhat it's worth, the pacing was alright (the game itself is certainly not much better in that regard). \\n\\n\r\nI could go on - what about Yu Narukami, whose nonchalant and deadpan lines from the game carried over seamlessly into the show, and occasionally ended up being even funnier? He's a prime example of how to go about constructing the personality of an originally silent protagonist. Not to mention he even goes through a little arc of his own that wasn't present in the game.\\n\\n\r\nAnd here we have P5 the Animation, which starts out at a lightning-fast pace. Not too different from P4. I can certainly forgive that to an extent, as it's standard introductory episodes fare. But in this case the build-up to the Kamoshida conflict (and the aftermath) feels so rushed, that what is considered by many the most poignant act in the game turns out to be the first real low point of the show. The production values are at their worst around this point as well.\\n\\n\r\nThankfully, the show begins to pick up with Yusuke's arc. The pacing slows down a bit. Goro gets some significant screen time to himself and his encounters with the Phantom Thieves, which makes sense considering the conflict of ideals which the story has to establish before it can move forward. Makoto is no less likable either and her design looks great. The main characters' confidant arcs which have been included thus far get resolved within an episode or two, whereas the other confidants have been shown in a few scenes, occasionally aiding the Phantom Thieves (as is the case with Ohya), and I can only assume they are going to have their stories fleshed out sooner or later. Kawakami's encounter as a maid with Ren was actually funnier than the game and she's somehow even more adorable.\\n\\n\r\nOur protagonist Ren doesn't quite match up to his game self. While he retains the semblances of a lovable dork, he's missing those snide dialogue choices from the game, and actually doesn't speak that much relative to the other characters at all. I can't fault his representation here too much, as keeping the protagonist's blank-slate character was a reasonable decision, if a bit on the safe side. \\n\\n\r\nBefore I go any further, what do you think are the P3/4/5 games actually about? The typical response would be a cross between a dating sim and a dungeon crawler with demons. So why haven't the creators of this show sought to adapt both these aspects?\\n\\n\r\nSee, the Persona v demon battles are embarrassingly short and poorly animated. This is assuming there is an animated battle taking place on-screen, as they haven't even bothered doing most of them. To the average fan of the games, this feels unfortunately alienating. P5 is even lengthier than P4, yet it's possible the former will end up having fewer episodes than the latter, for which I find there's absolutely no excuse. Of course they'd rather fill the episodes with more story, but this begs the question of why the series was planned like that in the first place. Knowing P5 replaced shadows with classic SMT demons, each with its own quirky personality, it wouldn't hurt to see them in action a little more.\\n\\n\r\nThe game is also known and loved for how stylish it is. But the moment the anime tries to emulate some of that style, you know you're getting mixed results at best. There's no need to include the red-black transitions that tell us that a day has gone by or the characters are moving to a new place. And that all-out attack animation has yet to be neatly animated. The art in general is alright, although the show creates an atmosphere that's not nearly as evocative or moody like that of the game.\\n\\n\r\nI do hope the show ultimately gets the treatment it deserves. It's not a terribly boring watch by any means - just really disappointing to big-time fans.",
            "date": "2018-07-09T05:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 283508,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/for_soren",
                "username": "for_soren"
            },
            "url": "https://myanimelist.net/reviews.php?id=283508"
        },
        {
            "content": "I went into this anime expecting the worst as I had nightmares with the god-awful animation of the OVA but it was a pleasant surprise to see the animation was actually halfway decent (compared to the OVA) for what its worth. It's nothing groundbreaking but it works. The animation is a bit stiff to my liking but it must be because I'm coming straight off the heals of binging Violet Evergarden (I highly doubt it) but the aesthetics are right on point (I am in love with the look of the velvet room.). You won't get most of the character development as the story hasto be condensed to 12 hours or so. The metaverse is not as good as I wanted it to be but I'm content with this adaptation. It's still very enjoyable if you're able to overlook most of the bad CG and shortcuts the animators took to make this possible. Can't wait for the next episode\\n\r\nP.S. #AkiraForever",
            "date": "2018-05-13T05:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 280462,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jimmyedagawa78",
                "username": "jimmyedagawa78"
            },
            "url": "https://myanimelist.net/reviews.php?id=280462"
        },
        {
            "content": "I wonder if i am justifying the 8 rating i gave but please there be a season 2.\r\nThis review is coming from someone who has never played the game before or pretty much any game using the console. If i see this purely from an anime POV with no source material to fall back on, i would say its a fairly decent story with some average CG for action scenes The story is also well paced and it has some interesting premise. The ending was also unexpected. \r\nStory: If i compare P5A with P4A, the former has at least a semblance of a plot whilethe latter was fragmented too much to the point that i lost coherence of the plot with each episode towards the later half of the season. On the bright side, it was fun watching this slice of life anime as it explored dark themes coupled with an interesting supernatural backstory.\\n\\n\r\nArt: The character art has some justice done on them. But i cannot say the same for the animation. The CG for battle scenes alone were so out of place that even an amateur like me could see how the 3D effect was ruining the animation itself. I am not a fan of this style of graphics.\\n\\n\r\nCharacter: I want to like Ren not only for his character design but also for his personality but he spoke so less and he just had not translated his inside-the-palace charisma onto his real life image. Like P4A before, the main players of the 'phantom thieves' are too docile to accept the persona and become a part of the team. I saw no resistance or betrayal of sorts that develop the characters. Ann who is vehement not be objectified invariably gets a persona which is the very definition of sexism. \\n\\n\r\nAkechi: Sometimes i felt like i was watching a conversation between kira and L. Only that akechi's suspicion on Ren did not amount to a 3 percent chance he could be a phantom thief. I loved the ending though. While i did expect something along those lines, honestly i could not predict how the animators executed it though. So its obvious i am looking forward to a season 2.\\n\\n\r\nStory: Similar to P4A the story style is same with the main chara entering a different dimension or metaverse. There is no point in trying to figure out anime logic. they can change the feelings without that person actually knowing that is heart has been invaded through some inexplicable means. The more confusing part is how they interact with desires itself which somehow is able to recognize ppl and situations. The explanations were of little to no help.In short this anime has created a series of NPCs of the characters as well. The story plays a lot by the ear. Everything is safe or if it was the animators' s idea to make it viewer friendly at the same time brushing against darker themes like abuse and such.\\n\\n\r\nOverall: Loved the building up of suspense. i understand why this gets all the hate but for all the animus that ever stuck to the source material, this is no so bad. Without perceiving at P5A as an adaptation of a popular game i was easily kept entertained for the two days i spent binging on this. I dont mind recommending to those who have never played this game but want some near cool anime to watch for this season.\\n",
            "date": "2018-10-26T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 292635,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5500800.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/akirakishitani",
                "username": "akirakishitani"
            },
            "url": "https://myanimelist.net/reviews.php?id=292635"
        },
        {
            "content": "TL;DR: Works better as a companion to the game, anime original scenes or changes from the game are generally pretty good but the rest can be seen as average in terms of writing. Art is mediocre overall but gets better too late. Enjoyable if a Persona fan, just don't expect P4A 2.0\r\nPersona 5 the Animation has been the subject of ridicule with the quality of the art and animation along with the rushing of a 100+ hour game into 26 episodes plus an unspecified amount of OVAs later on, and from this you would think that CloverWorks has somehow managed to make the worst animeof the year. As someone who loved the game and somewhat enjoyed the anime, I disagree.\\n\\n\r\nLet me explain.\\n\\n\r\nStory\\n\\n\r\nThe same as the game that's being adapted, a few changes to some major events that, in my mind, fix some areas of the game that I found a bit off (such as the existence of the betrayal being revealed in the first 15 minutes of the game and the Okumura arc). The rest of it is around or below average, especially near the beginning with the Kamoshida arc being horribly rushed, with a silver lining in that the writing seemed to improve as the series continued.\\n\\n\r\nArt\\n\\n\r\nBelow average for the most part, with some standouts in the final few episodes. Poor animation (particularly All-Out Attacks and the use of CG outside of bosses) and art are everywhere in this adaptation, so the less said the better. The second set of visuals for both OPs and the final few episodes stand out as good art from this adaptation.\\n\\n\r\nSound\\n\\n\r\nThe game's soundtrack with sometimes weird timings and mixing along with a few anime original tracks, both instrumentals and ones with Lyn again providing vocals.\\n\\n\\n\r\nCharacter\\n\\n\r\nHere's where things get interesting. On one hand, Ren Amamiya is quite a boring character compared to the Joker of the game, particularly if you liked to pick the joke options, and is a huge let down to me after the P4 and P3 animes' portrayals of their protagonists (he has a few moments but despite them there's no redeeming his writing). The other characters, however, get expanded upon and have anime original moments that are actually good. Goro Akechi's friendship/rivalry with Ren sees heavy expansion to the point that they can be considered as having a connection instead of one line and a confidant rank up like in the game. The entire party seems to interact with each other more too, like the anime's addition of Ann and Makoto's friendship after the Kaneshiro arc.\\n\\n\r\nOverall\\n\\n\r\nIt's good I guess. I feel as if you'd have a much better time in watching this after completing the game as while the general quality of the series ranges from average to poor the new content, whether its original scenes or changes to the game's script, were generally the highlights of what could have been a massive dump on a great game",
            "date": "2018-10-11T06:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 291478,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7029028.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShadowStealer7",
                "username": "ShadowStealer7"
            },
            "url": "https://myanimelist.net/reviews.php?id=291478"
        }
    ],
    [
        {
            "content": "Incredible game for any who haven't played it. I'd give it a 9.5/10 at the bare minimum.\r\nThe anime adaptation? Not so much... (Though it did get my to buy the game and I am grateful for that)\r\nI did enjoy this anime for what it was worth, but compacting 100+ hours of gameplay and story into a 26 episode block is far from easy. Personally I noticed a lot of the story was skimmed or summarized. For someone who has played the game several times, I didn't really struggle to keep up, but people who have only seen the anime must be completely baffled sometimes asto what is happening on the screen. \\n\\n\r\nThe art and animation were no doubt amazing. Several of the Castles were especially well done...but only visually. They cut out so much of what made the castles so interesting, but I suppose I can understand due to time constraints. \\n\\n\r\nThe music was completely on point though, and I was very thankful for that. Persona 5's soundtrack is sheer brilliance at its finest, and I'm glad much of it was incorporated into the show as well. The intro/ending themes the anime introduced were also amazing, I loved watching them every week when a new episode dropped.\\n\\n\r\nI found a lot of the fight scenes in the anime rather boring compared to how I experienced them in-game. Once again, time restraints, I know. But fights ended in a matter of seconds and grazed over several of the in-game features that made Persona 5's fight system so incredibly fun. \\n\\n\r\nPersona (and the entire Shin Megami Tensai series) is known for having a huge variety of creatures, but I feel like I saw very few in the Anime adaptation. Plus, the anime barely touches on why the Protagonist's persona changes every so often. For anyone who has never played the game before, this had to be really confusing. \\n\\n\r\nFinally, character development suffered too due to time constraints. The game features very developed, multi-step interactions with many main and side characters that left you feeling like you were almost a part of the group. The anime touches on these, but has to summarize them far quicker. Seeing a character conflict/story introduced, discussed, and resolved within about 6 minutes doesn't do the character development justice. The patient and detailed stories featured in-game really tug more on the heartstrings, make you laugh, and allow you to invest into even the more minor characters. Anyone who has not played the full game is probably finding the anime's attempts to cover the side-stories as pointless filler, when it is completely the opposite. \\n\\n\r\nOverall, a red-hot masterpiece of a game turned into a lukewarm animated adaptation. However, I do still think it is worth a watch, especially for any fans of JRPG games or anyone interested in buying the Persona 5 game. For anyone who doesn't want to play the game and just wants to enjoy the anime, I'd recommend some supplemental wiki pages or youtube videos to fill in some of the gaps. The show will make a lot more sense that way.",
            "date": "2018-10-09T16:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 291353,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5937269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GetBlitzed",
                "username": "GetBlitzed"
            },
            "url": "https://myanimelist.net/reviews.php?id=291353"
        },
        {
            "content": "I normally don't write reviews of things mainly because I feel as though my thoughts are the same as others who write the reviews. However, Persona 5 is just so special to me that I have to share my thoughts.\r\nPersona 5 is a phenomenal game. It's probably one of the best I've ever played. It had everything anyone could ever ask for; an intriguing story, fun characters, amazing gameplay, and one of the best soundtracks to date. The anime, on the other hand, is probably one of the worst things I have ever had the displeasure of viewing. I don't mean this as a joke.I actually was in pain as I watched one of my favorite franchises get the A1 treatment.\\n\\n\r\nBefore I start this review, let me just say that I don't hate A1. They did a good enough job on the Persona 4 anime and an excellent job on the Persona 3 movies. I'm also a casual fan of SAO and Darling in the Franxx. Just judging from the last two, you can tell I have a pretty high tolerance of what an anime can show me. I had really high hopes for Persona 5 after seeing The Daybreakers and the teaser, but I was let down really bad.\\n\\n\r\nStory - 3:\\n\\n\r\nJust. No. A1 had this problem with Persona 4, and it's even worse here. Pacing. For some reason, A1 just can't properly pace these stories. I think that's in part due to their attempts to try and cram almost everything Persona 5 had to offer into this anime, even though the game is 100+ hours in length. Their goals are contradictory. They want to tell this epic and include everything, while also keeping everything within a 26 episode season so it fits into fall anime. This alone shows that they really just didn't have enough appreciation for the source material. I think the best analogy I have for this would be to imagine trying to fit a steak onto a really small plate. You can go the route of trimming off all the fat and cutting the steak in a very slow and appetizing way as to not lose the flavors or randomly mincing the meat and throwing it on the plate like its dog food. Persona 5 is the steak, and A1 is the chef who went the route of the latter. Rather than choose plot points that make sense to be together in the story, or even cut parts that are time wasters, A1 made the decision to randomly grab select events from the various confidants of the game and randomly insert them into the story. The result is some horrible flow and pacing that had me confused at lots of points, and I even played the game to completion.\\n\\n\r\nWhat I wanted from this story was one similar to that of Persona 3's. It took the story we all know and love, added some extra events and fun character bonding moments, and overall just expanded on it. It offered something to people who have even played Persona 3, and each of these new things was totally worth watching hours of movies for. They did something like this with The Daybreakers. They offered a story no one had seen before. It was a new experience and it gave us some insight into the world of Persona 5 as well as give us character. The anime does none of this. It just tells the same story again, while cutting out some vital points. Even if you came to see the anime because you couldn't play Persona 5 and you wanted to know the story, you are better off just googling a let's play or even reading a plot synopsis of the actual game. It would save you time and sanity. Not to mention they don't even finish the story in the anime, so you don't even get the full experience if that's what you're looking for.\\n\\n\r\nArt - 4:\\n\\n\r\nOh boy, this is the category that everyone likes to roast. In comparison to Persona 3, this is both a major downgrade and a major upgrade at certain points. I think the general rule with this anime is that if the camera is within a 2-meter radius of the characters, they turn out fine, otherwise they look like they just came out of MS Paint. Before you come out and say that it's hard to draw characters that are at a distance, consider two things; they have already done these kinds of long-distance shots for years and no one complained and there is no need to even put their characters in positions where the camera is far away. There isn't much to say on that point other what has already been shown by various people online.\\n\\n\r\nWhat else is worse is that there are just some points where the artists must have gone under some acid trip and forgotten just what the characters looked like. I explicitly remember an episode near the end where Ann has silver hair for most of the episode when she is in fact blonde. It could be attributed to lighting, but she was in both pure sunlight, half light, and pure darkness, so it's hard to name that as the cause. \\n\\n\r\nSound - 7:\\n\\n\r\nThis category is kind of short since most of the music and sounds come straight from the game. I only just wish it was more apparent since the game's soundtrack is absolutely amazing.\\n\\n\r\nCharacter - 1:\\n\\n\r\nIn terms of character, they absolutely failed. I honestly can't find one thing I liked about how the characters were presented in this anime, and that's something that's difficult for me to say since these characters are some of my personal favorites. Look at the Persona 3 or 4 anime. Each character in both of those had something called personality. Even when they're not the ones in the spotlight, it's easy to tell who is talking just from the dialogue alone. If you gave me a script of either one, I wouldn't have much trouble naming the characters speaking because of how well they're presented. Persona 5 takes a complete 180 on this. I couldn't even find that much good character in the segments in which one character had the spotlight. They all speak about the same thing for the entirety of the anime; their justice. I think every single character in this anime has said \"my justice\" at least once. It gets really annoying when the characters all feel like carbon copies of each other, except for their origins. As someone who has seen the characters and their personalities exemplified in the game, I really don't know how A1 managed to screw up just letting each character have their own conscience and point of view.\\n\\n\r\nDon't even get me started on Ren. Ren is the worst mainly because he is nothing. I mean this literally. He has no character. I think even the silent protagonist of the actual Persona 5 game has more personality than the Ren we're shown here. The main reason I loved both Persona 3 and 4's anime is because they threw a name on our protagonist and gave them personality. Makoto is molded into the person he is because of a tragic incident he witnessed as a child, and Yu is given a deep fear of losing the friends he loves. Those character traits even extend from the anime into various other Persona properties. Ren, on the other hand, is just passive. He never has his own thoughts or actions. It kind of just feels that if someone says he should do something it's an automatic yes just because of derp. Even the Joker version of Ren, who is supposed to be a polar opposite to the silent Ren Amamiya, lacks anything. Joker is literally the definition of charm and snarkiness, but in this anime, I can't find a single good and original line from Joker. Ren starts to get some character at the last episode when he talks about \"his justice\" once more, but by that point, it's already too late.\\n\\n\r\nEnjoyment - 3:\\n\\n\r\nI think my enjoyment of this is already clear, but if it isn't I'll say it again. I really felt in pain while watching this anime. At the beginning of the first episode, I was excited to see these character's I've admired come to the small screen. I felt if this was successful, Persona 5 would get more attention and become more popular than it already has and we'd maybe have these characters expanded upon even more. By the end of the first episode, I just remember utter disappointment. Nothing, and I mean nothing, met up to my expectations. It was just a rehash of what we already had but presented in a way that just made me ache. I think after the second episode, the only reason I stuck with this anime was just to see how badly they'd ruin Persona 5 and hope it would get better. Spoiler. It didn't get better.\\n\\n\r\nOverall - 3:\\n\\n\r\nThis is the epitome of milking a franchise. Somehow, in their first attempt to make a spin-off of a fantastic franchise, they ruined it with terrible direction, art worse than that of MS painters, a story that could be made by a toddler holding a crayon, and character development that's just a horizontal line starting at 0. I personally don't know who at A1 greenlit this, but I feel they should have gone back to the drawing board after the first episode and rethought the entire strategy. 26 episodes, 13 hours of animation, and not one good half hour to be seen. If you want my thoughts on how to fix it, here's what I would do.\\n\\n\r\nDon't end on a cliffhanger. This is Persona 5. Not Avengers Infinity War. You don't get to do that.\\n\\n\r\nFix the pacing. Don't tell me it's hard to cram all of this story into 13 hours. You did Persona 3 in 4 movies, AKA less screen time, and it was exactly what I was looking for with the story even though it was a similar length to Persona 5.\\n\\n\r\nTake your time with the art. Don't give me that All-Out Attack ever again. Make your own style and make us believe in it.\\n\\n\r\nActually, give your characters some character. Every single phantom thief here had there own and complex reasons for becoming a Phantom Thief. Don't sum them up to \"I\"m fighting for my own justice.\" That's boring.\\n\\n\r\nFor the love of god, make your Protagonist likable. He's the MAIN character, not the side character for everyone else to use as a stepping stool for the spotlight. You did it right 2 times, so why mess up now?\\n\\n\r\nFinally, actually have some respect for the source material. Persona 5 is a franchise loved by millions across the world. People took its themes about how to view the world, it's story, and its characters to heart. Give them something they can look at and feel happy to watch.\\n\\n\r\nP.S. Sorry if this sounds like a rant. It's not my intention.",
            "date": "2018-10-07T11:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 291165,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7453832.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rogue_Dynamite",
                "username": "Rogue_Dynamite"
            },
            "url": "https://myanimelist.net/reviews.php?id=291165"
        },
        {
            "content": "This is an updated review from ~episode 16\r\nNo, I didn't play the game, but I have watched a playthrough of the source material before. While I know what will happen in the main story I don't remember a lot of the finer details of the source material. \r\nStory: \r\nThe main story is kind of simple as of episode 12, 3 palaces in. World building is finally complete, and the real plot is set in motion in episode 15. If there's a thing the anime does much better than the game itself it would be the confidant stories. The team does go out of their wayto make them really funny.\\n\\n\r\nOn its whole, it does what the anime is intended to do: to try to sell the game for newcomers and to add on to the game for those who already know the story. Though, even non-blind, the story up to the end makes me not entirely sure whether to laugh, cry or get mad. Thankfully there's an OVA later this year.\\n\\n\r\nDon't trust the ending lol, over here it already lists 26 episodes.\\n\\n\r\nArt: A few mistakes here and there. A few questionable decisions with regards to the battle sequences. Action starts looking much better on episode 4 and then into palace 2. Definitely picks up so don't drop it after episode 3. \\n\\n\r\nThe art quality may not always be consistent but the artists definitely got better drawing Ren towards the end.\\n\\n\r\nSound: \\n\r\nuses the game soundtrack and the dancing spinoff soundtrack to great effect. I really enjoyed the use of Blooming Villain and the Life will Change remix. Whims of Fate got its time too.\\n\\n\r\nCharacter: \\n\r\nI liked how Ren is portrayed. It felt very canon and logical. He definitely has sass and in general Ryuji and Mishima get the most of it. His progression is slow, but doesn't feel out of place. \\n\r\nRyuji is more likable in the anime than the source material. \\n\r\nMorgana is cute. \\n\r\nFutaba's plight is kind of sad; I would not recommend watching that particular episode (16) at 12am, they did a good job on Wakaba. \\n\r\nMakoto and Sae's relationship has also been well highlighted. \\n\r\nAkechi's definitely the best improvement of them all. He's not just the random encounter like the game anymore.\\n\\n\r\nEnjoyment: \\n\r\nwell, if I were to rewatch this I would definitely skip 3 All Out Attacks. I still like what they have. It has its cute, funny and cool moments. It definitely gets better and better. At first I thought episode 1 was the best, then that changed to episode 4, and then that changed again and again. They did so well on the last arc I almost wish they could go back and redo some of the beginning episodes.\\n\\n\r\nOverall, would recommend to friends. One, because I love the story, two, because I want to see those reactions on the finale. Generally if you are still interested after the 4th episode and make it past the 6th, you will probably continue watching it to the end. \\n\r\nI must say though, by the end of the anime and if you're watching it blind, you'll definitely be wanting the conclusion to the story so bad you might decide to spoil yourself. Don't do that. Either wait for the Dark Sun OVA or get/watch the game. From what I've seen so far, I have faith that the animators will do a better job than the game.",
            "date": "2018-10-01T07:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 290611,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/keizee107",
                "username": "keizee107"
            },
            "url": "https://myanimelist.net/reviews.php?id=290611"
        },
        {
            "content": "What happens when you take one of the best JRPGs to date and try and make a 26 episode anime out of it? You get a rushed and highly watered down disappointment.\r\nIf you've never played Persona 5 for the PS3/PS4, you might find yourself intrigued, and then totally lost in the first few minutes of the first episode. With only 20-something minutes in each episode to tell the same story that a 100+ hour game did, the plot-points and scene transitions are thrown at you so fast you'll probably get whiplash. The ever-lurking and ultimately important plot points that involve the Velvet Room (where theprotagonist learns more about the supernatural aspects of his predicaments) usually receive less than a minute total screen time, if it appears at all in any given episode. There's no time to grow attached to most of the characters, including the (now-\"fully\"-voiced) protagonist, because there's so many. Apparently the writers/director decided you have to touch on all of them in some way or another as a nod to fans, even though there'd be more time to understand the main plot if the time related to side characters was spent on making sure the main story/characters are decently written. Sure, there are some moments where you get more info about the characters that weren't present in the game (hello, swimsuit Ka- erm, sorry), but again, that time would have been better spent extending the parts of the story that actually matter. The anime currently ends on a cliffhanger, of sorts. If this were the game, it'd be considered either a bad ending (because you couldn't read between the lines and pick the right choices) or you know it's a cliffhanger (because surely, I didn't just go through this game to get this bull?!) One can only hope the upcoming OVA/second season (god-forbid) paces itself a bit better than what's been given so far.\\n\\n\r\nI couldn't name another A-1 Studios anime if I wanted to, but by god, if the quality of the art in Persona 5 the Animation is any indication of their usual standards, then I never want to see another A-1 anime in my life. The best animation/art in this show can be found in the opening and ending credits, which, while sometimes uninspired or even unrelated to the story, seems to have been where the majority of the art/animation budget has gone. The fight scenes are laughably, depressingly boring, almost as if each one (aside from the boss fights) was completely forgotten about until the studios were ready to greenlight that week's episode to air. The stylish All-Out attacks from the game are poorly replicated in terms of both animation and excitement, being used as a cheap cop-out for actually putting some action in the fights. As with many modern anime, there are plenty of stills/shots where characters barely resemble themselves, and you'd be laughed at for watching this stuff if you pause at the wrong moment.\\n\\n\r\nPerhaps the only saving grace for P5A is the music. And only then is it because most of the music is straight up taken from the game soundtrack. Shoji Meguro and the rest of the ATLUS sound team did a fantastic job with it, and it's nice to hear it brought back in the anime. Lyn Inaizumi and Benjamin Franklin also return for each ending and opening song, and while they may not be as hype as their tracks from the game, they're definitely not hard on the ears.\\n\\n\r\nOverall, Persona 5 the Animation just kinda sucks. Though it's based upon an award winning video game, the similarities are only superficial. There's a lot missing, in terms of story, character development, pacing, art, and animation. As someone who's played the game and watched several others play it as well, I'm not wholly ungrateful for it's existence, but I sincerely hope no one pays to own this anime. I would have preferred another side-story be expanded upon via OVA, like Persona 5 The Day Breakers did, instead of watching A-1 Studios cobble this mess together and call it a television show. I would have preferred to just play the game for a second time on the hardest difficulty. I would have preferred every episode show off a certain teacher in lingerie, or even just being a teacher. But unfortunately, we got none of those things, and instead, were given a lackluster adaptation that relies on the success of it's source material.",
            "date": "2018-10-01T02:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 290592,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3038251.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ceeneon",
                "username": "Ceeneon"
            },
            "url": "https://myanimelist.net/reviews.php?id=290592"
        },
        {
            "content": "I love Persona franchise so much as I have both of my main waifu and my main husbando in this franchise. And now I really don't know where should I point my disappointment to. Yes. In short, I am very much disappointed by how Persona 5 : The Animation turns out. Rushy execution, very bad animation, destroyed a story that is already awesome, and made itself a huge disappointment for the fan that is already there. The only thing that holding this anime is the great soundtrack. That's it! That's the only thing that made me stay and giving this anime a chance.\r\nMaybe the worstdisgrace is how they giving us a very beautiful promotional art in the very beginning only to continue with horrible and downright bad animation. The animation feels empty and lazy with so many in between frames are missing from its place. In the very end of this anime, I feel betrayed by the promises they gave us before they released the anime. Well, I know A-1 Pictures have a history of bad action sequences and very minimal animation which usually they will fix them in their Blu-Ray or DVD releases but I think that is not an excuse to make a good potential wasted.\\n\\n\r\nAbout the story, I felt sad since the game of Persona 5 itself already has a very great story but at the end of the day they executed the story with an unsteady yet rushed pace. It really broke the story as whole because many key points and character relationship were threw away. And worse, they decided to cut-off the anime like it was nothing and just told us that there would be a continuation. WHAT? I know that the studio really wants to milk this franchise but I think it was not the wisest decision as it left the audience screaming that this anime is unfinished and downright bad.\\n\\n\r\nThe only thing that makes this anime outstanding is of course, their soundtrack. Still retaining the beautifully composed music from the game, they kept the soundtrack and added with other equally beautiful soundtracks. I always love the work of Shoji Meguro and that endings are worth to note.\\n\\n\r\nOverall, I was almost this close to drop this anime but my generosity keeps me from dropping this one. Episode after episode, I was putting hope that they will fix this hell of a mess. But no. To the very end they did not fix it. So, I think it is better for you to watch the playthrough of the game instead of watching this anime if you are curious about Persona 5.",
            "date": "2018-09-30T17:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 290551,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5318995.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Its-Maki-kun",
                "username": "Its-Maki-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=290551"
        },
        {
            "content": "I know that when video games get an anime adaption, usually sucks since the video game's plot has more in depth of the story than what the anime shows or that they changed a bit so that the viewers can understand it better. \r\nBut back to this review, Persona games turned into an anime series are usually good and funny. The first Persona anime which was Persona 4 Golden and I love it so freaking much. I even played the game after I watched it. Same goes to Persona 3 and other ones. I know that it MIGHT BE A LITTLE BIT BIASED SINCE IPLAYED THE GAME BEFORE BUUUUT I was a bit disappointed about the anime. Sure that I played it before and I loved it so fucking much. One of the best games ever!! Honestly, I just wished that they can do it a little bit better and have a bit of the same humour, just like on the game. The soundtrack and the art are awesome! But I still prefer the art style from the videogame. \\n\\n\r\nThe characters from the anime makes them like they are bad and have no personality whatsoever. Like... there are no work on to it whatsoever. Like they just made an anime of it because it was getting popular. It feels rushed and there was no time or effort on to it. I know that they make it a summary of the video game but at least, do it better.",
            "date": "2018-09-30T06:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 290486,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6122436.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yoruhau",
                "username": "Yoruhau"
            },
            "url": "https://myanimelist.net/reviews.php?id=290486"
        },
        {
            "content": "Just play the game. The reason:\r\n1. Not using true ending (but the ending still different from game)\r\nI think they didn't choose true ending because of limitation of airing this anime. I mean, Persona 5 have a long story and a little bit complexity. It can't be made to anime with 26 episode? Still need more episode fore true ending.\r\n2. Animation is suck (compared to the game)\r\nIf you like action, well I can say they try. But animation compared to the game, I prefer from the game, you can say it.\r\n3. You can get more feeling from game (trust me)\r\nBut if you prefer watch the anime,it's fine. Still can follow the story till the end. But don't be upset with ending.",
            "date": "2018-09-29T22:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 290456,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6469131.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NFL1945",
                "username": "NFL1945"
            },
            "url": "https://myanimelist.net/reviews.php?id=290456"
        },
        {
            "content": "Story\r\nI know what occurs from the game and it is literally the exact same layout from start to the episode I finally dropped on. The story is interesting, but it definitely falls of midway. The ending is exiting, but I can't muscle through watching a story I know because the game executes it much better as the gameplay is why it works so well.\r\nArt\r\nI love persona's unique art. By no means is it extremely stunning, but the show sticks to its roots of the video game and keep it simple. Because I believe persona as a game had stunning visuals I'll let the art slidein the show even though I would have wanted a revamped improvement in some shape or form.\\n\\n\r\nSound\\n\r\nPersona has always had a great soundtrack, but it just doesn't feel as it works in a show. The fight scenes don't feel as intense as they do in the game because in the show you know they won't lose as it's a show. While at least in the game you could lose this fight at any moment somehow. Without the threat of losing the music doesn't have as much impact.\\n\\n\r\nCharacter\\n\r\nCharacter are just briefly skimmed in the show from what I have seen. If they go deeper into the characters in the show I will be surprised. Character development in the game takes time as there is many layers to each of them that you slowly learn through hours of hanging out with them. I just don't see how the show can show all aspects of the character in such a short time span.\\n\\n\r\nEnjoyment\\n\r\nNot enjoyable at all to watch. The fights were literally action shot within the game. I was expecting to see actual  abilities, but I guess that was too much to ask for.\\n\\n\r\nOverall\\n\r\nDon't watch the show if you have the opportunity to play the game. The game is significantly better as the story flows better, since we have the sense of time passing through the game. Not only that the sound will seem 10x better as well as characters through enjoying time with the ones you want to learn about.",
            "date": "2018-08-15T02:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 286527,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BabyChiem",
                "username": "BabyChiem"
            },
            "url": "https://myanimelist.net/reviews.php?id=286527"
        },
        {
            "content": "Writing a long review for this show is pointless, we all knew it was gonna be another excuse for milking the franchise until the eventual Persona 6. \r\nPlot - 3/10\r\nSame plot as the game but more rushed, while the game it's fun by it's own the plot was always flawed, having posser characters and teenagers outmarsting light novel villains is not a good point. The traitor twist is even more evident because the show decided to put Akechi in almost every episode doing worthless things, Adachi never suffered from this (although he was a weak character too).\r\nArt 3/10\r\nMany characters change sizes, do stupid faces inserious situations and the animation as whole is slow and boring. \\n\r\nCharacters - 3/10\\n\r\nSame as the game again, your allies just exist to suck your dick after you solve their problems. In the game the only good one was an old politician that never requests your help, he was skipped here so whatever. The villains are evil rapists that torture innocent people just because, one dimensional trash, the last one that comes out of nowhere is more of a concept than a character, it's based on the world of the game and that world has no meaning so... you know.\\n\r\nSound - 5/10\\n\r\nRe-uses many tracks from the game, it's lazy as hell but at least the original OST was good. The first OP and ED were decent too.\\n\r\nEnjoyment 6/10\\n\r\nThis part of the review is also pointless but that's how MAL works. I watched this with friends and we laugh at how awful the show was. So yeah, I enjoyed it.\\n\r\nOverall, don't waste your time on this garbage and if you wanna know the plot just play the game, It has writing problems too but it's damn fun.",
            "date": "2019-04-16T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 306489,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4908007.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SebastianM20",
                "username": "SebastianM20"
            },
            "url": "https://myanimelist.net/reviews.php?id=306489"
        },
        {
            "content": "If you have only seen the Anime, then you are definitely missing out in what was, originally, an excellent narrative in the original game. In order to properly adapt the massive game that is Persona 5, they would need a minimum of 50 episodes, as this series skipped over quite a bit of content. A longer run, along with taking an approach that mixed slice of life with the stylistic action of the main story of the game would probably have made this a more faithful experience, as my main issue is the fact that you dont really see the charm Persona 5 holdoutside of the main Palaces and the Metaverse. \\n\\n\r\nIf you played the game, you may enjoy seeing the characters and specific scenes animated and elaborated on, though this Anime can't hold a candle to the masterpiece that is the game.",
            "date": "2019-02-15T12:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 301721,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4366517.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AkinaChaan",
                "username": "AkinaChaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=301721"
        },
        {
            "content": "I start this review by saying that I love the original Persona 5. It's one of the greatest games I have ever played and one of the best of the decade.\r\nThe animation does some great parts in the slice of life segments of Ren Amamiya. Some of these scenes are well done and very funny. But the scenes on palaces and the fights...oh God...\r\nThe fights are incredibly underwhelming and the animation in the palaces are terrible. It's such a shame that some of the best moments in the game (like the boss fights) were short or full of badly drawn characters. Even the All-Out Attackssuffered with missing frames.\\n\\n\r\nIt's such a shame that a great game had a cash-grab adaptation with no heart in it. I would only recommend this if you don't have any possibility to play the original or if you're having a deadly curiosity about it.",
            "date": "2019-01-31T11:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 300519,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6295385.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MTaguchi",
                "username": "MTaguchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=300519"
        },
        {
            "content": "For those who haven't played the PS3/4 game, the story is about the MC (Ren Amamiya) who was expelled for allegedly assaulting a man of high status and ends up having to move school as part of his one year probation period. One day, a strange app appears on his phone and he discovers he has the power to summon \"Personas\", spirits that dwell within people. He could enter the twisted hearts of others known as \"Palaces\" and steal the treasure from their Shadow that represent their inner dark desires that will give them a change of heart. As he does so, he soon meetsothers that possess the same power and forms the \"Phantom Thieves\", convinced they can make the corrupt world of adults a better place by hitting out at criminals that are out-of-reach from the law.\\n\\n\r\nIt's basically Atlus taking a stab at bringing about awareness of the problems in modern day society in Japan. The OVA \"The Day Breakers\" which acted as a prelude to the game didn't really impress me. Art was off compared to the game's cutscenes but fortunately the TV series gets off to a good start. Since the OVA, A-1 Pictures has branched out, rebranding one of their studios as CloverWorks in an effort to create a better brand and the art quality for this show is kind of better than the OVA efforts. Characters still look off sometimes like the quality suddenly drops and it's obvious the artists still aren't very good at using and blending 3D animation into their shows as you can see a lot of models walking around rigidly. As with the game Ann remains your main fan service character although they added some new scenes in while excluding some from the game so, you more or less have the same amount of fan service. Kawakami fans should be pleased. There's still your obligatory beach episode (or two) of course and the camera can be asset keen at times. Backgrounds on the other hand are a mixed bag because some such as Leblanc looks great but others such as the common shop you can see there was less effort.\\n\\n\r\nThe show stays faithful to the game with a few changes (particularly Futaba's story) and extra scenes added which I'm sure will make fans of the game grin - not just for Persona 5 fans but also for people who have played the other titles in the franchise. Some help clarify the story more too such as how the app records what they're saying before reaching the first Palace so it's good in this regard. There are brief side camera shots of the other characters so it feels less of the JRPG it was where you only focused on one character. That said, the show's not afraid to go back to its roots because there's so many scenes that will remind you of what made the game fun - negotiations with Shadows, transition scenes, mystery gear drops, confidants etc. They even put in the All Out Attack finishing screens but I don't quite get why they start out horrifically plain before they decided to use the game screens later on. Maybe Atlus stepped in. They also chose to skip most of the dungeon crawling but pick up the key parts that will probably make players who finished the game think, \"Oh! I remember that part!\" Boss battles are also play out the way they did in the game.\\n\\n\r\nThere are two OP theme songs like most series that end in the mid-20s but the first OP for the show actually has two animations, one for first two episodes and then one for episodes 4+ before it changes again at episode 14. The first OP animation actually uses an animated version of the artbook's cover too just like when they first teased the Anime. Third OP animation looks better quality than the others and the fourth one during the last episode is probably visually the best in terms of design. There's also a slightly different ED animation in episode 17. Episode previews are also stylish, done in a similar style to the game.\\n\\n\r\nMost of the music is the same as the game too which is great because the game already had a really good OST. Hearing familiar tunes like \"Beneath The Mask\", \"Layered Cake\" or \"Tokyo Daylight\" playing is awesome. Voices are the same as the game. The show is so faithful to the game you have to wonder how many lines were from the game or if they actually re-recorded the show. As a bit of trivia, Ren's voice happens to be Jun Fukuyama who also plays Lelouch from Code Geass and Satsu-sensei from Assasination Classroom while Morgana is played by Ikue Ootani who also plays Chopper in One Piece. And of course, we have Mizuki Nana as Ann, best known as the first voice actress to top the weekly Japanese Oricon JPOP charts.\\n\\n\r\nOn it's own, I don't think Anime fans will enjoy it that much because it does show its roots from a video game where you're just jumping from boss to boss or, you might just enjoy it for the character driven stories as they overcome their troubles. For fans who enjoyed the game and want to re-live the experience through a different format it's worth a watch. Unfortunately, it does go the same route as the Persona 4 Anime where they don't air the true ending... Other than that, as a show for Persona 5 fans it's really well done despite the inconsistent art quality. It's fun watching the gang get together again and there's plenty of material in it that'll remind you of the game. Don't miss the extra scenes after the ending.",
            "date": "2019-01-19T04:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 299436,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7426800.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xcomprr",
                "username": "xcomprr"
            },
            "url": "https://myanimelist.net/reviews.php?id=299436"
        },
        {
            "content": "Aside from the Game,\r\nThe Characters lacked a lot of backstory, there were characters missing out, and overall, it was average. I'm a big fan of Persona series but, comparing this to Persona 4, I'd choose the latter. this fight scenes and drama scenes weren't as good. Although the character depiction of Ren was pretty good, The Social Status, Abilities and the Calendar scene wasn't implemented as it was on the other Persona series. I just hope that they release an OVA to chain up the last episode.\r\nIt's not bad. it's just... lackluster. The Beginning episodes took too long. and then rushed somewhere in the middle.to sum it up. its worth watching if you're a big fan of persona series.\\n\\n\r\n6.5/10",
            "date": "2018-10-07T00:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 291107,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yisza",
                "username": "Yisza"
            },
            "url": "https://myanimelist.net/reviews.php?id=291107"
        },
        {
            "content": "I preface this review with the source material is always by far superior. This is definitely true of P5tA. If you have played Persona 5 (or like me, played it twice within 2 months of its release), this show is a satisfactory reminder of the fantastic experience of playing the game. The music is all either true to the game or new but suitable. That in itself is a pleasant surprise - I found myself getting goosebumps when certain familiar songs started to play.\r\nMuch of the story is also pretty surprisingly true to the source. However, as with all past and present Persona animations, theart itself and the character development simply cannot live up to the source. As it stood, the art in the animated cutscenes in Persona 5 lacked soul - that is also true of this anime. It is also impossible to expect the anime to be able to relay the development of each character that you experience with each social link in the game in this type of medium.\\n\\n\r\nThis show serves an adequate function as a post-gameplay portrayal of the story of Persona 5. If you have not played the game, don't do yourself the disservice of watching this show. As a stand-alone, it does not hold up as anything more than mediocre. Watching this anime, you won't feel compelled to play this absolutely amazing game. But you should. You should play it, and then come back and allow this show to just help you reminisce on the amazing sights, sounds, and characters produced by one of the (if not THE) best Persona games in the series.",
            "date": "2018-09-30T19:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 290568,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/417197.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Brii90",
                "username": "Brii90"
            },
            "url": "https://myanimelist.net/reviews.php?id=290568"
        },
        {
            "content": "Oh Persona 5... How much I love you.\r\nUnfortunately, its anime adaptation... I wish you were never made.\r\nGenuinely, I find it hard to enjoy Persona 5 the Animation as a series. The combination of abysmal pacing alongside mediocre art, and many more things, just make P5A really hard to truly like.\r\nStory: 5/10\r\nPersona 5's actual story is great. Mostly good pacing, and the topics it focuses on are fitting to the game. However, Persona 5 the Animation's treatment of it all, hurts it overall. The pacing is one of the main factors of this. When you turn a 100+ hour game into 26 episodes and 2 OVAsis undoubtedly going to make a mess. Everything feels absolutely rushed, and I honestly don't know what I expect from A-1 Pictures anymore. The story is good, but the pacing and how it plays out in the end ruins what would be an actually good story.\\n\\n\r\nArt: 4/10\\n\r\nLike the story, Persona 5's art is fantastic, colorful, stylistic. But in P5A, a lot of that quality is just... gone. There are far too many instances that the art is plain messed up, and just unpleasing to look at. Of course, there are some, (emphasis on some) scenes that the art looks good. Unfortunately, not everyone gets the same treatment with the good and pleasing to look at art, with most of it being awarded to Ren Amamiya. As much as I love him, it's just very odd seeing only a few characters even get quality art. In general, the art is laughable most of the time, with honestly hilarious screenshots coming at every turn.\\n\r\nAdditionally, the animation is just mediocre at best. There's barely any fluid movement outside of fights, (and even those are pretty bad) and everything just gets incredibly boring after awhile, with a lot of the time, the only movement is in the mouth. Amazing.\\n\\n\r\nSound: 7/10\\n\r\nLet's be real here. The only reason P5A is getting this high a score for this category is because it's using the music directly from P5. Don't know what else to say here, to be honest. Outside of that? It's fine. Nothing to really nitpick about.\\n\\n\r\nCharacter: 4/10\\n\r\nEveryone just feels like a shadow of what they really are. In the game, you get character development, going through everyone's confidants throughout the game, and it feels like you get to actually know the characters. But of course, in P5A style, A-1 just had to ruin it. Yet again! With only a few characters getting if any development throughout the anime. For god's sake, I can't even remember if some characters even appeared or not because they were not explored, at ALL. Of course the development was hindered because of the series only having 26 episodes to explore a lengthy story, but is it really that hard making at least minor mentions of any sort of development? I'm not even going to lie. Everyone is so bland in this anime, and sometimes, I can't even tell if the character even has a personality. \\n\\n\r\nOverall: 4/10\\n\r\nPersona 5 the Animation is a rushed and poor quality adaptation of a game that just cannot meet most people's expectations. The adaptation is about the exact opposite of it's original source. I cannot stress this enough. If you're thinking about watching this show, please don't. Please god just buy Persona 5 and play it. It's about 10x better than this. I don't know what I ever expected from A-1, thinking that maybe this wouldn't be so bad. And it's not the worst thing I've ever seen, but it's pretty low.\\n\\n\r\nPSA: Buy and play Persona 5 for yourself. Please. Or at least watch someone else play it. Save yourself from this dump.",
            "date": "2019-03-24T01:46:00+00:00",
            "helpful_count": 0,
            "mal_id": 304145,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5596842.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Fenbi",
                "username": "Fenbi"
            },
            "url": "https://myanimelist.net/reviews.php?id=304145"
        },
        {
            "content": "Persona 5 is a frame-by-frame take on the game it's based on. Very little has been cut, and very little has been added. I appreciate that approach when most video game adaptations are garbage with little relation to the source material, but going in this completely faithful direction has its own problems. \r\nPersona 5, if you're quick about it, is a 70 hour game. The anime is less than 10 hours long. Even cutting out the time you spend in the game doing straight up gameplay and systems management that an adaptation wouldn't show, you can't shove that amount of plot into a 20-something episodeanime season and expect it to be paced reasonably. You end up with a show that never seems to have enough time, where they rush through every plot point from the original slavishly. They even spend time covering specific gameplay mechanics like baton passing same as in the game, which is fun, but doesn't make a lot of sense in the context of the anime. \\n\\n\r\nPace aside, the show isn't very pretty. There's the occasional cool-looking effect, or fight scene, largely it's unimpressive stuff. Because the anime sticks so closely to the game, it's in the rough position of having to be compared to a game that the devs spent years tarting up to the point where it's the most stylish JRPG ever, and the anime doesn't stand a chance in that fight. When it imitates aspects like the all-out attacks, it just looks pathetic, you can really tell you're getting the amateur version of the beautiful special moves the devs made. There really is no reason to watch this anime.\\n\\n\r\nIf you'd like a version of Persona 5 the Animation that's better in every way, that's the Persona 4 anime adaptation. It stuck close to the original game too, but the additions it made were very welcome(their take on the silent protagonist Yu is god tier and hilarious, much better than what Ren gets in Persona 5). P4 also had a shorter story that was more focused on the party members and their inner demons, giving that anime way less pacing issues and a lot more heart. \\n\\n\r\nIf what you want is a better version of the story in this anime? Just play the game. It's better in every way.",
            "date": "2018-10-21T04:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 292206,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5211638.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Latygg",
                "username": "Latygg"
            },
            "url": "https://myanimelist.net/reviews.php?id=292206"
        }
    ]
]