[
    [
        {
            "content": "*SPOILER WARNING*\r\nC3 centers around a boy named Haruaki Yachi who one day recieves a black cube from his father. His father sends him cursed intruments to try and make him break the it because he is resistant to curses. However the black cube is actually a girl named \"Fear\" and she is a type of intrument, a \"Fear in Cube\". She suddenly starts living with him, much to the dismay of Haruaki's childhood friend Konoha. \r\nHowever as the story progresses on, it develops into something much darker. Turns out that there are other people who wants the \" Fear in Cube\", and they come afterFear. Fear's dark past is revealed to the others, and by this time if you still think Fear is just a cute ordinary girl, then you are wrong. As her past is revealed, she starts to lose control of herself just by seeing blood, turning a cute girl into something more of a monster. That fight was one of the scariest ones ever, with Fear having a twisted expresssion of a smile on her face while killing. Also when Fear started to question her own existence, that was probably one of the most moving scenes in this anime which actually made me feel really sad.\\n\\n\r\nChildhood friend Konoha is also not your ordinary childhood friend. Her real form is of something much more badass. Haruaki is also not useless, as he is shown that he has a badass side where he can fight against other people who want to destroy Fear. As for the class prez Kirika, I have to say that she is not normal too, as she is connected to a mysterious organization whose objective involves cursed tools.\\n\\n\r\nArt is of BakaTest, and I'm really pleased with the character designs. But what I really love about this show is the wonderful OP song and animation. OP is probably one of the best of seiyuus, sung by Tamura Yukari. Along with it are beautiful animations with cherry blossoms flying everywhere. OP2 is also very nice, sung by Kitamura Eri, as the story focuses more on Kirika.\\n\\n\r\nI have to say I'm very impressed with Tamura Yukari's voice. Finally we had a cute loli not voiced by Rie, and Yukarin does not fail my expectations. She can do a cute high pitched voice while also doing a lower, scarier voice for the transformed Fear. Kaji Yuuki is also a great seiyuu with a nice gentle voice which I think is perfect for Haruaki. Along with Chihara Minori as Konoha and Kitamura Eri as Kirika, it definitely sounds like a harmony to me :)\\n\\n\r\nOverall, C3 was a nice anime to watch and enjoyable. If there is a 2nd season I would definitely watch it!\\n\\n\r\nFeedback is greatly appreciated, thanks! :)",
            "date": "2011-10-10T01:54:00+00:00",
            "helpful_count": 213,
            "mal_id": 45221,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/476326.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Meldoy",
                "username": "Meldoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=45221"
        },
        {
            "content": "Why didn’t I drop this?\r\n[Contains vague spoilers, then again, it's so predictable a caveman could do it, also contains some offensive language]\r\nC³ is best described as an atrocity then again, that might be considered a generous title. This would be the “ideal troll” series to give somebody to watch. It’s not very good in storyline, and the characters are the aggravating type of cliché. It follows the generic harem law of everybody falling in love with the average dude, and it offers incessant and redundant fan service. The series basically follows this extremely unique and innovative storyline:\r\nBoy meets unique and strange girl, strange girl issuffering from a curse, boy wants to help girl, girl denies boy’s kindness and runs away after accidentally hurting boy, boy finds girl and basically accepts girl, then girl learns the meaning of friendship. Innovative and original right? Normally, the storyline wouldn’t be aggravating on its own but it’s just portrayed and executed in such an obnoxious way.\\n\\n\r\nThe majority of the episodes are generally composed of 60% school/fan service, then 30% actual plot, with the 10% being the OP and ED. The series basically started off as excessive moe fan service followed by an episode or two of melodrama. Then it led into some action, which was surprisingly pretty cool. Then it fell into the inevitable plight of more melodrama, love triangles; then from episode eight onwards, it’s visited by sporadic random tentacles[perhaps, slightly exaggerated].\\n\\n\r\nSurprisingly, the actual plot does actually exist, albeit rushed and poorly told. The small plot is littered with mediocre storytelling and incessant fan service. C³ basically tries to develop a seemingly serious plot, but the plot is about as creative and unpredictable as Bleach’s. The plot basically revolves around trying to alleviate the girl’s curse, but it does it in such a bad way. Numerous questions are raised with each episode, and they are answered, but are done so in such a mediocre way. C3 is titled a harem, ecchi comedy with action elements; if it actually stayed with those genres, rather than attempt an asinine, darker one [which it fails to do], then this review wouldn't exist [It would be like being irritated at the fan service in a series labeled as an ecchi romance; I don't like C3 because it tries to incorporate more genres than it can handle.] \\n\\n\r\nTo be fair, most series raise questions, but they answer them. Now how do they answer them? Well, most of them would answer them through subtle hints, actions, and perhaps even some dialogue. How does C³ do it? Well, they do it through dialogue. Not intelligent dialogue, but in blatant “Why did this happen”s and “What was that”s. Now imagine the end of a mystery anime, where everything is resolved, there’s been a few subtle, yet significant clues, and the main detective puts it all together, in blatant monologue. Now, if C³ was a mystery anime, that wouldn’t be so bad, but it does this without any clues. They literally just commune a meeting and go, “What was that?” and well, that’s how the majority of the questions were answered, in Q and A format, intelligent right?\\n\\n\r\nNow C³ isn’t an entirely bad series. It does have a few redeeming “good” points. The art and animation is simple, yet in some scenes it’s done really well. Both openings look great[it's simple, but they actually do look good], and the ending theme fits. The action scenes are also pretty cool, the history behind the torture weapons, and the actual fighting isn’t bad. It’s entertaining when it comes to that, but besides that, it doesn’t have much going for it. Basically, imagine Bleach with more melodrama, and much more boobs, tentacles, and panty shots.\\n\\n\r\nObjective Score: 3/10. It’s the irritating type of below average, it’s not good, and it’s not enjoyable. This show was actually one of the few that I fell behind on due to the incessant bullshit I put through while watching it.\\n\\n\r\nSubjective Score: 3/10: It’s still shit. If you’re into tentacles, panty shots, incessant fan service, and boobs, you’ll probably like this. If you want a decent storyline, or even decent characters, you probably wouldn’t like this. The show is mostly fan service, and the plot itself is mostly ridiculous and only used to further develop the fan service",
            "date": "2011-12-19T10:46:00+00:00",
            "helpful_count": 183,
            "mal_id": 49569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=49569"
        },
        {
            "content": "This review for C3 will be based on opinions made after viewing the first episode of the series, and will also give a brief overview of the first episode to enlighten those who may have an interest in this deep, suteki (tl note, Suteki = great omg nihongo xD) anime. \r\nThis kakkoi, perverted boy (tl note: kakkoi means cool) receives a gift from his otou-sama, which turns out to be a cube, which then turns out to be a naked, silver haired, kleptomaniac loli(and I must praise this for its originality on this part, we never have had girls randomly appear and suddenly live withthe MC before). A very cute one, I might add. She’s perfect in all proportions. A beautiful, budding chest. Eyes that glimmer with innocence, hips that are clearly not ready for bearing a child. And a bum that just screams at you. The show is focused entirely on her and all her cuteness, so these are important notes to keep in mind when you decide to watch the first episode. Her name is Fear. She also has some ability that curses her owner, but pervert-kun has an immunity to curses so it’s all kakkoi and stuff. You know, I was honestly staring at DFC-tan’s face the entire time so wakarimasenlol. They also introduced some yandere-looking childhood friend with cow udders, but because of that I will be neglecting her in this review. \\n\\n\r\nAfter the introduction of our silver-haired Goddess, pervert-kun, and other girl, the show quickly gets straight to the point of the story, the everyday actions of our lovely Fear. Pervert-kun leaves her home alone so he can go to “school”, like the cold hearted sod he is, so Fear decides to take her beautiful DFC self out into the town, where she quickly learns how nice everyone in Japan is. Somehow, she had actual outdoor apparel for this venture, despite her nor pervert-kun not actually going out to get any clothes, which can lead us to believe that pervert-kun is a closet crossdresser, or has some perverted hobby. Whatever the case, he seems like a cool guy for so quickly deciding to live with a DFC goddess like this and already having clothes for her(sasuga, pervert-kun). \\n\\n\r\nFear feels a lot better about being abandoned for the day by pervert-kun and decides to repay his kindness (you know, giving her a free place, some clothes he already had for some reason, going to school instead of spending time with her ;~;) and put her housekeeping skills to the test! And as we would expect from a beautiful, flat chested girl like this (I just wanted to stroke her chest with my face, kiyaa~), she did a splendid job! So much that pervert-kun came home and gave her a sugoi speech. ^-^\\n\\n\r\nIf you enjoy series that have as much of an original plot as this one does, and series with characters as subarashii(wonderful ^^) as our closet crossdresser pervert-kun and our delectable DFC honey, fear, then C³ is definitely an anime worth your time to check out!",
            "date": "2011-10-01T22:32:00+00:00",
            "helpful_count": 63,
            "mal_id": 44589,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341852.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sartaj",
                "username": "Sartaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=44589"
        },
        {
            "content": "Rule 34.....\r\nGenerally accepted fearsome internet rule that states that pornography or sexually related material exists for any conceivable subject.\r\nAt first I was like....\r\n\"Oh yeah, I bet that rule can't be applied to a freakin CUBE!\"\r\n........And thus C3 is born.......\r\nNormally I don't review animes on first episodes but I have to give my first impressions on this one as a clarify with those who wants to pick up this series. Will update as the anime progresses.\r\nHere we go! Another school battle royale! But this time with tools and objects transforming in gorgeous girls. Yachi Haruaki is a normal high school boy with a travelling parent whomsends him backs souvenirs in the form of girls (oh god I wish my parents did that) but here's a twist. They're all cursed tools! So nne day, Haruaki receives a black cube from his old man. During the night, he encounters a NAKED (yea because that's how we normally encounter girls for the first time right guys?) silver haired girl stealing rice crackers. She is the human-form of the black cube, an instrument of torture called \"Fear in Cube\". So thus began their newfound companionship in a battle royale against other cursed instruments in the form of girls. Sound familiar?\\n\\n\r\nThe art and animation! Blindingly colourful and obviously similar to series such as Baka To Test? That's because the same director Oonuma Shin is in charge of both series. He was also the episode director of Bakemonogatari which is why C3 seem to have a bit of the \"SHAFT\" aspect to aspect approach.\\n\r\nCharacter designs are pretty  average but the high luminosity design managed to grab my somewhat short attention span. I have nothing much to add about sound. Seiyuus portrayal of their characters are just average as well. However I do enjoy the BGM. It manage to expresses the torn conflict between peace and chaos in the anime.\\n\\n\r\nI will update character review as soon as the plot advances. For now we have our typical hero, Yachi Haruaki, whom is somewhat special ability of not being able to be cursed. What  prove do I have?\\n\r\n\"Hey Yachi! You're a mother f*****!\"\\n\r\nSee? I can't curse him. Yeah I know that was lame. But you've read it anyways.\\n\r\nJoining him is Kubrick Fear a typical tsundere whom now have to cope with life as an average girl.\\n\r\nNot much of an innovation to the whole anime scene but this is expected since the themes are comedy and ecchi. I can't complain if authors are to afraid to venture out and try new character development techniques. The easy way out to show character developments is of course employing the \"dere\" character cards.\\n\r\nAnd last but not least a childhood friend with no redeeming qualities whatsoever (yet) except accelerated specific regional  body growth.\\n\\n\r\nI can't really say I enjoyed watching the first episode. But I don't hate it as well. It is somewhat confusing. Is it trying to be funny? Is it trying to be dramatic? Philosophical? Moe-blob?\\n\r\nDefinitely trying to be a Moe-blob anime. So if you enjoy those and you''ve got spare time why not pick up this anime and be the judge for yourself? Or you could think outside of the box and apply rule 34 to other everyday objects. \\n\\n\r\nHaremu Kingu,\\n\r\nSigning off\\n\\n\\n",
            "date": "2011-10-03T07:40:00+00:00",
            "helpful_count": 51,
            "mal_id": 44755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=44755"
        },
        {
            "content": "First impression based on ep' one - The intention of this review is to highlight elements of the story you may like or disslike, depending on your preferances and possibly, the time period you have neen watching anime in general...\r\nThis series features a set-up which is quite familar:\r\n- tsundere galore\r\n- characters are school age\r\n- fight scenes that consist of neon coloured magic\r\n- cutsie, somewhat bratty loli who need looking after\r\n- overly passive male tsundere-victum type who accepts his lousy life\r\n- family issues - in this case, family conveniently out of the picture\r\n- unnessessary female sidekick who doesn't seem to have anything else to do\r\n- supernaturalbeing who's human appearance is a cute girl for no particular reason\\n\r\n- humor in the form of ecchi related missunderstandings\\n\r\n- unluck guy; the female('/s) are there to bring about a change\\n\r\nI know that some of these factors above can easily attract or repel, as the familiar is great for some (who I could reccomend to) yet tedious for others (I wouldn't reccomend to) and if this is pretty much a starter anime for someone else, then go for it. ;D\\n",
            "date": "2011-10-02T09:02:00+00:00",
            "helpful_count": 44,
            "mal_id": 44633,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=44633"
        },
        {
            "content": "After having watched the first 3 episodes of C^3, I must say this show really has potential.  After a light, almost excessively cheerful introduction, the show gets progressively more action packed, emotionally involved and takes a more serious tone revolving around sin, guilt and regrets.\r\nI found the art to be appealing, as is the case with most anime this season, I found the cast of voice actors to be strong, the main male lead in particular, and I found the pacing and development to be varied so as to accentuate the important parts.\r\nIf you try to pin this show down with episode 1, thenyou're not going to give an accurate opinion on what it is.  It is a varied show with an interested plot mechanic and good production values, that is worth giving an hour of your time to to view the first three episodes.  Happy viewing!",
            "date": "2011-10-17T03:38:00+00:00",
            "helpful_count": 34,
            "mal_id": 45689,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32084.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lyim",
                "username": "lyim"
            },
            "url": "https://myanimelist.net/reviews.php?id=45689"
        },
        {
            "content": "C³\r\nC cube was really rushed in the story, is like if they knew they were not going to make a 2nd season, and they wanted to throw a lot of content in just 12 episodes.\r\nStory\r\nThe story at first is really great, but it goes down every episode, because it's not consistent, it's like there are three different stories on just 12 episodes, the first story was great, was dark and violent and the action was the best in that story, the 2nd one was fine but it wasn't what i expected, like, it slowed down the things and less violent and less dark and thethird one was ok, violent like the fisrt one and kind of dark but not shown like the first one, the ending was like if they are going to continue with a 2nd season because of the end, so if you put all of that together the overall is good.\\n\\n\r\nArt & Animation\\n\r\nIt really was very good, at first looked normal but then as the episode continues it has a dark tone and dark feel on the atmosphere, i liked the characters design.\\n\\n\r\nSound\\n\r\nThe sound was very good, the VA and the music was good and the different OP and ED were just great, i really liked them a lot.\\n\\n\r\nCharacter\\n\r\nThe dark past of Fear wasn't expected for me, i really didn't expected that and started to think if i was going to like her or not, but you will find out for yourself, Haruaki was normal but powerful with the help of his childhood friend Konoha, who happens to have her own abilities to help Haruaki, Kirika was great and i felt for what she was going,Kuroe was really adorable and funny and i felt sorry for the loli Amanda, overall was very good.\\n\\n\r\nEnjoyment\\n\r\nWhat i enjoyed the most were the first and last episodes, the middle ones were ok but not like the others level, the ending was unsatisfying but overall i had a very good enjoyment.",
            "date": "2015-08-07T13:43:00+00:00",
            "helpful_count": 32,
            "mal_id": 195442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195442"
        },
        {
            "content": "Story- I think that the plot of the story wasn't very contestant. It added things and just dropped it off. I think that the story is like three different arcs (in away). I like the first two, but the last one was not very interesting and very confusing. I think there was stuff they forgot to wrap up or did do it properly. I will not say what it was because I don't want to give spoilers\r\nArt- The art is where this show shined the most. It was very colorful and lively. When it came to a time of a flash back or memories, thestyle look like a puppet show. When it came to fights and intense scenes, the back round color would be greens or red. When humor was in play, there would be bright colors and funny doodles. \\n\\n\r\nSound- the voice acting was very enjoyable. Every characters' voice fit their attitude and personalty. A few voices i didn't like. there is no dub so I can't judge it. The opening really reflected the show. The first one was upbeat and lively, but a a quick dark moment to reflect the sadness and anger in the show. the second one was darker and more down toned.\\n\\n\r\nCharacter- The character were very nice and enjoyable. Some that only stayed for a few episodes I like because most of them weren't one dimensional.\\n\\n\r\nEnjoyment- I like this show for the virus reasons I have list above. I just didn't enjoy the amount of fan service it had.",
            "date": "2015-02-23T12:31:00+00:00",
            "helpful_count": 16,
            "mal_id": 181060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=181060"
        },
        {
            "content": "I'm writing this because episode one does not reflect the pure awesomeness that is episode two. It almost feels like they made that first episode the way it is because they wanted to make what follows somewhat shocking and completely unexpected. \r\nAnd job well done. I was not expecting that at all. I'll let you all discover what it is on your own, i wont say anything more.\r\nEpisode one was just fan service. A naked Fear, and a multitude of panty-shots and comedic silliness that doesn't really do what follows justice at all. Thats why i think it was there to give a false indicationof what to expect. \\n\\n\r\nThis is really shaping up to be an interesting series. The artwork is great, one redeeming factor of the first episode, blasting purples and blues and all sorts of radiance in every shot. The girls are cute but for that first episodes are just empty shells of what they turn out to be. Loli-jealousy of the girl with the big boobs and things. You get the idea. \\n\\n\r\nEither way, i did enjoy the first episode, don't get me wrong. But the second episode is brilliant in comparison. It starts off the same way as the first but it escalates into something much bigger, very quickly. Give it a watch.",
            "date": "2011-10-17T01:43:00+00:00",
            "helpful_count": 14,
            "mal_id": 45685,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503309.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rydia69",
                "username": "Rydia69"
            },
            "url": "https://myanimelist.net/reviews.php?id=45685"
        },
        {
            "content": "I am going to be completely unbiased - this is an outstanding anime so far with an original plot. ** It is unfair to judge this anime based on the character's hairstyle, and give it a low rating just because it has some ecchi scenes. I certainly will not be doing that. **\r\nFor starters, the character names. They fit really well with the characters themselves. First up - Kubrick Fear. As stated in the synopsis, she is basically a torture machine in the form of a girl; Fear. Her actual form, and primary weapon would be the 'cube'. Kubrick being 'Cube' and 'Brick'.. get it?Get it?! :D\\n\\n\r\n'Yachi Haruaki', the main male protagonist in the story. \"Yachi\" in Japanese means fortune, or good luck. I'd have to concur, as Haruaki claims that curses do NOT affect him whatsoever.\\n\\n\r\nThe plot is fantastic and original. Materializing 'torture' machines to do away with your opponents. And the way they are summoned and the incantation (in my opinion) is way cool! It is not your typical 'Swordfight' anime or 'Trigger-happy' anime. It gives a medieval feel, because torture machines were created way back when they were necessary for interrogations.\\n\\n\r\nI always thought Muramasa Konoha (I never noticed her surname, 'Muramasa' until now) was only going to be the typical USELESS (emphasis on useless) 'big-breasted' friend who would always try to steal the main character away from the female protagonist (references to Yoshida from 'Shakugan no Shana', and Siesta from 'Zero no Tsukaima'). I was horribly mistaken... SHE CAN TRANSFORM INTO A FREAKING SWORD! I should have seen that coming, though; her last name is 'Muramasa'.\\n\\n\r\nThe Opening song is pleasant to the ears. It kind of reminds me of something out of CLANNAD, or Touhou. I found Fear's dance really cute and charming.\\n\\n\r\nI said I was going to be unbiased, but that was a lie. I have a fetish for tsunderes (although, you know who you tsundere-fans are!), and Fear is an ADORABLE one. Her actions, her expressions, her love for food. Wow. 10/10\\n\\n\r\nOn top of the vocal/musical masterpieces, we have visual artwork. I really like how the eyes were done in this Anime, and also I like how Fear's hair shines rainbow. It's very appealing to the eyes, in my humble opinion.\\n\\n\r\nCharacter development is a big one. Unlike other animes, where they pour all this information on you (most of the information being irrelevant or useless), Cube x Cursed x Curious slowly thickens the plot, and distributes background information on each character at a nice pace. Right now, we know very crucial details about Fear, Haruaki, and Konoha that help us digest the story a lot easier.\\n\\n\r\nOverall, I give this anime 10/10!",
            "date": "2011-10-18T00:28:00+00:00",
            "helpful_count": 14,
            "mal_id": 45759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/645539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/astro-kun",
                "username": "astro-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=45759"
        },
        {
            "content": "Starting off as a comedy and, then, getting total serious and violent, this was surely an unique experience... We can see Fear as a clumsy girl on the entire first episode, destroying everything on Haruaki's house. However, things get more interesting as her true nature is shown right on the next episode: a killing machine...\r\nGattering all pain and suffer caused by the Inquisiton and turning that into a human with feelings and the sole desire to forget her past, Fear is \"delivered\" to Haruaki as a cube, sent by his weird father. Maybe he already knew Haruaki would be able to help her out, ashe was born with some kind of \"curse resistance\" and also lives on a sanctuary, a symbol of mind peace and tranquility...\\n\\n\r\nStill, would Fear be able lock her bloodthirsty alter ego and turn herself into a good person? First step is forgetting about killing people... Tough matter, as others try to pursue her... So, she has to count on her new friends to help with that and with her overall \"rehabilitation\" as well...\\n\\n\r\nVisually gorgeous, CxCxC uses every possible animation trick to improve enjoyment. Short, special cutscenes, everyone of them with an unique style, are simply amazing! Overall design may look basic, but reminds of classic visual novels, those where characters had even bigger eyes, that attract me so much... It also features two different OP/ED themes, despite being 12 episodes long... I had never seen a short anime where that happened...\u2029Moreover, we get the chance to see some of the most famous torture tools ever used by humankind, redesigned... Fantastic!\\n\\n\r\nThere are few characters, but more are introduced on last episode's ending, giving strong hopes for a new season in the future. Just like a VN, characters don't differ to much from each other on appearance matters, they all have the same base design... Still, they have their own personalities, some really awkward...\\n\\n\r\nFear is a kind of metaphor, cleverly created to show us that even the most despicable being, responsible for many people's suffering and death, is able to get complete forgiveness after paying for his sins and, by helping others and showing appreciation for those who helped him. We all make mistakes, some of them may seem unforgivable... We are imperfect, but anyone can change... That's the main lesson taken from CxCxC...",
            "date": "2013-10-22T05:18:00+00:00",
            "helpful_count": 14,
            "mal_id": 117865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=117865"
        },
        {
            "content": "This is simply my opinion so you may disagree with it, but i do hope you enjoy reading this :3\r\nBrief review: For those who don't wish to spend too much time reading other peoples thoughts.\r\nStory 4/10: Nothing ground breaking. I don't really care much if it has been done before... but the story just doesn't flow too nicely.\r\nArt 8/10: The art was good. I liked the art. A number of scenes are used a few times too many. The effects where nice but i feel that if they added a bit more variation to the \"OOO SHINY!! OOO SPARKLY!!\" thing going on every time someonegrabs a weapon, things may have turned out better.\\n\\n\r\nSound 6/10: The seiyuu did a lovely job with the characters voices. Although many sound effects sound slightly out of place and the OP & ED's don't seem to fit well with the anime, i think the sound was just fine.\\n\\n\r\nCharacters 6/10: Cliche? Not a problem. Uninteresting, predictable and unnecessary... kind of a problem.\\n\\n\r\nEnjoyment 6/10: I had fun for the majority of the episodes... the last few ones felt really rushed and made less and less sense with each passing minute. Needs a season two to clear things up and fix the story.\\n\\n\r\nOverall 6/10: Give this anime a go if you've got time to spend on a mediocre anime. It's nothing to awesome, but if you find yourself incapable of thinking then this anime might be the one for you.\\n\\n\r\nNot so brief review: Just the above with lots more words really. May contain some spoilers if you haven't watched episode 1 :3\\n\\n\r\nLets start with LE GENRE TAGS!!!\\n\r\nFirst up we have action, CHECK!\\n\r\nThen we have comedy, Check... nothing that will genuinely make you laugh, but you might crack a smile here and there.\\n\r\nNext up is Ecchi, check.\\n\r\nSCHOOL!!! Check!\\n\r\nShounen, a big fat check! \\n\\n\r\nLooks like thats covered. Some might want to add \"romance\" but i urge them to rethink that decision. \\n\\n\r\nSO! C3, aka CubexCursedxCurios, is an anime that stars Konata Izumi-errr- Fear Kubrick who is an ancient...box... Yes, a BOX. She is an ancient tool of slaughtery and murdery (those are, from today onwards, official words) who was sent to this boy-who-happens-to-be-very-good-and-cant-be-affected-by-curses-cause-hes-good-or-something by his dad. His dad is an explorer/adventurer type thing that sends him cursed items (like the BOX) so they may rid themselves of their curse. This is the story.\\n\r\nThats kinda boring eh? Well, no worries. Stuff happens. \\n\r\nHow does stuff happen you might ask... well... random people show up and cause random problems and then they get their ass handed to them. WHOA! How... interesting... Well... no. The problem with random people showing up is that the story doesn't progress on it's own anymore. Our main characters apparently cant provide the necessary drive to move on with the MAIN PURPOSE of whatever it is they are trying to do (removing curses from cursed objects like a BOX).\\n\r\nRandom people appear and force the story to move forward. Is that a problem? Not if it was necessary... Is it necessary? No... \\n\r\nI won't go on and on about this... The story has some very good potential that is wasted because it rushes a lot. For a 12 episode anime, rushing never solves anything.\\n\\n\r\nOk... lets leave the story for at that... ON TO LE CHARACTERS!\\n\\n\r\nLets start with the star of the show, Konata izu--- FEAR KUBRICK. Fear, or Fear-in-cube (said in english, not japanese. Pronounced Fe-a - een - Quu-beh) is a device, or box, of pain and suffering. She is good at killing stuff. \\n\r\n\"Hey stooorm!!! why do you keep referring to a box as she!?\" Well my dear imaginary reader, that is because this BOX has developed a human form... with emotions et al. Yes, she is practically a human.\\n\r\n So she is sent to this boy, yuuchi haruki, whom we will talk about later. Anywayz, so fear is a cursed object. She is sent to this boy so that she may live as a normal human and lift the curse. Her favorite phrase happens to be \"I'll curse you!\" Interesting character yea? Seriously, its actually interesting for 1 episode... how much does her character develop? not much... not much at all... BUT!!! shes the only one who really develops. \\n\\n\\n\r\nOk, now we have our good guy. Yuuchi haruki is a kid who cant get cursed. Whoooo. He's our sweety pie. Our needle in a haystack. How does he develop? Not in any particular way. His dad sends him cursed objects (i'd love it if my dad sent me any kind of objects, cursed or otherwise...) and yuuchi helps them lift their curse. Thats it. We find out why he indulges in his dads antics early in the anime and its nothing special, btw no info on the dad. \\n\\n\r\nNext we have Muramasa Konata. She is... well... take a look at her name, you'll know what she is. Oh, she is labelled as Ms. Cow tits by Fear... cause you know... her udder is easily accessible-ERR, her boobs are big. She is kind and likes yuuchi... Oh, she also has a slightly darker side that she shows to Fear... but theres a silly reason for that. Her character doesn't develop either. Really... thats it... the highlight of this MAIN CHARACTER is her tits. That is all... i guess big boobs do get you all the good jobs...\\n\\n\r\nSO, last character is the sadomasochist... she also likes a certain someone and helps him out. Shes starts off all secret agent like but then sorta gets closer and keeps less secrets. Does her character develop? Only if revealing secrets count. \\n\\n\r\nWe still have a few, just a few, more characters involved... but they are introduced fairy late in the anime for us to give a shit about.\\n\r\n They seem to want to play a big part in the story, but they just come in so late that we simply cant appreciate their company. This includes the baddies who appear and disappear randomly. Them baddies don't seem to serve any particular reason other than to agitate the story. Sigh... all in all, the characters aren't something you'd remember and think \"ah, arent they special\" in a good way.\\n\\n\r\nOk ok... ART TIME!!! \\n\r\nLE ART IS LE GOOD! Seriously, the art is nice. Movements are fluid, a nice number of backgrounds and a few scenes are very detailed and really add to the feel of the anime. Characters are nicely drawn, abit too moe moe, but still very nicely drawn. Weapons looks kinda funky, and it is that funkyness that prevents me from giving this a perfect score. They could have done much much better and added some nice variations... but meh, oh well. an 8/10 is still very very good in my book!\\n\\n\r\nSOUND TIME!!! \\n\r\nNot Le great... just good. Characters have a nice matching seiyuu that really helps bring them to life. I gave it a low score because i really didn't feel that the OP's & ED's matched the anime and the sound effects were really bland.  Nothing fantastic, but atleast its decent enough to not make me want to stick a pencil in my left ear. \\n\\n\r\nEnjoyment! Better off watching porn. \\n\r\nI managed to somehow enjoy this anime till it got near the last 3 eps. It felt like it was going to become a hopeless rat race to the finish... and it did. It really stopped me from appreciating all the work and effort, or lack thereof, put into the anime. \\n\\n\r\nFinal Score 6/10: I'd suggest you go watch this when your brain needs a break from all the thinking. If the anime just sort of said \"here deal with what is happening\" i would really not be able to even recommend it (that would be cruel) but since it actually shows us what is happening, it doesn't fail miserably. It could have been much better with a few more episodes... and i really dislike the horrible ending because they are just teasing us with more plot holes... they seem to want to make a 2nd season pretty badly... oh well... a semi-decent watch nonetheless.\\n\\n\r\nI hope you found my review helpful or at the very least enjoyable!\\n",
            "date": "2011-12-18T16:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 49515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/531955.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stormydays",
                "username": "Stormydays"
            },
            "url": "https://myanimelist.net/reviews.php?id=49515"
        },
        {
            "content": "Curses, curses, curses--there are certainly a large number of anime having centered their plots around some sort of curse, whether it be part of a major story arc or even the axis of which the story turns. So, what makes C3 (otherwise known as \"CubexCursedxCurious\") different from all the rest? Well, putting this as frankly as I can, C3 tries to make everything about its story center around the idea, methodology, and practice of curses, but instead, its brain-scattering plot, absolutely tragic pacing, and tired, stereotypical characters make what could have been an interesting plot into something degrading and lousy.\r\nStarting-off with the opening song, allI can say is that its appropriate enough, but very standard. It's a studio-done song, so, as one can imagine, Yukari Tamura, the voice of the main character of this show, is singing with musical accompaniment. However, while the opening song itself is fine, I can't say the same for the visuals; frankly, they're completely pointless, add nothing to the overall plot, and leave the audience in the dark as to what they're in for. I can only guess as to why Silver Link decided to do this: because they wanted to go for shock value. What sort of \"shock value\"?\\n\\n\r\nHere's the long answer:\\n\\n\r\nFear Kubrick is a cubic entity that has been used for generations as a tool for torture and killing; she is essentially the active hive for torture devices and cursed objects. Understandably, after seeing so much pain for as long as she's existed, Fear wishes to simply live among the humans--not as a killing machine, but as a kind, gentle person who gives back to others with respect. Haruaki Yachi is one such person who can help Fear to reach her goal, as she is quite literally delivered at his doorstep (initially, in her cubic form); he holds a gift that allows himself to be unafflicted by curses. However, Fear's journey to enlightenment will not come without its fair share of trials and consequences, as not only are there deadly organizations that wish to utilize her power, but there is also the berserk nature inside herself that is always pushing to come out.\\n\\n\r\nBut, for anyone who doesn't care for any of that, here's the short answer:\\n\\n\r\nFanservice, fanservice, fanservice--oh, and there's some fighting, too! The fighting's pretty neat--oh, and there's some blabbing about curses and pretentious bull, but that's not important. Ooo, look! There's lots of blood and gore and yandere-type crazy faces mixed-in as well! I know certain Higurashi fans out there that will love this!\\n\\n\r\nAs for the cast, there's Fear, the sorta-kinda-tsundere cube girl, Konoha, the glasses chick with huge knockers, and Haruaki, the chillin' dude with a heart of gold; there's also Kirika, the class president who--and I must admit--isn't really all that important to the story, except for maybe one or two episodes, but certainly not the conclusion. Anyway, I'm glad to see that the cardboard cut-outs are all accounted for, and if that's not enough, there's plenty more of them later on--more breasts, a loli, MORE breasts. Perfect./sarcasm\\n\\n\r\nYes, one of the issues with C3 is that it can get extreme in many departments--with its violence, with its drama, with its fanservice; but, that's just the one brick in this cubic disaster, as this leads me to explaining the show's true issue. I can deal with some violence, I can deal with sappy drama and ridiculous amounts of ecchi service, but what is it that makes this whole show really fall to pieces?\\n\\n\r\nC3's pacing is ATROCIOUS. Period.\\n\\n\r\nThis show doesn't know what it wants to be, and even when it does, it's all over the place. Sometimes, C3 is a cute, adorable, light-hearted, romantic-comedy romp--as with its first episode; other times, C3 is a bloody, gruesome, violent, dramatic mish-mash of pretension and battling--as with its second and third episodes. If all of those descriptive words were too much and/or too sweeping in terms of genre, that's my point exactly. In fact, to hammer this point in even further, take a look at MAL's genres listing for this show, and then take a look at its rating. Doesn't really mesh well, right?\\n\\n\r\nNot only that, but the speed of which this anime attempts to cram its plot together in twelve episodes is astonishingly bad; understandably, this can be a somewhat prominent issue with shows that are twelve episodes or less due to time constraints, but C3 takes the problem leaps and bounds forward. The show goes through three, separate villains; a number of extensive fight scenes, some taking at least half of an episode; full episodes devoted to \"rom-com\" material; several-minute-long comedic scenes; time spent on philosophical dialogue; flashbacks, back-stories, and long, expository monologues--\\n\\n\r\nPhew! Give me time to breathe, please!\\n\\n\r\nGranted, if the show hadn't gone for blatant sequel-baiting at the end of its run, I would have just chalked this up as Silver Link trying to fit too much material from the original light novels into too little time--for example, sort of like Chaos;Head. Unfortunately, this is one of the worst offenders I've ever seen of becoming a completely crushed and compressed product, but that's only about four-fifths of this cube analogy. What about the final piece?\\n\\n\r\nFor those who don't know of Silver Link's origin, here's a little history lesson:\\n\\n\r\nDirector Shin Oonuma, the director of both the much-beloved Baka to Test and this, once worked as a director of many of the earlier projects in another studio--SHAFT, which is now famous for their much later work, such as Zetsubou Sensei, Bakemonogatari, and, of course, Madoka Magica. He eventually split-off from them to help form Silver Link, but my guess is Mr. Oonuma knew the guy who did the trippy, layered artwork used in all three of those shows and decided to replicate what he had seen to be used in one of his own anime.\\n\\n\r\nIn fact, why stop there? Why not just be like SHAFT entirely, using all sorts of weird, seemingly out-of-place imagery? Apparently, Mr. Oonuma didn't understand the imagery he had seen in SHAFT's latest work, and the result was... well, even more things for me to complain about, in terms of this show not knowing what it wants to be.\\n\\n\r\nAll sorts of symbols are used, different art styles can be seen--heck, they might as well even use the old-style camera start-up trick that SHAFT has used a lot at the beginning of several of their anime (including Zetsubou Sensei, Vampire Bund, Madoka, etc.). None of this is able to stand up on its own, though; it just makes C3 look like its going for gimmicks rather than actual substance.\\n\\n\r\nNonetheless, I can safely say that when the art is normal and without any of the gimmicks, it's actually pretty visually appealing; it's colorful, it's cute, and keeps what would have been an otherwise even worse show from being completely disappointing. The soundtrack, too, does its job and isn't all that bad, but it isn't all that remarkable, either.\\n\\n\r\nWithout making this review much longer, I will conclude by saying that if the pacing wasn't so incredibly distracting as being the absolute worst item about this show, C3 would at least be mediocre. Heck, Fear is actually demoted from the main heroine to comedic relief after just over two-thirds of the series is up; because of this and everything else I have already mentioned, the pacing is simply inexcusable. C3 tries so hard to be something memorable like its older sister, Baka to Test, but it falls short of nearly every target; the story is too jumbled, the characters don't bear any staying power, and it overshoots by aiming arrogantly in the face of what made series prior to its creation work so well. What? Did a child write this?\\n\\n\r\nPrecisely, C3 is the equivalent of a kid who thinks too highly of himself and steals candy from adults instead of babies within the anime world; it just ends up choking on some Sour Skittles just before getting a good slap on its bottom. Now, if I could be excused for a moment, I have a Rubik's Cube to go play with~",
            "date": "2011-12-18T09:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 49481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BL2W",
                "username": "BL2W"
            },
            "url": "https://myanimelist.net/reviews.php?id=49481"
        },
        {
            "content": "Short or mid size reviews are best, nn tl;dr.\r\nOnce again we are rained down upon from the Japanese animation industry with a new series of adaptations and stand alone projects. The last few seasons we were graced by some greats such as Ano Hana, Steins Gate, and Usagi Drop; shows that showed nothing special but proved themselves with a above excellent plot scheme or brilliant story telling. I have to admit im still in the phase of watching anything that looks remotely interesting in each new season line up and I can say I have had some negative and positive experiences.\r\nC³ - CubexCursedxCurious was aseries I put my eyes on this season just because I needed to fill the void. My first impression was that this was just another ecchi/shounen combo(these rarely work out) but as the episodes went it progressed. Although the series itself is not finished it does have potential to become a decent show. My rating for this is open book mainly because a series can really only be rated at the following points: Beginning, middle, and end hence so many drops at the start air of any show.\\n\\n\r\nStory wise there is no evidence of any real exposure of full plot, this looks like it may follow a traditional plot sequence and I hope it does. The art is more computer look a like with the cube animations that are thrown in, minus the boob bouncing or slashing events its nothing that I would consider special. The sound effects are generic and bland, of course sound is I mean we hear so much everyday its impossible to filter everything out. The characters again are nothing special minus Fear Cube which really is the only thing keeping me gripped while I watch this.\\n\\n\r\nIf you like being first in line for a show you might just pick this up, but be warned do not expect greatness until its finished.",
            "date": "2011-10-28T12:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 46375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=46375"
        },
        {
            "content": "For a long time I have had an odd relationship with the anime \"C3\" also known by the much longer title \"CubexCursexCurious.\" It took me three tries to actually motivate myself to watch this anime: on my first attempt a year ago I managed to make it through the first 3 minutes of the first episode; then on my second attempt a month later, I made it through the entire first episode; and then, just this past week, I managed to watch the remaining 11 episodes. My conclusion, C3 has one of the absolute worst and most misleading first episodes of any show I haveever come across. Not that the anime really improves much throughout the rest of the show, but it's at least a slight improvement.\\n\\n\r\nWhat the first episode implies that this show will be is a very lighthearted, ecchi, comedic (albeit idiotic and not funny at all) anime about a humanoid weapon (who of course looks like a young girl) as she discovers the wonders of the human world from television to the warmth of human interaction. Episode 3 turns the entire lighthearted atmosphere upside down and shows that this anime can also have a VERY dark atmosphere at times. However, the show is inconsistent with that atmosphere and it comes and goes so much that it loses most of its effect.\\n\\n\r\nAnyway, onto the story. The show begins with our generic \"help everyone else before myself\" protagonist named Haruaki (voiced by Yuki Kaji). One day, an odd package from his father arrives at his house where he lives alone. This box is no ordinary box as it is impenetrable and baffles Haruaki to the point where he just decides to leave it alone. But, the box ends up turning into our flat-chested, energetic female protagonist named Fear. Haruaki then proceeds to go through the fastest acceptance of a strange supernatural girl appearing at his house I have ever seen. It makes some sense since it turns out that his tsundere childhood friend, Konoha, is also the same kind of \"cursed weapon\" as Fear. The rest of the first episode consists of Fear being left alone in Haruaki's house while the other two go to school (what a great idea) and it just follows Fear as she discovers different things about the world.\\n\\n\r\nAfter that, the actual plot begins and we find out more about what Fear and Konoha are and about the curses that go along with them. However for a reason that is never explained, Haruaki is immune to these curses which allows him to fight with Konoha (who can become a sword) without suffering the consequences like most people would. The story never really focuses on one objective and in the end, is in dire need of a second season as it keeps introducing characters right up until the end credits of the last episode. The different plots tend to focus on different characters like Fear, another girl who is Haruaki's class president named Kirika, and a few other minor characters who aren't Konoha because she never gets to be a focal character despite being a main character. The series also has very poor villains who only stick around for a few episodes at a time and more annoyed me than anything else.\\n\\n\r\nThe animation and soundtrack are some of the better aspects of this show. The first opening is actually what interested me in the anime originally (before the first episode killed that interest twice) and the first ending is a beautiful ballad which stands above most generic ballad ending songs in my opinion. The show switches openings and endings later in the show (despite this being only 12 episodes) and neither really impressed me as much as the first ones. The second opening puts focus on Kirika rather than Fear despite that never actually happening in the show.\\n\\n\r\nThe characters' designs are good but none really stand out all that much. Fear is your typical flat-chested girl, Konoha (aka \"Cow Tits\") is the busty girl who Fear envies, and Kirika looks like your typical \"mature girl\" on the \"outside.\" The characters also wear their school uniforms about 75% of the time. To top it all off, I have no idea why they would have a villain who wears clothes that make her look like a nun (she's not one in case you're wondering), but they did. Most of the action scenes look great, especially the VERY dark ones, however, there are some moments where things (like smoke in the background of a fight) seem a little awkwardly animated. There are also some moments where the show tries its hand at some more surreal animation tricks like making a clock tick and appear every so often during a speech or showing a character on a white background with only their shadow around them. I generally like things like this, but this show did not know how to time them correctly and they just ended up as random moments where the animation sometimes even contradicted how the characters were feeling.\\n\\n\r\nThe soundtrack, aside from what I mentioned before, is good but nothing outstanding. It's pretty forgettable especially during the lighthearted scenes and only makes itself noticeable during some of the darker fights.\\n\\n\r\n\"C3\" is a great example of an anime that didn't know what it wanted to be. It tries to be a lighthearted high school comedy, a VERY dark psychological action story, a story about how humans really aren't as bad as they may seem, a story of redemption (which ties into the dark one as well), etc. It introduces and then moves on from its poor villains.....I would say too quickly for development but I was glad when they were finally gone. The main characters have hardly any development, the \"behind the scenes\" organizations are never explained, what exactly these \"cursed weapons\" are and why Haruaki is immune to their curses are never explained, and the show ends crying out for a second season by showing a few new characters right at the very end. Considering it came out two years ago and doesn't seem to be very well received, I do not expect it to receive a second season. On that note, I would recommend passing on \"C3,\" and only watch the great first opening and ending if you think you can avoid getting interested in watching this way below average anime.",
            "date": "2013-11-17T22:49:00+00:00",
            "helpful_count": 10,
            "mal_id": 120667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=120667"
        },
        {
            "content": "If you like cute character,a little bit of harem story,and romance included with some actions, this anime is perfect for you. I recommend you to watch this show.\r\nStoryline:\r\nAt first glance, I can predict what will happens next to Fear Kubrick as the story is alike \"Dragon Crisis\".Some sort of crazy power hidden in the main protagonist (Fear Kubrick) then there is battle scene and I think it is a story with a lot of theme variation and it was good for a story. The story started with a peaceful scene which is enjoyed to watch,and there is no lines that could make you confused atall.\\n\\n\r\nArt:\\n\r\nI think the art is extremely good,I give 9/10 for it. You could notice some catchy effect in the episodes,I thinks its new for me.Furthermore, the art is the major succes factor of this anime since it has a lot of unique animation variation packed throughout the anime.\\n\\n\r\nSound:\\n\r\nUmm,The sound. As long as I enjoyed the anime,the sound must be good as well.Right music choices and some pianos melody all placed in the right scenes. But the things that interest me the most is the main theme song of the anime \"Endless Story\" by Tamura Yukari(Fear Kubrick voice actor).\\n\\n\r\nCharacter:\\n\r\nIf you're fan of short female protagonist,such as Shana(Shakugan No Shana), You will definetly love this anime as well. Male Protagonist, has some sort of cool character,caring and so on.Fear Kubrick is cute (In my opinion),and her action is such a normal kid,loves to play,naughty and so on.\\n\\n\r\nEnjoyment:\\n\r\nAhh...I really enjoyed this story. Look for yourself.\\n\\n\r\nOverall:\\n\r\nThis story reminds me of Kugimiya Rie anime characters,Shana,Rose,Louise and Nagi but this time,Its  Tamura Yukari Turns. I'm sure you will love this anime, and I dont want to talk much more,just watch it and feel free to tell me how is it!\\n\\n\r\nP/S: This review based on my own understanding and all from my perspective.",
            "date": "2011-10-20T08:22:00+00:00",
            "helpful_count": 9,
            "mal_id": 45887,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/311464.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kazuyasan",
                "username": "Kazuyasan"
            },
            "url": "https://myanimelist.net/reviews.php?id=45887"
        },
        {
            "content": "C3... At first i thought it would turn out to be yet another generic harem/ecchi anime. Well, it still turned out to be a generic harem/ecchi anime (in my opinion), but the direction it took really surprised me.\r\nThe first episode did not set a very good base for the whole series. It felt nothing like the other 11 episodes that followed. My first thought when i saw episode 2/3 was \"What the heck?? Oh god is this going to turn out like Elfen Lied or something?\". Well with Elfen lied, they atleast had the decency to show just how whacked out the series was inthe first episode. C3 hides it until around the third episode which is very misleading and just bad planning in my opinion.\\n\\n\r\nThe only reason i even gave this anime a shot was because i didn't have that many new anime that i wanted to watch. I was already hesitant to continue after the first few episodes, but i went and finished the whole series anyways. Let me just say that it was more or less what i expected it to be, boring and full of fanservice (not in the good way).\\n\\n\r\nThe art is probably the only thing that stopped me from dropping this anime after each episode i watched. The fight scenes were pretty well done (especially the last one). It was really good of course because the studio that made it was Silver Link (Baka to test ftw), but it is quite sad when that is really the only thing keeping the viewers from dropping it.\\n\\n\r\nThe music was nice as well. The opening song , Curios, was one of those few openings that i wouldn't skip over every episode. It was nice and soothing, and the OSTs were pretty well done as well.\\n\\n\r\nThe characters... there is not much to say about them. They stay pretty static throughout the whole series and are quite boring. If i had to say, the two most interesting character are probably Kirika Ningyouhara (side character/part of the harem) and Peavey Barowi (pyscho villain). Interesting does not mean i like them though.\\n\\n\r\nWhen i first read the synopsis for C3, i thought it was quite interesting. It was still a bit interesting when i watched it, but i felt that it was very badly portrayed in the anime. I find myself forgetting what the story is about from one episode to another. In the end, it seems like they just wanted to rush through and finish the anime. \\n\\n\r\nThe ending left me very unsatisfied and i felt like i just wasted a few hours of my life. They were probably trying to get people to read the light novel, but i probably won't be doing it. This show overall did not keep me very entertained with its mediocre story line, but it was still decent enough for me to push through and finish it. I would recommend watching this only if you have nothing else to do, or if you are very Curios about it.\\n",
            "date": "2012-09-01T13:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 71349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=71349"
        },
        {
            "content": "Goodness gracious, this is one delicious shit sandwich... Might as well get right down to it...\r\nStory - 4\r\nI'm not sure what the damn story is. This is just one of those animes, packed with such random shit and dialogue, to make sure it looks as dramatic and dark as possible. Gimmick here Gimmick there. It manages to leave me feeling like an idiot, wondering whether I was too stupid to understand what it was trying to tell me or that it really wasn't trying to say anything at all. It's a mess, a big mess. It confuses you...\r\nIf you're looking for a good plot, goelsewhere. You have better chances of being served a Big Mac at Burger King for your retarded ass.\\n\\n\r\nArt - 9\\n\\n\r\n\"Well at least the art was good.\"\\n\\n\r\nThere it is. That excuse. And yes, there is absolutely nothing to say against it. I watched this crap for the art. Boy was the animation spectacular. Random yes, interesting? Of course. Awesome compared to the garbage art I've seen in my day. At least it had this.\\n\\n\r\nIf they only had put as much effort into the damn story than they did the art. I would have agreed to have middle grade art in exchange for a good story, that made sense.\\n\\n\r\nSound - 6\\n\\n\r\nAll that noise... OP and ED, did not capture my interests nor my attention.\\n\\n\r\nCharacters - 6\\n\\n\r\nShallow, underdeveloped, unrelatable. You won't be crying if any of them died. Nope, not even the slightest change in facial expression. Sure I kind of liked some of them, but not enough to go into detail in this review.\\n\\n\r\nAlright... one word. Bondage.\\n\\n\r\nEnjoyment - 5\\n\\n\r\nI was wiping the drool off my table every time I finished an episode. Not because I was too engrossed to keep my mouth closed, but because I did not give a shit about what happened next and was blankly staring at the subs waiting for it to end or for something interesting to happen.\\n\\n\r\nOverall - 5\\n\\n\r\nRemember that sandwich I mentioned at the start of this review?\\n\\n\r\nThe art was good, but now that I think about it, there really isn't such a thing as a delicious shit sandwich is there? Good art or not, I have other animes piled up that are willing to and able to give me more, for less suffering.\\n\\n\r\n-------------------------------tl;dr?-------------------------------\\n\\n\r\nDo not waste your time. Unless you want to appreciate the art with a Blue Ray copy which I feel is a complete waste of resources in itself.",
            "date": "2011-12-23T07:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 49911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=49911"
        },
        {
            "content": "This is just my first impression based on the first episode, so my opinions on this series are subject to change.\r\nSo in the first episode our protagonist Haruaki Yachi is sent a box from his relative, which can transform into a beautiful tsundere girl. It's then revealed that she is basically the living manifestation of the negative emotions people give off, which might explain why she is tsundere in the first place. \r\nOk...I'm interested.\r\n  I don't really think that one can get an overall feel on what the rest of the anime will be like from just the firstepisode, but that's not to say you can't get anything from it. From this, I've taken it that the plot is unique from others, and therefore, I'm interested. I mean, it's not everyday you hear a show has a girl that can transform into a box. \\n\\n\r\n   The artwork and animation is also praiseworthy, much better than I expected, even. It's graceful animation and colorful backgrounds are pleasing to the eye.\\n\\n\r\n   The sound effects are nothing special, but nothing bad either.    \\n\\n\r\n   The characters, however, are what make this review suffer greatly. There is nothing from them that makes them stand out because they are overly cliche types that can be found in many other animes. The childish-but-in-a-cute-way tsundere. And the pushover male lead who puts up with her, and conveniently lives alone. The only character who has some depth in their stereotype in Yachi's friend Konoha. She appears to be just some other \"glasses-girl\" type of girl who is kind and caring toward him, but she can also be quite the snappy kind of girl, who won't hesitate to make a remark back when insulted, but it seems she's won't even be a lead character.\\n\\n\r\n   Overall, so far I'd give this series a 7/10, because of the interest it's peaked in me with it's art and plot, and because of the overly used elements. I'll continue to view a few other episodes and see if it's something that can use it's potential to the fullest, or be another anime that's so focused on being cute, eye candy that it sacrifices the storyline.",
            "date": "2011-10-02T18:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 44699,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485956.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Undercover_Otaku",
                "username": "Undercover_Otaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=44699"
        },
        {
            "content": "C3 is the next anime in the line of what I'd call \"Shana Clones\" mainly because of the tsundere lolicon lead and the overall formatting. Likewise, it's very similar to Dragon Crisis.\r\nThe story consists of Yachi Harukai, a boy who is supposedly immune to curses, finds a mysterious box in his house. He finds out it's really Fear Kubrick, a cursed tool. After a talk he decides to lift the curse from Fear so she can live a normal life. More characters are introduced and it becomes kind of like a harem, but without any real romantic feelings. \r\nThe show is presented in short arcsconsisting of 2 or 3 episodes. Each one has a new antagonist that the group has to defeat. One of the issues with the series is that there is almost no continuity with the antagonists at all. While almost all of them just want Fear (or to destroy her) but other than that you know nothing about their motives. \\n\\n\r\nAlso, while actually a great deal of lose ends are actually cleared up before the next arc starts, it's usually done through some of the worst dialogue I have ever read in an anime. At times they just go on after they cleared it up, something like a Soap opera.\\n\\n\r\nEach character has some past history, Yachi has helped decurse tools before, like his childhood friend Konoha, but we don't really learn anything about that. Likewise, the class president Kirika has a secret past, but we don't really learn much about that either. In fact, we don't really learn anything at all. Like, Yachi says he is curse immune, and it is kind of hinted he is, but we never get any proof of this. \\n\\n\r\nI will say that Fear had some parts (first episode) when she look very similar to Konata Izumi, like remember Yuripe from Angel Beats being purple haired Haruhi?\\n\\n\r\nC3 is dotted with fan service. But it's not arousing or funny, it's just kind of there. Fear is a loli, but there's an even lolier loli down the road where you get even more panty shots from. Konoha is also often referred to as \"Cow Udder/Tits\" And Kirika is often sexually harassed and also dons an \"interesting tool\".\\n\\n\r\nThere are fights too, but just about ALL of them end up being the exact same thing. Even Naruto who uses the same two moves basically in all his battles had more diversity. \\n\\n\r\nThe art and animation are actually decent, but that's really it. C3 was stuck in a season with a lot of impressive titles. The OP is nice, err it's basically a girl (Fear) dancing to some Jpop, but it has nice smooth animation. \\n\\n\r\nOverall I gave this a 1, which might actually be kinda harsh, but I can really see no way around it. It was hard to care about the characters, story, or really anything that was going on. C3 should have stayed in the box.",
            "date": "2012-01-10T23:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 51493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=51493"
        }
    ],
    [
        {
            "content": "*SPOILER WARNING*\r\nC3 centers around a boy named Haruaki Yachi who one day recieves a black cube from his father. His father sends him cursed intruments to try and make him break the it because he is resistant to curses. However the black cube is actually a girl named \"Fear\" and she is a type of intrument, a \"Fear in Cube\". She suddenly starts living with him, much to the dismay of Haruaki's childhood friend Konoha. \r\nHowever as the story progresses on, it develops into something much darker. Turns out that there are other people who wants the \" Fear in Cube\", and they come afterFear. Fear's dark past is revealed to the others, and by this time if you still think Fear is just a cute ordinary girl, then you are wrong. As her past is revealed, she starts to lose control of herself just by seeing blood, turning a cute girl into something more of a monster. That fight was one of the scariest ones ever, with Fear having a twisted expresssion of a smile on her face while killing. Also when Fear started to question her own existence, that was probably one of the most moving scenes in this anime which actually made me feel really sad.\\n\\n\r\nChildhood friend Konoha is also not your ordinary childhood friend. Her real form is of something much more badass. Haruaki is also not useless, as he is shown that he has a badass side where he can fight against other people who want to destroy Fear. As for the class prez Kirika, I have to say that she is not normal too, as she is connected to a mysterious organization whose objective involves cursed tools.\\n\\n\r\nArt is of BakaTest, and I'm really pleased with the character designs. But what I really love about this show is the wonderful OP song and animation. OP is probably one of the best of seiyuus, sung by Tamura Yukari. Along with it are beautiful animations with cherry blossoms flying everywhere. OP2 is also very nice, sung by Kitamura Eri, as the story focuses more on Kirika.\\n\\n\r\nI have to say I'm very impressed with Tamura Yukari's voice. Finally we had a cute loli not voiced by Rie, and Yukarin does not fail my expectations. She can do a cute high pitched voice while also doing a lower, scarier voice for the transformed Fear. Kaji Yuuki is also a great seiyuu with a nice gentle voice which I think is perfect for Haruaki. Along with Chihara Minori as Konoha and Kitamura Eri as Kirika, it definitely sounds like a harmony to me :)\\n\\n\r\nOverall, C3 was a nice anime to watch and enjoyable. If there is a 2nd season I would definitely watch it!\\n\\n\r\nFeedback is greatly appreciated, thanks! :)",
            "date": "2011-10-10T01:54:00+00:00",
            "helpful_count": 213,
            "mal_id": 45221,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/476326.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Meldoy",
                "username": "Meldoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=45221"
        },
        {
            "content": "Why didn’t I drop this?\r\n[Contains vague spoilers, then again, it's so predictable a caveman could do it, also contains some offensive language]\r\nC³ is best described as an atrocity then again, that might be considered a generous title. This would be the “ideal troll” series to give somebody to watch. It’s not very good in storyline, and the characters are the aggravating type of cliché. It follows the generic harem law of everybody falling in love with the average dude, and it offers incessant and redundant fan service. The series basically follows this extremely unique and innovative storyline:\r\nBoy meets unique and strange girl, strange girl issuffering from a curse, boy wants to help girl, girl denies boy’s kindness and runs away after accidentally hurting boy, boy finds girl and basically accepts girl, then girl learns the meaning of friendship. Innovative and original right? Normally, the storyline wouldn’t be aggravating on its own but it’s just portrayed and executed in such an obnoxious way.\\n\\n\r\nThe majority of the episodes are generally composed of 60% school/fan service, then 30% actual plot, with the 10% being the OP and ED. The series basically started off as excessive moe fan service followed by an episode or two of melodrama. Then it led into some action, which was surprisingly pretty cool. Then it fell into the inevitable plight of more melodrama, love triangles; then from episode eight onwards, it’s visited by sporadic random tentacles[perhaps, slightly exaggerated].\\n\\n\r\nSurprisingly, the actual plot does actually exist, albeit rushed and poorly told. The small plot is littered with mediocre storytelling and incessant fan service. C³ basically tries to develop a seemingly serious plot, but the plot is about as creative and unpredictable as Bleach’s. The plot basically revolves around trying to alleviate the girl’s curse, but it does it in such a bad way. Numerous questions are raised with each episode, and they are answered, but are done so in such a mediocre way. C3 is titled a harem, ecchi comedy with action elements; if it actually stayed with those genres, rather than attempt an asinine, darker one [which it fails to do], then this review wouldn't exist [It would be like being irritated at the fan service in a series labeled as an ecchi romance; I don't like C3 because it tries to incorporate more genres than it can handle.] \\n\\n\r\nTo be fair, most series raise questions, but they answer them. Now how do they answer them? Well, most of them would answer them through subtle hints, actions, and perhaps even some dialogue. How does C³ do it? Well, they do it through dialogue. Not intelligent dialogue, but in blatant “Why did this happen”s and “What was that”s. Now imagine the end of a mystery anime, where everything is resolved, there’s been a few subtle, yet significant clues, and the main detective puts it all together, in blatant monologue. Now, if C³ was a mystery anime, that wouldn’t be so bad, but it does this without any clues. They literally just commune a meeting and go, “What was that?” and well, that’s how the majority of the questions were answered, in Q and A format, intelligent right?\\n\\n\r\nNow C³ isn’t an entirely bad series. It does have a few redeeming “good” points. The art and animation is simple, yet in some scenes it’s done really well. Both openings look great[it's simple, but they actually do look good], and the ending theme fits. The action scenes are also pretty cool, the history behind the torture weapons, and the actual fighting isn’t bad. It’s entertaining when it comes to that, but besides that, it doesn’t have much going for it. Basically, imagine Bleach with more melodrama, and much more boobs, tentacles, and panty shots.\\n\\n\r\nObjective Score: 3/10. It’s the irritating type of below average, it’s not good, and it’s not enjoyable. This show was actually one of the few that I fell behind on due to the incessant bullshit I put through while watching it.\\n\\n\r\nSubjective Score: 3/10: It’s still shit. If you’re into tentacles, panty shots, incessant fan service, and boobs, you’ll probably like this. If you want a decent storyline, or even decent characters, you probably wouldn’t like this. The show is mostly fan service, and the plot itself is mostly ridiculous and only used to further develop the fan service",
            "date": "2011-12-19T10:46:00+00:00",
            "helpful_count": 183,
            "mal_id": 49569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=49569"
        },
        {
            "content": "This review for C3 will be based on opinions made after viewing the first episode of the series, and will also give a brief overview of the first episode to enlighten those who may have an interest in this deep, suteki (tl note, Suteki = great omg nihongo xD) anime. \r\nThis kakkoi, perverted boy (tl note: kakkoi means cool) receives a gift from his otou-sama, which turns out to be a cube, which then turns out to be a naked, silver haired, kleptomaniac loli(and I must praise this for its originality on this part, we never have had girls randomly appear and suddenly live withthe MC before). A very cute one, I might add. She’s perfect in all proportions. A beautiful, budding chest. Eyes that glimmer with innocence, hips that are clearly not ready for bearing a child. And a bum that just screams at you. The show is focused entirely on her and all her cuteness, so these are important notes to keep in mind when you decide to watch the first episode. Her name is Fear. She also has some ability that curses her owner, but pervert-kun has an immunity to curses so it’s all kakkoi and stuff. You know, I was honestly staring at DFC-tan’s face the entire time so wakarimasenlol. They also introduced some yandere-looking childhood friend with cow udders, but because of that I will be neglecting her in this review. \\n\\n\r\nAfter the introduction of our silver-haired Goddess, pervert-kun, and other girl, the show quickly gets straight to the point of the story, the everyday actions of our lovely Fear. Pervert-kun leaves her home alone so he can go to “school”, like the cold hearted sod he is, so Fear decides to take her beautiful DFC self out into the town, where she quickly learns how nice everyone in Japan is. Somehow, she had actual outdoor apparel for this venture, despite her nor pervert-kun not actually going out to get any clothes, which can lead us to believe that pervert-kun is a closet crossdresser, or has some perverted hobby. Whatever the case, he seems like a cool guy for so quickly deciding to live with a DFC goddess like this and already having clothes for her(sasuga, pervert-kun). \\n\\n\r\nFear feels a lot better about being abandoned for the day by pervert-kun and decides to repay his kindness (you know, giving her a free place, some clothes he already had for some reason, going to school instead of spending time with her ;~;) and put her housekeeping skills to the test! And as we would expect from a beautiful, flat chested girl like this (I just wanted to stroke her chest with my face, kiyaa~), she did a splendid job! So much that pervert-kun came home and gave her a sugoi speech. ^-^\\n\\n\r\nIf you enjoy series that have as much of an original plot as this one does, and series with characters as subarashii(wonderful ^^) as our closet crossdresser pervert-kun and our delectable DFC honey, fear, then C³ is definitely an anime worth your time to check out!",
            "date": "2011-10-01T22:32:00+00:00",
            "helpful_count": 63,
            "mal_id": 44589,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341852.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sartaj",
                "username": "Sartaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=44589"
        },
        {
            "content": "Rule 34.....\r\nGenerally accepted fearsome internet rule that states that pornography or sexually related material exists for any conceivable subject.\r\nAt first I was like....\r\n\"Oh yeah, I bet that rule can't be applied to a freakin CUBE!\"\r\n........And thus C3 is born.......\r\nNormally I don't review animes on first episodes but I have to give my first impressions on this one as a clarify with those who wants to pick up this series. Will update as the anime progresses.\r\nHere we go! Another school battle royale! But this time with tools and objects transforming in gorgeous girls. Yachi Haruaki is a normal high school boy with a travelling parent whomsends him backs souvenirs in the form of girls (oh god I wish my parents did that) but here's a twist. They're all cursed tools! So nne day, Haruaki receives a black cube from his old man. During the night, he encounters a NAKED (yea because that's how we normally encounter girls for the first time right guys?) silver haired girl stealing rice crackers. She is the human-form of the black cube, an instrument of torture called \"Fear in Cube\". So thus began their newfound companionship in a battle royale against other cursed instruments in the form of girls. Sound familiar?\\n\\n\r\nThe art and animation! Blindingly colourful and obviously similar to series such as Baka To Test? That's because the same director Oonuma Shin is in charge of both series. He was also the episode director of Bakemonogatari which is why C3 seem to have a bit of the \"SHAFT\" aspect to aspect approach.\\n\r\nCharacter designs are pretty  average but the high luminosity design managed to grab my somewhat short attention span. I have nothing much to add about sound. Seiyuus portrayal of their characters are just average as well. However I do enjoy the BGM. It manage to expresses the torn conflict between peace and chaos in the anime.\\n\\n\r\nI will update character review as soon as the plot advances. For now we have our typical hero, Yachi Haruaki, whom is somewhat special ability of not being able to be cursed. What  prove do I have?\\n\r\n\"Hey Yachi! You're a mother f*****!\"\\n\r\nSee? I can't curse him. Yeah I know that was lame. But you've read it anyways.\\n\r\nJoining him is Kubrick Fear a typical tsundere whom now have to cope with life as an average girl.\\n\r\nNot much of an innovation to the whole anime scene but this is expected since the themes are comedy and ecchi. I can't complain if authors are to afraid to venture out and try new character development techniques. The easy way out to show character developments is of course employing the \"dere\" character cards.\\n\r\nAnd last but not least a childhood friend with no redeeming qualities whatsoever (yet) except accelerated specific regional  body growth.\\n\\n\r\nI can't really say I enjoyed watching the first episode. But I don't hate it as well. It is somewhat confusing. Is it trying to be funny? Is it trying to be dramatic? Philosophical? Moe-blob?\\n\r\nDefinitely trying to be a Moe-blob anime. So if you enjoy those and you''ve got spare time why not pick up this anime and be the judge for yourself? Or you could think outside of the box and apply rule 34 to other everyday objects. \\n\\n\r\nHaremu Kingu,\\n\r\nSigning off\\n\\n\\n",
            "date": "2011-10-03T07:40:00+00:00",
            "helpful_count": 51,
            "mal_id": 44755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=44755"
        },
        {
            "content": "First impression based on ep' one - The intention of this review is to highlight elements of the story you may like or disslike, depending on your preferances and possibly, the time period you have neen watching anime in general...\r\nThis series features a set-up which is quite familar:\r\n- tsundere galore\r\n- characters are school age\r\n- fight scenes that consist of neon coloured magic\r\n- cutsie, somewhat bratty loli who need looking after\r\n- overly passive male tsundere-victum type who accepts his lousy life\r\n- family issues - in this case, family conveniently out of the picture\r\n- unnessessary female sidekick who doesn't seem to have anything else to do\r\n- supernaturalbeing who's human appearance is a cute girl for no particular reason\\n\r\n- humor in the form of ecchi related missunderstandings\\n\r\n- unluck guy; the female('/s) are there to bring about a change\\n\r\nI know that some of these factors above can easily attract or repel, as the familiar is great for some (who I could reccomend to) yet tedious for others (I wouldn't reccomend to) and if this is pretty much a starter anime for someone else, then go for it. ;D\\n",
            "date": "2011-10-02T09:02:00+00:00",
            "helpful_count": 44,
            "mal_id": 44633,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=44633"
        },
        {
            "content": "After having watched the first 3 episodes of C^3, I must say this show really has potential.  After a light, almost excessively cheerful introduction, the show gets progressively more action packed, emotionally involved and takes a more serious tone revolving around sin, guilt and regrets.\r\nI found the art to be appealing, as is the case with most anime this season, I found the cast of voice actors to be strong, the main male lead in particular, and I found the pacing and development to be varied so as to accentuate the important parts.\r\nIf you try to pin this show down with episode 1, thenyou're not going to give an accurate opinion on what it is.  It is a varied show with an interested plot mechanic and good production values, that is worth giving an hour of your time to to view the first three episodes.  Happy viewing!",
            "date": "2011-10-17T03:38:00+00:00",
            "helpful_count": 34,
            "mal_id": 45689,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32084.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lyim",
                "username": "lyim"
            },
            "url": "https://myanimelist.net/reviews.php?id=45689"
        },
        {
            "content": "C³\r\nC cube was really rushed in the story, is like if they knew they were not going to make a 2nd season, and they wanted to throw a lot of content in just 12 episodes.\r\nStory\r\nThe story at first is really great, but it goes down every episode, because it's not consistent, it's like there are three different stories on just 12 episodes, the first story was great, was dark and violent and the action was the best in that story, the 2nd one was fine but it wasn't what i expected, like, it slowed down the things and less violent and less dark and thethird one was ok, violent like the fisrt one and kind of dark but not shown like the first one, the ending was like if they are going to continue with a 2nd season because of the end, so if you put all of that together the overall is good.\\n\\n\r\nArt & Animation\\n\r\nIt really was very good, at first looked normal but then as the episode continues it has a dark tone and dark feel on the atmosphere, i liked the characters design.\\n\\n\r\nSound\\n\r\nThe sound was very good, the VA and the music was good and the different OP and ED were just great, i really liked them a lot.\\n\\n\r\nCharacter\\n\r\nThe dark past of Fear wasn't expected for me, i really didn't expected that and started to think if i was going to like her or not, but you will find out for yourself, Haruaki was normal but powerful with the help of his childhood friend Konoha, who happens to have her own abilities to help Haruaki, Kirika was great and i felt for what she was going,Kuroe was really adorable and funny and i felt sorry for the loli Amanda, overall was very good.\\n\\n\r\nEnjoyment\\n\r\nWhat i enjoyed the most were the first and last episodes, the middle ones were ok but not like the others level, the ending was unsatisfying but overall i had a very good enjoyment.",
            "date": "2015-08-07T13:43:00+00:00",
            "helpful_count": 32,
            "mal_id": 195442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195442"
        },
        {
            "content": "Story- I think that the plot of the story wasn't very contestant. It added things and just dropped it off. I think that the story is like three different arcs (in away). I like the first two, but the last one was not very interesting and very confusing. I think there was stuff they forgot to wrap up or did do it properly. I will not say what it was because I don't want to give spoilers\r\nArt- The art is where this show shined the most. It was very colorful and lively. When it came to a time of a flash back or memories, thestyle look like a puppet show. When it came to fights and intense scenes, the back round color would be greens or red. When humor was in play, there would be bright colors and funny doodles. \\n\\n\r\nSound- the voice acting was very enjoyable. Every characters' voice fit their attitude and personalty. A few voices i didn't like. there is no dub so I can't judge it. The opening really reflected the show. The first one was upbeat and lively, but a a quick dark moment to reflect the sadness and anger in the show. the second one was darker and more down toned.\\n\\n\r\nCharacter- The character were very nice and enjoyable. Some that only stayed for a few episodes I like because most of them weren't one dimensional.\\n\\n\r\nEnjoyment- I like this show for the virus reasons I have list above. I just didn't enjoy the amount of fan service it had.",
            "date": "2015-02-23T12:31:00+00:00",
            "helpful_count": 16,
            "mal_id": 181060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=181060"
        },
        {
            "content": "I'm writing this because episode one does not reflect the pure awesomeness that is episode two. It almost feels like they made that first episode the way it is because they wanted to make what follows somewhat shocking and completely unexpected. \r\nAnd job well done. I was not expecting that at all. I'll let you all discover what it is on your own, i wont say anything more.\r\nEpisode one was just fan service. A naked Fear, and a multitude of panty-shots and comedic silliness that doesn't really do what follows justice at all. Thats why i think it was there to give a false indicationof what to expect. \\n\\n\r\nThis is really shaping up to be an interesting series. The artwork is great, one redeeming factor of the first episode, blasting purples and blues and all sorts of radiance in every shot. The girls are cute but for that first episodes are just empty shells of what they turn out to be. Loli-jealousy of the girl with the big boobs and things. You get the idea. \\n\\n\r\nEither way, i did enjoy the first episode, don't get me wrong. But the second episode is brilliant in comparison. It starts off the same way as the first but it escalates into something much bigger, very quickly. Give it a watch.",
            "date": "2011-10-17T01:43:00+00:00",
            "helpful_count": 14,
            "mal_id": 45685,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503309.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rydia69",
                "username": "Rydia69"
            },
            "url": "https://myanimelist.net/reviews.php?id=45685"
        },
        {
            "content": "I am going to be completely unbiased - this is an outstanding anime so far with an original plot. ** It is unfair to judge this anime based on the character's hairstyle, and give it a low rating just because it has some ecchi scenes. I certainly will not be doing that. **\r\nFor starters, the character names. They fit really well with the characters themselves. First up - Kubrick Fear. As stated in the synopsis, she is basically a torture machine in the form of a girl; Fear. Her actual form, and primary weapon would be the 'cube'. Kubrick being 'Cube' and 'Brick'.. get it?Get it?! :D\\n\\n\r\n'Yachi Haruaki', the main male protagonist in the story. \"Yachi\" in Japanese means fortune, or good luck. I'd have to concur, as Haruaki claims that curses do NOT affect him whatsoever.\\n\\n\r\nThe plot is fantastic and original. Materializing 'torture' machines to do away with your opponents. And the way they are summoned and the incantation (in my opinion) is way cool! It is not your typical 'Swordfight' anime or 'Trigger-happy' anime. It gives a medieval feel, because torture machines were created way back when they were necessary for interrogations.\\n\\n\r\nI always thought Muramasa Konoha (I never noticed her surname, 'Muramasa' until now) was only going to be the typical USELESS (emphasis on useless) 'big-breasted' friend who would always try to steal the main character away from the female protagonist (references to Yoshida from 'Shakugan no Shana', and Siesta from 'Zero no Tsukaima'). I was horribly mistaken... SHE CAN TRANSFORM INTO A FREAKING SWORD! I should have seen that coming, though; her last name is 'Muramasa'.\\n\\n\r\nThe Opening song is pleasant to the ears. It kind of reminds me of something out of CLANNAD, or Touhou. I found Fear's dance really cute and charming.\\n\\n\r\nI said I was going to be unbiased, but that was a lie. I have a fetish for tsunderes (although, you know who you tsundere-fans are!), and Fear is an ADORABLE one. Her actions, her expressions, her love for food. Wow. 10/10\\n\\n\r\nOn top of the vocal/musical masterpieces, we have visual artwork. I really like how the eyes were done in this Anime, and also I like how Fear's hair shines rainbow. It's very appealing to the eyes, in my humble opinion.\\n\\n\r\nCharacter development is a big one. Unlike other animes, where they pour all this information on you (most of the information being irrelevant or useless), Cube x Cursed x Curious slowly thickens the plot, and distributes background information on each character at a nice pace. Right now, we know very crucial details about Fear, Haruaki, and Konoha that help us digest the story a lot easier.\\n\\n\r\nOverall, I give this anime 10/10!",
            "date": "2011-10-18T00:28:00+00:00",
            "helpful_count": 14,
            "mal_id": 45759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/645539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/astro-kun",
                "username": "astro-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=45759"
        },
        {
            "content": "Starting off as a comedy and, then, getting total serious and violent, this was surely an unique experience... We can see Fear as a clumsy girl on the entire first episode, destroying everything on Haruaki's house. However, things get more interesting as her true nature is shown right on the next episode: a killing machine...\r\nGattering all pain and suffer caused by the Inquisiton and turning that into a human with feelings and the sole desire to forget her past, Fear is \"delivered\" to Haruaki as a cube, sent by his weird father. Maybe he already knew Haruaki would be able to help her out, ashe was born with some kind of \"curse resistance\" and also lives on a sanctuary, a symbol of mind peace and tranquility...\\n\\n\r\nStill, would Fear be able lock her bloodthirsty alter ego and turn herself into a good person? First step is forgetting about killing people... Tough matter, as others try to pursue her... So, she has to count on her new friends to help with that and with her overall \"rehabilitation\" as well...\\n\\n\r\nVisually gorgeous, CxCxC uses every possible animation trick to improve enjoyment. Short, special cutscenes, everyone of them with an unique style, are simply amazing! Overall design may look basic, but reminds of classic visual novels, those where characters had even bigger eyes, that attract me so much... It also features two different OP/ED themes, despite being 12 episodes long... I had never seen a short anime where that happened...\u2029Moreover, we get the chance to see some of the most famous torture tools ever used by humankind, redesigned... Fantastic!\\n\\n\r\nThere are few characters, but more are introduced on last episode's ending, giving strong hopes for a new season in the future. Just like a VN, characters don't differ to much from each other on appearance matters, they all have the same base design... Still, they have their own personalities, some really awkward...\\n\\n\r\nFear is a kind of metaphor, cleverly created to show us that even the most despicable being, responsible for many people's suffering and death, is able to get complete forgiveness after paying for his sins and, by helping others and showing appreciation for those who helped him. We all make mistakes, some of them may seem unforgivable... We are imperfect, but anyone can change... That's the main lesson taken from CxCxC...",
            "date": "2013-10-22T05:18:00+00:00",
            "helpful_count": 14,
            "mal_id": 117865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=117865"
        },
        {
            "content": "This is simply my opinion so you may disagree with it, but i do hope you enjoy reading this :3\r\nBrief review: For those who don't wish to spend too much time reading other peoples thoughts.\r\nStory 4/10: Nothing ground breaking. I don't really care much if it has been done before... but the story just doesn't flow too nicely.\r\nArt 8/10: The art was good. I liked the art. A number of scenes are used a few times too many. The effects where nice but i feel that if they added a bit more variation to the \"OOO SHINY!! OOO SPARKLY!!\" thing going on every time someonegrabs a weapon, things may have turned out better.\\n\\n\r\nSound 6/10: The seiyuu did a lovely job with the characters voices. Although many sound effects sound slightly out of place and the OP & ED's don't seem to fit well with the anime, i think the sound was just fine.\\n\\n\r\nCharacters 6/10: Cliche? Not a problem. Uninteresting, predictable and unnecessary... kind of a problem.\\n\\n\r\nEnjoyment 6/10: I had fun for the majority of the episodes... the last few ones felt really rushed and made less and less sense with each passing minute. Needs a season two to clear things up and fix the story.\\n\\n\r\nOverall 6/10: Give this anime a go if you've got time to spend on a mediocre anime. It's nothing to awesome, but if you find yourself incapable of thinking then this anime might be the one for you.\\n\\n\r\nNot so brief review: Just the above with lots more words really. May contain some spoilers if you haven't watched episode 1 :3\\n\\n\r\nLets start with LE GENRE TAGS!!!\\n\r\nFirst up we have action, CHECK!\\n\r\nThen we have comedy, Check... nothing that will genuinely make you laugh, but you might crack a smile here and there.\\n\r\nNext up is Ecchi, check.\\n\r\nSCHOOL!!! Check!\\n\r\nShounen, a big fat check! \\n\\n\r\nLooks like thats covered. Some might want to add \"romance\" but i urge them to rethink that decision. \\n\\n\r\nSO! C3, aka CubexCursedxCurios, is an anime that stars Konata Izumi-errr- Fear Kubrick who is an ancient...box... Yes, a BOX. She is an ancient tool of slaughtery and murdery (those are, from today onwards, official words) who was sent to this boy-who-happens-to-be-very-good-and-cant-be-affected-by-curses-cause-hes-good-or-something by his dad. His dad is an explorer/adventurer type thing that sends him cursed items (like the BOX) so they may rid themselves of their curse. This is the story.\\n\r\nThats kinda boring eh? Well, no worries. Stuff happens. \\n\r\nHow does stuff happen you might ask... well... random people show up and cause random problems and then they get their ass handed to them. WHOA! How... interesting... Well... no. The problem with random people showing up is that the story doesn't progress on it's own anymore. Our main characters apparently cant provide the necessary drive to move on with the MAIN PURPOSE of whatever it is they are trying to do (removing curses from cursed objects like a BOX).\\n\r\nRandom people appear and force the story to move forward. Is that a problem? Not if it was necessary... Is it necessary? No... \\n\r\nI won't go on and on about this... The story has some very good potential that is wasted because it rushes a lot. For a 12 episode anime, rushing never solves anything.\\n\\n\r\nOk... lets leave the story for at that... ON TO LE CHARACTERS!\\n\\n\r\nLets start with the star of the show, Konata izu--- FEAR KUBRICK. Fear, or Fear-in-cube (said in english, not japanese. Pronounced Fe-a - een - Quu-beh) is a device, or box, of pain and suffering. She is good at killing stuff. \\n\r\n\"Hey stooorm!!! why do you keep referring to a box as she!?\" Well my dear imaginary reader, that is because this BOX has developed a human form... with emotions et al. Yes, she is practically a human.\\n\r\n So she is sent to this boy, yuuchi haruki, whom we will talk about later. Anywayz, so fear is a cursed object. She is sent to this boy so that she may live as a normal human and lift the curse. Her favorite phrase happens to be \"I'll curse you!\" Interesting character yea? Seriously, its actually interesting for 1 episode... how much does her character develop? not much... not much at all... BUT!!! shes the only one who really develops. \\n\\n\\n\r\nOk, now we have our good guy. Yuuchi haruki is a kid who cant get cursed. Whoooo. He's our sweety pie. Our needle in a haystack. How does he develop? Not in any particular way. His dad sends him cursed objects (i'd love it if my dad sent me any kind of objects, cursed or otherwise...) and yuuchi helps them lift their curse. Thats it. We find out why he indulges in his dads antics early in the anime and its nothing special, btw no info on the dad. \\n\\n\r\nNext we have Muramasa Konata. She is... well... take a look at her name, you'll know what she is. Oh, she is labelled as Ms. Cow tits by Fear... cause you know... her udder is easily accessible-ERR, her boobs are big. She is kind and likes yuuchi... Oh, she also has a slightly darker side that she shows to Fear... but theres a silly reason for that. Her character doesn't develop either. Really... thats it... the highlight of this MAIN CHARACTER is her tits. That is all... i guess big boobs do get you all the good jobs...\\n\\n\r\nSO, last character is the sadomasochist... she also likes a certain someone and helps him out. Shes starts off all secret agent like but then sorta gets closer and keeps less secrets. Does her character develop? Only if revealing secrets count. \\n\\n\r\nWe still have a few, just a few, more characters involved... but they are introduced fairy late in the anime for us to give a shit about.\\n\r\n They seem to want to play a big part in the story, but they just come in so late that we simply cant appreciate their company. This includes the baddies who appear and disappear randomly. Them baddies don't seem to serve any particular reason other than to agitate the story. Sigh... all in all, the characters aren't something you'd remember and think \"ah, arent they special\" in a good way.\\n\\n\r\nOk ok... ART TIME!!! \\n\r\nLE ART IS LE GOOD! Seriously, the art is nice. Movements are fluid, a nice number of backgrounds and a few scenes are very detailed and really add to the feel of the anime. Characters are nicely drawn, abit too moe moe, but still very nicely drawn. Weapons looks kinda funky, and it is that funkyness that prevents me from giving this a perfect score. They could have done much much better and added some nice variations... but meh, oh well. an 8/10 is still very very good in my book!\\n\\n\r\nSOUND TIME!!! \\n\r\nNot Le great... just good. Characters have a nice matching seiyuu that really helps bring them to life. I gave it a low score because i really didn't feel that the OP's & ED's matched the anime and the sound effects were really bland.  Nothing fantastic, but atleast its decent enough to not make me want to stick a pencil in my left ear. \\n\\n\r\nEnjoyment! Better off watching porn. \\n\r\nI managed to somehow enjoy this anime till it got near the last 3 eps. It felt like it was going to become a hopeless rat race to the finish... and it did. It really stopped me from appreciating all the work and effort, or lack thereof, put into the anime. \\n\\n\r\nFinal Score 6/10: I'd suggest you go watch this when your brain needs a break from all the thinking. If the anime just sort of said \"here deal with what is happening\" i would really not be able to even recommend it (that would be cruel) but since it actually shows us what is happening, it doesn't fail miserably. It could have been much better with a few more episodes... and i really dislike the horrible ending because they are just teasing us with more plot holes... they seem to want to make a 2nd season pretty badly... oh well... a semi-decent watch nonetheless.\\n\\n\r\nI hope you found my review helpful or at the very least enjoyable!\\n",
            "date": "2011-12-18T16:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 49515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/531955.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stormydays",
                "username": "Stormydays"
            },
            "url": "https://myanimelist.net/reviews.php?id=49515"
        },
        {
            "content": "Curses, curses, curses--there are certainly a large number of anime having centered their plots around some sort of curse, whether it be part of a major story arc or even the axis of which the story turns. So, what makes C3 (otherwise known as \"CubexCursedxCurious\") different from all the rest? Well, putting this as frankly as I can, C3 tries to make everything about its story center around the idea, methodology, and practice of curses, but instead, its brain-scattering plot, absolutely tragic pacing, and tired, stereotypical characters make what could have been an interesting plot into something degrading and lousy.\r\nStarting-off with the opening song, allI can say is that its appropriate enough, but very standard. It's a studio-done song, so, as one can imagine, Yukari Tamura, the voice of the main character of this show, is singing with musical accompaniment. However, while the opening song itself is fine, I can't say the same for the visuals; frankly, they're completely pointless, add nothing to the overall plot, and leave the audience in the dark as to what they're in for. I can only guess as to why Silver Link decided to do this: because they wanted to go for shock value. What sort of \"shock value\"?\\n\\n\r\nHere's the long answer:\\n\\n\r\nFear Kubrick is a cubic entity that has been used for generations as a tool for torture and killing; she is essentially the active hive for torture devices and cursed objects. Understandably, after seeing so much pain for as long as she's existed, Fear wishes to simply live among the humans--not as a killing machine, but as a kind, gentle person who gives back to others with respect. Haruaki Yachi is one such person who can help Fear to reach her goal, as she is quite literally delivered at his doorstep (initially, in her cubic form); he holds a gift that allows himself to be unafflicted by curses. However, Fear's journey to enlightenment will not come without its fair share of trials and consequences, as not only are there deadly organizations that wish to utilize her power, but there is also the berserk nature inside herself that is always pushing to come out.\\n\\n\r\nBut, for anyone who doesn't care for any of that, here's the short answer:\\n\\n\r\nFanservice, fanservice, fanservice--oh, and there's some fighting, too! The fighting's pretty neat--oh, and there's some blabbing about curses and pretentious bull, but that's not important. Ooo, look! There's lots of blood and gore and yandere-type crazy faces mixed-in as well! I know certain Higurashi fans out there that will love this!\\n\\n\r\nAs for the cast, there's Fear, the sorta-kinda-tsundere cube girl, Konoha, the glasses chick with huge knockers, and Haruaki, the chillin' dude with a heart of gold; there's also Kirika, the class president who--and I must admit--isn't really all that important to the story, except for maybe one or two episodes, but certainly not the conclusion. Anyway, I'm glad to see that the cardboard cut-outs are all accounted for, and if that's not enough, there's plenty more of them later on--more breasts, a loli, MORE breasts. Perfect./sarcasm\\n\\n\r\nYes, one of the issues with C3 is that it can get extreme in many departments--with its violence, with its drama, with its fanservice; but, that's just the one brick in this cubic disaster, as this leads me to explaining the show's true issue. I can deal with some violence, I can deal with sappy drama and ridiculous amounts of ecchi service, but what is it that makes this whole show really fall to pieces?\\n\\n\r\nC3's pacing is ATROCIOUS. Period.\\n\\n\r\nThis show doesn't know what it wants to be, and even when it does, it's all over the place. Sometimes, C3 is a cute, adorable, light-hearted, romantic-comedy romp--as with its first episode; other times, C3 is a bloody, gruesome, violent, dramatic mish-mash of pretension and battling--as with its second and third episodes. If all of those descriptive words were too much and/or too sweeping in terms of genre, that's my point exactly. In fact, to hammer this point in even further, take a look at MAL's genres listing for this show, and then take a look at its rating. Doesn't really mesh well, right?\\n\\n\r\nNot only that, but the speed of which this anime attempts to cram its plot together in twelve episodes is astonishingly bad; understandably, this can be a somewhat prominent issue with shows that are twelve episodes or less due to time constraints, but C3 takes the problem leaps and bounds forward. The show goes through three, separate villains; a number of extensive fight scenes, some taking at least half of an episode; full episodes devoted to \"rom-com\" material; several-minute-long comedic scenes; time spent on philosophical dialogue; flashbacks, back-stories, and long, expository monologues--\\n\\n\r\nPhew! Give me time to breathe, please!\\n\\n\r\nGranted, if the show hadn't gone for blatant sequel-baiting at the end of its run, I would have just chalked this up as Silver Link trying to fit too much material from the original light novels into too little time--for example, sort of like Chaos;Head. Unfortunately, this is one of the worst offenders I've ever seen of becoming a completely crushed and compressed product, but that's only about four-fifths of this cube analogy. What about the final piece?\\n\\n\r\nFor those who don't know of Silver Link's origin, here's a little history lesson:\\n\\n\r\nDirector Shin Oonuma, the director of both the much-beloved Baka to Test and this, once worked as a director of many of the earlier projects in another studio--SHAFT, which is now famous for their much later work, such as Zetsubou Sensei, Bakemonogatari, and, of course, Madoka Magica. He eventually split-off from them to help form Silver Link, but my guess is Mr. Oonuma knew the guy who did the trippy, layered artwork used in all three of those shows and decided to replicate what he had seen to be used in one of his own anime.\\n\\n\r\nIn fact, why stop there? Why not just be like SHAFT entirely, using all sorts of weird, seemingly out-of-place imagery? Apparently, Mr. Oonuma didn't understand the imagery he had seen in SHAFT's latest work, and the result was... well, even more things for me to complain about, in terms of this show not knowing what it wants to be.\\n\\n\r\nAll sorts of symbols are used, different art styles can be seen--heck, they might as well even use the old-style camera start-up trick that SHAFT has used a lot at the beginning of several of their anime (including Zetsubou Sensei, Vampire Bund, Madoka, etc.). None of this is able to stand up on its own, though; it just makes C3 look like its going for gimmicks rather than actual substance.\\n\\n\r\nNonetheless, I can safely say that when the art is normal and without any of the gimmicks, it's actually pretty visually appealing; it's colorful, it's cute, and keeps what would have been an otherwise even worse show from being completely disappointing. The soundtrack, too, does its job and isn't all that bad, but it isn't all that remarkable, either.\\n\\n\r\nWithout making this review much longer, I will conclude by saying that if the pacing wasn't so incredibly distracting as being the absolute worst item about this show, C3 would at least be mediocre. Heck, Fear is actually demoted from the main heroine to comedic relief after just over two-thirds of the series is up; because of this and everything else I have already mentioned, the pacing is simply inexcusable. C3 tries so hard to be something memorable like its older sister, Baka to Test, but it falls short of nearly every target; the story is too jumbled, the characters don't bear any staying power, and it overshoots by aiming arrogantly in the face of what made series prior to its creation work so well. What? Did a child write this?\\n\\n\r\nPrecisely, C3 is the equivalent of a kid who thinks too highly of himself and steals candy from adults instead of babies within the anime world; it just ends up choking on some Sour Skittles just before getting a good slap on its bottom. Now, if I could be excused for a moment, I have a Rubik's Cube to go play with~",
            "date": "2011-12-18T09:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 49481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BL2W",
                "username": "BL2W"
            },
            "url": "https://myanimelist.net/reviews.php?id=49481"
        },
        {
            "content": "Short or mid size reviews are best, nn tl;dr.\r\nOnce again we are rained down upon from the Japanese animation industry with a new series of adaptations and stand alone projects. The last few seasons we were graced by some greats such as Ano Hana, Steins Gate, and Usagi Drop; shows that showed nothing special but proved themselves with a above excellent plot scheme or brilliant story telling. I have to admit im still in the phase of watching anything that looks remotely interesting in each new season line up and I can say I have had some negative and positive experiences.\r\nC³ - CubexCursedxCurious was aseries I put my eyes on this season just because I needed to fill the void. My first impression was that this was just another ecchi/shounen combo(these rarely work out) but as the episodes went it progressed. Although the series itself is not finished it does have potential to become a decent show. My rating for this is open book mainly because a series can really only be rated at the following points: Beginning, middle, and end hence so many drops at the start air of any show.\\n\\n\r\nStory wise there is no evidence of any real exposure of full plot, this looks like it may follow a traditional plot sequence and I hope it does. The art is more computer look a like with the cube animations that are thrown in, minus the boob bouncing or slashing events its nothing that I would consider special. The sound effects are generic and bland, of course sound is I mean we hear so much everyday its impossible to filter everything out. The characters again are nothing special minus Fear Cube which really is the only thing keeping me gripped while I watch this.\\n\\n\r\nIf you like being first in line for a show you might just pick this up, but be warned do not expect greatness until its finished.",
            "date": "2011-10-28T12:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 46375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=46375"
        },
        {
            "content": "For a long time I have had an odd relationship with the anime \"C3\" also known by the much longer title \"CubexCursexCurious.\" It took me three tries to actually motivate myself to watch this anime: on my first attempt a year ago I managed to make it through the first 3 minutes of the first episode; then on my second attempt a month later, I made it through the entire first episode; and then, just this past week, I managed to watch the remaining 11 episodes. My conclusion, C3 has one of the absolute worst and most misleading first episodes of any show I haveever come across. Not that the anime really improves much throughout the rest of the show, but it's at least a slight improvement.\\n\\n\r\nWhat the first episode implies that this show will be is a very lighthearted, ecchi, comedic (albeit idiotic and not funny at all) anime about a humanoid weapon (who of course looks like a young girl) as she discovers the wonders of the human world from television to the warmth of human interaction. Episode 3 turns the entire lighthearted atmosphere upside down and shows that this anime can also have a VERY dark atmosphere at times. However, the show is inconsistent with that atmosphere and it comes and goes so much that it loses most of its effect.\\n\\n\r\nAnyway, onto the story. The show begins with our generic \"help everyone else before myself\" protagonist named Haruaki (voiced by Yuki Kaji). One day, an odd package from his father arrives at his house where he lives alone. This box is no ordinary box as it is impenetrable and baffles Haruaki to the point where he just decides to leave it alone. But, the box ends up turning into our flat-chested, energetic female protagonist named Fear. Haruaki then proceeds to go through the fastest acceptance of a strange supernatural girl appearing at his house I have ever seen. It makes some sense since it turns out that his tsundere childhood friend, Konoha, is also the same kind of \"cursed weapon\" as Fear. The rest of the first episode consists of Fear being left alone in Haruaki's house while the other two go to school (what a great idea) and it just follows Fear as she discovers different things about the world.\\n\\n\r\nAfter that, the actual plot begins and we find out more about what Fear and Konoha are and about the curses that go along with them. However for a reason that is never explained, Haruaki is immune to these curses which allows him to fight with Konoha (who can become a sword) without suffering the consequences like most people would. The story never really focuses on one objective and in the end, is in dire need of a second season as it keeps introducing characters right up until the end credits of the last episode. The different plots tend to focus on different characters like Fear, another girl who is Haruaki's class president named Kirika, and a few other minor characters who aren't Konoha because she never gets to be a focal character despite being a main character. The series also has very poor villains who only stick around for a few episodes at a time and more annoyed me than anything else.\\n\\n\r\nThe animation and soundtrack are some of the better aspects of this show. The first opening is actually what interested me in the anime originally (before the first episode killed that interest twice) and the first ending is a beautiful ballad which stands above most generic ballad ending songs in my opinion. The show switches openings and endings later in the show (despite this being only 12 episodes) and neither really impressed me as much as the first ones. The second opening puts focus on Kirika rather than Fear despite that never actually happening in the show.\\n\\n\r\nThe characters' designs are good but none really stand out all that much. Fear is your typical flat-chested girl, Konoha (aka \"Cow Tits\") is the busty girl who Fear envies, and Kirika looks like your typical \"mature girl\" on the \"outside.\" The characters also wear their school uniforms about 75% of the time. To top it all off, I have no idea why they would have a villain who wears clothes that make her look like a nun (she's not one in case you're wondering), but they did. Most of the action scenes look great, especially the VERY dark ones, however, there are some moments where things (like smoke in the background of a fight) seem a little awkwardly animated. There are also some moments where the show tries its hand at some more surreal animation tricks like making a clock tick and appear every so often during a speech or showing a character on a white background with only their shadow around them. I generally like things like this, but this show did not know how to time them correctly and they just ended up as random moments where the animation sometimes even contradicted how the characters were feeling.\\n\\n\r\nThe soundtrack, aside from what I mentioned before, is good but nothing outstanding. It's pretty forgettable especially during the lighthearted scenes and only makes itself noticeable during some of the darker fights.\\n\\n\r\n\"C3\" is a great example of an anime that didn't know what it wanted to be. It tries to be a lighthearted high school comedy, a VERY dark psychological action story, a story about how humans really aren't as bad as they may seem, a story of redemption (which ties into the dark one as well), etc. It introduces and then moves on from its poor villains.....I would say too quickly for development but I was glad when they were finally gone. The main characters have hardly any development, the \"behind the scenes\" organizations are never explained, what exactly these \"cursed weapons\" are and why Haruaki is immune to their curses are never explained, and the show ends crying out for a second season by showing a few new characters right at the very end. Considering it came out two years ago and doesn't seem to be very well received, I do not expect it to receive a second season. On that note, I would recommend passing on \"C3,\" and only watch the great first opening and ending if you think you can avoid getting interested in watching this way below average anime.",
            "date": "2013-11-17T22:49:00+00:00",
            "helpful_count": 10,
            "mal_id": 120667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=120667"
        },
        {
            "content": "If you like cute character,a little bit of harem story,and romance included with some actions, this anime is perfect for you. I recommend you to watch this show.\r\nStoryline:\r\nAt first glance, I can predict what will happens next to Fear Kubrick as the story is alike \"Dragon Crisis\".Some sort of crazy power hidden in the main protagonist (Fear Kubrick) then there is battle scene and I think it is a story with a lot of theme variation and it was good for a story. The story started with a peaceful scene which is enjoyed to watch,and there is no lines that could make you confused atall.\\n\\n\r\nArt:\\n\r\nI think the art is extremely good,I give 9/10 for it. You could notice some catchy effect in the episodes,I thinks its new for me.Furthermore, the art is the major succes factor of this anime since it has a lot of unique animation variation packed throughout the anime.\\n\\n\r\nSound:\\n\r\nUmm,The sound. As long as I enjoyed the anime,the sound must be good as well.Right music choices and some pianos melody all placed in the right scenes. But the things that interest me the most is the main theme song of the anime \"Endless Story\" by Tamura Yukari(Fear Kubrick voice actor).\\n\\n\r\nCharacter:\\n\r\nIf you're fan of short female protagonist,such as Shana(Shakugan No Shana), You will definetly love this anime as well. Male Protagonist, has some sort of cool character,caring and so on.Fear Kubrick is cute (In my opinion),and her action is such a normal kid,loves to play,naughty and so on.\\n\\n\r\nEnjoyment:\\n\r\nAhh...I really enjoyed this story. Look for yourself.\\n\\n\r\nOverall:\\n\r\nThis story reminds me of Kugimiya Rie anime characters,Shana,Rose,Louise and Nagi but this time,Its  Tamura Yukari Turns. I'm sure you will love this anime, and I dont want to talk much more,just watch it and feel free to tell me how is it!\\n\\n\r\nP/S: This review based on my own understanding and all from my perspective.",
            "date": "2011-10-20T08:22:00+00:00",
            "helpful_count": 9,
            "mal_id": 45887,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/311464.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kazuyasan",
                "username": "Kazuyasan"
            },
            "url": "https://myanimelist.net/reviews.php?id=45887"
        },
        {
            "content": "C3... At first i thought it would turn out to be yet another generic harem/ecchi anime. Well, it still turned out to be a generic harem/ecchi anime (in my opinion), but the direction it took really surprised me.\r\nThe first episode did not set a very good base for the whole series. It felt nothing like the other 11 episodes that followed. My first thought when i saw episode 2/3 was \"What the heck?? Oh god is this going to turn out like Elfen Lied or something?\". Well with Elfen lied, they atleast had the decency to show just how whacked out the series was inthe first episode. C3 hides it until around the third episode which is very misleading and just bad planning in my opinion.\\n\\n\r\nThe only reason i even gave this anime a shot was because i didn't have that many new anime that i wanted to watch. I was already hesitant to continue after the first few episodes, but i went and finished the whole series anyways. Let me just say that it was more or less what i expected it to be, boring and full of fanservice (not in the good way).\\n\\n\r\nThe art is probably the only thing that stopped me from dropping this anime after each episode i watched. The fight scenes were pretty well done (especially the last one). It was really good of course because the studio that made it was Silver Link (Baka to test ftw), but it is quite sad when that is really the only thing keeping the viewers from dropping it.\\n\\n\r\nThe music was nice as well. The opening song , Curios, was one of those few openings that i wouldn't skip over every episode. It was nice and soothing, and the OSTs were pretty well done as well.\\n\\n\r\nThe characters... there is not much to say about them. They stay pretty static throughout the whole series and are quite boring. If i had to say, the two most interesting character are probably Kirika Ningyouhara (side character/part of the harem) and Peavey Barowi (pyscho villain). Interesting does not mean i like them though.\\n\\n\r\nWhen i first read the synopsis for C3, i thought it was quite interesting. It was still a bit interesting when i watched it, but i felt that it was very badly portrayed in the anime. I find myself forgetting what the story is about from one episode to another. In the end, it seems like they just wanted to rush through and finish the anime. \\n\\n\r\nThe ending left me very unsatisfied and i felt like i just wasted a few hours of my life. They were probably trying to get people to read the light novel, but i probably won't be doing it. This show overall did not keep me very entertained with its mediocre story line, but it was still decent enough for me to push through and finish it. I would recommend watching this only if you have nothing else to do, or if you are very Curios about it.\\n",
            "date": "2012-09-01T13:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 71349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=71349"
        },
        {
            "content": "Goodness gracious, this is one delicious shit sandwich... Might as well get right down to it...\r\nStory - 4\r\nI'm not sure what the damn story is. This is just one of those animes, packed with such random shit and dialogue, to make sure it looks as dramatic and dark as possible. Gimmick here Gimmick there. It manages to leave me feeling like an idiot, wondering whether I was too stupid to understand what it was trying to tell me or that it really wasn't trying to say anything at all. It's a mess, a big mess. It confuses you...\r\nIf you're looking for a good plot, goelsewhere. You have better chances of being served a Big Mac at Burger King for your retarded ass.\\n\\n\r\nArt - 9\\n\\n\r\n\"Well at least the art was good.\"\\n\\n\r\nThere it is. That excuse. And yes, there is absolutely nothing to say against it. I watched this crap for the art. Boy was the animation spectacular. Random yes, interesting? Of course. Awesome compared to the garbage art I've seen in my day. At least it had this.\\n\\n\r\nIf they only had put as much effort into the damn story than they did the art. I would have agreed to have middle grade art in exchange for a good story, that made sense.\\n\\n\r\nSound - 6\\n\\n\r\nAll that noise... OP and ED, did not capture my interests nor my attention.\\n\\n\r\nCharacters - 6\\n\\n\r\nShallow, underdeveloped, unrelatable. You won't be crying if any of them died. Nope, not even the slightest change in facial expression. Sure I kind of liked some of them, but not enough to go into detail in this review.\\n\\n\r\nAlright... one word. Bondage.\\n\\n\r\nEnjoyment - 5\\n\\n\r\nI was wiping the drool off my table every time I finished an episode. Not because I was too engrossed to keep my mouth closed, but because I did not give a shit about what happened next and was blankly staring at the subs waiting for it to end or for something interesting to happen.\\n\\n\r\nOverall - 5\\n\\n\r\nRemember that sandwich I mentioned at the start of this review?\\n\\n\r\nThe art was good, but now that I think about it, there really isn't such a thing as a delicious shit sandwich is there? Good art or not, I have other animes piled up that are willing to and able to give me more, for less suffering.\\n\\n\r\n-------------------------------tl;dr?-------------------------------\\n\\n\r\nDo not waste your time. Unless you want to appreciate the art with a Blue Ray copy which I feel is a complete waste of resources in itself.",
            "date": "2011-12-23T07:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 49911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=49911"
        },
        {
            "content": "This is just my first impression based on the first episode, so my opinions on this series are subject to change.\r\nSo in the first episode our protagonist Haruaki Yachi is sent a box from his relative, which can transform into a beautiful tsundere girl. It's then revealed that she is basically the living manifestation of the negative emotions people give off, which might explain why she is tsundere in the first place. \r\nOk...I'm interested.\r\n  I don't really think that one can get an overall feel on what the rest of the anime will be like from just the firstepisode, but that's not to say you can't get anything from it. From this, I've taken it that the plot is unique from others, and therefore, I'm interested. I mean, it's not everyday you hear a show has a girl that can transform into a box. \\n\\n\r\n   The artwork and animation is also praiseworthy, much better than I expected, even. It's graceful animation and colorful backgrounds are pleasing to the eye.\\n\\n\r\n   The sound effects are nothing special, but nothing bad either.    \\n\\n\r\n   The characters, however, are what make this review suffer greatly. There is nothing from them that makes them stand out because they are overly cliche types that can be found in many other animes. The childish-but-in-a-cute-way tsundere. And the pushover male lead who puts up with her, and conveniently lives alone. The only character who has some depth in their stereotype in Yachi's friend Konoha. She appears to be just some other \"glasses-girl\" type of girl who is kind and caring toward him, but she can also be quite the snappy kind of girl, who won't hesitate to make a remark back when insulted, but it seems she's won't even be a lead character.\\n\\n\r\n   Overall, so far I'd give this series a 7/10, because of the interest it's peaked in me with it's art and plot, and because of the overly used elements. I'll continue to view a few other episodes and see if it's something that can use it's potential to the fullest, or be another anime that's so focused on being cute, eye candy that it sacrifices the storyline.",
            "date": "2011-10-02T18:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 44699,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485956.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Undercover_Otaku",
                "username": "Undercover_Otaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=44699"
        },
        {
            "content": "C3 is the next anime in the line of what I'd call \"Shana Clones\" mainly because of the tsundere lolicon lead and the overall formatting. Likewise, it's very similar to Dragon Crisis.\r\nThe story consists of Yachi Harukai, a boy who is supposedly immune to curses, finds a mysterious box in his house. He finds out it's really Fear Kubrick, a cursed tool. After a talk he decides to lift the curse from Fear so she can live a normal life. More characters are introduced and it becomes kind of like a harem, but without any real romantic feelings. \r\nThe show is presented in short arcsconsisting of 2 or 3 episodes. Each one has a new antagonist that the group has to defeat. One of the issues with the series is that there is almost no continuity with the antagonists at all. While almost all of them just want Fear (or to destroy her) but other than that you know nothing about their motives. \\n\\n\r\nAlso, while actually a great deal of lose ends are actually cleared up before the next arc starts, it's usually done through some of the worst dialogue I have ever read in an anime. At times they just go on after they cleared it up, something like a Soap opera.\\n\\n\r\nEach character has some past history, Yachi has helped decurse tools before, like his childhood friend Konoha, but we don't really learn anything about that. Likewise, the class president Kirika has a secret past, but we don't really learn much about that either. In fact, we don't really learn anything at all. Like, Yachi says he is curse immune, and it is kind of hinted he is, but we never get any proof of this. \\n\\n\r\nI will say that Fear had some parts (first episode) when she look very similar to Konata Izumi, like remember Yuripe from Angel Beats being purple haired Haruhi?\\n\\n\r\nC3 is dotted with fan service. But it's not arousing or funny, it's just kind of there. Fear is a loli, but there's an even lolier loli down the road where you get even more panty shots from. Konoha is also often referred to as \"Cow Udder/Tits\" And Kirika is often sexually harassed and also dons an \"interesting tool\".\\n\\n\r\nThere are fights too, but just about ALL of them end up being the exact same thing. Even Naruto who uses the same two moves basically in all his battles had more diversity. \\n\\n\r\nThe art and animation are actually decent, but that's really it. C3 was stuck in a season with a lot of impressive titles. The OP is nice, err it's basically a girl (Fear) dancing to some Jpop, but it has nice smooth animation. \\n\\n\r\nOverall I gave this a 1, which might actually be kinda harsh, but I can really see no way around it. It was hard to care about the characters, story, or really anything that was going on. C3 should have stayed in the box.",
            "date": "2012-01-10T23:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 51493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=51493"
        }
    ],
    [
        {
            "content": "C³ draws the viewer in with the overall concept and the interesting character ideas. This all falls flat in the long run and the show ends up leaving a lot to be desired.\r\nThe storyline for C³ starts off at a very nice pace. However, the plot then begins to drag. There was stuff that could have easily been cut from the storyline. For example, quite a few characters ramble on about their personal belief system, both on the good and bad sides. I think the viewer got the message the first time around. There was also stuff that could ave been added to the storyline,stuff  that would have added actual character depth to the various characters.\\n\\n\r\nThe art work is at first glance looks beautiful, because of all the colors used with in the actual art designs. The bright colors don't help to camouflage the faults in the animation. There were a few scenes that looked off in the proportions and perspectives. There were also times that an experiment would be thrown in, that wasn't consistent with the rest of the animation that had been going on, either because they became lazy, or because they decided to do something cool, rather then for real experimental reasons. There were also action scenes that just felt wrong. \\n\\n\r\nAs for the sound, I loved the opening and closing. The regular sound track though PALED in comparison to these opening and closing songs, to the point it felt like it was no existent.\\n\\n\r\nCharacter wise, every single character was interesting concept wise. However, the Anime didn't really add any depth to any of the characters. No, I have to take that back. The Anime did a good job of giving character depth to Amanda Carlot, also known as Mummy Maker. She was the only character I could feel anything. That may have something to do with the fact that everyone else was constantly angsting about stuff, or they were throwing tantrums, or they were indifferent. \\n\\n\r\nAs for my enjoyment, I had parts I enjoyed. I felt that there were things that took away from it, some of which I listed above. I thought the whole concept of Haruaki being a pervert was over dramatized. A lot of the misunderstandings didn't feel like misunderstandings, but more like the creator of the Anime was trying  to force them to be misunderstandings.\\n\\n\r\nOverall, this Anime is going to be hard for people to give an actual chance on. I mean, it has its enjoyable moments, and the characters are interesting. It is the kind of show that if the viewer isn't careful, it can grate on ones nerves.",
            "date": "2011-12-24T22:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 50061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=50061"
        },
        {
            "content": "I'm going to review this anime from episode 2.., why? Because episode 2 is when it actually starts. Please base your opinions, ideals, what you think, etc from episode 2 not the first one.\r\nI'm typing this down in a plead and as a begging to whoever is reading this and wants to try this anime, please try BOTH episode 1 and 2. When you watch episode 2, you'll understand why I'm asking you of this. The difference between episode 1 and episode 2 is like the difference between fire and water.\r\nI will now review this anime from the perspective of someone who just watched episode2 because I am that someone. If you do not want spoilers STOP READING NOW. I'm even suggesting to you, if you haven't seen the second episode, go watch it. Don't hate me if I spoil things for you, it's your own fault. :P\\n\\n\r\nP.S. Overall rating is to change as this progresses.\\n\r\nStory: It's pretty epic so far. At this point we learn the main character is nothing like he seemed in the first episode. He gave the impression that he's a nice guy and it had harem written all over him. Well.... think again because this guy KNOWS HOW TO FIGHT!. Their first enemy of the series has appeared and she's a nutcase. Fear came from a cube, this lady hates cubes, lady pisses Fear off and Haruaki doesn't take crap from no one. Thus we have one hell of a fight scene.\\n\\n\r\nArt: The art is nice, it's what I call 2011 art. They know how to shift the art colour according to what's happening. The first episode had colour, the second episode was more darker. There is also surprisingly a lot of blood in this anime. The animation is also really good. Fight scene was crystal clear, I never felt lost or put off.\\n\\n\r\nSound: I haven't heard enough BGM, that or nothing amazing has come out. I find Fear's voice to be a bit irritating at times. But on the second episode, I now love her voice. The voice actor for Haruaki is the same guy who did Subaru in 'Ro-Kyu-Bu!', but don't let that put you off. Because Haruaki is a badass compared to Subaru.\\n\\n\r\nCharacter: There's nothing to say here besides what I've already said. Also there's not enough episodes for me to type about character growth or learn enough about them. All I can say is everyone is surprisingly acrobatic.\\n\\n\r\nGoing to leave the last two out for several reasons.\\n\\n\r\nAnyways, the target audience for this anime may actually shift. The first episode seemed like it was asking for a harem, this may appeal to a certain type of audience. The second episode is more like an action/shounen/supernatural/ genre. \\n\\n\r\nBut yeh, I will say this now. If you are someone who watched the first episode and thought it would be all moe, loli, ecchi stuff and got put off. I beg you to try episode 2, you won't regret it. MAL even states that it is an action and shounen. Lets just say the action and shounen begins now.",
            "date": "2011-10-10T02:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 45225,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Keodara",
                "username": "Keodara"
            },
            "url": "https://myanimelist.net/reviews.php?id=45225"
        },
        {
            "content": "Boy meets girl. Actually, he finds her naked in his house. His female childhood friend is upset about it, but still despite that he takes the poor thing in. How cliché is that?\r\nWell, if that's exactly what you thought when watching the first few minutes of C3, you're pretty much entirely... WRONG!\r\nHaving seen some of the more popular series, I can tell which shows tend to be serious about their plots and which are really trying to ridicule the overused stuff. So here comes the shocking conclusion I've come to: C3 is in fact mostly a PARODY!\r\nWhen you realise that, you can cheerfully laugh athow the protagonist, Haruaki, is never even the slightest bit surprised about anything or how his friend, Konoha, instantly becomes hostile towards the stray metal-cube-girl: Fear, who has yet to learn what TV is and how a washing machine works.\\n\\n\r\nBelieve me, if you take on such a point of view and go through to the second episode... Its subtle style of parody mixed with pure epicness will blow your brains out. What's more – I have a strong feeling it's gonna get even better.\\n\\n\r\nDid I mention C3 also has a really pleasant visual style? Nice music and good voice acting?\\n\\n\r\nDo you actually need anything more to truly enjoy a show...?\\n\\n\r\nGive it a try and remember: it's not serious! It's comedy!",
            "date": "2011-10-13T11:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 45461,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/493999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kurisu666",
                "username": "Kurisu666"
            },
            "url": "https://myanimelist.net/reviews.php?id=45461"
        },
        {
            "content": "C³ (CubexCursedxCurious) has a lot of potential despite being an ecchi. The anime as a whole definitely could have been much better if it wasn't limited to being only 12 episodes.\r\nSTORY: 6.5/10\r\nThe story is based around the main male protagonist, Yachi Haruaki. He lives alone and away from his father who goes around the world searching for cursed weapons that have been used to kill. His father sends these cursed weapons back home to where Haruaki lives in which his role is to remove that curse and lead those cursed weapons who takes the form of a human onto a different path. He does thisby being optimistic, positive, and supportive of these characters in how they want to change who they previously were while putting his life on the line.\\n\\n\r\nFear Kubrick is main female protagonist that is first introduced as a cursed weapon. She has two personalities; one being her past killer self and the other being her regretful, self-conscious self. She is timid, but also aggressive most of the time. While she may not show it, she is really concerned about her friends especially Haruaki. \\n\\n\r\nAs the story progresses, more characters are introduced, and relationships develop between them and Haruaki. \\n\\n\\n\r\n~~~~~~~~~~~~~~~ story/plot viewpoint ~~~~~~~~~~~~~~~\\n\r\nI may have not seen the all the episodes of C³ so my opinion might change, but I do know where the anime is heading. The exposition of the story started off really well in the first episode, but then it completely changed its course in the second episode. The change was so drastic that I felt it was really difficult to actually grasp the idea and concept of the storyline. The setting and characters were barely introduced and yet we have already arrived into the rising action of the plot in the second episode. The problem could have been easily remedied if the producers had extended the amount of episodes for better development to the plot.\\n\\n\r\nART: 10/10\\n\\n\r\nThe art is stunningly beautiful. My jaw dropped as I was watching the first episode; the ocean currents sparkled and the sky glimmered. The graphics in all the scenery, battles, opening and ending (EVERYTHING) are of the highest quality. Although I am not a fan of ecchi, the art makes it acceptable and respectable. \\n\\n\r\nSOUND: 9/10\\n\\n\r\nThe voices of the voice actors fit the characters really well. The opening and ending songs are accompanied by the dazzling art. BGM and sound effects were all used effectively and at the right time.\\n\\n\r\nCHARACTER: 7.5/10\\n\\n\r\nThe main potential of C³ lied behind the characters, but with the short amount of episodes, we were limited in character development. Most of the main characters' background that was portrayed in the anime were shown in one episode or less. The changes that they all undergo happens far too quick in which it leaves the viewer filled with unanswered questions. This contributes to a lack of a good plot which narrows down to poor overall development between the story and characters.\\n\\n\r\nENJOYMENT: 7/10\\n\\n\r\nI didn't quite enjoy the plot, but most of the other aspects of this anime were satisfying. I would recommend it to a friend who has time to run through an ecchi anime that has a few holes in its plot and semi-poor development.",
            "date": "2011-12-12T00:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 49029,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1051657.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/risecant",
                "username": "risecant"
            },
            "url": "https://myanimelist.net/reviews.php?id=49029"
        },
        {
            "content": "I watched C3 on a whim. I figured it was something that would pull in my attention and keep me on the edge of my seat. This, however, was not the case in the end. I no sooner started when I realized that it was almost over and I had no idea where the story was going.\r\nThis is spoiler free outside of general anime plot formulas.\r\nI also want to make this quick and easy to understand for those that might want see this show and not know what to think from the cover. I'm also very easy when it comes to animes, so keep thatin mind.\\n\\n\r\nStory: 5\\n\r\nI really find it hard to see a logical decent story unfold within 12-13 episodes. This is the case once again. It's not that the plot was something mysterious from the get go, rather it was to much to explain and prepare the audience for. Where some shows give you every detail of the situation in great length, this show tells you to grab a combat knife and barrel roll out of a moving vehicle. In the end, your half confused and half bored but you wish you weren't. \\n\\n\r\nArt: 9\\n\r\nI'm a sucker for eye candy animation and this show has it. The artwork is well above par for my standards and helps me coast through each episode. It's a shame that the plot isn't as interesting as the art is wonderful.\\n\\n\r\nSound: 4\\n\r\nThe sound was nothing more than average. You pick up on it only in certain situations. \\n\\n\r\nCharacters: 4\\n\r\nCharacters make a show sink or swim, it's that simple. The group that you'll watch in this series is nothing more than mediocre. I really believed that the characters would get better and make things much more entertaining but no. The male character is as bland and boring as ever, with no intention of romance. That's the best I can say without spoiling anything. As for the girls in the group, they are much better to watch. They have a stronger presence than the male character. You'll notice pretty quick that the women make the show worth your time, but not by much.\\n\\n\r\nEnjoyment: 4\\n\r\nI was very \"with\" the show from the first few episodes. Once again, spoiler free. Some characters show a truly dark side and with battles you could die for. We're talking grade A material that tweaks one's mind. Remember though, I said the first few episodes. Its predictable and bland once a certain point is reached. Sadly enough.\\n\\n\r\nOverall/Conclusion: 5\\n\r\nThis show was absolutely something different than what I imagined. I will be more cautious in the future as a result. Nevertheless, this show IS pretty and the story maybe too much at times. I wouldn't recommend this if you enjoy any kind of left over feelings from emotional anime's because there simply aren't any. Some may find this fun and passes the time by but other may see it as a waste of time. This is just one of those kind of shows.",
            "date": "2013-11-06T16:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 119513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3309037.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/finalchance531",
                "username": "finalchance531"
            },
            "url": "https://myanimelist.net/reviews.php?id=119513"
        },
        {
            "content": "i'm just going to get straight to the point, i rate anime mostly based on enjoyment, because keeping you entertained is the primary objective of any anime so there for i'm going to rate this anime quite highly.\r\nas to why i enjoyed it i just like the genre of action mixed with eechi, but not too much eechi.the character are well drawn, and the art was really good. the action scenes were done very well and the comedy was quite good as well, the cabbage master thing was priceless. the dialog was really good as well, as in it fitted the tone of scenes perfectlyand the opening and ending songs was good. i liked how prevy kept saying \"bitching\"\\n\\n\r\nbut i could totally understand why some people don't like this anime, i mean seriously in terms of seriousness and comedy it swing from one side of the spectrum to the other. one minute you see some fear grabbing cow tis' breasts, the next minute you see prez getting every single one of her bones broken. another thing is there are just way too many factions, i mean seriously there were about 4 factions in a 12 episode anime and thats not counting the sovereignty doll.\\n\\n\r\nthe plot was really confusing, mainly because the series was way too rushed. the sovereignty arc was really perplexing. the characters was pretty cliche as well.",
            "date": "2011-12-19T16:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 49593,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/844297.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/I_Am_Awesome",
                "username": "I_Am_Awesome"
            },
            "url": "https://myanimelist.net/reviews.php?id=49593"
        },
        {
            "content": "The story was very hurried and rushed, especially in the first episode or two. You don't really get any emotions towards the characters because of this and the reactions of the main character are cliche, BUT the artwork where she goes insane and the evil laughter and other sounds are great. The artworks enters a more non traditional view during some back stories of some of the characters. This is an anime where you can skim and just watch clips because otherwise you are not really utilizing your time well. \r\nOverall if you want a silly or ecchi artwork, this may have a little bitwhere you see a bit of seduction between some of the female characters, especially later on in the series.",
            "date": "2017-01-23T21:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 238996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1935464.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sakurauchiha14",
                "username": "sakurauchiha14"
            },
            "url": "https://myanimelist.net/reviews.php?id=238996"
        },
        {
            "content": "To be straight forward, I regret ever watching this anime. it was a huge waste of time I could have been spent watching something more sensical. Anyway, why did I say that this is a bad anime:\r\n>Characters: unexplained why they are like that and their origins. personalities and traits are unclear too.\r\n>Story: I can't find it anywhere\r\n>Stupidity: too damn high, count the number of times an enemy got away because they are busy with senseless chatter and really, the characters decisions defy logic itself.\r\npiece of advise, if you like anime with good plot and likable characters, don't watch this anime",
            "date": "2013-06-01T15:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 99363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2647541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/keiina",
                "username": "keiina"
            },
            "url": "https://myanimelist.net/reviews.php?id=99363"
        },
        {
            "content": "C³\r\nEver heard about the ''cliché harem anime's which are utterly annoying''? most harem anime have no progress, no real story and are mostly pushed forward on fanservice and very lame humor.\r\nC³ right here, screams to all corners of the world; ''YES WE CAN''. Rather overwhelming the viewer with images you would hide from\r\nyour family and friends, and almost start crying NOT because of seeing a scene of Clannad but because the humor is SO bad, you should just take this from me; C³ is for the people who have been vomiting their last reserve of useable ''clear mind'', and just CAN'T enjoy harem any longer.not a lousy backstory, not a lousy intro and give a reason ''WHY'' he meets that person. he's just thrown in the situation after 2 minutes, without any explaination why and what. it's just a story stripped from it's ''expected'' lousy and lame moments. \\n\\n\r\nFrom the normal anime where we get told why and where the girl comes from (see: random cliché anime), we just simply skip that part and get thrown into teaching the girl that roasted tea fits with rice crackers. No sentimental reason, no why or what's. Only that she was a gift sent from his father, which doesn't get explained either. Practically, you can compare it to the food being chewed for you or just given to you and you need to sort out how to eat it. you'll eventually get it swallowed anyway. Some might hate it, but i'm sure most will love it. It's a harem, so why not make the best out of it? this show has no dignity; no hiding... no shame at ALL.\\n\r\nIf it changes to fan service, it's REAL fanservice. if it changes to action and gore, it's REAL action and gore. if it changes to humor, it's REAL humor. It's like the company wanted to show that not every harem is mostly lame, and shout ''YES WE CAN'' over the roofs. The anime has alot of very light hints to the plot,\\n\r\nand some might say ''there weren't any''. I'm sorry, but with some anime you need to pay attention, and this is one of these. For the co-reviewers; a big flip off for you sir!\\n\\n\\n\\n\r\nThe start and background story are simple: Guy receives a box from his dad from a far away country, as the box reacts on his touching.\\n\r\nthe box changes into a girl that appears 30 seconds later on the episode. The start is so simple, where is the story? Well, that's the development of the story. You could compare the progress as a Detective anime, where the answers all explode infront of you at the end. A simple, but rather genius way to gain content over the anime. Rather then trying to find new ways to explain a story in the category harem, Silver link decided to take the best ways to sort out, and strip away anything unnecessary. i could start spoiling about the story, but that's already tough not to since it's, after all, a harem(see; much fanservice, not alot of story). Just take it that this is one to watch if you love Harem in mix with Supernatural.\\n\\n\r\nArt.\\n\r\nThe Art director of Da Capo and Sakurasou no Pet kanojo; otherwords, the art is just as it should be. it's simple on the moments you see quick animations, which makes it easy NOT to turn out confused and get the ''what just happened'' feeling,\\n\r\nas on the more slow movement scenes you get a rich outlay of lots of details and background information, which also point out hints about the plot. subtle and enjoyable.\\n\r\n8/10.\\n\\n\\n\r\nstory\\n\r\n''Story? What story?'' Said the harem-critic. Yes. it's true that most Harem do not contain a proper story as with Clannad, Sword art online or Mirai Nikki. What you find in C³, though, is a much, MUCH darker story then you would expect in the first place. It's easy going, and is thinned over the action, comedy and fanservice.\\n\r\nBut, here's the cookie(i will give you one later): it's not overused as in most Harem. Most people combine Harem and Ecchi together, as this one clearly does not use the overused lousy attributions,\\n\r\nbut makes it actually enjoyable for people. it's a bit dissapointing that they DO try to spread their story over too many themes, which can be a utter failure for some fans.\\n\r\nIt is, and always be, a harem.\\n\r\n7/10\\n\\n\\n\r\nsound\\n\r\nnothing wrong with the intro theme. it's good music combined with a utterly fancy Video. same for the music trough the anime as it has plenty music for different scenes. The ending theme is Okay. nothing special compared to the Intro and music troughout the anime. The voice acting is pretty decent, but mainly Yukari Tamura, the voice-over of Fear, is extremely well done. the high pitching voices in the cute comedy scenes but the maniacal voicing in the action scenes really make you shiver.\\n\r\n8/10\\n\\n\r\ncharacters\\n\r\nwe've got Haruaki, the main guy which is just being dragged everywhere in the first place but does contain character development, but mainly leads the other main characters in changing personalities. he's just the joker in the show, what is one of the main characteristics in random harems. sad they did copy this, but else it wouldn't be a harem theme. next to that we have Fear, the main female Protagonist, which has a dark curse, and wants to lift this to finally be relieved of her duty; which i will NOT spoil. She's a shy girl who screams ''i'll curse you'' on the moment she's brought in embarressment. cute, but she also contains a very dark and murderous side. As last we have Muramasa, first introduced as the neighbor friend of Haruaki, but contains a hidden power to change in a deadly weapon of justice; which Haruaki can handle to atleast defend himself against dark and magical opposers.\\n\r\nthe characters in general all contain something interesting; although they do not go far into their past, they all are explained just enough to follow the story. there isn't more information necessary to delay the story, because there is just enough content to change the personalities and ways how to act in the characters.\\n\r\nThey are just stripped from information no one really gives a damn about. Thats why, suprisingly, it's more entertaining and rather refreshing then most Harems.\\n\r\n7/10\\n\\n\\n\r\nenjoyment\\n\r\nIt is and always will be a harem. The difference is that this one KNOWS it's a harem, and tries to expand those limits they all reach at some point. They accept the challenge to expand the theme and by this they came out of a unexpected corner and hit the watcher right in the face. they go beyond most harems, which scream out as they all show too many of this or that particular theme. Silver Link knew that this is the reason why Harems made a dive in ratings, and only the best survived. You only find Clannad, Freezing and kanon in those lists, while these are not even OFFICIALLY harems. That's why it's pretty sad this anime has not reached those rankings as they have the theme, and have the potentional to grow up in the harem ratings.\\n\r\nit's refreshing, funny and something else then the mainstream anime like Naruto and Fairy Tail.\\n\r\n9/10\\n\\n\\n\r\nWith this i'll end my review. i hope to see you next time ;)\\n\\n\r\n- Zumorito",
            "date": "2013-08-17T02:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 110031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2502999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zumorito",
                "username": "Zumorito"
            },
            "url": "https://myanimelist.net/reviews.php?id=110031"
        },
        {
            "content": "C3 (C \"cubed\") or also known as CubexCursexCurious. Is an Anime that's centered around a weapons that turn human (sound's familiar... ) these guys are known as cursed tools. the anime talks about lifting curses and understanding. \r\nAlthough the concept seems nice, i warn you... this anime throws information out of no where so fast that you need to pause, think and process. you will find that there is information there that needs explaining, information that seems vital to the story. \r\nwith that in mind the character development seemed a bit hollow or somewhat feel somewhat empty... if a character was in trouble I feltnothing apart from \"oh, your going to be attacked...\", i reckon that the characters need more depth in order to do really make it shine.\\n\\n\r\nThe art of C3 is really good, the colours, the art style does that eerie effect that they might be going for. the cute characters design and  weapons where very nice. I do warn you though does contain a little ecchi scenes\\n\\n\r\nAll in all this anime is a decent watch is you are a lover of mindless violence. I think this anime had potential if it was made right. It seems to me that they tried but it turn in to a bit of a flop. It may make more sense if you read the manga ( i didn't :x)",
            "date": "2012-12-05T03:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 79218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1857910.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/yuumega",
                "username": "yuumega"
            },
            "url": "https://myanimelist.net/reviews.php?id=79218"
        },
        {
            "content": "I'll have to say this in advance, while watching the first few episodes I've never been more annoyed at the word \"Bitch\", because of how often I heard it.\r\nPlease remember that this is my own opinion about the series and whether or not you choose to think well of it is yours to think. \r\nStory: I gave the story such a low score because the lack of luster it showed me, throughout the 12 episodes I found myself watching a circle of events followed by conflict and action, with little overall plot development. It was like replaying a level in a video game about 3times in a row. Besides the repetitive feeling C^3 gave me, there were some aspects that gave it it's own unique feel. So far I haven't met a concept where cursed tools are from the fault of humans etc. Yet finding that theme mixed in with ecchi and harem, well, IMO it didn't mix very well.It attempted to mix a harem like aspect of cursed tools that were used for killing somewhat attracted to the main character, who didn't stand out very much either. Still, this anime plot line had its ups and downs, which persuaded me to finish the series. \\n\\n\r\nArt and Sound: The art was pretty good, and I liked the music enough for me to put it on my \"to download and listen to later\" list. Conflict moments that included combat were displayed fantastically and animations for the \"powers\" each Waas/Worse/Cursed tool had were pretty cool. \\n\\n\r\nCharacters: As seen in standard ecchi/harem/highschool anime, the personalities of the characters were easily relate-able to similarly themed anime. The main character seemed as a more supporting role, and from each 2-3 episodes it centered around a different character but ultimately returning to Fear-in-Cube going through a similar circle of events. \\n\\n\r\nI somewhat enjoyed this series. I managed to suffer through the cliche'ness of it all. Which brings me to a SPOILER. What kind of last ending boss fight was that? Completely rushed and cliche, the ending resolution pushed the story score down the lowest I have ever rated in a series. But in some ways I was enlightened with comedy and action. (Shout out to Konoe and her camera skills, XD). For people starting to watch anime and haven't seen many like this I recommend you watch it. If you have seen anime similar to this one, I wouldn't really watch it unless you are looking for a time killer. Just to state clearly the main flaws I found were: The amount of cliche moments, the repetitiveness of the plot line, and the awkward mix of ecchi/harem with bloody cursed tools with traumatizing backgrounds etc. \\n\\n\r\nOverall, I wouldn't look down on this series too much, IMO I've just seen too many like it that are superior, and it bored me. If you were offended in some way, refer to my message at the top. But if not, have fun watching the series!\\n\\n\r\n-Sincerely, Nebarto",
            "date": "2013-06-21T20:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 101863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=101863"
        },
        {
            "content": "This show was thoroughly entertaining for a variety of--spoiler free--reasons. \r\nI will admit that the premise of a cube being one of the main love interests in a story is... out there.... But what I really liked about this anime is that it manages to meld action, gore, and an undeniable sense of cute fairly well. \r\nIt threw me off at times, but in a good way: shifting in tone RAPIDLY from lighthearted and cute, to dark and gory, occasionally multiple times in the same episode.\r\nIt touches on several difficult topics--humanity, murder, past sins, etc--yet still doesn't manage to come off as too edgy ortake itself too seriously, throwing in a decent amount of ecchi and lighthearted character interactions.\\n\r\nAnd I'm not really a connoisseur of art and sound, but I will say that they probably had a (rather large) hand in making those massive flips in tone seem almost seamless (in my opinion)\\n\\n\r\nstay crazy,\\n\r\nRijento",
            "date": "2016-12-27T00:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 236636,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5707780.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rijento",
                "username": "Rijento"
            },
            "url": "https://myanimelist.net/reviews.php?id=236636"
        },
        {
            "content": "CUBED X CURSED X CURIOUS REVIEW:\r\nMINDSET:\r\nYou should already know what's coming Your way once You see, “Light Novel Adaptation” popping up the back of Your hand, its either from the Cows Buttocks, or average stones.\r\nSYNOPSIS:\r\nC3 starts out in regular modern day Japan with our generic protagonist Haruaki, at one day he soon finds a  mythically giant black cube posted by Your local mail man, soon he notices that the giant cube can transform into female loli known as “Fear”. It was then found out that her cube can not only resize into the palm of her hand for plot convenience, but it can alsobe used as a tool of 100 torture devices. (BDSM style! Yay, kids!)\\n\\n\\n\r\nREVIEW:\\n\r\nWe all know that light novel adaptations are always aiming for “Mass Appeal” since that is the one thing that always tend to sell! (AKA: The casual audience) Consequently, C3   slightly “Differs” from this case as it is surprisingly good on paper. However, for me to summarise such issues, the show is also trying to also be ecchi, which has the tendency to break a show if it has a more mature, interesting and serious nature. This is no exception.\\n\\n\r\nDon't expect deep and complex villains. They are all completely lacking in depth, and are often just one liner character. Like is it ever in any way, shape or form that the first villain is just this random axe wielding  psychopath who keeps crying out “Bitch! Bitch! Bitch!” Every 5 seconds when she's fighting a woman will equal character depth and complexity? No!\\n\\n\r\nTropes are a thousand times more overused, and replicated. So (obvious fact) the light novel adaptation tends to carry: One dimensional villains? Check! Character Archetypes? Check! Tsunderes? Check! Fan Service? Check! Endings that leave one or more plot holes? Damn hell & Check! And  this is the biggest issue to be summarised with this show here, it feels far too much like a light novel adaptation, yet it has an interesting premise and a fairly good amount of potential to be a “Good Light Novel, with the Adaptation” Buuuut Your run of the mil light novel is bound to fail.\\n\\n\r\nSpeaking of fanservice, there is a bit too much fanservice to take this show onto more serious and mature levels. The fact that Kirka wears permanent bondage under her clothes will not mean as a symbolic reference of her sexual suffering and how she is trapped in pain unless if the show shuts up the fanservice, takes a serious look on the audience, and respects it like an actual man!\\n\\n\r\nThese kinds of concepts may look very nice on both paper, and in action if done in properly mature manner. However, its is simply lazy to take the risk, and create a potentially good and interesting show! For goodness sakes! The show is not even trying to make these concepts as interesting and thought provoking as it is meant to be, leaving it into Ecchi abyss...\\n\\n\r\nSilver Link doesn’t have many renowned or popular works, but its safe to say that the budget will remain very consistent for these 12 episode series, and C3 tends to have pretty above average Animation, the action scenes and cool powers they use create some pretty energetic looking battles. The colours they use all have a nice shiny finish to them so everything is all nice and colourful. The character designs aren’t anything to be especially proud of, since there quite generic and only the female designs only stand out.\\n\\n\r\nThough I think Silver Link is trying to copy SHAFT STYLE at certain points, but I don't really think its ever overused as much as Shafts own work. Though I don't think it really ever gives out extra points for that since those moments are kind of sparse, but not elusive. \\n\\n\r\nOST is again is just as above average as the Animation, with only one note worthy song that seems to stick around Your mind, and the rest fitting in with the mood, with Your usual pianos, trumpets, drums etc. Though it seems to be quite a large OST for 12 good songs that seem fairly on par with the Animation. OP is above average and fairly catchy, while its rather advisable to skip the ED.\\n\\n\r\nLEGACY:\\n\r\nSuch an Underrated show that never really managed to be seen upon masses. Season two is bound to never be released because Silver Link can't profit enough milk from it, but I suppose I'll remember this Light Novel Adaptation though failing and hitting its face on a wall, for having a bit more ambition than something like Mahouka which aims too much for MASS APPEAL.\\n\\n\r\nSCORES:\\n\r\n3.5/10- SINCE LIGHT NOVEL CHARACTERS SUCK. (cool ideas though)\\n\r\n3.5/10- SINCE LIGHT NOVEL PLOTS SUCK. (though some decent foreshadowing at times BTW)\\n\r\n6.5/10- Well made and brightly coloured pieces of imagery but note bing too Shafty, but good Animation is good Animation.\\n\r\n7/10- Mainly for 12 good songs on par with the Animation.\\n\r\n3/10- Lacking enjoyability because it does'nt take good advantage of its potential, and fanservice.\\n\\n\r\nFINALE: 4.5/10 it has cool ideas and the budget to go with it, but fails in the long run. Because of fan service and the attempt of MASS APPEAL.",
            "date": "2014-08-31T14:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 158653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3904273.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Social_Elitist",
                "username": "Social_Elitist"
            },
            "url": "https://myanimelist.net/reviews.php?id=158653"
        },
        {
            "content": "If you liked the anime in terms of \"Art\" would be nice if you try this anime because I guarantee you will not be disappointed because graphic design and CGI effects is modern. But when we talk about the story I told you this anime is no different to the anime genre Echi and Harem.\r\nStory\r\n(+)\r\nThe advantages of this anime lies in the simplicity of the story, making it suitable for viewing at a relaxed state. If you are lovers of the genre of 'mystery' in C3 there are some mysteries that need to be disclosed.\r\n(-)\r\nToo monotonous as Harem and Echi anime genre, because most ofthe anime genre like this has the same plot as \"a beautiful girl comes to the protagonist in a weakened state and helps the protagonist, the protagonist lives in a house and then like the protagonist. There are many enemies chasing and beautiful girl in the end help the protagonist and the girl could live free \". So simple C3 has many similarities of harem anime genre and Echi.\\n\r\nThe story seemed forced, in which we can not see what events are experienced by \"Fear\" of the past and how he created. Who was the protagonist why he got the gift of \"Fear\". There is no definite story about character and Kirika Konoha. The authors focus on the daily \"Fear\" so the audience will not get the impression from this anime.\\n\\n\r\nArt \\n\r\n(+)\\n\r\nFrom various aspects, this work of art anime graphics. Starting from the lighting, coloring, gradation and taking picture so great that all this anime looks alive and like to see Live Action. By adding CGI effects make this anime more interesting, especially in times of battle.\\n\r\n(-)\\n\r\nSo far from fine art images all have nothing to worry about.\\n\\n\r\nSound \\n\r\n(+)\\n\r\nTo the size of a short duration anime opening soundtrack can make two somewhat remarkable, especially easily listening opening soundtrack. On the whole start of the soundtrack and sound effects using a type of modern music.\\n\r\n(-)\\n\r\nI think the mistake is not good enough in terms of sound\\n\\n\r\nCharacter\\n\r\n(+)\\n\r\nAll the female characters here have a super power, and they who lead the course of the story. Even the antagonist of all women. So it can be concluded here that superior female characters.\\n\r\n(-)\\n\r\nWas predictable, since the anime has a lot in common with a lot of harem anime genre and Echi then the protagonist must have a weak guy, do not have super strength and has only one advantage that is \"smooth talker\". It would be nice if the guy has the power figures other than the well-spoken as the main focus on a character guy, a guy when the task is to protect a female character.\\n\r\nThere is no development of character, so we see the early episodes of the anime characters that are then played to the end we'll see them in similar circumstances. Impression in terms of character \"boring\"\\n\\n\r\nEnjoyment\\n\r\nI just enjoy from the \"Art\" just because they managed to make this amazing anime and look alive. But if you look in terms of the story was boring.\\n\\n\r\nOverall \\n\r\nThis anime managed to justify the great side in terms of \"Art\". Yet for all the episodes seem monotonous story and need to progress the story.\\n\r\nIf there sequeel of C3 I hope there is progress the story and character development, especially from a guy protagonists.\\n",
            "date": "2012-04-25T07:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 59605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/910433.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/moseslionheart",
                "username": "moseslionheart"
            },
            "url": "https://myanimelist.net/reviews.php?id=59605"
        },
        {
            "content": "Story:\r\nThe only reason I give the story a 7 is because it had amazing potential. This could have easily broken my top 10 anime, but as time went by, they took almost every wrong turn possible. If they would have stayed with the original feel of the show, I'm certain it would be far better.\r\nArt:\r\nI really have to give them props for the art. It was unique to a point beyond measure. I have NEVER seen such colorful/emotional art in any series I've seen. The art told just as much story as words did. From flowery happy emotions to, dark sad emotions. You could feelit all in the art. While I wouldn't like this sort of art on most series, it fit the overall feel really well.\\n\\n\r\nSound:\\n\\n\r\nThe sound wasn't too amazing. While a few tunes caught my attention, It didn't really stand out. But again, they made it fit the story really well.\\n\\n\r\nCharacter:\\n\\n\r\nWhile their characters were unique, most were unnecessary, annoying, 'I-want-to-shoot-you-through-the-face' characters. Character progression was awful, it was either too big of jumps or far too subtle. It didn't really match the flow of the story. With the exception of Sovereignty.\\n\\n\r\nEnjoyment:\\n\\n\r\nC3 was more of a \"I'll keep watching, maybe it'll get better\" anime. The first few episodes were \"Aww, I have to wait another week?\" but it quickly became watching it just for the small hope it will throw some shot of amazement at you. Wasn't my most enjoyable anime to watch, and I would usually watch it last.\\n\\n\r\nOverall:\\n\\n\r\nOverall it wasn't so great. It had potential. But the story took a turn for the worst, the characters were just plain bad. But they did everything else just fine.",
            "date": "2011-12-18T17:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 49519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503065.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/An1m3_07aku",
                "username": "An1m3_07aku"
            },
            "url": "https://myanimelist.net/reviews.php?id=49519"
        },
        {
            "content": "After having finished it yesterday, I must say. This show is awful. It makes absolutely no sense. The pacing is absurd. At the end of the series I still didn't understand what the heck I was watching. And they end the series like there will be a season 2, but I doubt it will sell enough for one. \r\nThe only good thing about the show, were the OPs. Which, were quite good I have to say.",
            "date": "2011-12-25T18:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 50131,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122932.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Saku_k",
                "username": "Saku_k"
            },
            "url": "https://myanimelist.net/reviews.php?id=50131"
        },
        {
            "content": "episode 1\r\nwell, i kind of saw this one coming after i read the manga. but still i had hopes for the anime. the anime was quite disappointing. i don't usually write reviews like this, but this anime didn't blend with me to this moment. maybe the purple haired check didn't show on the first episode, so i will continue watching it. the story is somewhat boring, i personally didn't see the purpose. the art is the most acceptable thing i saw with this anime, although they added echi into it. the characters are fine, i just don't like the short tsundere girl-type. i didn't enjoyit as much as i should have. overall, im not putting it on my fav list. but they still have a chance to make up for it. \\n\\n\r\nepisode 2\\n\r\ni didn't see that much of an improvement, though they lessened the echi which is admirable. they added all this stuff that doesn't make any sense to the anime, but maybe they will fix it by explaining things in the later episodes. and the purple haired check who i can't remember her name did her part. so, yeah good improvements i guess, but they have to step-it-up-a-notch to get a good review and rating from me.",
            "date": "2011-10-06T02:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 44933,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419066.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/walloman",
                "username": "walloman"
            },
            "url": "https://myanimelist.net/reviews.php?id=44933"
        },
        {
            "content": "C³ : IMO is wierd anime have i ever seen..\r\ni just recently start wacthing, and i feel :\r\nfirst, they make the story when the first meet beetwen fiya and the boy (*i forgot his name) was OVER REACTING.. the beggining was already Over reacting.. i scare all ep too.\r\nsecond, did you pay attention when fiya first go out from house to shopping district.. she wearing a clothes.. the question is where's the clothes come from.. ? cuz the story didn't tell it, then i guess maybe the boy was fettish.. \r\nhe have a girls clothes.. and MAYBE fiya found them & wear them.\r\nwell this myreview though i just watch ep 1..\\n\r\nmaybe tomorrow i'll watch ep 2, cuz ep 1 already make me bore.",
            "date": "2012-11-19T22:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 77975,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1648065.jpg",
                "scores": {
                    "animation": 1,
                    "character": 8,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Alicia-San",
                "username": "Alicia-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=77975"
        },
        {
            "content": "I'm generally more positive regarding my views about series, so I'm not gonna flame the series.\r\nAlso, note that i am reviewing this long after it's release, so there are newer anime that serve as reference points as well.\r\nBut i will describe this series as wasted potential at very least. \r\nbased on that \r\nI'll begin with the plot, which revolves around cursed artifacts taking human form and the overarching plot in the series is about the role of the curses and how to break them or something of that level. My vague and uncertain description of that overarching plot comes literally from the fact that itis not properly developed\\n\\n\r\nOf the 12 episodes in the series, i believe only 2 or 3 actually ised the seriousness that they were toying with to a larger extent, and even then it happens so quickly that you can't see how they got to this point or how it links to a broader concept. \\n\\n\r\nThe characters are also painfully stereotypical, and if i was actually pretty grateful about something, its that this anime didn't play the trope where the girls beat the guy up when something awkward occurs, making their characterization more bearable.\\n\\n\r\nMore bearable is to say, in and of itself the characters weren't built well. Nothing is wrong with using stereotypical characters if you do it well, but no attempt was actively made to flesh the characters out. We see in the series hints of a tragic backstory and complexity that lies below the surface of characters.\\n\\n\r\nAnd that's it. hints of it. No actual look into the characters. Most of the time for that was lost on the series playing out it's ecchi/harem scenes in something of a monotonous school life drama i skipped through a lot because it did not offer much to plot or character development.\\n\\n\r\nSome will probably argue that a Harem/Ecchi series should stick to it's core in that and go for something similar to To Love Ru or Date a Live, basically not taking themselves too seriously because the idea of fanservice is very jarring in a dark plot. I will agree with that opinion in that by placing focus on that, the series would have had more direction. But anime such as Grisaia no Rakuen have proven that the idea of harem/ ecchi and a serious plot can exist side by side.\\n\\n\r\nMy concluding opinion is this show either had no clear direction of what it was doing - that's to say couldn't decide between the lighthearted nature or serious nature, or had a vision to create a blend but failed.\\n\\n\r\nI'll give it a 4-5/10 for an entertaining watch when not much thought is put into it, but if you're looking for something especially unique, i'll say there's better options.",
            "date": "2015-11-10T09:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 203121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AleronAllastar",
                "username": "AleronAllastar"
            },
            "url": "https://myanimelist.net/reviews.php?id=203121"
        },
        {
            "content": "I wanted to like this show.  Really, I did.  It has many elements that I like -- an exploration of the occult, cute girls, a little mystery...  But really, this entire series was a slow-motion train-wreck.  If I had been in my right mind, I would have given up on it by episode 6, but something compelled me to watch it through to the end.  So what went wrong?  Firstly, the plot was more tortured than the characters in the story.  It was truly impossible to figure out what the deeper story was about.  The surface storywas about the main female character Fear, breaking free of her curse and learning to become a human, not a (cube shaped) tool of the dark forces of the occult.  But trying to figure out the rest of the plot was beyond frustrating.  At first I thought it was going to be about a mysterious father-figure of Fear, but that wasn't it.  How was the school superintendent involved?  What was the whole Sovereignty arc even about?  What was The Waas Family supposed to be all about?  How about the Laboratory Group?  Honestly, I don't even care at this point.  It was a horrendous collage of almost-good plot ideas that went terribly, terribly wrong.  And our male main character, Haruaki, was the typical 1-dimensional harem guy basically along for the ride and did nothing for anyone other than give encouraging words.  The last complaint I have is that there was a lot of sadistic violence in the dialog. I object to that, it is unnecessary and it is a cheap way to gain audience sympathy -- but leaves the viewer somewhat traumatized for having had to watch it.  If this show had been someone's first introduction into Anime, I would feel sorry that they got such a poor impression of the genre.  If you like the occult genre, there are many other mystery horror shows that are far better.  Bakemonogatari or Moon-Phase spring to mind.  My recommendation for C3?  Skip it without regrets.  As far as the OVA for the series goes, it was lighthearted and a nice respite from the dreadful main series.",
            "date": "2016-04-15T22:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 216466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075337.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/bearvarine",
                "username": "bearvarine"
            },
            "url": "https://myanimelist.net/reviews.php?id=216466"
        }
    ],
    [
        {
            "content": "Ever looked at a Rubik's cube and wondered if it could transform into a girl? I haven't either. But apparently someone thought it was an ingenious idea and turned it into an anime. This is essentially your typical fighter-harem, where lots of powerful beauties flock to defend their precious weakling of a male lead. It combines action with ecchi and a light touch of comedy. While I cannot say anything about the source literature (manga/light novel), the anime adaptation tries to bite off more than it can chew, and ends up a confused mess.\r\nThe world of C3 is full of cursed items, be it katanasor dolls, that obtain human forms due to their cursed nature. Luckily for these cursed items, there is a guy named Haruaki who is mysteriously immune to curses, and can remove curses. Likewise, luckily for Haruaki, all of the cursed items that he encounters take the form of youthful girls of different types to satisfy any variety of male fetish appeal. If you're looking for fan service, this is probably one of the lighter ones in its season (no god rays needed). If you are absolutely dying for a harem, know that this is the type without any resolution. If you're looking for action, the production qualities will not be up to your expectations. If you're looking for a wanna-be dark but not quite harem with very little coherent plot but lots of bouncy body parts, then you've found your series.\\n\\n\r\nAnimation:\\n\r\nHaving just finished a lot of ancient series prior to originally writing this review, the series was like eye candy to me. The series has crisp animation with lots of colors to suit the mood. The entire series uses an interesting magenta/purple tint to give it a somewhat ominous feel. The animation also uses a few unique touches. For instance, the cubes; cubes will randomly appear out of characters' hair, whenever something is damaged cubes fly out, etc. Likewise, there will be random frequency bands or otherwise strange drawings superimposed onto the backgrounds, especially during fights. These are probably just cosmetic touches but I found it an interesting, distinguishing touch.\\n\\n\r\nCharacter designs are what you'd expect from a harem. You need your share of flat-chested lolis, overly-busty cows, and aristocratic rich princesses. The primary and supporting characters are all easily distinguishable. The antagonists, less so, but more about those later. Fear is interesting in that I'm not sure how to describe her hair color. It's silverish blue with hints of aquamarine gradients, as if her hair had gotten a pearlescent paint job.\\n\\n\r\nThere are quite a few battles for various reasons in the series. The substantial blood and dismemberment elevate the severity of the tone, which is only broken through brief, and typical, ecchi grabs, panty shots, and unfortunate timings. The fighting choreography is average at best, but more disappointing is the special effects. Clouds of damage are overly simplistic and CGI use is widespread.\\n\\n\r\nOverall, the animation quality is fairly good if you discount the action portions. There are unique touches which help separate it from others in the genre but the fights really need a bit more budget.\\n\\n\r\nSound:\\n\r\nThe show has a relatively short OPs and EDs. Eri Kitamura and Yukari Tamura take turns both in the OP and EDs. The first OP has a very strong melody, which is repeatedly used in the BGM as well (plus for uniformity). In general, Youkari's pieces are more upbeat while Kitamura takes the darker pieces. Overall the pieces all fit into the mood of the series fairly well. The series also makes use of a VERY active BGM, it's playing something for at least 75% of the show.\\n\\n\r\nThe VAs do a good job as expected. If anything, I was sad that Eri Kitamura's character was so plain, I tend to like her in more flamboyant roles. Expect a lot of tsundereness in general.\\n\\n\r\nStory:\\n\r\nSo the overall theme is what it means to be human. Now I can go on a huge melodramatic dialogue explaining this in detail but the fact is that it's too impractical to have real meaning here. The series ends with the question of whether it's better to be a tool that became like a human or to be a human that is treated like a tool. And to be quite frank, I have spent zero minutes of my life thinking about that question up to that point, and I don't plan on spending more than an aggregate minute on it. Androids I can relate to but cubes and katanas turning into humans?\\n\\n\r\nThat tirade aside, the core elements of the story are also poorly done. The series is in general told in arcs but is plagued by uneven progression and an incessant need to add more additional supporting characters. Oh no, three girls are not enough to support our main protagonist? No problem, let's just add more, that way we can also appeal to a larger audience! This discussion is in the story section because each of these additional supporting characters end up taking an arc in the story, often spurring the story to add seemingly random antagonists.\\n\\n\r\nThere is a central plot focusing on Fear as the other arcs progress but it only builds to a small plateau of a climax with very little resolution. Be prepared to be introduced to a lot of side elements that are never explained (double sided personalities, random special abilities, etc.), and in general to have a lot more questions unanswered than answered.\\n\\n\r\nAs mentioned by others, this setting did have an interesting premise and introduction, but the execution totally ruined any chance of it being good.\\n\\n\r\nCharacter:\\n\r\nThe general characters here are extremely typical of what you'd expect these days. You get your typical, kind but relatively-wimpy lead with a \"nice\" personality; your typical suddenly-appearing tsundere; and your typical take-care-of-you next door neighbor to name a few. Character interactions are fine, and the root source of the majority of the light humor in the series. Unfortunately, these interactions are light and stay light, you don't get any serious squabbles over the main character as the main lead Fear barely grasps the concept of \"love\" by the end of the series.\\n\\n\r\nThe major violation here is introducing additional characters with virtually no background information, and expecting them to be central to the plot line. This is most acute with the antagonists, who apparently come from radical (an understatement) groups that either hate cursed tools or are masochists who want to be cursed more. Never once did the series attempt to make the viewer in any way on the side of the antagonists, or give any meaning to what they are fighting for. This greatly reduced the enjoyment factor as I really didn't care, nor understand, what all the fighting was over.\\n\\n\r\nOverall, the series was trying to balance too many characters for any of them to make a meaningful impact on the viewer.\\n\\n\r\nValue:\\n\r\nWhile introducing some interesting animation flairs, this series ends up being your typical ecchi harem with more attention to boing than story. This was just too poorly executed to be readily enjoyed by those who have not read the visual novel or manga. Your time may be better spent solving an actual Rubik's cube.",
            "date": "2015-11-02T22:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 202558,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202558"
        },
        {
            "content": "Anime was pretty good at the start, it had a dark feel and there was a fair bit of action. After that it wasn't as good, the dark feel at the start of the series wasn't there anymore and there was less action as well.  Honestly, the action isn't too important to me, but it was pretty good at the start. Although the fact that there was less of a dark atmosphere later on in the series kinda made it less enjoyable, as that was what I came for.\r\nAnyway, the best part of the series was at the start. It goes a bit downhilllater. The later parts of the anime felt a bit rushed as well, which may have been why it not seem as good...",
            "date": "2017-06-27T04:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 251199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EX_DarkLight",
                "username": "EX_DarkLight"
            },
            "url": "https://myanimelist.net/reviews.php?id=251199"
        },
        {
            "content": "Warning : Review is Crude, Filled with Harsh language and minor spoilers\r\nI hate moeblobs, cute moe anime that exists just for the sake of existing as a cute moe anime. Those are things that are certain that I will never touch in my life or ever. I will not review a moeblob anime (I am looking at you Kobayashi) and I will never touch them for the fact that I know that I will not enjoy it and I will present it with a low score out of spite.\r\nBut what can I say, I am a normie with shit taste. But I digress.\r\nFirst anime onthe chopping block. C³.\\n\\n\r\nHave you ever wanted an anime that is basically... Monogatari but you're not into the whole multilevel story telling and weird shaft imagery? Are you tired of seeing tilted heads that keeps on tilting... and tilting and girls that tilts their heads and signs images everywhere?\\n\\n\r\nWell sadly you still get those in C³.\\n\\n\r\nIntroducing Diet Monogatari, C³.\\n\\n\r\n==============================================\\n\r\nCharacters : \\n\r\nObjective Score 5\\n\r\nSubjective Score 6\\n\\n\r\nWhen I say this is Diet monogatari, I mean it.  You have :\\n\r\nShinobu : Fear Kubrick\\n\r\n- Donuts : Rice Crackers\\n\r\n- Cute Moe Loli : Cute Moe Loli\\n\\n\r\nHanekawa : Muramasa Konoha\\n\r\n- Osananajimi : Somewhat Osananajimi (As introduced in the first episode)\\n\r\n- Oppai monster : Oppai monster\\n\r\n- Glasses : Glasses\\n\\n\r\nSenjougahara : Ueno Kirika\\n\r\n- Sadist : Sadist (well somewhat)\\n\r\n- Cold and Cool : Cold and Cool\\n\\n\r\nThere are things that I just can't say about these character's similarities but you get the gist. But as similar as it is. C³ is still its own anime. The difference being the main character. The thing that makes me mad about this anime is the fact that the character are pretty top notched for the 3 main girls of the series except for the fact that the main character has 0 character development.\\n\r\nThe Main character is not your hopeless typical harem guy in a harem anime that is practically useless in every manner (I am looking at you Monmusu). The main character can fight but has 0 correlation to the story that if you take out the main character, I don't think it will be a problem. It's as if the main character is just a plot device to get the story going but for character goes the MC is empty.\\n\r\nNow that we are on topic lets move on to :\\n\\n\r\n==============================================\\n\r\nStory\\n\r\nObjective score 8\\n\r\nSubjective score 9\\n\\n\r\nProgression Pace\\n\r\nObjective score 6\\n\r\nSubjective score 3\\n\\n\r\nI like the story...... just kidding. The story is ok........ maybe a bit too ok. I didn't expect much from a moeblob anime other than some cutesy fan service that the anime is going to throw out because BOOBIES AND BUTTS WHO DOESN'T LOVE THAT! Oh and Pantsu shots too. But then again, there's actually story here! (I AM LOOKING AT YOU KOBAYASHI). The characters had their own set of problems and each of them actually do have problems of their own and they face it. Except for the main character of course. He has no story. No backstory. No Nothing. He is probably the chosen undead from Dark Souls. But I must truly say that this anime has better story than most anime to date (2017) without making it really confusing and have critically acclaimed story line like Steins;Gate and Monogatari.\\n\\n\r\nBut the thing is the reason that the story got a 6 as an overall score is not because of the story. But the fucking progression that is really fast. I noticed that they actually take 3 arcs and just mashed it into 1 season of 12 episodes. But everything feels rushed and the comedic parts are also affected by the pace. This is a real shame because otherwise this could be one of my most favored anime that is moeblob related. \\n\\n\r\n==============================================\\n\r\nFan-Service\\n\r\nObjective score : 9\\n\r\nSubjective score : 8 \\n\\n\r\nOh boy here we go I am going to get so much hate over this rating. The fan service of the anime is good. It's not distracting from the main plot and the fan service tend to be just to make a comedic effect. The reason I set the score to 9 is the fact that this anime despite having the Ecchi Genre has little to no fan service other than the obvious ones such as pantsu shots and suggestive tones.\\n\r\nReally nailed it.\\n\\n\r\n==============================================\\n\r\nOP + ED\\n\r\nObjective Score : 7\\n\r\nSubjective Score : 7\\n\\n\r\nSound Effects \\n\r\nObjective Score : 8\\n\r\nSubjective Score : 8\\n\\n\r\nSoundtrack\\n\r\nObjective Score : 7\\n\r\nSubjective Score : 7\\n\\n\r\nI have no problems with the sound. The sound is good, no memorable music aside from the 2nd OP (One of my favorite OP of all time). Music is pretty well made and it fits to the scenes perfectly.\\n\\n\r\n==============================================\\n\r\nAnimation\\n\r\nObjective score : 7\\n\r\nSubjective score : 7\\n\\n\r\nArt Style and Drawings (Character)\\n\r\nObjective score : 8\\n\r\nSubjective score : 8\\n\\n\r\nArt Style and Drawings (Scene)\\n\r\nObjective score : 8 \\n\r\nSubjective score : 9\\n\\n\r\nImagery and Scene Shots\\n\r\nObjective score : 9\\n\r\nSubjective score : 10\\n\\n\r\nNever seen that one coming huh? A 10 in a pretty good anime. \\n\r\nI don't know where to start.... oh I know, Animations. \\n\r\nHave you ever seen a fight animation before that are pretty good like for example 300? Well this is not as good as that. The animation is ok to say the least because due to the fact that the fight is always linear. Compare it to the fight scene taken from Fate Zero for example, Lancer and Saber, every single action and choreography was perfect that it has weight behind the fight scene. But the fight scenes here are a bit more pandering towards huge weapons. The only problem with this is the fact that the fight scenes are a bit too repetitive sometimes that it can bore you.\\n\\n\r\nMoving on to the next point that is Art Style and Drawing. I split this into two parts which are characters and scenes. The characters are done nicely and its pretty perfect. I take screenshots of each frame but my only reason to dislike this is when Fear is losing her sanity in episode 3. There are some draws that feels a bit too..... grotesque as in the face of Fear Kubrick got smashed or something... Oh and that hair flowing looks terribly out of place in episode 2.\\n\r\nScenes are beautiful however. Everything seems to be in place and everything is sparkly and has bright colors that makes me want to watch this anime again just for the scenery.\\n\\n\r\nAnd last but not least the Imagery and Scene Shots. Absolutely stunning. The imagery in part is like a plot device that helps with the story telling a bit and each scene shots are breathtaking and there are tons of imagery that shows. This reminds me of Monogatari except that the fact that it does not give me Nausea. It's a tamer version of Monogatari.\\n\\n\r\n==============================================\\n\r\nComedy\\n\r\nObjective Score : 7\\n\r\nSubjective Score : 6\\n\\n\r\nI like the jokes, but it could be better than just your typical harem ecchi anime that it should be. Aside from the typical ecchi harem anime jokes, this anime is practically devoid of jokes. Hence a 6 on my part.\\n\\n\r\n==============================================\\n\r\nEnjoyment\\n\r\nObjective Score : 8 \\n\r\nSubjective score : 8\\n\\n\r\nI really enjoyed the anime despite it being a moeblob. Story is pretty cohesive and simple despite probably there are a few people that will feel as if they are being played by their own mind. The Plot twist is pretty ok and kept me going with the story. Everything is pretty well executed and I enjoy this anime and will probably recommend this to people as a low tier anime that I will recommend.\\n\\n\r\n==============================================\\n\r\nFinal Score :\\n\r\n7.8\\n\\n\r\nA really nice breath of fresh air from the staleness called the 2017 anime. Despite being from the 2011 I still can find the fun that I found in anime 5 years ago. Don't get me wrong, there are some pretty good anime like Konosuba. But this certainly puts most of the top contenders of the the Winter (2017) anime to shame.\\n",
            "date": "2017-04-13T04:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 245373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176437.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kastelloid",
                "username": "Kastelloid"
            },
            "url": "https://myanimelist.net/reviews.php?id=245373"
        },
        {
            "content": "Contains a few spoilers..\r\nIn this series, I felt like the only drawback was the story. The main concept was cool and interesting, but they could have shown it off in a whole different way. Example: The series could have started off showing Fear's previous life. And then she could maybe in some way meet Haruaki. That would been a nice start.\r\nGoing further, it would have been nice if some romantic was shown.\r\nI really disliked the ending because of the \"help\" they got, and how the main characters didn't manage to kill the \"Final boss\" while they had the perfect moment to do so.\r\nFinally, I wouldhave really wished to see more background of Fear and her interaction with Haruaki.\\n\\n\r\nElse than that, everything is nice. You'll get to know the characters background which is kind of interesting and show their skills and personality.",
            "date": "2017-03-22T16:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 243181,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/typewar",
                "username": "typewar"
            },
            "url": "https://myanimelist.net/reviews.php?id=243181"
        },
        {
            "content": "The story began as Haruaki Yachi found out the antique object be sent to his house from his father was not a normal item. From this inconceivable meeting, the eyes-glued-open-in-horror moments  of Haruaki Yachi and other cursed objects around him will swing our mind. C³ or Cube×Cursed×Curious [シーキューブ] contains of 12 eps, aired on Fall 2011 by Studio SILVER LINK.\r\nBasically, the plot is about the curse, and how to lift it. Combine many elements such as happiness, freedom, past events, traumatic events, species diversity, future wishes, the bloody sensations will make you grimace in dread. Has human form as a kawaii petite girl withgorgeous bright-blue hair, the true purpose (in the past) of the cube—the antique object, is to torture and kill people, like a massacre. Then, the cube itself, the name is Fear, generates curse for herself that is to make her owner go insane and desire tormenting people. As Haruaki tries to ensoul Fear with the purpose to live,that her own curse can be removed, in the meantime there are few parties after Fear. The ordeal begins how Haruaki can convince his precious friends as objects or tainted with curse to live undoubtedly with passion as normal human being, and the survival of them to save themselves from the grip of enemies.\\n\\n\r\n    Well-grounded to say this anime brings despair to our view wretchedly. Few beings here are stuck by living unwanted life they desire to change in a tight situation. No need to explain that these kind of feelings aren't freshly-baked, so I will give impression about how the story goes. By such miseries, the show can add the cheerfulness moments beautifully, stirs you up-and-down to the lowest and make you gasp surprisingly how provoking the meaning of life be put here. Si émouvant  (؛̩̩̀⌣؛̩̩̀ʃƪ)  \\n\\n\r\n    The story goes as well as the characterization in a nice sync. The bittersweet moments come and characterization is following, one by one, gradually on each characters. Like the relationship of Haruaki and Fear to develop trust, Fear and other characters to cooperate in few accidents, know better the real nature of characters differently from the first time, and the improvement to support the plot in depth.\\n\\n\r\n    Laced with nice graphics, the fighting moment is a blast. The murderous intent is so frightening, the bloody fight successfully gives macabre sensation. Splattered blood, body parts detached, the gripping screams as (+) aspect eventho' the character design is plain. I like the fighting scenes, the fear and shake of the believe to walk forward feel real. When Fear summons her torturing weapons (fundamentally from her cube form), I yell happily don't know why but apart from the hearten moment of beau words, the fighting scenes are the best personally.\\n\\n\r\n    The theme songs are quite decent for me, for the OP is sung by Yukari Tamura \"Endless Story\", sadly it is not significant enough, and by Eri Kitamura, \"Shirushi\". The ED themes are \"Hana (雪華（はな）)\" by Eri Kitamura & \"Sympathy of Love\" by Yukari Tamura, melodious enough, the ED really has soothing tones deliberately~\\n\\n\\n\\n\r\n    Overall I give my 9 to this series, it's worth to watch and easy to remember.\\n\r\nPros:\\n\r\nNice animations and I really love the variations of cursed tools here\\n\r\nMeaningful, especially friendship and will to live\\n",
            "date": "2016-07-21T22:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 224629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224629"
        },
        {
            "content": "It was all good up till halfway through the 2nd episode. It was following the same pattern as several other animes, such as a new girl enters the life of the boy, rivalry between childhood friend and new girl, and so on and so forth. But around midpoint of the second episode it turns into a horror story with a very weird plot and no explanation.",
            "date": "2012-05-07T13:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 60749,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1232949.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SpartanhH12",
                "username": "SpartanhH12"
            },
            "url": "https://myanimelist.net/reviews.php?id=60749"
        },
        {
            "content": "The anime starts in an old fashioned way until the identity of Fear-in-Cube starts to be revealed.This is the part which kept me going.\r\nI also liked how they the characters are and how they get along with each other. For example, how Kuroe & Sovereignty got along and the personality of the superintendent & his secretary.\r\nActually what made me started watching is its uncommon opening song. Frankly, I wasn't really hooked to keep watching for the next episode (Lost my enthusiasm somewhere). Maybe it's because there wasn't enough time to understand the characters before they all jump in. Which is why there is a specialto make up for it :)\\n\\n\r\nI like the fact that the story doesn't drag but It may have been better if there were more episodes though.\\n\\n\\n\\n\\n\\n",
            "date": "2013-05-07T12:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 96327,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1738297.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yummy90",
                "username": "yummy90"
            },
            "url": "https://myanimelist.net/reviews.php?id=96327"
        },
        {
            "content": "There is nothing really outstanding about it. None of the cursed Items were really interesting, Their history was brief. Its all quite messy.\r\nThe characters themselves are not interesting, Fear is voiced by I think the girl who voices ten ten in Naruto (Just a guess, not sure if it is). Who does a decent job.\r\nAll in all its quite S&M. There are some comedy parts, and suggestive fan service. but like I said nothing that stands out.\r\nThe fact that a different dimension pops out during every fight scene really kills the flow, especially when it was a red or purple night, then all of asudden a cherry blossom filled spring background.\\n\\n\r\nIts watchable but nothing outstanding.",
            "date": "2013-03-18T03:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 90073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179801.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shintai88",
                "username": "shintai88"
            },
            "url": "https://myanimelist.net/reviews.php?id=90073"
        },
        {
            "content": "It took me time seen this anime since I tought it was scary and I hate horror. But it took me by surprise, even the scary parts where not inordinate and I enjoyed every bit of it!. The thing wich I loved the most about this anime is that it unexpected. Everytime I tough I can predict what is about to happend it took me by surprise!, like a person ones said \"a good story make you think you know what is going to happend but when it's really good you can never know\". To conclude I really enjoyed all the funny and exitment scenesand deeply recommend this anime.",
            "date": "2012-02-22T10:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 54481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309540.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ren9",
                "username": "ren9"
            },
            "url": "https://myanimelist.net/reviews.php?id=54481"
        },
        {
            "content": "THis anime is a \"Girls with guns and super fast reflexes\" type. It starts out great, introduces the characters, and then jumps a bit ahead (ROCKY training style). in the last 1/3 of the anime the plot twists suddenly (with almost no warning). One of the characters gets built up as a potential \"Super Awesome magical OP character\", but eventually becomes mediocre for no reason. There is a slight Fantasy side-Story attached to it, which is very poorly done and seems like the animators were told to just get X amount of episodes and finish it.\r\nOVERALL:\r\nPretty good School story with the Girls With Guns veryprominent feature. Good animation, great \"Camera work\" and sound. Enjoyable when approached with low expectations...",
            "date": "2014-03-18T16:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 136043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3614379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wrathofdragon",
                "username": "wrathofdragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136043"
        }
    ]
]