[
    [
        {
            "content": "I had actually read a little bit of the Denpa Kyoushi manga before the anime was announced. I had only finished the first two volumes, but I was excited for the adaptation none the less. So, was my excitement well placed? Let's break it down and find out:\r\nStory - 6\r\nKagami Junichirou is an otaku NEET with a bad case of YD, meaning that he can only do that which he Yearns to Do. His younger sister isn’t satisfied with that, so she forces him to take a job as a teacher. Unsurprisingly, Kagami is unenthusiastic about teaching, but if any of his students have anissue that he finds amusing, then he decides to help them out. That's the basic premise, and unfortunately, the show doesn't really go beyond it. For the most part, each episode introduces a new student, and then Kagami fixes whatever problems they had with some wacky solution. Every episode follows this same formula, so it doesn’t take long for watching the show to become tedious, especially since an overarching story is near-nonexistent.\\n\\n\r\nArt - 6\\n\r\nA-1 Pictures is one of the bigger animation studios. They animate several shows each season, and for both halves of Denpa Kyoushi, they were working on three other animes besides it. However, it looks like they couldn’t quite handle that many at once, since they clearly cut costs for this show’s art, which just does not look good. It lacks a distinctive style, and most colors lack any gradients, so everything just looks flat and lifeless.\\n\\n\r\nSound - 7\\n\r\nSound quality is one of the few things that improved as Denpa Kyoushi went on. The opening and ending themes for the first half weren’t that memorable, but the themes for the second half better fit the vibe of the show, and were all around better. The voice acting also improved. It’s not that it was bad at first, but it was initially dragged down by Matsui Rena, who voiced Kagami’s sister. This was her first role, and she terrible at first, but she became more experienced over the course of the series, and was fine by the end.\\n\\n\r\nCharacters - 5\\n\r\nDenpa Kyoushi’s cast can be broken up into two sections: Kagami and everyone else. I honestly don’t know which is worse. In the beginning, Kagami seemed interesting despite his flaws, but as time went on, he began to fall apart. He’s unbelievably good at various skills for no particular reason, and often acts overly smug and obnoxious. But when he’s not donning his plot armor, he’s complaining about how he doesn’t want to do anything, and his rants about YD quickly grow tiresome. His personality is awful in just about every way, but at least he has one. On the other hand, the rest of the cast is completely lifeless. Each student only plays a major role in the episode where they’re introduced, so there’s really no time to have any sort of depth established. Then, once their moment in the spotlight is over, they’re either whisked off to the sidelines, or off the stage altogether. It’s true that most of them do stick around after their initial appearance, but usually they’ll be left with only a shred of their personality, and be used for plot convenience more than anything else. So, between a lead with a terrible personality and a supporting cast with no personality, characters were easily Denpa Kyoushi’s weakest area.\\n\\n\r\nEnjoyment - 5\\n\r\nAt first, the series really was fun to watch. Kagami’s solutions to problems were fairly creative, and there was still the possibility of an overarching plot. But as the series dragged on, it only got worse. There was no greater story to be found, and Kagami’s plans began to lose their appeal. They became less unique and more contrived, especially when gaming is involved. Honestly, the enjoyment value of this series would have been higher if the series were only 12 episodes, because the length of the show really killed it.\\n\\n\r\nOverall - 5\\n\r\nIn conclusion, I can’t recommend watching Denpa Kyoushi. If the concept interests you, you should instead watch Great Teacher Onizuka or Kami Nomi zo Shiru Sekai, which have similar premises but better execution. But if you absolutely insist on watching this, I’d say jump out at the halfway point. That’s essentially where the series peaks, and everything after that is really nothing new.",
            "date": "2015-05-17T20:54:00+00:00",
            "helpful_count": 92,
            "mal_id": 188098,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2578639.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RiverRode",
                "username": "RiverRode"
            },
            "url": "https://myanimelist.net/reviews.php?id=188098"
        },
        {
            "content": "You know, adaptations of a manga or LN are supposed to be good experiences.  You get to see your favorite characters animated and voiced right before your eyes, and even watch a couple of your favorite scenes, which is always a little treat for fans of the show.  However, there are times when you get those adaptions that you just...want to forget, permanently.\r\nStory: The story of Denpa Kyoushi follows the tale of a man named Kagami Junichiro.  As an otaku who is lazy as all hell, his policy in life is the concept of \"YD\" or \"Yearn to do\", where he onlydoes things that he really wants to do.  And since that isn't very often, he's pretty lazy in that regard.  Inversely, he's able to do quite a number of very promising things, like creating a theory for transporting objects instantaneously like Doreamon's pocket so long as he wants to do it.  So, after his sister bothers him to go to a job that she got for him, we begin his journey as the Otaku Teacher, Kagami Junichiro.  \\n\\n\r\nNow, the story for this...mess is...well, nonexistent.  The story is basically comprised of helping one student after another.  it's an arcic setup with not much differing in between each other because the story goes with Kagami encountering a new \"trouble\" student, finds out what's wrong with them, then proceeds to teach them something/help them in order to resolve their issue.  They're happy, he's happy, he moves on.  And really, that's all there is to it.  The story doesn't vary in any way, and as a result, there really isn't much development for characters aside from the \"helped\" ones, and the development itself just seems too convenient for really anything.\\n\\n\r\nAnd since that's the story, there really isn't anything else to say.  The show follows this storyline throughout its whole run and there really isn't anything great about it.  It adds up to a very boring experience because that's the entire show.  There simply isn't any variation and there isn't as a result, much to say.  It's very bland, and it ends kind of meh...\\n\\n\r\nOverview:\\n\r\n-  Bland story\\n\r\n-  Extremely repetitive storyline\\n\r\n-  Average ending\\n\\n\r\nCharacters: As for characters, Denpa Kyoushi has Junichiro, and the plot fodder.\\n\\n\r\nAs for Junichiro, Junichiro is an otaku who yearns only to do what he wants.  After becoming a teacher by the volition of two different girls, Kagami becomes a teacher not out of his own free will and lazes around as he is still the same kind of person as he was.  Throughout the whole series, Kagami helps out the kids because he just simply wants to, and as a result, doesn't change all that much as a character.  His lack of character change hones him into this static role of helping various students and as such, especially with this arcic setup, we don't get to know much about him other than the fact that he is apparently really smart, but only when he wants to be.\\n\\n\r\nAnd then we have the other characters.  I group everyone else all in one category simply because there just isn't much to say about any of them.  Most of them are students that Kagami has helped and as such, are sort of a go to, pass along sort of deal, since every student Kagami helps either fades into the background as a side character, or just disappears entirely.  Because of this, you don't get very much development for any of them and they just become plot devices.  \\n\\n\r\nOverview:\\n\r\n+/-  Average protagonist  (he's intriguing, but really doesn't have anything much going for him)\\n\r\n-  Little to no actual character development (Student development is really only there to continue the story)\\n\r\n-  Every other character is a plot device rather than an actual character\\n\\n\r\nArt: Now, the art.  Art...isn't really Denpa Kyoushi's thing.  In fact, it's so bad that I swear the budget for it was 5,000 yen at most.  With its very bland colors that are just sort of...colors, Denpa Kyoushi doesn't offer anything substantial to the art in the world of anime simply because it just looks terrible.  But that isn't the only issue.  \\n\\n\r\nThe main issue with Denpa Kyoushi is not just that the art itself is just bland, uninspirational, and generic at most, but it's inconsistent, horrendously inconsistent.  The characters never look the scene in one scene to another, where eyes can be shifted to different places, the face shape or hair can look different, and the noses, OH THE NOSES.  Half the time, the noses for the characters aren't even there, not even a little line to indicate that they even have one.  As a result, the characters resemble one of those happy faces children draw when they're little and it just looks horrid!\\n\\n\r\nOverview:\\n\r\n-  Terrible...just terrible art\\n\r\n-  Incredibly inconsistent\\n\\n\r\nSound: The soundtrack for Denpa Kyoushi is nothing to write home about.  They're generic tracks that are average at most.\\n\\n\r\nPersonal Enjoyment: Well, Denpa Kyoushi was quite the disappointment.  Hearing about how the show itself didn't relate to the manga at all, I was having my doubts about its quality, like when I watched Isuca a while back.  Needless to say, this was not the best thing to come out of Summer 2015.\\n\\n\r\nDid I enjoy this show?\\n\\n\r\nAdmittedly, I did.  For about the first few episodes or so.  But because it's so repetitive, I saw no reason in liking it, and as such, grew a growing hatred of it with each passing episode.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nIt's bland.  Out of everything about this show, there just wasn't anything positive to say about it.  The show itself has a repetitive plotline that doesn't feel fun to watch.  And because it's the same godforsaken thing week after week with its \"kid of the week\" setup, there just isn't anything that's great about it due to its lack of variation.  Also, I found some of the things going on in the series to be quite cringeworthy.  (Like...family power rangers.  Why...)  And because this is the section where I can say something I don't like, I'll say it again.  They don't have noses half of the time.  There are many times in this show where they simply...just...don't...have...noses.  Or any indication of having one.  And it is very weird to see a person without a nose.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nI'll cut straight to the point.  No.  Don't hurt yourself in watching this poor adaptation of a rather popular manga.  If you do, you will regret the decision like I do.  This one belongs in the \"pretend it didn't happen\" section of anime.",
            "date": "2015-09-26T22:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 199768,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=199768"
        },
        {
            "content": "Before I start I just want to say that everything I write is my opinion so take it for what it's worth\r\nSo before I watched this anime I had read about 50 or so chapters and really enjoyed it and was excited when I heard Denpa Kyoushi was being adapted to become an anime. What really got me hyped was when I heard Ono Daisuke voices Kagami and Asumi Kana voices Suzune in the promotion video because these two are my some of my favorite voice actors. Unfortunately these two didn't get cast for either of there roles and it was Kamiya Hiroshi and MatsuiRena according to myanimelist who took Kagami and Suzune's role. Now don't get me wrong I'm not saying kamiya's a bad actor what so ever, in fact I'm a fan of a lot of his roles such as Natsume from Natsume no Yujincho and Law from One Peace to name some. But personally I don't like Kamiya's take on Kagami, it could be that I'm partly biased because I wanted Ono Daisuke to voice Kagami but I just can't seem to like his voice for Kagami. I also didn't really like Matsui Rena's take on Suzune mainly cause I find  her voice is kinda well atrocious and doesn't suit Suzune at all. Now my thoughts on the story, I think the story has done fairly well by faithfully keeping close to how the story in the manga played out but they did take out some things which kinda made it loose its impact that it had in the manga. For instance -SPOILER IN THE MANGA- before Kagami was about to quit his first teaching job he was to be replaced by a teacher who graduated from Yale and was pretty much a jerk who believed that if you can't obey the rules you wont get anywhere in life, at the assembly the The teacher from Yale gave his speech about his belief to soon to be students but Kagami gives them his lecture about not being bound by rules and to carve out your own path which was by far my favorite moment in the manga. In the anime the Teacher from Yale wasn't there so for me it kinda lost it's impact. So my conclusion, for now the shows kinda okay and I''ll watch it till the end before I give my final decision but as of now this anime is one of my least favorite in all honesty but that could change so hope my rant didn't bore you and have and awesome day",
            "date": "2015-06-03T20:01:00+00:00",
            "helpful_count": 32,
            "mal_id": 189494,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ExpertBaka",
                "username": "ExpertBaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=189494"
        },
        {
            "content": "Denpa Kyoushi is an anime that follows the life of a teacher named Kagami with YD syndrome. YD is a disease that only let's him doing what he wants to do. \r\nSeems interesting? Well it was .. until I figure out that this show is another show like Assassination Classroom, a teacher that is solving the problems of his students. \r\nThe plot doesn´t actually have anything developed so far, he is only there helping out teens but still is not that bad. The first few episodes and the last 4-5 episodes are being fun. I'm actually attached to this anime and has become one ofmy favourites of this season so far. \\n\\n\r\nBut again, we are 11 eps in and we still have no plot line, no goal for our protagonist. He is there because he wants to ? Well yeah that's it. The entire plot so far is watching  him doing stuff that he wants to do. Not that interesting. Plus, the characters themselves and their background story are kinda over exaggerated. A girl fucked up her life only because she had a part time job in some maid café. I'm like forced to believe that the characters are in a bad spot and need to be saved by Kagami. \\n\\n\r\nArt: 6/10. I hate it. The colorful looks awful. The animations as well are as cheap as possible. The background for the most part looks like a picture of a 5 years old kid who just got his markers and is now learning how to use them. It only doesn´t have a worst rate because the character design if at least good. Good looking characters, especially the girls. Each one has her own design and pallet so that they can be unique in the anime and that is really something important for me. Because not that rare I see characters that look like the same and the only way to distinguish them is by their voices. \\n\\n\r\nSound: 7/10. The opening is fine so as the ending. The ost used are also fine. Everything looks fine. No complaints about it. It's just fine. \\n\\n\r\nCharacter: 8/10. Well, they are funny, likeable and very good looking. What do I mean? Well besides the nice design, they also have a nice personality that fits with both her design and her position in the anime. Each character ends up related with Kagami in some way which is nice to watch. \\n\\n\r\nThey are really different from each other which is also really important because the anime doesn´t get repetitive. For instance let me use an example: Assassination Classroom. They do the exact same thing but, all the characters have the same problem which is : school problems. \\n\\n\r\nAt least denpa kyoushi is more creative, even though some of the problems are quite hard to \"accept\". \\n\\n\r\nEnjoyment: The main purpose of the anime is comedy, and the comedy is not that great. I don´t like it. They don´t focus any other point. Don´t get me wrong, the anime is fun to watch but is not that good.  \\n\\n\r\nOverall: \\n\\n\r\nShort pros and cons: \\n\\n\r\nPros:\\n\r\n- Funny to watch \\n\r\n- Likeable characters \\n\r\n- Nice designs \\n\\n\r\nCons: \\n\r\n- Bad art overall \\n\r\n- Sound not being great \\n\r\n- Story with some flaws \\n\r\n- Weak comedy overall \\n\\n\r\nso .. ? \\n\r\nGive it a try. Even though it's not that great, this entire season is not that great as well, so I believe this anime will became one of the best of this spring season.",
            "date": "2015-06-16T05:32:00+00:00",
            "helpful_count": 30,
            "mal_id": 190405,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4234349.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Visceras",
                "username": "Visceras"
            },
            "url": "https://myanimelist.net/reviews.php?id=190405"
        },
        {
            "content": "Now this series was very VERY interesting to watch.\r\nThanks to the series I now have a new acronym I use now.\r\nShort Summary:\r\nKagami Junichirou was known as a physics genius when has was a teenager, even being published in \"Nature\".\r\nHowever after college, he suddenly lost all interest in science and became a NEET. He devoted himself to his anime blog and collecting merchandises. \r\nAs somewhat of an excuse he claims to have a serious illness called \"YD\" which stands for \"Yearn to Do\" meaning that he can't do anything he doesn't want to do.\r\nWorried about her brother's future, her little sister manages to get him ajob teaching physics at his old high school.\\n\r\nHe's not an enthusiastic teacher but he becomes somewhat popular with the students. After helping a girl who's being bullied, Kagami finds that he actually likes teaching.\\n\r\nWill he continue teaching? Will he go back to physics? or will he return to being a NEET?\\n\\n\r\nThis anime was fun to watch!\\n\r\nThere was a lot of hilarious scenes in the show and each character that appeared had a unique personality; with nicknames made by Kagami which describes the characters perfectly.\\n\\n\r\nIn the end each lesson in the series is related to each other and leads to Kagami's ultimate decision in the final episode.\\n\\n\r\nIf you like comedy then watch this anime!\\n\r\nIt's full of laughs and is interesting is watch!",
            "date": "2015-10-03T23:12:00+00:00",
            "helpful_count": 24,
            "mal_id": 200484,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=200484"
        },
        {
            "content": "One of the best anime,which I yearn to watch.\r\nThis anime totally changed my life and perspective of viewing the world.It inspires me to do something new.\r\nThis Anime is similar to Welcome TO NHK\r\nJunichiro Kazami was known as a physics prodigy back when he was in high school, but now in his post-college years he's got a major case of YD – he claims he can only do something that he “yearns to do.”Junichiro Kagami, a NEET who used to be a theoretical physics prodigy (but only because he wanted to prove an Anywhere Door was possible), but would now rather spend his time fiddling awaywith his anime blog. He has no desire to get a real job and groans when his sister tells him she's gotten him a job as a high school physics teacher at his alma mater.",
            "date": "2016-08-09T04:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 226303,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5371855.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PromiseKyun",
                "username": "PromiseKyun"
            },
            "url": "https://myanimelist.net/reviews.php?id=226303"
        },
        {
            "content": "I find this anime very enjoyable. While the artwork is nothing spectacular, it doesn't detract from it in any way. The story is likewise fairly cookie-cutter problem-student of the week. But it's fairly original. It's not a harem, moe or action anime. And it certainly has plenty of charm. Where it really shines is the characters. This show has a cast of very unique characters that don't really fit any archetypes. There aren't any dere's as far as I can tell. The protagonist, while certainly unique, can be a bit annoying with his precocious \"YD\" crap. Seriously, it just makes him seem whiny and immature.Overall, this is a very enjoyable light-hearted show, and I'd recommend it to anyone looking for a fun watch.",
            "date": "2015-05-17T00:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 188024,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1232199.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/an1m3n00b",
                "username": "an1m3n00b"
            },
            "url": "https://myanimelist.net/reviews.php?id=188024"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI was an elementary school student when I met the coolest teacher I have ever known. His name was Mr. E (the resulting sound that makes in this context is perfect). He was always smiling, laughing and joking with his students. He made learning fun and had a charismatic way of dealing with both teachers and kids alike. As an adult, I rarely see him nowadays, but on the occasions that I do, I always make sure to strike up a conversation, letting him know how grateful I am for the positive atmosphere he always carriedwith him. Mr. E., the modest man that he is, always downplays his role those many years ago.\\n\\n\r\nDenpa Kyoushi is an anime featuring a similarly universally liked teacher. But where Mr. E always deserves to be remembered, this anime should be placed in the trash where it deserves to belong.\\n\\n\r\nSTORY\\n\\n\r\nDenpa Kyoushi does everything in its power to steer itself wrong. While the “otaku” motif persists throughout the season, the praise stops there, the anime constantly losing focus, shifting plot lines, and forgetting ideas, ultimately destroying any semblance of worth the show might have held.\\n\\n\r\nAt its core, Denpa Kyoushi is an anime centered on a singular notion: “otaku”. Besides the title of the show being “Ultimate Otaku Teacher,” many of the events involve aspects from that type of lifestyle. More specifically, the anime uses these aspects to solve the various problems the narrative introduces. A character has difficulty making friends, so Junichiro has him play a video game to improve his soccer skills. Another character needs good grades in physics, so Junichiro makes a training game from scratch to help her practice. Yet another refuses to accept his true identity, so he has the rest of the class hang out with him in an MMORPG to improve his confidence. Lots of video games, but the show also uses television cartoons, manga, and maid cafes as other solutions to the difficulties at hand. Doing so demonstrated that, at the minimum, the anime understood that using one of its central motifs was not just mandatory but also vital.\\n\\n\r\nVitals at this point fail, the remainder of Denpa Kyoushi an atrocious mess of miraculous proportions. The biggest flaw is the show’s inability to use previous events to drive the plot forward. When one arc concludes, the anime seemingly forgets about what happened. Characters make cameos without purpose, the outcomes have little impact, and all the while the show continues to inject more of both. For example, one plotline involves a teenage girl who does not want to be married off to a rival of her parent’s company. After Junichiro helps her out, though, she (and the guy) disappear for the last ten episodes or so, as if her predicament never happened or, worse, did not matter. Denpa Kyoushi does this constantly mostly because, again, the show never stops bringing in people that needed saving. The first half consists of roughly seven students and the second half consists of roughly the same number, each of who are different from one another. The result is the show jumping from student to student, no connection between the individual plotlines found.\\n\\n\r\nFor each student, the narrative takes the same approach: articulate their plight, reveal the relevant bits of their past, and eventually get them to learn their lesson. This setup has a nice past, present, and future construction, but save for a couple of instances, the anime refuses to deviate from this formula, quickly devolving into a repetitive pattern. Their pasts are considerably important because they are what created their internal conflict – a mean video surfaced, a feeling of guilt, and so on. Despite the trauma the characters faced, the majority of the flashbacks are only briefly shown, glimpses rather than occurrences. In other words, their personal problems lack the emphasis required to make them worthy of investigation. Many of the backstories are also isolated, pertaining only to the character or characters investigated rather than having relevancy to the other students involved, perpetuating the disconnectedness the anime continually touts.\\n\\n\r\nThe finale likewise does not escape from stupidity. The characters put themselves into their original holes precisely because they had no one else to turn to. So when Junichiro gives them total control, his decision counterintuitively goes against the anime’s own motif on seeking outside help. His final decision to essentially eliminate the need for teaching in favor of self-teaching also goes against its teacher motif; a gross mistake. The finale also makes it glaringly obvious how underused the characters were throughout the season: the show halfheartedly has about half of those that Junichiro helped (not everyone, just half) show up to cheer him on. They were not present when he needed them most – despite doing just that for them – so their presence at the end is more a slap to the face than it is a sincere goodbye.\\n\\n\r\nMore issues exist besides the jarring plot, the misused flashbacks, and the horrid finale. One, the comedy. Junichiro’s younger sister berating him, him getting mad about people misunderstanding his interests, and the mistimed jokes make the show a slog to endure. Two, the romance. Many of the girls, upon having their problems corrected, fall for the teacher, but these feelings are never explored. In fact, the girls’ feelings either come out of nowhere or are brought up only to never be mentioned again – usually caused by the show refusing to either include the girl rarely (or never) afterwards.\\n\\n\r\nEven disregarding all of these problems, the worst part is that Denpa Kyoushi does not even try to be anything. There is no real overarching plot, no unified theme ties everything together (despite there being numerous motifs), and there is no purpose behind the various events that take place. The anime is a slow burn of nothingness that – rather appropriately – ultimately leads nowhere.\\n\\n\r\nANIMATION\\n\\n\r\nDenpa Kyoushi has some of the worst art and animation in the medium, the latter barely existing in the first place. Aptly speaking, the anime is ugly.\\n\\n\r\nWhen it comes to actual animation, the show is severely below average. This is not an understatement: still frames litter the show, usually just the characters mouths seeing any kind of movement. The anime reaches its lowest point animation-wise very early on, in episode six where the soccer match becomes what might as well have been a bunch of cardboard cutouts kicking a circle around. Another vivid example is in episode thirteen, Junichiro typing away on his keyboard, but not so much typing as he is flexing his fingers while sweeping his hands across the keys. In the general sense, Denpa Kyoushi barely moves its characters, even during action-heavy scenes. Eyes rarely blink, hair hardly ruffles, and clothes seldom contort, placing the show in a negative light of its own doing throughout the majority of the season.\\n\\n\r\nArt follows the actual animation’s footsteps (more specifically, the actual animation’s dragged path). Again, this is not an understatement: the show has problems at even the most basic of levels. Lines are jagged, civilians amorphous blobs rather than humans. Colors are overly vibrant, blinding the audience rather than inviting them to watch. Backgrounds are bland, environments drawn from memory rather than living places. All of this speaks nothing of Denpa Kyoushi’s lack of shadowing, subpar camera direction, and unsettling CG work. The show is an eyesore, a nonstop travesty that bruises the brain.\\n\\n\r\nEqually awful are the character designs which are, mildly put, disgusting. Each person seems as if they forgot to use conditioner when taking a shower, their wiry and wonky hair nauseating the audience. Once again, everyone has an overt brightness to their design. Not that light strikes them in a godlike manner, but instead the colors that make up their clothes and hair is unnecessarily saturated. Many of the characters also have abnormally large foreheads. The ones that do not are usually the ones that wear their wiry, unconditioned hair down to cover their defect. Looking in-depth at their actual construction, Junichiro’s lab coat and glasses paint him as both a smart guy and a teacher, his red hair matching his random yet wholehearted passion. Nanami’s spiky hair and slanting eyes turn him into the rough dude he tends to be. Sachiko’s long blonde hair and more formal attire makes her more mature than the rest of the characters despite her small stature. This same inspection can be applied to the entire cast, but given their inherent unsavoriness, doing so too many times would adversely affect one’s health.\\n\\n\r\nCHARACTERS\\n\\n\r\nRealistically, the cast of Denpa Kyoushi is large, with well over twenty people taking the limelight over the course of the season. Comparatively speaking, the characters are the best feature of the anime, though that is not saying a whole lot.\\n\\n\r\nEarly on the anime seems, at the minimum, poised to have an adequate cast. Minako is the first character developed. Her past life as a street kid affected her transition into a “normal” teenage life, her old friends bullying her in her current lifestyle. As was mentioned previously, this is how the anime approaches every character: some flaw in the character’s past is revealed, said flaw’s effects on this character’s present are showcased, and, upon Junichiro helping out the student, their future is saved. Minako is the same, the anime focusing on this singular form of development for each of its characters. Kiriko, Nanami, Shachiko, Kanan, and Koutarou as well follow this same path. The growth is repetitive and nothing major, but the anime at least has complete stories for each of its characters.\\n\\n\r\nBesides Koutarou, one of the major problems with this setup is how little actual time is spent on the characters. The size of the cast forces the people involved to have regularly one or two episodes maximum for expounding on their individual tales. Combined with the aforementioned, constant ditching of its characters following their arcs, the characters ultimately feel unfulfilling. Koutarou is exempt from this issue since the anime, rather surprisingly, takes its time describing his situation and his overall journey. His hobby – dressing up as a girl despite being a boy – caused a lot of hate to funnel his way. Therefore, he secluded himself, away from people to continue his desires while avoiding any further ridicule. The only place he found that fully accepted him was an online video game, his character’s looks reflecting his own style. When Junichiro learns of Koutarou’s self-seclusion and personal struggles with identity, he forces the boy to confront his past aggressors. In the end, Koutarou comes to accept himself – girl and all – providing the audience with the message that one should never be afraid to be who they really are. Koutarou is the best character of the anime and, while he, too, hardly has a presence following his own arc, saves the cast from being fully badly written.\\n\\n\r\nGiving credit once more, Denpa Kyoushi does switch up its approach when the second half rolls around. The show decides to tackle couplings: a rich girl and an arrogant guy, twin sisters, and Junichiro himself with an ignorant child. The anime still leans on its initial direction at times – a ghost girl wanting to draw and a little kid understanding that some mistakes need to be corrected with one’s own power. However this new, dual-aiding becomes the norm. As expected, this makes the characters even more unfulfilling, since the time spent on the new set of people is divided in two. Many of these plotlines are lacking thematic strength as well – the talks about arrogance and amusement are barely explored (relative to the first half’s themes). Only the twins’ arc, focusing on “one’s place” and familial bonds through their mirroring careers, their sisterly status, and their affinity for a cartoon based on family, has any merit. Plus, similar to Koutarou’s arc, the anime takes a bit more time than usual to craft the events and its characters in the twins’ arc, giving the second half a much needed boost.\\n\\n\r\nMentioned in passing was that Junichiro himself has an arc of his own, where the anime attempts to make Junichiro the one in need of saving. Technically he shares the arc with another character, but the purpose of the final few episodes is to have the star undergo development of his own. Junichiro’s whole idea centers on his signature attitude: what he “yearns to do” more than anything. Ironically, the time he spent saving the various kids leads him into thinking that his teacher job is not what he really wants to do. Already this spells doom for the anime; spending nearly the entirety of the season on his helping exploits only to turn around and say that what he was doing was wrong (for him) all along is nothing short of nonsensical. Still, he believes this, deciding to work on one of his previous theories: the “Anywhere Door”.\\n\\n\r\nOnce again, though, a problem arises. Notably is the door itself. Passing references to the door are made in the beginning and in the middle, but not until the end does the door have any sort of significance. Meaning the anime using the door as a way to expound on Junichiro has very little foundation to work with. Furthermore, the anime tries to use the “Anywhere Door” as a symbol for Junichiro’s own passion. The final few events has the anime showing that since he does not want to make the door, one can conclude that Junichiro has already found what he wants to do. The conclusion? That he wants to help out the kids by letting them help themselves. That is to say, he returns to what he had been doing for the whole series, making his detour a faux attempt at developing his character. In short, Junichiro’s arc has no execution whatsoever which, given the rest of the anime, is an appropriate way to finish the season.\\n\\n\r\nSOUND\\n\\n\r\nThe first opening theme is a huge mess, the pounding beat and the constantly changing vocalists grating on the ears. The middle of the piece changes into one that is floatier in nature, which has no place within the mood of the anime. When the singers work together, the track has a bit more harmony, but that only happens sparingly in the second half of the piece. The piece ends in an abrupt manner, though, killing any sort of praising it might have earned. The second OP is somewhat stronger, the lyrical composition easier to listen to than the first OP. The tone of the piece, however, is still very much a “single” sound, the instruments and beat blending together to make a piece that is more noise than a coherent song. This time the track ends in an appropriate manner (lots of “la”), so comparatively much is gained between the first and second OP.\\n\\n\r\nThe first ending theme is a childish song. The cheery tune, the vocalists, and the instruments are all designed to make the piece kiddy in design, fitting the childish vibe of the actual anime. The track is catchy, meaning there is some merit to its effectiveness. Regardless, the piece is neither grand in scope nor grandeur in sound, making it a tough sell to listen to outside of the show itself. As for the second ED, it follows the footsteps of the second OP, mashing together a repetitive beat with a set of instruments that makes the song hard to listen to for any length of time. The “hey, hey, hey” and the stuttering lyrics try to soften the blows that the piece assails the listener with, but similar to the first OP, the track ends pretty abruptly, once again ruining any sort of traction it made have garnered.\\n\\n\r\nPerhaps obviously at this point, the remainder of the soundtrack is filled with pieces that have next to no worth. Tense piano tracks, slice-of-life violin tracks, and poignant flute-filled ones. A distinct, western-cowboy track exists for those buddy-buddy moments as does a resounding, triumphant tune when Junichiro succeeds. Collectively, the OST offers very little of value even if the pieces themselves fit their respective occasions, reducing the overall execution of the anime that much more.\\n\\n\r\nAnd just for good (bad) measure, the voice acting in the anime is below average. Hiroshi Kamiya provides a competent performance, his geeky voice a decent fit for the adult, male teacher. Suzuko Mimori provides an average performance as well, her mature voice fitting the character’s position but not necessarily the character’s person. However and sadly, Rena Matsui, in her first role ever in the medium, gives one of the worst performances in recent years. Her emotions, way of speaking, and inflections simply do not work, making each of her appearances on-screen a battle to sit through. Unfortunately her performance brings the whole VA package down a few notches.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime at least did something that no other anime I have seen has been able to do before: be beyond lame. Junichiro’s signature catch-phrase, “Time to start the lecture,” followed by him snapping his fingers, has got to be one of the lamest actions I have seen in anime. Lame to the point that I was actually mocking him, saying his line in a stupid voice and performing the same gesture. And since he did this constantly, I for a time became the “YD” dude. I could never take him seriously which, by extension, made it difficult for me to take the anime seriously.\\n\\n\r\n“YD” is another part of Junichiro’s personality that was lame. Listening to the beginning, with the “yukata de date” and the “yakiniku daisuki”, followed by mentions of his “yearn to do” lifestyle, irked me nonstop. This guy, if he wanted, could: cure cancer, solve world hunger, invent never-before-seen technology, eliminate economic disasters, and ensure global peace if he wanted to. But simply because he did not feel like it, all of humanity must suffer. Is it fair to expect this of him? Should someone with the capabilities to positively affect life never use said capabilities? This brings up questions of free will and personal choice, but I think asking to correct one of these prevalent problems when it is so easy for him is not too much of a request.\\n\\n\r\nDid I have fun watching this one? I am not sure, to be honest. Part of the reason I got into this one to begin with was because of the “romance” tag it touted. Having gone through the whole season, said “romance” was a sham. As was stated, the comedy is horribly executed, so laughs were a rarity. Outside of a small reaction to the ghost girl’s story, none of the drama instilled an emotional response from my soul. Junichiro got on my nerves like none other, but many of the other characters were no different. Sachiko’s “blood boiling” line was not funny, Nanami’s personality was too abrasive, and Tim was such an unneeded character.\\n\\n\r\nI think the only aspect of the anime I could truthfully say I liked were the nicknames – “Options,” “Cyborg,” “Potato”, and so on. They were clever given each character’s context, but they also symbolized the close relationship Junichiro had established with the people around him. Still, nicknames alone cannot save an entire, two-cour show.\\n\\n\r\nAs a last remark, I have a theory why this anime was unbelievably awful in nearly everything it did. Despite the show having subpar voice acting, some of the most popular and recognizable voice actors and actresses were enlisted. Huge names such as Hiroshi Kamiya, Yoshitsugu Matsuoka, Kana Hanazawa, Risa Taneda, and a few others. The last three are significant since they are barely present. Yoshitsugu Matsuoka has such an infinitesimally small role compared to everyone else in the cast that it almost makes no logical sense why the show decided to invite him in the first place. Thus, the conspiracy is born: the anime spent so much time and resources on hiring A-List voice actors and actresses that there was no money left to spend on directing, animating, and producing. The diverting of resources to these bigger talents also lends credit as to why Rena Matsui was given the main role as the sister; the anime did not have the money left to acquire a bigwig, thus they gave a main lead to a complete newcomer. Is my theory true? I like to think it is. Otherwise there is nothing to justify the abysmal turn this show took from the very beginning.\\n\\n\r\nDenpa Kyoushi is impossibly atrocious. The story is ridiculous, the art is vomit-inducing, the characters are annoying, the sound is ear-bleeding, and the enjoyment is nonexistent. Suffice it to say that it is not a mystery why this anime deserves no better place than the dumpster.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, the narrative is a complete mess due to forgetting characters, a repetitive setup, a contradictory finale, misplaced comedy, and a lack of overall purpose\\n\\n\r\nAnimation: Terrible, ugly art, actual animation, and character designs throughout the entire experience\\n\\n\r\nCharacters: Bad, besides Koutarou and the twins’ arc, the whole cast, including Junichiro, are severely missing exploration and execution\\n\\n\r\nSound: Terrible, bad first OP, bad second OP, fine first ED, bad second ED, bad OST, below average VA work\\n\\n\r\nEnjoyment: Terrible, silly yet meaningful nicknames cannot save an entire anime, let alone this one\\n\\n\r\nFinal Score: 1/10",
            "date": "2015-12-23T22:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 206628,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=206628"
        },
        {
            "content": "i don't get why theres so many low reviews about this, the anime is great very enjoyable its about this guy whos a genius whos also lazy and is a otaku but his sister gets a job for him cause shes worried about his future now i find this anime very entertaining and fun its quite funny aswell if you ask me but i highly recommend this. \r\nstory 8/10\r\nArt 8/10\r\nSound 9/10\r\nCharacter 9/10\r\nenjoyment 9/10\r\noverall score 9/10 this anime so fun to watch especially for those who like comedy and loves otaku anime characters lol i love it so if i were you id give it atry then again we all have diff opinions but i was just shocked about other reviews 6/10 come on this deserves more haha",
            "date": "2016-07-19T12:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 224419,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4837923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/boooooooo",
                "username": "boooooooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=224419"
        },
        {
            "content": "First of all i only managed to read the first volume of the manga but i found that i liked it as i found the story to be amusing. When i heard about the anime adaptation i was looking forward to seeing it. \r\nThe overall story is actually similar to another franchise that of GTO \r\nin that both revolve around talented individuals who are unconventional and have unique traits that are recruited by a school to help teach at a school. \r\nHere the trait truly is unique as the main character is both an otaku and \r\na genius. \r\nFor an anime that is adapted froma existing source material to be successful it must in addition to being faithful to the story also be faithful to its art and character designs. Here i think that the animators did a great job in creating the characters. \\n\\n\r\nThe sound quality for the anime was well done and i found that the music used was appropriate for the scenes that it was used in. \\n\\n\r\nFor an anime to be successful it must have an interesting cast of characters that are well designed and have unique personalities that  make them stand out. Here Ultimate Otaku teacher really shines as each character is unique and have their own quirks that make them stand out. Out of the characters featured on the show my favorite one has to be Minako who is played by one of my favorite seiyuu's  Sora Amamiya and Koyomi Hiiragi who is played by the talented seiyuu Suzoko Mimori whose character i found to pretty amusing. \\n\\n\r\nAdditionally the character of Suzune who is played by the well known idol Rena Matsui really surprised me as Rena is not really a professionally trained seiyuu but never less gave a amazing performance. \\n\\n\r\nIn conclusion i really enjoyed the Ultimate Otaku teacher and i felt that it was relatively faithful to its source material. Kagami is such an interesting character and some of the methods that he uses to solve the problems that his students are having are truly unique and can only be thought off by him. An example will be using a live performance to stop a student from being expelled by making her too popular. \\n\\n\r\nOverall a great anime that was equal bits amusing and funny that was paired with an excellent story that had a great cast of characters and a ensemble cast of seiyuu's. \\n\\n\\n",
            "date": "2016-09-15T03:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 229063,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=229063"
        },
        {
            "content": "This is my first time reviewing on an anime so please respect my opinions.\r\nHonestly, I wasn't planning on watching this anime so when I finished watching some of my anticipated anime of the season, this just came out. And I totally got hooked up with it. Sure there may not be some romance in it (despite the fact that it's in the genre), but that won't stop me on watching it.\r\nThe story sets out with Junichirou Kagami, a NEET who gave himself up on being a pro otaku. His little sister worries about him because she wants him to do something in his life soshe got him a job as a teacher. \\n\\n\r\nMy only disappointment in this anime is the brightness of the characters' skins. It bothers me that some people has normal skin color other than the people with a too white bright skin color. And his sister's voice doesn't really suit he at all. Still, that doesn't mean I won't stop watching this anime.\\n\\n\r\nIf you've had fun watching Great Teacher Onizuka and the recent anime Assassination Classroom (which I'm also watching) you'll find the teachers alike (i.e funny, smart...) \\n\\n\\n\\n\\n",
            "date": "2015-05-07T23:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 187347,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4601397.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnonymousChicken",
                "username": "AnonymousChicken"
            },
            "url": "https://myanimelist.net/reviews.php?id=187347"
        },
        {
            "content": "This is my own opinon, you dont have to agree with me.\r\nI'll just straight to the point.\r\nStory 6/10 \r\nThe story is not well adapted. Truly boring adaptation.\r\nArt 4/10\r\nWell i'm not expecting much but they should be better than this. Very dissapointing work from studio like A-1 Picture.\r\nSound 2/10\r\nSuzune's voice actor is a huge turn off. Her voice is too annoying. Too high pitched and terrible executions resulting in terrible dialogues.\r\nI'm not gonna comment anything about the soundtrack, It's average.\r\nCharacter 3/10\r\nCharacter design is not consistent. Character's voice actor is terribly choosen. I'm talking about Suzune's voice actor of course.\r\nEnjoyment 2/10\r\nI really can't enjoy the whole series.The promotion clips for the manga is 1000 times better. Why does A-1 picture has director like this one?\\n\\n\r\nOverall 3/10\\n\r\nI'm really feel bad for the manga author, Takeshi Azuma. His manga is one of my favorites, but the anime ruining his series. Denpa kyoushi deserve better animation than this failure.",
            "date": "2016-12-20T09:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 235921,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4707452.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sleekstad",
                "username": "sleekstad"
            },
            "url": "https://myanimelist.net/reviews.php?id=235921"
        },
        {
            "content": "Story 7\r\nThe story revolves around Kagami Junichiro, a NEET; a person who doesn't do productive things, also he has a \"YD\" well basically it is a disease that let you do what you yearn to do. In short he gives effort to what he wants only, if he doesn't like it he wouldn't bother, but there is more than him being a NEET and having a YD actually in his teenage years he was renowned as a physics genius for unraveling a theory of the \"Anywhere Door\" in Doraemon. His little sister Kagame Suzune forced him to work in his alma mater/graduated school as ateacher.\\n\\n\r\nThe story is quite intruiging for me an otaku teacher who helps his students like an otaku would do, although I must say that some parts I felt they were rushed. Each arc are really quite predicatable but it for me it maked me want more for the reason that the I wanted to see more of the characters each arc.\\n\\n\r\nArt 5\\n\\n\r\nThe art is quite unique, if I were to say it was bad maybe for the reason budget didn't go too much in this anime since A-1 Pictures conducted 5 animes when this was aired. It doesn't suit my taste and I almost drop this anime the first two episodes, well the reason I didn't drop this would be pretty much the character and story. The art was a disappointment for me, it could have been better if it would have a better art.\\n\\n\r\nSound 6\\n\\n\r\nThe sound is really really out of place in the parts in were played through out the anime, by meaning \"out of place\" I meant the soundtracks used overlapped to the seiyuu's/voice actor's voice uneccesarily, it made me say \"wtf is this sound used in this part, atleast they could volume the soundtracks down!\" The OP and ED were quite forgettable it didn't made me wish for more of the bands song, but it was well suited for the anime.\\n\\n\r\nCharacter 8\\n\\n\r\nThe characters of this anime is just \"AMUSING\" the characters of the story is just unique, in a good way, each arc produces a character that is very different from one another it makes you want to say \"what is the story behind this character why is she like this?\" well that is the main reason I got to finished this anime, if I were to say in one word it was curiousity, curiosity to these character. But out of my praising I got to say that the characters didn't got the amount of screen time or developement they needed for me to love them more. \\n\\n\r\nEnjoyment 7\\n\\n\r\nI got to tell you that this anime is good just wait, if you want to throw/dropped this anime don't the good parts are in the middle, just get used to the uncomforbability of this anime. My enjoyment for this anime led me to read the manga, I got to say the manga is better, what I really wished was that A-1 just gave it up to another studio.\\n\\n\r\nOverall 7\\n\\n\r\nTL;DR\\n\\n\r\nPros: The story and the characters are the one's who made this anime they are unique in a way you would love both of them in no time.\\n\\n\r\nCons: Art and sound was bad, the art was lazy and the sound didn't connect to me at all.\\n",
            "date": "2015-10-24T08:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 201852,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4561138.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Usagi",
                "username": "-Usagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=201852"
        },
        {
            "content": "Denpa Kyoushi is tedious to watch and become more of a pain then a pleasure when your watching through it. It tries to use tropes such as finger snapping and starting a lesson, which all boil down to nothing. The characters are bland and I could care less about the story because there is none. It is average to watch but not a real priority.\r\nIf you want a good anime about a teacher then watch Great Teacher Onizuka a much better use of your time. The \"Lessons\" your taught are condescending at bland. I've learned more lessons from Hentai then this show. Is it reallybad maybe no but its not very good either there are a few good things I liked. The main one being The wide variety of characters but they quickly wear off. Another is the art it's not bad actually pretty nice. This is my opinion on the show you can watch it slowly and get the same feel as if you binged it.",
            "date": "2016-05-01T10:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 217618,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1433111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ranma314",
                "username": "ranma314"
            },
            "url": "https://myanimelist.net/reviews.php?id=217618"
        },
        {
            "content": "The Elder Teacher's Uncategorized ...\r\nDenpa Kyoushi has a somewhat unique plot, tells of an otaku named Kagami Junichiro, in fact a concept like this has often been used by predecessors although the premises are discussed differently, such as: Oreki Houtarou; Sora-Shiro; Light Yagami. The differences that underline Kagami Junichiro with other perfectionist characters are professions, comedy nuances, and flexibility. Kagami Junichiro works as an otaku physics teacher, why is my physics teacher otaku? Because formally he is a physics teacher, but almost all the scenes show the fact that everything he taught is always related to manga, games, anime, etc., sounds unreasonable, but quite imaginativeis not it? If we know 'Ansatsu Kyoushitsu' of course things like that is not something foreign.\\n\\n\r\nIn addition, the applied teaching methods are not nailed to the education system in general. Here Kagami Junichiro takes a personal approach to his students, there are advantages in this method, including: As a moment to introduce new characters; The audience more easily understands the character of each character; Each character has a different character, the problem is also different, so the solution is also different. Excessive number of characters should be avoided, often the role of some characters to have no effect on the story. But on the other hand, the diverse character behavior makes it easy for the author to create a new path in anticipation of audience boredom. The number of characters can help or hinder the development of the story, depending on the flow of the story. For psychology stories, increasing the number of characters is clearly not effective and not a wise choice. Conversely, for a comedic story adding character means adding new assets, the freedom to create humor will be more open.\\n\\n\r\nDenpa Kyoushi does not present a frontal comedy, the comedy offered is gently sweeping away. That is, the audience will feel \"oh it's funny\" when it's drifting in the story. The strange actions shown by Kagami Junichiro are really beyond our thinking, \"Ah ... I can not believe it\" so that the smiles themselves are natural. The mainstream perfectionist (genius) character is identical to the ideal; Craving; perfect. Usually this type of character that attracted many audiences, but the design of such a character just makes the character seem stiff. Unlike the protagonist of Denpa Kyoushi, though genius but the presentation is so flexible and not monotonous.",
            "date": "2017-06-21T16:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 250585,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5075465.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/royzaa7",
                "username": "royzaa7"
            },
            "url": "https://myanimelist.net/reviews.php?id=250585"
        },
        {
            "content": "I've read the manga before watching the anime and it's kinda good.But then i watch the anime and i'm disappointed.The anime is suppose to be an improvement to the anime but then we have this.\r\nFor the story,it was interesting at first.But there's no plot.It's just a teacher solving students' problem in creative ways.The whole story is just the same old thing and it's maybe interesting for the first few times,but not the rest.It'll be better if you pretend that this is a series of short stories.Because most of the characters only appears in one or two episodes then they become random passers.The good thing ofthe story is just only the creative solutions.Others?Not quite.\\n\\n\r\nThe art is bad.This is produced by A1 Pictures,so I'm expecting a lot more.But the art looks like a mixture of cartoon style and anime style.The colors are bland and the characters' faces are weird.But this is still decent as I seen worse.\\n\\n\r\nThe sound is actually good.We have TrySail and Sphere for the opening.I don't enjoy the ending as much as the opening and the ending is still pretty good.The only concern I have is about the second ending.I don't know if letting voice actors drawing their corresponding characters is a good idea or not.\\n\\n\r\nThe characters?Not that good.Our Mr.Junichiro is just another main character in a harem anime.He's overpowered,good to everyone,and all the girls fall for him.The sister suppose to be an interesting character but I don't think she has the chance to shine in the anime.The other students are good.They aren't boring stereotypes and have different problems.But they only appeared in a few episodes as I said above,which is bad.And there's this one problem,there's an anime original character.I always think that anime original characters often ruin the anime.This is one of the examples.\\n\\n\r\nI found myself enjoying the show most of the time.But there are many drawbacks like the repetitive stories and the characters issue.And there's one big problem that I hate the most.Voice actors.The voice actors supposed to be good.We have some of the most popular voice actors like Kamiya and Hanazawa. But then the sister came and ruined everything.I wonder who thinks that asking someone with no voice acting experiences to be one of the main characters is a good idea.This is why I don't really enjoy seeing her in the anime.Although there's still lots of awesome voice actresses in the anime.But they only appeared in several episodes,like what I say before.\\n\\n\r\nIn conclusion,this anime is average and only just that.It's just one of the ordinary harem anime in the market.This is good for people who just started watching anime.But not for otakus who have watched anime for years.I wouldn't recommend this to someone.Because if you really want harem anime,there're lots of better choices.If you really wanted to watch this,I recommend skipping some episodes as some episodes are not interesting at all.In short,This anime is good for the first time and only the first time.",
            "date": "2016-11-24T08:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 234309,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4836926.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OklahomanSailor",
                "username": "OklahomanSailor"
            },
            "url": "https://myanimelist.net/reviews.php?id=234309"
        },
        {
            "content": "The story follows Jun'ichirō Kagami, whose sister Suzune is angry at him because of his complete disinterest in the real world. As Jun'ichirō is interested in nothing but anime, manga and games, Suzune forces him to go on a job as a physics teacher substitute at the same high school from which he graduated. Jun'ichirō proves himself a capable and hardworking teacher who comes with unorthodox methods based on the seemingly useless knowledge he obtained as an otaku to teach and motivate his students.\r\nunfortunately this time I have to blame to \"MAL\". MAL has a quite good ranking system but this anime rank is low.This anime is quite good interesting plot good developments. This anime is simmilar to \"mahou sensei nigama''. Main character kind of over powered. Lot of girls and lot of comady scenes.",
            "date": "2018-06-22T12:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 281912,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6951592.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rangeewa_Wimansa",
                "username": "Rangeewa_Wimansa"
            },
            "url": "https://myanimelist.net/reviews.php?id=281912"
        },
        {
            "content": "Hey everybody, this will be my review for Denpa Kyoushi. I didn't much like this anime, hopefully i can touch on some points to tell you why without giving away spoilers.\r\nStory 5\r\n    Denpa Kyoushi doesn't have much in the way of story. The overall story is about a young man who has a condition called \"YD\", which only allows him to do what he yearns to do. We follow this man as he journeys to find what he actually yearns to do. \r\n    The rest of the story is split into mini stories. These ministories revolve around people that the main character meets and decides to help in some way. This wasn't a terrible idea. Other anime have done this in the past but I felt like this had an interesting twist. Each person generally had a problem which was detrimental to their living condition. For example; a heartless bully, a cross dresser, a delinquent student, etc.. You follow these unusual characters for an episode or up to three episodes to finally get to the point where they have learned a valuable lesson and are grateful to the main character.\\n\\n\r\n    That's the entire story. Unfortunately this didn't interest me enough. The mini stories were hit and miss, and you know how ever situation is going to end. Those are two big reasons that this anime scored so low IMO. GTO is a popular anime that gets referenced to this show a lot. GTO was interesting, the teacher did things in a different manner and had an outlandish personality for being a teacher which made that show interesting and fun. Denpa Kyoushi had an interesting main character who didn't fit into the typical mold, but it wasn't up to the same standards. Some of the mini stories felt rushed and other times some of the stories were well paced and done well, but each ultimately ended with satisfaction and that just gets boring time after time of seeing that happen.\\n\\n\r\n Art & Sound 7\\n\\n\r\n    The art was well done. I was able to spot some reused still frames, but that's nothing to complain about. There were times where I wondered at some of the aesthetic choices , like masks with skin tone making it hard to tell who is speaking, and the whole twin mini story later in the show. Other than that the art was done well. The music didn't catch me either way good or bad. The resolution song was kinda annoying by the end of the show. The voice actor for the main characters sister too also had me wondering. She doesn't sound bad, but seemed like an odd choice.\\n\\n\r\n Characters 6 \\n\\n\r\n    The characters are what will make or break this show for many people. The cast is quite large because of the helping people solve their problems angle they took. I rated this section low again because I didn't think the characters presented much enjoyment to me.\\n\\n\r\n    Lets talk about the main character. First and foremost the main character is insanely strong. Not strong as in Kirito or Tatsuya way, but strong in the nerdy character who can do anything with technology and his mind. You will see several times in the anime where the main character cant do many physical thing but can always pull through with some miraculous nerd level skills. I keep saying \"nerd\" because he is an otaku. He uses that power several times, like updating his blog to get people to follow a car, or to miraculously escape capture in Akihabara. The YD conundrum caused me to dislike him more than I liked him. He always got serious for odd reasons, and when he got serious he stopped feeling like a real character. His ability to solve problems and to come up with solutions was always strong and to me felt really un balanced, leaving him to be a mere tool to push along the story. The initial things that made him relate able like the blog obsession, or love of anime or games was thrown out the window and he just became someone with insane skills.\\n\\n\r\n    As for the side characters/Students, they were hit and miss for me. You had many interesting issues crop up but sometimes the problems seemed silly, or unrealistic. Each character has their own nickname given by the main character which will help you remember their names. There are too many here to go into full detail and to do so will be to give spoilers.\\n\\n\r\n    Since that is the case I will close of characters section by saying that this score represent my personal taste. The characters were not enjoyable too me and the way that writer served them up like baseballs to be hit out of the park left them with little to no presence or purpose. This however is the main selling point of the show so you may disagree.\\n\\n\r\n Enjoyment 6\\n\\n\r\n    Overall I am happy that I watched this anime. I dont have much good things to say about it, however it is one of the few anime in this genre that I have completed. GTO was super long and I couldn't get passed the first 10 episodes. This was a good medium sized anime that I could force myself to watch(which unfortunately I did need to force myself). The characters were semi enjoyable from time to time. I laughed at certain parts and became curious about certain issues that arose. However for those of you looking for romance, there is none. Not sure why there is a romance tag. There are a couple hints that romance could be had, but nothing ever happens. The whole \"YD\" and \"Amusing\" premise that they kept shoving down my throat was less than interesting to me as well and often found myself being assaulted by my own boredom. In a show like this i feel like they would have done better by highlighting the characters strengths in more detail. It just felt shallow and not well thought out.\\n\\n\r\n TLDR:  If you have time to kill and want to watch kids with odd personalities try to make it in society then give Denpa Kyoushi a shot. Thanks for reading, have a good day.",
            "date": "2015-10-17T21:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 201467,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=201467"
        },
        {
            "content": "First thing in my mind is 'it will well to watch' since I really hooked with the theme and seiyuu, (well main seiyuu is Kamiyan). Enjoying first and second episode, but in the third episode I didn't really know, why I have the imoutou of protagonist. And after looking for 5 episodes, I dropped it.\r\nI hyped because the theme is 'otaku's genius' and saw first episode was epic. But next story just so bland. I don't know because it's seiyuu, since I know that Rena Matsui was graduated member of idol, or just me because my preference.\r\nI hope in the next work, they can upgradeit well.",
            "date": "2015-12-20T09:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 206123,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/350975.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/serene-grace49",
                "username": "serene-grace49"
            },
            "url": "https://myanimelist.net/reviews.php?id=206123"
        },
        {
            "content": "Finished it. Sigh. This anime was frustrating to watch - every episode is hit or miss, and there are more misses than hits. To put it bluntly, it is an seriously inferior version of Great Teacher Onizuka... except that instead of delinquent you get an uber-otaku genius teacher. I didn't like it, but rated it as 5, because of the effort put into it. Detailed breakdown below:\r\nStory: 3/10\r\nHonestly, it is not good. It follows similar pattern as Great Teacher Onizuka or maybe even Assasination Classroom, but the problem is that it wastes quite a lot of the time trying to prove that \"otaku are peopletoo\" and trying to appeal to various popular trends/niche interest/hobbies. Occasionally there are amazing episodes (I really loved 3rd episode), but their number is depressingly low. Another issue is that \"otaku powers\" of main character surpass anything reasonably possible, which makes story harder to believe. Some of the events are pointlessly overdramatized to the point where they may look cruel (this happens only two times, though). Because of all this it is hard to take the story seriously. It doesn't help that cast of characters is less charming than Great Teacher Onizuka was.\\n\\n\r\nArt: 5/10.\\n\\n\r\nStandard \"modern\" arts with relatively low detail, fairly solid overall (and it doesn't look cheap). Looks better than mahouka, but it is not a \"realistic proportions\" type of anime, and it is less detailed than, say.... Spice and Wolf or even Shokugeki. Art does its job, it is done relatively well, but it could be better. \\n\\n\r\nSound 4/10:\\n\r\nMostly does its job, but does not stand out, and I think one of the themes annoyed me.\\n\\n\r\nCharacters: 4/10.\\n\r\nOne and possibly only amazing character here is protagonist's sister (suzune). Scenes where she get confused by her brothers are interesting to watch, and for some reason her character looks much more believable personality-wise. This may be happening because her voice acting is much more reserved than usual anime, which, amusingly, makes it more life-like. One of the side characters  - kanan chinami - was interesting to watch too, but only for the duration of the arc where she was introduced, and her behavior promptly deteriorated afterwards. The rest of the cast has less personality to display, acts in stereotypical manner and in general less believable. \"Sensei\" himself is fairly uninteresting character, with unreasonably high mental and computer skills. \\n\\n\r\nEnjoyement 4/10:\\n\r\nI liked few episodes, but overall the anime was a disappointment. It is drop in a quality compared to Onizuka, and it spends too much time pandering to niche interests and hobbies or trying to prove that \"otaku are people too\". \\n\\n\r\nOverall: 5/10\\n\\n\r\nI'd say 5/10, because they put effort into it, but overall I think you'd be better off watching Greater Teacher Onizuka instead. Most likely it is more appealing to teens or younger teens.Basically, check first three episodes, and see if it is your thing or not. The quality is roughly the same throughought the whole anime.",
            "date": "2017-04-22T17:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 246071,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=246071"
        }
    ],
    [
        {
            "content": "I had actually read a little bit of the Denpa Kyoushi manga before the anime was announced. I had only finished the first two volumes, but I was excited for the adaptation none the less. So, was my excitement well placed? Let's break it down and find out:\r\nStory - 6\r\nKagami Junichirou is an otaku NEET with a bad case of YD, meaning that he can only do that which he Yearns to Do. His younger sister isn’t satisfied with that, so she forces him to take a job as a teacher. Unsurprisingly, Kagami is unenthusiastic about teaching, but if any of his students have anissue that he finds amusing, then he decides to help them out. That's the basic premise, and unfortunately, the show doesn't really go beyond it. For the most part, each episode introduces a new student, and then Kagami fixes whatever problems they had with some wacky solution. Every episode follows this same formula, so it doesn’t take long for watching the show to become tedious, especially since an overarching story is near-nonexistent.\\n\\n\r\nArt - 6\\n\r\nA-1 Pictures is one of the bigger animation studios. They animate several shows each season, and for both halves of Denpa Kyoushi, they were working on three other animes besides it. However, it looks like they couldn’t quite handle that many at once, since they clearly cut costs for this show’s art, which just does not look good. It lacks a distinctive style, and most colors lack any gradients, so everything just looks flat and lifeless.\\n\\n\r\nSound - 7\\n\r\nSound quality is one of the few things that improved as Denpa Kyoushi went on. The opening and ending themes for the first half weren’t that memorable, but the themes for the second half better fit the vibe of the show, and were all around better. The voice acting also improved. It’s not that it was bad at first, but it was initially dragged down by Matsui Rena, who voiced Kagami’s sister. This was her first role, and she terrible at first, but she became more experienced over the course of the series, and was fine by the end.\\n\\n\r\nCharacters - 5\\n\r\nDenpa Kyoushi’s cast can be broken up into two sections: Kagami and everyone else. I honestly don’t know which is worse. In the beginning, Kagami seemed interesting despite his flaws, but as time went on, he began to fall apart. He’s unbelievably good at various skills for no particular reason, and often acts overly smug and obnoxious. But when he’s not donning his plot armor, he’s complaining about how he doesn’t want to do anything, and his rants about YD quickly grow tiresome. His personality is awful in just about every way, but at least he has one. On the other hand, the rest of the cast is completely lifeless. Each student only plays a major role in the episode where they’re introduced, so there’s really no time to have any sort of depth established. Then, once their moment in the spotlight is over, they’re either whisked off to the sidelines, or off the stage altogether. It’s true that most of them do stick around after their initial appearance, but usually they’ll be left with only a shred of their personality, and be used for plot convenience more than anything else. So, between a lead with a terrible personality and a supporting cast with no personality, characters were easily Denpa Kyoushi’s weakest area.\\n\\n\r\nEnjoyment - 5\\n\r\nAt first, the series really was fun to watch. Kagami’s solutions to problems were fairly creative, and there was still the possibility of an overarching plot. But as the series dragged on, it only got worse. There was no greater story to be found, and Kagami’s plans began to lose their appeal. They became less unique and more contrived, especially when gaming is involved. Honestly, the enjoyment value of this series would have been higher if the series were only 12 episodes, because the length of the show really killed it.\\n\\n\r\nOverall - 5\\n\r\nIn conclusion, I can’t recommend watching Denpa Kyoushi. If the concept interests you, you should instead watch Great Teacher Onizuka or Kami Nomi zo Shiru Sekai, which have similar premises but better execution. But if you absolutely insist on watching this, I’d say jump out at the halfway point. That’s essentially where the series peaks, and everything after that is really nothing new.",
            "date": "2015-05-17T20:54:00+00:00",
            "helpful_count": 92,
            "mal_id": 188098,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2578639.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RiverRode",
                "username": "RiverRode"
            },
            "url": "https://myanimelist.net/reviews.php?id=188098"
        },
        {
            "content": "You know, adaptations of a manga or LN are supposed to be good experiences.  You get to see your favorite characters animated and voiced right before your eyes, and even watch a couple of your favorite scenes, which is always a little treat for fans of the show.  However, there are times when you get those adaptions that you just...want to forget, permanently.\r\nStory: The story of Denpa Kyoushi follows the tale of a man named Kagami Junichiro.  As an otaku who is lazy as all hell, his policy in life is the concept of \"YD\" or \"Yearn to do\", where he onlydoes things that he really wants to do.  And since that isn't very often, he's pretty lazy in that regard.  Inversely, he's able to do quite a number of very promising things, like creating a theory for transporting objects instantaneously like Doreamon's pocket so long as he wants to do it.  So, after his sister bothers him to go to a job that she got for him, we begin his journey as the Otaku Teacher, Kagami Junichiro.  \\n\\n\r\nNow, the story for this...mess is...well, nonexistent.  The story is basically comprised of helping one student after another.  it's an arcic setup with not much differing in between each other because the story goes with Kagami encountering a new \"trouble\" student, finds out what's wrong with them, then proceeds to teach them something/help them in order to resolve their issue.  They're happy, he's happy, he moves on.  And really, that's all there is to it.  The story doesn't vary in any way, and as a result, there really isn't much development for characters aside from the \"helped\" ones, and the development itself just seems too convenient for really anything.\\n\\n\r\nAnd since that's the story, there really isn't anything else to say.  The show follows this storyline throughout its whole run and there really isn't anything great about it.  It adds up to a very boring experience because that's the entire show.  There simply isn't any variation and there isn't as a result, much to say.  It's very bland, and it ends kind of meh...\\n\\n\r\nOverview:\\n\r\n-  Bland story\\n\r\n-  Extremely repetitive storyline\\n\r\n-  Average ending\\n\\n\r\nCharacters: As for characters, Denpa Kyoushi has Junichiro, and the plot fodder.\\n\\n\r\nAs for Junichiro, Junichiro is an otaku who yearns only to do what he wants.  After becoming a teacher by the volition of two different girls, Kagami becomes a teacher not out of his own free will and lazes around as he is still the same kind of person as he was.  Throughout the whole series, Kagami helps out the kids because he just simply wants to, and as a result, doesn't change all that much as a character.  His lack of character change hones him into this static role of helping various students and as such, especially with this arcic setup, we don't get to know much about him other than the fact that he is apparently really smart, but only when he wants to be.\\n\\n\r\nAnd then we have the other characters.  I group everyone else all in one category simply because there just isn't much to say about any of them.  Most of them are students that Kagami has helped and as such, are sort of a go to, pass along sort of deal, since every student Kagami helps either fades into the background as a side character, or just disappears entirely.  Because of this, you don't get very much development for any of them and they just become plot devices.  \\n\\n\r\nOverview:\\n\r\n+/-  Average protagonist  (he's intriguing, but really doesn't have anything much going for him)\\n\r\n-  Little to no actual character development (Student development is really only there to continue the story)\\n\r\n-  Every other character is a plot device rather than an actual character\\n\\n\r\nArt: Now, the art.  Art...isn't really Denpa Kyoushi's thing.  In fact, it's so bad that I swear the budget for it was 5,000 yen at most.  With its very bland colors that are just sort of...colors, Denpa Kyoushi doesn't offer anything substantial to the art in the world of anime simply because it just looks terrible.  But that isn't the only issue.  \\n\\n\r\nThe main issue with Denpa Kyoushi is not just that the art itself is just bland, uninspirational, and generic at most, but it's inconsistent, horrendously inconsistent.  The characters never look the scene in one scene to another, where eyes can be shifted to different places, the face shape or hair can look different, and the noses, OH THE NOSES.  Half the time, the noses for the characters aren't even there, not even a little line to indicate that they even have one.  As a result, the characters resemble one of those happy faces children draw when they're little and it just looks horrid!\\n\\n\r\nOverview:\\n\r\n-  Terrible...just terrible art\\n\r\n-  Incredibly inconsistent\\n\\n\r\nSound: The soundtrack for Denpa Kyoushi is nothing to write home about.  They're generic tracks that are average at most.\\n\\n\r\nPersonal Enjoyment: Well, Denpa Kyoushi was quite the disappointment.  Hearing about how the show itself didn't relate to the manga at all, I was having my doubts about its quality, like when I watched Isuca a while back.  Needless to say, this was not the best thing to come out of Summer 2015.\\n\\n\r\nDid I enjoy this show?\\n\\n\r\nAdmittedly, I did.  For about the first few episodes or so.  But because it's so repetitive, I saw no reason in liking it, and as such, grew a growing hatred of it with each passing episode.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nIt's bland.  Out of everything about this show, there just wasn't anything positive to say about it.  The show itself has a repetitive plotline that doesn't feel fun to watch.  And because it's the same godforsaken thing week after week with its \"kid of the week\" setup, there just isn't anything that's great about it due to its lack of variation.  Also, I found some of the things going on in the series to be quite cringeworthy.  (Like...family power rangers.  Why...)  And because this is the section where I can say something I don't like, I'll say it again.  They don't have noses half of the time.  There are many times in this show where they simply...just...don't...have...noses.  Or any indication of having one.  And it is very weird to see a person without a nose.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nI'll cut straight to the point.  No.  Don't hurt yourself in watching this poor adaptation of a rather popular manga.  If you do, you will regret the decision like I do.  This one belongs in the \"pretend it didn't happen\" section of anime.",
            "date": "2015-09-26T22:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 199768,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=199768"
        },
        {
            "content": "Before I start I just want to say that everything I write is my opinion so take it for what it's worth\r\nSo before I watched this anime I had read about 50 or so chapters and really enjoyed it and was excited when I heard Denpa Kyoushi was being adapted to become an anime. What really got me hyped was when I heard Ono Daisuke voices Kagami and Asumi Kana voices Suzune in the promotion video because these two are my some of my favorite voice actors. Unfortunately these two didn't get cast for either of there roles and it was Kamiya Hiroshi and MatsuiRena according to myanimelist who took Kagami and Suzune's role. Now don't get me wrong I'm not saying kamiya's a bad actor what so ever, in fact I'm a fan of a lot of his roles such as Natsume from Natsume no Yujincho and Law from One Peace to name some. But personally I don't like Kamiya's take on Kagami, it could be that I'm partly biased because I wanted Ono Daisuke to voice Kagami but I just can't seem to like his voice for Kagami. I also didn't really like Matsui Rena's take on Suzune mainly cause I find  her voice is kinda well atrocious and doesn't suit Suzune at all. Now my thoughts on the story, I think the story has done fairly well by faithfully keeping close to how the story in the manga played out but they did take out some things which kinda made it loose its impact that it had in the manga. For instance -SPOILER IN THE MANGA- before Kagami was about to quit his first teaching job he was to be replaced by a teacher who graduated from Yale and was pretty much a jerk who believed that if you can't obey the rules you wont get anywhere in life, at the assembly the The teacher from Yale gave his speech about his belief to soon to be students but Kagami gives them his lecture about not being bound by rules and to carve out your own path which was by far my favorite moment in the manga. In the anime the Teacher from Yale wasn't there so for me it kinda lost it's impact. So my conclusion, for now the shows kinda okay and I''ll watch it till the end before I give my final decision but as of now this anime is one of my least favorite in all honesty but that could change so hope my rant didn't bore you and have and awesome day",
            "date": "2015-06-03T20:01:00+00:00",
            "helpful_count": 32,
            "mal_id": 189494,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ExpertBaka",
                "username": "ExpertBaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=189494"
        },
        {
            "content": "Denpa Kyoushi is an anime that follows the life of a teacher named Kagami with YD syndrome. YD is a disease that only let's him doing what he wants to do. \r\nSeems interesting? Well it was .. until I figure out that this show is another show like Assassination Classroom, a teacher that is solving the problems of his students. \r\nThe plot doesn´t actually have anything developed so far, he is only there helping out teens but still is not that bad. The first few episodes and the last 4-5 episodes are being fun. I'm actually attached to this anime and has become one ofmy favourites of this season so far. \\n\\n\r\nBut again, we are 11 eps in and we still have no plot line, no goal for our protagonist. He is there because he wants to ? Well yeah that's it. The entire plot so far is watching  him doing stuff that he wants to do. Not that interesting. Plus, the characters themselves and their background story are kinda over exaggerated. A girl fucked up her life only because she had a part time job in some maid café. I'm like forced to believe that the characters are in a bad spot and need to be saved by Kagami. \\n\\n\r\nArt: 6/10. I hate it. The colorful looks awful. The animations as well are as cheap as possible. The background for the most part looks like a picture of a 5 years old kid who just got his markers and is now learning how to use them. It only doesn´t have a worst rate because the character design if at least good. Good looking characters, especially the girls. Each one has her own design and pallet so that they can be unique in the anime and that is really something important for me. Because not that rare I see characters that look like the same and the only way to distinguish them is by their voices. \\n\\n\r\nSound: 7/10. The opening is fine so as the ending. The ost used are also fine. Everything looks fine. No complaints about it. It's just fine. \\n\\n\r\nCharacter: 8/10. Well, they are funny, likeable and very good looking. What do I mean? Well besides the nice design, they also have a nice personality that fits with both her design and her position in the anime. Each character ends up related with Kagami in some way which is nice to watch. \\n\\n\r\nThey are really different from each other which is also really important because the anime doesn´t get repetitive. For instance let me use an example: Assassination Classroom. They do the exact same thing but, all the characters have the same problem which is : school problems. \\n\\n\r\nAt least denpa kyoushi is more creative, even though some of the problems are quite hard to \"accept\". \\n\\n\r\nEnjoyment: The main purpose of the anime is comedy, and the comedy is not that great. I don´t like it. They don´t focus any other point. Don´t get me wrong, the anime is fun to watch but is not that good.  \\n\\n\r\nOverall: \\n\\n\r\nShort pros and cons: \\n\\n\r\nPros:\\n\r\n- Funny to watch \\n\r\n- Likeable characters \\n\r\n- Nice designs \\n\\n\r\nCons: \\n\r\n- Bad art overall \\n\r\n- Sound not being great \\n\r\n- Story with some flaws \\n\r\n- Weak comedy overall \\n\\n\r\nso .. ? \\n\r\nGive it a try. Even though it's not that great, this entire season is not that great as well, so I believe this anime will became one of the best of this spring season.",
            "date": "2015-06-16T05:32:00+00:00",
            "helpful_count": 30,
            "mal_id": 190405,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4234349.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Visceras",
                "username": "Visceras"
            },
            "url": "https://myanimelist.net/reviews.php?id=190405"
        },
        {
            "content": "Now this series was very VERY interesting to watch.\r\nThanks to the series I now have a new acronym I use now.\r\nShort Summary:\r\nKagami Junichirou was known as a physics genius when has was a teenager, even being published in \"Nature\".\r\nHowever after college, he suddenly lost all interest in science and became a NEET. He devoted himself to his anime blog and collecting merchandises. \r\nAs somewhat of an excuse he claims to have a serious illness called \"YD\" which stands for \"Yearn to Do\" meaning that he can't do anything he doesn't want to do.\r\nWorried about her brother's future, her little sister manages to get him ajob teaching physics at his old high school.\\n\r\nHe's not an enthusiastic teacher but he becomes somewhat popular with the students. After helping a girl who's being bullied, Kagami finds that he actually likes teaching.\\n\r\nWill he continue teaching? Will he go back to physics? or will he return to being a NEET?\\n\\n\r\nThis anime was fun to watch!\\n\r\nThere was a lot of hilarious scenes in the show and each character that appeared had a unique personality; with nicknames made by Kagami which describes the characters perfectly.\\n\\n\r\nIn the end each lesson in the series is related to each other and leads to Kagami's ultimate decision in the final episode.\\n\\n\r\nIf you like comedy then watch this anime!\\n\r\nIt's full of laughs and is interesting is watch!",
            "date": "2015-10-03T23:12:00+00:00",
            "helpful_count": 24,
            "mal_id": 200484,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=200484"
        },
        {
            "content": "One of the best anime,which I yearn to watch.\r\nThis anime totally changed my life and perspective of viewing the world.It inspires me to do something new.\r\nThis Anime is similar to Welcome TO NHK\r\nJunichiro Kazami was known as a physics prodigy back when he was in high school, but now in his post-college years he's got a major case of YD – he claims he can only do something that he “yearns to do.”Junichiro Kagami, a NEET who used to be a theoretical physics prodigy (but only because he wanted to prove an Anywhere Door was possible), but would now rather spend his time fiddling awaywith his anime blog. He has no desire to get a real job and groans when his sister tells him she's gotten him a job as a high school physics teacher at his alma mater.",
            "date": "2016-08-09T04:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 226303,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5371855.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PromiseKyun",
                "username": "PromiseKyun"
            },
            "url": "https://myanimelist.net/reviews.php?id=226303"
        },
        {
            "content": "I find this anime very enjoyable. While the artwork is nothing spectacular, it doesn't detract from it in any way. The story is likewise fairly cookie-cutter problem-student of the week. But it's fairly original. It's not a harem, moe or action anime. And it certainly has plenty of charm. Where it really shines is the characters. This show has a cast of very unique characters that don't really fit any archetypes. There aren't any dere's as far as I can tell. The protagonist, while certainly unique, can be a bit annoying with his precocious \"YD\" crap. Seriously, it just makes him seem whiny and immature.Overall, this is a very enjoyable light-hearted show, and I'd recommend it to anyone looking for a fun watch.",
            "date": "2015-05-17T00:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 188024,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1232199.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/an1m3n00b",
                "username": "an1m3n00b"
            },
            "url": "https://myanimelist.net/reviews.php?id=188024"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI was an elementary school student when I met the coolest teacher I have ever known. His name was Mr. E (the resulting sound that makes in this context is perfect). He was always smiling, laughing and joking with his students. He made learning fun and had a charismatic way of dealing with both teachers and kids alike. As an adult, I rarely see him nowadays, but on the occasions that I do, I always make sure to strike up a conversation, letting him know how grateful I am for the positive atmosphere he always carriedwith him. Mr. E., the modest man that he is, always downplays his role those many years ago.\\n\\n\r\nDenpa Kyoushi is an anime featuring a similarly universally liked teacher. But where Mr. E always deserves to be remembered, this anime should be placed in the trash where it deserves to belong.\\n\\n\r\nSTORY\\n\\n\r\nDenpa Kyoushi does everything in its power to steer itself wrong. While the “otaku” motif persists throughout the season, the praise stops there, the anime constantly losing focus, shifting plot lines, and forgetting ideas, ultimately destroying any semblance of worth the show might have held.\\n\\n\r\nAt its core, Denpa Kyoushi is an anime centered on a singular notion: “otaku”. Besides the title of the show being “Ultimate Otaku Teacher,” many of the events involve aspects from that type of lifestyle. More specifically, the anime uses these aspects to solve the various problems the narrative introduces. A character has difficulty making friends, so Junichiro has him play a video game to improve his soccer skills. Another character needs good grades in physics, so Junichiro makes a training game from scratch to help her practice. Yet another refuses to accept his true identity, so he has the rest of the class hang out with him in an MMORPG to improve his confidence. Lots of video games, but the show also uses television cartoons, manga, and maid cafes as other solutions to the difficulties at hand. Doing so demonstrated that, at the minimum, the anime understood that using one of its central motifs was not just mandatory but also vital.\\n\\n\r\nVitals at this point fail, the remainder of Denpa Kyoushi an atrocious mess of miraculous proportions. The biggest flaw is the show’s inability to use previous events to drive the plot forward. When one arc concludes, the anime seemingly forgets about what happened. Characters make cameos without purpose, the outcomes have little impact, and all the while the show continues to inject more of both. For example, one plotline involves a teenage girl who does not want to be married off to a rival of her parent’s company. After Junichiro helps her out, though, she (and the guy) disappear for the last ten episodes or so, as if her predicament never happened or, worse, did not matter. Denpa Kyoushi does this constantly mostly because, again, the show never stops bringing in people that needed saving. The first half consists of roughly seven students and the second half consists of roughly the same number, each of who are different from one another. The result is the show jumping from student to student, no connection between the individual plotlines found.\\n\\n\r\nFor each student, the narrative takes the same approach: articulate their plight, reveal the relevant bits of their past, and eventually get them to learn their lesson. This setup has a nice past, present, and future construction, but save for a couple of instances, the anime refuses to deviate from this formula, quickly devolving into a repetitive pattern. Their pasts are considerably important because they are what created their internal conflict – a mean video surfaced, a feeling of guilt, and so on. Despite the trauma the characters faced, the majority of the flashbacks are only briefly shown, glimpses rather than occurrences. In other words, their personal problems lack the emphasis required to make them worthy of investigation. Many of the backstories are also isolated, pertaining only to the character or characters investigated rather than having relevancy to the other students involved, perpetuating the disconnectedness the anime continually touts.\\n\\n\r\nThe finale likewise does not escape from stupidity. The characters put themselves into their original holes precisely because they had no one else to turn to. So when Junichiro gives them total control, his decision counterintuitively goes against the anime’s own motif on seeking outside help. His final decision to essentially eliminate the need for teaching in favor of self-teaching also goes against its teacher motif; a gross mistake. The finale also makes it glaringly obvious how underused the characters were throughout the season: the show halfheartedly has about half of those that Junichiro helped (not everyone, just half) show up to cheer him on. They were not present when he needed them most – despite doing just that for them – so their presence at the end is more a slap to the face than it is a sincere goodbye.\\n\\n\r\nMore issues exist besides the jarring plot, the misused flashbacks, and the horrid finale. One, the comedy. Junichiro’s younger sister berating him, him getting mad about people misunderstanding his interests, and the mistimed jokes make the show a slog to endure. Two, the romance. Many of the girls, upon having their problems corrected, fall for the teacher, but these feelings are never explored. In fact, the girls’ feelings either come out of nowhere or are brought up only to never be mentioned again – usually caused by the show refusing to either include the girl rarely (or never) afterwards.\\n\\n\r\nEven disregarding all of these problems, the worst part is that Denpa Kyoushi does not even try to be anything. There is no real overarching plot, no unified theme ties everything together (despite there being numerous motifs), and there is no purpose behind the various events that take place. The anime is a slow burn of nothingness that – rather appropriately – ultimately leads nowhere.\\n\\n\r\nANIMATION\\n\\n\r\nDenpa Kyoushi has some of the worst art and animation in the medium, the latter barely existing in the first place. Aptly speaking, the anime is ugly.\\n\\n\r\nWhen it comes to actual animation, the show is severely below average. This is not an understatement: still frames litter the show, usually just the characters mouths seeing any kind of movement. The anime reaches its lowest point animation-wise very early on, in episode six where the soccer match becomes what might as well have been a bunch of cardboard cutouts kicking a circle around. Another vivid example is in episode thirteen, Junichiro typing away on his keyboard, but not so much typing as he is flexing his fingers while sweeping his hands across the keys. In the general sense, Denpa Kyoushi barely moves its characters, even during action-heavy scenes. Eyes rarely blink, hair hardly ruffles, and clothes seldom contort, placing the show in a negative light of its own doing throughout the majority of the season.\\n\\n\r\nArt follows the actual animation’s footsteps (more specifically, the actual animation’s dragged path). Again, this is not an understatement: the show has problems at even the most basic of levels. Lines are jagged, civilians amorphous blobs rather than humans. Colors are overly vibrant, blinding the audience rather than inviting them to watch. Backgrounds are bland, environments drawn from memory rather than living places. All of this speaks nothing of Denpa Kyoushi’s lack of shadowing, subpar camera direction, and unsettling CG work. The show is an eyesore, a nonstop travesty that bruises the brain.\\n\\n\r\nEqually awful are the character designs which are, mildly put, disgusting. Each person seems as if they forgot to use conditioner when taking a shower, their wiry and wonky hair nauseating the audience. Once again, everyone has an overt brightness to their design. Not that light strikes them in a godlike manner, but instead the colors that make up their clothes and hair is unnecessarily saturated. Many of the characters also have abnormally large foreheads. The ones that do not are usually the ones that wear their wiry, unconditioned hair down to cover their defect. Looking in-depth at their actual construction, Junichiro’s lab coat and glasses paint him as both a smart guy and a teacher, his red hair matching his random yet wholehearted passion. Nanami’s spiky hair and slanting eyes turn him into the rough dude he tends to be. Sachiko’s long blonde hair and more formal attire makes her more mature than the rest of the characters despite her small stature. This same inspection can be applied to the entire cast, but given their inherent unsavoriness, doing so too many times would adversely affect one’s health.\\n\\n\r\nCHARACTERS\\n\\n\r\nRealistically, the cast of Denpa Kyoushi is large, with well over twenty people taking the limelight over the course of the season. Comparatively speaking, the characters are the best feature of the anime, though that is not saying a whole lot.\\n\\n\r\nEarly on the anime seems, at the minimum, poised to have an adequate cast. Minako is the first character developed. Her past life as a street kid affected her transition into a “normal” teenage life, her old friends bullying her in her current lifestyle. As was mentioned previously, this is how the anime approaches every character: some flaw in the character’s past is revealed, said flaw’s effects on this character’s present are showcased, and, upon Junichiro helping out the student, their future is saved. Minako is the same, the anime focusing on this singular form of development for each of its characters. Kiriko, Nanami, Shachiko, Kanan, and Koutarou as well follow this same path. The growth is repetitive and nothing major, but the anime at least has complete stories for each of its characters.\\n\\n\r\nBesides Koutarou, one of the major problems with this setup is how little actual time is spent on the characters. The size of the cast forces the people involved to have regularly one or two episodes maximum for expounding on their individual tales. Combined with the aforementioned, constant ditching of its characters following their arcs, the characters ultimately feel unfulfilling. Koutarou is exempt from this issue since the anime, rather surprisingly, takes its time describing his situation and his overall journey. His hobby – dressing up as a girl despite being a boy – caused a lot of hate to funnel his way. Therefore, he secluded himself, away from people to continue his desires while avoiding any further ridicule. The only place he found that fully accepted him was an online video game, his character’s looks reflecting his own style. When Junichiro learns of Koutarou’s self-seclusion and personal struggles with identity, he forces the boy to confront his past aggressors. In the end, Koutarou comes to accept himself – girl and all – providing the audience with the message that one should never be afraid to be who they really are. Koutarou is the best character of the anime and, while he, too, hardly has a presence following his own arc, saves the cast from being fully badly written.\\n\\n\r\nGiving credit once more, Denpa Kyoushi does switch up its approach when the second half rolls around. The show decides to tackle couplings: a rich girl and an arrogant guy, twin sisters, and Junichiro himself with an ignorant child. The anime still leans on its initial direction at times – a ghost girl wanting to draw and a little kid understanding that some mistakes need to be corrected with one’s own power. However this new, dual-aiding becomes the norm. As expected, this makes the characters even more unfulfilling, since the time spent on the new set of people is divided in two. Many of these plotlines are lacking thematic strength as well – the talks about arrogance and amusement are barely explored (relative to the first half’s themes). Only the twins’ arc, focusing on “one’s place” and familial bonds through their mirroring careers, their sisterly status, and their affinity for a cartoon based on family, has any merit. Plus, similar to Koutarou’s arc, the anime takes a bit more time than usual to craft the events and its characters in the twins’ arc, giving the second half a much needed boost.\\n\\n\r\nMentioned in passing was that Junichiro himself has an arc of his own, where the anime attempts to make Junichiro the one in need of saving. Technically he shares the arc with another character, but the purpose of the final few episodes is to have the star undergo development of his own. Junichiro’s whole idea centers on his signature attitude: what he “yearns to do” more than anything. Ironically, the time he spent saving the various kids leads him into thinking that his teacher job is not what he really wants to do. Already this spells doom for the anime; spending nearly the entirety of the season on his helping exploits only to turn around and say that what he was doing was wrong (for him) all along is nothing short of nonsensical. Still, he believes this, deciding to work on one of his previous theories: the “Anywhere Door”.\\n\\n\r\nOnce again, though, a problem arises. Notably is the door itself. Passing references to the door are made in the beginning and in the middle, but not until the end does the door have any sort of significance. Meaning the anime using the door as a way to expound on Junichiro has very little foundation to work with. Furthermore, the anime tries to use the “Anywhere Door” as a symbol for Junichiro’s own passion. The final few events has the anime showing that since he does not want to make the door, one can conclude that Junichiro has already found what he wants to do. The conclusion? That he wants to help out the kids by letting them help themselves. That is to say, he returns to what he had been doing for the whole series, making his detour a faux attempt at developing his character. In short, Junichiro’s arc has no execution whatsoever which, given the rest of the anime, is an appropriate way to finish the season.\\n\\n\r\nSOUND\\n\\n\r\nThe first opening theme is a huge mess, the pounding beat and the constantly changing vocalists grating on the ears. The middle of the piece changes into one that is floatier in nature, which has no place within the mood of the anime. When the singers work together, the track has a bit more harmony, but that only happens sparingly in the second half of the piece. The piece ends in an abrupt manner, though, killing any sort of praising it might have earned. The second OP is somewhat stronger, the lyrical composition easier to listen to than the first OP. The tone of the piece, however, is still very much a “single” sound, the instruments and beat blending together to make a piece that is more noise than a coherent song. This time the track ends in an appropriate manner (lots of “la”), so comparatively much is gained between the first and second OP.\\n\\n\r\nThe first ending theme is a childish song. The cheery tune, the vocalists, and the instruments are all designed to make the piece kiddy in design, fitting the childish vibe of the actual anime. The track is catchy, meaning there is some merit to its effectiveness. Regardless, the piece is neither grand in scope nor grandeur in sound, making it a tough sell to listen to outside of the show itself. As for the second ED, it follows the footsteps of the second OP, mashing together a repetitive beat with a set of instruments that makes the song hard to listen to for any length of time. The “hey, hey, hey” and the stuttering lyrics try to soften the blows that the piece assails the listener with, but similar to the first OP, the track ends pretty abruptly, once again ruining any sort of traction it made have garnered.\\n\\n\r\nPerhaps obviously at this point, the remainder of the soundtrack is filled with pieces that have next to no worth. Tense piano tracks, slice-of-life violin tracks, and poignant flute-filled ones. A distinct, western-cowboy track exists for those buddy-buddy moments as does a resounding, triumphant tune when Junichiro succeeds. Collectively, the OST offers very little of value even if the pieces themselves fit their respective occasions, reducing the overall execution of the anime that much more.\\n\\n\r\nAnd just for good (bad) measure, the voice acting in the anime is below average. Hiroshi Kamiya provides a competent performance, his geeky voice a decent fit for the adult, male teacher. Suzuko Mimori provides an average performance as well, her mature voice fitting the character’s position but not necessarily the character’s person. However and sadly, Rena Matsui, in her first role ever in the medium, gives one of the worst performances in recent years. Her emotions, way of speaking, and inflections simply do not work, making each of her appearances on-screen a battle to sit through. Unfortunately her performance brings the whole VA package down a few notches.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime at least did something that no other anime I have seen has been able to do before: be beyond lame. Junichiro’s signature catch-phrase, “Time to start the lecture,” followed by him snapping his fingers, has got to be one of the lamest actions I have seen in anime. Lame to the point that I was actually mocking him, saying his line in a stupid voice and performing the same gesture. And since he did this constantly, I for a time became the “YD” dude. I could never take him seriously which, by extension, made it difficult for me to take the anime seriously.\\n\\n\r\n“YD” is another part of Junichiro’s personality that was lame. Listening to the beginning, with the “yukata de date” and the “yakiniku daisuki”, followed by mentions of his “yearn to do” lifestyle, irked me nonstop. This guy, if he wanted, could: cure cancer, solve world hunger, invent never-before-seen technology, eliminate economic disasters, and ensure global peace if he wanted to. But simply because he did not feel like it, all of humanity must suffer. Is it fair to expect this of him? Should someone with the capabilities to positively affect life never use said capabilities? This brings up questions of free will and personal choice, but I think asking to correct one of these prevalent problems when it is so easy for him is not too much of a request.\\n\\n\r\nDid I have fun watching this one? I am not sure, to be honest. Part of the reason I got into this one to begin with was because of the “romance” tag it touted. Having gone through the whole season, said “romance” was a sham. As was stated, the comedy is horribly executed, so laughs were a rarity. Outside of a small reaction to the ghost girl’s story, none of the drama instilled an emotional response from my soul. Junichiro got on my nerves like none other, but many of the other characters were no different. Sachiko’s “blood boiling” line was not funny, Nanami’s personality was too abrasive, and Tim was such an unneeded character.\\n\\n\r\nI think the only aspect of the anime I could truthfully say I liked were the nicknames – “Options,” “Cyborg,” “Potato”, and so on. They were clever given each character’s context, but they also symbolized the close relationship Junichiro had established with the people around him. Still, nicknames alone cannot save an entire, two-cour show.\\n\\n\r\nAs a last remark, I have a theory why this anime was unbelievably awful in nearly everything it did. Despite the show having subpar voice acting, some of the most popular and recognizable voice actors and actresses were enlisted. Huge names such as Hiroshi Kamiya, Yoshitsugu Matsuoka, Kana Hanazawa, Risa Taneda, and a few others. The last three are significant since they are barely present. Yoshitsugu Matsuoka has such an infinitesimally small role compared to everyone else in the cast that it almost makes no logical sense why the show decided to invite him in the first place. Thus, the conspiracy is born: the anime spent so much time and resources on hiring A-List voice actors and actresses that there was no money left to spend on directing, animating, and producing. The diverting of resources to these bigger talents also lends credit as to why Rena Matsui was given the main role as the sister; the anime did not have the money left to acquire a bigwig, thus they gave a main lead to a complete newcomer. Is my theory true? I like to think it is. Otherwise there is nothing to justify the abysmal turn this show took from the very beginning.\\n\\n\r\nDenpa Kyoushi is impossibly atrocious. The story is ridiculous, the art is vomit-inducing, the characters are annoying, the sound is ear-bleeding, and the enjoyment is nonexistent. Suffice it to say that it is not a mystery why this anime deserves no better place than the dumpster.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, the narrative is a complete mess due to forgetting characters, a repetitive setup, a contradictory finale, misplaced comedy, and a lack of overall purpose\\n\\n\r\nAnimation: Terrible, ugly art, actual animation, and character designs throughout the entire experience\\n\\n\r\nCharacters: Bad, besides Koutarou and the twins’ arc, the whole cast, including Junichiro, are severely missing exploration and execution\\n\\n\r\nSound: Terrible, bad first OP, bad second OP, fine first ED, bad second ED, bad OST, below average VA work\\n\\n\r\nEnjoyment: Terrible, silly yet meaningful nicknames cannot save an entire anime, let alone this one\\n\\n\r\nFinal Score: 1/10",
            "date": "2015-12-23T22:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 206628,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=206628"
        },
        {
            "content": "i don't get why theres so many low reviews about this, the anime is great very enjoyable its about this guy whos a genius whos also lazy and is a otaku but his sister gets a job for him cause shes worried about his future now i find this anime very entertaining and fun its quite funny aswell if you ask me but i highly recommend this. \r\nstory 8/10\r\nArt 8/10\r\nSound 9/10\r\nCharacter 9/10\r\nenjoyment 9/10\r\noverall score 9/10 this anime so fun to watch especially for those who like comedy and loves otaku anime characters lol i love it so if i were you id give it atry then again we all have diff opinions but i was just shocked about other reviews 6/10 come on this deserves more haha",
            "date": "2016-07-19T12:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 224419,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4837923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/boooooooo",
                "username": "boooooooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=224419"
        },
        {
            "content": "First of all i only managed to read the first volume of the manga but i found that i liked it as i found the story to be amusing. When i heard about the anime adaptation i was looking forward to seeing it. \r\nThe overall story is actually similar to another franchise that of GTO \r\nin that both revolve around talented individuals who are unconventional and have unique traits that are recruited by a school to help teach at a school. \r\nHere the trait truly is unique as the main character is both an otaku and \r\na genius. \r\nFor an anime that is adapted froma existing source material to be successful it must in addition to being faithful to the story also be faithful to its art and character designs. Here i think that the animators did a great job in creating the characters. \\n\\n\r\nThe sound quality for the anime was well done and i found that the music used was appropriate for the scenes that it was used in. \\n\\n\r\nFor an anime to be successful it must have an interesting cast of characters that are well designed and have unique personalities that  make them stand out. Here Ultimate Otaku teacher really shines as each character is unique and have their own quirks that make them stand out. Out of the characters featured on the show my favorite one has to be Minako who is played by one of my favorite seiyuu's  Sora Amamiya and Koyomi Hiiragi who is played by the talented seiyuu Suzoko Mimori whose character i found to pretty amusing. \\n\\n\r\nAdditionally the character of Suzune who is played by the well known idol Rena Matsui really surprised me as Rena is not really a professionally trained seiyuu but never less gave a amazing performance. \\n\\n\r\nIn conclusion i really enjoyed the Ultimate Otaku teacher and i felt that it was relatively faithful to its source material. Kagami is such an interesting character and some of the methods that he uses to solve the problems that his students are having are truly unique and can only be thought off by him. An example will be using a live performance to stop a student from being expelled by making her too popular. \\n\\n\r\nOverall a great anime that was equal bits amusing and funny that was paired with an excellent story that had a great cast of characters and a ensemble cast of seiyuu's. \\n\\n\\n",
            "date": "2016-09-15T03:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 229063,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=229063"
        },
        {
            "content": "This is my first time reviewing on an anime so please respect my opinions.\r\nHonestly, I wasn't planning on watching this anime so when I finished watching some of my anticipated anime of the season, this just came out. And I totally got hooked up with it. Sure there may not be some romance in it (despite the fact that it's in the genre), but that won't stop me on watching it.\r\nThe story sets out with Junichirou Kagami, a NEET who gave himself up on being a pro otaku. His little sister worries about him because she wants him to do something in his life soshe got him a job as a teacher. \\n\\n\r\nMy only disappointment in this anime is the brightness of the characters' skins. It bothers me that some people has normal skin color other than the people with a too white bright skin color. And his sister's voice doesn't really suit he at all. Still, that doesn't mean I won't stop watching this anime.\\n\\n\r\nIf you've had fun watching Great Teacher Onizuka and the recent anime Assassination Classroom (which I'm also watching) you'll find the teachers alike (i.e funny, smart...) \\n\\n\\n\\n\\n",
            "date": "2015-05-07T23:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 187347,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4601397.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnonymousChicken",
                "username": "AnonymousChicken"
            },
            "url": "https://myanimelist.net/reviews.php?id=187347"
        },
        {
            "content": "This is my own opinon, you dont have to agree with me.\r\nI'll just straight to the point.\r\nStory 6/10 \r\nThe story is not well adapted. Truly boring adaptation.\r\nArt 4/10\r\nWell i'm not expecting much but they should be better than this. Very dissapointing work from studio like A-1 Picture.\r\nSound 2/10\r\nSuzune's voice actor is a huge turn off. Her voice is too annoying. Too high pitched and terrible executions resulting in terrible dialogues.\r\nI'm not gonna comment anything about the soundtrack, It's average.\r\nCharacter 3/10\r\nCharacter design is not consistent. Character's voice actor is terribly choosen. I'm talking about Suzune's voice actor of course.\r\nEnjoyment 2/10\r\nI really can't enjoy the whole series.The promotion clips for the manga is 1000 times better. Why does A-1 picture has director like this one?\\n\\n\r\nOverall 3/10\\n\r\nI'm really feel bad for the manga author, Takeshi Azuma. His manga is one of my favorites, but the anime ruining his series. Denpa kyoushi deserve better animation than this failure.",
            "date": "2016-12-20T09:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 235921,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4707452.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sleekstad",
                "username": "sleekstad"
            },
            "url": "https://myanimelist.net/reviews.php?id=235921"
        },
        {
            "content": "Story 7\r\nThe story revolves around Kagami Junichiro, a NEET; a person who doesn't do productive things, also he has a \"YD\" well basically it is a disease that let you do what you yearn to do. In short he gives effort to what he wants only, if he doesn't like it he wouldn't bother, but there is more than him being a NEET and having a YD actually in his teenage years he was renowned as a physics genius for unraveling a theory of the \"Anywhere Door\" in Doraemon. His little sister Kagame Suzune forced him to work in his alma mater/graduated school as ateacher.\\n\\n\r\nThe story is quite intruiging for me an otaku teacher who helps his students like an otaku would do, although I must say that some parts I felt they were rushed. Each arc are really quite predicatable but it for me it maked me want more for the reason that the I wanted to see more of the characters each arc.\\n\\n\r\nArt 5\\n\\n\r\nThe art is quite unique, if I were to say it was bad maybe for the reason budget didn't go too much in this anime since A-1 Pictures conducted 5 animes when this was aired. It doesn't suit my taste and I almost drop this anime the first two episodes, well the reason I didn't drop this would be pretty much the character and story. The art was a disappointment for me, it could have been better if it would have a better art.\\n\\n\r\nSound 6\\n\\n\r\nThe sound is really really out of place in the parts in were played through out the anime, by meaning \"out of place\" I meant the soundtracks used overlapped to the seiyuu's/voice actor's voice uneccesarily, it made me say \"wtf is this sound used in this part, atleast they could volume the soundtracks down!\" The OP and ED were quite forgettable it didn't made me wish for more of the bands song, but it was well suited for the anime.\\n\\n\r\nCharacter 8\\n\\n\r\nThe characters of this anime is just \"AMUSING\" the characters of the story is just unique, in a good way, each arc produces a character that is very different from one another it makes you want to say \"what is the story behind this character why is she like this?\" well that is the main reason I got to finished this anime, if I were to say in one word it was curiousity, curiosity to these character. But out of my praising I got to say that the characters didn't got the amount of screen time or developement they needed for me to love them more. \\n\\n\r\nEnjoyment 7\\n\\n\r\nI got to tell you that this anime is good just wait, if you want to throw/dropped this anime don't the good parts are in the middle, just get used to the uncomforbability of this anime. My enjoyment for this anime led me to read the manga, I got to say the manga is better, what I really wished was that A-1 just gave it up to another studio.\\n\\n\r\nOverall 7\\n\\n\r\nTL;DR\\n\\n\r\nPros: The story and the characters are the one's who made this anime they are unique in a way you would love both of them in no time.\\n\\n\r\nCons: Art and sound was bad, the art was lazy and the sound didn't connect to me at all.\\n",
            "date": "2015-10-24T08:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 201852,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4561138.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Usagi",
                "username": "-Usagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=201852"
        },
        {
            "content": "Denpa Kyoushi is tedious to watch and become more of a pain then a pleasure when your watching through it. It tries to use tropes such as finger snapping and starting a lesson, which all boil down to nothing. The characters are bland and I could care less about the story because there is none. It is average to watch but not a real priority.\r\nIf you want a good anime about a teacher then watch Great Teacher Onizuka a much better use of your time. The \"Lessons\" your taught are condescending at bland. I've learned more lessons from Hentai then this show. Is it reallybad maybe no but its not very good either there are a few good things I liked. The main one being The wide variety of characters but they quickly wear off. Another is the art it's not bad actually pretty nice. This is my opinion on the show you can watch it slowly and get the same feel as if you binged it.",
            "date": "2016-05-01T10:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 217618,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1433111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ranma314",
                "username": "ranma314"
            },
            "url": "https://myanimelist.net/reviews.php?id=217618"
        },
        {
            "content": "The Elder Teacher's Uncategorized ...\r\nDenpa Kyoushi has a somewhat unique plot, tells of an otaku named Kagami Junichiro, in fact a concept like this has often been used by predecessors although the premises are discussed differently, such as: Oreki Houtarou; Sora-Shiro; Light Yagami. The differences that underline Kagami Junichiro with other perfectionist characters are professions, comedy nuances, and flexibility. Kagami Junichiro works as an otaku physics teacher, why is my physics teacher otaku? Because formally he is a physics teacher, but almost all the scenes show the fact that everything he taught is always related to manga, games, anime, etc., sounds unreasonable, but quite imaginativeis not it? If we know 'Ansatsu Kyoushitsu' of course things like that is not something foreign.\\n\\n\r\nIn addition, the applied teaching methods are not nailed to the education system in general. Here Kagami Junichiro takes a personal approach to his students, there are advantages in this method, including: As a moment to introduce new characters; The audience more easily understands the character of each character; Each character has a different character, the problem is also different, so the solution is also different. Excessive number of characters should be avoided, often the role of some characters to have no effect on the story. But on the other hand, the diverse character behavior makes it easy for the author to create a new path in anticipation of audience boredom. The number of characters can help or hinder the development of the story, depending on the flow of the story. For psychology stories, increasing the number of characters is clearly not effective and not a wise choice. Conversely, for a comedic story adding character means adding new assets, the freedom to create humor will be more open.\\n\\n\r\nDenpa Kyoushi does not present a frontal comedy, the comedy offered is gently sweeping away. That is, the audience will feel \"oh it's funny\" when it's drifting in the story. The strange actions shown by Kagami Junichiro are really beyond our thinking, \"Ah ... I can not believe it\" so that the smiles themselves are natural. The mainstream perfectionist (genius) character is identical to the ideal; Craving; perfect. Usually this type of character that attracted many audiences, but the design of such a character just makes the character seem stiff. Unlike the protagonist of Denpa Kyoushi, though genius but the presentation is so flexible and not monotonous.",
            "date": "2017-06-21T16:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 250585,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5075465.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/royzaa7",
                "username": "royzaa7"
            },
            "url": "https://myanimelist.net/reviews.php?id=250585"
        },
        {
            "content": "I've read the manga before watching the anime and it's kinda good.But then i watch the anime and i'm disappointed.The anime is suppose to be an improvement to the anime but then we have this.\r\nFor the story,it was interesting at first.But there's no plot.It's just a teacher solving students' problem in creative ways.The whole story is just the same old thing and it's maybe interesting for the first few times,but not the rest.It'll be better if you pretend that this is a series of short stories.Because most of the characters only appears in one or two episodes then they become random passers.The good thing ofthe story is just only the creative solutions.Others?Not quite.\\n\\n\r\nThe art is bad.This is produced by A1 Pictures,so I'm expecting a lot more.But the art looks like a mixture of cartoon style and anime style.The colors are bland and the characters' faces are weird.But this is still decent as I seen worse.\\n\\n\r\nThe sound is actually good.We have TrySail and Sphere for the opening.I don't enjoy the ending as much as the opening and the ending is still pretty good.The only concern I have is about the second ending.I don't know if letting voice actors drawing their corresponding characters is a good idea or not.\\n\\n\r\nThe characters?Not that good.Our Mr.Junichiro is just another main character in a harem anime.He's overpowered,good to everyone,and all the girls fall for him.The sister suppose to be an interesting character but I don't think she has the chance to shine in the anime.The other students are good.They aren't boring stereotypes and have different problems.But they only appeared in a few episodes as I said above,which is bad.And there's this one problem,there's an anime original character.I always think that anime original characters often ruin the anime.This is one of the examples.\\n\\n\r\nI found myself enjoying the show most of the time.But there are many drawbacks like the repetitive stories and the characters issue.And there's one big problem that I hate the most.Voice actors.The voice actors supposed to be good.We have some of the most popular voice actors like Kamiya and Hanazawa. But then the sister came and ruined everything.I wonder who thinks that asking someone with no voice acting experiences to be one of the main characters is a good idea.This is why I don't really enjoy seeing her in the anime.Although there's still lots of awesome voice actresses in the anime.But they only appeared in several episodes,like what I say before.\\n\\n\r\nIn conclusion,this anime is average and only just that.It's just one of the ordinary harem anime in the market.This is good for people who just started watching anime.But not for otakus who have watched anime for years.I wouldn't recommend this to someone.Because if you really want harem anime,there're lots of better choices.If you really wanted to watch this,I recommend skipping some episodes as some episodes are not interesting at all.In short,This anime is good for the first time and only the first time.",
            "date": "2016-11-24T08:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 234309,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4836926.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OklahomanSailor",
                "username": "OklahomanSailor"
            },
            "url": "https://myanimelist.net/reviews.php?id=234309"
        },
        {
            "content": "The story follows Jun'ichirō Kagami, whose sister Suzune is angry at him because of his complete disinterest in the real world. As Jun'ichirō is interested in nothing but anime, manga and games, Suzune forces him to go on a job as a physics teacher substitute at the same high school from which he graduated. Jun'ichirō proves himself a capable and hardworking teacher who comes with unorthodox methods based on the seemingly useless knowledge he obtained as an otaku to teach and motivate his students.\r\nunfortunately this time I have to blame to \"MAL\". MAL has a quite good ranking system but this anime rank is low.This anime is quite good interesting plot good developments. This anime is simmilar to \"mahou sensei nigama''. Main character kind of over powered. Lot of girls and lot of comady scenes.",
            "date": "2018-06-22T12:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 281912,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6951592.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rangeewa_Wimansa",
                "username": "Rangeewa_Wimansa"
            },
            "url": "https://myanimelist.net/reviews.php?id=281912"
        },
        {
            "content": "Hey everybody, this will be my review for Denpa Kyoushi. I didn't much like this anime, hopefully i can touch on some points to tell you why without giving away spoilers.\r\nStory 5\r\n    Denpa Kyoushi doesn't have much in the way of story. The overall story is about a young man who has a condition called \"YD\", which only allows him to do what he yearns to do. We follow this man as he journeys to find what he actually yearns to do. \r\n    The rest of the story is split into mini stories. These ministories revolve around people that the main character meets and decides to help in some way. This wasn't a terrible idea. Other anime have done this in the past but I felt like this had an interesting twist. Each person generally had a problem which was detrimental to their living condition. For example; a heartless bully, a cross dresser, a delinquent student, etc.. You follow these unusual characters for an episode or up to three episodes to finally get to the point where they have learned a valuable lesson and are grateful to the main character.\\n\\n\r\n    That's the entire story. Unfortunately this didn't interest me enough. The mini stories were hit and miss, and you know how ever situation is going to end. Those are two big reasons that this anime scored so low IMO. GTO is a popular anime that gets referenced to this show a lot. GTO was interesting, the teacher did things in a different manner and had an outlandish personality for being a teacher which made that show interesting and fun. Denpa Kyoushi had an interesting main character who didn't fit into the typical mold, but it wasn't up to the same standards. Some of the mini stories felt rushed and other times some of the stories were well paced and done well, but each ultimately ended with satisfaction and that just gets boring time after time of seeing that happen.\\n\\n\r\n Art & Sound 7\\n\\n\r\n    The art was well done. I was able to spot some reused still frames, but that's nothing to complain about. There were times where I wondered at some of the aesthetic choices , like masks with skin tone making it hard to tell who is speaking, and the whole twin mini story later in the show. Other than that the art was done well. The music didn't catch me either way good or bad. The resolution song was kinda annoying by the end of the show. The voice actor for the main characters sister too also had me wondering. She doesn't sound bad, but seemed like an odd choice.\\n\\n\r\n Characters 6 \\n\\n\r\n    The characters are what will make or break this show for many people. The cast is quite large because of the helping people solve their problems angle they took. I rated this section low again because I didn't think the characters presented much enjoyment to me.\\n\\n\r\n    Lets talk about the main character. First and foremost the main character is insanely strong. Not strong as in Kirito or Tatsuya way, but strong in the nerdy character who can do anything with technology and his mind. You will see several times in the anime where the main character cant do many physical thing but can always pull through with some miraculous nerd level skills. I keep saying \"nerd\" because he is an otaku. He uses that power several times, like updating his blog to get people to follow a car, or to miraculously escape capture in Akihabara. The YD conundrum caused me to dislike him more than I liked him. He always got serious for odd reasons, and when he got serious he stopped feeling like a real character. His ability to solve problems and to come up with solutions was always strong and to me felt really un balanced, leaving him to be a mere tool to push along the story. The initial things that made him relate able like the blog obsession, or love of anime or games was thrown out the window and he just became someone with insane skills.\\n\\n\r\n    As for the side characters/Students, they were hit and miss for me. You had many interesting issues crop up but sometimes the problems seemed silly, or unrealistic. Each character has their own nickname given by the main character which will help you remember their names. There are too many here to go into full detail and to do so will be to give spoilers.\\n\\n\r\n    Since that is the case I will close of characters section by saying that this score represent my personal taste. The characters were not enjoyable too me and the way that writer served them up like baseballs to be hit out of the park left them with little to no presence or purpose. This however is the main selling point of the show so you may disagree.\\n\\n\r\n Enjoyment 6\\n\\n\r\n    Overall I am happy that I watched this anime. I dont have much good things to say about it, however it is one of the few anime in this genre that I have completed. GTO was super long and I couldn't get passed the first 10 episodes. This was a good medium sized anime that I could force myself to watch(which unfortunately I did need to force myself). The characters were semi enjoyable from time to time. I laughed at certain parts and became curious about certain issues that arose. However for those of you looking for romance, there is none. Not sure why there is a romance tag. There are a couple hints that romance could be had, but nothing ever happens. The whole \"YD\" and \"Amusing\" premise that they kept shoving down my throat was less than interesting to me as well and often found myself being assaulted by my own boredom. In a show like this i feel like they would have done better by highlighting the characters strengths in more detail. It just felt shallow and not well thought out.\\n\\n\r\n TLDR:  If you have time to kill and want to watch kids with odd personalities try to make it in society then give Denpa Kyoushi a shot. Thanks for reading, have a good day.",
            "date": "2015-10-17T21:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 201467,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=201467"
        },
        {
            "content": "First thing in my mind is 'it will well to watch' since I really hooked with the theme and seiyuu, (well main seiyuu is Kamiyan). Enjoying first and second episode, but in the third episode I didn't really know, why I have the imoutou of protagonist. And after looking for 5 episodes, I dropped it.\r\nI hyped because the theme is 'otaku's genius' and saw first episode was epic. But next story just so bland. I don't know because it's seiyuu, since I know that Rena Matsui was graduated member of idol, or just me because my preference.\r\nI hope in the next work, they can upgradeit well.",
            "date": "2015-12-20T09:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 206123,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/350975.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/serene-grace49",
                "username": "serene-grace49"
            },
            "url": "https://myanimelist.net/reviews.php?id=206123"
        },
        {
            "content": "Finished it. Sigh. This anime was frustrating to watch - every episode is hit or miss, and there are more misses than hits. To put it bluntly, it is an seriously inferior version of Great Teacher Onizuka... except that instead of delinquent you get an uber-otaku genius teacher. I didn't like it, but rated it as 5, because of the effort put into it. Detailed breakdown below:\r\nStory: 3/10\r\nHonestly, it is not good. It follows similar pattern as Great Teacher Onizuka or maybe even Assasination Classroom, but the problem is that it wastes quite a lot of the time trying to prove that \"otaku are peopletoo\" and trying to appeal to various popular trends/niche interest/hobbies. Occasionally there are amazing episodes (I really loved 3rd episode), but their number is depressingly low. Another issue is that \"otaku powers\" of main character surpass anything reasonably possible, which makes story harder to believe. Some of the events are pointlessly overdramatized to the point where they may look cruel (this happens only two times, though). Because of all this it is hard to take the story seriously. It doesn't help that cast of characters is less charming than Great Teacher Onizuka was.\\n\\n\r\nArt: 5/10.\\n\\n\r\nStandard \"modern\" arts with relatively low detail, fairly solid overall (and it doesn't look cheap). Looks better than mahouka, but it is not a \"realistic proportions\" type of anime, and it is less detailed than, say.... Spice and Wolf or even Shokugeki. Art does its job, it is done relatively well, but it could be better. \\n\\n\r\nSound 4/10:\\n\r\nMostly does its job, but does not stand out, and I think one of the themes annoyed me.\\n\\n\r\nCharacters: 4/10.\\n\r\nOne and possibly only amazing character here is protagonist's sister (suzune). Scenes where she get confused by her brothers are interesting to watch, and for some reason her character looks much more believable personality-wise. This may be happening because her voice acting is much more reserved than usual anime, which, amusingly, makes it more life-like. One of the side characters  - kanan chinami - was interesting to watch too, but only for the duration of the arc where she was introduced, and her behavior promptly deteriorated afterwards. The rest of the cast has less personality to display, acts in stereotypical manner and in general less believable. \"Sensei\" himself is fairly uninteresting character, with unreasonably high mental and computer skills. \\n\\n\r\nEnjoyement 4/10:\\n\r\nI liked few episodes, but overall the anime was a disappointment. It is drop in a quality compared to Onizuka, and it spends too much time pandering to niche interests and hobbies or trying to prove that \"otaku are people too\". \\n\\n\r\nOverall: 5/10\\n\\n\r\nI'd say 5/10, because they put effort into it, but overall I think you'd be better off watching Greater Teacher Onizuka instead. Most likely it is more appealing to teens or younger teens.Basically, check first three episodes, and see if it is your thing or not. The quality is roughly the same throughought the whole anime.",
            "date": "2017-04-22T17:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 246071,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=246071"
        }
    ]
]