[
    [
        {
            "content": "They say that variety is the spice of life, but if that's true, then why is there such a lack of it in anime and manga? Part of the problem stems from the fact that there seems to be a certain number of themes that can be considered the \"bread and butter\" of the industry, but the subject of dreams is surprisingly not one of them. This is more than a little odd as Eastern folklore is littered with stories about dreams, and one has to wonder why such a rich and varied theme tends to be ignored.\r\nSo what is a dream?\r\nThere are those whobelieve they are nothing more than one's subconscious mind doing a bit of \"housecleaning\", whilst others claim that there is a supernatural element that can be defined and translated to provide a message to an individual. Many people believe that dreams are simply flights of fancy that occur while one is asleep, and almost everyone has used the term in reference to personal goals. The common misconception though, is that while they are often weird, and maybe a little unnerving (this includes some real life ambitions), they are also harmless. What people tend to forget is that a nightmare is also a dream.\\n\\n\r\nBut what happens when dreams and reality merge, and just how important are they to a person?\\n\\n\r\nBased on the manga byYoshitaka Ushiki, Yumekui Merry (Dream Eater Merry), tells the story of Fujiwara Yumeji, a high school student who has the ability to see auras around people that allow him to predict what kind of dream they will have. Unfortunately his own dreams involve him being chased by armed cats, but all of that changes when he meets the mysterious Merry Nightmare.\\n\\n\r\nThe story features several interesting dream related elements that offer some food for thought, and while there are a few rather lacklustre attempts at comedy, the series manages to retain a reasonably serious atmosphere. That said, the cliche manner in which the two leads meet does a good job of negating the generally forthright approach to character introductions, and shattering the illusion of seriousness. Granted the two have to meet in some way, but did it really have to be that?\\n\\n\r\nIn addition to this the plot contains several typically shounen themes that act as a foundation for development of the story, which is a bit of a shame as while there are some explanations on offer about certain events, there are also a few glaring omissions that can leave viewers wondering how everything fits together. Yumekui Merry also suffers from the fact that all of the action takes place in a particular area, and generally involves people in a particular age range, which immediately raises several questions that are never answered.\\n\\n\r\nThe design poses an interesting dichotomy as on the one hand the series adopts a very typical formula with regards to characters and environs, yet on the other there is a degree of imagination and innovation on display, in particular where supernatural characters and otherworldly realms are concerned. While this is obviously a purposeful move to highlight the difference between reality and dreams, J.C. Staff haven't really made the effort to break new ground (and seem overly addicted to Merry's navel), and because of this Yumekui Merry retains a humdrum quality that makes it difficult to take seriously.\\n\\n\r\nAs for the animation itself, the series does achieve a very high standard, especially during a few action set pieces, but there's no real consistency to the quality so these high points are more the exception than the norm. There are many scenes where things could have been timed better and movements could have been sharper, so it's somewhat annoying to find that the effort hasn't been made to raise the bar in any way.\\n\\n\r\nThe opening sequence features the typical character introduction montage blended with some action that never appears in the anime proper, all against the J-rock/pop stylings of Daydream Syndrome by Fujiwara Marina. That said, the ending theme attempts to keep things simple with a boppy little J-pop track (Dreams And Hopes And The Me Of Tomorrow by Sakura Ayane), set against an image of Merry that is gradually being revealed from underneath flower petals.\\n\\n\r\nUnfortunately one of the biggest problem areas is the background music as there are a number of tracks that don't seem to mesh well with the on screen action or appear to be completely unnecessary. In addition to this there are also issues with the levels, and all too often whatever track is playing will lay the foundations of a veritable cacophony when large audio effects kick in or characters begin speaking loudly. Unfortunately these issues could have been easily rectified during the recording process, so one has to wonder if there has been a poorly executed attempt to enhance the atmosphere of particular scenes, or simply a continuous oversight during production.\\n\\n\r\nThat said, there is some decent performances from Okamoto Nobuhito (Fujiwara Yumji), and Sakura Ayane (Merry Nightmare), but this is only in comparison to the rest of the cast. A large portion of the acting is nothing more than lines by rote which can be attributed to a script that's more than a tad juvenile, and this truly is a shame as the cast are a talented bunch for the most part.\\n\\n\r\nYumekui Merry features a variety of personalities that one might find in any number of highschool anime, yet while there is a certain amount of depth applied to several prominent characters, this never really feels like true development. It seems as though the producers have decided to follow a method that attempts to define the characters rather than make them grow, which is unfortunate as this approach can only really yield good results when there is a decent amount of characterisation from the start.\\n\\n\r\nSadly, there isn't.\\n\\n\r\nAside from the generic looks and routine personas, it's only Yumeji who appears to have any sort of detail at the start of the story, and part of that stems from the manner of his introduction into the tale. While one might argue that Merry's introduction also constitutes definition of sorts, nothing substantial is done with her until the latter half of the series. Most of the characters are apportioned a certain amount of screen time to tell a highly abbreviated version of their personal history or future goals, but there's very little emotion involved in this and the story can sometimes feel like more of a writing exercise than anything else.\\n\\n\r\nEven with the flaws there's still something to this anime that manages to raise it from mediocrity, and that's the interesting ideas it can spark about dreams and how important they are to a person. While the explanations of cause and effect are a bit on the simplistic side, they can also be somewhat original and unusual, and this helps to retain the viewer's interest in the story. In addition to this the main thrust of the narrative is well conceived, even if the execution is lacking, and the generally serious tone of the story helps to offset the fact that Yumekui Merry can be a chore from time to time.\\n\\n\r\nOne thing that should be pointed out is that the series has a very clear \"kids versus adults\" mentality that seems more a convenience for its own sake than an outright declaration that everyone over a certain age is \"evil\", which makes it pretty obvious who the target audience is for this show (as if the highschool wasn't already a dead giveaway). The ending also lacks a degree of substance due to its slightly hurried nature, and many of the concepts in Yumekui Merry aren't fully realised, but given that the manga is ongoing it will be interesting to see where things go from here. While the series barely manages to hold it's own against the likes of Yume Tsukai (which isn't really all that impressive to be honest), there's an earnestness that appears from time to time that really should have been more prominent as it would have offset the lethargic productions values.",
            "date": "2011-05-18T14:31:00+00:00",
            "helpful_count": 192,
            "mal_id": 37108,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=37108"
        },
        {
            "content": "So what are dreams? \r\n\"a series of mental images and emotions occurring during sleep\"\r\nPfft.. Don't just give me the definition from the first thing you googled...\r\nAnyways, Yumekui Merry, or \"Dream Eater Merry is an anime based on a manga by... Christopher Nolan??? Hah, I wish, but then the story would get more complicated than it is.\r\nIn fact, the anime series was directed by Shigeyasu Yamauchi, produced by\tHideki Shirane and written by\tUshiki Yoshitaka. \r\nYeah, I know all of you Nolan fanboys (or girls) are going like, \"YEAH!! Christopher Nolan was director, producer and writer but the japanese needed 3 guys to make a show about dreams..\"\r\nWellmy friend, thats a failed analogy to compare movies and animes. I can't believe you just did that... I mean... Seriously??\\n\\n\r\nBefore I proceed with the story review, let me clarify with some of you the terms used that may help you understand more about the story (For those who haven't watch)\\n\r\nSPOILER: To those who wish to enjoy the series by figuring out themselves what this anime is all about, please skip the story section.\\n\\n\r\nDream World: The other dimensions where the habitants consists of mumas.\\n\\n\r\nMumas = Dream demon who wish to possess human to use them as a vessel.  They can either take over their host, or co-exist with them\\n\\n\r\nDay Dream: Is the process where the Mumas extend their territory by \\n\r\nbringing their host or vessel into their domain while they are still conscious\\n\\n\r\nWet Dream: Nocturnal Emissions a.k.a j**zing in your pants while you sleep.\\n\\n\r\nSo I quite like the story because they did not bombard us with the entire plot by the first few episodes. Quite many enjoy this series for their way of slowly letting the audience discover what this anime is all about. And the plot isn't too cliched as well. This is infact the first anime series I've watch in the Spring/Winter 2010/2011 line up that doesn't have a male harem lead character eventhough it clearly have the potential! \\n\r\nHowever, the story about other dimensions and different creatures with different types of powers living in those dimensions feels all too familiar. So I can't give any points for this one.\\n\\n\r\nNow of course, if this was a dream anime you would expect the art too be all abstract like you dreams right? Well true it does have its charms but I got the feeling that the fighting sequence was getting lazy as the story progressed. I dont know, maybe the animators haven't been getting any good dreams lately. What about sound? Well I dont remember background music playing during my dream session but this anime had their BGM well under wraps. \\n\r\nI especially loved the opening theme song, then I noticed that IOSYS was responsible. Hah, no surprise there..\\n\\n\r\nCharacters! Eventhough I only enjoy reviewing harem characters, but I'll make this one an exception. Why? Cause I know you guys love skipping to the character part and ignore every other parts of my review. \\n\\n\r\nYumeji Fujiwara. Has the awesomest power ever!!! He can detect if a person is going to have a certain dream on that night! Isn't that cool?? And he can even do that to himself as well! That was you can sleep longer when there he detects a wet dream and don't sleep when there is a nightmare..\\n\r\nOk yeah... So I was trying to make it sound cool but it seems you guys didn't buy it. Oh darn, I was stupid trying to fool otakus whom clearly wish for better powers like the ability to manipulate vectors or something pfft...\\n\\n\r\nAnyways, like any typical japanese anime character, he has a childhood friend who is yet again a GIRL named Isana Tachibana. Seriously Japan? Can anyone in Japan actually confirm this with me that it's so easy to get a childhood friend who is the opposite sex? I mean maybe because I never had one that made me so envious of them. Someone to be a love interest but is gonna get friendzoned anyways.. Sigh..\\n\\n\r\nSo Yumeji's been living alone and in no circumstances they told us what happened to his parent or I don't remember because too many male characters are deprived from their parents. He is a lazy, yet strong-willed and determined person with a heart of gold, who is always ready to help others. He is also a member of a writing club at his high school, and is a big fan of the superhero called Sprain? Who sprains himself each time he acts in the name of justice? Wow why would he even become a hero then if it hurts him?? Yumeji meets Merry when she falls on top of him as he comes back from his errands, (You know the typical cliched scene) He has firmly decided to help Merry to come back in the Dreamworld, and eventually becomes her partner, using his ability to scout out nightmares so Merry can hunt them\\n\\n\r\nNow I wont explain much about Merry because that would take the thrill away from discovering what she is for thos who haven't watch the series. Let's just say she enjoys eating doughnuts and playing video games.\\n\r\n\"OMFG!! MY DREAM GIRL!!!\" Get it? Because she's from a dreamworld? and she's a girl which also means..... Oh c'mon can't a guy tell a lame joke without getting dissed?\\n\\n\r\nAnyways, Merry is your typical female heroine which is quite popular in the anime scene right now. \\n\r\nWussy guys + Powerful girls =  Homosexuals\\n\r\nWait that ain't right..\\n\\n\r\nThe enjoyment in this anime for me was as mentioned above, slowly discovering what the whole story is about. At the same time we see the bond of friendship developed between Yumeji and Merry. There is a possibility of this going into deeper feelings but please, not every anime have to be about love... And since this is based off a seinen manga, kiddies are not recommended to watch this anime. No, Im not saying this because there are sex scenes! What you dont believe me?? Fine go ahead and watch... And prepare for your MIND TO BE BLOWN... Seriously, kids, if you scratched your heads until it bleeds when you watched Inception, I doubt you would enjoy this one. Fighting sequence isn't that impressive but it's still above average and does compliment the anime well\\n\\n\r\nOverall, watching this anime changes my perception of dreams. They're not recollection of memories, they're actually other dimensions and dream creatures are trying to take over our bodies! So those voices I hear in my head are real and Im not crazy! Oh wait, false alarm, that's just me thinking to myself. And it's telling me to click Submit Review without Previewing it first.\\n\r\nMust resist urge.\\n\r\nResistance Failed.",
            "date": "2011-02-19T07:30:00+00:00",
            "helpful_count": 85,
            "mal_id": 34576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=34576"
        },
        {
            "content": "When Yumekui Merry started at the beginning of the Winter 11 season I felt it was going to be good show. It had an interesting art style, the characters were likable, and the production was done by JCStaff. An animation studio that I adore for making previous works such as Kaichou wa Maid-sama and the Index series. But something went wrong. Everything fell apart by the end. Plot holes, ruined characters, inconsistent art, and one of the worst finales I’ve seen in a long time. And, yes, I have seen a LOT of anime. \r\nAnimation wise, Yumekui Merry had an interesting approach during the dreamsegments for the first few episodes. I was really intrigued. The watercolor approach worked well for the series and the character designs were charming. The show was full of stills (meaning no movement or very minimal amounts kind of like a slideshow), but hey they were at least pretty stills. Sort of. Then the art lost all its style at the end. Gone were the interesting art choices and the art became inconsistent during the last few episodes. Misty’s face during the last episode comes to mind.\\n\\n\r\nThe OP/ED were good. The ED animations were nice. It had some dang midriff. I like me some midriff. The soundtrack was glaring. It was an awful strange choice to choose orchestra music for the more intense fight scenes. I don’t know... it felt really out of place. I mean come on. Why would you put bassoons in a fight scene? The voice acting was okay. Nothing to complain there. Merry's VA is totally new and it was her debut role. And Okamoto Nobuhiko always makes me go crazy as Yumeji. (Okamoto is personally one of my favorite voice actors, so I'm biased.)\\n\\n\r\nThe plot is where everything falls apart though. You’re lead into the first episode with a dream demon who can survive in the human world. Wonderful. Our main character has the power to see what people will be dreaming the next night by making a circle with his fingers. Uh weird, but uh interesting. Throughout the first half it was really formulaic. I mean it was basically fight dream demons and send them back to the dreammmm world. It gets boring. So the anime studio then decides that during the second half the plot gets more of a direction, but loses all plans to keep a coherent plot. The ending was awful. Things are developed, but never really mentioned again. Kawanami's character, John Doe, and that one dude that got possessed by a dream demon. And some nonsensical things happen as well. (Yui playing her invisible trumpet comes to mind. What the heck? Why? Did she bump her head? Did she suddenly decide that she was in a band? Is she the one playing the dang bassoon. Dang it Yui. Dang it.) \\n\\n\r\nMistletine was a good evil villain. Her back story was basically that she likes to be evil and does evil things. Alright, that’s fine. There’s just one thing I have on her. And that is that Misty (Mistletine) has a severe case of ADD. She's fighting the heroes of the anime and then she just gets up and leaves them, so she can enjoy them next episode? What? Why? That makes no sense? Did she get bored? Did she get tired? No, it looked like she had enough energy to insult them. Why? Oh yeah. It’s not the last episode. We can’t have you guys finish each other off till the last episode. Silly me. That’s a perfectly reasonable answer. \\n\\n\r\nAlso the teacher (Who I can’t remember his name for some reason. And all I remember about him was that he wears the ugliest striped pants I’ve ever seen.) was kind of bleh. I do like his facially expressions though. They were hawt. Kawanami was the worst character in the series. She felt soooo tacked on. Was her only purpose in the story was so Isana could make friends? Isana has plenty of friends. She has Merry and she has her brother. Well, I guess that isn't much, but still. Kawanami was an anime-original character (same with stripped pants sensei and Misty) but she felt like she had no purpose in the plot. JCSTAFF WE NEED SOME FOCUS IF YOU ARE GOING TO INTRODUCE ANIME-ORIGINAL CHARACTERS. \\n\\n\r\nI mean having an anime-original plot is fine if you do a good job with it. Having anime-original character is fine if you develop them well, but JCStaff didn't. Did JCStaff suddenly decide that the manga wasn’t good enough? If it wasn’t good enough, then why did they choose to adapt this series? I like John Doe. (John Doooooo) I seriously do. I like his name. I especially love how the other characters call him John Dooooo when his named is spelled John Doe. He was cool. Too bad he like totally disappeared, so the anime-original characters can appear.\\n\\n\r\nI feel like there is so much wasted potential here, plot holes, useless anime-original characters, inconsistent art, and Yui playing her imaginary trumpet. I do feel that there are a few good parts in this show, but there are far too few in a sea of bleh. As in my case it’s very hard to recommend this anime. It might be good, maybe, after in taking some alcohol. But whatever. It’s done. JCStaff please do a good job on your next series. I don’t want to see no anime-original characters or plot, unless you can develop them properly, and I definitely don’t want to see your next main character play an imaginary trumpet.\\n\\n\r\n* Nothing is as frustrating as writing a review twice; due to my laptop crashing down right when I click submit. Review is also on AnimeNfo.com",
            "date": "2011-05-08T19:58:00+00:00",
            "helpful_count": 62,
            "mal_id": 36855,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73459.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/shuffleair",
                "username": "shuffleair"
            },
            "url": "https://myanimelist.net/reviews.php?id=36855"
        },
        {
            "content": "There are many ways to interpret the definition of a dream. Is it the manifested world of our imaginations? Is it the parallel world that we live in while we sleep? Or is it the final goal, the end of the path that all of our goals and motives lead to? Yumekui Merry implicitly engage us in an intriguing tale of dreams; of dreams that are reached and dreams that are shattered. Of friendship and contracted promises, and of betrayal and wily deception. Yumekui Merry narrates a scenario that can be enjoyed by all people alike, by people with dreams that may have come true,or of people with dreams that lie in wait for the day that they may be manifested.\\n\\n\r\n-= --- Story --- =-\\n\\n\r\nFrom the producers of Blood + and Dragon ball Z, Yumekui Merry starts with bang. Yumekui Merry is certainly not one of those animes that lags around in the beginning; rather, grabs our attention immediately by giving the protagonist an unexpected disaster from above that ends in a very special acquaintance. All in all, Yumekui Merry narrates the pivot point of the life of Fujiwara Yumeji, who can see the inner atmosphere of the people around him, and can predict the type of dream the person will have that night based on this inner aura. The story pivots sharply as Yumeji meets a strange girl called Merry Nightmare. The story is one of the most original plots that have been made yet, incorporating concepts of that not unlike the movie “Inception”. In addition, the plot goes through many interesting twists that keep us guessing the next turn of the plot.\\n\\n\r\n-= --- Animation --- =-\\n\\n\r\nI found the drawings of Yumekui Merry extremely interesting and contrary to the usual graphics of contemporary anime. Although Yumekui Merry incorporates essentially the same type of portrayal of the outward appearance of characters as other animes, with the same background in the “normal” world, the graphics of scenes in the dream worlds are wholly different. Not only do objects not follow the laws of physics, what we would normally conceive as the effect of one action differs completely from the actual effect that is shown. Despite others who argue that the art of anime is not particularly appetizing to watch, I see it as part of the twists that make Yumekui Merry the attracting anime it is, that’s quickly rising through the board.\\n\\n\r\n-= --- Sound --- =-\\n\\n\r\nThe soundtrack of Yumekui Merry is also part of the twist that makes up its personality. One of the aspects is that it defies the basic rule of using clashing dissonance of die-hard rock music and screaming guitars; instead, Yumekui Merry surprisingly chooses to use the romantic building sounds of a group quintet orchestra consisted solely of violins and violas. This effect makes the fight all the more enjoyable. From an unexpected transcribing, the fight shifts its position. As the music builds into more intense chords and arpeggios, the fight climbs to its climax. The experience is particularly exhilarating as the violins play in sync together in a strangely baroque tone to build up the rising action as the fight leads to its climax. I found that other reviewers also criticize the producer for giving the anime such an unfitting soundtrack, but as we will see while watching Yumekui Merry, the experience proves otherwise.\\n\\n\r\n-= --- Character --- =-\\n\\n\r\nThere character development is the one weakness of the anime. Although it is clearly marked that a few characters progress and change throughout the anime significantly, the relatively minor characters (not to say that they aren’t important) do not have such a change. Although there exist flat characters, we grow to be fond of the protagonist and cheer them onwards throughout the anime. The protagonist Merry is especially lovable due to her engaging character and her nonchalance and ignorance to everyday things such as video games and groceries. Besides the protagonists, the minor characters, despite that they remain the same throughout the anime, are very interesting. I especially appreciated the character of Takateru Akiyanagi, the boy who constantly expresses his feelings and thoughts as through haiku; this shows an extremely keen sense of creativity that is parallel even to Angel Beat’s T.K.\\n\\n\r\n-= ---Enjoyment --- =-\\n\\n\r\nYumekui Merry is especially enjoyable. Not only does it make the everyday aspects of school life as interesting as it can be by creating character development, but it also has many enjoyable fighting scenes that gives ecstatic feelings of greatness. As the anime progresses, we will be enthralled by the ever thickening plot as we try to guess the next possible action that the protagonists will take. \\n\\n\r\n-= --- Overall --- =-\\n\\n\r\nYumekui Merry is an extremely underrated anime, not because it lacks charm and glamour – it has an abundance of those – but very few people know of its existence. Do not be motivated to skip this opportunity of inspiration just because no one recommended it. Yumekui Merry is actually a very interesting anime, and it does not take long to find out.\\n\\n\\n\\n\r\nReviewer’s note: Thanks you VERY much for reading this especially long review. I purposefully did not add ratings to this review. I feel that reviewer’s ratings never appeal to the reader, and who even cares about how I feel about the anime right? Regardless, I tried to revise this (my second) to create an effective review that will not only encourage the reader to watch Yumekui Merry, but also have a realistic idea of Yumekui Merry. If you did not like this review, please give me advice so that I can improve my horrible writing skills, and write a better review next time. \\n",
            "date": "2012-08-05T11:57:00+00:00",
            "helpful_count": 49,
            "mal_id": 68785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291057.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/imjustjk",
                "username": "imjustjk"
            },
            "url": "https://myanimelist.net/reviews.php?id=68785"
        },
        {
            "content": "The day after Yumekui Merry last episode was aired, the police received 3 simultaneous reports of \"weird incidents\". Those weird incidents seemed unrelated at first; different victims, different places, different circumstances… But deeper investigation proved they all had 1 thing in common. All the victims had watched all the episodes of “Yumekui Merry”. That’s why the incidents were ironically named \"The Merry Incidents\" by the internet user community.\r\nThese are the stories of the victims of this show, who are no longer among us to tell them.\r\nCase 1: The Director\r\nStory: 3\r\nFukuyama, Takumi was an independent film director who enjoyed watching films and anime full of meaning,with well articulated plots and interesting stories.\\n\r\nWhile looking at the Winter 2011 anime releases, there was one show that captured his attention, Yumekui Merry. He had dreamed about being a director since he was a young teenager and he was actually living his dream, so he felt that he would enjoy a story related to dreams. (Don’t worry about spoilers you won’t find any)\\n\r\nEpisode 1: Boy meets supernatural girl, the dream world and Merry are surrounded by a shroud of mystery, Merry cries. Takumi is intrigued.\\n\r\nEpisodes 2 – 3: Some side characters are introduced, not much about them is told and they relation with the plot is unclear, bad action scenes, the dreamworld is still a mystery, Merry cries. Takumi feels a little confused and disappointed, yet he pushes through and keeps watching the show, hoping to get some answers.\\n\r\nEpisodes 4 – 6: The amount of side characters keeps growing just like the amount of unanswered questions about everything regarding the main plot. Every fiber in Takumi’s body is screaming “Drop this show before it’s too late!”, but he can’t. He feels like it wouldn’t be fair to judge a show that’s halfway through. Takumi notices that he is eating less than he normally does.\\n\r\nEpisodes 7 - 8: Baffled by the lack of sense and poorly animated fight scenes, Takumi stood still for 3 days, unconsciously staring at the turned off screen. His body is slowly giving up.\\n\r\nEpisodes 9 – 12: Takumi is deranged. He has no regard for personal hygiene anymore, he started peeing in empty bottles and taking dumps in the trash bin. He is starting to run out of bottles and the trash bin is almost full. Only a good final episode can save him now.\\n\r\nEpisode 13: After finishing this episode, what was left of Takumi broke. He picked up the trash bin and started writing “It doesn’t make any sense” with feces, in his dining room walls. “I ran out of paint” muttered Takumi as he blankly stared the shit covered walls. “Ah… I have an idea” said with a bitter smile, after thinking for a few seconds.\\n\r\nA week later he was reported missing by one of his coworkers, the police broke into his apartment and found the body of Takumi laying in a pool of his own blood.\\n\r\nIt didn’t take much time for the police to find out what had happened. Half of the walls were painted with shit, the other half… With blood. \\n\\n\r\nCase 2: The Prodigy.\\n\r\nArt / Animation: 5\\n\r\nNanaya Kenichi, was the perfect student. His stern father always pushed him to get straight A, saying that he would not accept to have a son who thinks that it’s not important to be the best  That’s why Kenichi had been getting nothing but A in every subject for all his life, even in “Art and Expression” which was the hardest one for him.\\n\r\nOne day he received an assignment in that subject that got him worried. “Present an animation about anything you want”. Certainly creativity wasn’t one if his virtues, he had great memory but low inventive.\\n\r\nHe resorted to the Winter 2011 anime releases list to get inspiration, and decided to try his luck with “Yumekui Merry” since it had two interesting designed characters in the promotional image.\\n\r\n“Hmm, so this is how you do it” thought Kenichi after finishing the whole thing. He immediately started his animation, brimming with enthusiasm and confidence.\\n\r\nThe next day he presented his animation in class. Link vs Megaman: Link and Megaman fight over the last “six-pack” at the Wallmart.\\n\r\nKenichi got an “F”. But it wasn’t the ridiculous plot the issue, it’s just that he drew Megaman and Link in great detail while they were standing still, and then drew them all disfigured and half-assed while moving / fighting. Just as he had learned from watching Yumekui Merry.\\n\r\nNeedless to say, his father didn’t take the news too well. Kenichi was kicked out of his own house and had to live in an orphanage. There, he was constantly bullied and eventually raped by his fellow orphans and wardens.\\n\r\nOne night that Kenichi was crying his hearth out with his head buried in his pillow, he heard the gentle voice of a girl. “Come” said the voice, “Kenichi, come”, insisted.\\n\r\nKenichi rose his head and saw Merry standing by the door and calling out to him. Dumb footed he stood up and quietly followed Merry to the orphanage rooftop.\\n\r\n“I need to tell you a secret, a very important secret” said Merry, standing at the edge of the 5 stories orphanage rooftop.\\n\r\n“What is it?” replied Kenichi, half curious, half scared about the answer.\\n\r\n“I need you to get closer, or else I can’t tell you” said Merry with a gentle smile.\\n\r\n“No, it’s dangerous… This is too weird, I’m going back to bed”. Said Kenichi as he turned around and headed for the door.\\n\r\n“Don’t you miss your old life Kenichi?, if you listen to what I have to say, you will get your life back. Your family, your home, even your dog”\\n\r\nKenichi froze, he couldn’t take another step away from her. Instead, he slowly started walking towards her, as if someone else was moving his body.\\n\r\nWhen he was about to reach Merry, he tripped and fell over the edge, a cracking noise resounded in the orphanage on that silent winter night, Kenichi broke his neck as soon as he hit the ground and died instantly.\\n\r\nA warden came investigating the source of the noise. He found Kenichi’s dead body, and in his hands a drawing of a curious looking girl, the draw was titled “Merry”.\\n\\n\r\nCase 3: The Dreamer\\n\r\nCharacter / Character Development: 3\\n\r\nWatanabe Hiroshi, 32 years old, married for 8 years and father of two. He had dreamed of being a mangaka when he was younger, he even came up with a pen-name: “Watahiro”. But life isn’t a fairy tale, soon financial pressure made him give up on his dream and take whatever job he could get, in order to support his family.\\n\r\nAfter 8 years working in the dull and meaningless job of selling insurance policies, he found an advertise of an important manga publisher that would change his life forever. “Manga contest: Wining prize 800.000 YEN (roughly under 10.000 USD) and a contract for 5 years”.\\n\r\n“This must be destiny”, thought Hiroshi. He knew that if he wanted to win, he would need to make something new, something fresh. The contest deadline was close so he didn’t had enough time to resort to manga for inspiration. Anime seemed like the most reasonable choice.\\n\r\nHe had not watched any anime since 2003 so he needed to watch a new show to get a feeling of current trends. “This one looks interesting” said Hiroshi while reading Yumekui Merry synopsis.\\n\r\nAfter watching the entire show he secretly started working on his manga, based on what he had learned from Yumekui Merry. Working during the day and hiding the manga production from his family was extremely tiring. Hideoshi realized that he wouldn’t finish on time unless he could find more time to work on his manga. So he took a decision.\\n\r\nHideoshi left his job and keep it a secret from his family. Everyday he would bathe and change for work, then he would go to a park near his former workplace, where he would draw, and return home by the time he would return from his job.\\n\r\n“They won’t understand if I tell them now. It’s for the best, once I win the contest I can explain, and finally do what I love for living. Yes everything will be ok”, said Hideoshi with a smile, while drawing at the park.\\n\r\nAfter a month of hard work he barely finished his manga the day of the deadline. He proudly sent it to the publishing house, and returned home full of expectation.\\n\r\nIntense traffic caused him to return 2 hours later than usual, when the family is having dinner. But to his surprise the house was empty. Worriedly he scouted the rooms, looking for any clues of his family location. “Maybe something happened to one of the kids and they had to rush to the hospital”, thought Hiroshi.\\n\r\nEventually he went to the kitchen, where he found a letter that had been written by his wife that same day. The letter contents were as follows: “Today I used the credit card and it was rejected. I called to your job to talk to you about it and they told me you have quitted last month and they haven’t seen you since then.\\n\r\nYou have been lying to me and your children for the past month, without even blinking. I don’t even care about what you have been doing until today, it’s inexcusable and unforgivable. I’ve taken the kids with me, I have already told the kids that you are dead, don’t try look for us or I swear I’ll kill you.\\n\r\nI’ll send you the divorce papers once I’ve settled down.”\\n\r\nHiroshi cried for several days, but the possibility of wining the manga contest finally soothed him. “That’s right, after I win the contest I’ll get my family back. I’m sure I can explain it somehow. She must probably think I was having an affair or something, that’s why she got so mad.”\\n\r\nThe days went by and the expected letter from the contest didn’t arrive, after countless days of waiting Hiroshi picked up the phone to call the publishing house but he had no line. “What?, I’ve paid last month, this is outrageous. He tried to turn on the computer but it didn’t respond. “Maybe there is no power… No it can’t be that, the lights in the kitchen and living room are on. It must be broken.”. Hiroshi checked his watch “eight o’clock, I guess I’ll be going to sleep early today.”.\\n\r\nThe next day he woke up and checked the mail. “Still nothing” said disappointed, “well, the day is just starting, they can still deliver it in the afternoon. What time is it anyway?”. When he looked at his watch, a chill went down Hiroshi’s spine. “8:00 PM?... no this can’t be right I can’t have slept for 24 hours. My watch have stopped, that must be it.” after confirming that his watch had stopped, Hiroshi stepped outside the house to ask someone the time.\\n\r\n“How weird it’s already nighttime, I wonder what time it really is”, thought while walking. After a long walk he couldn’t find anybody, everywhere was deserted. After a while of aimlessly walking around the neighborhood, he returned home disturbed about the lack of people.\\n\r\nIn front of his house, there stood a girl with a white dress; she had an air of purity.\\n\r\n“Finally someone!, do you know where is everybody?”, asked Hiroshi worriedly.\\n\r\n“Everybody is here, you just can’t see them”, answered the girl in a calm voice.\\n\r\n“What do you mean?... But why can’t I see them?”, as he asked, deep inside he felt like he already knew the answer to his question.\\n\r\n“Because you are dead” said the girl.\\n\r\n“You are lying that’s just stupid, I can’t be dead im standing right here”, he acted like he brushed away her answer, but somehow he felt very uneasy\\n\r\n“When was the last time you ate breakfast?. When was the last time you taked with anybody?. When was the last time you used the phone?”. The girl kept asking questions that would have been easy to answer by anyone, but for some reason Hiroshi couldn’t find the answer to any of those questions.\\n\r\n“I.. I… no this can’t be” said while covering his ears with his hands as if to “unhear” what he had just heard.\\n\r\n“Enter your house, you will find the truth inside” said the girl.\\n\r\nHiroshi stepped into his house. The house looked nothing like how it was when he left a few hours ago. It looked like it had been abandoned for a while, the mailbox was full and a strong smell could be perceived. As he entered the living room he couldn’t believe his eyes.\\n\r\nHe saw his dead body, in a sitting position with his back against the wall. Over the table there were two letters, one was the letter his wife had left, and the other was from the publisher. The letter from the publisher said: Mister Watanabe, we regret to tell you that your manga didn’t win the contest. The reason is that you introduced too many characters to the story, without giving the audience proper background to understand their behavior and make their motivations clear. Ultimately you could have resorted to pander the audience fetishes, but you didn’t even do that. You just had a bunch of random characters, doing unrelated events for entertainment sake. And it actually wasn’t entertaining at all. Just like that “Yumekui Merry” crappy show. Better luck next time.”\\n\r\nAfter he finished reading the letter, the girl stepped into the room.\\n\r\n“How did I die?”\\n\r\n“You thought the letter was a prank, and that the real one would eventually come. So you sit there waiting for a month until you starved to death. Your desire to receive that letter was so strong that your spirit neglected your death. And since then you have wandered this house oblivious of what happened. \\n\r\nBut yesterday when you found certain inconsistencies yesterday the phone and the computer you started to get aware of your situation, and deep in your heart accepted it. That’s why I came, because I heard your calling.”\\n\r\n“For how long…?” he couldn’t even finish the sentence.\\n\r\n“One year”\\n\r\n“I see…. And now what?”\\n\r\n“Now we go, I’ll take you to where you belong now”\\n\r\nResigned, Hiroshi took the girl’s hand and they disappeared into a white light.\\n\\n\r\nSo heed my advise. If you don’t want to experience a “Merry Incident” stay the fuck away from this show. I specially recommend people who have read the manga to stay the fucking fuck away from this, couse the original story gets butchered and anal-fisted in the anime. Courtesy of your usual J.C Staff “Story Re-Write”.\\n\r\nSeriously, this anime is pointless. Watch something else, It’s for your own good.",
            "date": "2011-05-23T17:17:00+00:00",
            "helpful_count": 33,
            "mal_id": 37252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482401.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Faito",
                "username": "Faito"
            },
            "url": "https://myanimelist.net/reviews.php?id=37252"
        },
        {
            "content": "Watching Yumekui Merry was like riding a jeep down a long, bumpy road spanning several steep hills. When it was good, it was pretty compelling. When it was bad, it was almost impossible to slog through. Though the good outweighed the bad enough to not make me dread the next episode.\r\nNow, I don't expect anyone was especially thrilled to see another show that used every shounen trope to its fullest extent, with a bland male lead, an unstoppable and infuriating lead villain, and a plucky tsundere sidekick. \r\nThe story, which isn't properly divulged in the synopsis, is as such: Yumeji is your standard shounen protagonistwith the ability to read peoples' dreams by making a circle with his thumb and index finger. He meets a mysterious and flamboyantly dressed woman while experiencing a trippy dream sequence, and the two build a friendship that withstands any and all obstacles. That's about it. \\n\\n\r\nIn the beginning, there's nothing at all wrong with the story. The problem with it is, quite a few plot threads are introduced, toyed with for an episode or two, and never brought up again. \\n\r\nJust a warning, possible spoilers ahead. If you want this to remain as spoiler free as possible, skip down past the dotted line. \\n\\n\r\nThe first plot introduced is Yumeji's conflict with a dream demon who wants to use his body as a vessel. Okay, that's a good plot. And the demon can infiltrate his mind at anytime and plunge him into that dream state. Alright, that works. And the girl who he meets in there one day tries to help him out. Okay, excellent. Sounds like a good, semi-compelling series. But nope, a few episodes later it's dropped and only paid lip service less than halfway through, where it's resolved in an incredibly anticlimactic manner. And for the rest of the series, this entire plot is forgotten, which makes the synopsis utterly useless.\\n\\n\r\nNot a problem though, because a second plot is brought up by Merry, the plucky sidekick. She's also a dream demon, but all she wants is to return home to her world, and for that she needs to vanquish a few demons and use the portals that send them back to send herself back. Not nearly as interesting as the first, but it's still serviceable, and would allow for more freedom with character development. And thankfully character does develop... right up until the last third. \\n\r\nUnlike the first, this isn't forgotten, but just completely shoved aside for the standard plot. \\n\\n\r\nThe main plot, of course, being the need to vanquish an unstoppable evil through the power of friendship. You all know how this is going to go, so nothing needs explaining. \\n\r\n--------------------------------------------------------------------------\\n\\n\\n\r\nThe story is somewhat redeemed by a twist at about the halfway mark, and another at the two thirds mark, that's somewhat unexpected and casts what Merry does in an entirely new light. \\n\r\nIt would've been decent if they had just stuck with the main plot, without introducing all those abandoned subplots.\\n\\n\r\nThe characters are, for the most part, bland and uninteresting. Merry's the only one not of a cookie cutter design, but her personality is as standard for tsundere characters as it gets. Really, there's nothing here you haven't seen before. Heroes are likable, if somewhat dimwitted, and the villains are despicable in a way that you like them to be. Again, standard fare. \\n\\n\r\nSound-wise, Yumekui Merry employs a somewhat catchy OP and a pretty good ED, but otherwise unremarkable music. The characters are usually appropriately voiced. Not much worth mentioning either for or against the music or VAs. \\n\\n\r\nAside from the boring character designs, I must admit that the art of the various dream worlds used is quite excellent. Each world is haunting and surreal, from a moonlit wheat field swaying gently in the twilight breeze, to a warped town bathed in a bluish-green glow, surrounded by levitating fish skeletons. Otherwise, it gets the job done, and nothing more. The animation is fluid, the fights are fun to watch, and I was never left bored during the action scenes. \\n\\n\r\nYumekui Merry breaks no ground, preferring to tread water under pseudo-philosophical debates and questionable handling of the story. I understand that 13 episodes limits the schedule somewhat, but if the subplots were going to be underutilized like that, they should've been left on the cutting room floor. \\n\r\nOtherwise, it's more than watchable. Just don't expect to be wowed or walk away having felt richer for the experience. It's stupid, short fun, and sometimes that's what you need in life.",
            "date": "2011-04-10T16:04:00+00:00",
            "helpful_count": 29,
            "mal_id": 35887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=35887"
        },
        {
            "content": "Story and pacing: Our male protagonist is aspiring to be a writer and unknowingly plunges into a dimension between dream and reality.\r\nOP song: The song is an average Japanese rock ballad. Nice visuals, establishes Merry's role.\r\nED song: Pretty average for the song and the visuals. The visuals in the OP song were better.\r\nVoice acting: Top-notch voice-acting. Every seiyuu rightfully fits in his/her character and the display of emotions does not feel forced. Merry's dialogue is quite interesting too.\r\nBackground music: The background music is just epic. It is always present and manages to capture the mood. Very eclectic too, the instruments vary from violin to electricpiano. You can really see here that the budget is quite impressive.\\n\\n\r\n﻿Animation and character designs: Gawd I just love the background design for the dream world. The creature designs as well as the animation sort of remind me of  Studio Ghibli films such as spirited away and Princess Mononoke, and that is saying a lot, in a good way. The setting is well drawn too. You can really see that the background is intricately done. Even though the fighting scene was a bit lacklustre, I think, I hope, that this will improve in later episodes. I usually don't get all fluffy with moe characters but Merry's design is just so well made, especially when she was crying, and not to mention that that the animation is of high quality.\\n\\n\r\nCharacters: This is where the interesting part starts. Even though there are some cliché elements such as the protagonist having multiple love interests,one being his childhood friend-- a tsundere-- and another comes from a different dimension, none of these clichés feel too heavy and unbearable. The characters are rather sympathetic and the creatures are well done. I am happily surprised that Merry actually cried. I was not waiting for that at all because I though they would write her as a Tsundere. Not to mention that the antagonists are really fun to watch and the creators succeeded on creating this otherwordly and mysterious manners they have.\\n\\n\r\nStory and pacing: Anime series regarding connections about dream and reality are always my favourites. Their atypical storyline interesting character study never ceases to amaze me. It is the same for this anime; yes some parts may seem cliché but they never feel, as I said, too unbearable. The caricatural representation of the antagonist is really well done because it lets us know that at this point that the creators are not aiming for a serious anime series but rather a light-hearted, fun albeit very creative and intriguing one. As for the pacing, it was neither fast nor slow, it was perfect. Not to mention that they managed to introduce a large cast of character in a single episode, quite well in fact.\\n\\n\r\nWhile I continue to watch this?: Yes",
            "date": "2011-01-09T03:36:00+00:00",
            "helpful_count": 27,
            "mal_id": 33587,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429503.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/juliancan",
                "username": "juliancan"
            },
            "url": "https://myanimelist.net/reviews.php?id=33587"
        },
        {
            "content": "Yumekui Merry is another one of those anime that is based off an interesting idea and had the potential to be better than what it was.\r\nThe anime starts off with our main protagonist, Yumeji Fujiwara who meets a strange girl, Merry who has lost her memory and somehow has ended up in the Reality world.  Yumeji decides to help Merry get back to the dream world and along the way they fight other dream demons in Day dreams to protect the dreams of others.\r\nThere is more to the story than what I just wrote but that was just a quick summary.  The mainidea of the series is dreams. The idea that the anime is based off of is brilliant  it's really pretty intriguing.  However the one big problem with the story is it's pacing.  The anime is really rushed and really the series should have been longer. Also mid-way through the anime, it strayed off from the manga. The story would have been much better if it followed the manga. However at that point I don't think there was enough material to make an anime adaption so instead the producers decided to add their own little story in. If they would've waited for more material to come out, this would have been a great anime. So in nutshell the premise was great but the execution was poor and the manga simply wasn't ready to become an anime at the point.\\n\\n\r\nThe characters, on the other hand were pretty well done.  They were likable and most played roles in the story instead of fading to the background.  There were some characters that were not necessary in the anime but other than that I have no complaints.\\n\\n\r\nOur main protagonist Yumeji Fujiwara really has an indomitable will and is willing to help anybody.  Although he is weak, he is certainly no coward. He is pretty likable and for a protagonist he certainly is not a bad one\\n\\n\r\nThen we have our main heroine Merry.  Unlike most female leads, she is not a tsundere which is refreshing. In fact she is like an opposite because she is often willing to open up to Yumeji and share her feelings.  As the anime progresses she undergoes some development.  Also she is a very likable and memorable character.\\n\\n\r\nAlso there is also Yumeji's childhood friend, Isana Tachibana, who has no idea what is actually going on.  She also doesn't play a major role until the end.  She also doesn't get a whole lot of screen time either so there's really nothing much I can say about her\\n\\n\r\nThere are a number of side characters such as Yui, her dream demon Engi Threepiece, Chizuru and her dream demon Leon(the latter two do not exist in the manga). They are pretty good side characters as they all play roles in the story.  Also the villains are also done pretty well as they act like villains and also because they are characters that have a personality that you would hate.\\n\\n\r\nThe animation was pretty good, the dream world had it's charm and I would say the animation seemed up to par with other anime today.  However during the fights they got lazy; they were short, dull and felt pretty underwhelming.\\n\\n\r\nThe sound was alright. The opening and the ending were catchy and the voice actors all fit their roles.  Nothing really caught my attention though.\\n\\n\r\nAs for enjoyment, it does offer some entertainment. It's not something that is memorable but as far as entertainment, it does an okay job as it is a pretty good time waster.\\n\\n\r\nOverall I expected something way better from J.C. Staff.  The anime is okay but it had the potential to become much more.  Yumekui Merry is another case of an anime that should have just followed the manga (and waited for it to be ready). \\n\\n\\n\\n\\n",
            "date": "2011-04-08T12:19:00+00:00",
            "helpful_count": 22,
            "mal_id": 35816,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=35816"
        },
        {
            "content": "Hmmm… this is one very…how should i say…interesting anime. Why is it “interesting” you ask? Well it all starts with the characters.\r\nCharacters: The characters in Yumekui Merry are a mixed bag. Some are vibrant, while many others are less so. Some have unique, emotionally complex personalities. Yet, at the same time, most others have bare bone and single-note personalities. Let’s first start with the good ones (or one I should say). Yumekui Merry succeeds greatly with its main protagonist, Merry Nightmare, who boasts a unique costume design, as well as a fun, vibrant personality that is not only a joy to watch, but emotionally complexat the same time. Her fear of actually killing the “dream demons” instead of sending them back to the dream world brings some depth to the character as well as her interesting relationship with Yumeji. These things (and others) make Merry a very well done character in my opinion. I could go on and on about how great her character is but I sadly must move on to the bad characters.  Mistleteinn is a good example. Her role on the show is as one of the main “bad-guys” in Yumekui Merry (more like the secondary antagonist if you will). She is no slouch when it comes to recycling all of those good ol’ cliché bad guy lines every second she appears on the screen. Things like “It will be fun hurting you” and “Do you have a death wish” are just a few of the lines that will induce a cringe when watching. All-in-all, her character is poorly done and kind of seems a little like Harley Quinn’s long lost sister (in a bad way). In fact, all of the other characters are like this in some way! Each one with his/her own set of lazily written lines that can be thrown out at any second and can all but ruin a scene. They’re definitely not the worst I’ve seen, but they are pretty bad characters.\\n\\n\r\nStory: The story, as you probably guessed, is about dreams. However, you won’t find any totems or folding cities in this show. Rather, what you’ll find is an intriguing story about dreams that says that they are this whole other world inhabited by dream beings. This world is rife with good-guys (like Merry) and bad-guys (like Mistleteinn). These beings fight with each other so that people like Merry can save human beings from losing their dreams and being taken over by a dream demon. It’s an interesting premise by all means, but it’s its execution that’s less than perfect. It could just be the bad characters that weigh heavy on the show’s overall enjoyment, but more likely, it’s the cheesiness and predictability. The story has potential, don’t get me wrong, but when the shows predictability is this stupidly prevalent, and when losing your dreams doesn’t seem so bad as the writers want the story to have a happy ending, you know something’s very wrong. It also felt somewhat unfinished at the end, with a wide open space for a second season that doesn’t exist. Yumekui Merry’s story is not all bad though, as it does have its surprise moments that are definitely welcome. But these (which I won’t spoil for you) are few and far between. This and the cheesiness do indeed plague the show, but that doesn’t make the story horrible. In fact, the story is not bad! The problem is that along with the aforementioned problems, the show doesn’t take any risks. It feels as if it never got out of the box and showed me something new. Even with such an interesting and unique premise, Yumekui Merry’s story never seemed to get off its feet and start flying.\\n\\n\\n\r\nSoundtrack:  Yumekui Merry’s soundtrack can be put into to two simple letters: O and K. The soundtrack reminds me a lot of The World God Only Knows. Upbeat symphonic music plays in the background as Merry fight’s dream demons. Then, it turns soft when a more sad moment arrives. All with a hint of a soft electronic style that’s just barely noticeable. Sounds great, right! Yet it’s not the sound of the music that makes it OK, it’s the lack of variety. The show’s soundtrack seemed to be repeating itself time and time again! It seemed as though Yumekui Merry’s OST only had three tracks: one for the sadder moments, one for the funny/normal moments, and one for when Marry beats a dream demon. This lack of variety made the songs get somewhat annoying as time went on. Not that the songs are bad, but the lack of them and repeated use of the same songs cripples Yumekui Merry's soundtrack greatly.\\n\\n\r\nArt: The art in Yumekui Merry reflects my opinion of the show: a mixed bag. Sometimes the art was crisp and beautiful. Yet at other times it felt unfinished and lazy. Sometimes characters and backgrounds have a lot of detail in their design, and sometimes there is a need for more detail. The art is by no means bad; in fact, some of the art was absolutely beautiful. It’s the inconsistencies in the art that get on my nerves, if only because most other art in Yumekui Merry is so well done.\\n\\n\r\nConclusion: Yumekui Merry is an enjoyable show that is plagued with some problems here and there as with any show. However, Yumekui Merry’s problems are ones that, sadly, cannot be overlooked. Look one minute, and you’ll see a unique and beautiful anime with nice characters and a cool premise. However, look again and you’ll see a poorly done, cheesy, and predictable show with a looping soundtrack and some mediocre art. When it’s all said and done, and we weigh the good and bad things about Yumekui Merry, we’ll see the scale read at about a 6 out of 10.",
            "date": "2013-09-22T09:40:00+00:00",
            "helpful_count": 17,
            "mal_id": 113803,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Multisupermono",
                "username": "Multisupermono"
            },
            "url": "https://myanimelist.net/reviews.php?id=113803"
        },
        {
            "content": "The first and only episode that I've seen caught my attention, so here is a review on it.\r\nFirst - the STORY. A boy who has a strange ability meets a mysterious girl who falls on top of him and both of them become the main characters of the story. Typical, isn't it? But it's not just that. The action takes place in a dreamworld, filled with dilapidated buildings, moving fish skeletons hanging from the sky, cats who are pursuing you and a strange masked guy who wants to take over your body. The characters seems to have different personalities and their own background.\r\nThe ART isgreat, the animation too, it's very detailed and different from what we're used to see. This is one of those rare animes where the action and the animation goes perfectly with the MUSIC and the music in this anime is absolutely outstanding!Not only the opening and the ending (IOSYS), but and the OST composed by Keiichi OKU will be liked by all true anime-soundtrack lovers.\\n\\n\r\nAnd last, but not least - the cast: Nobuhiko Okamoto as Yumeji Fujiwara /Ikki-Air Gear, Usui-Kaichou wa Maid-sama!, Accelerator-Toaru Majutsu no Index and Rin Okumura in the upcoming Ao no Exorcist/ and Ayane Sakura as Merry Nightmare /which she handled exceptionally well for her first role/.\\n\\n\r\nOverall if the anime continues like the first ep it'll be A MUST WATCH this season!",
            "date": "2011-01-07T01:31:00+00:00",
            "helpful_count": 16,
            "mal_id": 33529,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182748.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Alice-",
                "username": "-Alice-"
            },
            "url": "https://myanimelist.net/reviews.php?id=33529"
        },
        {
            "content": "When you are looking for anime, the first episode is important. It is a matter of making or breaking it to an anime watcher, since no one will continue watching an anime that can't even start properly. This is how it is for me at least, and I do admit that I may have passed by some great anime with that philosophy. And at the same time, I admit that I have been utterly let down by that same philosophy. Yeah, I am talking to you Dreameater Merry.\r\nDreameater Merry started out, to me, immensely promising, with a cute heroin, a down to earth leading male,and cute girl characters throughout along with a dreamworld plot that I have always taken interest in. It introduces Merry, who is trying to get back to her world in any way she can, her way being defeating monsters from her world that come the real world and try to follow them back. The story progresses from that...kinda. The initial plot sounds great, and the first couple episodes had me. Then, I kept watching, and basically got a metaphorical fan-kick to the balls. I felt like I was watching 11 Eyes all over again. The pacing had picked up to a point where feeling rushed is an understatement, and it kinda felt like when your on the freeway and your gas pedal sticks. Your trying to figure out whats wrong and trying to stop it, but by the time you do, you crash to an unhappy ending (for the viewer).\\n\\n\r\nThe art was inconsistent, but at points I was actually quite impressed. It actually looked like it had a large production value at some parts, but then it would die down into what I like to call \"filler art\" mode, and merely makes it good enough to put on the air.\\n\\n\r\nWith the OP as good as it was, and I'm saying that with a ton of respect, the rest of the soundtrack barely kept my interest past the first couple of episodes. At first, with the bells in the first episode, I was quite excited, only to be let down.\\n\\n\r\nCharacters were plentiful, but lacked...well, character. There was alot of characters to work with, but all of their personalities are either boring or unoriginal (the only exception I could find would be Mistletine and John Doe).\\n\\n\r\nIts hard to enjoy when everything else is so wrong. Needless to say, I was disappointed overall with this anime and wouldn't personally recommend it. However, if what I said you don't believe, go ahead and watch. But you have been warned.",
            "date": "2011-12-13T19:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 49125,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/295949.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheGoatee",
                "username": "TheGoatee"
            },
            "url": "https://myanimelist.net/reviews.php?id=49125"
        },
        {
            "content": "Yumekui Merry is one of my favorite animes. Why? Because when I watched it, I never got tired of anything in it. The theme song was well done, as well as the ending song, and the art was not perfect, but pretty good. The story starts with Yumeji Fujiwara who gained the ability 10 years ago, to see the aura of peoples' dreams and ultimately predict what kind of dreams they are going to have, as well as nightmares, which is not like your average guy in high school. After seeing the same dream repeatedly about a war with cats, one day, a mysterious girlfalls on him. And that is how Merry Nightmare comes into Yumeji's life. I find it quite amusing that most people think that Merry name comes from the holiday in December, but it really comes from a song that everyone knows. If you don't know the song, don't worry too much about it. Anyways, throughout the whole series, Merry and Yumeji encounter \"mumas\" (dream demons) that use people as their vessel to live within them in the real world as opposed to living in the dream world. Merry is trying to find her way back home and Yumeji promises to send her back to the dream world because Merry is indeed a muma that had appeared in the real world 10 years ago but had no memory of appearing in it. Halfway through the story, a new plot arc appears which has to do with the evil mumas who kill other mumas and destroy peoples' dreams. You never know what will happen next in the story. I admire that since nothing in the series is predictable from the moment you see it, making it a better story overall with unexpected turns in events. The ending was great but it makes you want a sequel. Dreams give you strength to never give up and this story has a good way of portraying it. Watching the series escalate was very thrilling and the action was pretty cool. The characters were well developed in both looks and characteristics. This, by far, is a great anime. Even if it's too short, I give it my congratulations. I recommend that you, the reader, should watch this anime. If you like anime that has action as well as fantasy and supernatural things that are based on positive outlooks in life such as hopes and dreams, this anime is for you!",
            "date": "2011-06-27T13:02:00+00:00",
            "helpful_count": 9,
            "mal_id": 38383,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darkraivids",
                "username": "Darkraivids"
            },
            "url": "https://myanimelist.net/reviews.php?id=38383"
        },
        {
            "content": "I'll be short, sweet, and to the point: while this anime is not the best anime ever made, it is quite refreshing for a new series. \r\nPersonally, I loved the art, and one thing that really stood out were the shapes/colors of the dream demons' eyes. The characters all had a certain vibe to them, and I think they did a good job synchronizing all of these personas together with the colors/shapes/flow of their animation. There is a lot of variant colors used in this anime, and I'm just a sucker for a full wheel of color wonderland. \r\nAs far as the plot goes, it'spretty fair. It doesn't do much to actually grab your attention, but the way they went about it really wasn't all that bad. \\n\\n\r\nDefinitely a good anime to watch in between your other ones as a filler in itself. I also appreciated the non-ecchi feel to it. They don't go out of the way to go and show panty shots and all that. \\n\\n\r\nAs far as the music goes, this department was pretty lacking. It was ok, I sort of wished they had put more effort into that, but maybe they'll pay closer attention if they get a next season (which they probably will if all goes well, because they left a lot out). I did like the intro, though. The animation/music was perfect. Outro was rather bland and I pretty much skipped it each time.\\n\\n\r\nThe characters do develop a bit, but overall it was pretty slow. I don't know, this didn't really grab me.\\n\\n\r\nSo, overall, it's a good anime sustenance, and the art is awesome.\\n\\n\r\n(this is my first review, so I hope it helped!)",
            "date": "2011-04-14T11:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 36055,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/251056.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cybunny_lizzie",
                "username": "cybunny_lizzie"
            },
            "url": "https://myanimelist.net/reviews.php?id=36055"
        },
        {
            "content": "There's something about dreams that people find so compelling. Scientifically, it is explained as brain processing various information seen during the day or fragments of subconscious thoughts. This hasn't stopped philosophers and authors throughout history to interpret it as a parallel universe, alternate dimension, vision through another mind, or even message from God. 'Yumekui Merry (Dream Eater Merry)' is set in a world where dreams are linked to an alternate universe, and residents of the dream world can possess a person in the real world.\r\nThe protagonist, Yumeji, has a special ability to predict what dream others will have by making a ring with his fingersand looking through it. This makes him look like an idiot in the process, but proves to be a very useful ability as he can also see who is possessed by Muma (Incubus), residents of the dream world. He has a strong sense of justice like most harem protagonists, and vows to help Merry, an abnormality of a Muma who exists in reality with her own body, to return to the dream world.\\n\\n\r\nFirst few episodes of this series begin with \"villain of the week\" format, but the story flows better once all the main characters are introduced. The plot is driven by mystery, as new characters and concepts are introduced with very little detail at first, slowly unraveled and leads to a new mystery. The story maintains a decent pace with the cycle of new mysteries constantly to keep us guessing what will happen next. In this respect, this series is very much like 'Fate/Stay Night' in the way story unfolds, and also the \"master-servant\" bounded relationship where death of one side affects another.\\n\\n\r\nThe variety of dream worlds were excellent, with each one projecting distinctively different atmosphere, and the battles are different. Sometimes Merry fights, other times it's between two other characters. Sometimes Merry may win or lose, villains may even escape. Sometimes battle never takes place, and our heroes are taken into the dream world merely for a conversation. This series makes the bests use of the dream concept by creating different patterns that never feel repetitive.\\n\r\nThere is a consistent theme to arguments between focal characters and antagonists: The importance of having hopes and dream, and morality of achieving objectives at the cost of others.\\n\\n\r\nWhile the story was well structured, character behaviors did not always make sense. All the good guys are so naive that they don't seem real. If it's between a person losing their dream or losing the control of their body, the choice should be obvious, especially since the bad guys are trying to take over more victims. Not only that, the heroines suddenly decided it was fine to defeat the boss (therefore taking the host's dream) in the end without coming up with a proper resolution or epiphany to their value conflict, effectively throwing out all the arguments out of the window. I did not understand why they didn't just kill the teacher in the real life, when they already decided that he was pure evil and deserve to have his dream taken away. They knew his identity and how strong his Muma was, taking his life is better than having all their dreams and more Muma's life taken away.\\n\\n\r\nCharacter development was done poorly as well. Merry has shown absolutely no romantic interest in Yumeji at first, but suddenly turns into tsundere out of the blue. Her, and other tsundere were all blushing and stuttering in really obvious ways that were not convincing at all.\\n\\n\r\nAnimation in this series was so wonderfully done that I had to recheck OP credits to make sure it was done by J.C.Staff. It turns out, 'Yumekui Merry' was directed by an anime movie director, which might explain why there were numerous advanced cinematic techniques that made this series an absolute pleasure to watch.\\n\r\nThe way hair bounces, character fluidity, and choreography of battle scenes were incredible. Background art had a canvas-like texture that also seemed to have depth. What separates the animation in this series from all other action series though, is the way \"slow\" scenes are presented. When characters are talking, every scene was not just in medium shot. They are seen from many different angles, distance, and sometimes even through foreground objects with deep depth of field. \"Camera\" is constantly moving, and the way it pans in or out were beautifully executed. Transitions between real world and dream world are seamless, and the surreal abstract backgrounds in the dream world always seemed bizarre and mysterious.\\n\r\nThe quality of art and animation were technically very high, and the distinctive style and atmosphere worked. It is the best artistically directed TV anime I have seen, and this is the series I will measure all future TV series animation against.\\n\\n\r\nSound in this series was also exceptionally well done. Every character's voice matched perfectly, full of emotions. The detail of background noise in some scenes are mind-boggling. Even whispers are discernible and everything sounds real. In addition, the randomness of background noise such as sports club jogging and chanting, bird chirping in outdoor scenes, and bar code scanner beeping exist without those objects ever appearing on the screen. I especially liked this technique, because it gives us viewers so much more detail and sense of reality to the environment, stimulating both senses at the same time.\\n\r\nBGM was brilliant, every piece projected a distinct, creepy and ominous atmosphere using different instruments, and battle themes were exciting with a sense of urgency and desperation. Sound was really well edited, but poorly mixed in select scenes where BGM was obtrusive against conversation, and seiyuu voicing did not match character mouth movement.\\n\r\nOP was a very catchy rock song that suits the series really well, but the OP animation was rather bland and flashes too fast to be memorable. ED was rather generic.\\n\\n\r\nI almost judged this series by the cover as another J.C.Staff harem series, but it turned out far more intriguing than I had expected. 'Yumekui Merry' had an interesting premise, but character and story did not develop as well as they could have. However, animation and sound alone is fun enough to watch, and there is something about it that draws you in to the story.\\n\\n\r\nThe final episode was dramatic, but rather unsatisfying because characters \"broke the rules\" of the dream world by realizing the strength of their will translates to their physical strength. While this is an acceptable ending for the final battle, their quest is still far from over. There are also far too many loose ends left unexplained. Many viewers may feel they have been betrayed by the ending. I'm curious how a sequel would salvage this.\\n\\n\r\nThis series was very enjoyable assuming there will be a sequel. I will be hoping and dreaming for a followup season.",
            "date": "2011-04-10T10:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 35873,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35873"
        },
        {
            "content": "Everyone (or for the majority of the population) has dreams.  Dreams drive us to aspire what we want to be or what we wish for in our little insignificant lives.  So, the people of Japan thought, why not have a complete anime about dreams?  And that's where Yumekui Merry comes in.  \r\nStory: The story of Yumekui Merry starts with a fated encounter between a dream demon, and a human.  Dream demons exist in the realm of dreams where humans go whenever they sleep.  In that realm, a whole host of dream demons varying in shapes and sizes, wishes tocrossover to the human realm called \"Reality.\" (Sounds like something I need to get back to.) In this world, dream demons are able to cross over into reality by using a human as a vessel, nestling themselves into the aspirations of a person.  From there on, it gets a bit more sinister, as while some dream demons coexist with their vessels, others completely take over and use the body for their own deeds.  The sign in which a person is being controlled by a dream demon is by looking at their pupils, as every dream demon has a distinct shape.  Back to the first sentence, the story revolves around a mysterious dream demon named Merry Nightmare, who meets Yumeji, a human that has the ability to predict what dreams a person has later that night.  As far as a premise, this anime has one of the most interesting and great premises ever.  The execution however, was garbage.  Beyond the initial premise, the story doesn't really go beyond that.  The story follows something I like to call \"Zero no Shana format\" where within the story, there are smaller, separate stories within that have almost no correlation to each other.  \\n\\n\r\nCharacters: First we have my favorite character in the show, Merry Nightmare.  Or, as she is later known as, Yumekui Merry.  As the main female character in this series, Merry is a dream demon that possesses special abilities.  With pupils similar to a goat's Merry has a playful but longing mentality, similar to Holo from \"Spice and Wolf.\" With a big desire to return back to the dream world, she becomes one of the most standout characters in the whole series and carries the show as a whole.  With a great attachment to her hat and a love of donuts, Merry becomes the reason for Yumeji's mindset in the series.  Next is Yumeji.  As the main male protagonist, Yumeji has the special ability to see what kind of dreams a person has by looping his right index finger and thumb together, then looking through it.  Upon meeting Merry, he creates a contract with her and promises to take her back to the dream world no matter what cost.  As valiant as this seems, that's pretty much it for his character.  Aside from caring for Isana and her father for taking him in, getting Merry back to the dream world is his only true goal in the series, and makes him very bland of a character.  Aside from these 2, the rest of the cast for the most part show little to no change and fit the purpose of being just, there.  Antagonists show up left and right, being defeated easily or getting away before moving onto the next one.\\n\\n\r\nArt and Sound: For the most part, the art was good as the detailed worlds of the daydreams are very pleasing to the eye.  There are also several chibi scenes which involve Merry, adding into how moe she actually is.  Other then that, the animation was adequate with some fight scenes that weren't as fluid as it could be.  As for sound, there really was no stand out track as they were all generic for the most part.  The only thing I would consider standout would be the opening song which matches well with the feeling of this show.  However, it still is somewhat adequate. \\n\\n\r\nPersonal Enjoyment: For me, Yumekui Merry was an interesting show in the least.  With a very unique idea for the series, the execution just wasn't there to make the show as likable as it could be.  Yumekui Merry is filled with several plot holes and rushed plot, which make it even less good then it could be.  There were characters who literally existed in only one episode and felt like a waste of time to create.  Above all, the biggest thing that bothered me was a select few scenes in the opening.  In the opening, Yumeji and Merry are seen as little children, creating an idea that could be explored in the future, creating more of a mystery to the series as a whole.  Regardless, they do nothing with that idea and makes me wish that they did because there could some great potential if there was a backstory.  Above all, Yumekui misses many details and any sort of plot exploration, but it is a good anime if you want to know more about dreams, and an overall great female lead.  The definitely went all out with her character.",
            "date": "2013-10-08T00:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 116049,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=116049"
        },
        {
            "content": "Well drawn, good story sort of, not a very greate ending and almoust no history conserning the characters, the villain they fought at the end was to my liking \"'The forest woman'' was what she was called i think",
            "date": "2011-04-17T07:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 36161,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/103771.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zieek",
                "username": "zieek"
            },
            "url": "https://myanimelist.net/reviews.php?id=36161"
        },
        {
            "content": "Yumekui Merry is a good shounen in theory. It was unfortunate that I was able to agree with the piece of news where the director apologizes for failing (you can find it towards the bottom.) Alas, do not despair, there is still a handful of good things about this show and it is not all as bad as the director thinks.\r\nDreams are always a cool thing to think about? What purpose do they server? In this world, due to somebody's interference demons are giving humans nightmares, and possessing them. In many ways the setting is incredibly done, and there is a lot of backstory thatmakes it seems as if there is a lot of depth. However, this adaption obviously is too soon, as little of this story is explored at all. Half way through we reach the end of the introduction as supporting cast is introduced, and then we stop for the filler to follow.\\n\\n\r\nThis is an action show. The reason why the director apologized is because this was the fatal flaw. The fights are incredibly slow, and the camera angles are horrible. I proclaim myself king of the oblivious, but even I could tell that the action in this show was so bad I could have clawed my eyes out. Merry is suppose to kick the demons ass \"Dream eatter Merry\" is the title after, as she saves people from the nightmare giving demons. However, no matter what is really happening because of the animation it is hard to enjoy any of it.\\n\\n\r\nThe characters have a good amount of backstory… If you pick up the manga. We get to see that Merry is pretty mysterious even to the demons, but we never figure out why. Yumeji stays weak, not useless thankfully, and although he is a cool character we don't learn anything about him either. John Doe, who appears twice in the story is also an interesting character that is unexplored.\\n\\n\\n\r\nYumekui Merry isn't a bad show, considering I hand out scores a lot lower. It just could have been much better than it turned out to be. If your interested I would recommend just starting off with the manga, which I picked up and enjoyed much more.",
            "date": "2011-07-20T16:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 39607,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=39607"
        },
        {
            "content": "Great animation.  Great character design.  I liked the voice actors they went with (at least in the 日本語　version, which is all I watch when I have a choice).  A lot of the \"classical\" music in the episodes reminds me of Debussy (probably my favorite composer).  I also really liked the ending theme.  All in all Yumekui Merry was a very enjoyable production.  I'd love to see a sequel; which means, there probably won't be one.  Why is it the best anime rarely get a sequel?  Anyway, I highly recommend Yumekui Merry!",
            "date": "2011-04-07T23:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 35801,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/joneboy",
                "username": "joneboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=35801"
        },
        {
            "content": "We've all been told at one point or another to follow our dreams right? Well if you haven't, allow me to be the first to do so! Well, the creators of this anime took that to a whole new level. They made dreams more than something to pursue, they made it an integral part of your body's ability to function; a life source of sorts. To lose your dreams was almost the same as losing your soul....and in a way it can be rather reflective of life. Without dreams or any form of guidance, we have nothing to pursue and no rewards to gain. Movingforward...\\n\\n\r\nWe've got a pretty interesting bunch of characters... surprisingly, several of the supporting roles have quite a bit of stage time and importance rather than an honorable mention. For the sake of space and getting to the point, I'll leave those supporting roles as an honorable mention in this review. \\n\\n\r\nTo open, we've got Yumeji Fujiwara. He's your not-so-average-but-not-by-much Sophomore in High School...what separates him is his goofy ability to predict the nature of someone's dreams that night. Remember when we were 5 and would meet our index finger and our thumb to imitate goggles, glasses, binocs, etc? Whelp, he does that and is able to predict based off of the colors he sees surrounding your body. Kinda goofy and not all that impressive but it does prove to have a use. He's lighthearted and overall pretty nice guy, he doesn't give up on people and keeps his promises. His life changes a bit when he meets Merry, who I'l go into next, as she 'falls from the sky' and promptly puts him on his back as a cushion. We move onward from there...a little bit more perspective will be in her description.\\n\\n\r\nNext on the list, we've got Merry Nightmare, later dubbed \"Dream Eater Merry\" a la Yumeji. She's what is known as a Dream Demon, creatures that live in the dream world (who'd have thought?) that we all visit when we crash out at night. Here's the thing, instead of the humans creating their own dreams and these creatures happen to walk in, the humans, without knowledge of the fact, enter the territories of these particular dream demons when they sleep. These demons can come over to the real world by using their visitors as 'vessels'...in short you share a body. Some force their way in, some don't. I'm getting somewhere with this...and here it is, Merry is special in this because she is in the real world WITHOUT a vessel. She hasn't the faintest clue as to why she's there and she has been here, not to give anything away, for a VERY long time trying to return to the dream world. Well after some short-term tsundere with Yumeji, they create a 'contract' between each other  to return her to the dream world. Story progresses from there.\\n\\n\r\nFor our few sentence honorable mentions in perspective to face-time, we've got the not-so-important-but-so-important Yuri Kounagi, Engie Threepiece, Ryouta Ijima, Isana Tachibana, and, later on, Mistletine.\\n\\n\r\nI described the plot more or less in the main character descriptions now that I look at it. I will say this to reassure and to establish that this does have what I would call a 'solid' plot, simply because it's not episodic...it does progress. I make it a personal point to not go into excruciating detail on the plot simply because I think it gives too much away and takes away the splendor of discovery by actually watching.\\n\\n\r\nThe plot could get a little sketchy here and there as to what direction in which it's really going. Are they going to try getting X, are they pursuing Y, or are they going to take down Z. Get the picture? It was could be a little ambiguous as to who the actual main antagonist is based on sequence of events. I guess they finally settled down and made a group decision, for at least this season, they were going to choose Mistletine and Ryouta. I say that simply because she came a bit later in the game. Maybe they tried a little too hard to keep things open for a second season or maybe that's just how it turned out. \\n\\n\r\nAgain, it could very well be to keep things open for a new series, trying to not reveal too much in terms of story, in which they engage the actual head honcho. If not, then you can decide for yourself on how you react towards the ending...not necessarily fair to write a review and use the body of the story or the ending as an aversion to actually seeing it for yourself. I intentionally beat around the bush. Yeah I get it, time is great, but you're also sitting here watching this instead of doing something that could be multitudes more constructive..correct? I thought the beef of the story and the ending was nice and I'll leave it at that for my feedback.\\n\\n\r\nEnough of my rant and back to the task at hand, Art and Sound! I thought the art to be very attractive and pleasant to the eyes. Bright, colorful, not jagged, they made sure they didn't color outside the lines...I'll just reiterate the fact that it is a very attractive form of drawing in my eyes. It gave the characters a much warmer feel. I suppose, the art was the strongest part of the anime in my eyes. The sound wasn't without clarity and the effects, albeit a little generic, were in sync with what was actually going on. Nothing really felt out of place when it came to battle music or execution of sound effects. The intro music and ending music were both pleasant and matched whatever opening and closing cinematic they were paired with.\\n\\n\r\nOverall, I found this to be a rather enjoyable anime to watch. It's a nice break from the serious and takes the viewer back to a much lighter and youthful setting in which to relax in. You get to experience comradery among friends for a common interest, the strength of the heart, and, most importantly, the power of your dreams! Thanks for reading, enjoy the show.",
            "date": "2012-10-14T21:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 75001,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1475485.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Myriadd",
                "username": "Myriadd"
            },
            "url": "https://myanimelist.net/reviews.php?id=75001"
        },
        {
            "content": "Well, this is I guess a bit like Soul Eater in that there are children in charge of fighting; also the fact that the characters seem rather Moe then frightening, especially Merry who acts much like a child. She whines and cries like a little brat. These characters, normally, I can’t stand but this one didn’t seem as bad. The differences between the human world and the dream world does blur a bit and only looks strange when something odd pops up like a floating fish skeleton. I’m not sure why Merry wants to go back when she seems to be having a wonderful timein the human world. Another strange thing is that right after Merry comes into Yumeji’s life, he actually wants to have the bad dreams to find out things about her. What is up with the name John Doe for an actual villain’s name? It just really feels too generic for one. Lots of the names from the dream world seem like they were just grasping at straws to get a name. \\n\\n\r\nThe show actually does a 180 near the end; it rather threw me off a bit. It was like they thought the show was going way to slow (and it actually was for a 13 episode show) and speed up the ending so fast that I had no clue which way to look. Not only that, but they added a really strange enemy that really seemed out of place. I have heard that the enemy in this show was actually not in the manga. If that was true, then what was the point of having a character that wasn’t flushed out like that? It just didn’t play out how I thought it would; it could have been nice if it wasn’t for the fact that the ending didn’t fell like an ending at all. It was like a middle of a series or even the end of a season. I really feel that the show should have been longer and more fleshed out rather then the crap ending they did give us.\\n\\n\r\nThe art style is rather nice and yet, the design of most of the characters seems generic. I’m pretty sure I have seen Yumeji somewhere else before or at least the design of him. Most of his friends in the real world are also rather generic and boring. Simple Moe characters with no real way of standing out. At least Merry stands out with out strange her outfit is and her eyes. Merry’s eyes are actually interesting, very reptile-like or frog-ish. Other then that, she looks much like Karin from Vampire Chibi Karin and an elf had a child, she even has fangs. Most of the character designs for the dream demons actually seem like they came from the new game coming out called ‘Skull Girls.’ It’s a good thing since this is a fighting show, and I would be happy if this became an actual fighting game. \\n\\n\r\nI don’t get when they give us some clips that look as though they were just made as roughs for the manga. It just takes the fluid part of the art and throws it at a wall. It does build suspense I guess but I know other ways they could do so.\\n\\n\r\nI only watched the Dubbed version for the voices and could not find the sub version. The cats feel way too cartoony and yet one cat’s voice is to macho… I would have thought he would have a squeaky voice like Mickey Mouse. Merry’s voice actually feels pretty good to her character as well as John Does, where as Yumeji’s voice again, like his artwork, is pretty generic. One thing that bothered me was that she had this quote that she seemed to say just to add something for the moving mouth.\\n\\n\r\nThe music is actually pretty nice for a fighting show and I kind of fell in love with the opening music. The scores for the back ground don’t really stand out much but yet when they are needed, they seem to shine through and set the mood for it.",
            "date": "2012-05-12T03:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 61079,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=61079"
        }
    ],
    [
        {
            "content": "They say that variety is the spice of life, but if that's true, then why is there such a lack of it in anime and manga? Part of the problem stems from the fact that there seems to be a certain number of themes that can be considered the \"bread and butter\" of the industry, but the subject of dreams is surprisingly not one of them. This is more than a little odd as Eastern folklore is littered with stories about dreams, and one has to wonder why such a rich and varied theme tends to be ignored.\r\nSo what is a dream?\r\nThere are those whobelieve they are nothing more than one's subconscious mind doing a bit of \"housecleaning\", whilst others claim that there is a supernatural element that can be defined and translated to provide a message to an individual. Many people believe that dreams are simply flights of fancy that occur while one is asleep, and almost everyone has used the term in reference to personal goals. The common misconception though, is that while they are often weird, and maybe a little unnerving (this includes some real life ambitions), they are also harmless. What people tend to forget is that a nightmare is also a dream.\\n\\n\r\nBut what happens when dreams and reality merge, and just how important are they to a person?\\n\\n\r\nBased on the manga byYoshitaka Ushiki, Yumekui Merry (Dream Eater Merry), tells the story of Fujiwara Yumeji, a high school student who has the ability to see auras around people that allow him to predict what kind of dream they will have. Unfortunately his own dreams involve him being chased by armed cats, but all of that changes when he meets the mysterious Merry Nightmare.\\n\\n\r\nThe story features several interesting dream related elements that offer some food for thought, and while there are a few rather lacklustre attempts at comedy, the series manages to retain a reasonably serious atmosphere. That said, the cliche manner in which the two leads meet does a good job of negating the generally forthright approach to character introductions, and shattering the illusion of seriousness. Granted the two have to meet in some way, but did it really have to be that?\\n\\n\r\nIn addition to this the plot contains several typically shounen themes that act as a foundation for development of the story, which is a bit of a shame as while there are some explanations on offer about certain events, there are also a few glaring omissions that can leave viewers wondering how everything fits together. Yumekui Merry also suffers from the fact that all of the action takes place in a particular area, and generally involves people in a particular age range, which immediately raises several questions that are never answered.\\n\\n\r\nThe design poses an interesting dichotomy as on the one hand the series adopts a very typical formula with regards to characters and environs, yet on the other there is a degree of imagination and innovation on display, in particular where supernatural characters and otherworldly realms are concerned. While this is obviously a purposeful move to highlight the difference between reality and dreams, J.C. Staff haven't really made the effort to break new ground (and seem overly addicted to Merry's navel), and because of this Yumekui Merry retains a humdrum quality that makes it difficult to take seriously.\\n\\n\r\nAs for the animation itself, the series does achieve a very high standard, especially during a few action set pieces, but there's no real consistency to the quality so these high points are more the exception than the norm. There are many scenes where things could have been timed better and movements could have been sharper, so it's somewhat annoying to find that the effort hasn't been made to raise the bar in any way.\\n\\n\r\nThe opening sequence features the typical character introduction montage blended with some action that never appears in the anime proper, all against the J-rock/pop stylings of Daydream Syndrome by Fujiwara Marina. That said, the ending theme attempts to keep things simple with a boppy little J-pop track (Dreams And Hopes And The Me Of Tomorrow by Sakura Ayane), set against an image of Merry that is gradually being revealed from underneath flower petals.\\n\\n\r\nUnfortunately one of the biggest problem areas is the background music as there are a number of tracks that don't seem to mesh well with the on screen action or appear to be completely unnecessary. In addition to this there are also issues with the levels, and all too often whatever track is playing will lay the foundations of a veritable cacophony when large audio effects kick in or characters begin speaking loudly. Unfortunately these issues could have been easily rectified during the recording process, so one has to wonder if there has been a poorly executed attempt to enhance the atmosphere of particular scenes, or simply a continuous oversight during production.\\n\\n\r\nThat said, there is some decent performances from Okamoto Nobuhito (Fujiwara Yumji), and Sakura Ayane (Merry Nightmare), but this is only in comparison to the rest of the cast. A large portion of the acting is nothing more than lines by rote which can be attributed to a script that's more than a tad juvenile, and this truly is a shame as the cast are a talented bunch for the most part.\\n\\n\r\nYumekui Merry features a variety of personalities that one might find in any number of highschool anime, yet while there is a certain amount of depth applied to several prominent characters, this never really feels like true development. It seems as though the producers have decided to follow a method that attempts to define the characters rather than make them grow, which is unfortunate as this approach can only really yield good results when there is a decent amount of characterisation from the start.\\n\\n\r\nSadly, there isn't.\\n\\n\r\nAside from the generic looks and routine personas, it's only Yumeji who appears to have any sort of detail at the start of the story, and part of that stems from the manner of his introduction into the tale. While one might argue that Merry's introduction also constitutes definition of sorts, nothing substantial is done with her until the latter half of the series. Most of the characters are apportioned a certain amount of screen time to tell a highly abbreviated version of their personal history or future goals, but there's very little emotion involved in this and the story can sometimes feel like more of a writing exercise than anything else.\\n\\n\r\nEven with the flaws there's still something to this anime that manages to raise it from mediocrity, and that's the interesting ideas it can spark about dreams and how important they are to a person. While the explanations of cause and effect are a bit on the simplistic side, they can also be somewhat original and unusual, and this helps to retain the viewer's interest in the story. In addition to this the main thrust of the narrative is well conceived, even if the execution is lacking, and the generally serious tone of the story helps to offset the fact that Yumekui Merry can be a chore from time to time.\\n\\n\r\nOne thing that should be pointed out is that the series has a very clear \"kids versus adults\" mentality that seems more a convenience for its own sake than an outright declaration that everyone over a certain age is \"evil\", which makes it pretty obvious who the target audience is for this show (as if the highschool wasn't already a dead giveaway). The ending also lacks a degree of substance due to its slightly hurried nature, and many of the concepts in Yumekui Merry aren't fully realised, but given that the manga is ongoing it will be interesting to see where things go from here. While the series barely manages to hold it's own against the likes of Yume Tsukai (which isn't really all that impressive to be honest), there's an earnestness that appears from time to time that really should have been more prominent as it would have offset the lethargic productions values.",
            "date": "2011-05-18T14:31:00+00:00",
            "helpful_count": 192,
            "mal_id": 37108,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=37108"
        },
        {
            "content": "So what are dreams? \r\n\"a series of mental images and emotions occurring during sleep\"\r\nPfft.. Don't just give me the definition from the first thing you googled...\r\nAnyways, Yumekui Merry, or \"Dream Eater Merry is an anime based on a manga by... Christopher Nolan??? Hah, I wish, but then the story would get more complicated than it is.\r\nIn fact, the anime series was directed by Shigeyasu Yamauchi, produced by\tHideki Shirane and written by\tUshiki Yoshitaka. \r\nYeah, I know all of you Nolan fanboys (or girls) are going like, \"YEAH!! Christopher Nolan was director, producer and writer but the japanese needed 3 guys to make a show about dreams..\"\r\nWellmy friend, thats a failed analogy to compare movies and animes. I can't believe you just did that... I mean... Seriously??\\n\\n\r\nBefore I proceed with the story review, let me clarify with some of you the terms used that may help you understand more about the story (For those who haven't watch)\\n\r\nSPOILER: To those who wish to enjoy the series by figuring out themselves what this anime is all about, please skip the story section.\\n\\n\r\nDream World: The other dimensions where the habitants consists of mumas.\\n\\n\r\nMumas = Dream demon who wish to possess human to use them as a vessel.  They can either take over their host, or co-exist with them\\n\\n\r\nDay Dream: Is the process where the Mumas extend their territory by \\n\r\nbringing their host or vessel into their domain while they are still conscious\\n\\n\r\nWet Dream: Nocturnal Emissions a.k.a j**zing in your pants while you sleep.\\n\\n\r\nSo I quite like the story because they did not bombard us with the entire plot by the first few episodes. Quite many enjoy this series for their way of slowly letting the audience discover what this anime is all about. And the plot isn't too cliched as well. This is infact the first anime series I've watch in the Spring/Winter 2010/2011 line up that doesn't have a male harem lead character eventhough it clearly have the potential! \\n\r\nHowever, the story about other dimensions and different creatures with different types of powers living in those dimensions feels all too familiar. So I can't give any points for this one.\\n\\n\r\nNow of course, if this was a dream anime you would expect the art too be all abstract like you dreams right? Well true it does have its charms but I got the feeling that the fighting sequence was getting lazy as the story progressed. I dont know, maybe the animators haven't been getting any good dreams lately. What about sound? Well I dont remember background music playing during my dream session but this anime had their BGM well under wraps. \\n\r\nI especially loved the opening theme song, then I noticed that IOSYS was responsible. Hah, no surprise there..\\n\\n\r\nCharacters! Eventhough I only enjoy reviewing harem characters, but I'll make this one an exception. Why? Cause I know you guys love skipping to the character part and ignore every other parts of my review. \\n\\n\r\nYumeji Fujiwara. Has the awesomest power ever!!! He can detect if a person is going to have a certain dream on that night! Isn't that cool?? And he can even do that to himself as well! That was you can sleep longer when there he detects a wet dream and don't sleep when there is a nightmare..\\n\r\nOk yeah... So I was trying to make it sound cool but it seems you guys didn't buy it. Oh darn, I was stupid trying to fool otakus whom clearly wish for better powers like the ability to manipulate vectors or something pfft...\\n\\n\r\nAnyways, like any typical japanese anime character, he has a childhood friend who is yet again a GIRL named Isana Tachibana. Seriously Japan? Can anyone in Japan actually confirm this with me that it's so easy to get a childhood friend who is the opposite sex? I mean maybe because I never had one that made me so envious of them. Someone to be a love interest but is gonna get friendzoned anyways.. Sigh..\\n\\n\r\nSo Yumeji's been living alone and in no circumstances they told us what happened to his parent or I don't remember because too many male characters are deprived from their parents. He is a lazy, yet strong-willed and determined person with a heart of gold, who is always ready to help others. He is also a member of a writing club at his high school, and is a big fan of the superhero called Sprain? Who sprains himself each time he acts in the name of justice? Wow why would he even become a hero then if it hurts him?? Yumeji meets Merry when she falls on top of him as he comes back from his errands, (You know the typical cliched scene) He has firmly decided to help Merry to come back in the Dreamworld, and eventually becomes her partner, using his ability to scout out nightmares so Merry can hunt them\\n\\n\r\nNow I wont explain much about Merry because that would take the thrill away from discovering what she is for thos who haven't watch the series. Let's just say she enjoys eating doughnuts and playing video games.\\n\r\n\"OMFG!! MY DREAM GIRL!!!\" Get it? Because she's from a dreamworld? and she's a girl which also means..... Oh c'mon can't a guy tell a lame joke without getting dissed?\\n\\n\r\nAnyways, Merry is your typical female heroine which is quite popular in the anime scene right now. \\n\r\nWussy guys + Powerful girls =  Homosexuals\\n\r\nWait that ain't right..\\n\\n\r\nThe enjoyment in this anime for me was as mentioned above, slowly discovering what the whole story is about. At the same time we see the bond of friendship developed between Yumeji and Merry. There is a possibility of this going into deeper feelings but please, not every anime have to be about love... And since this is based off a seinen manga, kiddies are not recommended to watch this anime. No, Im not saying this because there are sex scenes! What you dont believe me?? Fine go ahead and watch... And prepare for your MIND TO BE BLOWN... Seriously, kids, if you scratched your heads until it bleeds when you watched Inception, I doubt you would enjoy this one. Fighting sequence isn't that impressive but it's still above average and does compliment the anime well\\n\\n\r\nOverall, watching this anime changes my perception of dreams. They're not recollection of memories, they're actually other dimensions and dream creatures are trying to take over our bodies! So those voices I hear in my head are real and Im not crazy! Oh wait, false alarm, that's just me thinking to myself. And it's telling me to click Submit Review without Previewing it first.\\n\r\nMust resist urge.\\n\r\nResistance Failed.",
            "date": "2011-02-19T07:30:00+00:00",
            "helpful_count": 85,
            "mal_id": 34576,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=34576"
        },
        {
            "content": "When Yumekui Merry started at the beginning of the Winter 11 season I felt it was going to be good show. It had an interesting art style, the characters were likable, and the production was done by JCStaff. An animation studio that I adore for making previous works such as Kaichou wa Maid-sama and the Index series. But something went wrong. Everything fell apart by the end. Plot holes, ruined characters, inconsistent art, and one of the worst finales I’ve seen in a long time. And, yes, I have seen a LOT of anime. \r\nAnimation wise, Yumekui Merry had an interesting approach during the dreamsegments for the first few episodes. I was really intrigued. The watercolor approach worked well for the series and the character designs were charming. The show was full of stills (meaning no movement or very minimal amounts kind of like a slideshow), but hey they were at least pretty stills. Sort of. Then the art lost all its style at the end. Gone were the interesting art choices and the art became inconsistent during the last few episodes. Misty’s face during the last episode comes to mind.\\n\\n\r\nThe OP/ED were good. The ED animations were nice. It had some dang midriff. I like me some midriff. The soundtrack was glaring. It was an awful strange choice to choose orchestra music for the more intense fight scenes. I don’t know... it felt really out of place. I mean come on. Why would you put bassoons in a fight scene? The voice acting was okay. Nothing to complain there. Merry's VA is totally new and it was her debut role. And Okamoto Nobuhiko always makes me go crazy as Yumeji. (Okamoto is personally one of my favorite voice actors, so I'm biased.)\\n\\n\r\nThe plot is where everything falls apart though. You’re lead into the first episode with a dream demon who can survive in the human world. Wonderful. Our main character has the power to see what people will be dreaming the next night by making a circle with his fingers. Uh weird, but uh interesting. Throughout the first half it was really formulaic. I mean it was basically fight dream demons and send them back to the dreammmm world. It gets boring. So the anime studio then decides that during the second half the plot gets more of a direction, but loses all plans to keep a coherent plot. The ending was awful. Things are developed, but never really mentioned again. Kawanami's character, John Doe, and that one dude that got possessed by a dream demon. And some nonsensical things happen as well. (Yui playing her invisible trumpet comes to mind. What the heck? Why? Did she bump her head? Did she suddenly decide that she was in a band? Is she the one playing the dang bassoon. Dang it Yui. Dang it.) \\n\\n\r\nMistletine was a good evil villain. Her back story was basically that she likes to be evil and does evil things. Alright, that’s fine. There’s just one thing I have on her. And that is that Misty (Mistletine) has a severe case of ADD. She's fighting the heroes of the anime and then she just gets up and leaves them, so she can enjoy them next episode? What? Why? That makes no sense? Did she get bored? Did she get tired? No, it looked like she had enough energy to insult them. Why? Oh yeah. It’s not the last episode. We can’t have you guys finish each other off till the last episode. Silly me. That’s a perfectly reasonable answer. \\n\\n\r\nAlso the teacher (Who I can’t remember his name for some reason. And all I remember about him was that he wears the ugliest striped pants I’ve ever seen.) was kind of bleh. I do like his facially expressions though. They were hawt. Kawanami was the worst character in the series. She felt soooo tacked on. Was her only purpose in the story was so Isana could make friends? Isana has plenty of friends. She has Merry and she has her brother. Well, I guess that isn't much, but still. Kawanami was an anime-original character (same with stripped pants sensei and Misty) but she felt like she had no purpose in the plot. JCSTAFF WE NEED SOME FOCUS IF YOU ARE GOING TO INTRODUCE ANIME-ORIGINAL CHARACTERS. \\n\\n\r\nI mean having an anime-original plot is fine if you do a good job with it. Having anime-original character is fine if you develop them well, but JCStaff didn't. Did JCStaff suddenly decide that the manga wasn’t good enough? If it wasn’t good enough, then why did they choose to adapt this series? I like John Doe. (John Doooooo) I seriously do. I like his name. I especially love how the other characters call him John Dooooo when his named is spelled John Doe. He was cool. Too bad he like totally disappeared, so the anime-original characters can appear.\\n\\n\r\nI feel like there is so much wasted potential here, plot holes, useless anime-original characters, inconsistent art, and Yui playing her imaginary trumpet. I do feel that there are a few good parts in this show, but there are far too few in a sea of bleh. As in my case it’s very hard to recommend this anime. It might be good, maybe, after in taking some alcohol. But whatever. It’s done. JCStaff please do a good job on your next series. I don’t want to see no anime-original characters or plot, unless you can develop them properly, and I definitely don’t want to see your next main character play an imaginary trumpet.\\n\\n\r\n* Nothing is as frustrating as writing a review twice; due to my laptop crashing down right when I click submit. Review is also on AnimeNfo.com",
            "date": "2011-05-08T19:58:00+00:00",
            "helpful_count": 62,
            "mal_id": 36855,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/73459.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/shuffleair",
                "username": "shuffleair"
            },
            "url": "https://myanimelist.net/reviews.php?id=36855"
        },
        {
            "content": "There are many ways to interpret the definition of a dream. Is it the manifested world of our imaginations? Is it the parallel world that we live in while we sleep? Or is it the final goal, the end of the path that all of our goals and motives lead to? Yumekui Merry implicitly engage us in an intriguing tale of dreams; of dreams that are reached and dreams that are shattered. Of friendship and contracted promises, and of betrayal and wily deception. Yumekui Merry narrates a scenario that can be enjoyed by all people alike, by people with dreams that may have come true,or of people with dreams that lie in wait for the day that they may be manifested.\\n\\n\r\n-= --- Story --- =-\\n\\n\r\nFrom the producers of Blood + and Dragon ball Z, Yumekui Merry starts with bang. Yumekui Merry is certainly not one of those animes that lags around in the beginning; rather, grabs our attention immediately by giving the protagonist an unexpected disaster from above that ends in a very special acquaintance. All in all, Yumekui Merry narrates the pivot point of the life of Fujiwara Yumeji, who can see the inner atmosphere of the people around him, and can predict the type of dream the person will have that night based on this inner aura. The story pivots sharply as Yumeji meets a strange girl called Merry Nightmare. The story is one of the most original plots that have been made yet, incorporating concepts of that not unlike the movie “Inception”. In addition, the plot goes through many interesting twists that keep us guessing the next turn of the plot.\\n\\n\r\n-= --- Animation --- =-\\n\\n\r\nI found the drawings of Yumekui Merry extremely interesting and contrary to the usual graphics of contemporary anime. Although Yumekui Merry incorporates essentially the same type of portrayal of the outward appearance of characters as other animes, with the same background in the “normal” world, the graphics of scenes in the dream worlds are wholly different. Not only do objects not follow the laws of physics, what we would normally conceive as the effect of one action differs completely from the actual effect that is shown. Despite others who argue that the art of anime is not particularly appetizing to watch, I see it as part of the twists that make Yumekui Merry the attracting anime it is, that’s quickly rising through the board.\\n\\n\r\n-= --- Sound --- =-\\n\\n\r\nThe soundtrack of Yumekui Merry is also part of the twist that makes up its personality. One of the aspects is that it defies the basic rule of using clashing dissonance of die-hard rock music and screaming guitars; instead, Yumekui Merry surprisingly chooses to use the romantic building sounds of a group quintet orchestra consisted solely of violins and violas. This effect makes the fight all the more enjoyable. From an unexpected transcribing, the fight shifts its position. As the music builds into more intense chords and arpeggios, the fight climbs to its climax. The experience is particularly exhilarating as the violins play in sync together in a strangely baroque tone to build up the rising action as the fight leads to its climax. I found that other reviewers also criticize the producer for giving the anime such an unfitting soundtrack, but as we will see while watching Yumekui Merry, the experience proves otherwise.\\n\\n\r\n-= --- Character --- =-\\n\\n\r\nThere character development is the one weakness of the anime. Although it is clearly marked that a few characters progress and change throughout the anime significantly, the relatively minor characters (not to say that they aren’t important) do not have such a change. Although there exist flat characters, we grow to be fond of the protagonist and cheer them onwards throughout the anime. The protagonist Merry is especially lovable due to her engaging character and her nonchalance and ignorance to everyday things such as video games and groceries. Besides the protagonists, the minor characters, despite that they remain the same throughout the anime, are very interesting. I especially appreciated the character of Takateru Akiyanagi, the boy who constantly expresses his feelings and thoughts as through haiku; this shows an extremely keen sense of creativity that is parallel even to Angel Beat’s T.K.\\n\\n\r\n-= ---Enjoyment --- =-\\n\\n\r\nYumekui Merry is especially enjoyable. Not only does it make the everyday aspects of school life as interesting as it can be by creating character development, but it also has many enjoyable fighting scenes that gives ecstatic feelings of greatness. As the anime progresses, we will be enthralled by the ever thickening plot as we try to guess the next possible action that the protagonists will take. \\n\\n\r\n-= --- Overall --- =-\\n\\n\r\nYumekui Merry is an extremely underrated anime, not because it lacks charm and glamour – it has an abundance of those – but very few people know of its existence. Do not be motivated to skip this opportunity of inspiration just because no one recommended it. Yumekui Merry is actually a very interesting anime, and it does not take long to find out.\\n\\n\\n\\n\r\nReviewer’s note: Thanks you VERY much for reading this especially long review. I purposefully did not add ratings to this review. I feel that reviewer’s ratings never appeal to the reader, and who even cares about how I feel about the anime right? Regardless, I tried to revise this (my second) to create an effective review that will not only encourage the reader to watch Yumekui Merry, but also have a realistic idea of Yumekui Merry. If you did not like this review, please give me advice so that I can improve my horrible writing skills, and write a better review next time. \\n",
            "date": "2012-08-05T11:57:00+00:00",
            "helpful_count": 49,
            "mal_id": 68785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291057.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/imjustjk",
                "username": "imjustjk"
            },
            "url": "https://myanimelist.net/reviews.php?id=68785"
        },
        {
            "content": "The day after Yumekui Merry last episode was aired, the police received 3 simultaneous reports of \"weird incidents\". Those weird incidents seemed unrelated at first; different victims, different places, different circumstances… But deeper investigation proved they all had 1 thing in common. All the victims had watched all the episodes of “Yumekui Merry”. That’s why the incidents were ironically named \"The Merry Incidents\" by the internet user community.\r\nThese are the stories of the victims of this show, who are no longer among us to tell them.\r\nCase 1: The Director\r\nStory: 3\r\nFukuyama, Takumi was an independent film director who enjoyed watching films and anime full of meaning,with well articulated plots and interesting stories.\\n\r\nWhile looking at the Winter 2011 anime releases, there was one show that captured his attention, Yumekui Merry. He had dreamed about being a director since he was a young teenager and he was actually living his dream, so he felt that he would enjoy a story related to dreams. (Don’t worry about spoilers you won’t find any)\\n\r\nEpisode 1: Boy meets supernatural girl, the dream world and Merry are surrounded by a shroud of mystery, Merry cries. Takumi is intrigued.\\n\r\nEpisodes 2 – 3: Some side characters are introduced, not much about them is told and they relation with the plot is unclear, bad action scenes, the dreamworld is still a mystery, Merry cries. Takumi feels a little confused and disappointed, yet he pushes through and keeps watching the show, hoping to get some answers.\\n\r\nEpisodes 4 – 6: The amount of side characters keeps growing just like the amount of unanswered questions about everything regarding the main plot. Every fiber in Takumi’s body is screaming “Drop this show before it’s too late!”, but he can’t. He feels like it wouldn’t be fair to judge a show that’s halfway through. Takumi notices that he is eating less than he normally does.\\n\r\nEpisodes 7 - 8: Baffled by the lack of sense and poorly animated fight scenes, Takumi stood still for 3 days, unconsciously staring at the turned off screen. His body is slowly giving up.\\n\r\nEpisodes 9 – 12: Takumi is deranged. He has no regard for personal hygiene anymore, he started peeing in empty bottles and taking dumps in the trash bin. He is starting to run out of bottles and the trash bin is almost full. Only a good final episode can save him now.\\n\r\nEpisode 13: After finishing this episode, what was left of Takumi broke. He picked up the trash bin and started writing “It doesn’t make any sense” with feces, in his dining room walls. “I ran out of paint” muttered Takumi as he blankly stared the shit covered walls. “Ah… I have an idea” said with a bitter smile, after thinking for a few seconds.\\n\r\nA week later he was reported missing by one of his coworkers, the police broke into his apartment and found the body of Takumi laying in a pool of his own blood.\\n\r\nIt didn’t take much time for the police to find out what had happened. Half of the walls were painted with shit, the other half… With blood. \\n\\n\r\nCase 2: The Prodigy.\\n\r\nArt / Animation: 5\\n\r\nNanaya Kenichi, was the perfect student. His stern father always pushed him to get straight A, saying that he would not accept to have a son who thinks that it’s not important to be the best  That’s why Kenichi had been getting nothing but A in every subject for all his life, even in “Art and Expression” which was the hardest one for him.\\n\r\nOne day he received an assignment in that subject that got him worried. “Present an animation about anything you want”. Certainly creativity wasn’t one if his virtues, he had great memory but low inventive.\\n\r\nHe resorted to the Winter 2011 anime releases list to get inspiration, and decided to try his luck with “Yumekui Merry” since it had two interesting designed characters in the promotional image.\\n\r\n“Hmm, so this is how you do it” thought Kenichi after finishing the whole thing. He immediately started his animation, brimming with enthusiasm and confidence.\\n\r\nThe next day he presented his animation in class. Link vs Megaman: Link and Megaman fight over the last “six-pack” at the Wallmart.\\n\r\nKenichi got an “F”. But it wasn’t the ridiculous plot the issue, it’s just that he drew Megaman and Link in great detail while they were standing still, and then drew them all disfigured and half-assed while moving / fighting. Just as he had learned from watching Yumekui Merry.\\n\r\nNeedless to say, his father didn’t take the news too well. Kenichi was kicked out of his own house and had to live in an orphanage. There, he was constantly bullied and eventually raped by his fellow orphans and wardens.\\n\r\nOne night that Kenichi was crying his hearth out with his head buried in his pillow, he heard the gentle voice of a girl. “Come” said the voice, “Kenichi, come”, insisted.\\n\r\nKenichi rose his head and saw Merry standing by the door and calling out to him. Dumb footed he stood up and quietly followed Merry to the orphanage rooftop.\\n\r\n“I need to tell you a secret, a very important secret” said Merry, standing at the edge of the 5 stories orphanage rooftop.\\n\r\n“What is it?” replied Kenichi, half curious, half scared about the answer.\\n\r\n“I need you to get closer, or else I can’t tell you” said Merry with a gentle smile.\\n\r\n“No, it’s dangerous… This is too weird, I’m going back to bed”. Said Kenichi as he turned around and headed for the door.\\n\r\n“Don’t you miss your old life Kenichi?, if you listen to what I have to say, you will get your life back. Your family, your home, even your dog”\\n\r\nKenichi froze, he couldn’t take another step away from her. Instead, he slowly started walking towards her, as if someone else was moving his body.\\n\r\nWhen he was about to reach Merry, he tripped and fell over the edge, a cracking noise resounded in the orphanage on that silent winter night, Kenichi broke his neck as soon as he hit the ground and died instantly.\\n\r\nA warden came investigating the source of the noise. He found Kenichi’s dead body, and in his hands a drawing of a curious looking girl, the draw was titled “Merry”.\\n\\n\r\nCase 3: The Dreamer\\n\r\nCharacter / Character Development: 3\\n\r\nWatanabe Hiroshi, 32 years old, married for 8 years and father of two. He had dreamed of being a mangaka when he was younger, he even came up with a pen-name: “Watahiro”. But life isn’t a fairy tale, soon financial pressure made him give up on his dream and take whatever job he could get, in order to support his family.\\n\r\nAfter 8 years working in the dull and meaningless job of selling insurance policies, he found an advertise of an important manga publisher that would change his life forever. “Manga contest: Wining prize 800.000 YEN (roughly under 10.000 USD) and a contract for 5 years”.\\n\r\n“This must be destiny”, thought Hiroshi. He knew that if he wanted to win, he would need to make something new, something fresh. The contest deadline was close so he didn’t had enough time to resort to manga for inspiration. Anime seemed like the most reasonable choice.\\n\r\nHe had not watched any anime since 2003 so he needed to watch a new show to get a feeling of current trends. “This one looks interesting” said Hiroshi while reading Yumekui Merry synopsis.\\n\r\nAfter watching the entire show he secretly started working on his manga, based on what he had learned from Yumekui Merry. Working during the day and hiding the manga production from his family was extremely tiring. Hideoshi realized that he wouldn’t finish on time unless he could find more time to work on his manga. So he took a decision.\\n\r\nHideoshi left his job and keep it a secret from his family. Everyday he would bathe and change for work, then he would go to a park near his former workplace, where he would draw, and return home by the time he would return from his job.\\n\r\n“They won’t understand if I tell them now. It’s for the best, once I win the contest I can explain, and finally do what I love for living. Yes everything will be ok”, said Hideoshi with a smile, while drawing at the park.\\n\r\nAfter a month of hard work he barely finished his manga the day of the deadline. He proudly sent it to the publishing house, and returned home full of expectation.\\n\r\nIntense traffic caused him to return 2 hours later than usual, when the family is having dinner. But to his surprise the house was empty. Worriedly he scouted the rooms, looking for any clues of his family location. “Maybe something happened to one of the kids and they had to rush to the hospital”, thought Hiroshi.\\n\r\nEventually he went to the kitchen, where he found a letter that had been written by his wife that same day. The letter contents were as follows: “Today I used the credit card and it was rejected. I called to your job to talk to you about it and they told me you have quitted last month and they haven’t seen you since then.\\n\r\nYou have been lying to me and your children for the past month, without even blinking. I don’t even care about what you have been doing until today, it’s inexcusable and unforgivable. I’ve taken the kids with me, I have already told the kids that you are dead, don’t try look for us or I swear I’ll kill you.\\n\r\nI’ll send you the divorce papers once I’ve settled down.”\\n\r\nHiroshi cried for several days, but the possibility of wining the manga contest finally soothed him. “That’s right, after I win the contest I’ll get my family back. I’m sure I can explain it somehow. She must probably think I was having an affair or something, that’s why she got so mad.”\\n\r\nThe days went by and the expected letter from the contest didn’t arrive, after countless days of waiting Hiroshi picked up the phone to call the publishing house but he had no line. “What?, I’ve paid last month, this is outrageous. He tried to turn on the computer but it didn’t respond. “Maybe there is no power… No it can’t be that, the lights in the kitchen and living room are on. It must be broken.”. Hiroshi checked his watch “eight o’clock, I guess I’ll be going to sleep early today.”.\\n\r\nThe next day he woke up and checked the mail. “Still nothing” said disappointed, “well, the day is just starting, they can still deliver it in the afternoon. What time is it anyway?”. When he looked at his watch, a chill went down Hiroshi’s spine. “8:00 PM?... no this can’t be right I can’t have slept for 24 hours. My watch have stopped, that must be it.” after confirming that his watch had stopped, Hiroshi stepped outside the house to ask someone the time.\\n\r\n“How weird it’s already nighttime, I wonder what time it really is”, thought while walking. After a long walk he couldn’t find anybody, everywhere was deserted. After a while of aimlessly walking around the neighborhood, he returned home disturbed about the lack of people.\\n\r\nIn front of his house, there stood a girl with a white dress; she had an air of purity.\\n\r\n“Finally someone!, do you know where is everybody?”, asked Hiroshi worriedly.\\n\r\n“Everybody is here, you just can’t see them”, answered the girl in a calm voice.\\n\r\n“What do you mean?... But why can’t I see them?”, as he asked, deep inside he felt like he already knew the answer to his question.\\n\r\n“Because you are dead” said the girl.\\n\r\n“You are lying that’s just stupid, I can’t be dead im standing right here”, he acted like he brushed away her answer, but somehow he felt very uneasy\\n\r\n“When was the last time you ate breakfast?. When was the last time you taked with anybody?. When was the last time you used the phone?”. The girl kept asking questions that would have been easy to answer by anyone, but for some reason Hiroshi couldn’t find the answer to any of those questions.\\n\r\n“I.. I… no this can’t be” said while covering his ears with his hands as if to “unhear” what he had just heard.\\n\r\n“Enter your house, you will find the truth inside” said the girl.\\n\r\nHiroshi stepped into his house. The house looked nothing like how it was when he left a few hours ago. It looked like it had been abandoned for a while, the mailbox was full and a strong smell could be perceived. As he entered the living room he couldn’t believe his eyes.\\n\r\nHe saw his dead body, in a sitting position with his back against the wall. Over the table there were two letters, one was the letter his wife had left, and the other was from the publisher. The letter from the publisher said: Mister Watanabe, we regret to tell you that your manga didn’t win the contest. The reason is that you introduced too many characters to the story, without giving the audience proper background to understand their behavior and make their motivations clear. Ultimately you could have resorted to pander the audience fetishes, but you didn’t even do that. You just had a bunch of random characters, doing unrelated events for entertainment sake. And it actually wasn’t entertaining at all. Just like that “Yumekui Merry” crappy show. Better luck next time.”\\n\r\nAfter he finished reading the letter, the girl stepped into the room.\\n\r\n“How did I die?”\\n\r\n“You thought the letter was a prank, and that the real one would eventually come. So you sit there waiting for a month until you starved to death. Your desire to receive that letter was so strong that your spirit neglected your death. And since then you have wandered this house oblivious of what happened. \\n\r\nBut yesterday when you found certain inconsistencies yesterday the phone and the computer you started to get aware of your situation, and deep in your heart accepted it. That’s why I came, because I heard your calling.”\\n\r\n“For how long…?” he couldn’t even finish the sentence.\\n\r\n“One year”\\n\r\n“I see…. And now what?”\\n\r\n“Now we go, I’ll take you to where you belong now”\\n\r\nResigned, Hiroshi took the girl’s hand and they disappeared into a white light.\\n\\n\r\nSo heed my advise. If you don’t want to experience a “Merry Incident” stay the fuck away from this show. I specially recommend people who have read the manga to stay the fucking fuck away from this, couse the original story gets butchered and anal-fisted in the anime. Courtesy of your usual J.C Staff “Story Re-Write”.\\n\r\nSeriously, this anime is pointless. Watch something else, It’s for your own good.",
            "date": "2011-05-23T17:17:00+00:00",
            "helpful_count": 33,
            "mal_id": 37252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482401.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Faito",
                "username": "Faito"
            },
            "url": "https://myanimelist.net/reviews.php?id=37252"
        },
        {
            "content": "Watching Yumekui Merry was like riding a jeep down a long, bumpy road spanning several steep hills. When it was good, it was pretty compelling. When it was bad, it was almost impossible to slog through. Though the good outweighed the bad enough to not make me dread the next episode.\r\nNow, I don't expect anyone was especially thrilled to see another show that used every shounen trope to its fullest extent, with a bland male lead, an unstoppable and infuriating lead villain, and a plucky tsundere sidekick. \r\nThe story, which isn't properly divulged in the synopsis, is as such: Yumeji is your standard shounen protagonistwith the ability to read peoples' dreams by making a circle with his thumb and index finger. He meets a mysterious and flamboyantly dressed woman while experiencing a trippy dream sequence, and the two build a friendship that withstands any and all obstacles. That's about it. \\n\\n\r\nIn the beginning, there's nothing at all wrong with the story. The problem with it is, quite a few plot threads are introduced, toyed with for an episode or two, and never brought up again. \\n\r\nJust a warning, possible spoilers ahead. If you want this to remain as spoiler free as possible, skip down past the dotted line. \\n\\n\r\nThe first plot introduced is Yumeji's conflict with a dream demon who wants to use his body as a vessel. Okay, that's a good plot. And the demon can infiltrate his mind at anytime and plunge him into that dream state. Alright, that works. And the girl who he meets in there one day tries to help him out. Okay, excellent. Sounds like a good, semi-compelling series. But nope, a few episodes later it's dropped and only paid lip service less than halfway through, where it's resolved in an incredibly anticlimactic manner. And for the rest of the series, this entire plot is forgotten, which makes the synopsis utterly useless.\\n\\n\r\nNot a problem though, because a second plot is brought up by Merry, the plucky sidekick. She's also a dream demon, but all she wants is to return home to her world, and for that she needs to vanquish a few demons and use the portals that send them back to send herself back. Not nearly as interesting as the first, but it's still serviceable, and would allow for more freedom with character development. And thankfully character does develop... right up until the last third. \\n\r\nUnlike the first, this isn't forgotten, but just completely shoved aside for the standard plot. \\n\\n\r\nThe main plot, of course, being the need to vanquish an unstoppable evil through the power of friendship. You all know how this is going to go, so nothing needs explaining. \\n\r\n--------------------------------------------------------------------------\\n\\n\\n\r\nThe story is somewhat redeemed by a twist at about the halfway mark, and another at the two thirds mark, that's somewhat unexpected and casts what Merry does in an entirely new light. \\n\r\nIt would've been decent if they had just stuck with the main plot, without introducing all those abandoned subplots.\\n\\n\r\nThe characters are, for the most part, bland and uninteresting. Merry's the only one not of a cookie cutter design, but her personality is as standard for tsundere characters as it gets. Really, there's nothing here you haven't seen before. Heroes are likable, if somewhat dimwitted, and the villains are despicable in a way that you like them to be. Again, standard fare. \\n\\n\r\nSound-wise, Yumekui Merry employs a somewhat catchy OP and a pretty good ED, but otherwise unremarkable music. The characters are usually appropriately voiced. Not much worth mentioning either for or against the music or VAs. \\n\\n\r\nAside from the boring character designs, I must admit that the art of the various dream worlds used is quite excellent. Each world is haunting and surreal, from a moonlit wheat field swaying gently in the twilight breeze, to a warped town bathed in a bluish-green glow, surrounded by levitating fish skeletons. Otherwise, it gets the job done, and nothing more. The animation is fluid, the fights are fun to watch, and I was never left bored during the action scenes. \\n\\n\r\nYumekui Merry breaks no ground, preferring to tread water under pseudo-philosophical debates and questionable handling of the story. I understand that 13 episodes limits the schedule somewhat, but if the subplots were going to be underutilized like that, they should've been left on the cutting room floor. \\n\r\nOtherwise, it's more than watchable. Just don't expect to be wowed or walk away having felt richer for the experience. It's stupid, short fun, and sometimes that's what you need in life.",
            "date": "2011-04-10T16:04:00+00:00",
            "helpful_count": 29,
            "mal_id": 35887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=35887"
        },
        {
            "content": "Story and pacing: Our male protagonist is aspiring to be a writer and unknowingly plunges into a dimension between dream and reality.\r\nOP song: The song is an average Japanese rock ballad. Nice visuals, establishes Merry's role.\r\nED song: Pretty average for the song and the visuals. The visuals in the OP song were better.\r\nVoice acting: Top-notch voice-acting. Every seiyuu rightfully fits in his/her character and the display of emotions does not feel forced. Merry's dialogue is quite interesting too.\r\nBackground music: The background music is just epic. It is always present and manages to capture the mood. Very eclectic too, the instruments vary from violin to electricpiano. You can really see here that the budget is quite impressive.\\n\\n\r\n﻿Animation and character designs: Gawd I just love the background design for the dream world. The creature designs as well as the animation sort of remind me of  Studio Ghibli films such as spirited away and Princess Mononoke, and that is saying a lot, in a good way. The setting is well drawn too. You can really see that the background is intricately done. Even though the fighting scene was a bit lacklustre, I think, I hope, that this will improve in later episodes. I usually don't get all fluffy with moe characters but Merry's design is just so well made, especially when she was crying, and not to mention that that the animation is of high quality.\\n\\n\r\nCharacters: This is where the interesting part starts. Even though there are some cliché elements such as the protagonist having multiple love interests,one being his childhood friend-- a tsundere-- and another comes from a different dimension, none of these clichés feel too heavy and unbearable. The characters are rather sympathetic and the creatures are well done. I am happily surprised that Merry actually cried. I was not waiting for that at all because I though they would write her as a Tsundere. Not to mention that the antagonists are really fun to watch and the creators succeeded on creating this otherwordly and mysterious manners they have.\\n\\n\r\nStory and pacing: Anime series regarding connections about dream and reality are always my favourites. Their atypical storyline interesting character study never ceases to amaze me. It is the same for this anime; yes some parts may seem cliché but they never feel, as I said, too unbearable. The caricatural representation of the antagonist is really well done because it lets us know that at this point that the creators are not aiming for a serious anime series but rather a light-hearted, fun albeit very creative and intriguing one. As for the pacing, it was neither fast nor slow, it was perfect. Not to mention that they managed to introduce a large cast of character in a single episode, quite well in fact.\\n\\n\r\nWhile I continue to watch this?: Yes",
            "date": "2011-01-09T03:36:00+00:00",
            "helpful_count": 27,
            "mal_id": 33587,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429503.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/juliancan",
                "username": "juliancan"
            },
            "url": "https://myanimelist.net/reviews.php?id=33587"
        },
        {
            "content": "Yumekui Merry is another one of those anime that is based off an interesting idea and had the potential to be better than what it was.\r\nThe anime starts off with our main protagonist, Yumeji Fujiwara who meets a strange girl, Merry who has lost her memory and somehow has ended up in the Reality world.  Yumeji decides to help Merry get back to the dream world and along the way they fight other dream demons in Day dreams to protect the dreams of others.\r\nThere is more to the story than what I just wrote but that was just a quick summary.  The mainidea of the series is dreams. The idea that the anime is based off of is brilliant  it's really pretty intriguing.  However the one big problem with the story is it's pacing.  The anime is really rushed and really the series should have been longer. Also mid-way through the anime, it strayed off from the manga. The story would have been much better if it followed the manga. However at that point I don't think there was enough material to make an anime adaption so instead the producers decided to add their own little story in. If they would've waited for more material to come out, this would have been a great anime. So in nutshell the premise was great but the execution was poor and the manga simply wasn't ready to become an anime at the point.\\n\\n\r\nThe characters, on the other hand were pretty well done.  They were likable and most played roles in the story instead of fading to the background.  There were some characters that were not necessary in the anime but other than that I have no complaints.\\n\\n\r\nOur main protagonist Yumeji Fujiwara really has an indomitable will and is willing to help anybody.  Although he is weak, he is certainly no coward. He is pretty likable and for a protagonist he certainly is not a bad one\\n\\n\r\nThen we have our main heroine Merry.  Unlike most female leads, she is not a tsundere which is refreshing. In fact she is like an opposite because she is often willing to open up to Yumeji and share her feelings.  As the anime progresses she undergoes some development.  Also she is a very likable and memorable character.\\n\\n\r\nAlso there is also Yumeji's childhood friend, Isana Tachibana, who has no idea what is actually going on.  She also doesn't play a major role until the end.  She also doesn't get a whole lot of screen time either so there's really nothing much I can say about her\\n\\n\r\nThere are a number of side characters such as Yui, her dream demon Engi Threepiece, Chizuru and her dream demon Leon(the latter two do not exist in the manga). They are pretty good side characters as they all play roles in the story.  Also the villains are also done pretty well as they act like villains and also because they are characters that have a personality that you would hate.\\n\\n\r\nThe animation was pretty good, the dream world had it's charm and I would say the animation seemed up to par with other anime today.  However during the fights they got lazy; they were short, dull and felt pretty underwhelming.\\n\\n\r\nThe sound was alright. The opening and the ending were catchy and the voice actors all fit their roles.  Nothing really caught my attention though.\\n\\n\r\nAs for enjoyment, it does offer some entertainment. It's not something that is memorable but as far as entertainment, it does an okay job as it is a pretty good time waster.\\n\\n\r\nOverall I expected something way better from J.C. Staff.  The anime is okay but it had the potential to become much more.  Yumekui Merry is another case of an anime that should have just followed the manga (and waited for it to be ready). \\n\\n\\n\\n\\n",
            "date": "2011-04-08T12:19:00+00:00",
            "helpful_count": 22,
            "mal_id": 35816,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=35816"
        },
        {
            "content": "Hmmm… this is one very…how should i say…interesting anime. Why is it “interesting” you ask? Well it all starts with the characters.\r\nCharacters: The characters in Yumekui Merry are a mixed bag. Some are vibrant, while many others are less so. Some have unique, emotionally complex personalities. Yet, at the same time, most others have bare bone and single-note personalities. Let’s first start with the good ones (or one I should say). Yumekui Merry succeeds greatly with its main protagonist, Merry Nightmare, who boasts a unique costume design, as well as a fun, vibrant personality that is not only a joy to watch, but emotionally complexat the same time. Her fear of actually killing the “dream demons” instead of sending them back to the dream world brings some depth to the character as well as her interesting relationship with Yumeji. These things (and others) make Merry a very well done character in my opinion. I could go on and on about how great her character is but I sadly must move on to the bad characters.  Mistleteinn is a good example. Her role on the show is as one of the main “bad-guys” in Yumekui Merry (more like the secondary antagonist if you will). She is no slouch when it comes to recycling all of those good ol’ cliché bad guy lines every second she appears on the screen. Things like “It will be fun hurting you” and “Do you have a death wish” are just a few of the lines that will induce a cringe when watching. All-in-all, her character is poorly done and kind of seems a little like Harley Quinn’s long lost sister (in a bad way). In fact, all of the other characters are like this in some way! Each one with his/her own set of lazily written lines that can be thrown out at any second and can all but ruin a scene. They’re definitely not the worst I’ve seen, but they are pretty bad characters.\\n\\n\r\nStory: The story, as you probably guessed, is about dreams. However, you won’t find any totems or folding cities in this show. Rather, what you’ll find is an intriguing story about dreams that says that they are this whole other world inhabited by dream beings. This world is rife with good-guys (like Merry) and bad-guys (like Mistleteinn). These beings fight with each other so that people like Merry can save human beings from losing their dreams and being taken over by a dream demon. It’s an interesting premise by all means, but it’s its execution that’s less than perfect. It could just be the bad characters that weigh heavy on the show’s overall enjoyment, but more likely, it’s the cheesiness and predictability. The story has potential, don’t get me wrong, but when the shows predictability is this stupidly prevalent, and when losing your dreams doesn’t seem so bad as the writers want the story to have a happy ending, you know something’s very wrong. It also felt somewhat unfinished at the end, with a wide open space for a second season that doesn’t exist. Yumekui Merry’s story is not all bad though, as it does have its surprise moments that are definitely welcome. But these (which I won’t spoil for you) are few and far between. This and the cheesiness do indeed plague the show, but that doesn’t make the story horrible. In fact, the story is not bad! The problem is that along with the aforementioned problems, the show doesn’t take any risks. It feels as if it never got out of the box and showed me something new. Even with such an interesting and unique premise, Yumekui Merry’s story never seemed to get off its feet and start flying.\\n\\n\\n\r\nSoundtrack:  Yumekui Merry’s soundtrack can be put into to two simple letters: O and K. The soundtrack reminds me a lot of The World God Only Knows. Upbeat symphonic music plays in the background as Merry fight’s dream demons. Then, it turns soft when a more sad moment arrives. All with a hint of a soft electronic style that’s just barely noticeable. Sounds great, right! Yet it’s not the sound of the music that makes it OK, it’s the lack of variety. The show’s soundtrack seemed to be repeating itself time and time again! It seemed as though Yumekui Merry’s OST only had three tracks: one for the sadder moments, one for the funny/normal moments, and one for when Marry beats a dream demon. This lack of variety made the songs get somewhat annoying as time went on. Not that the songs are bad, but the lack of them and repeated use of the same songs cripples Yumekui Merry's soundtrack greatly.\\n\\n\r\nArt: The art in Yumekui Merry reflects my opinion of the show: a mixed bag. Sometimes the art was crisp and beautiful. Yet at other times it felt unfinished and lazy. Sometimes characters and backgrounds have a lot of detail in their design, and sometimes there is a need for more detail. The art is by no means bad; in fact, some of the art was absolutely beautiful. It’s the inconsistencies in the art that get on my nerves, if only because most other art in Yumekui Merry is so well done.\\n\\n\r\nConclusion: Yumekui Merry is an enjoyable show that is plagued with some problems here and there as with any show. However, Yumekui Merry’s problems are ones that, sadly, cannot be overlooked. Look one minute, and you’ll see a unique and beautiful anime with nice characters and a cool premise. However, look again and you’ll see a poorly done, cheesy, and predictable show with a looping soundtrack and some mediocre art. When it’s all said and done, and we weigh the good and bad things about Yumekui Merry, we’ll see the scale read at about a 6 out of 10.",
            "date": "2013-09-22T09:40:00+00:00",
            "helpful_count": 17,
            "mal_id": 113803,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Multisupermono",
                "username": "Multisupermono"
            },
            "url": "https://myanimelist.net/reviews.php?id=113803"
        },
        {
            "content": "The first and only episode that I've seen caught my attention, so here is a review on it.\r\nFirst - the STORY. A boy who has a strange ability meets a mysterious girl who falls on top of him and both of them become the main characters of the story. Typical, isn't it? But it's not just that. The action takes place in a dreamworld, filled with dilapidated buildings, moving fish skeletons hanging from the sky, cats who are pursuing you and a strange masked guy who wants to take over your body. The characters seems to have different personalities and their own background.\r\nThe ART isgreat, the animation too, it's very detailed and different from what we're used to see. This is one of those rare animes where the action and the animation goes perfectly with the MUSIC and the music in this anime is absolutely outstanding!Not only the opening and the ending (IOSYS), but and the OST composed by Keiichi OKU will be liked by all true anime-soundtrack lovers.\\n\\n\r\nAnd last, but not least - the cast: Nobuhiko Okamoto as Yumeji Fujiwara /Ikki-Air Gear, Usui-Kaichou wa Maid-sama!, Accelerator-Toaru Majutsu no Index and Rin Okumura in the upcoming Ao no Exorcist/ and Ayane Sakura as Merry Nightmare /which she handled exceptionally well for her first role/.\\n\\n\r\nOverall if the anime continues like the first ep it'll be A MUST WATCH this season!",
            "date": "2011-01-07T01:31:00+00:00",
            "helpful_count": 16,
            "mal_id": 33529,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182748.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Alice-",
                "username": "-Alice-"
            },
            "url": "https://myanimelist.net/reviews.php?id=33529"
        },
        {
            "content": "When you are looking for anime, the first episode is important. It is a matter of making or breaking it to an anime watcher, since no one will continue watching an anime that can't even start properly. This is how it is for me at least, and I do admit that I may have passed by some great anime with that philosophy. And at the same time, I admit that I have been utterly let down by that same philosophy. Yeah, I am talking to you Dreameater Merry.\r\nDreameater Merry started out, to me, immensely promising, with a cute heroin, a down to earth leading male,and cute girl characters throughout along with a dreamworld plot that I have always taken interest in. It introduces Merry, who is trying to get back to her world in any way she can, her way being defeating monsters from her world that come the real world and try to follow them back. The story progresses from that...kinda. The initial plot sounds great, and the first couple episodes had me. Then, I kept watching, and basically got a metaphorical fan-kick to the balls. I felt like I was watching 11 Eyes all over again. The pacing had picked up to a point where feeling rushed is an understatement, and it kinda felt like when your on the freeway and your gas pedal sticks. Your trying to figure out whats wrong and trying to stop it, but by the time you do, you crash to an unhappy ending (for the viewer).\\n\\n\r\nThe art was inconsistent, but at points I was actually quite impressed. It actually looked like it had a large production value at some parts, but then it would die down into what I like to call \"filler art\" mode, and merely makes it good enough to put on the air.\\n\\n\r\nWith the OP as good as it was, and I'm saying that with a ton of respect, the rest of the soundtrack barely kept my interest past the first couple of episodes. At first, with the bells in the first episode, I was quite excited, only to be let down.\\n\\n\r\nCharacters were plentiful, but lacked...well, character. There was alot of characters to work with, but all of their personalities are either boring or unoriginal (the only exception I could find would be Mistletine and John Doe).\\n\\n\r\nIts hard to enjoy when everything else is so wrong. Needless to say, I was disappointed overall with this anime and wouldn't personally recommend it. However, if what I said you don't believe, go ahead and watch. But you have been warned.",
            "date": "2011-12-13T19:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 49125,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/295949.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheGoatee",
                "username": "TheGoatee"
            },
            "url": "https://myanimelist.net/reviews.php?id=49125"
        },
        {
            "content": "Yumekui Merry is one of my favorite animes. Why? Because when I watched it, I never got tired of anything in it. The theme song was well done, as well as the ending song, and the art was not perfect, but pretty good. The story starts with Yumeji Fujiwara who gained the ability 10 years ago, to see the aura of peoples' dreams and ultimately predict what kind of dreams they are going to have, as well as nightmares, which is not like your average guy in high school. After seeing the same dream repeatedly about a war with cats, one day, a mysterious girlfalls on him. And that is how Merry Nightmare comes into Yumeji's life. I find it quite amusing that most people think that Merry name comes from the holiday in December, but it really comes from a song that everyone knows. If you don't know the song, don't worry too much about it. Anyways, throughout the whole series, Merry and Yumeji encounter \"mumas\" (dream demons) that use people as their vessel to live within them in the real world as opposed to living in the dream world. Merry is trying to find her way back home and Yumeji promises to send her back to the dream world because Merry is indeed a muma that had appeared in the real world 10 years ago but had no memory of appearing in it. Halfway through the story, a new plot arc appears which has to do with the evil mumas who kill other mumas and destroy peoples' dreams. You never know what will happen next in the story. I admire that since nothing in the series is predictable from the moment you see it, making it a better story overall with unexpected turns in events. The ending was great but it makes you want a sequel. Dreams give you strength to never give up and this story has a good way of portraying it. Watching the series escalate was very thrilling and the action was pretty cool. The characters were well developed in both looks and characteristics. This, by far, is a great anime. Even if it's too short, I give it my congratulations. I recommend that you, the reader, should watch this anime. If you like anime that has action as well as fantasy and supernatural things that are based on positive outlooks in life such as hopes and dreams, this anime is for you!",
            "date": "2011-06-27T13:02:00+00:00",
            "helpful_count": 9,
            "mal_id": 38383,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darkraivids",
                "username": "Darkraivids"
            },
            "url": "https://myanimelist.net/reviews.php?id=38383"
        },
        {
            "content": "I'll be short, sweet, and to the point: while this anime is not the best anime ever made, it is quite refreshing for a new series. \r\nPersonally, I loved the art, and one thing that really stood out were the shapes/colors of the dream demons' eyes. The characters all had a certain vibe to them, and I think they did a good job synchronizing all of these personas together with the colors/shapes/flow of their animation. There is a lot of variant colors used in this anime, and I'm just a sucker for a full wheel of color wonderland. \r\nAs far as the plot goes, it'spretty fair. It doesn't do much to actually grab your attention, but the way they went about it really wasn't all that bad. \\n\\n\r\nDefinitely a good anime to watch in between your other ones as a filler in itself. I also appreciated the non-ecchi feel to it. They don't go out of the way to go and show panty shots and all that. \\n\\n\r\nAs far as the music goes, this department was pretty lacking. It was ok, I sort of wished they had put more effort into that, but maybe they'll pay closer attention if they get a next season (which they probably will if all goes well, because they left a lot out). I did like the intro, though. The animation/music was perfect. Outro was rather bland and I pretty much skipped it each time.\\n\\n\r\nThe characters do develop a bit, but overall it was pretty slow. I don't know, this didn't really grab me.\\n\\n\r\nSo, overall, it's a good anime sustenance, and the art is awesome.\\n\\n\r\n(this is my first review, so I hope it helped!)",
            "date": "2011-04-14T11:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 36055,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/251056.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cybunny_lizzie",
                "username": "cybunny_lizzie"
            },
            "url": "https://myanimelist.net/reviews.php?id=36055"
        },
        {
            "content": "There's something about dreams that people find so compelling. Scientifically, it is explained as brain processing various information seen during the day or fragments of subconscious thoughts. This hasn't stopped philosophers and authors throughout history to interpret it as a parallel universe, alternate dimension, vision through another mind, or even message from God. 'Yumekui Merry (Dream Eater Merry)' is set in a world where dreams are linked to an alternate universe, and residents of the dream world can possess a person in the real world.\r\nThe protagonist, Yumeji, has a special ability to predict what dream others will have by making a ring with his fingersand looking through it. This makes him look like an idiot in the process, but proves to be a very useful ability as he can also see who is possessed by Muma (Incubus), residents of the dream world. He has a strong sense of justice like most harem protagonists, and vows to help Merry, an abnormality of a Muma who exists in reality with her own body, to return to the dream world.\\n\\n\r\nFirst few episodes of this series begin with \"villain of the week\" format, but the story flows better once all the main characters are introduced. The plot is driven by mystery, as new characters and concepts are introduced with very little detail at first, slowly unraveled and leads to a new mystery. The story maintains a decent pace with the cycle of new mysteries constantly to keep us guessing what will happen next. In this respect, this series is very much like 'Fate/Stay Night' in the way story unfolds, and also the \"master-servant\" bounded relationship where death of one side affects another.\\n\\n\r\nThe variety of dream worlds were excellent, with each one projecting distinctively different atmosphere, and the battles are different. Sometimes Merry fights, other times it's between two other characters. Sometimes Merry may win or lose, villains may even escape. Sometimes battle never takes place, and our heroes are taken into the dream world merely for a conversation. This series makes the bests use of the dream concept by creating different patterns that never feel repetitive.\\n\r\nThere is a consistent theme to arguments between focal characters and antagonists: The importance of having hopes and dream, and morality of achieving objectives at the cost of others.\\n\\n\r\nWhile the story was well structured, character behaviors did not always make sense. All the good guys are so naive that they don't seem real. If it's between a person losing their dream or losing the control of their body, the choice should be obvious, especially since the bad guys are trying to take over more victims. Not only that, the heroines suddenly decided it was fine to defeat the boss (therefore taking the host's dream) in the end without coming up with a proper resolution or epiphany to their value conflict, effectively throwing out all the arguments out of the window. I did not understand why they didn't just kill the teacher in the real life, when they already decided that he was pure evil and deserve to have his dream taken away. They knew his identity and how strong his Muma was, taking his life is better than having all their dreams and more Muma's life taken away.\\n\\n\r\nCharacter development was done poorly as well. Merry has shown absolutely no romantic interest in Yumeji at first, but suddenly turns into tsundere out of the blue. Her, and other tsundere were all blushing and stuttering in really obvious ways that were not convincing at all.\\n\\n\r\nAnimation in this series was so wonderfully done that I had to recheck OP credits to make sure it was done by J.C.Staff. It turns out, 'Yumekui Merry' was directed by an anime movie director, which might explain why there were numerous advanced cinematic techniques that made this series an absolute pleasure to watch.\\n\r\nThe way hair bounces, character fluidity, and choreography of battle scenes were incredible. Background art had a canvas-like texture that also seemed to have depth. What separates the animation in this series from all other action series though, is the way \"slow\" scenes are presented. When characters are talking, every scene was not just in medium shot. They are seen from many different angles, distance, and sometimes even through foreground objects with deep depth of field. \"Camera\" is constantly moving, and the way it pans in or out were beautifully executed. Transitions between real world and dream world are seamless, and the surreal abstract backgrounds in the dream world always seemed bizarre and mysterious.\\n\r\nThe quality of art and animation were technically very high, and the distinctive style and atmosphere worked. It is the best artistically directed TV anime I have seen, and this is the series I will measure all future TV series animation against.\\n\\n\r\nSound in this series was also exceptionally well done. Every character's voice matched perfectly, full of emotions. The detail of background noise in some scenes are mind-boggling. Even whispers are discernible and everything sounds real. In addition, the randomness of background noise such as sports club jogging and chanting, bird chirping in outdoor scenes, and bar code scanner beeping exist without those objects ever appearing on the screen. I especially liked this technique, because it gives us viewers so much more detail and sense of reality to the environment, stimulating both senses at the same time.\\n\r\nBGM was brilliant, every piece projected a distinct, creepy and ominous atmosphere using different instruments, and battle themes were exciting with a sense of urgency and desperation. Sound was really well edited, but poorly mixed in select scenes where BGM was obtrusive against conversation, and seiyuu voicing did not match character mouth movement.\\n\r\nOP was a very catchy rock song that suits the series really well, but the OP animation was rather bland and flashes too fast to be memorable. ED was rather generic.\\n\\n\r\nI almost judged this series by the cover as another J.C.Staff harem series, but it turned out far more intriguing than I had expected. 'Yumekui Merry' had an interesting premise, but character and story did not develop as well as they could have. However, animation and sound alone is fun enough to watch, and there is something about it that draws you in to the story.\\n\\n\r\nThe final episode was dramatic, but rather unsatisfying because characters \"broke the rules\" of the dream world by realizing the strength of their will translates to their physical strength. While this is an acceptable ending for the final battle, their quest is still far from over. There are also far too many loose ends left unexplained. Many viewers may feel they have been betrayed by the ending. I'm curious how a sequel would salvage this.\\n\\n\r\nThis series was very enjoyable assuming there will be a sequel. I will be hoping and dreaming for a followup season.",
            "date": "2011-04-10T10:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 35873,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35873"
        },
        {
            "content": "Everyone (or for the majority of the population) has dreams.  Dreams drive us to aspire what we want to be or what we wish for in our little insignificant lives.  So, the people of Japan thought, why not have a complete anime about dreams?  And that's where Yumekui Merry comes in.  \r\nStory: The story of Yumekui Merry starts with a fated encounter between a dream demon, and a human.  Dream demons exist in the realm of dreams where humans go whenever they sleep.  In that realm, a whole host of dream demons varying in shapes and sizes, wishes tocrossover to the human realm called \"Reality.\" (Sounds like something I need to get back to.) In this world, dream demons are able to cross over into reality by using a human as a vessel, nestling themselves into the aspirations of a person.  From there on, it gets a bit more sinister, as while some dream demons coexist with their vessels, others completely take over and use the body for their own deeds.  The sign in which a person is being controlled by a dream demon is by looking at their pupils, as every dream demon has a distinct shape.  Back to the first sentence, the story revolves around a mysterious dream demon named Merry Nightmare, who meets Yumeji, a human that has the ability to predict what dreams a person has later that night.  As far as a premise, this anime has one of the most interesting and great premises ever.  The execution however, was garbage.  Beyond the initial premise, the story doesn't really go beyond that.  The story follows something I like to call \"Zero no Shana format\" where within the story, there are smaller, separate stories within that have almost no correlation to each other.  \\n\\n\r\nCharacters: First we have my favorite character in the show, Merry Nightmare.  Or, as she is later known as, Yumekui Merry.  As the main female character in this series, Merry is a dream demon that possesses special abilities.  With pupils similar to a goat's Merry has a playful but longing mentality, similar to Holo from \"Spice and Wolf.\" With a big desire to return back to the dream world, she becomes one of the most standout characters in the whole series and carries the show as a whole.  With a great attachment to her hat and a love of donuts, Merry becomes the reason for Yumeji's mindset in the series.  Next is Yumeji.  As the main male protagonist, Yumeji has the special ability to see what kind of dreams a person has by looping his right index finger and thumb together, then looking through it.  Upon meeting Merry, he creates a contract with her and promises to take her back to the dream world no matter what cost.  As valiant as this seems, that's pretty much it for his character.  Aside from caring for Isana and her father for taking him in, getting Merry back to the dream world is his only true goal in the series, and makes him very bland of a character.  Aside from these 2, the rest of the cast for the most part show little to no change and fit the purpose of being just, there.  Antagonists show up left and right, being defeated easily or getting away before moving onto the next one.\\n\\n\r\nArt and Sound: For the most part, the art was good as the detailed worlds of the daydreams are very pleasing to the eye.  There are also several chibi scenes which involve Merry, adding into how moe she actually is.  Other then that, the animation was adequate with some fight scenes that weren't as fluid as it could be.  As for sound, there really was no stand out track as they were all generic for the most part.  The only thing I would consider standout would be the opening song which matches well with the feeling of this show.  However, it still is somewhat adequate. \\n\\n\r\nPersonal Enjoyment: For me, Yumekui Merry was an interesting show in the least.  With a very unique idea for the series, the execution just wasn't there to make the show as likable as it could be.  Yumekui Merry is filled with several plot holes and rushed plot, which make it even less good then it could be.  There were characters who literally existed in only one episode and felt like a waste of time to create.  Above all, the biggest thing that bothered me was a select few scenes in the opening.  In the opening, Yumeji and Merry are seen as little children, creating an idea that could be explored in the future, creating more of a mystery to the series as a whole.  Regardless, they do nothing with that idea and makes me wish that they did because there could some great potential if there was a backstory.  Above all, Yumekui misses many details and any sort of plot exploration, but it is a good anime if you want to know more about dreams, and an overall great female lead.  The definitely went all out with her character.",
            "date": "2013-10-08T00:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 116049,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=116049"
        },
        {
            "content": "Well drawn, good story sort of, not a very greate ending and almoust no history conserning the characters, the villain they fought at the end was to my liking \"'The forest woman'' was what she was called i think",
            "date": "2011-04-17T07:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 36161,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/103771.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zieek",
                "username": "zieek"
            },
            "url": "https://myanimelist.net/reviews.php?id=36161"
        },
        {
            "content": "Yumekui Merry is a good shounen in theory. It was unfortunate that I was able to agree with the piece of news where the director apologizes for failing (you can find it towards the bottom.) Alas, do not despair, there is still a handful of good things about this show and it is not all as bad as the director thinks.\r\nDreams are always a cool thing to think about? What purpose do they server? In this world, due to somebody's interference demons are giving humans nightmares, and possessing them. In many ways the setting is incredibly done, and there is a lot of backstory thatmakes it seems as if there is a lot of depth. However, this adaption obviously is too soon, as little of this story is explored at all. Half way through we reach the end of the introduction as supporting cast is introduced, and then we stop for the filler to follow.\\n\\n\r\nThis is an action show. The reason why the director apologized is because this was the fatal flaw. The fights are incredibly slow, and the camera angles are horrible. I proclaim myself king of the oblivious, but even I could tell that the action in this show was so bad I could have clawed my eyes out. Merry is suppose to kick the demons ass \"Dream eatter Merry\" is the title after, as she saves people from the nightmare giving demons. However, no matter what is really happening because of the animation it is hard to enjoy any of it.\\n\\n\r\nThe characters have a good amount of backstory… If you pick up the manga. We get to see that Merry is pretty mysterious even to the demons, but we never figure out why. Yumeji stays weak, not useless thankfully, and although he is a cool character we don't learn anything about him either. John Doe, who appears twice in the story is also an interesting character that is unexplored.\\n\\n\\n\r\nYumekui Merry isn't a bad show, considering I hand out scores a lot lower. It just could have been much better than it turned out to be. If your interested I would recommend just starting off with the manga, which I picked up and enjoyed much more.",
            "date": "2011-07-20T16:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 39607,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=39607"
        },
        {
            "content": "Great animation.  Great character design.  I liked the voice actors they went with (at least in the 日本語　version, which is all I watch when I have a choice).  A lot of the \"classical\" music in the episodes reminds me of Debussy (probably my favorite composer).  I also really liked the ending theme.  All in all Yumekui Merry was a very enjoyable production.  I'd love to see a sequel; which means, there probably won't be one.  Why is it the best anime rarely get a sequel?  Anyway, I highly recommend Yumekui Merry!",
            "date": "2011-04-07T23:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 35801,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/joneboy",
                "username": "joneboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=35801"
        },
        {
            "content": "We've all been told at one point or another to follow our dreams right? Well if you haven't, allow me to be the first to do so! Well, the creators of this anime took that to a whole new level. They made dreams more than something to pursue, they made it an integral part of your body's ability to function; a life source of sorts. To lose your dreams was almost the same as losing your soul....and in a way it can be rather reflective of life. Without dreams or any form of guidance, we have nothing to pursue and no rewards to gain. Movingforward...\\n\\n\r\nWe've got a pretty interesting bunch of characters... surprisingly, several of the supporting roles have quite a bit of stage time and importance rather than an honorable mention. For the sake of space and getting to the point, I'll leave those supporting roles as an honorable mention in this review. \\n\\n\r\nTo open, we've got Yumeji Fujiwara. He's your not-so-average-but-not-by-much Sophomore in High School...what separates him is his goofy ability to predict the nature of someone's dreams that night. Remember when we were 5 and would meet our index finger and our thumb to imitate goggles, glasses, binocs, etc? Whelp, he does that and is able to predict based off of the colors he sees surrounding your body. Kinda goofy and not all that impressive but it does prove to have a use. He's lighthearted and overall pretty nice guy, he doesn't give up on people and keeps his promises. His life changes a bit when he meets Merry, who I'l go into next, as she 'falls from the sky' and promptly puts him on his back as a cushion. We move onward from there...a little bit more perspective will be in her description.\\n\\n\r\nNext on the list, we've got Merry Nightmare, later dubbed \"Dream Eater Merry\" a la Yumeji. She's what is known as a Dream Demon, creatures that live in the dream world (who'd have thought?) that we all visit when we crash out at night. Here's the thing, instead of the humans creating their own dreams and these creatures happen to walk in, the humans, without knowledge of the fact, enter the territories of these particular dream demons when they sleep. These demons can come over to the real world by using their visitors as 'vessels'...in short you share a body. Some force their way in, some don't. I'm getting somewhere with this...and here it is, Merry is special in this because she is in the real world WITHOUT a vessel. She hasn't the faintest clue as to why she's there and she has been here, not to give anything away, for a VERY long time trying to return to the dream world. Well after some short-term tsundere with Yumeji, they create a 'contract' between each other  to return her to the dream world. Story progresses from there.\\n\\n\r\nFor our few sentence honorable mentions in perspective to face-time, we've got the not-so-important-but-so-important Yuri Kounagi, Engie Threepiece, Ryouta Ijima, Isana Tachibana, and, later on, Mistletine.\\n\\n\r\nI described the plot more or less in the main character descriptions now that I look at it. I will say this to reassure and to establish that this does have what I would call a 'solid' plot, simply because it's not episodic...it does progress. I make it a personal point to not go into excruciating detail on the plot simply because I think it gives too much away and takes away the splendor of discovery by actually watching.\\n\\n\r\nThe plot could get a little sketchy here and there as to what direction in which it's really going. Are they going to try getting X, are they pursuing Y, or are they going to take down Z. Get the picture? It was could be a little ambiguous as to who the actual main antagonist is based on sequence of events. I guess they finally settled down and made a group decision, for at least this season, they were going to choose Mistletine and Ryouta. I say that simply because she came a bit later in the game. Maybe they tried a little too hard to keep things open for a second season or maybe that's just how it turned out. \\n\\n\r\nAgain, it could very well be to keep things open for a new series, trying to not reveal too much in terms of story, in which they engage the actual head honcho. If not, then you can decide for yourself on how you react towards the ending...not necessarily fair to write a review and use the body of the story or the ending as an aversion to actually seeing it for yourself. I intentionally beat around the bush. Yeah I get it, time is great, but you're also sitting here watching this instead of doing something that could be multitudes more constructive..correct? I thought the beef of the story and the ending was nice and I'll leave it at that for my feedback.\\n\\n\r\nEnough of my rant and back to the task at hand, Art and Sound! I thought the art to be very attractive and pleasant to the eyes. Bright, colorful, not jagged, they made sure they didn't color outside the lines...I'll just reiterate the fact that it is a very attractive form of drawing in my eyes. It gave the characters a much warmer feel. I suppose, the art was the strongest part of the anime in my eyes. The sound wasn't without clarity and the effects, albeit a little generic, were in sync with what was actually going on. Nothing really felt out of place when it came to battle music or execution of sound effects. The intro music and ending music were both pleasant and matched whatever opening and closing cinematic they were paired with.\\n\\n\r\nOverall, I found this to be a rather enjoyable anime to watch. It's a nice break from the serious and takes the viewer back to a much lighter and youthful setting in which to relax in. You get to experience comradery among friends for a common interest, the strength of the heart, and, most importantly, the power of your dreams! Thanks for reading, enjoy the show.",
            "date": "2012-10-14T21:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 75001,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1475485.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Myriadd",
                "username": "Myriadd"
            },
            "url": "https://myanimelist.net/reviews.php?id=75001"
        },
        {
            "content": "Well, this is I guess a bit like Soul Eater in that there are children in charge of fighting; also the fact that the characters seem rather Moe then frightening, especially Merry who acts much like a child. She whines and cries like a little brat. These characters, normally, I can’t stand but this one didn’t seem as bad. The differences between the human world and the dream world does blur a bit and only looks strange when something odd pops up like a floating fish skeleton. I’m not sure why Merry wants to go back when she seems to be having a wonderful timein the human world. Another strange thing is that right after Merry comes into Yumeji’s life, he actually wants to have the bad dreams to find out things about her. What is up with the name John Doe for an actual villain’s name? It just really feels too generic for one. Lots of the names from the dream world seem like they were just grasping at straws to get a name. \\n\\n\r\nThe show actually does a 180 near the end; it rather threw me off a bit. It was like they thought the show was going way to slow (and it actually was for a 13 episode show) and speed up the ending so fast that I had no clue which way to look. Not only that, but they added a really strange enemy that really seemed out of place. I have heard that the enemy in this show was actually not in the manga. If that was true, then what was the point of having a character that wasn’t flushed out like that? It just didn’t play out how I thought it would; it could have been nice if it wasn’t for the fact that the ending didn’t fell like an ending at all. It was like a middle of a series or even the end of a season. I really feel that the show should have been longer and more fleshed out rather then the crap ending they did give us.\\n\\n\r\nThe art style is rather nice and yet, the design of most of the characters seems generic. I’m pretty sure I have seen Yumeji somewhere else before or at least the design of him. Most of his friends in the real world are also rather generic and boring. Simple Moe characters with no real way of standing out. At least Merry stands out with out strange her outfit is and her eyes. Merry’s eyes are actually interesting, very reptile-like or frog-ish. Other then that, she looks much like Karin from Vampire Chibi Karin and an elf had a child, she even has fangs. Most of the character designs for the dream demons actually seem like they came from the new game coming out called ‘Skull Girls.’ It’s a good thing since this is a fighting show, and I would be happy if this became an actual fighting game. \\n\\n\r\nI don’t get when they give us some clips that look as though they were just made as roughs for the manga. It just takes the fluid part of the art and throws it at a wall. It does build suspense I guess but I know other ways they could do so.\\n\\n\r\nI only watched the Dubbed version for the voices and could not find the sub version. The cats feel way too cartoony and yet one cat’s voice is to macho… I would have thought he would have a squeaky voice like Mickey Mouse. Merry’s voice actually feels pretty good to her character as well as John Does, where as Yumeji’s voice again, like his artwork, is pretty generic. One thing that bothered me was that she had this quote that she seemed to say just to add something for the moving mouth.\\n\\n\r\nThe music is actually pretty nice for a fighting show and I kind of fell in love with the opening music. The scores for the back ground don’t really stand out much but yet when they are needed, they seem to shine through and set the mood for it.",
            "date": "2012-05-12T03:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 61079,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=61079"
        }
    ],
    [
        {
            "content": "[warning it has spoilers]\r\n*sigh* yet another great anime had a horrible ending\r\nthe ending of \"if everyone join hands we can beat the bad guy!\"\r\nI mean I expected that to happen to really? they are seriously going to do that?\r\nI was kind of disappointed at the ending.. on how it ended.. \r\nI mean I knew that it was coming but still watching it made it worse\r\nand the last episode was very annoying for me to watch\r\nlike I literally had to skip some scenes, I rarely skip...\r\nlike it was like watching those never ending battles where a character jumps in with new powers but the bad guyeither cheats or unreleases his actual powers.. \\n\r\nand don't even get me started on Mystletainn and that teacher Ijima.\\n\\n\r\nthey were original anime characters and honestly those two freaks ruined the anime for me. \\n\r\nfirst I thought Ijima was cute (glasses love~) but he is just sooo annoying... \\n\r\nand Mystletainn she is a total b**ch \\n\r\noh~ I attack very graceful but I'm evil \\n\r\nboth of their crazy sadist face expression made me not want to watch it no more\\n\\n\r\noverall, the beginning of the anime was okay\\n\r\nthe ending sucked!",
            "date": "2011-04-08T01:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 35805,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xojeyxo",
                "username": "xojeyxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=35805"
        },
        {
            "content": "So far, Yumekui Marry, is not an anime that will shine for it originality, but take popular element from supernatural series and apply them in a way that support its own history without fall in the plagiarism or being compared to other series.\r\nShould you give it try?: Yumekui Merry wont be the must praised anime of the season but if you have some time to spare and enjoy some fight, crossed with some \"moe\", this anime will be more than enough to enjoy a time in front of the Pc",
            "date": "2011-01-23T03:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 33980,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/garf02",
                "username": "garf02"
            },
            "url": "https://myanimelist.net/reviews.php?id=33980"
        },
        {
            "content": "Sometimes I wonder if there is a formula for being able to mess up things like telling a cohesive story, establishing character motivation, and outlining a linear plot that builds interest with each passing episode. If there is, the writing staff behind Dream Eater Merry coined it. Now it isn't the worst example I've seen of this, because that still belongs to titles like RaXephon and Soul Taker, but nearly everything about Dream Eater Merry suffers from this horrible cocktail that ravages a lot of modern anime I watch. If you can only do ONE THING, give me a reason to care.\r\n STORY: One ofmy biggest problems with storytelling in anime nowadays is the overused template of shrouding EVERYTHING in mystery until an episode or two away from the finale. A common way to utilize this is usually by having a character with amnesia to center around. This often gives the writers a reason to \"flesh out\" aspects in incredibly vague detail and you can use cryptic smash cuts to an event that will be more elaborated on later in the plot, you know, FORESHADOWING...barring my interest is retained enough to get that far. It's never directly explained how Merry gets lost, or why she's in the human world. It's tossed up, but never paid enough attention to, so she just eats doughnuts. Yumeji is able to see dream signs in people, but it's not touched upon how or why he can do this. When the show isn't spending its time explaining key things, it has a monster-a-day pacing that fails to pick up in intensity while throwing several red herrings that go nowhere. Dream Eater Merry seems disinterested in building no momentum to anything until the end, which leads to a pathetic finale that's more appropriate for a mid-season arc, not a climax. With 13 episodes, elements felt rushed when they didn't have to be while dragging at various points. SCORE: 4/10\\n\\n\r\n ART & ANIMATION: The quality that went into the production is one of J.C. Staff's poorest efforts. Other than Merry's design herself, the characters look like your standard anime template of vanilla teenagers. If you lifted Isana or Saki and placed her in Special A, you wouldn't notice. Engi Threepiece and John Doe (probably the only character that comes off as \"cool\" to me) are unique designs, but come off as glorified cosplayers as far as I'm concerned. \\n\r\n The animation and direction is a mess. The messy action sequences are kept mercifully short, because the framerate and character detail quality drops to a distractingly low level as soon as things have to start moving. The editing is choppy during talkie scenes, the camera is needlessly focused someone's feet, then cuts to a windowsill, and immediately back to a girl's thigh. These kinds of things will give me vertigo!! If there is one detail this camera stays locked onto is Merry's midriff. There is no other anime I've ever seen that focuses on panties as much as you will see Merry Nightmare's midsection. To be fair, she has a great torso and one of the more prettier girls with a petite physique. SCORE: 4/10\\n\\n\r\n SOUND & MUSIC: I own the English dub released by Sentai Filmowrks, who have done some pretty decent work as of late. It felt pretty good to hear Hilary Haag as Merry, I feel like I haven't heard her since she destroyed her voice dubbing Excel in Excel Saga. Blake Shepard is serviceable as Yumeji, but he's one of those male VAs whose specifically cast to sound like Default Male Character. Know what I mean? Yuri Lowenthal, Bryce Papenbrook, Sam Regal...if you need a voice that kind of sounds like a teenager, but clearly sounds like a 40 year old man? Chris Ayers is wasted as John Doe. The opening theme is pretty catchy, so high marks overall in the music department and English voice acting. \\n\r\nSCORE: 7/10\\n\\n\r\n CHARACTERS: Eeehhh, Dream Eater Merry bites off more than it could chew in this department. Being that I haven't read the manga (I'm leaving it out of the equation and focusing on the present material), I'm certain there's more to Merry Nightmare herself than this series leads on, but she wants to find a way back to this vaguely described Dream World. This left me with a great deal of questions that would probably take more than 13 episodes to verify, but with that in mind, they did as little as they possibly could to inform you on what to look forward to. None of these characters have arcs, revelations, they seem to learn nothing, and for the most part, it's treated as none of your business!! So because there's quite a few characters here, they just keep adding more, like Engi Threepiece and Leon, but does little to nothing with them that's of any relevance. Until the final deal towards the end, there's no sense of character development and everything that happens simply feels like a sequence of events leading to the next. The character that has all the answers, John Doe, is left out intentionally, otherwise, there wouldn't be a plot. There's just too many characters and not enough time to give them purpose. SCORE 5/10\\n\\n\r\n IN CONCLUSION: Dream Eater Merry did not have much going from my perspective, so it's not really a huge fall from grace. It just comes off as yet another run-of-the-mill anime that exists in this era of very placid shows. Other than the animation, everything else seems serviceable, but this otherwise a very weak cup of tea. A plot that fails to garner traction, art design that seems unmotivated, and lazy characters make for a very tepid anime viewing experience. It's bad at what it does, but I've seen far, far worse. OVERALL SCORE 5/10",
            "date": "2016-01-07T13:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 207980,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210239.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Colonelfancy",
                "username": "Colonelfancy"
            },
            "url": "https://myanimelist.net/reviews.php?id=207980"
        },
        {
            "content": "I wanted to love this anime, but it just doesn't cut it for me.\r\nYumekui Merry, or Dream Eater Merry, is an anime that brings so much to the table, then drops it flat on its head. There was a lot of potential for true greatness here, and I feel like a lot of it went to waste. One main character can see into peoples' dreams, and the other fights off nightmares to save them from losing their emotions entirely. The story is, at least, quite good, and is the main reason you'll want to keep watching; it makes you think, at least, about the potentialpossibilities for all of the characters, even the ones that aren't very important, which is kind of a good thing.\\n\\n\r\nThe artwork and direction are a mixed bag. You'll get some fantastic animation during the fight scenes, and some horrifyingly cheesy direction at some other points. The environments always have a foreboding, dreary sense about them, so much so that it serves the story a little too well and actually distracts from some notes that were meant to be a whole lot more light-hearted. You'll find this a lot in Yumekui Merry, so if your patience doesn't serve you well through the first episode, you're probably not going to fall in love with the series.\\n\\n\r\nThe sound work would be decent for something with a smaller budget. Some pretty good BGM and interesting enough voice acting are enough to keep you interested, but not devoted and intent on reading into every word. Ultimately, the voice acting ends up being a little stale at points where it needs to be livelier, which can tear the anime apart from the inside out where it needs to be tighter. Yumeji, the male protagonist, in particular, is really flat for someone who's got so much craziness going on in his life, and even more so for someone who is implied to have a romantic relationship with the main heroine. It all just becomes hard to believe and doesn't take itself seriously at all.\\n\\n\r\nCharacters are a redeeming factor here, thankfully. Even if they sound a little flat and emotionless sometimes, it's hard not to remember Merry's signature look. The design looks like a collision of Kingdom Hearts, Soul Eater and Jet Set Radio, if you had to animate it, which leaves a fine lasting impression. However, it's very easy to rely on these characters to hold the whole series together as a result. This leads to a bittersweet conclusion that I felt was inadequate for the time and effort it spent building up to the final moments of the show.\\n\\n\r\nI wouldn't recommend this. Ultimately this series has a lot of redeeming factors that could save it, if the other ones didn't constantly get in the way and seemingly purposefully set us up to knock us down. The end result is broken and muddied, and it's not pretty in the least.",
            "date": "2012-12-24T11:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 81180,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/463918.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 3,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sparkyt3hMadman",
                "username": "Sparkyt3hMadman"
            },
            "url": "https://myanimelist.net/reviews.php?id=81180"
        },
        {
            "content": "Story(4/10): The story gets rushed at the end and they throw in a throw away villain who's supposed to be \"Omega Strong\" and all but it fells like a rushed ending doesn't touch on the actual main antagonist at all except for a few scenes. Not only that but the anime suffers from the manga not being fully released so they suffer from filler at the end and little to no story told. \r\nArt(4/10): They may have some cool screen shot moments but the animation didn't age well at all. With the interesting dream worlds and character designs the animation is very plain and doesn'tlook that good.\\n\\n\r\nSound(5/10): The music has its ups and downs and it overall just eh, while some of the sound design can get on your nerves. \\n\\n\r\nCharacters(4/10): Like I said the main villain at the end is pretty generic and was rushed in for filler, and we also don't see much of the main antagonist at all. The main characters don't have much character development mainly because of how little source material they had, also they explained none of the back story of the main characters.\\n\\n\r\nEnjoyment(5/10): Its a eh experience overall, only reason I had some enjoyment was because I was a fan of the manga, those who didn't read the manga will like this series less and see it as generic trash.",
            "date": "2017-11-30T14:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 264261,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5262190.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Vaffanculo_",
                "username": "Vaffanculo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=264261"
        },
        {
            "content": "CONTAINS A FEW SPOILERS\r\nI had heard of the name of Yumekui Merry on several boards around the internet about a year ago. I had never really looked into it or even read about it in the aforementioned boards. But, the name somehow just stuck with me.\r\nThen, a couple of days ago, a person I know recommended this anime to me after I had asked for a random recommendation meeting the criteria of ‘it just has to be interesting’. Well, I just watched it and his suggestion really delivered. That was just that, though. Yumekui Merry is only interesting.\r\nNow is that a bad thing? Definitely not.But is it enough? Absolutely no. The concept of Yumekui Merry was pretty good. It was really slow at first but it had me hooked in its strange world by the third episode. What I am saying is that the execution was bad. So, to explain my qualms with this anime, I’m going to have to spoil it a bit.\\n\\n\r\nYumeji is your average high school kid. Well, not completely average. He can read people’s dreams. He is not a super cool fighter or an extreme genius. OK, that’s good. He’s rather upbeat. That’s nice. One day, when his life is in danger while he’s trapped inside a ‘day dream’ (think of it as a battle arena in 3D fighting games), he meets this supernatural girl called Merry. She saves his life. Pretty soon, after some childish complications I will not go into, they become friends and try to get Merry back to the Dream-world.\\n\\n\r\nAh, the Dream-world. Well, that’s the place where Merry, along with many other characters, hail from. In Yumekui Merry, there is the Human-world and the Dream-world. Humans exist in the Human-world (obviously) and they can also visit the Dream-world when they go to sleep. Nightmares (Merry and the gang) live in the Dream-world. They can go to  the Human-world but, they need a host if they wish to remain there. Well, not wish. They can’t go back to the Dream-world once they cross over. And that’s the overall plot here: Merry somehow crossed over and she wants to go back. Can she? I don’t know. Even if I disregard spoiling Yumekui Merry, I still can’t tell you. This is because the show is incomplete. It needs another season or two which we will never get.\\n\\n\r\nNow let’s talk about Merry. She’s an amnesiac Nightmare. Talk about cliches. It’s a good thing I don’t mind cliches because I don’t believe in originality but that still doesn’t mean I’m not irked by this. After 13 episodes, I still don’t know just what KIND of Nightmare (plot-point) Merry is. In fact, she doesn’t even regain a single memory over the course of the show. I get it, season one. Incomplete story. Yadda-yadda-yadda. But, this is not how you make shows. Apparently, the fault lies with the director and the animation studio because the Yumekui Merry manga (ongoing) has gotten much better scores and reviews.\\n\\n\r\nAnd I hope that the manga is, indeed, better. This is because at this point of the review, I’m supposed to talk about the side-characters. But, I can’t do that as none of them were memorable. I’m not joking. I just watched this anime a few hours ago. The only somewhat memorable character is Yumeji’s blond school friend who plays no actual part in the plot. He spouts haikus and talks like a bishi (super handsome homo man). That’s it. What’s worse is that he became rather annoying to me in the latter half part of the anime. How low can this go?\\n\\n\r\nBut, HEY! The world presented is interesting enough for me to not drop Yumekui Merry. Merry and the other Nightmares kick some serious ass. The fight scenes are fluid and roughly animated but, that actually adds a neat flair to it. It’s kind of hard to describe. Merry wants to go back to the Dream-world. She kicks the asses of other Nightmares to send them back and free their hosts with Yumeji’s help. OK, I guess. This is how most of the fights go. There is an added tension in the last few battles due to a plot twist that what Merry is doing is actually very very wrong but that just makes the fights worse for me.\\n\\n\r\nThe plot-point of emotional death for hosts when a Nightmare is defeated had surprised me but, it was kind of in poor taste. It didn’t really any impact. After some initial concerns, Merry and Yumeji are left to just deal with it. “Oh, we believe what we’re doing is not bad at all. There’s no point in spending more time in looking for an alternative method”. Well, OK then.\\n\\n\r\nOutside of the fight scenes, the animation is pretty standard for it’s time. There’s nothing unique about it. It sometimes fluctuates in between scenes but I have no problem with that.\\n\\n\r\nVoice acting is pretty normal as well. Nothing to comment on there.\\n\\n\r\nNow, the music. I have to say that the background music is gorgeous. It reminds me of the old cartoons with their cheery orchestral music. So good. I’m already downloading the OST as I am writing this. I didn’t like the Opening song, though. Even the visuals of the Opening was bad – too damn dark and brown. What is this? Gears of War?! The Ending song is lovely.\\n\\n\r\nOverall, I have to say that Yumekui Merry is only an interesting show. It’s not good nor is it really bad. It could have been done so much better.\\n\\n\r\nIs it interesting enough for me to read the manga? Sadly, no. So I’m going to give it a 7 out of 10. It’s not a 6 because… dat suondtrak!\\n\\n\r\nShould you watch Yumekui Merry? Sure, if you’ve got the time.",
            "date": "2016-06-19T16:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 221219,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3356717.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReJaKted",
                "username": "ReJaKted"
            },
            "url": "https://myanimelist.net/reviews.php?id=221219"
        },
        {
            "content": "This anime has some great potensial, but it doesn't deliver. J.C. Staff has done a poor job on this anime.\r\nYou ask why, it's because after the third episode the anime doesn't seem as fun as it was the first 2 episode's and it takes some time before the action starts.\r\nBut something that's save's this anime from being a failure is the characters. The characters in this anime are outstanding. They are really well design and have great personality's. It wasn't one character I finded annoying, and you have to love all of them.\r\nIt's a decent anime, if you don't have anything other to watch thenthis should at least pass the time a little.",
            "date": "2011-05-06T07:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 36787,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441723.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Pera",
                "username": "Pera"
            },
            "url": "https://myanimelist.net/reviews.php?id=36787"
        },
        {
            "content": "13 episodes of this anime didn't give this anime justice. The story was pacing well until it gets to one of the middle episodes. It returns to regular pacing until towards the end. Everything is rushed and you weren't given enough time to process what was going on. They had trivial stuff in the anime that I felt were teasers, as if they were going to have a back story or explanation them, but none at all. The main character was also VERY stereotypical MC at the very end. The concept of this anime wasn't widened out enough for us to call it a great,but probably the manga has an answer for that. If this was a 24 episode series, then maybe the reception would've been a lot better.",
            "date": "2016-01-10T02:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 208194,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/janzim",
                "username": "janzim"
            },
            "url": "https://myanimelist.net/reviews.php?id=208194"
        },
        {
            "content": "The story drags itself. Characters that seem to be essential to the plot just disapear in the middle of the story, like Hunter John Doe and his cats and even the main vilain! The side stories of the suport characters are left mostly untouched and are boring. The main characters don't evolve, don't learn anything from previous encounters with other enemies, and at a certain point the heroin is able to performe a mysterious and awesome atack, only to have it never used or even mencioned again!\r\nAlso, the setting of a dream is poorly explored. The art of the characters are fine, but the backgroundis inexpressive. They could have made it awesome and beautiful, even surreal. Instead, the scenery is static, mostly unchangeable, like a fighting game background.",
            "date": "2012-09-29T05:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 73581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38079.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ruinadoboi",
                "username": "ruinadoboi"
            },
            "url": "https://myanimelist.net/reviews.php?id=73581"
        },
        {
            "content": "Yumekui Merry, this was one interesting anime. All about those dreams and a mission set forth by our protag. Basically setting up a 2 world system, the real one and the dream one. But let me break down the categories that I can set this anime in and telling you my side of things.\r\nAction. This is a action anime. There is some type of action conflict that arises in every single episode. The beginning was fairly good and tied in some of the major points of this anime together but you have to really focus a bit to understand what is going on for thefirst two episodes.\\n\\n\r\nSupernatural. Dream demons are the things in this anime that take hold of humans to make them their vessels. So needless to say, it is supernatural. I don't think I should go any further into it than that.\\n\\n\r\nOn a side note, some parts of the anime reminded of some romance but it is not the main focus so really should not pay much attention to it.\\n\\n\r\nOverall this anime is good but it is not great. I wish that they would not rush things too hastily but I feel like they did a bit but I think the overall score of this anime is good. I wouldn't recommend this anime to anyone who is just starting to get into anime for it might be hard to follow sometimes and this is not the greatest anime out there. For those who like action and supernatural, this is up your alley. You will enjoy this anime but not really love it. If you have time, watch this anime, but if you have other priorities like some other anime, then go watch those.\\n\\n\r\nSorry, no witty comments in this review. See you next time.",
            "date": "2011-04-28T20:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 36555,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/434514.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LoneAngel",
                "username": "LoneAngel"
            },
            "url": "https://myanimelist.net/reviews.php?id=36555"
        },
        {
            "content": "Story: The concept of dream and dream demons was very interesting. I liked the idea and adding a cute heroine definitely made things better. However, it just didn't deliver as well as I would have liked. They had a good thing going but the ending felt so complete. They added all these undeveloped bits that I wonder why they added them in the first. What was the point of mentioning the romance or introducing certain ideas if they won't be carried out? The ending was mediocre at best leaving many unanswered questions. It had good ideas and theme along with some cuteness and humour butthat wasn't enough. The series is short and is easy to go through so it didn't feel like a complete waste of time. However, it was definitely disappointing.\\n\\n\r\nAnimation: It was alright. The character designs were all pretty and attractive; however, Merry was the only memorable one. The real world was nicely animated but the dream world fell short to me. The dream world were lackluster and bland when it could have been much more. The action scenes were disappointing as they were very choppy. However, for the most part, the animation was pretty and they gave enough fan service without being ecchi or overdoing it.\\n\\n\r\nSound: I really liked the opening. I actually liked the opening more than the series itself. However, the rest of the music was subpar. The soundtrack varied from generic gamer music to woodwinds. Although it wasn't bad, it was strange. The ending was ok and catchy but generic. I probably won't remember it in a while. The seiyuus did a good job though,\\n\\n\r\nCharacters: Good ideas without enough to flesh them out. Like the plot, they started out well but didn't have adequete development or background. There were parts of them that were introduced but were never fully explained. However, for the most part, they were cute and likable.\\n\\n\r\nOverall: Good idea but disappointing. It will start out fun but leaving you unsatisfied....",
            "date": "2012-11-18T07:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 77813,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=77813"
        },
        {
            "content": "The initial idea that is introduced to you in the first episode is amazing. The magic of a world of dreams and creatures that hope to have a place in reality is quite intriguing and interesting. A Main character that's stuck in the real world without knowing why nor remembering how she got there in the first place gives you something to look after during the development of the series. And the needed male main character with unusual powers for a human (btw, he reminded me AWFULLY a lot of Yuuji from Shakugan no Shana). A very interesting idea, so I was happy with howit started.\\n\\n\r\nBut then, I found myself utterly disappointed. The plot just... shattered down. Nothing made sense anymore, and the characters introduced later were lame and unneeded. I have to admit I was excited by Kawanami, but only because of my fangirling about a possible Yuri development with Isami... so it doesn't really count. But what was her purpose, really? Just so they could introduce a mildly cool Dream Demon?\\n\\n\r\nMistletine. I loved her when she first appeared. The usually cruel and merciless villian, which is also a lolita. I always love that kind of characters. But... seriously? What the hell happened in the 12th episode? So Imma jump here, dodge there, evil laugh here, evil joke there, then I'm gone... EVEN THOUGH I'M KICKING THE GOOD GUY'S ASSES. No, I'm gone, bai bai. I can't finish these guys up since it's not the final episode (as one of the reviewers said already). It's the worse episode ever. Or so I thought, until I watched the final episode.\\n\\n\r\nWorst. Ending. Ever.\\n\\n\r\nThe battle sequence during the episode was lame and boring. How she was killed was boring. The Power of the Dream is the Power of the Will... seriously? Seriously? (or something like that) They could've done a lot more with that battle. How come Merry vs Play was more interesting than the final battle? And once everything is over... what happened to the teacher? And what happened to the Ercles (Hercules?) Pharos? I was hoping they were going to fight against him, or is there a second season? Because that would be the ONLY explanation to have such a bad ending for an anime, though that's not a valid excuse anyway.\\n\\n\r\nAlso, where the hell did John Doe went? He was, by far, the coolest Dream Demon in the whole series. They had so many elements to work with and made an amazing anime, and yet they just delivered a half-hearted effort of an anime.\\n\\n\r\nAside from the Poor plot and mediocre character development, everything else was okay. The art was fantastic, wasn't expecting less from JCStaff since I'm a huge fan of them (Shana, Kaichou wa maid-sama, Ookami-san, Zakuro, Railgun, Majutsu no Index, etc), though it dropped a bit when the plot started being nonexistent, but still it was great.\\n\\n\r\nAnd on a final note. WTF Yui? Air Trombone? Wuuuut?",
            "date": "2011-07-31T22:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 40511,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152576.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/r0z3n",
                "username": "r0z3n"
            },
            "url": "https://myanimelist.net/reviews.php?id=40511"
        },
        {
            "content": "I was inspired to write this review by bad press this show is getting on the web.  Well, okay, more like random idiots badmouthing it.  That’s how the Internet is.  Anyway, I don’t think this show is as bad as some have made it out to be.  In fact, I would even go as far as calling it good. \r\nThe strength of Yumekui Merry is in creating mood.  In particular all the freaky dream sequences, which are helped in no small part by the music.  The characters are intricate and their interactions maintain sufficient complexity for an enjoyable watch(assuming you like your villains so thoroughly despicable). \\n\\n\r\nUnfortunately, complexity is also the show’s weakness.  It never really decides what it wants to be.  Throughout its run, the show attempts to weave together so many diverse elements that, instead of a tapestry, it winds up with a tangled mess of yarn that may leave you vaguely hoping for a second season to tie up some of the loose ends.",
            "date": "2013-05-16T19:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 97399,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=97399"
        },
        {
            "content": "I had randomly found this show and decided why not. I ended up finishing it one night. It had a great story, great charecters, and looked amazing. I enjoyed it until the last episode where at it just ends. I was not to happy. I found the manga and the two are not the same. the anime varies from the manga. In all truth the manga was way better.",
            "date": "2013-04-30T07:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 95445,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/emachinew",
                "username": "emachinew"
            },
            "url": "https://myanimelist.net/reviews.php?id=95445"
        },
        {
            "content": "Yumekui Merry had introduced an amazing concept,the idea of beings that inhabit the dreams of others and a world of dreams. The anime had great music as well as great animation. in the story department , however, the anime was lacking a lot. The fight scenes were decent when they could have been phenomenal and the story was okay when it should have been great. if you are into anime and are looking for something new that looks good and has an ok story than u should watch this. However, if you are like me and are not just looking for an anime but forsomething with a great story as well then u should give up on the anime and read the manga instead, its much better.",
            "date": "2011-04-11T18:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 35941,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/305888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animescavenger",
                "username": "animescavenger"
            },
            "url": "https://myanimelist.net/reviews.php?id=35941"
        },
        {
            "content": "In a way, it sort of hurts to give this just a 6. The concept seemed really good, and there was a lot of potential to develop the characters, the story, and anything else. I guess it's a pitfall of manga conversions, but I haven't been this disappointed since Pandora Hearts at the lack of closure. The anime ends in the wrong place, with closure of one plot point, but no closure to the biggest questions, leaving it essentially unfinished.\r\nBy the 13th episode the characters had hardly left the molds of their stereotypes, and that was another big strike against. It seemed there was alot happening \"off camera\" between some characters, while others basically dropped out, and the main characters said pretty much the lines I imagined would be the defaults if this anime was made with a drag-and-drop tool.\\n\\n\r\nI do give it high marks for the art and sound quality, though, but there are plenty of good-looking, good-sounding shows out there that are at the least complete.",
            "date": "2012-02-22T22:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 54547,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mindlink",
                "username": "mindlink"
            },
            "url": "https://myanimelist.net/reviews.php?id=54547"
        },
        {
            "content": "Full of unique characters, Yumekui Merry has everything to get a second season soon enought. I stumbled upon this one because of Merry and could create some expectations when I first read the name. Saving dreams and destroying nightmares? Seems amazing, right? It indeed is, but a little more develpoment was missing on this one...\r\n{STORY - 6/10}\r\nDespite John Doe stealing the spotlight during first episodes, he somehow wasn't a big matter on the rest of the story. Yumeji is able to \"detect\" what John said to be \"vessels\", humans that share their bodies with mumas (\"dream demons\"), enabling them to vome to our world. Meetingwith Merry was the first of his problems, since he was dragged to all this dream trouble thanks to her.\\n\\n\r\nBoth Yumeji and Merry are special: he's able to access other people's dreams freely and she doesn't need a vessel to leave the Dream World. Main objetive they both have now is to stop Pharos Hercules, a powerful muma able to lead the others, like a guiding light. He has a brief appearance, like John. Maybe both will be more present on a possible second season...\\n\\n\r\nAnd we have that small cliche of taking over the world and everything. Pharos wants to replace all humanking by mumas, destroying everyone's dreams and hopes. Only thing that makes it different is that most mumas are interested on the real world. They want to see people's dreams and protect them from those trying to destroy them...\\n\\n\r\n{ART - 5/10}\\n\\n\r\nSince this anime features a good share of action scenes, it's expected to have really thrilling moments, but movements were poorly developed on most occasions. I wasn't able to feel the adrelanine... However, scenarios were very well designed, with a realistic effect that made them so original.\\n\\n\r\n{SOUND - 7/10}\\n\\n\r\nRetro-like background sounds are played oftenly, mostly on daydream scenes. Still, I felt a lack of effects on battle scenes and that was a little lame. Other than that, a really nice eletro song was featured on ED themes!\\n\\n\r\n{CHARACTER - 6/10}\\n\\n\r\nMany different mumas are featured in here, with unique personalities and shared interests. The weakest ones, like Pallette just want to know about humans' dreams, while stronger mumas, like Engi and Leon, want particular kinds of revenge. While Engi is a good muma, that tries to protect humans, Leon remains neutral, in order to accomplish his side objective. Evil ones, like Pharos and Mistletainn don't care about their actions and have separate ambitions.\\n\\n\r\nAs for the other characters, Yumeji is overally weak, but is strong-willed and believes that every muma in here is able to return to the Dream World. Merry is a girl who doesn't recall about her past and want answers from other mumas. That's why she needs to leave the real world, despite no knowing how to do it.\\n\\n\r\n{ENJOYMENT - 7/10}\\n\\n\r\nIt was a good anime, but I didn't fell amazed, unlike others I've watched before. The plot is really good, but it lacks emotion. Still, it was really enjoyable. However, I was a little disappointed with the ending... Could be better...\\n\\n\r\n{OVERALL - 6/10}\\n\\n\r\nDreams shown in here are something everone holds onto. They are hopes, a reason to live so, without them, we're nothing, we have no ambitions. That's where Yumekui Merry makes her entrance, to \"eat\" all bad dreams and stop mumas with evil intentions. A hero with the sole objective of knowing who she is, now with a mission: to keep people dreaming and hoping. Future depends on our dreams, abstract things that give us strenght to move foward and be happy within ourselves.",
            "date": "2013-11-07T06:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 119553,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=119553"
        },
        {
            "content": "It was an anime that got me really pumped up at first. The first few episodes are quite decent and somehow seem to suck you in. Despite this i would not recommend watching this anime unless you really have nothing else to watch. \r\nThe main reason, actually the only reason i say this is because of the horrible ending to the series. \r\nThe ending was a let down of let downs, it was literally as if the directed just added it to answer all the missing questions, nothing else at all, it was SHIT. \r\nIf you want to know the story then i recommend theManga, it is more diverse. Despite the fact that its not much better, it is better. \\n\r\nNow this is my own PERSONAL review so if you must then eat ur",
            "date": "2012-02-27T06:03:00+00:00",
            "helpful_count": 0,
            "mal_id": 54883,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1148621.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KoreanAnimeLover",
                "username": "KoreanAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=54883"
        }
    ]
]