[
    [
        {
            "content": "Creativity, a simple word that inspires so much innovative ideas from anyone, anywhere, anytime. What inspires creativity varies but for a young boy named Toshinari Seki, he takes it to astronomical levels that goes far beyond what you may be used to seeing at school. As a master of killing time, Seki lives up his reputation of such a title. For a  7-minute anime series, there’s so much attention Seki can attract towards its audience.\r\nWhen it comes to killing time, you would do something inventive, something creative, or anything that will prevent you from saying along the lines of ‘it’s so boring, there’s nothingto do’. For Seki, there’s a chance for that in his class every single day because he sits in the very back corner. As a kid of his age, Seki can be described as a simple yet curious character. He isn’t very interested in his studies by the way he behaves in class. Looking it from an intrinsic perspective, Seki is an average boy with nothing that stands out with his character or personality. Rather, he prefers to be alone by his activities. Of course, that’s perfectly normal because kids his age are growing up and build their characters. Seki is also more of the shy boy with his lack of dialogues. More often or not, he communicates using body language (gestures, signals, etc) that somehow makes its point. Rather than being intellectual, this series takes Seki and presents him as a bizarre yet likable character with his actions.\\n\\n\r\nThen, we have Rumi Yokoi, the not-so-fortunate girl sitting next to Seki. Similar to Seki, she is the typical average girl without the glorifying looks or an abnormal personality. Yet, she is similar in some ways to Seki as characterized by her curiosity. Despite trying to ignore Seki’s actions in class, she often finds herself unable to but instead entranced by his activities. It’s humorous in many ways because almost everything that Seki does tends to draw her attention. At the same time, Yokoi often gets into trouble by the teacher and mistakenly being labeled as a troublemaker. For Yokoi, it becomes a chore for her every class period to deal with Seki. On some instances, she seems to tolerate or even embrace Seki’s culture. Other times, she overestimates Seki’s intentions that results into a scolding by the adults. There’s a lot of anxiety each episode seeing Yokoi and her reactions towards how she perceives Seki in class. Furthermore, it’s surprisingly noticeable to see her character develop. This is evidenced as Yokoi seemingly grows stronger with every class period or episode. She is able to resist some her curiosity or even close to stopping Seki from goofing off in class. Unfortunately, she never seems to reach home base with her goals because time is simply not her side.\\n\\n\r\nThe series adapts itself in an episodic format. Given its average 7-8 minute standard, viewers should not expect an engaging linear story saturated with complexity. Instead, do expect a slice of life story featuring Seki as he kills time in his boring class. What you might not expect is the activities he does in class when the teacher is not looking. Some of them might seem typical while others are not. Examples including bring live animals, performing experiments, and in general any activities that would earn you a trip to the principal’s office if caught. The humorous part is that Seki NEVER gets caught. Throughout the series, it is Yokoi that becomes the collateral damage because of Seki’s innovations. Not only that but no one believes a word she says. It aims at the purpose to appeal to the audience that the adults of this show are useless and self-insufficient. If every student could get away with Seki’s behavior, then nothing would ever be learned. But as an experimental show, Seki’s activities encourages creativity and even inspiration. It’s clear that the boy is intelligent because some of the games he engages in are fundamentally impossible, at least in realistic levels such as mixing chess and shogi on the same board. For Yokoi, she often formulates imaginations and delusions at her own discretions from the way Seki kills time.\\n\\n\r\nAs a show of weird quirks, there are occasionally some characters that comes into the scenes to bring a little normalcy. I don’t classify them as supporting characters since most of them tend to enter and exit after the period/episode is over. Yet, there is one other character that is worth noting. Her name is Goto and like most girls her age is interested in relationships rather than her education. Make no mistake, her delusions can be as zany as Yokoi in class. Rather than being curious at Seki’s ingenious games, she is more interested in their “relationship”. This is in quotation marks because Seki and Yokoi are not dating. Yet, there are people that thinks they are dating for bizarre reasons. Further evidenced are some hints that Yokoi might see Seki as more than just a classmate. However, the show focuses more on its comedy and less so on a Romeo & Juliet story.\\n\\n\r\nOf all the silliness that the show brings in, it’s all presented as simplistic. It’s not realistic with some of Yokoi’s games that seems unconventional. Yet, they are practical and influences Yokoi’s school life at various levels. The story itself is rather too simple and may seems repetitive. Yokoi getting accused of being a troublemaker in class can also seem bizarre considering girls are often the ones that are more peaceful. Not only that but she doesn’t understand Seki’s purpose which is also a bit of an overstatement. We might never understand Seki’s purpose beyond the simple idea of ‘killing time’. The lack of character backgrounds such as their childhoods being explored also becomes a drawback. Finally, the humor of this show might not appeal to everyone. In essence, it’s a comedy show that inspires laughter but not everyone may get used to Seki’s quirky activities in class.\\n\\n\r\nBoth artwork and soundtrack are consistent with this short series. In essence, they are simple and down to earth. The classroom backgrounds is straight point forward with nothing particular that stands out. It’s probably best to just call it ‘just there’ because Seki’s activities are what draws in the audience and his classmate. The character designs also seems normal except maybe some slightly physical aspects for Yokoi. In retrospect, we don’t see a girl with white hair often in class that goes unnoticed. On the other hand, the soundtrack is very noticeable for both its OP and ED songs with slightly edited changes throughout the show. Instrumentally, it has a melodious tone with comical backgrounds. We see both main characters in the songs as they demonstrate degrees of humor. The ED song features Seki playing an instrument to create the style that Tonari-Seki Kun accomplishes – innovational humor. Kana Hanazawa plays the role of Yokoi with her nervous yet curious voice mannerisms. It matches well since she is specialized in voicing girls of shy characters. On the other hand, Seki’s voice is hardly ever heard throughout the series. His body language does the talking.\\n\\n\r\n7 minutes. That’s all it takes to draw in as much as attention for Seki towards an audience. There’s no need for a deep engaging story because shows like this should be presented with simplicity. While the activities that Seki performs can be complex, it’s easy to see what the show tries to accomplish. And that goal was achieved by bringing in humor in a different way that what you may be used to. No absurd fan service. No shock values. No crude humor. Rather, it’s a show that breaks down the barriers of a normal school life. Now, that’s a certain kind of fun.\\n",
            "date": "2014-05-25T15:17:00+00:00",
            "helpful_count": 136,
            "mal_id": 144503,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=144503"
        },
        {
            "content": "Remember this show? Two months have passed since the short series ended which was bittersweet after it became something I really looked forward to weekly. Its premiere from early Winter Season was overshadowed by numerous series such as the highly anticipated Space Dandy, the popular Noragami along with the romantic comedy in Nisekoi. But one of the highlights as an avid fan of anime is discovering a series that looks nothing but ordinary at first glance but later discover it's something truly remarkable and worthwhile. After the end of each episode, there are three words that always come to mind - Originality, Creativity and Fun.\r\nAdaptedfrom Takuma Morishige's Manga in episodic format, Tonari no Seki-kun is a 7-minute-episode short series that follows two school students who are responsible for creating some of the most memorable and hilarious moments this year. It all begins with Rumi Yokoi who strives to be a model student. Unfortunately for her, she sits right next to Toshinari Seki, who likes to play with toys, stationery and games on his desk rather than focus in the classroom with his studies. Seki's activities almost always result in distracting Yokoi and pull her focus away from her studies which normally ends with her getting into trouble with the Teacher. This is basically the premise of the show but what makes it so good is turning the mundane into the evocative.\\n\\n\r\nEven though Tonari no Seki-kun is episodic structured, there is actually a progressive continuity and even some form of a narrative here. It's scattered throughout the series and relies on calling back to events from prior episodes like the \"Shougi games\" based episodes and most notably, the episodes that focus on Seki's family of \"Transformer toys\". There is even a loose plot involving the rumour that Yokoi and Seki love each other carried on through the eyes of their classmate Sakurako Goto. Coming back to these events only adds to the fun experience you had previously, making them a lot more memorable.\\n\\n\r\nSeki is just like any ordinary person, he doesn't stand out much and keeps to himself, people really don't notice him. Because of this, Seki is able to get away with killing time in the classroom with his usual antics. An advantage he has to avoid being noticed by the teacher is that he sits right at the back of the classroom in the very far corner. Seki is able to turn the mundane into something very entertaining and funny. I'm talking about things such as making a flipbook, polishing a desk, wearing glasses, running a postal service, and even taking a driving license test. Seki's creativity knows no limits, it is sheer brilliance. Even though it is shown that he easily gets off-task and doesn't take his studies seriously, through these activities we can easily see that he is a very smart person.\\n\\n\r\nA large portion of the comedy comes from Yokoi's own imagination going into overload whenever she gets absorbed into Seki's antics. Such as picturing epic battles and romantic dramas between fully clad samurai when all Seki was doing was playing with Shogi pieces or imagining a miniature teddy bear making a tense climb up a mountain when Seki was really just making it climb up the back of the person in front of him. Yokoi actually likes being a part of Seki's shenanigans.  She's hooked on the buzz, an adrenaline addict, and Seki is her fix. If you don't get that, you don't get Tonari no Seki-kun—and then it's just a mildly amusing face about a middle-schooler screwing around at his desk.\\n\\n\r\nThe visuals and animation are clean, fluid and consistent. There are zero drips and drops with the quality. The character designs are rather basic, but something refreshing is definitely Yokoi's design. White hair is not something you see very often for a female character and another point is how well they adapted the facial expressions for the characters reactions to certain scenarios. Just the way they are drawn is quite comical. In the sound department, the score soars! Both the Opening and Ending are quite clever, the Opening displays what the series is all about. It shows Seki getting up to his usual antics and Yokoi reacting to them along with an upbeat and catchy tune. The Ending just adds another touch to the creativity side of things and it very well may be one of the most creative ones around, the song is called, \"Set them free\" by Akira Jimbo. A lot of praise must go to Yokoi's voice actress and she almost carries the show alone, brought to you from the very popular Kana Hanazawa who nails the character perfectly, she easily goes through a wide variety of emotions and makes the reactions of Yokoi's character priceless.\\n\\n\r\nTonari no Seki-kun—Master of Short Series Format! This could very much be true. It's able to utilize every second of the 7 minutes effectively and is consistent. The formula Shin-Ei Animation has for this show has resulted in creating one of the few series where there isn't really negatives or a bad episode. Sure, there are some episodes that are more enjoyable than others but with the consistency and creativity each episode holds along with the good pacing, allows the viewer to enjoy each one just as much. There's some incredibly incisive observational comedy about the differences between boys and girls, and the relationship between Seki and Yokoi specifically is layered, fascinating and hilarious. \\n\\n\r\nI could go as far to call this show flawless, it doesn't do anything wrong and achieves everything it set out to do and be perfect. With that said, it makes this show easily recommendable and I do believe it can also be a recommendation as a good gateway series to anime simply because it's hilarious, entertaining and a lot of fun for all audiences.  It may be short, but Tonari no Seki-kun definitely punches above its weight class.\\n\\n\\n\\n",
            "date": "2014-07-29T19:36:00+00:00",
            "helpful_count": 55,
            "mal_id": 154351,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=154351"
        },
        {
            "content": "WARNING: Avoid drinking anything while watching. This show is not liable for any snorting of said drink. Side effects may include stomach aches from giggle-fits and shortness of breath...\r\nStory: 8/10 There is a special charm that only short anime possess, such as Hetalia, Chi's Sweet Home and Miss Monochrome. Among these easy-to-watch shows is Tonari no Seki-kun, whose episodes are a mere 7 minutes in length. Each segment is episodic without much of an overlying plot, although there are recurring themes. A creative boy named Seki-kun brings in nick-nacks to class and messes around with them rather than pay attention. Yokoi-san, the girl who sitsnext to him, reluctantly gets drawn into his activities. Her inner monologue of observations explain his schemes and give significance to small changes. Sitting at the very back of the classroom, the other students and teachers take no notice of whatever dramatic occurrence is taking place; when they do, it usually takes form in some misunderstanding. Much to her chagrin, Seki-kun never gets caught, while Yokoi manages to get in trouble instead. The fact that the two take each situation so seriously only amps up the amusement.\\n\\n\r\nArt: 7/10 There is nothing very special about the animation, except for when it focuses on the games. The art does justice to Seki-kun's elaborate hobbies. The colors are light and happy, and the expressions of the characters take form in comedic ways. The only noteworthy character design is Yokoi, who sports white hair and a candy-colored girl's school uniform. The more detailed manga panels translate cleanly in the adaption. Overall, the simple style works wonders for the anime's simple premise.\\n\\n\r\nSound: 9/10 The opening is sung by the voice actor of Yokoi, and it's basically her general reactions to Seki-kun's antics. The frantic stream of thought within each verse is sung in one breath, and the fast paced vocals are complimented by lighthearted music. I have never once thought of skipping it. The ending is also addictive, with Seki-kun drumming on his pencil cases and school supplies.\\n\\n\r\nSeki-kun never speaks, so you won't hear much of the seiyuu except for occasional grunts or laughter. Yokoi, on the other hand, is the prominent narrator. Kana Hanazawa does a wonderful job portraying Yokoi, but I did find her voice to be slightly annoying. It's a teeny-tiny mar to the overall execution.\\n\\n\r\nCharacter: 9/10 You really wonder why a genius like Seki-kun doesn't put his talents and energy into other skills rather than waste time. The audience quickly sympathizes with Yokoi's plight, but like her, are drawn into every game. As the series progresses, we see that Yokoi starts to become more and more involved with Seki-kun's various distractions. This however would be the extent of any character development. I fell in love with this adorable duo almost instantly and I'd like the anime to speak for itself. Supporting characters have a tiny role, but they are amusing additions to the plot nonetheless.\\n\\n\r\nEnjoyment: 10/10 This could potentially be the best comedy of the season, no joke. I'm really grateful to my little brother who introduced me to Tonari no Seki-kun. I'd definitely use some of the nifty ideas to pass time myself if I didn't get caught. Anyone who can pull off the antics should have the right to wear a T-shirt that says \"Seki-kun like a boss.\" The style of humor is somewhat similar to that found in Azumanga Daioh or Lucky Star. I swear, it'll brighten up your entire day =D\\n\\n\r\nOverall: 9/10 Oh gosh, I've started rambling. Anyway - I totally recommend this (especially to younger demographics and people who haven't seen anime before) if your looking for something family-friendly. It's an automatic favorite. Thank you for reading this review and happy laughing.",
            "date": "2014-07-06T12:27:00+00:00",
            "helpful_count": 48,
            "mal_id": 150709,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/873889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aeowina",
                "username": "Aeowina"
            },
            "url": "https://myanimelist.net/reviews.php?id=150709"
        },
        {
            "content": "The amount of joy that you can get out of a pleasantly mellow 7 minute slice-of-life is incredible.\r\nStory - Is so simple it hurts. How do you make a 7 minute anime about a school slice-of-life so good?  Yokoi is a girl that slightly stands out from the rest of her class. She always wants to study hard and do her best every day. The boy who sits next to her creates new ways to kill time which distracts her to her utmost limits.\r\nArt - The art isn't anything to write home about. It's average at best. Maybe that works incredible well for thisanime though. Nothing stands out, but everything is drawn really well. Not to mention the craziness they incorporate in Seki's every day antics makes it worth more on the scale.\\n\\n\r\nSound - The opening isn't to bad. The ending theme is where it's at though. It's unique and the drumming on the metal instruments on Seki's desk and Yokoi getting into his beat and feeling embarrassed about it. I'd also like to point out Seki having no Seiyuu.\\n\\n\r\nCharacter - The development for the character is lacking. But, they make up for this in developing the characters in 7 minutes every episode to show what this anime is truly about. Seki has no Seiyuu. He portrays his feelings through emotions that are pretty easy to read. Yokoi on the other hand is a normal girl who gets distracted at every turn with Seki. She has a cute voice and can be a bit Yandere when Seki starts ruining the imagination that plays out in her head with his certain shenanigans. \\n\\n\r\nEnjoyment - Incredible. I enjoy start to finish of this 7 minute an episode anime. It's just long enough and keeps me laughing through out. I'd highly recommend it for anyone relaxing and looking for a laugh.",
            "date": "2014-03-25T05:10:00+00:00",
            "helpful_count": 37,
            "mal_id": 136899,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=136899"
        },
        {
            "content": "Each short episode of Tonari no Seki-kun is built on a similar foundation: Seki plays some comically elaborate game in the middle of class, and Yokoi, his more studious neighboring classmate, invariably gets sucked into what he's doing, to the point where she often becomes even more invested in it than him. That’s it. This seems like a fairly limited premise, but it provides a great framework with a surprising amount of comedic range for Seki to play in. The results are almost always a blast.\r\nThe games Seki plays each episode range from staging complex, twist-laden wars with unconventional shogi play to bringing an actualbag full of cats into class. There are episodes where he’s seen building crazy Rube Goldberg machines right in the middle a lecture. He never really speaks outside of determined grunts and the like, but there’s a ton of expression put into the way he reacts to the various scenarios he concocts. There’s a sadistic edge to how he goes about his games and the way he crafts his fiction that makes him a great foil for Yokoi to play off of. \\n\\n\r\nYokoi's reactions to these scenarios are diverse and keep her from becoming a stock overreaction character. More of a protagonist than Seki is, the episodes are generally filled with her internal narrations. She’s sometimes quite taken by Seki's more sensitive side, only to be crushed when he reverts to his usual, harsher self. Other times the plots of Seki's games become so grim that she finds herself becoming engaged in them, in an attempt to steer them towards happier directions. There’s a running gag involving a robot family that Seki often brings to class, for example, that he often puts in dangerous situations or will just mistreat in general. Yokoi gets really attached to Seki’s narrative for this family and will put herself at risk of being caught by the teacher just to help sway their fate in the direction she wants. Of course Seki doesn’t just take this lying down and it becomes a fun battle for the outcome of these toy robots. And this is all while she’s trying her best to study! It’s a lot of fun seeing the creative ways she gets whisked away from this each episode. They play off each other really well and make for a great comedic duo. Also Yokoi is like totes adorbs.\\n\\n\r\nPresentation works wonders in capturing the comedic idiosyncrasies of the scenarios. The dramatic score and aggrandizing theatrics elevate these silly games to the status of tense, mortal conflicts. Effortlessly pulling the audience into the characters' skewed sense of priority; the result is entertaining at every turn. Kana Hanazawa puts in a great performance as Yokoi, capturing the huge swings in emotion that Seki puts her through wonderfully. Fans of silly faces will find a lot to like here as well, as the show has a huge array of them that it uses really well to heighten the comedy. There are many places in the show where the creators went above and beyond, like giving the robot family their own theme song in the style of old mecha anime, or depicting shogi games as actual wars, acting out Seki’s stories. Even the OP and ED play out like skits from the show. The OP in particular is a clever meta piece about Seki actually animating Tonari no Seki-kun in class. A lot of subtle ingenuity went into making this simple premise a lot more than it seems.\\n\\n\r\nIf there’s anything to complain about in this show, it’s that the show does have some rare instances where the punchlines can start to feel a bit samey. There are some recurring skits and although they still remain endearing, the edge of their punchlines are dulled on each successive rehash. It’s nothing too bad though and the short run time of the episodes makes these skits more of a fleeting occurrence before you’re back to something new again, but several of them did start to lose a bit of their luster for me by the end. They might even give the series a nice sense of continuity for some though, so your mileage may vary.\\n\\n\r\nMinor quibbles aside, this is an incredibly solid comedy. Seki and Yokoi have a great dynamic together and the show by and large does a superb job giving them varied situations to bring out the most in their personalities. Coupled with the grand presentation of it all, it’s easy to be whisked away into Seki’s antics just as Yokoi is. I doubt many will regret their time playing with Seki, especially without the risk of being caught by the teacher.",
            "date": "2014-12-05T18:23:00+00:00",
            "helpful_count": 25,
            "mal_id": 171141,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NotDolphy",
                "username": "NotDolphy"
            },
            "url": "https://myanimelist.net/reviews.php?id=171141"
        },
        {
            "content": "Tonari no Seki-Kun is a simple show with simple stories. That's one of the things I really like about it, because it's easy to digest. The short length works great, and no single episode feels like it's overstaying it's welcome.\r\nHowever, the whole thing also feels pretty formulaic, which eventually started to wear on me. Even only watching at a relatively average pace (at one episode every morning), I began to get bored of it about halfway through. Some episodes were pretty funny, but I can't recall many times the show actually made me laugh out loud. A few episodes also recycled ideas from earlier episodes,and just put a slight twist on them, which I thought seemed kind of lazy from a writing perspective.\\n\\n\r\nThe art is pretty standard, and definitely common to what we normally see in the genre. It's well done, but it's nothing too impressive. I do think the character design is slightly better than what we typically see with this kind of art style, though.\\n\\n\r\nThe voice acting is pretty standard as well, but it's well done for what it is. All of the actors represent their characters well, but again, nothing too remarkable here. I think where the show's audio really shines is with the opening and ending themes. They are super fun, catchy, and they fit perfectly with the setting of the show.\\n\\n\r\nThe characters also go along with that sense of fun. The main characters Yokoi & Seki-kun are somewhat interesting. Seki-kun is a pretty standard looking character, visually, but they do enough to make him unique. They never have him say any words, just grunts and groans, however I like this because it lets his personality be shown entirely through his actions. Yokoi, on the other hand describes what Seki-Kun is doing, essentially narrating things for us. She has an excitable personality, and really pulls a lot of the fun of the show together. There are a few other supporting characters, which feel very generic, but fill a gap well enough, and flesh out the cast just a tiny bit.\\n\\n\r\nOverall, Tonari no Seki-Kun is a somewhat average, but enjoyable show. What it ends up being isn't anything special, but it also doesn't really try to be. This is both good and bad, as it's a good quick bit of fun, but over the course of watching it, I slowly began to lose interest. The writing is good, but perhaps a bit weak, however, the characters tend to make up for that somewhat, with their somewhat unique identities. I'd recommend it to anybody who enjoys the comedy genre and isn't expecting anything all that incredible... but just looking for a fun, simple show.",
            "date": "2014-06-12T11:59:00+00:00",
            "helpful_count": 16,
            "mal_id": 146787,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648219.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/vigorousjammer",
                "username": "vigorousjammer"
            },
            "url": "https://myanimelist.net/reviews.php?id=146787"
        },
        {
            "content": "Tonari no Seki-kun is an adaptation of a manga with the same name.  I have been reading this for awhile, I have already caught up with the manga already.  This anime is very creative and fun anime.  This anime is a 7-min and 21 episodes anime, the OVA and special will be releasing soon.\r\nStory: 8\r\nTonari no Seki-kun is an anime revolves around Rumi Yokoi and her reaction and narration toward the person she sit next to Toshinari Seki or Seki-kun and his antics.  His antics consists on something new every time, and it distracted Rumi from her note taking and sometimesshe got in trouble because of his antics, and Seki-kun never gets in trouble.  He hasn't been caught because both of them sit in way back, Seki-kun sit by the back corner by the window, and Rumi sit next to him.  IDK how he have been caught it called anime logic's.\\n\\n\r\nArt: 8\\n\r\nThe art is not perfect Kyoto Animation.  But from manga to anime, it near perfect the manga and anime have similar art to it and I give a hand to the producer for that.  The art for Seki-Kun activities pretty good, expectually the art book one.\\n\\n\r\nSound: 9\\n\r\nThe main girl Rumi Yokoi voice actor sings the opening of the anime.  She basically sing about her reaction toward Seki-kun antics.  The opening is pretty good, and the voice actor for Rumi is good but Seki-kun didn't say anything...at...all, but he never say anything in the manga as well. The ending have a drum theme to it, impressive but it didn't get my attention unlike the opening.\\n\\n\r\nCharacter: 10\\n\r\nThere are two main character of the anime, Rumi Yokoi and Toshinari Seki.  I like both of the main character and there designed, I got no beef with the character.  They are fun to watch and I have no complaint about the minor character as well.\\n\\n\r\nEnjoyment: 10\\n\r\nI enjoy this anime, I watch it every time when it came out to kill time because I have read the manga and know what going to happen next.  But that don't take away the enjoyment I receive from this anime.\\n\\n\r\nOverall: 9\\n\r\nThe anime is good time to watch, it's only 7-min long and 21 episode plus the OVA and Special is coming out soon and I can't wait for that.",
            "date": "2014-05-29T11:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 144983,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3375025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmazingDaOne",
                "username": "AmazingDaOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=144983"
        },
        {
            "content": "Tonari no Seki-kun: The master of killing time is a charming collection of 7 minute comedy episodes revolving around, as the title suggests, Seki-kun and the mischief he gets up to in the attempt to kill time.  \r\nRather than the story following Seki-kun, it is instead told through the eyes of his classmate Rumi Yokoi who sits next to him in class and this greatly works to the shows benefit. A large portion of the humour of this show comes from Rumi’s interpretation of what Seki-kun is doing rather than what his own thought process is. The ‘Shogi’ episodes in the series highlight thisperfectly as Rumi creates her own story around the way Seki chooses to play the game and she subsequently tries to intervene with the game in order to ‘save’ the characters she made up. To this extent Tonari no Seki-kun is able to do a lot with short episodes and limited dialogue and I find the simplistic yet well implemented animation gives both Rumi Yokoi and Seki-kun fantastic personality without really having an overarching storyline or conclusion. \\n\\n\r\nInitially Rumi and Seki-kun seem like polar opposites, with Rumi wanting to focus on her studies but Seki-kun more interested in passing the time. As the show goes on and Seki-kuns antics are explored further you find that they are not so different after all and many things she accuses him of are things she is guilty of as well, which is subtly conveyed to the viewer not only in the episode but also in its wonderful OP/ED which perfectly epitomises the relationship between the two characters. Both the opening and the ending themes are super catchy and had me watching them each episode even though I had the option to skip. I seriously suggest you watch them if you are unsure about this show as they will give you a decent idea of what to expect from it. \\n\\n\r\nThe musical score in episode is not really memorable but it was used when appropriate and to good effect, so it certainly does not outstay its welcome nor will it make your viewing experience worse. One thing that is of note however is that many of the concepts introduced by the show such as the Shogi games or ‘Robot Family’ gets reused multiple times. With such short episodes and the series totalling at 21 episodes overall I can’t help but feel like this anime would have been better if a wider variety of ‘time wasting challenges’ had been used. That is not to say the Shogi or Robot Family episodes were poorly made, in fact they are some of the best in the series, however reused concepts in such a short series comes off as somewhat lazy to me. \\n\\n\r\nOverall I loved this anime and it is just as easily enjoyed regardless of whether you watch an episode a day or binge through it all in one go. Tonari no Seki-kun is not the gods gift to humanity; it is however a delightful little show that offers a lot in a short space of time. Try it and see because who knows; maybe you will get the same enjoyment out of as I did.\\n",
            "date": "2014-12-22T10:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 173649,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4232841.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rascorpia",
                "username": "rascorpia"
            },
            "url": "https://myanimelist.net/reviews.php?id=173649"
        },
        {
            "content": "Anime series with a short episode runtime often go ignored even when some of them are genius, I find myself feeling happy when I see a different response towards \"Tonari no Seki-kun\" \r\nSupposedly, you're are sitting in your classroom looking at your teacher running his mouth nonstop, it's the easiest to have your attention deflected at such a time even with those minor distractions.What'd you do if the things happening beside you are more interesting than what's going on before you? Could you avoid it? That our Rumi Yokoi for you. \r\nI'll make myself write something brief and prompt for an anime that only runsa little over 6 mins in every episode, as 30 seconds are dedicated to the OP & ED songs. \\n\\n\r\nRumi is the main protagonist and the narrator of the show and Seki~kun who sits next to her is always playing games at his desk. That is pretty much the whole gist there is no real plot, which actually seems to work well here. Humor is mostly delivered through Seki's actions and expressions,exaggeration of events and Rumi's incessant commentary. Even then both characters seems to be likeable and you'll only laugh out loud listening to Yokoi rattle away since the anime mostly depends on it to convey its hilarity.The episodes open to normal games whether it's domino,chess or Shogi but things get more ridiculous with each passing second. The comedy is nice and light hearted. The animation neat and clean considering each episode is so short and such series are mostly low budgeted and focused on content \\n\\n\r\nThere is no music in the series other than the OP & ED and a Robot song, I personally have come to even like the ED and am enjoying listening to the full version. \\n\\n\r\nThere aren't many character interactions as each secondary character doesn't show up more than twice or thrice through out the whole series, their appearances and encounters with the main characters are kept strictly minor. \\n\\n\r\nYokoi's seiyuu is Kana Hanazawa, a renowned voice in the industry (notable roles are Kosaki Onodera and Angel Kanade Tachibana) which is important as much of the humor is in the comical dialogue delivery too. Seki never really talks. \\n\\n\r\nThe anime series is a braincandy and can be watched when your trying to take a break between episodes, seasons or when your thinking of what to watch after you've just finished something. The show proves a point to you that humor can be created without the ecchiness and still be very funny. It's not just a bunch of boob and panty jokes thrown together (Mangaka-san to Assistant-san, I am eyeing u) but the gags are just for laughs so don't judge or take the show too seriously.\\n\\n\r\nThe series is very innovative and gripping, something creative has been done but as a second opinion, Always, the girl however reluctant ends up getting involved in Seki-kun's acts that results in her name getting called out by the teacher, It all comes down to personal taste as some may find this repetitive and boring,So if you find yourself paying more attention to what the teacher is saying instead of what Seki-kun's doing, you're bored of the show, because that's what the show should be doing, keeping your mind off the lesson but I am only speaking hypothetically.\\n\r\nHence, watch it before you windup a conclusion. As for me I felt much enjoyment in watching it. If you get really entertained by the series you'll find yourself chuckling at the ludicrousness of it all, I was never bored and got really consumed in the series I was only disrupted when I had to choose another episode to watch but I really enjoyed my 150+ minutes\\n\\n\r\nI found each episode ending rather quickly but contrary to that I won't be complaining about the length of every episode because even though I am left wanting for more, some things are best left just the way they're, It's an intuition  that the anime is an adaption of a 4-panel comic strip. The run time of the show  is also the reason for it's excellence, because while the characters might feel so underdeveloped to some, having a normal run time would have more character interactions, romantic development but we want to preserve the show's uniqueness, or else it would've drifted away from it's main motive of creating humor, simply humor, ordinary humor, amusing humor, the run time adds to distinguish the show from the other animes. Though this can become a long time running anime series but with short episodes. I hope it comes back soon.\\n\\n\r\nConclusion- when you're looking for ways to kill your time, why not do it in an extravagant manner with Seki~kun, The master of killing time, afterall nobody does it better than him. \\n\\n\r\nThanks for reading it right till the end ^^ if u did, I know I said it would quick.",
            "date": "2014-06-01T01:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 145335,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3657559.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Avmugi",
                "username": "Avmugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=145335"
        },
        {
            "content": "Tonari no Seki-kun reminded me that you don't need the glitz and glamor of today's standards of high budget animation to fully enjoy a show.\r\nKnowing the fact that they did this with limited resources, I'm quite impressed with the result: 21 short episodes, great OP and ED sequence, very likable characters and superb performance by Kana Hanezawa as Yokoi.\r\nEach episode was truly amusing and a pleasure to watch.",
            "date": "2015-01-12T09:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 177539,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185791.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/alcavey",
                "username": "alcavey"
            },
            "url": "https://myanimelist.net/reviews.php?id=177539"
        },
        {
            "content": "In the words of Leonardo da Vinci, ‘simplicity is the ultimate sophistication’.\r\nTonari no Seki-kun is incredibly simple, yet it’s imaginative, creative, engrossing, and funny. It’s hard to believe they managed to make such an enjoyable series from a bunch of 7 minute episodes - although in hindsight the short episodes worked better for the anime than longer ones would have. Just the right amount of time is spent on each of Seki’s antics. It never gets boring, and I think the reason why is that the script is written so cleverly and voice-acted so well. The script-writers managed to create a perfect balance of fascination,annoyance and exasperation on Yokoi’s part, mixed with a tad of resignation to keep it relatable for the viewers. Her reactions to Seki’s time-killing are what makes this series. Kudos to Kana Hanazawa for her superb performance.\\n\\n\r\nSeki’s also a great character. Even without hearing him speak once, his personality is clearly evident through his actions. From the focus he shows when working on each of his projects, to the way his facial expressions change when acting out a story or playing a game, to the way he treats Yokoi, and then the different way he reacts to the other members of his class. All showcase different aspects of his personality and we end up with someone who’s mischievous, curious, and pure. A delightful combination.\\n\\n\r\nSeki’s activities vary in scale. Some are totally harmless (if also totally bizarre), some are merely a nuisance to the people around him, some are ridiculous and some border on dangerous. The most frequently affected victim is Yokoi, who seems both unable and unwilling to turn her attention away from Seki and risk missing out on his next performance. Initially, you empathize with Yokoi, but Seki’s antics grow on you bit by bit and eventually you’re as eager to see what he’ll do next as Yokoi is. There’s no plotline to speak of – Seki’s antics are the plot. There would be no point scoring it on how well the story develops, cos that’s not the point of the anime at all.\\n\\n\r\nMusic is lively and catchy, and art is simple. Nothing flashy or out of place.\\n\\n\r\nEssentially, the anime is just a collection of entertaining shorts about two ordinary people with extraordinary imaginations and a healthy sense of curiosity. I’d give it a watch, it won’t take up much of your time and you’ll probably enjoy it. XD\\n",
            "date": "2018-01-22T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 269364,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=269364"
        },
        {
            "content": "Tonari no Seki-kun : The master of killing time\r\nSo, exactly as the title of this anime \r\nOr they should Yokoi wants to know all her next-seat classmate is doing? ╲(｡◕‿◕｡)╱\r\nWell, it really worked pretty well for me.. For killing time\r\nSo, what's the best time for watching this?\r\nWhen you're resting from doing your homework, waiting for someone/something, while eating snacks, when your TV at commercial break (Don't watch it before you sleep, because you won't sleep after 1 episode )\r\nOk here's a thing if you didn't notice\r\nIt's a 7-8mins short anime or 1/3 time of the usual anime (1 min+ for OP&ED)\r\nWhy I recommend this?\r\nFirst thestory\\n\r\nObviously the story is about killing time\\n\r\nMost of the time they just sit in a classroom while the teacher there\\n\r\nThere is Seki who likes to play something else while the teacher teaching something (Good boys&girls don't do that xD)\\n\r\nAnd there is Yokoi, who's always curious with whatever Seki do, keep watching him & commentating furiously (not really), and regretted it after that\\n\r\nBecause she didn't listen to the teacher's lesson\\n\r\nSimple story yet so interesting\\n\\n\r\nArt?\\n\r\nHmm I have to say nothing special about the arts\\n\r\nBut overall it's good\\n\r\nWhy?\\n\r\nThe expression, especially Yokoi (Well she's the only one who had many expressions) just really really.. make things so interesting\\n\r\nI mean without those face expressions you obviously can't imagine how this anime will going to be.. right?\\n\r\nFor Seki-kun oh well his expressions all went to his \"creation\" effects xD\\n\\n\r\nSo, how about the sounds?\\n\r\nWell voice acting... You need something more than this?\\n\r\nThe voice acting is the one that making things alive!!\\n\r\nHanaKana, everyone's favorite\\n\r\nI'm pretty sure almost all of MAL's people knew her pretty well\\n\r\nShe really did a great job\\n\r\nUsually you'll hear her as a introvert, shy, and a quiet character but adorable\\n\r\nSo, how about this one?\\n\r\nWell her character wasn't really talking loud about all of her \"comments\"\\n\r\nBut still her character obviously not a quiet one\\n\r\nHer voice really made Seki's \"creation\" perfect\\n\r\nWithout her \"tsukkomi\" voice everything just become dull\\n\r\nThank you HanaKana! Good job! xD\\n\\n\r\nSeki-kun, many people said Shimono Hiro just doing nothing at all\\n\r\nBut those guys are wrong\\n\r\nHe's doing something amazing\\n\r\nHis character wasn't not talking at all\\n\r\nBut he's still doing other sounds, like sound effects.. \\n\r\nTbh it's kinda hard sometimes to do something like that\\n\r\nThere'll be an episode that he have to do the sound effects by his own voice.. only his voice\\n\r\nHe really did a great job! I mean really, you'll see later\\n\\n\r\nOP&ED\\n\r\nOP is sung by HanaKana, the lyrics are reflecting Yokoi's feelings\\n\r\nED just an instrumental+some gibberish by some student's tools (ex : pencilcase, pencil, \"lab glass\")\\n\\n\r\nCharacters...\\n\r\nWell\\n\r\nLet's start from Seki\\n\r\nA boy who didn't like studying in a classroom at all, so he brought all of his toys to the classroom\\n\r\nHe's playing with them while his classmate looked at him (I think he's planning this xD)\\n\r\nAnd Yokoi\\n\r\nBecause Seki's \"creation\" need someone's reaction to make it alive\\n\r\nThey way she made the \"comments\" are way too hilarious, you can't deny her way to make them\\n\r\nHer voice too full of expression too, so you're bound to laugh / just grin widely\\n\\n\r\nFor both of them\\n\r\nWell I don't really know myself\\n\r\nBut, I really shipped them even if there's no romance at all\\n\r\nI mean if you're watching them till the end, you know they're really adorable together\\n\r\nThey have some kind of \"red strings being tied together\".. Right g-guys?\\n\\n\r\nIt's a short anime, but it's really interesting\\n\r\nWhen I'm watching this, I just felt it's just one or two minutes\\n\r\nThat means, if you're really enjoying something, your sense of time just *poof.. Gone xD\\n\\n\\n\r\nTL;DR\\n\r\nWhy don't you try for yourself the first 3 episode?\\n\r\nIt's just 21 min, the same time like 1 episode of a \"normal\"\\n\\n\r\nThank you for reading my review \\n\r\nHope it helps you\\n\r\nI really like short anime like this\\n\r\nHow about you? You like it too?\\n\r\nPlease tell me by adding me and write it to me in my comment section :)",
            "date": "2015-09-04T07:37:00+00:00",
            "helpful_count": 9,
            "mal_id": 197798,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1573347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rayl1ght",
                "username": "Rayl1ght"
            },
            "url": "https://myanimelist.net/reviews.php?id=197798"
        },
        {
            "content": "Here's my take after watching 21 episodes of the fun and time killing : The Master of Killing Time by Shin-Ei Animation Studio.\r\nHow should I put this...\r\nTonari no Seki kun is great take on an enjoyable way to kill time. Since each episode is just around 7 minutes it is easy to watch on your phone while on the go and it does not try and stretch itself that the story or \"period\" becomes laggy. \r\nBut don't be thrown away with the running time since it remarkably retains the essence of the story, the tension it brings and the laughs that makes you break outit laughter. \\n\\n\r\nThe story mainly revolves on the quirky and playful Toshinari Seki and his curious observer/forced participant class neighbor Rumi Yokoi.\\n\\n\r\nEach episode is a period in their class and is a story on itself. During each of those periods Seki is doing different ways to kill time like: toppling a chain of eraser domino, playing weird shogi, buffing his desk and my personal favorite playing with his robot family.\\n\\n\r\nThe story does not take itself seriously and that is what is great about it!\\n\\n\r\nThe art is good enough to make the characters and the story to take the lead of the story and the music is fun and catchy, especially the ending song.\\n\\n\r\nYou would not regret watching Tonari no Seki kun and you might be addicted and binge watch all episodes in one sitting. But if you end up doing that and want more you can continue reading the great manga of the same name by Takuma Morishige as it has currently have 73 chapters and still going.\\n\\n\r\nWith that said, I will give Tonari no Seki kun 9 shogi pieces out of 10!",
            "date": "2017-11-10T17:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 262959,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6582532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jmsjrdn",
                "username": "jmsjrdn"
            },
            "url": "https://myanimelist.net/reviews.php?id=262959"
        },
        {
            "content": "Tonari no Seiki-kun is a fantastic anime. The idea of having the episodes set on a class, in which there is a girl who keeps watching her colegue entertain himself during the class on many different ways, is really clever and well done.\r\nThe episodes are around 10mins each and it may seem pretty small but you get the full enjoyment of a \"saturday morning sit on the couch watching cartoons as kids\" type of feeling.\r\nIt's really nice watching the various activities Seiki does during class, for example watching him making epic war scenarios out of small little food.\r\nOverall it is a fun series to watch,fast to watch and totaly worth checking out.",
            "date": "2014-10-15T22:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 164961,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3801257.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Brav0",
                "username": "Brav0"
            },
            "url": "https://myanimelist.net/reviews.php?id=164961"
        },
        {
            "content": "Tonari no seki-kun is that anime which you would simply fall in love with .Even if you are in despair because your favourite character died in some random anime you have been watching or even if you have a list of hot mainstream anime in your list which you haven't watched, still I can guarantee you this will keep u busy, interested and will completely cope your mind in finding more time to watch it and see it throughout till the end.\r\nStory:\r\n The story revolves around a girl named Rumi Yokoi and her classroom neighbour Seki-kun, who never seems interested in class and does somany random things to keep himself from being bored. But these out-of-the-blue things which he does constantly keeps Rumi bugging as she wants to study yet in the same time they are so interesting that she finds herself coped in them.\\n\\n\r\nArt,Sound & Character:\\n\r\n I simply loved the art (not so great but just enough to digest).\\n\r\nThe opening is one of my favourites which i never skipped.\\n\r\nAs for Seki-kun ,he does'nt has a voice character, yes u heard me right ,he does'nt says even a single word throughout the series but the surprise is you will never find it necessary, yes the story is written that beautifully.\\n\\n\r\nI have rated it 9 for the sake of other really awesome anime I have watched but for a more accurate view , I would rather give it a 9.5.",
            "date": "2018-05-21T02:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 281067,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7122015.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/blank28_",
                "username": "blank28_"
            },
            "url": "https://myanimelist.net/reviews.php?id=281067"
        },
        {
            "content": "This is an anime that doesn't really have a plot. It is full of hidden puns, and is very creative.\r\n  I started to watch this because I was bored. My friend told me about it, and said it would help me get back into the \"anime-watching-mood\". Turns out, she was right. This anime is very light and carefree, but also shows how some kids view school. \r\n  The op for this anime is very unique too. It sets up the tone of the show, and kind of helps the watcher know what to expect. The characters, though not developed too much, fit theshow and it's \"plot\". In my opinion, they make the show funnier.\\n\r\n  I would recommend watching this if you are in the mood for some laughs or short entertainment. The episodes are pretty short, I think about seven minutes, but I like to re-watch them between classes or when I have a break.\\n\\n\r\nHope this helps,\\n\r\nESL",
            "date": "2016-03-11T11:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 212691,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675889.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Emeris_Lochart",
                "username": "Emeris_Lochart"
            },
            "url": "https://myanimelist.net/reviews.php?id=212691"
        },
        {
            "content": "Tonari no Seki-kun has episodes\r\nthat average around 7 minutes\r\nlong in length ... but don't let the\r\nlength fool you into disregarding\r\nthis anime as having no plot. Each\r\nepisode consists of Seki bringing\r\nhis newest distraction of the day\r\nwhile Rumi attempts to ignore\r\nwhat's going on next to her,\r\nfailing every time as she finds\r\nherself drawn into what he's\r\ndoing. The plot for each episode\r\nwas wonderfully done and\r\nimmensely entertaining! xD The\r\ncharacters basically consist of\r\nRumi and Seki with the occasional\r\nappearance or comment from a\r\nclassmate ... both of the main\r\ncharacters were wonderfully\r\nentertaining. It was a wonder to\r\nme how entertaining Seki was\r\neven though he never said a single\r\nword ... not in any of the 21\r\nepisodes!The animation was nice,\\n\r\nnothing spectacular, mind you,\\n\r\nbut nicely done all the same. All in\\n\r\nall I very much enjoyed this\\n\r\nanime! Every episode brought a\\n\r\nhuge smile to my face and even\\n\r\nthe occasional laugh! I very much\\n\r\nrecommend it!",
            "date": "2014-11-12T19:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 168381,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=168381"
        },
        {
            "content": "Tonari No Seki-Kun may be the funniest anime I've watched since starting Gintama. That is saying a lot, since the episodes are quite short at about 7 minutes long, but that is plenty of time for this anime to tell an effective and hilarious story.\r\nStory: 9.5/10\r\nShort, sweet and to the point. Seki-kun's antics and Yokoi's great imagination and creativity are so entertaining to watch. They use the best methods of storytelling with Yokoi's expressive narration in combination with Seki-kun's almost exclusive use of physical comedy to tell creative tales of love, hardship and determination using common toys and games. They are such simple stories, butI haven't laughed so much watching an anime in so long. You cannot help it when you see how ridiculous Seki-kun and Yokoi can get. The only thing keeping this anime from getting a 10/10 was that they occasionally repeated \"toys/games\", but the seeing these toys/games again may have been funnier than the first time around. \\n\\n\r\nArt: 10/10\\n\r\nSound: 8/10\\n\r\nNot much to say about the art...it's awesome. Love the use of colour scheme in the different stories. They used sound clips pretty well to add from the scene but I find that I didn't pay attention much to the sounds as I was so caught up in Yokoi's storytelling. But a majority of this score goes to the opening and ending themes; catchy and unique. \\n\\n\r\nCharacter: 9/10\\n\r\nYokoi's imagination makes the show what it is, as Seki-kun barely (if not ever) speaks in the series. Her interpretation of his behaviour is hysterical. Despite not speaking, Seki-kun's physical comedy is second-to-none. He comes up with such imaginative ways to play and mess around during class. I won't reveal these next \"characters\" but these 3 little guys stole any episode they were in. Seki-kun's interaction with these 3 \"characters\" really made them my favourite  secondary characters despite never speaking either. \\n\\n\r\nEnjoyment: 10/10\\n\r\nOverall: 10/10\\n\r\nI think it is obvious how much fun I had watching this series. It is an easy series to get through and so is definitely worth watching. I  really hope there is another season or 2 because I just can't get enough of this classroom fun.",
            "date": "2014-05-25T16:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 144521,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3300487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokyoCrazyPXD",
                "username": "TokyoCrazyPXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=144521"
        },
        {
            "content": "Story - 9/10\r\nArt - 10/10\r\nSound - 9/10\r\nCharacter - 9/10\r\nEnjoyment - 10/10\r\nTonari no Seki-kun is a outstanding anime. I couldn't stop laughing watching the 1st episode at least.\r\nI like the 1st Episode , Shogi's Episodes and Robot Family's Episodes the most.\r\nI didn't even realize that i have already complete the whole series. The episodes were short but the most enjoyable anime i have ever watched.\r\nThis show must be 7.66 rated  because of the short duration of the episodes.\r\nThis show should be 8+ rated at least.\r\nPros - Enjoyable Comedy.\r\nCons - There will be 2-3 episodes which are not enjoyable.",
            "date": "2019-02-17T08:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 301860,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7463537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sanchit_Jain",
                "username": "Sanchit_Jain"
            },
            "url": "https://myanimelist.net/reviews.php?id=301860"
        },
        {
            "content": "This anime was really enjoyable from the start to the end, It's basically a 7-min-per-episode kinda anime, but that's actually perfect, couse that's all ya need for doing this kind of thing.\r\nThe episodes are really fun, watching Yokoi's mindfucks over Seki's things is always hilarious. The art-style is extremely simplistic but it's good in it's simplicity. The opening isn't bad, but the ending is really good, I usually always stayed till the end just to dance to the ending.\r\nNow for the recommendation thing I always do... This is that kind of anime that you watch once in a while when you're bored just to killtime (oh the irony), so... if you ever find yourself in one of those moments, kill that time with Seki, you won't regret it",
            "date": "2015-12-17T11:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 205825,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205825"
        }
    ],
    [
        {
            "content": "Creativity, a simple word that inspires so much innovative ideas from anyone, anywhere, anytime. What inspires creativity varies but for a young boy named Toshinari Seki, he takes it to astronomical levels that goes far beyond what you may be used to seeing at school. As a master of killing time, Seki lives up his reputation of such a title. For a  7-minute anime series, there’s so much attention Seki can attract towards its audience.\r\nWhen it comes to killing time, you would do something inventive, something creative, or anything that will prevent you from saying along the lines of ‘it’s so boring, there’s nothingto do’. For Seki, there’s a chance for that in his class every single day because he sits in the very back corner. As a kid of his age, Seki can be described as a simple yet curious character. He isn’t very interested in his studies by the way he behaves in class. Looking it from an intrinsic perspective, Seki is an average boy with nothing that stands out with his character or personality. Rather, he prefers to be alone by his activities. Of course, that’s perfectly normal because kids his age are growing up and build their characters. Seki is also more of the shy boy with his lack of dialogues. More often or not, he communicates using body language (gestures, signals, etc) that somehow makes its point. Rather than being intellectual, this series takes Seki and presents him as a bizarre yet likable character with his actions.\\n\\n\r\nThen, we have Rumi Yokoi, the not-so-fortunate girl sitting next to Seki. Similar to Seki, she is the typical average girl without the glorifying looks or an abnormal personality. Yet, she is similar in some ways to Seki as characterized by her curiosity. Despite trying to ignore Seki’s actions in class, she often finds herself unable to but instead entranced by his activities. It’s humorous in many ways because almost everything that Seki does tends to draw her attention. At the same time, Yokoi often gets into trouble by the teacher and mistakenly being labeled as a troublemaker. For Yokoi, it becomes a chore for her every class period to deal with Seki. On some instances, she seems to tolerate or even embrace Seki’s culture. Other times, she overestimates Seki’s intentions that results into a scolding by the adults. There’s a lot of anxiety each episode seeing Yokoi and her reactions towards how she perceives Seki in class. Furthermore, it’s surprisingly noticeable to see her character develop. This is evidenced as Yokoi seemingly grows stronger with every class period or episode. She is able to resist some her curiosity or even close to stopping Seki from goofing off in class. Unfortunately, she never seems to reach home base with her goals because time is simply not her side.\\n\\n\r\nThe series adapts itself in an episodic format. Given its average 7-8 minute standard, viewers should not expect an engaging linear story saturated with complexity. Instead, do expect a slice of life story featuring Seki as he kills time in his boring class. What you might not expect is the activities he does in class when the teacher is not looking. Some of them might seem typical while others are not. Examples including bring live animals, performing experiments, and in general any activities that would earn you a trip to the principal’s office if caught. The humorous part is that Seki NEVER gets caught. Throughout the series, it is Yokoi that becomes the collateral damage because of Seki’s innovations. Not only that but no one believes a word she says. It aims at the purpose to appeal to the audience that the adults of this show are useless and self-insufficient. If every student could get away with Seki’s behavior, then nothing would ever be learned. But as an experimental show, Seki’s activities encourages creativity and even inspiration. It’s clear that the boy is intelligent because some of the games he engages in are fundamentally impossible, at least in realistic levels such as mixing chess and shogi on the same board. For Yokoi, she often formulates imaginations and delusions at her own discretions from the way Seki kills time.\\n\\n\r\nAs a show of weird quirks, there are occasionally some characters that comes into the scenes to bring a little normalcy. I don’t classify them as supporting characters since most of them tend to enter and exit after the period/episode is over. Yet, there is one other character that is worth noting. Her name is Goto and like most girls her age is interested in relationships rather than her education. Make no mistake, her delusions can be as zany as Yokoi in class. Rather than being curious at Seki’s ingenious games, she is more interested in their “relationship”. This is in quotation marks because Seki and Yokoi are not dating. Yet, there are people that thinks they are dating for bizarre reasons. Further evidenced are some hints that Yokoi might see Seki as more than just a classmate. However, the show focuses more on its comedy and less so on a Romeo & Juliet story.\\n\\n\r\nOf all the silliness that the show brings in, it’s all presented as simplistic. It’s not realistic with some of Yokoi’s games that seems unconventional. Yet, they are practical and influences Yokoi’s school life at various levels. The story itself is rather too simple and may seems repetitive. Yokoi getting accused of being a troublemaker in class can also seem bizarre considering girls are often the ones that are more peaceful. Not only that but she doesn’t understand Seki’s purpose which is also a bit of an overstatement. We might never understand Seki’s purpose beyond the simple idea of ‘killing time’. The lack of character backgrounds such as their childhoods being explored also becomes a drawback. Finally, the humor of this show might not appeal to everyone. In essence, it’s a comedy show that inspires laughter but not everyone may get used to Seki’s quirky activities in class.\\n\\n\r\nBoth artwork and soundtrack are consistent with this short series. In essence, they are simple and down to earth. The classroom backgrounds is straight point forward with nothing particular that stands out. It’s probably best to just call it ‘just there’ because Seki’s activities are what draws in the audience and his classmate. The character designs also seems normal except maybe some slightly physical aspects for Yokoi. In retrospect, we don’t see a girl with white hair often in class that goes unnoticed. On the other hand, the soundtrack is very noticeable for both its OP and ED songs with slightly edited changes throughout the show. Instrumentally, it has a melodious tone with comical backgrounds. We see both main characters in the songs as they demonstrate degrees of humor. The ED song features Seki playing an instrument to create the style that Tonari-Seki Kun accomplishes – innovational humor. Kana Hanazawa plays the role of Yokoi with her nervous yet curious voice mannerisms. It matches well since she is specialized in voicing girls of shy characters. On the other hand, Seki’s voice is hardly ever heard throughout the series. His body language does the talking.\\n\\n\r\n7 minutes. That’s all it takes to draw in as much as attention for Seki towards an audience. There’s no need for a deep engaging story because shows like this should be presented with simplicity. While the activities that Seki performs can be complex, it’s easy to see what the show tries to accomplish. And that goal was achieved by bringing in humor in a different way that what you may be used to. No absurd fan service. No shock values. No crude humor. Rather, it’s a show that breaks down the barriers of a normal school life. Now, that’s a certain kind of fun.\\n",
            "date": "2014-05-25T15:17:00+00:00",
            "helpful_count": 136,
            "mal_id": 144503,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=144503"
        },
        {
            "content": "Remember this show? Two months have passed since the short series ended which was bittersweet after it became something I really looked forward to weekly. Its premiere from early Winter Season was overshadowed by numerous series such as the highly anticipated Space Dandy, the popular Noragami along with the romantic comedy in Nisekoi. But one of the highlights as an avid fan of anime is discovering a series that looks nothing but ordinary at first glance but later discover it's something truly remarkable and worthwhile. After the end of each episode, there are three words that always come to mind - Originality, Creativity and Fun.\r\nAdaptedfrom Takuma Morishige's Manga in episodic format, Tonari no Seki-kun is a 7-minute-episode short series that follows two school students who are responsible for creating some of the most memorable and hilarious moments this year. It all begins with Rumi Yokoi who strives to be a model student. Unfortunately for her, she sits right next to Toshinari Seki, who likes to play with toys, stationery and games on his desk rather than focus in the classroom with his studies. Seki's activities almost always result in distracting Yokoi and pull her focus away from her studies which normally ends with her getting into trouble with the Teacher. This is basically the premise of the show but what makes it so good is turning the mundane into the evocative.\\n\\n\r\nEven though Tonari no Seki-kun is episodic structured, there is actually a progressive continuity and even some form of a narrative here. It's scattered throughout the series and relies on calling back to events from prior episodes like the \"Shougi games\" based episodes and most notably, the episodes that focus on Seki's family of \"Transformer toys\". There is even a loose plot involving the rumour that Yokoi and Seki love each other carried on through the eyes of their classmate Sakurako Goto. Coming back to these events only adds to the fun experience you had previously, making them a lot more memorable.\\n\\n\r\nSeki is just like any ordinary person, he doesn't stand out much and keeps to himself, people really don't notice him. Because of this, Seki is able to get away with killing time in the classroom with his usual antics. An advantage he has to avoid being noticed by the teacher is that he sits right at the back of the classroom in the very far corner. Seki is able to turn the mundane into something very entertaining and funny. I'm talking about things such as making a flipbook, polishing a desk, wearing glasses, running a postal service, and even taking a driving license test. Seki's creativity knows no limits, it is sheer brilliance. Even though it is shown that he easily gets off-task and doesn't take his studies seriously, through these activities we can easily see that he is a very smart person.\\n\\n\r\nA large portion of the comedy comes from Yokoi's own imagination going into overload whenever she gets absorbed into Seki's antics. Such as picturing epic battles and romantic dramas between fully clad samurai when all Seki was doing was playing with Shogi pieces or imagining a miniature teddy bear making a tense climb up a mountain when Seki was really just making it climb up the back of the person in front of him. Yokoi actually likes being a part of Seki's shenanigans.  She's hooked on the buzz, an adrenaline addict, and Seki is her fix. If you don't get that, you don't get Tonari no Seki-kun—and then it's just a mildly amusing face about a middle-schooler screwing around at his desk.\\n\\n\r\nThe visuals and animation are clean, fluid and consistent. There are zero drips and drops with the quality. The character designs are rather basic, but something refreshing is definitely Yokoi's design. White hair is not something you see very often for a female character and another point is how well they adapted the facial expressions for the characters reactions to certain scenarios. Just the way they are drawn is quite comical. In the sound department, the score soars! Both the Opening and Ending are quite clever, the Opening displays what the series is all about. It shows Seki getting up to his usual antics and Yokoi reacting to them along with an upbeat and catchy tune. The Ending just adds another touch to the creativity side of things and it very well may be one of the most creative ones around, the song is called, \"Set them free\" by Akira Jimbo. A lot of praise must go to Yokoi's voice actress and she almost carries the show alone, brought to you from the very popular Kana Hanazawa who nails the character perfectly, she easily goes through a wide variety of emotions and makes the reactions of Yokoi's character priceless.\\n\\n\r\nTonari no Seki-kun—Master of Short Series Format! This could very much be true. It's able to utilize every second of the 7 minutes effectively and is consistent. The formula Shin-Ei Animation has for this show has resulted in creating one of the few series where there isn't really negatives or a bad episode. Sure, there are some episodes that are more enjoyable than others but with the consistency and creativity each episode holds along with the good pacing, allows the viewer to enjoy each one just as much. There's some incredibly incisive observational comedy about the differences between boys and girls, and the relationship between Seki and Yokoi specifically is layered, fascinating and hilarious. \\n\\n\r\nI could go as far to call this show flawless, it doesn't do anything wrong and achieves everything it set out to do and be perfect. With that said, it makes this show easily recommendable and I do believe it can also be a recommendation as a good gateway series to anime simply because it's hilarious, entertaining and a lot of fun for all audiences.  It may be short, but Tonari no Seki-kun definitely punches above its weight class.\\n\\n\\n\\n",
            "date": "2014-07-29T19:36:00+00:00",
            "helpful_count": 55,
            "mal_id": 154351,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=154351"
        },
        {
            "content": "WARNING: Avoid drinking anything while watching. This show is not liable for any snorting of said drink. Side effects may include stomach aches from giggle-fits and shortness of breath...\r\nStory: 8/10 There is a special charm that only short anime possess, such as Hetalia, Chi's Sweet Home and Miss Monochrome. Among these easy-to-watch shows is Tonari no Seki-kun, whose episodes are a mere 7 minutes in length. Each segment is episodic without much of an overlying plot, although there are recurring themes. A creative boy named Seki-kun brings in nick-nacks to class and messes around with them rather than pay attention. Yokoi-san, the girl who sitsnext to him, reluctantly gets drawn into his activities. Her inner monologue of observations explain his schemes and give significance to small changes. Sitting at the very back of the classroom, the other students and teachers take no notice of whatever dramatic occurrence is taking place; when they do, it usually takes form in some misunderstanding. Much to her chagrin, Seki-kun never gets caught, while Yokoi manages to get in trouble instead. The fact that the two take each situation so seriously only amps up the amusement.\\n\\n\r\nArt: 7/10 There is nothing very special about the animation, except for when it focuses on the games. The art does justice to Seki-kun's elaborate hobbies. The colors are light and happy, and the expressions of the characters take form in comedic ways. The only noteworthy character design is Yokoi, who sports white hair and a candy-colored girl's school uniform. The more detailed manga panels translate cleanly in the adaption. Overall, the simple style works wonders for the anime's simple premise.\\n\\n\r\nSound: 9/10 The opening is sung by the voice actor of Yokoi, and it's basically her general reactions to Seki-kun's antics. The frantic stream of thought within each verse is sung in one breath, and the fast paced vocals are complimented by lighthearted music. I have never once thought of skipping it. The ending is also addictive, with Seki-kun drumming on his pencil cases and school supplies.\\n\\n\r\nSeki-kun never speaks, so you won't hear much of the seiyuu except for occasional grunts or laughter. Yokoi, on the other hand, is the prominent narrator. Kana Hanazawa does a wonderful job portraying Yokoi, but I did find her voice to be slightly annoying. It's a teeny-tiny mar to the overall execution.\\n\\n\r\nCharacter: 9/10 You really wonder why a genius like Seki-kun doesn't put his talents and energy into other skills rather than waste time. The audience quickly sympathizes with Yokoi's plight, but like her, are drawn into every game. As the series progresses, we see that Yokoi starts to become more and more involved with Seki-kun's various distractions. This however would be the extent of any character development. I fell in love with this adorable duo almost instantly and I'd like the anime to speak for itself. Supporting characters have a tiny role, but they are amusing additions to the plot nonetheless.\\n\\n\r\nEnjoyment: 10/10 This could potentially be the best comedy of the season, no joke. I'm really grateful to my little brother who introduced me to Tonari no Seki-kun. I'd definitely use some of the nifty ideas to pass time myself if I didn't get caught. Anyone who can pull off the antics should have the right to wear a T-shirt that says \"Seki-kun like a boss.\" The style of humor is somewhat similar to that found in Azumanga Daioh or Lucky Star. I swear, it'll brighten up your entire day =D\\n\\n\r\nOverall: 9/10 Oh gosh, I've started rambling. Anyway - I totally recommend this (especially to younger demographics and people who haven't seen anime before) if your looking for something family-friendly. It's an automatic favorite. Thank you for reading this review and happy laughing.",
            "date": "2014-07-06T12:27:00+00:00",
            "helpful_count": 48,
            "mal_id": 150709,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/873889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aeowina",
                "username": "Aeowina"
            },
            "url": "https://myanimelist.net/reviews.php?id=150709"
        },
        {
            "content": "The amount of joy that you can get out of a pleasantly mellow 7 minute slice-of-life is incredible.\r\nStory - Is so simple it hurts. How do you make a 7 minute anime about a school slice-of-life so good?  Yokoi is a girl that slightly stands out from the rest of her class. She always wants to study hard and do her best every day. The boy who sits next to her creates new ways to kill time which distracts her to her utmost limits.\r\nArt - The art isn't anything to write home about. It's average at best. Maybe that works incredible well for thisanime though. Nothing stands out, but everything is drawn really well. Not to mention the craziness they incorporate in Seki's every day antics makes it worth more on the scale.\\n\\n\r\nSound - The opening isn't to bad. The ending theme is where it's at though. It's unique and the drumming on the metal instruments on Seki's desk and Yokoi getting into his beat and feeling embarrassed about it. I'd also like to point out Seki having no Seiyuu.\\n\\n\r\nCharacter - The development for the character is lacking. But, they make up for this in developing the characters in 7 minutes every episode to show what this anime is truly about. Seki has no Seiyuu. He portrays his feelings through emotions that are pretty easy to read. Yokoi on the other hand is a normal girl who gets distracted at every turn with Seki. She has a cute voice and can be a bit Yandere when Seki starts ruining the imagination that plays out in her head with his certain shenanigans. \\n\\n\r\nEnjoyment - Incredible. I enjoy start to finish of this 7 minute an episode anime. It's just long enough and keeps me laughing through out. I'd highly recommend it for anyone relaxing and looking for a laugh.",
            "date": "2014-03-25T05:10:00+00:00",
            "helpful_count": 37,
            "mal_id": 136899,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1989300.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BentoLegend",
                "username": "BentoLegend"
            },
            "url": "https://myanimelist.net/reviews.php?id=136899"
        },
        {
            "content": "Each short episode of Tonari no Seki-kun is built on a similar foundation: Seki plays some comically elaborate game in the middle of class, and Yokoi, his more studious neighboring classmate, invariably gets sucked into what he's doing, to the point where she often becomes even more invested in it than him. That’s it. This seems like a fairly limited premise, but it provides a great framework with a surprising amount of comedic range for Seki to play in. The results are almost always a blast.\r\nThe games Seki plays each episode range from staging complex, twist-laden wars with unconventional shogi play to bringing an actualbag full of cats into class. There are episodes where he’s seen building crazy Rube Goldberg machines right in the middle a lecture. He never really speaks outside of determined grunts and the like, but there’s a ton of expression put into the way he reacts to the various scenarios he concocts. There’s a sadistic edge to how he goes about his games and the way he crafts his fiction that makes him a great foil for Yokoi to play off of. \\n\\n\r\nYokoi's reactions to these scenarios are diverse and keep her from becoming a stock overreaction character. More of a protagonist than Seki is, the episodes are generally filled with her internal narrations. She’s sometimes quite taken by Seki's more sensitive side, only to be crushed when he reverts to his usual, harsher self. Other times the plots of Seki's games become so grim that she finds herself becoming engaged in them, in an attempt to steer them towards happier directions. There’s a running gag involving a robot family that Seki often brings to class, for example, that he often puts in dangerous situations or will just mistreat in general. Yokoi gets really attached to Seki’s narrative for this family and will put herself at risk of being caught by the teacher just to help sway their fate in the direction she wants. Of course Seki doesn’t just take this lying down and it becomes a fun battle for the outcome of these toy robots. And this is all while she’s trying her best to study! It’s a lot of fun seeing the creative ways she gets whisked away from this each episode. They play off each other really well and make for a great comedic duo. Also Yokoi is like totes adorbs.\\n\\n\r\nPresentation works wonders in capturing the comedic idiosyncrasies of the scenarios. The dramatic score and aggrandizing theatrics elevate these silly games to the status of tense, mortal conflicts. Effortlessly pulling the audience into the characters' skewed sense of priority; the result is entertaining at every turn. Kana Hanazawa puts in a great performance as Yokoi, capturing the huge swings in emotion that Seki puts her through wonderfully. Fans of silly faces will find a lot to like here as well, as the show has a huge array of them that it uses really well to heighten the comedy. There are many places in the show where the creators went above and beyond, like giving the robot family their own theme song in the style of old mecha anime, or depicting shogi games as actual wars, acting out Seki’s stories. Even the OP and ED play out like skits from the show. The OP in particular is a clever meta piece about Seki actually animating Tonari no Seki-kun in class. A lot of subtle ingenuity went into making this simple premise a lot more than it seems.\\n\\n\r\nIf there’s anything to complain about in this show, it’s that the show does have some rare instances where the punchlines can start to feel a bit samey. There are some recurring skits and although they still remain endearing, the edge of their punchlines are dulled on each successive rehash. It’s nothing too bad though and the short run time of the episodes makes these skits more of a fleeting occurrence before you’re back to something new again, but several of them did start to lose a bit of their luster for me by the end. They might even give the series a nice sense of continuity for some though, so your mileage may vary.\\n\\n\r\nMinor quibbles aside, this is an incredibly solid comedy. Seki and Yokoi have a great dynamic together and the show by and large does a superb job giving them varied situations to bring out the most in their personalities. Coupled with the grand presentation of it all, it’s easy to be whisked away into Seki’s antics just as Yokoi is. I doubt many will regret their time playing with Seki, especially without the risk of being caught by the teacher.",
            "date": "2014-12-05T18:23:00+00:00",
            "helpful_count": 25,
            "mal_id": 171141,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1212363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NotDolphy",
                "username": "NotDolphy"
            },
            "url": "https://myanimelist.net/reviews.php?id=171141"
        },
        {
            "content": "Tonari no Seki-Kun is a simple show with simple stories. That's one of the things I really like about it, because it's easy to digest. The short length works great, and no single episode feels like it's overstaying it's welcome.\r\nHowever, the whole thing also feels pretty formulaic, which eventually started to wear on me. Even only watching at a relatively average pace (at one episode every morning), I began to get bored of it about halfway through. Some episodes were pretty funny, but I can't recall many times the show actually made me laugh out loud. A few episodes also recycled ideas from earlier episodes,and just put a slight twist on them, which I thought seemed kind of lazy from a writing perspective.\\n\\n\r\nThe art is pretty standard, and definitely common to what we normally see in the genre. It's well done, but it's nothing too impressive. I do think the character design is slightly better than what we typically see with this kind of art style, though.\\n\\n\r\nThe voice acting is pretty standard as well, but it's well done for what it is. All of the actors represent their characters well, but again, nothing too remarkable here. I think where the show's audio really shines is with the opening and ending themes. They are super fun, catchy, and they fit perfectly with the setting of the show.\\n\\n\r\nThe characters also go along with that sense of fun. The main characters Yokoi & Seki-kun are somewhat interesting. Seki-kun is a pretty standard looking character, visually, but they do enough to make him unique. They never have him say any words, just grunts and groans, however I like this because it lets his personality be shown entirely through his actions. Yokoi, on the other hand describes what Seki-Kun is doing, essentially narrating things for us. She has an excitable personality, and really pulls a lot of the fun of the show together. There are a few other supporting characters, which feel very generic, but fill a gap well enough, and flesh out the cast just a tiny bit.\\n\\n\r\nOverall, Tonari no Seki-Kun is a somewhat average, but enjoyable show. What it ends up being isn't anything special, but it also doesn't really try to be. This is both good and bad, as it's a good quick bit of fun, but over the course of watching it, I slowly began to lose interest. The writing is good, but perhaps a bit weak, however, the characters tend to make up for that somewhat, with their somewhat unique identities. I'd recommend it to anybody who enjoys the comedy genre and isn't expecting anything all that incredible... but just looking for a fun, simple show.",
            "date": "2014-06-12T11:59:00+00:00",
            "helpful_count": 16,
            "mal_id": 146787,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648219.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/vigorousjammer",
                "username": "vigorousjammer"
            },
            "url": "https://myanimelist.net/reviews.php?id=146787"
        },
        {
            "content": "Tonari no Seki-kun is an adaptation of a manga with the same name.  I have been reading this for awhile, I have already caught up with the manga already.  This anime is very creative and fun anime.  This anime is a 7-min and 21 episodes anime, the OVA and special will be releasing soon.\r\nStory: 8\r\nTonari no Seki-kun is an anime revolves around Rumi Yokoi and her reaction and narration toward the person she sit next to Toshinari Seki or Seki-kun and his antics.  His antics consists on something new every time, and it distracted Rumi from her note taking and sometimesshe got in trouble because of his antics, and Seki-kun never gets in trouble.  He hasn't been caught because both of them sit in way back, Seki-kun sit by the back corner by the window, and Rumi sit next to him.  IDK how he have been caught it called anime logic's.\\n\\n\r\nArt: 8\\n\r\nThe art is not perfect Kyoto Animation.  But from manga to anime, it near perfect the manga and anime have similar art to it and I give a hand to the producer for that.  The art for Seki-Kun activities pretty good, expectually the art book one.\\n\\n\r\nSound: 9\\n\r\nThe main girl Rumi Yokoi voice actor sings the opening of the anime.  She basically sing about her reaction toward Seki-kun antics.  The opening is pretty good, and the voice actor for Rumi is good but Seki-kun didn't say anything...at...all, but he never say anything in the manga as well. The ending have a drum theme to it, impressive but it didn't get my attention unlike the opening.\\n\\n\r\nCharacter: 10\\n\r\nThere are two main character of the anime, Rumi Yokoi and Toshinari Seki.  I like both of the main character and there designed, I got no beef with the character.  They are fun to watch and I have no complaint about the minor character as well.\\n\\n\r\nEnjoyment: 10\\n\r\nI enjoy this anime, I watch it every time when it came out to kill time because I have read the manga and know what going to happen next.  But that don't take away the enjoyment I receive from this anime.\\n\\n\r\nOverall: 9\\n\r\nThe anime is good time to watch, it's only 7-min long and 21 episode plus the OVA and Special is coming out soon and I can't wait for that.",
            "date": "2014-05-29T11:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 144983,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3375025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmazingDaOne",
                "username": "AmazingDaOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=144983"
        },
        {
            "content": "Tonari no Seki-kun: The master of killing time is a charming collection of 7 minute comedy episodes revolving around, as the title suggests, Seki-kun and the mischief he gets up to in the attempt to kill time.  \r\nRather than the story following Seki-kun, it is instead told through the eyes of his classmate Rumi Yokoi who sits next to him in class and this greatly works to the shows benefit. A large portion of the humour of this show comes from Rumi’s interpretation of what Seki-kun is doing rather than what his own thought process is. The ‘Shogi’ episodes in the series highlight thisperfectly as Rumi creates her own story around the way Seki chooses to play the game and she subsequently tries to intervene with the game in order to ‘save’ the characters she made up. To this extent Tonari no Seki-kun is able to do a lot with short episodes and limited dialogue and I find the simplistic yet well implemented animation gives both Rumi Yokoi and Seki-kun fantastic personality without really having an overarching storyline or conclusion. \\n\\n\r\nInitially Rumi and Seki-kun seem like polar opposites, with Rumi wanting to focus on her studies but Seki-kun more interested in passing the time. As the show goes on and Seki-kuns antics are explored further you find that they are not so different after all and many things she accuses him of are things she is guilty of as well, which is subtly conveyed to the viewer not only in the episode but also in its wonderful OP/ED which perfectly epitomises the relationship between the two characters. Both the opening and the ending themes are super catchy and had me watching them each episode even though I had the option to skip. I seriously suggest you watch them if you are unsure about this show as they will give you a decent idea of what to expect from it. \\n\\n\r\nThe musical score in episode is not really memorable but it was used when appropriate and to good effect, so it certainly does not outstay its welcome nor will it make your viewing experience worse. One thing that is of note however is that many of the concepts introduced by the show such as the Shogi games or ‘Robot Family’ gets reused multiple times. With such short episodes and the series totalling at 21 episodes overall I can’t help but feel like this anime would have been better if a wider variety of ‘time wasting challenges’ had been used. That is not to say the Shogi or Robot Family episodes were poorly made, in fact they are some of the best in the series, however reused concepts in such a short series comes off as somewhat lazy to me. \\n\\n\r\nOverall I loved this anime and it is just as easily enjoyed regardless of whether you watch an episode a day or binge through it all in one go. Tonari no Seki-kun is not the gods gift to humanity; it is however a delightful little show that offers a lot in a short space of time. Try it and see because who knows; maybe you will get the same enjoyment out of as I did.\\n",
            "date": "2014-12-22T10:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 173649,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4232841.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rascorpia",
                "username": "rascorpia"
            },
            "url": "https://myanimelist.net/reviews.php?id=173649"
        },
        {
            "content": "Anime series with a short episode runtime often go ignored even when some of them are genius, I find myself feeling happy when I see a different response towards \"Tonari no Seki-kun\" \r\nSupposedly, you're are sitting in your classroom looking at your teacher running his mouth nonstop, it's the easiest to have your attention deflected at such a time even with those minor distractions.What'd you do if the things happening beside you are more interesting than what's going on before you? Could you avoid it? That our Rumi Yokoi for you. \r\nI'll make myself write something brief and prompt for an anime that only runsa little over 6 mins in every episode, as 30 seconds are dedicated to the OP & ED songs. \\n\\n\r\nRumi is the main protagonist and the narrator of the show and Seki~kun who sits next to her is always playing games at his desk. That is pretty much the whole gist there is no real plot, which actually seems to work well here. Humor is mostly delivered through Seki's actions and expressions,exaggeration of events and Rumi's incessant commentary. Even then both characters seems to be likeable and you'll only laugh out loud listening to Yokoi rattle away since the anime mostly depends on it to convey its hilarity.The episodes open to normal games whether it's domino,chess or Shogi but things get more ridiculous with each passing second. The comedy is nice and light hearted. The animation neat and clean considering each episode is so short and such series are mostly low budgeted and focused on content \\n\\n\r\nThere is no music in the series other than the OP & ED and a Robot song, I personally have come to even like the ED and am enjoying listening to the full version. \\n\\n\r\nThere aren't many character interactions as each secondary character doesn't show up more than twice or thrice through out the whole series, their appearances and encounters with the main characters are kept strictly minor. \\n\\n\r\nYokoi's seiyuu is Kana Hanazawa, a renowned voice in the industry (notable roles are Kosaki Onodera and Angel Kanade Tachibana) which is important as much of the humor is in the comical dialogue delivery too. Seki never really talks. \\n\\n\r\nThe anime series is a braincandy and can be watched when your trying to take a break between episodes, seasons or when your thinking of what to watch after you've just finished something. The show proves a point to you that humor can be created without the ecchiness and still be very funny. It's not just a bunch of boob and panty jokes thrown together (Mangaka-san to Assistant-san, I am eyeing u) but the gags are just for laughs so don't judge or take the show too seriously.\\n\\n\r\nThe series is very innovative and gripping, something creative has been done but as a second opinion, Always, the girl however reluctant ends up getting involved in Seki-kun's acts that results in her name getting called out by the teacher, It all comes down to personal taste as some may find this repetitive and boring,So if you find yourself paying more attention to what the teacher is saying instead of what Seki-kun's doing, you're bored of the show, because that's what the show should be doing, keeping your mind off the lesson but I am only speaking hypothetically.\\n\r\nHence, watch it before you windup a conclusion. As for me I felt much enjoyment in watching it. If you get really entertained by the series you'll find yourself chuckling at the ludicrousness of it all, I was never bored and got really consumed in the series I was only disrupted when I had to choose another episode to watch but I really enjoyed my 150+ minutes\\n\\n\r\nI found each episode ending rather quickly but contrary to that I won't be complaining about the length of every episode because even though I am left wanting for more, some things are best left just the way they're, It's an intuition  that the anime is an adaption of a 4-panel comic strip. The run time of the show  is also the reason for it's excellence, because while the characters might feel so underdeveloped to some, having a normal run time would have more character interactions, romantic development but we want to preserve the show's uniqueness, or else it would've drifted away from it's main motive of creating humor, simply humor, ordinary humor, amusing humor, the run time adds to distinguish the show from the other animes. Though this can become a long time running anime series but with short episodes. I hope it comes back soon.\\n\\n\r\nConclusion- when you're looking for ways to kill your time, why not do it in an extravagant manner with Seki~kun, The master of killing time, afterall nobody does it better than him. \\n\\n\r\nThanks for reading it right till the end ^^ if u did, I know I said it would quick.",
            "date": "2014-06-01T01:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 145335,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3657559.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Avmugi",
                "username": "Avmugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=145335"
        },
        {
            "content": "Tonari no Seki-kun reminded me that you don't need the glitz and glamor of today's standards of high budget animation to fully enjoy a show.\r\nKnowing the fact that they did this with limited resources, I'm quite impressed with the result: 21 short episodes, great OP and ED sequence, very likable characters and superb performance by Kana Hanezawa as Yokoi.\r\nEach episode was truly amusing and a pleasure to watch.",
            "date": "2015-01-12T09:15:00+00:00",
            "helpful_count": 11,
            "mal_id": 177539,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185791.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/alcavey",
                "username": "alcavey"
            },
            "url": "https://myanimelist.net/reviews.php?id=177539"
        },
        {
            "content": "In the words of Leonardo da Vinci, ‘simplicity is the ultimate sophistication’.\r\nTonari no Seki-kun is incredibly simple, yet it’s imaginative, creative, engrossing, and funny. It’s hard to believe they managed to make such an enjoyable series from a bunch of 7 minute episodes - although in hindsight the short episodes worked better for the anime than longer ones would have. Just the right amount of time is spent on each of Seki’s antics. It never gets boring, and I think the reason why is that the script is written so cleverly and voice-acted so well. The script-writers managed to create a perfect balance of fascination,annoyance and exasperation on Yokoi’s part, mixed with a tad of resignation to keep it relatable for the viewers. Her reactions to Seki’s time-killing are what makes this series. Kudos to Kana Hanazawa for her superb performance.\\n\\n\r\nSeki’s also a great character. Even without hearing him speak once, his personality is clearly evident through his actions. From the focus he shows when working on each of his projects, to the way his facial expressions change when acting out a story or playing a game, to the way he treats Yokoi, and then the different way he reacts to the other members of his class. All showcase different aspects of his personality and we end up with someone who’s mischievous, curious, and pure. A delightful combination.\\n\\n\r\nSeki’s activities vary in scale. Some are totally harmless (if also totally bizarre), some are merely a nuisance to the people around him, some are ridiculous and some border on dangerous. The most frequently affected victim is Yokoi, who seems both unable and unwilling to turn her attention away from Seki and risk missing out on his next performance. Initially, you empathize with Yokoi, but Seki’s antics grow on you bit by bit and eventually you’re as eager to see what he’ll do next as Yokoi is. There’s no plotline to speak of – Seki’s antics are the plot. There would be no point scoring it on how well the story develops, cos that’s not the point of the anime at all.\\n\\n\r\nMusic is lively and catchy, and art is simple. Nothing flashy or out of place.\\n\\n\r\nEssentially, the anime is just a collection of entertaining shorts about two ordinary people with extraordinary imaginations and a healthy sense of curiosity. I’d give it a watch, it won’t take up much of your time and you’ll probably enjoy it. XD\\n",
            "date": "2018-01-22T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 269364,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=269364"
        },
        {
            "content": "Tonari no Seki-kun : The master of killing time\r\nSo, exactly as the title of this anime \r\nOr they should Yokoi wants to know all her next-seat classmate is doing? ╲(｡◕‿◕｡)╱\r\nWell, it really worked pretty well for me.. For killing time\r\nSo, what's the best time for watching this?\r\nWhen you're resting from doing your homework, waiting for someone/something, while eating snacks, when your TV at commercial break (Don't watch it before you sleep, because you won't sleep after 1 episode )\r\nOk here's a thing if you didn't notice\r\nIt's a 7-8mins short anime or 1/3 time of the usual anime (1 min+ for OP&ED)\r\nWhy I recommend this?\r\nFirst thestory\\n\r\nObviously the story is about killing time\\n\r\nMost of the time they just sit in a classroom while the teacher there\\n\r\nThere is Seki who likes to play something else while the teacher teaching something (Good boys&girls don't do that xD)\\n\r\nAnd there is Yokoi, who's always curious with whatever Seki do, keep watching him & commentating furiously (not really), and regretted it after that\\n\r\nBecause she didn't listen to the teacher's lesson\\n\r\nSimple story yet so interesting\\n\\n\r\nArt?\\n\r\nHmm I have to say nothing special about the arts\\n\r\nBut overall it's good\\n\r\nWhy?\\n\r\nThe expression, especially Yokoi (Well she's the only one who had many expressions) just really really.. make things so interesting\\n\r\nI mean without those face expressions you obviously can't imagine how this anime will going to be.. right?\\n\r\nFor Seki-kun oh well his expressions all went to his \"creation\" effects xD\\n\\n\r\nSo, how about the sounds?\\n\r\nWell voice acting... You need something more than this?\\n\r\nThe voice acting is the one that making things alive!!\\n\r\nHanaKana, everyone's favorite\\n\r\nI'm pretty sure almost all of MAL's people knew her pretty well\\n\r\nShe really did a great job\\n\r\nUsually you'll hear her as a introvert, shy, and a quiet character but adorable\\n\r\nSo, how about this one?\\n\r\nWell her character wasn't really talking loud about all of her \"comments\"\\n\r\nBut still her character obviously not a quiet one\\n\r\nHer voice really made Seki's \"creation\" perfect\\n\r\nWithout her \"tsukkomi\" voice everything just become dull\\n\r\nThank you HanaKana! Good job! xD\\n\\n\r\nSeki-kun, many people said Shimono Hiro just doing nothing at all\\n\r\nBut those guys are wrong\\n\r\nHe's doing something amazing\\n\r\nHis character wasn't not talking at all\\n\r\nBut he's still doing other sounds, like sound effects.. \\n\r\nTbh it's kinda hard sometimes to do something like that\\n\r\nThere'll be an episode that he have to do the sound effects by his own voice.. only his voice\\n\r\nHe really did a great job! I mean really, you'll see later\\n\\n\r\nOP&ED\\n\r\nOP is sung by HanaKana, the lyrics are reflecting Yokoi's feelings\\n\r\nED just an instrumental+some gibberish by some student's tools (ex : pencilcase, pencil, \"lab glass\")\\n\\n\r\nCharacters...\\n\r\nWell\\n\r\nLet's start from Seki\\n\r\nA boy who didn't like studying in a classroom at all, so he brought all of his toys to the classroom\\n\r\nHe's playing with them while his classmate looked at him (I think he's planning this xD)\\n\r\nAnd Yokoi\\n\r\nBecause Seki's \"creation\" need someone's reaction to make it alive\\n\r\nThey way she made the \"comments\" are way too hilarious, you can't deny her way to make them\\n\r\nHer voice too full of expression too, so you're bound to laugh / just grin widely\\n\\n\r\nFor both of them\\n\r\nWell I don't really know myself\\n\r\nBut, I really shipped them even if there's no romance at all\\n\r\nI mean if you're watching them till the end, you know they're really adorable together\\n\r\nThey have some kind of \"red strings being tied together\".. Right g-guys?\\n\\n\r\nIt's a short anime, but it's really interesting\\n\r\nWhen I'm watching this, I just felt it's just one or two minutes\\n\r\nThat means, if you're really enjoying something, your sense of time just *poof.. Gone xD\\n\\n\\n\r\nTL;DR\\n\r\nWhy don't you try for yourself the first 3 episode?\\n\r\nIt's just 21 min, the same time like 1 episode of a \"normal\"\\n\\n\r\nThank you for reading my review \\n\r\nHope it helps you\\n\r\nI really like short anime like this\\n\r\nHow about you? You like it too?\\n\r\nPlease tell me by adding me and write it to me in my comment section :)",
            "date": "2015-09-04T07:37:00+00:00",
            "helpful_count": 9,
            "mal_id": 197798,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1573347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rayl1ght",
                "username": "Rayl1ght"
            },
            "url": "https://myanimelist.net/reviews.php?id=197798"
        },
        {
            "content": "Here's my take after watching 21 episodes of the fun and time killing : The Master of Killing Time by Shin-Ei Animation Studio.\r\nHow should I put this...\r\nTonari no Seki kun is great take on an enjoyable way to kill time. Since each episode is just around 7 minutes it is easy to watch on your phone while on the go and it does not try and stretch itself that the story or \"period\" becomes laggy. \r\nBut don't be thrown away with the running time since it remarkably retains the essence of the story, the tension it brings and the laughs that makes you break outit laughter. \\n\\n\r\nThe story mainly revolves on the quirky and playful Toshinari Seki and his curious observer/forced participant class neighbor Rumi Yokoi.\\n\\n\r\nEach episode is a period in their class and is a story on itself. During each of those periods Seki is doing different ways to kill time like: toppling a chain of eraser domino, playing weird shogi, buffing his desk and my personal favorite playing with his robot family.\\n\\n\r\nThe story does not take itself seriously and that is what is great about it!\\n\\n\r\nThe art is good enough to make the characters and the story to take the lead of the story and the music is fun and catchy, especially the ending song.\\n\\n\r\nYou would not regret watching Tonari no Seki kun and you might be addicted and binge watch all episodes in one sitting. But if you end up doing that and want more you can continue reading the great manga of the same name by Takuma Morishige as it has currently have 73 chapters and still going.\\n\\n\r\nWith that said, I will give Tonari no Seki kun 9 shogi pieces out of 10!",
            "date": "2017-11-10T17:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 262959,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6582532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jmsjrdn",
                "username": "jmsjrdn"
            },
            "url": "https://myanimelist.net/reviews.php?id=262959"
        },
        {
            "content": "Tonari no Seiki-kun is a fantastic anime. The idea of having the episodes set on a class, in which there is a girl who keeps watching her colegue entertain himself during the class on many different ways, is really clever and well done.\r\nThe episodes are around 10mins each and it may seem pretty small but you get the full enjoyment of a \"saturday morning sit on the couch watching cartoons as kids\" type of feeling.\r\nIt's really nice watching the various activities Seiki does during class, for example watching him making epic war scenarios out of small little food.\r\nOverall it is a fun series to watch,fast to watch and totaly worth checking out.",
            "date": "2014-10-15T22:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 164961,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3801257.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Brav0",
                "username": "Brav0"
            },
            "url": "https://myanimelist.net/reviews.php?id=164961"
        },
        {
            "content": "Tonari no seki-kun is that anime which you would simply fall in love with .Even if you are in despair because your favourite character died in some random anime you have been watching or even if you have a list of hot mainstream anime in your list which you haven't watched, still I can guarantee you this will keep u busy, interested and will completely cope your mind in finding more time to watch it and see it throughout till the end.\r\nStory:\r\n The story revolves around a girl named Rumi Yokoi and her classroom neighbour Seki-kun, who never seems interested in class and does somany random things to keep himself from being bored. But these out-of-the-blue things which he does constantly keeps Rumi bugging as she wants to study yet in the same time they are so interesting that she finds herself coped in them.\\n\\n\r\nArt,Sound & Character:\\n\r\n I simply loved the art (not so great but just enough to digest).\\n\r\nThe opening is one of my favourites which i never skipped.\\n\r\nAs for Seki-kun ,he does'nt has a voice character, yes u heard me right ,he does'nt says even a single word throughout the series but the surprise is you will never find it necessary, yes the story is written that beautifully.\\n\\n\r\nI have rated it 9 for the sake of other really awesome anime I have watched but for a more accurate view , I would rather give it a 9.5.",
            "date": "2018-05-21T02:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 281067,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7122015.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/blank28_",
                "username": "blank28_"
            },
            "url": "https://myanimelist.net/reviews.php?id=281067"
        },
        {
            "content": "This is an anime that doesn't really have a plot. It is full of hidden puns, and is very creative.\r\n  I started to watch this because I was bored. My friend told me about it, and said it would help me get back into the \"anime-watching-mood\". Turns out, she was right. This anime is very light and carefree, but also shows how some kids view school. \r\n  The op for this anime is very unique too. It sets up the tone of the show, and kind of helps the watcher know what to expect. The characters, though not developed too much, fit theshow and it's \"plot\". In my opinion, they make the show funnier.\\n\r\n  I would recommend watching this if you are in the mood for some laughs or short entertainment. The episodes are pretty short, I think about seven minutes, but I like to re-watch them between classes or when I have a break.\\n\\n\r\nHope this helps,\\n\r\nESL",
            "date": "2016-03-11T11:41:00+00:00",
            "helpful_count": 7,
            "mal_id": 212691,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675889.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Emeris_Lochart",
                "username": "Emeris_Lochart"
            },
            "url": "https://myanimelist.net/reviews.php?id=212691"
        },
        {
            "content": "Tonari no Seki-kun has episodes\r\nthat average around 7 minutes\r\nlong in length ... but don't let the\r\nlength fool you into disregarding\r\nthis anime as having no plot. Each\r\nepisode consists of Seki bringing\r\nhis newest distraction of the day\r\nwhile Rumi attempts to ignore\r\nwhat's going on next to her,\r\nfailing every time as she finds\r\nherself drawn into what he's\r\ndoing. The plot for each episode\r\nwas wonderfully done and\r\nimmensely entertaining! xD The\r\ncharacters basically consist of\r\nRumi and Seki with the occasional\r\nappearance or comment from a\r\nclassmate ... both of the main\r\ncharacters were wonderfully\r\nentertaining. It was a wonder to\r\nme how entertaining Seki was\r\neven though he never said a single\r\nword ... not in any of the 21\r\nepisodes!The animation was nice,\\n\r\nnothing spectacular, mind you,\\n\r\nbut nicely done all the same. All in\\n\r\nall I very much enjoyed this\\n\r\nanime! Every episode brought a\\n\r\nhuge smile to my face and even\\n\r\nthe occasional laugh! I very much\\n\r\nrecommend it!",
            "date": "2014-11-12T19:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 168381,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=168381"
        },
        {
            "content": "Tonari No Seki-Kun may be the funniest anime I've watched since starting Gintama. That is saying a lot, since the episodes are quite short at about 7 minutes long, but that is plenty of time for this anime to tell an effective and hilarious story.\r\nStory: 9.5/10\r\nShort, sweet and to the point. Seki-kun's antics and Yokoi's great imagination and creativity are so entertaining to watch. They use the best methods of storytelling with Yokoi's expressive narration in combination with Seki-kun's almost exclusive use of physical comedy to tell creative tales of love, hardship and determination using common toys and games. They are such simple stories, butI haven't laughed so much watching an anime in so long. You cannot help it when you see how ridiculous Seki-kun and Yokoi can get. The only thing keeping this anime from getting a 10/10 was that they occasionally repeated \"toys/games\", but the seeing these toys/games again may have been funnier than the first time around. \\n\\n\r\nArt: 10/10\\n\r\nSound: 8/10\\n\r\nNot much to say about the art...it's awesome. Love the use of colour scheme in the different stories. They used sound clips pretty well to add from the scene but I find that I didn't pay attention much to the sounds as I was so caught up in Yokoi's storytelling. But a majority of this score goes to the opening and ending themes; catchy and unique. \\n\\n\r\nCharacter: 9/10\\n\r\nYokoi's imagination makes the show what it is, as Seki-kun barely (if not ever) speaks in the series. Her interpretation of his behaviour is hysterical. Despite not speaking, Seki-kun's physical comedy is second-to-none. He comes up with such imaginative ways to play and mess around during class. I won't reveal these next \"characters\" but these 3 little guys stole any episode they were in. Seki-kun's interaction with these 3 \"characters\" really made them my favourite  secondary characters despite never speaking either. \\n\\n\r\nEnjoyment: 10/10\\n\r\nOverall: 10/10\\n\r\nI think it is obvious how much fun I had watching this series. It is an easy series to get through and so is definitely worth watching. I  really hope there is another season or 2 because I just can't get enough of this classroom fun.",
            "date": "2014-05-25T16:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 144521,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3300487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokyoCrazyPXD",
                "username": "TokyoCrazyPXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=144521"
        },
        {
            "content": "Story - 9/10\r\nArt - 10/10\r\nSound - 9/10\r\nCharacter - 9/10\r\nEnjoyment - 10/10\r\nTonari no Seki-kun is a outstanding anime. I couldn't stop laughing watching the 1st episode at least.\r\nI like the 1st Episode , Shogi's Episodes and Robot Family's Episodes the most.\r\nI didn't even realize that i have already complete the whole series. The episodes were short but the most enjoyable anime i have ever watched.\r\nThis show must be 7.66 rated  because of the short duration of the episodes.\r\nThis show should be 8+ rated at least.\r\nPros - Enjoyable Comedy.\r\nCons - There will be 2-3 episodes which are not enjoyable.",
            "date": "2019-02-17T08:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 301860,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7463537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sanchit_Jain",
                "username": "Sanchit_Jain"
            },
            "url": "https://myanimelist.net/reviews.php?id=301860"
        },
        {
            "content": "This anime was really enjoyable from the start to the end, It's basically a 7-min-per-episode kinda anime, but that's actually perfect, couse that's all ya need for doing this kind of thing.\r\nThe episodes are really fun, watching Yokoi's mindfucks over Seki's things is always hilarious. The art-style is extremely simplistic but it's good in it's simplicity. The opening isn't bad, but the ending is really good, I usually always stayed till the end just to dance to the ending.\r\nNow for the recommendation thing I always do... This is that kind of anime that you watch once in a while when you're bored just to killtime (oh the irony), so... if you ever find yourself in one of those moments, kill that time with Seki, you won't regret it",
            "date": "2015-12-17T11:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 205825,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205825"
        }
    ],
    [
        {
            "content": "One of the things I learned as I studied comedy writing throughout my youthful years, find a creative way to craft the same joke to tell it as many times as possible. Tonari No Seki-kun has one job and does it very well. A show with such a direct premise manages to have me asking many questions.\r\n STORY: I admittedly did little research on The Master of Killing Time prior to watching it, so I was curious to see how it would manage to sustain its humor for 21 minutes. I later learned each episode runs 6 minutes, opening and closing credits. And it's great.Each project is paced the same, which starts with Rumi Yokoi, the female lead and Seki-kun's seating neighbor, believing it's going to be a normal class, only to be distracted by whatever it is Seki begins constructing as she interprets/narrates the scenario. Now the magic I discovered is that you get pulled in as much, if not more, than SHE does! It's quite amazing! Seki-kun will pull out dominoes, mecha bots, a rack of glasses, and I'll find myself trying to guess ahead of Rumi, thinking, \"Where could this possibly go?\". And no two scenarios are the same, so each of Seki-kun's contraptions are as much a mystery as the previous episode. This show gets so much out of such a small amount of time, it's a perfect example of less can be more. SCORE: 9/10\\n\\n\r\n ART: The palette and animation are very pleasent, yet simplistic. Produced by Shin Ei Animation (Doraemon 2005 and Hare+Guu, two other delightful anime I adore), they capture the spirit of the manga well in terms of comedic timing and execution while also having a delightful aesthetic adjacent to the aforementioned anime. The physical gags aren't incredibly over-the-top or disrupting, as Seki-kun's satiristic pacing calls for more of a rising crescendo with a payoff at the end. Not overly demanding and fairly easy on the eyes. The character designs are not very complex, though there is one thing I'd be remiss if I didn't mention: Rumi Yokoi's oddly colored white hair. She's a cute girl and certainly gives her a very distinct look. Not many teenagers in anime simply have white hair without some cryptic reason or mythos behind it. Different is good, but it certainly caught me off guard. SCORE: 7\\n\\n\r\n SOUND/VOICE ACTING: As I'm reviewing the Sentai Filmworks, I'm discussing the English dub. This is Blake Sheppard's easiest paycheck ever. He \"voices\" Seki, but I use that term loosely, because Seki never actually speaks. Other than audible grunts and murmuring, he doesn't emit a single word of dialog. It's impressive, to say the least. \\n\r\n Rumi Yokoi is Voiced by Monica Rial, who I've been critical of for just kind of being default anime voice actress woman. Over the span of her career, none of her roles jump out at me as impressive or notable, even when voicing comical characters, she's just decent, if not outshined by Laura Bailey or Karen Strassman. Her performance as Rumi isn't really different from her performance as Bulma or Kirika from Noir. She puts an energy into narrating Seki's madness she's attempting to translate that I can appreciate, as it's essentially a one-woman performance. Her inflection ranges as Seki-kun's playlets unfold through various emotions, from curious, apoplectic, amused, to frightened. It's my favorite Rial performance. SCORE: 8/10\\n\\n\r\nCHARACTERS: I've pretty much already covered the characters' throughout, so I'll just talk about talented Seki is. I know it's a work of fiction, but from one school hour day dreamer to another, Seki's creations are really cool and easily the reason I latched on to the series. He's got laser focus for everything he constructs and shows a pride in it that's almost admirable. It makes me wonder if he goes home, planning on what he intends to bring to school the next day. And with several exceptions, he's mostly amusing himself. There's instances where he's completely aware Rumi showing interest, but it's sometimes ambivalent as to whether he's put off by her efforts to dissuade either his works or the outcome of the tales he's telling. Again, so much is derived from how little they give you, it's fascinating. SCORE: 8/10\\n\\n\r\nOVERALL: Tonari No Seki-kun is an enjoyable, effective, creative comedy with a formula that works. I can't immediately think of anything to compare it to, but it really hearkens back to my days of goofing off and not taking notes during class. Each episode is an ever-increasing drumroll that builds and builds. FINAL SCORE: 8/10\\n\\n",
            "date": "2017-06-01T17:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 249072,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210239.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Colonelfancy",
                "username": "Colonelfancy"
            },
            "url": "https://myanimelist.net/reviews.php?id=249072"
        },
        {
            "content": "this anime is awesome. the story is very simple but very enjoyable. for me the characters were very well set also the creativity used is amazing. how the main character used simple tools and imagination to get rid of boredom was amazing.this one is a must watch. the art was very good too and soundtracks were right on.The comedy in Tonari no Seki-kun is contrasting the absurdity with the mundane. The juxtaposition between the mundane classroom and worries of Yokoi, the distracted girl, and the fantastical absurd creations of Seki, the dude next to her, go a long way to drawing out the inherent humourof his actions. Making a joke about the crushing fear of driving tests is made funnier when presented as someone’s tabletop construction, doubly so when the nervousness is entirely of his own creation. It would be very easy for this formula to base all the jokes around how random the activity Seki is doing because lol random nichijou is my favourite anime ever because I have no concept of what constitutes humour lol random etc. That’s how a fair number of the jokes start out, but they work because of how Yokoi gets invested in the story being built on Seki’s table. She starts trying to ignore him but then gets invested and often actively involved in proceedings. Throwing random shogi at his creation to dramatically change the narrative Seki is building and other such acts make her an active participant in the story and draws the two of them together in a silent war. well that's it for my first review i hope you find it helpful.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-05-28T13:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 248746,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6252113.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/luffy12231",
                "username": "luffy12231"
            },
            "url": "https://myanimelist.net/reviews.php?id=248746"
        },
        {
            "content": "Tonari no Seki-kun is a 21 episodic short anime that focuses about Seki-kun's weird killing time during classes. Usually, instead of doing something productive like reading or writing notes, he instead plays and entertains himself just for fun. And as Seki-kun is busy on what his doing, his seatmate, Rumi, got herself distracted thanks to Seki-kun.\r\nThis cliche goes on and on from start to finish. But in every episode, Seki-kun has different tools and equipments, and toys to play with his desk. And Yes, it's indeed entertaining to watch too... for just 7 minutes (times 21... and you'll get 147 minutes of school comedy momentsof watching Seki doing weird plays on his desk!)\\n\\n\r\nThe setting for the plot is only focuses on one classroom (sometimes on the pool of their school).\\n\\n\r\nThe art of this anime is like I'm watching a remastered version of the 90s-2000s art form of this anime. But it's good nonetheless.\\n\\n\r\nThe Sound, is good. From VAs, to the fun OP song of Rumi's rapping to slow but fun melody. The ED song though... mmmm... Not so good.\\n\\n\r\nTonari no Seki-kun is really entertaining to watch and Seki's character is always bringing his tricks under his sleeve just to entertain himself, while Rumi is also entertaining herself too but she always gets hooked everytime Seki bringing his Toys to the School. Rumi sometimes help him but only in desperate times. For Seki, he's just a quiet guy with a childish personality.\\n\\n\r\nWith that being said, this anime is good and it is recommended to watch this anime! Just... don't expect to have some love story chemistry because this anime is just plain slice-of-life, comedic anime about Seki's killing time during boring lectures.\\n\\n\r\nClass Dismissed...",
            "date": "2016-05-24T14:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 219252,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4618412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VaasMontenegro",
                "username": "VaasMontenegro"
            },
            "url": "https://myanimelist.net/reviews.php?id=219252"
        },
        {
            "content": "In my neverending search for hyperbolic comedies, Tonari no Seki-kun is the latest in a long line of searches. Japanese anime just seem to have a large supply of such exaggerated humor. From Gintama to Plastic Neesan to Azumanga Daioh, anime never seem to run out of ways in making people laugh through the most ridiculous antics of cartoon characters.\r\nUnfortunately, as we know well enough, quantity doesn't necessarily equate to quality.\r\nTonari no Seki-kun has a very simple premise, so simple, in fact, that one could sum it up in a sentence: Seki's fooling around in the classroom distracts his classmate Rumi. While simplicity can beeffective in storytelling, there are often the case where simple equals blend or even formulaic. The relationship between Seki and Rumi is a cliched one: idiot meets straight man (or woman), the classic 'boke' and 'tsukkomi' play. While I highly enjoyed this form of comedy in Gintama, there's just not enough of the straight man (tsukkomi) act in Tonari. In fact, at the end of most episodes, Rumi ends up being just as much of a fool as Seki himself due to his influence. The reason the boke and tsukkomi act works so well is because you have the straight man pointing out how idiotic the fool's action is, thus relating to the audience and making a connection (almost laughing along with the audience even). But when you see two idiots fooling around together, it comes off as merely eye-rolling than humor-inducing. Such is the case with this anime, where I merely giggled along at the novelty of the concept at first, then quickly becoming bored and awaiting the end to come after only a handful of episodes, almost dropping the series altogether at one point.\\n\\n\r\nBut even without a proper tsukkomi, if Seki's actions are hilarious enough, then it should've generated much laughter from me. Unfortunately, this is not the case, and what Seki does (especially in later episodes) isn't what I would call comedy, and more like \"impressive acts a teenager is normally incapable of\". In my previous reviews, I've talked about the connection between surprise and laughter, a link that's very significant in the world of boke and tsukkomi, where our laughter is spurred from the abnormal actions of the idiot that no ordinary person would perform. The bigger the shock factor of the resulting comedy, the bigger the laughs. This is the main reason why Tonari falls flat (with a splat) as a comedy. Rather than show how stupid Seki's actions are, it not only focus more on Rumi's feelings towards his actions, it portrays his acts as the normal actions of a mischievous boy performing impressive feats in class. While some of Seki's actions were silly enough to be funny at first, that silliness soon dials down into \"Look how talented I am, Rumi!\" Boring.\\n\\n\r\nBut what about observing the charming and innocent interaction between these two kids? Surely, such charm would be enough to keep you engaged? Nope. These two kids are just as unlikable as any annoying kid you know of. The relationship between Seki and Rumi reminds me of the one between Mio and Ritsu in K-On!, another anime I didn't enjoy because of the eye-rolling interactions. Both relationships cause a certain amount of humiliation and inconvenience on the straight man. This is fine when the comedy is exaggerated, because the actions we are seeing are portrayed in such a ridiculous way that we know that none of the harm the characters suffer is as bad as it seems and was probably exaggerated as a visual gag (see Gintama). But when you play it straight and make the comedy more subtle, thus making the scenario feel more realistic, it make it seem like the idiot really did all those horrible things on another person, whether it's forcing a girl to dress in skimpy and sexually suggestive costumes (K-On!) or getting your classmate in trouble, neither of which are remotely funny in real life situations. If anything, you're just asking to be beaten up. And poor Rumi isn't any better. She could have reported Seki if she wanted to stay out of trouble, but not only she didn't, she joined in his childish antics during class. The victim here is practically asking for it, and she more or less deserves all the trouble Seki got her into.\\n\\n\r\nSo the comedy's humor falls flat, and the characters are unlikable. If there is one thing I did like about the anime, however, it's the ED theme. The ending song is a fantastic mix of jazz and percussion. It shows Rumi observing Seki as he hit on various objects that produce the percussion you hear. It's energetic and fun, almost bearing resemblance to the jazz themes of older anime. The thing I liked the most about the ED is that (aside from the jazz), the ED made the music seem like it's part of an episode, which gives it that bonus spark of creativity you don't often find in ED or even OP  themes. While Seki didn't manage to impress me with his brand of comedy, the ED, the only good thing about the anime, ironically did.",
            "date": "2018-04-15T00:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 278119,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331516.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RyderFlynn",
                "username": "RyderFlynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=278119"
        },
        {
            "content": "Ah, Tonari no Seki-kun or as in English, The Master of Killing Time is a rather short series with quite the amount of episodes. The show is about a girl (Rumi Yokoi) who sits a few inches away from Seki-kun, the master of killing time in multiple classes and narrates his actions as she watches him goof off. I admit it sounds incredibly boring to watch, but after getting 3 to 4 episodes in I was actually genuinely interested in what Seki-kun was going to pull out of his bag. Yokoi (and a few other characters) over exaggerate everything Seki-kun does which honestly makes theshow a bit more intriguing to watch and not entirely dull. Basing this off of the animation, story telling, sound, & personal enjoyment, I give Tonari no Seki-kun: The Master of Killing Time a 7/10. It wasn't great yet it wasn't bad, it kept you interested long enough to make you want to binge watch the rest of the series. I recommend watching it if you haven't already, overall it was a pretty decent anime. Crossing fingers in hopes that they make a second season. I'm looking at you, Shin-Ei Animation.. e.e",
            "date": "2015-09-26T22:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 199773,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3944611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tulsi",
                "username": "Tulsi"
            },
            "url": "https://myanimelist.net/reviews.php?id=199773"
        },
        {
            "content": "Rate an 8\r\nEnglish Dubbed\r\nLaugh,smirk,cry,growl... you can't escape curiosity. As much as something can annoy you it can also amuse you. Maybe it stems from childhood on jealousy of things you missed out on. Or maybe it is primal in terms of wondering if danger lurks near. While the cause remains a mystery your joy is guaranteed here. Come and sneak peaks of the wild side. Embrace your emotions.\r\nThat is the kind of optimism provided in the show. While school is about structure and learning it does rob of us of our time and souls.\r\nAs for the ending it is entirely what you would expect anda little bit of what you wouldn't. A good ending but was justice fitting or blind? You decide.\\n\\n\r\nArt\\n\r\nA good mix of alternation. Since this show is about constant change due to the constant boredom the main character is faced with. \\n\\n\r\nI really enjoyed how the main male character and female were both able to express their feelings without much in spoken words. In fact i don't think more than 7 words were spoken by the main male character. Not really amazing until you consider how big his part is in the show. I know for me i would be in trouble. My biggest skill is with words. For words are a strong foundation to explanation. To remove them is to deprive me of my legs. I can get around but it will be difficult.",
            "date": "2017-08-11T16:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 255215,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227232.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sidewinder51",
                "username": "Sidewinder51"
            },
            "url": "https://myanimelist.net/reviews.php?id=255215"
        },
        {
            "content": "Story:\r\nAs simple as it is, it's completely entertaining the whole way through. Everything is fun along with its ridiculousness, and there wasn't a point where I wasn't excited to see what Seki was going to do next. Wasting time can be a LOT of fun!\r\nArt:\r\nDecent enough to do its job. It's not the greatest art. In actuality, it feels like a simple, bare-bones quick drawn animation that has no faults but doesn't strive for excellence. It doesn't detract from anything, so it's not bad, but it's something that could have had a little more focus.\r\nSound:\r\nFun music, but it's all quite repetitive. From beginning to end,you'll have heard every song more times than you can admit. They're not bad songs, and they help make things real fun, but it could have been a little more varied.\\n\\n\\n\\n\r\nCharacter:\\n\r\nThere isn't a lot of character to anyone in Tonari no Seki-kun but it's not as though this takes away from the experience. In fact, had the narrative pursued anything resembling a normal human being, a lot of the fun would have been sucked away. The pursuit of simplicity makes for shining excellence, and there's definitely a lot of fun in the simple, 2-dimensional personalities of Rumi and Seki. All of it is believable within the established realms of these characters, too.\\n\\n\\n\r\nEnjoyment:\\n\r\nAlthough I wasn't laughing out loud, I was definitely finding each and every episode enjoyable. The antics of these characters and their ability to think of the impossible made for a spiritual journey. Well, perhaps not nearly as cathartic as that, but it definitely was a ton of fun. Trust me!\\n\\n\\n\r\n((If you liked this review, check out my other reviews by going to my profile and clicking the 'reviews' tab. I review virtually all anime and manga I find!))",
            "date": "2016-08-16T19:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 226903,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655715.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Paraturtle",
                "username": "Paraturtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=226903"
        },
        {
            "content": "I had Tonari no Seki-kun or 'My Neighbour Seki-kun' on my PTW for a while and never got around to it, because from the thumbnail and the All-Ages rating it seemed like kid's comedy which doesn't exactly interest me, even though it had a Seinen tag. So when it (surprisingly to most) got a dub, I decided to finally watch and I was pleasantly surprised to say the least. This series is just a collection of episodic 7-minute school-comedies which follows a formula, but is done as well as I could ever imagine and enjoyed almost every minute of it.\r\nPlot\r\nWell, let's face it, there isn'tone, and for most things a low plot rating would be a bad thing, but for this it doesn't aim to have one therefore cannot penalise it too much. There is no over-arcing story or really much of a story in the individual episodes either, it simply follows a formula: Seki-kun does something distracting in class, Yokoi notices and watches him play with his ever-changing supply of entertainment, sounds boring but is surprisingly entertaining with the little twists they put on it and how they personify those items, Shogi pieces ,for example, felt like actual characters with personalities but in reality... are Shogi pieces.\\n\r\n[Overall 2/10]\\n\\n\r\nCharacters\\n\r\nThere are only a few characters in this series, but mainly only 2, Seki-kun, which does not utter a word the entire series, and Yokoi, who also does not talk much but is shown through her point of view and her reactions and thinking, mostly what you will be hearing is what Yokoi is thinking and saying in her head, which for one, is a pretty original concept, there is very little character interaction but I still really liked the characters, with Yokoi being voiced by Monica  Rial in the dub, this wasn't a hard thing to do. There are also a couple other characters, Yokoi's friend or hopeful friend Gotou, which takes over for Yokoi in an episode or 2 as the main perspective and the ever-changing teachers which will normally be talking in the background but very rarely be important to what is going on. These characters aren't exactly developed but that isn't really an issue for this show either.\\n\r\n[Overall 7/10]\\n\\n\r\nExecution\\n\r\nAs I mentioned in the first paragraph, this anime  is executed extremely well, for what it was doing and how minimalistic it was: few characters, episodic, one point of view, little-to-no dialogue or character interaction, it did this as well as possible, the only reason I cannot give it a 10 is because there were a few episodes out of the 21 episodes which weren't very good nor I enjoyed, but most of them were great and highly enjoyable.\\n\r\n[Overall 9/10]\\n\\n\r\nSound\\n\r\nMusic\\n\r\nThe soundtrack is nothing special but fits the mood and theme well, not exactly memorable but is good for when you are watching it.\\n\r\n3/5\\n\r\nVoice Acting\\n\r\nAs I previously mentioned, and for most things, I watched the dub for this, and boy am I glad I waited for it (even if I didn't expect there to be one). I'm glad I watched this with Monica Rial as Yokoi, her being one of the my favourite voice actresses anyway and her energetic performance, I thought was perfectly casted as the over-reactive main (speaking) character, for the rest, well Seki-kun barely says a word and the rest of the minimal supporting cast was also good, but Monica Rial very easily stole the show and I couldn't imagine Yokoi not voiced by her.\\n\r\n5/5\\n\r\n[Overall 8/10]\\n\\n\r\nArt\\n\r\nThe art is simple and nice, fits with the overall feel of the show, it was nothing overly amazing but it really didn't have to be, nor ruined the show in the slightest.\\n\r\n[Overall 7/10]\\n\\n\r\nEnjoyment\\n\r\nThis series was very entertaining from start to finish, ignoring any 'dud' episodes, and was not a task to watch in one-sitting, the way they were able to give Chess pieces or toys such a personality without them even moving or saying a word was pretty fascinating, my favourites episode(s) were probably the Shogi ones for that previous reason and the Transformers ones as they were the funniest, especially the last episode, this series is guaranteed to keep you smiling and won't keep you 2 minutes from laughing, one of the best feel-good series I have seen.\\n\r\n[Overall 9/10]\\n\\n\r\nOverall this series was a surprising one, and although did not try many things, what it did go for they absolutely nailed, and for that I am impressed.\\n\\n\r\nOverall enjoyment of the series: 8.1\\n\r\nRaw Quality of the series: 7.0\\n\\n\r\nOVERALL SCORE: 7.5\\n\\n",
            "date": "2016-04-11T17:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 216162,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3529023.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/rockstarrzz",
                "username": "rockstarrzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=216162"
        },
        {
            "content": "Rly good Native reverse isekai with an interesting plot\r\nSeki is a great character with really good qualities that kept me interested throughout the show. It was also rly fun to watch as the two slowly got along. Sometimes the show tries to do the same concept in multiple episodes but they end up pulling it off in the end luckily, Such as all the Shogi episodes.The characters are all drawn in expressive ways which is really nice. The ending theme sounds really good too so that's great. Overall this show is just extremely enjoyable with each episode having an interesting idea behind it.",
            "date": "2018-10-22T19:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 292356,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6487747.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ClearlyKumoko",
                "username": "ClearlyKumoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=292356"
        },
        {
            "content": "Tonari no Seki-kun, a show which dares to be open as an absurdist, one which i wouldn't even guessed could find it's way to the anime world, it does it's job so smoothly in the story telling and the fact that \"you don't even need a story line to execute enjoyment and productivity and creativity\" that you ask yourself, how? how it can be so funny and creative at the same time with the pilot around Seki-kun and Yokoi spending 90% of all the anime in a classroom staring at Seki-kun's desk. but when you see all of this come up together, with an actualgood art and music and sounds, it simply interprets itself as probably one of the best comedy experiences in anyone interested in story telling matter.\\n\r\nSo yeah, I'll truly miss this unique experience while keep living in world which seems like it doesn't really get the difference between comedy and good comedy anymore",
            "date": "2018-10-06T12:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 291062,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6635745.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SinaGfsh",
                "username": "SinaGfsh"
            },
            "url": "https://myanimelist.net/reviews.php?id=291062"
        },
        {
            "content": "This anime is a slice of life comedy about two students in a classroom: Rumi Yokoi, a studious girl trying to pay attention to the teacher, and Toshinari Seki, a boy paying no attention to the teacher who plays around through every class.\r\nEach episode, Yokoi is distracted by Seki's latest game, whether that be a twisted version of Shogi or him playing around with a toy robot family, with each scenario ending up with Yokoi completely absorbed in watching to see the humorous outcome. Each episode is 7-8 minutes long, just over 5 minutes if the intro and outro are removed (not that you'd wantto remove them). It's great for brightening up your day, whether you've got 10 minutes to spare on an episode or 3 hours to binge the lot.\\n\\n\r\nTonari no Seki-Kun is a must-watch for veterans and newcomers alike, and its rating of 7.67 is criminally low. Do yourself a favour and go and watch this anime. Do your friends and family a favour and get them to watch this anime. Do the world a favour and rate this anime higher than a goddamn mediocre \"good\", because it deserves so much more. This may not be the show you deserve, but it's the one you need right now!",
            "date": "2018-09-30T09:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 290504,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ForgottenSoul",
                "username": "ForgottenSoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=290504"
        },
        {
            "content": "First of, if any show entertains me while I'm watching it, without me ever checking to see how much time is left on the episode, i think it deserves a 10 in entertainment, and since the purpose of anime is primarily to entertain, than any show that entertains is a 10.\r\nAlthough this show was entertaining, it was ultra episodic, and each episode was 8 minutes long, which means nothing changed over the course of the show. The show did hint at some romances, like having Yokai's friends think she was freaking Seki, and at the end had the teacher investigating yokai's family, but none ofthese plotpoints were followed up.\\n\\n\r\nThe characters are simple, and they don't have complex motivations, but that doesn't ruin the show, i think that just limits its creators.\\n\\n\r\nI do really like the OP\\n\\n\r\nOverall, I would be much happier with the show if somehow the situations of the characters in their day to day lives changed over the course of the show. I would love to see the relationship between Yokai and Seki investigated a little more because they aren't friends or intimate, they are just desk mates.\\n\\n\r\nI highly recommend watching at least one episode",
            "date": "2018-09-20T19:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 289538,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7361174.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hihg",
                "username": "Hihg"
            },
            "url": "https://myanimelist.net/reviews.php?id=289538"
        },
        {
            "content": "Story: there really isnt much of a story too it to be honest just about seki fooling around in a classroom and rumi getting caught off guard by him and his actions per say\r\nArt: nothing bad about the art was good\r\nSound: same as art nothing bad about it\r\nCharacters: with this you really don't have a whole lot with this anime i remember only really seen 3 characters really into this anime rumi seki and Sakurako\r\nEnjoyment: i did this anime like a month or 2 ago but i remember loving this anime a good alot maybe saying that is a stretch somewhat but i personally likedit\\n\\n\r\nOverall: im giving this a 8 because at a few parts of this anime the comedy wasnt there for me but personally i hella loved this anime for real got a very good number of laughs out of me",
            "date": "2016-08-29T01:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 227854,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=227854"
        },
        {
            "content": "Looking for something short, that'll cheer you up?\r\nWell, look no further.\r\nTonari no Seki-Kun is an anime that's far from spectacular. Although, every episode leaves me in stitches. At the time of this review, I have only watched 7 episodes, though I expect the anime will have the same content throughout. \r\nThe story is thoughtless. As the synopsis states, it's a dude doing various elaborate activities during class and not actually studying whatsoever. You never know what each episode will bring. What will he do? Play dominoes? Make eraser stamps? Polish his desk?\r\nNow, I know this anime sounds boring. But, trust me, Seki-Kun seems to makeeverything enjoyable and hilarious. There isn't an episode that I haven't enjoyed or laughed at. What's even better is that the show is only 7 minutes long and has 21 episodes. And then there's Yokoi, the girl at the desk next to him. Her reactions are priceless. She's the stereotypical study girl who's reactions are huge and so funny. \\n\\n\r\nMy ratings (as of episode 7):\\n\r\nStory: 7\\n\r\nArt: 8\\n\r\nSound: 7\\n\r\nCharacter: 7\\n\r\nEnjoyment: 9\\n\r\nOverall: 7",
            "date": "2017-04-12T03:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 245303,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6145035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Betsyspaniel",
                "username": "Betsyspaniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=245303"
        }
    ]
]