[
    [
        {
            "content": "ok..this is my first review in MAL webpage..the reason why i write this review because i want to let everybody know that this anime is quite gud for patience viewer.\r\nMuv Luv Schwarzesmarken take place way before the Muv Luv Total Eclipse. In addition to B.E.T.A invasion (slightly ugly than titans in AOT if u ask me) they add in some history plot like during the Cold War era , the splitting within Germany between West n East etc. To fight this SOB , eishi or we called as pilot will manned Tactical Surface Fighter or TSF..a humanoid jet fighter. From what i see..this animation isfar better than Muv Luv Total Eclipse. The character , music n other are slightly average but u can go through with it with ease.\\n\\n\r\nGive this anime a chance n patiently watch..if u cant watch this slow paced anime then u will never like other awesome slow pace anime like Steins:Gate .\\n\\n",
            "date": "2016-02-02T03:02:00+00:00",
            "helpful_count": 67,
            "mal_id": 209952,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4574594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkReaver24",
                "username": "DarkReaver24"
            },
            "url": "https://myanimelist.net/reviews.php?id=209952"
        },
        {
            "content": "So let me start off by saying \"I F**KING HATE THIS SHOW.\" Really I do. And yet, I can't find myself giving this show any less than a 10. \r\nHowever, the reason I hate this show is because the writers are dicks and they know it. So this whole show revolves around the Cold War Era. Much like in the U.S. with the Red Scare, there was a struggle in Eastern Germany about loyalty. People selling out their own friends and family for self-preservation. This is the shows main focus. The Mechas and Aliens are really second to the situation.\r\nWell in the first few episodeswe met X-Chan. There is serious suspicion about this character whether X-Chan is a traitor or not. There is one scene in I believe the third episode where they show X-Chan's \"evil smile\"... and that is it. That is all we have to work on to determine whether or not X-Chan is truly a traitor or a Red Herring.\\n\\n\r\nThis is why this show is truly brilliant . As I kept watching I was searching for something, anything, to whether to trust our suspect or not. I kept playing all possible scenarios in my head, searched for something I missed, but to no avail because there was nothing there. There was nothing I could decrypt. All I could do is watch the events unfold. We don't even find out the truth till almost the very end.\\n\\n\r\nThis isn't an accident. The writers want you to squirm. They want you to wrench and search to try to figure it out knowing very well you can't. They want you to question everything and create evidence in your head that you believe true that probably is non-existent. This very well replicates the Red Scare in America. There was no way to truly tell if you could trust someone. There wasn't magical signals to tell. All you do is hope that you didn't get accused.\\n\\n\r\nThis show is probably one of the deepest anime out there. This whole show is a deconstruction of the mystery genre. There are no clues out there for you to find. All you can do is wait for something to happen even though every second you will try to figure it out. You will assure your self that you know the truth when you don't.\\n\\n\r\nIt almost doesn't matter whether X-Chan is a traitor or not. What matters is they are implanting that idea in your head. And that seed will sprout.\\n\\n\r\nThe fact that the average is a 7 is almost a joke to me. If I had to recommend a show to anyone I think this would have to be one of the first ones YOU MUST WATCH.",
            "date": "2016-04-11T17:24:00+00:00",
            "helpful_count": 55,
            "mal_id": 216165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3580001.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lonelynightm",
                "username": "lonelynightm"
            },
            "url": "https://myanimelist.net/reviews.php?id=216165"
        },
        {
            "content": "So basically my mates and I decided to do a showing of a show this season and we chose Schwarzesmarken. \r\nIt turned out to be a pretty interesting and exciting masterpiece about human behaviours studies and complicated human relationships.\r\nNon-spoilerino summary: In an alternate version of the 1980s, the Cold War rages on even amidst an invasion of alien creatures. Set in communist East Germany, Schwarzesmarken tells the heroic tales of the country’s strongest mecha unit, The 666th TSF Squadron Schwarzesmarken (Black Marks), as it fights against the dreadful and looks-like-shit aliens, BETAs, and shows the West the superiority of communist doctrine and technology. \r\nStory 10/10:\r\nNoperfect story exists without plotwists. People likes Urobuchi’s works/masterpieces/craps for this particular reason. While it appears on the surface to be just generic mecha+harem anime, Schwarzesmarken stands out from the crowd thanks to its setting.\\n\r\nIt’s as much about the hell of living within a totalitarian communist state as it is breathing under immense war-stress as they are on to fight deadly aliens with giant robots. The people live in the fear of secret police, STASI, that a wrong word can send them to prison and get tortured as traitors. Thanks to this, you’re never sure which characters are trustworthy and which are informants, and this is the source of all the dramas later on. \\n\r\nAbove that, Schwarzesmarken simulates the wartime psychology of military combatants during the Cold War Era with East German precision. Characters in this show are more prone to act out of control and without normal common sense, which is this show’s true beauty. The way the story is told is revolutionary as well. Focus of the show is always shifting from one to another thus a large amount of information is able to be conveyed to the viewers. Schwarzesmarken manages to take the viewers by surprise everytime as it displays hidden symbolisms in every singular frames. \\n\r\nOn the other hand it shows a slight hint on the structural weakness of a non-democracy ruling institution. The secret police is fighting with the military and the politicians in front of a survival crisis—the invasion of BETAs. It just show communism won’t last and freedom to people is the ultimate solution to rule.\\n\\n\\n\r\nCharacters 10/10:\\n\r\nThe MC, Theodor Eberbach, is not the generic MC you can see in every show or justice-wannabe Shirou. He’s a normal dude like you and me who wants to go away from troubles. Though for sake of the plot he must save the world and get all the booties. He’s the most normal beings yet the most boring person in the show. \\n\\n\r\n*Spoiler*\\n\r\n-------------------------------------------------------------\\n\r\nExcept he bangs his sister.\\n\r\n-------------------------------------------------------------\\n\r\n*Spoiler*\\n\\n\r\nThe loli on the front cover, Katia, is nothing but a plot device. A defector from the West, believes that everyone can get along if they just sit down and talk, just your generic naïve character and moe trope. Annoying as hell as she starts speaking thanks to her VA, she literally does nothing and react to nothing. The female version of Raku from Nichijou, she is oblivious not to feelings but betrayal that will cost her life. She just exists because the story needs her to.\\n\\n\r\nIrisdina is the Shirou and the punching bag of the show. Full of justice and regrets of killing her own brother when he was accused of treason to continue her living, she decided to fight the ugly BETAs. As the leader of the 666th TSF Schwarzesmarken, she owns great booty and convinced the MC to save the world. Should be the OTP with the MC. \\n\\n\r\nAnd here comes the miracle that saves and carries the show, Lise. As Theodor’s step-sister, she joined the show before the climax. Because she is the climax of the show. Later revealed as a spy  from the STASI, she ,as all other anime little sister, adores his onii-chan to a obsessive degree. She later shows her true colour and sell out the captain, Irisdina due to her jealousy. The rollercoaster she brings doesn’t stop here as she is the main force to stop her precious onii-chan to rescue his love. Lise also carries a heavy role as the leader of the divided fraction within STASI. Basically she is just a cute sister that wants to dominate the country and live with her precious onii-chan happily ever after. For that she paid a heavy price including selling out her friends and her body to STASI.\\n\\n\r\n*Spoiler*\\n\r\n-------------------------------------------------------------\\n\r\n-----Of course she offers her body to her precious onii-chan. Every 2D imouto’s ultimate tactical weapon it is.----\\n\r\n-------------------------------------------------------------\\n\r\n*Spoiler*\\n\\n\r\nLise shows a conflicted and complicated personality that perfectly symbolise the twitched soul under communism supremacy. She performs numerous treacherous acts just to be with her precious onii-chan. She even sacrificed her purity so that she can secure a better future, just to be with her onii-chan.\\n\r\nThen she displays a truly brutal and violent behaviour that suits her yandere-imouto character seasmlessly. At the end she is just a tragedic little sister whose one-and-only wish is her onii-chan’s affection and love.\\n\\n\\n\r\nArt 6/10:\\n\r\nLooks miles better than that crap from Studio DEEN so it means Schwarzesmarken is a OK looking anime. Nothing to write home about it. Although the BETAs looks like utter craps, there is a scene where aliens that looks like balllsacks with eyelashes. Truly indecent yet not scary. RIP the mecha design, it’s just tin boxes moving around in this show.\\n\\n\\n\r\nMusic 7/10:\\n\r\nSchwarzesmarken got Fripside to do a pretty decent opening song. It sounds like Black Bullet’s OP. The ending fits the show pretty well too. The sounds effects in the show that emphasizes on “Mai Fatherland” and “Go and Die you Capitalist Pigs” enhances the show’s viewing experience.\\n\\n\\n\r\nOverall 8/10:\\n\r\nPlotwist and marvellous storytelling with an emphasize on wartime PTSD that happens along with a forbidden incest love, what can you ask for more?\\n\r\nSchwarzesmarken may not be the most “hard-mecha” such as Gundam or “silly-romance mecha” such as Macross, but it is a mindbending show that involves viewers to rethink the possibility of communism and most of it, the weight of a little sister’s love.\\n",
            "date": "2016-03-08T18:37:00+00:00",
            "helpful_count": 45,
            "mal_id": 212519,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3454089.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Melvin117",
                "username": "Melvin117"
            },
            "url": "https://myanimelist.net/reviews.php?id=212519"
        },
        {
            "content": "This is probably going to be my entryway into the Muv-Luv series despite it being a spin-off. I love how it gives a certain point of realism into the story, even though its littered with swarms of mecha-on-monter action. I watched this with my fellow co-workers but none of them seemed to enjoy it because it was too \"grim\", but for me, it was great. Not only does it portray each of the character's feelings very well, but what really shines through is the emotions that war brings upon them. The conflict, the struggle, & the desperateness of East Germany, It feels very real. Iloved how they decided to use historical nations reminiscent of WWI-WWII because it helps understand what's really happening under all the confusion. If you're solely in it for the mecha battles, its cool too, they're really action-packed, & long that it somewhat keeps me on the edge of my seat.",
            "date": "2016-02-09T19:44:00+00:00",
            "helpful_count": 42,
            "mal_id": 210538,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EmeraldTiger98",
                "username": "EmeraldTiger98"
            },
            "url": "https://myanimelist.net/reviews.php?id=210538"
        },
        {
            "content": "There are two kinds of people that might watch Schwarzesmarken: those who have played the Muv-Luv trilogy and those who haven't. And depending on which side you fall on, your view on this anime will be quite different, although both sides will have their own problems with it, albeit totally different ones.\r\nSo before I get into this, there are a couple things I'd like to clarify for those who are unaware. Muv-Luv is a 3-part visual novel series released between 2002 and 2006, the last part of which, Muv-Luv Alternative, is widely considered to be one of the greatest visual novels ever made. However, eversince its release now 10 years ago, the company behind it, Age, have done literally nothing other than create a myriad of side stories, spinoffs and fandiscs based on the Muv-Luv universe. They've never even tried to come up with a new franchise for a whole decade now, instead they've decided to just keep milking their one and only masterpiece until it can be milked no more, which is... understandable I guess, but still pretty saddening. In any case, the Muv-Luv trilogy has never gotten an anime adaptation and perhaps never will, but in 2012 there was actually an anime release... based on one of its countless spinoffs called Total Eclipse. Not only was this a rather strange decision since any anime-only viewers would miss out on tons of plot elements due to being unfamiliar with the main series, but also Total Eclipse turned out to be an incredibly mediocre anime in and of itself, focusing just as much on fanservice as actual story progression, if not more. And now, 4 years later, history repeats itself, as yet another one of the franchise's spinoffs has gotten adapted, namely Schwarzesmarken. But of course for any anime-only viewers, the exact same problems as last time still remain.\\n\\n\r\nThe good news however is that the story of Schwarzesmarken is largely separate from the one of the main story of Muv-Luv. This is because a) it's a prequel, taking place almost 20 years before the events of Alternative, b) the character cast is completely different, and c) it plays out on the other side of the planet, in Germany instead of Japan. So in that sense it works out fairly well as a standalone anime... but far from perfectly. This is because Schwarzesmarken intentionally leaves out just about all initial exposition about the state of the world itself, any detailed information about the BETA's functionalities and tendencies, as well as a lot of the planet's history ever since the BETA's initial sightings on Mars in 1958 and their eventual invasion of Earth in 1973. And this is all simply because the anime assumes that you already know all that from playing through Alternative. So it's not that the story won't make sense for anime-only viewers (it will), but you'll miss out on a lot of depth and detail. It also works the other way around as you'll be able to relate a lot more to events which have previously only been mentioned briefly in Alternative as it plays out in real time here instead of something which just happened far away and almost 20 years prior from the game's perspective.\\n\\n\r\nOverall though, Schwarzesmarken is still a pretty big improvement over Total Eclipse at the very least. The tone is a lot more on point with what Muv-Luv is supposed to feel like, with a lot of death, drama, politics and tragic events (though not as much sci-fi). There is also pretty much no fanservice at all this time around which I'm very thankful for. So atmosphere-wise Schwarzesmarken is a lot more similar to the main series, but there are still some clear differences. The most notable one would probably be the direction the plot goes in, and specifically who the real enemies in the story are. In the main series, it's naturally the BETA that everyone is fighting since humanity's mere existence is on the line, but in Schwarzesmarken they almost feel like the secondary threat a lot of the time. Of course there are still a lot of battles between the human TSF squadrons and their alien invaders, but in this case there seems to be just as much internal conflict as external. This is because this takes place in Germany in the early 1980s, which of course means that it's in the middle of the country's split in two, I.E: West Germany and East Germany. The squadron the story primarily follows is the East German Army's 666th TSF Squadron, a.k.a. the \"Schwarzesmarken\". They do their part in fighting the BETA on a daily basis, but they see their western neighbors as just as much of a potential threat as the aliens themselves, and the west is of a similar mindset. It's almost like a three-way war going on, except that the two human sides are having more of a cold war standoff and throwing insults at each other most of the time, but occasionally end up clashing head-on as well. This is unsurprisingly also used as a consistent and reliable method for generating drama, as some characters find themselves on different political sides despite caring for each other on a personal level. And on top of that there's also the good old truth that killing off main characters is not exactly something Muv-Luv has ever been afraid to do, and although it might not exactly be on the level of the main series, Schwarzesmarken is still not afraid to do the same. It gives the post-apocalyptic story a much greater sense of realism and intensity that way, and it definitely pays off.\\n\\n\r\nSchwarzesmarken is definitely not a bad anime by any means, but I still find it a bit difficult to actually recommend it to people. Because if you haven't played through the Muv-Luv trilogy prior to it, then you should definitely go do that first, and if you have played through it then try as you might but you'll find that it's almost impossible to not end up subconsciously comparing Schwarzesmarken to the main series as you're watching it. There will constantly be this nagging voice in the back of your head saying \"I wish I was just replaying the real game instead\". Schwarzesmarken isn't bad, but just by being part of the Muv-Luv universe the expectations on it will be so much higher than it ever has a chance of living up to, and Alternative is just such an incredible work of art that Schwarzesmarken ends up looking a lot worse than it actually is simply by being compared to something so unreasonable. I think the only way you can truly see Schwarzesmarken for what it is is by first playing through the visual novels and then literally forcing yourself to go into the anime with the lowest expectations possible. If you tell yourself prematurely that it's probably going to suck, then you might be positively surprised. But if you don't, you'll probably just be disappointed.\\n\\n\r\nThough pretty much all these problems would be solved if Age just decided to actually adapt the real Muv-Luv series already... which I've actually heard some rumors as of late that it might happen in the future after Alternative's localization Kickstarter project turned out to be such a huge success a few months ago. Maybe in another 5-10 years, who knows. One can only hope.",
            "date": "2016-03-27T11:20:00+00:00",
            "helpful_count": 36,
            "mal_id": 214385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=214385"
        },
        {
            "content": "When you see the cover image or read the Synopsis, you might just get cancer and think its terra bad and boring, but its actually REALLY ****** GOOD.\r\nAnime is set in germany which is pretty weird, using mechas and fighting aliens called BETAs, sounds bad for most people. Germany is split into east and west and they dont like each other, like korea.\r\nMy favorite part about the anime is its realism to politics you could say? MCs are the good guys and then there are bad guys ofc. Good guys do the right shit and bad guys try kill the good guys LEL.\r\nDont wanna spoilso review kinda vague( really vague actually huehue)\\n\\n\r\nBasically this review is to make anyone who reads this watch it GO WATCH IT PLZ ONEIGAISHIMASU\\n\\n\r\nguarantee good shit\\n\\n\r\n*Thoughts after finishing \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nIncest is daijoubu (in anime at least)=good shit :)",
            "date": "2016-03-08T01:48:00+00:00",
            "helpful_count": 35,
            "mal_id": 212481,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5034187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mejo369",
                "username": "mejo369"
            },
            "url": "https://myanimelist.net/reviews.php?id=212481"
        },
        {
            "content": "Having seen a fair amount of sci-fi related series and mecha as one of my favorite genres, Schwaresmarken stands out as a strange show to me. It’s not because the series is set in the same universe as the Muv-Luv franchise or based on a light novel. Rather, the series is more like a political flair that’s masked by the intense violence of creatures, monstrosity known to their world as BETA.\r\nFirst let’s get a few things out of the way. The series is a spin-off series based on the light novel. (although a visual novel also exists) Historically, the timeline began around the late 1970swhen BETA arrives in Eastern Europe. Eastern Germany gets besieged by them and mankind suffers heavy losses. That is, mankind builds the TSF (Tactical Surface Fighters) that basically translates into heavy duty mechanized machines designed to fight them. 5 years later, Eastern Germany is still suffering with its weakened forces and the Warsaw Pact isn’t holding them much longer either. However, they are supported by the infamous Nationale Volksarmee's 666th Tactical Surface Fighter Squadron, also known the “Black Marks”. The story tells of this infamous group as they fight for survival not only on the frontlines against BETA but also within its own forces, political struggles, and national conflicts.\\n\\n\r\nApproaching this series with trepidation, Schwarzesmarken’s storytelling is sometimes decent, sometimes bad, and then sometimes just dreadful. There’s a lot of mixed feelings when diving into such a complex universe. Furthermore, the show is only a 1-cour so terms like ‘rushing’ or ‘butchered adaptation’ can be applied here. To be fair, enjoying this series at fullest would include an understanding of the Muv Luv universe. However, watching this series as a standalone is possible and the experience getting out of the show may be enjoyable. That is, if you really and I mean, really like what it has to offer. \\n\\n\r\nWhere to start really? The first episode easily establishes a few factors. BETA is on the rampage in Europe and the show isn’t shy to show death on screen with an immense amount of violence. There’s some emotional storytelling going on as well when we see pilots during their last moments. In essence, it should come to no surprise that Schwarzesmarken is trying to paint the idea of BETA being humanity’s ultimate enemy. Or is it really? Behind the frontlines, there’s a fair amount of political and interpersonal flair going on. You see, West and East Germany haven’t exactly been the best of friends. The show easily makes it clear that the two are only united for the purpose of surviving and destroying a common foe. By historical standards, the Warsaw Pact is a collective defense treaty but in this series, it’s almost like an armistice. West and East Germany have their own ideals so naturally, they can’t really get along. One of the major forces in the series besides the 666th squadron is Stasi, an official security force of German Democratic Republic that’s designed to enforce their laws. Spies, treason, and disobedience are met with punishment including death. Furthermore, they have control of a massive intelligence network that almost serves as this series’ version of Big Brother. Sounds scary right? To be quite honest, humanity’s enemies aren’t just BETA but also making an enemy of themselves. And it’s a sad story when we see the body counts.\\n\\n\r\nAs complex as the show seems, the characters aren’t too difficult to understand once you really see their background stories. Theodor, the main male protagonist has suffered losses in his life including the assumed death of his sister. Irisdina Bernhard, the captain of the squad has been rumored to backstab her own family to get to where she is in the present. Then, we have Katia who tries to desperately appeal to her ideal of “let’s put our differences aside! If we all unite, we can defeat the BETA!” Such an illusion really. The show makes it clear that there’s no genuine friendship between certain nations. Nonetheless, the character cast gives the most prominence for these three characters while the others are mainly supporting players. That’s sad to say as I’ve heard the light novels gave more characterization emphasis on characters like Sylvia, Pham, Beatrix, among others. As I’ve mentioned before, the adaptation serves more of a story to depict the nature of sci-fi warfare. The addition of the military, political conflicts, and personal battles are attempts to create an emotional story. Does it work? In some some ways, yes. However, the majority of the show feels like it tries to stuff down the viewers’ throats with emotions that really is weakly timed. Sure, characters die on and off but it does it really give strong reasons to why we should care about them? The first half of the show has several characters die for mankind’s cause. But to this end, I don’t find their losses to be memorable. It’s not just how predictable how some deaths occur but rather their lack of characterization. The only characters that seems to be relevant in the show are Theodor, Katia, and Irisdina. Later, we also see a surprise character return to the series although I can hardly call it that. In terms of relationship dynamics, that’s hardly anything to take home to. Theodor’s a cold guy who can work with others on a professional level but rarely ever opens up to others. His childhood is tragic and in a way, I guess we should feel sorry for him. Katia’s relationship is perhaps the lightest in the show and also inspires him to fight the good fight. Then, there’s Irisdina, probably the least trustworthy main character because of the rumored gossips about her past. Although on professional standards, she does have a good relationship with Theodor and Katia. The show also seems to establish that Irisdina and Beatrix (a prominent member of Stati) has some sort of history but that’s overshadowed by the actual conflicts going on. I refer to the one about war against BETA.\\n\\n\r\nIn terms artwork and design, it’s mostly mediocre level in terms of technical quality although I do give some praise to the studio for portraying the technological aspects of the series. It manages to capture the grim atmosphere with the bloodshed and death scenes. And while the pilot suits are designed to make the women look like eye candies, it is also quite convincing. Character expressions are important so the series did its best to capture their emotions. In retrospect, it did a fair job as every episode seems to make their reactions look and feel real. In addition, the TSF are designed with a decent amount of effort ranging from its arsenal, structure, and capabilities. Action wise, the show is powerful enough to convince us that it’s a sci-fi warfare despite the CGI. On the other hand, BETA’s designs looks silly with the insectoid-like eyes and absurd body proportions. They look like aliens that popped out of some B-movie.\\n\\n\r\nSoundtrack is actually quite important now that I’ve taken the show at a close glance. Remember, the series is grim without much humor but portrayed as a sci-fi warfare story. In other words, the show did its best to portray that atmospheric setting with more melancholic music. Either way, it does seem to work out in that regards when delivering its intentions. However, character voice mannerism is a weak sign of the show as there’s nothing really a character that stands out individually. In fact, Katia’s voice sounds like a child for someone as part of the military. On the other hand, I do like how characters like Beatrix is portrayed with their manipulative nature expressed by voice acting.\\n\\n\r\nAfter watching Schwarzesmarken, I have to conclude and say that the show is a brave attempt at making this into a memorable war story. But what does it really achieve? A poorly directed and produced series that seems to not be able to connect with itself. The story feels loose while the info dump has a strange pacing. Furthermore, there’s a lack of characterization on most of the 666th squad. I think the show is geared at more of an audience that is very familiar with the Muv Luv universe. To casual fans, the experience isn’t going to be something great and shouldn’t with what it presented.\\n",
            "date": "2016-03-28T06:05:00+00:00",
            "helpful_count": 29,
            "mal_id": 214521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214521"
        },
        {
            "content": "So about 10 hours ago I finished Schwarzesmarken. \r\nAlthough it's not the best show of the season, it's the one I enjoyed the most. Surprising considering it goes up against KonoSuba. \r\nOh and don't stop watching straight after the credits end, there is always an after credits scene which is important to the story. \r\nHistorical Authenticity:  I'm not allowed to use the word \"accuracy\" because there were no aliens in Germany. German text appears in place of Japanese when written down and from what I can tell it's very accurate. Ignore that Schwarzesmarken is grammatically incorrect. There is a reason behind that. The endcard reads \"Fortsetzung folgt\" which translates to Episode follows (or To be continued as Crunchyroll prefers.) \\n\r\nOverall from what I had seen the show remains faithful to East Germany, http://i.imgur.com/5E9KJU3.png?1. Aside from changing their plug sockets.\\n\\n\r\nStory: As you know, 1980s East Germany. Poland has fallen leaving them the last barrier to western Europe. They had me caught at 1980s East Germany. I am interested in Cold War history and what is basically fascist rule. I always love the idea of secret police, such as the Stasi. Which is great because who appears in the show? That's right, the Staatssicherheit (German for State Security). I've never watched or played Muv-Luv but I am told politics plays a large role in them as it does in Schwarzesmarken. Remember the aliens attacked humanity? Yeah, they aren't the enemy. The Stasi are. From what I can tell that is the message of the show. The humans are your enemy. It's pretty thrilling. If I was to go any further I would be spoiling the show. Honestly you just need to watch it.\\n\\n\r\nArt and Sound: I've been told the CGI in this show isn't as good as others but it's good enough to look at. It works as well considering the BETA are aliens are shouldn't look like anything on the Earth. As for character designs they are decent enough. As usual in anime the Asian one doesn't look Asian, but she is wonderful anyway. Same with the Polish one. There were two German stereotype girls and Irisdina's hair was pretty to look at. Katia wears too much eye liner. \\n\r\nAs for sound I've been listening to the Ed song, Kanashimi ga Jidai wo Kakeru, while I write the review. It's peaceful. The Op song white forces gets you excited to watch the show and it was well implemented in the final episode. Voice acting was good and I don't think the actors and actresses messed up German pronunciation. There was a stand out song that played in episode 11 which was very epic for the situation. I'll find it hopefully. \\n\r\nOther than that I can't think of any stand out songs. Maybe I'll find them when I do a rewatch, hopefully that rewatch will be on Blu Ray. \\n\\n\\n\r\nCharacter: We needed two courses/24 episodes. Although I liked the characters as much as I could I still couldn't get attached to all of them. \\n\r\nIrisdina does have a prequel novel that I don't think has been translated by anyone yet but the show does manage to get you understand her views. \\n\r\nTheodore Eberbach is our harem leader, except the show never feels like a harem. If you watch the show you will see how the characters interact with each other. \\n\r\nKatia wears too much eye liner.\\n\r\nAs for the other members of Schwarzesmarken they are good characters and as I said, you will need to watch the show to understand how they interact. \\n\\n\r\nEnjoyment: I was \"excited\" to watch Schwarzesmarken every week. Just like how the people who watched One Punch Man felt. \\n\r\nAs a person that likes politics and \"history\" this show was great for me. It was always tense and after episode 1 it showed how dark and deadly the show can be. \\n\r\nI enjoyed it so much I want to read the Light Novel and play the Visual novel. \\n\r\nWhat's that? It's on Steam Greenlight: https://steamcommunity.com/sharedfiles/filedetails/?id=651346103\\n\r\nGo vote for it if you want more from the Schwarzesmarken Kompanie.\\n\r\nThey will take that as interest for a second visual novel and a translation for the Light Novel.\\n\\n\r\nOverall: After opening the Steam link and listening to the opening for it I am feeling pretty good. The show has interesting themes and characters. It's a must watch for those that like political drama and the Muv-Luv universe. \\n\\n\r\nIn short you should watch it. It was wonderful.\\n\\n\r\n\"Der Weg geht weiter...\"\\n\\n\r\nDeutsche Demokratische Republik 666th TSF Kompanie, Schwarzesmarken.\\n\\n\r\nAufweidersen.\\n",
            "date": "2016-03-28T07:21:00+00:00",
            "helpful_count": 22,
            "mal_id": 214528,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/IKnowBestu",
                "username": "IKnowBestu"
            },
            "url": "https://myanimelist.net/reviews.php?id=214528"
        },
        {
            "content": "Black Marks\r\nBlack marks also known as (Muv-Luv Alternative : Schwarzesmarken) is the new cow to milk out of this franchise. First let me clarify that this is a Light Novel adaption, just like total eclipse, written by YET ANOTHER author. Now, when you adapt something like that into anime you’d expect the script writer and the director to bother fixing the issues that total eclipse’s adaption had, but nope, they did not. They not only managed to make it even worse, they also decided it’d be asmart idea to have LIDEN FILMS animate it, now they managed to pull of Arsan Senki fine, even with issues here and there, but as I said in my TE review, you do not give a studio that doesn’t have enough money to produce a 2-cour mecha show without resorting to CG mechs. Considering 80% of what is on screen are mechs and giant aliens, if you have them cg not only does this kill the animation, but the entire fun of the show. Even a poorly done show like A/Z was more interesting, and that was done by A-1 & Troyca with even worse CG.\\n\\n\r\n- SECTION 1 ART & ANIMATION -   \\n\\n\r\nAs mentioned above, the animation mostly consists of CG mechs, regardless how fluent it is, it feels out of the place and unnecessary, even the action scenes feel weak in comparison to Total Eclipse, which was way worse in terms of production budget. Actual drawn scenes have okay animation as in they don’t do any drastic movements, lazy, but nicely covered. \\n\r\nThe art designs and character design is decades better than TE, but then again it suffers from the exact same issues as the previous title did. Dull and repeating backgrounds that offer little variety and mostly covered in white because of the snow, which at this point pretty much shows that they were trying to save as much budget as they can from this so they can produce Arslan S2 with minimum production issues, which is sad to see as they could’ve handled it much better. Character designs look almost identical, just change the hair color and you’re done.\\n\\n\r\n- SECTION 2 DIRECTING & SCRIPT –\\n\\n\r\nThe directing in this show is all over the place, the guy thought it would be a smart idea to have the characters take their setting and outcomes so seriously that that it makes attack on titan look like the little baby in comparison, there’s usually a level of how much the voice actors have to get immersed to make you feel like you’re really there, like you understand them. However, if you have them take it WAY to seriously, they’ll come out ruining the moment or being too noisy. For example Attack on Titan was a nicely animated drama, it had top tier direction and immersion, but the voice actors tried too hard to make it sound like its life or death, which led to the most anticlimactic outcome for me. However, for short stories it worked, like Levi’s ova’s, so you’d expect it to work here as well, no chance bud.\\n\\n\r\nScript writing is almost average… As in, they managed to get it to the setting properly, but still feels uneasy to read through, there are very weird moments example where she sleeps with her brother because she felt depressed because no one trusted her, like WHAT?! During action scenes and crucial moments it’s below to average at best, having melodramatic characters and ideals that seem extremely out of place for what this is, it’s even a political drama as well as an alien war drama because NATIONALISM! And REASONING! Corruption and such, so when he tries to make the script for one scene it comes out even worse in the next, so you’d expect the director to even it out, but no it didn’t happen. He was over blowing the scenes with characters trying to make it seem like hell when you can’t even relate to them.\\n\\n\\n\r\n- SECTION 3 PRODUCTION VALUES & MUSIC –\\n\\n\r\nProduction values aren’t even on the norm to be considered decent. As 80% of the show is CG, and the animation is at a minimum the voice acting over done and script thrown out of the window, there is almost no satisfaction in terms of watching it, the designs are forgettable and basic; uniforms are standard with no unique touch to them.\\n\r\nThe music is even more forgettable, it’s better than Total Eclipse that’s for sure, but I cannot recall any specific track, maybe the one that played during episode eleven, but damn, it seems to be very difficult to hit the proper score for this, I mean, the Visual Novel adaption of the Alternative Light Novels had 30 tracks, but mostly used 5 of them on certain sections, the others were so played for less than a minute so you’d forget them, what I aim to say with this is that, it had almost no music being played, and yet. Was more memorable and better directed and presented than this misery, if you so want to see Schwarzesmarken for yourself, I’d suggest you turn off your brain if you want to get past episode 4. Or read the Novels it is based off, as they are most definitely better. \\n\\n\r\n- FINAL SECTION ENJOYMENT –\\n\r\nHaving liked the Alternative VN, I wanted to give this a go to see if it’ll be as interesting as I expected it to be, but was disappointed severely with it’s production and presentation, it seems these kinds of stories need at least 20 episodes to be something more or a long running 10-15 novels (50 hour if it’d be a VN) to flesh out and finish it the story. However, with the budget it got and timeslot it had to run through, it couldn’t be more than a mere distraction. I disliked the series after the 2nd episode and it started getting on my nerves towards the end. I highly suggest you look elsewhere if you want a war drama; it’s slightly better in terms of production than TE, but worse in terms of script and direction, so it fails to deliver the expectations and would leave you wanting this to be much better. \\n",
            "date": "2016-04-10T08:45:00+00:00",
            "helpful_count": 10,
            "mal_id": 216024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4053205.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seppiroth32",
                "username": "Seppiroth32"
            },
            "url": "https://myanimelist.net/reviews.php?id=216024"
        },
        {
            "content": "Overall  (7/10)\r\nRight of the bat, I'm gonna say it's not a great anime, it really isn't. High Average at best, but cut it some slack. The 12 episodes given as screen time was just *way* too short to give the whole story justice. It's dark, but the nitty gritty details of the whole thing aren't really highlighted, they give you a few shots just to get the general idea. I'd say that they actually conveyed the main points and prompt pretty well, but as a lore enthusiast, I can't help but be disappointing with the lack of content. So much potential down the drainprobably thanks to them having to cut a lot of the content out due to this restriction. It would have felt better if they gave it 25 episodes. Pity\\n\\n\r\nHowever, as a follower of the Muv-Luv series, I couldn't help but watch the whole thing until the end. It was refreshing to see and there haven't been too many mecha animes recently (relatively speaking) that i can recall.\\n\\n\r\nSTORY (6/10)\\n\r\nIt tickles the history nerd in me to see someones take on a crazy question: \"What if very anti-human aliens decided to visit Earth during the Cold War?\"\\n\r\nAn already unstable period becoming even more unstable! Perfect, what more could you want?\\n\\n\r\nThe world has just 'recovered' from WWII and everyone should be good with things, but humans aren't a peaceful bunch. Queue the Cold War! Red Vs Blue! But wait, the BETA appear, maybe people can finally get together, trust each other, and work as a cohesive group.\\n\\n\r\nNah, screw that, who needs that when you can get all the power you want? The Black Marks portrays the bad side of people and how dark politics and war can really get. Forget the romanticizing, if you're new to dark anime and you want to get a teaser of what the dark side is like, this series is a good introduction. See how humans are just as much a problem as aliens are!\\n\\n\r\nI personally like stories like this, which is why i watched the thing in the first place. I find that Despair and Hope (especially in the middle of a war) are very exciting themes to any anime, and the onset of an seemingly unending alien force that wants to annihilate you, your family, your cow and every one else to be a good prompt for even more themes.\\n\\n\r\nThere are a *few* plot holes that i wish they filled out properly. Nothing major, but they did add one too many spoons of Deus Ex Machina for my taste. Then again, I could just be negative like that. Entertainment like this wouldn't be entertainment if it was completely realistic, so i think it went down fairly smoothly\\n\\n\r\nArt and Sound (6.5/10)\\n\r\nThe OP and ED aren't bad, but they aren't the best.\\n\r\nI'm sure they can get some peoples blood up, for sure, but\\n\r\nI'm just not the type to look at the music of an anime into that much detail.\\n\r\nIt's SFX where quite nice. It sounded quite typical for a mecha/war anime, but not cheesy or corny. \\n\r\nThe art seems like it's new-gen art on a budget. It fills out the basic ideas of many of the images, but some details were not given any effort, such as the deck of the battleships in one of the scenes, or the uniform details on some of the characters.\\n\r\nThe art isn't stiff, however, and most (if not all) of the parts fitted well into the whole\\n\\n\r\nCharacter (7/10)\\n\r\nI actually liked the characters in this one. I'm biased, deal with it.\\n\r\nMost didn't lack substance, considering the time of the anime and most of the 666th squad seemed to build on something at least. The members were given equal attention which made them fairly emotionally invest-able to the watcher. There were some lines, however, that didn't seem to fit and felt like they were put there just to give weight to the current event or character for that one single moment, so it was a little shallow.\\n\\n\r\nEnjoyment (9/10) (Slight Spoilers)\\n\r\nI gave it a Nine for a few reasons:\\n\r\n-It's a dark anime. I like dark anime\\n\r\n-Mechas!\\n\r\n-Cold War Era + Mechas! Aww yeahh.\\n\r\n-Politics, an old time favorite of mine, grinds my gears cause it's a real and valid thing that happens. Always nice to see how the story ends.\\n\r\n-People actually die in the squad, It's kinda realistic!\\n\r\n-They continued Muv-Luv! Yussssss, i thought it was a dead series.\\n\\n\\n",
            "date": "2016-09-26T08:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 230277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5725691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FearenRehnet",
                "username": "FearenRehnet"
            },
            "url": "https://myanimelist.net/reviews.php?id=230277"
        },
        {
            "content": "I don't normally write reviews, but when I do it's because I feel the need to express an opinion that may not be the popular one so that people aren't mislead by the oh-so-common mob-rating mentality that we've all seen time and time again. I mean, it makes sense, people will go to rate something and if they're too far from the average may re-think their rating in order to be closer to normal. It's a psychology thing...anyway, on to my review.\r\nThere's no way this deserves to be (as I write this) ranked #4492. On the other hand, I don't know if it really deservesto be in 133 peoples' favourite lists, but I can at least wrap my head around why certain people would drop this in their top ten. Really, on the surface, it's another generic mecha...okay, yeah, it's a fairly generic mecha through and through but wait! There's more! The setting is definitely a breath of fresh air for me, there hasn't been another one like this in a while that intrigues me. And while the characters aren't extraordinarily special, they definitely grow and become quite unique as the show progresses - even when you get down into the multitude of side characters. Heck, there are a lot people who have < 5 minutes of screen time in every episode put together that feel like they have their own unique personality which is extremely impressive considering the number of side characters (I'm not even talking about the main supporting...well, harem I guess). Sure, a lot of the main characters are fairly stock, but I think the effort that went into writing good extras balances that out a bit.\\n\\n\r\nI can't help but feel that people pegged it as one of the few promising shows this season on Crunchyroll and then saw the generic trash it was pretending to be for the first couple episodes and gave up on it (but obviously not before dropping a trash review on it). \\n\\n\r\nDo I think it's a perfect mecha? No. But do I think it at least deserves to be in the high hundreds or low thousands? Definitely. It's sure as hell better than Aldnoah.Zero's second season and arguably better than the first; also, once the last couple episodes come out, I'm almost positive I'll be able to say it's better than the first season too. \\n\\n\r\nDo yourself a favour and give it a watch through to the end, it definitely finds it's groove around mid-season which makes the overall quality match up a lot more with the great art, animation, and sound/music choices. If you like mecha, you'll like this. If you hate mecha, you'll probably appreciate the world history and politics. I do at least recommend you give it a shot if the expository history lesson in (I think) the first episode intrigues you at all, even if mecha isn't your thing. I like to think there's a reason that the actual reviews (probably from people who have invested a little bit of time in this show) all come with quite high ratings.",
            "date": "2016-03-10T02:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 212603,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4722136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/scottishrob13",
                "username": "scottishrob13"
            },
            "url": "https://myanimelist.net/reviews.php?id=212603"
        },
        {
            "content": "This anime is our entry to the Muv-Luv universe and has shattered our expectations. This is worth watching\r\nThis anime is mainly a spin-off and takes place long before Muv-Luv's main events during the earliest stages of the BETA invasion, during the Cold War and the splitting of Germany. We like the historical add-on to the anime plot!\r\nDespite there being mechs used, they aren't used in a cliche manner.\r\nThis anime is really good to be honest. It has good art quality with nicely saturated colors and plenty of detail. The audio is also extremely good as well, having a deep cinema-like feel to it.\r\nThis anime honestlyfeels like it has some aspects from Evangelion and will take a bit of time to watch, but we recommend it to everyone.\\n",
            "date": "2016-03-21T12:36:00+00:00",
            "helpful_count": 9,
            "mal_id": 213548,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208294.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nazo-The-Weeb",
                "username": "Nazo-The-Weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=213548"
        },
        {
            "content": "Schwarzesmarken is an anime that focus about human rivalry and political tension in the middle of a war with alien invaders. I think this anime got ignored (maybe because of it being of muv luv universe or being mecha which a lot of people seem to dislike) but I want that people would give a chance to this great anime.\r\nSo as said Schwarzesmarken focus on the humans in Europe (east Germany to be precise) and about their on going war with the BETA, an alien invaders that took most of Asia in a very short time. Being the last defense line of Europe, the eliteunit of \"Schwarzesmarken\" need to defend their country while also dealing with secret police, political tension with west Germany and the UN and of course internal conflicts. The show does a great job showing us that even in the face of humanity fiercest enemy, humans still won't get along and fight each other, possibly risking everything to get their ambitions. \\n\\n\r\nWe see ideals clashes and political discussions which are very interesting, but we also get a good balance of action-mecha fights and military operations, whether it's against humans or against BETA. The story is without a doubt the strongest point of the story.\\n\\n\r\nUnfortunately, it isn't the same for the characters. There is a large cast and we can't get enough focus about everyone. Sure, the main character Theodor Eberbach start as a schmuck and get a character development. But we can say it only about him. The rest are either without personality, or with one gimmick that make them who their are (one is a bitch, one is a strong head etc). \\n\r\nWe have also Katia, which is a great character. While at first seems like a Moe blob that only cries, she is tough and have strong personality-but Katia being cool doesn't fix the rest of the characters-problems that could be fix with more episodes and more time to focus about them. \\n\\n\r\nFor example Beatrix brehme, which built up to be a big villain, was  a cardboard character without nothing to make her stand out except her cool design, a shame, really.\\n\\n\r\nThe designs overall were good. There was a lot of doubt about it before it came out but the art and animation were good. Nothing that stands out, but good. The voice acting was excellent. \\n\r\nThe music fit nicely to the show, and was pleasant to hear. \\n\\n\r\nOverall, Schwarzesmarken is a great anime. I enjoyed every second of it. I think more people should give it a chance because it was mostly ignored when it aired. The only people who paid attention to it were fans of the franchise, and I believe that even if you don't know Muv Luv or don't want to play the visual novels, you will still enjoy it, as a solid series with war setting and great Mecha battles.\\n",
            "date": "2016-04-08T06:50:00+00:00",
            "helpful_count": 7,
            "mal_id": 215821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647204.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PunkChinaDoll",
                "username": "PunkChinaDoll"
            },
            "url": "https://myanimelist.net/reviews.php?id=215821"
        },
        {
            "content": "I watched it when it came out, so im a little late on this review but whatever.\r\nI have some extremed mixed feelings for this series. On one hand, they have charecter development and even deaths and some extreamly well made drama at some points but at other moments in the series I was bored as f*ck. \r\nI would have given this a 6 or a 5/10 if it were not for the last three episodes because those were reeeeally good. \r\nFirst time I almost started crying (I never did cry but at the same time, i never have to any of the animes i've watched).\r\nsoshould you see it?   Yeah, if you are patient you should because it pays off in the end, and I do not regret seeing it. Minus points for the fanservice tho.",
            "date": "2016-09-02T09:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 228115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5009346.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jolle808",
                "username": "Jolle808"
            },
            "url": "https://myanimelist.net/reviews.php?id=228115"
        },
        {
            "content": "This review is going to make a lot of comparisons to the original visual novel series of Muv Luv, expect a very bias review. If you are a visual novel/mecha fan I suggest you avoid this series and read the games first so you don't get spoiled. Chomp! ect.\r\nAs a big fan of the Muv Luv visual novel trilogy I was pretty unenthused to hear that a spinoff called \"Schwarzesmarken\" was being made into anime based on the light novel series of said name.\r\nWhile I am a fan of the original vn I cant say I appreciate Age trying to make a universe out ofthe series, the whole point of the original series was that it was a parody of mecha tropes in mainly 90's mecha anime and took a bunch of walking trope characters and set them in a misery filled war against campy/horrifying looking alien creatures.\\n\\n\r\nThe source story spent alot of time making you like these generic characters and actually care about them when they were placed in the worst situation ever but Schwarzesmarken takes itself a little too seriously without making you care for its own new cast beforehand.\\n\\n\r\nThe main character, Theodore, does a pretty funny personality flip between the first two episodes from, uncaring edgemaster to a patriot fighting for freedom. It comes off as really rushed, like the director had no clue how to make the reveal that Theodore was a broken person since he lost his sister and just made it more matter of fact like.\\n\r\nI think Theodore would have been a little more interestering if they let his stay an asshole for a little longer so that when he actually starts caring about the things happening around him the impact for the viewer would be more satisfying.\\n\\n\r\nWhile Takeru, from the original vn, was a very basic character also he was more like a self insert for you to experience the other characters and learn more about the rest of the cast and then share his pain when his way of life was destroyed and replaced by never ending fighting. Theodore kinda is just there since you need to have at a male character in this almost fully female cast.\\n\\n\r\nEvery character in this show is boring, I can't even remember the names of most of them and I have no clue why I should care about anyone aside from the fact that the evil Germans are really, really evil. They show this by having the bad guys torture people and have really sick smiles of enjoyment while doing this, like really? These are the bad guys? Shits as subtle as having them kill a cat and pushing an old women down stairs.\\n\\n\r\nKatia has very few scenes with Theodore so you don't really feel a connection between them, they just seem to work together. Theodore cares way more about banging his sister then any other character in the show and it makes it really awkward when people start dropping like flies towards the end and they play it off like Theodore lost a precious person that could never be replaced. Like when the hell did he even talk to them? I'm going to just assume that a lot of content was cut from the light novels to fit into the 12 episodes.\\n\\n\r\nI did like the CG animation in this show, I normally hate CG but the snow filter then ran on every single mecha scene really disguised the other wise ugly cg movement. Still am dreading the new CG dystopian anime future that is coming though.\\n\\n\r\nThis show is pretty much just a commercial for the light novel series that has ended and the new visual novel adaption that has part 1 released and part 2 coming out later. Expect rushed scenes of exposition and plot points that solve themselves a little to fast. I would suggest you check out the Steam green light page for the Schwarzesmarken visual novel in English in hope that we can get a more complete well written version of the story because it does have some nice mecha designs and Katia is pretty cute if annoyingly idealistic.\\n",
            "date": "2016-03-27T20:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 214472,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3431123.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeWeebGod",
                "username": "AnimeWeebGod"
            },
            "url": "https://myanimelist.net/reviews.php?id=214472"
        },
        {
            "content": "although Schwarzesmarken is set up as spin off of the muv luv:TE but for me it feels like a prequel rather then spin off really, since the mech(almost the same) and the beta(they are still the same but there are new enemy like fortress type) but i enjoyed and satisfied with each episode that came out.\r\ngood mecha fight, good character progression and story phasing, and well balanced between story and battle makes it worth the time i spend watching this.\r\nand the story itself can teach you about history to, about the revolution of east german(i hate history classes) with it's own unique story progress andnot make me confussed about it until the end of episode that is the one that makes me sit on and watch it until the end, although personally i didn't like the ost(a pop music with 666 symbol on the op scene and gruesome story to tell, well it's kinda don't fit aren't they..?).\\n\\n\r\noverall if you like a good mecha anime with unique story (gruesome yet make you excited) and good character telling and progression, this one is good for you i highly recommend it",
            "date": "2016-03-21T05:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 213516,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4879108.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/F4nz",
                "username": "F4nz"
            },
            "url": "https://myanimelist.net/reviews.php?id=213516"
        },
        {
            "content": "Basic summary of the show - set in the Muv Luv Alternative universe where aliens known as BETA start invading Earth and eating people, and stuff. It's 1983 and our heroes are part of a divided Germany and the BETA is pretty much at their doorstep.\r\nLuckily there isn't any real need to dive into the Muv Luv universe as a whole (it's great though), since the anime is pretty much a very good standalone gateway into the franchise itself.\r\nFripSide OP. I'm a big sucker for fripSide's music so this is a big plus for me haha. ED complements the show very well.\r\nThe anime actually startsoff slow here, the first three episodes feels rushed and a little disjointed because of set up and character development etc, but it starts getting good around episode five, and it kept me waiting for a new episode every week. \\n\\n\r\nIf you're into mecha, this is for you. If you're into dark shows where characters have basically no plot armor and you fear for their lives, this is for you.",
            "date": "2016-03-29T23:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 214761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Falverick",
                "username": "Falverick"
            },
            "url": "https://myanimelist.net/reviews.php?id=214761"
        },
        {
            "content": "As a prequel of MAL-TE, this doesn't have much of an impact, since the setting was just simply odd as to how the 80's were able to produce 25th century tech and yes I'm referring to them TSF which were just too advance for the timeline, it would have been much appropriate if original creator Uchida Hiroki could have just set it in some alternate time line where the cold war extents to the 25th century and then them BETA's comes surging in . It doesn't matter whether it's MAL-TE or this or any upcoming sequel or prequel the setting was just too ill fittedto such time line, so:\\n\\n\r\nStorywise, the prequel focuses on man's struggle with not only with the swarms of BETAs, but within its own struggles inside an oppressive state. Now forget about the plot where a group of veterans whose reputation for kicking the BETAs butt were outstanding, the real plot was more on the geopolitics of the cold war and it was very good that original creator Uchida-san nail it very well, cu'z during the cold war such purges and paranoia does exist within the once reputed \"IRON CURTAIN\". And yes the things we see in the anime did have such reality during the cold war. \\n\\n\r\nThe art, was impressive and one wouldn't find any knee high sock wearing bimbo, nor would one find a Yamato Nadeshiku, though one would still find a usual white haired girl, red head and a blond girl. I never understand as to why character designer Hara Suuchi did follow the standard uniform of the National Peoples Army and instead used the standard green fatigue uniform that the JSDF wore during the 70's. Also, I can't seem to dig as to why Katia and Lise have to look like lolis.\\n\\n\r\nSound.........well, for the opening I do like when it was preformed by Fripside,   but not the closing, also I do find the seiyu who did Katia's voice as annoying, since it kinda make her the way she is, an naive little girl, who has no idea of what she's getting into. Also, the voice of Lise really did make up as this deceptive crazy girl the way the character is.\\n\\n\r\nNow for the characters of this anime, aside from the fact that some of the character's name were hardly German, nearly all of which where portrayed as a bunch of Stoic individual whom have no other option but to accept their fate in the hands of their oppressor the Stasi, however each character were a different kind of stoic human being, like Theodore Eberbach  was portrayed as this distrusting stoic character who is just trying to hid from the Stasi's radar by accepting his sacred duty to protect East Germany, but in reality he's in survival mode and just wanna live long enough until the BETAs get him, though he was suppose to have a relationship with a supposed Stasi Dog, Irisdina, it came too little too late, cu'z Irisdina have to die in the hands of an opportunistic Stasi dog who is a CIA doggy wannabe Axman. Now, I hate the fact that Theodore was basically portrayed to be both a siscon and a lolicon, given that his sister Lise made love to him and Katia, being deigned as this young girl who maybe 16 was being made to be in a relationship with Theodore whom we can say is probably 25 , now don't that look like corrupting  a minor? Oh, and his surname Eberbach is Jewish. Now as for the main girl Irisdina Brendhard, her name is hardy German or at least her surname which is Saxon btw, now I kinda like that she is portrayed as this stoic who know how to get around, but I kinda hate it when she has a 2nd in command Gretel Jeckeln whom I can't say at first as to whose side she is, and her surname Jeckeln is Welsh , there is also  Thi-Rang Pham, who is name is Vietnamese, so why would someone from South East Asia doing in Europe? Now I could go on but then again there is no point. But I've notice that most violence where often done on the girls, which kinda make me sympathize with the female characters and at time make me wanna bash the original creator for such violence on women.\\n\\n\r\nThe Enjoyment for me was the part when the Stasi got owned and Gemany was united, but I can ignore as to how this anime exudes such violence on women, why, well Irsidina was often seen being bullied by Axman and Beatrix,  Anette suffering some kind of nervous breakdown, Lise giving up her humanity just to be with Theodore, Phram and Sylvia receiving such domestic type of violence in the hands of the Stasi, Gretel getting her ass kicked by a crazy chick with brocon syndrome and Irisdina getting shot by Axman, let not forget the lolicon element for Theodore and Katia, so for that:\\n\\n\r\nOverall, it's a \"4\" since this kind of anime should only be watched by guys and guys only, definitely not for girls with feminist ideas.",
            "date": "2016-04-05T13:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 215592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=215592"
        },
        {
            "content": "Schwarzmarken is a show that handles a lot of themes without turning into a mess. Its a show that has a slow pacing so I would not be for everyone however it makes for a good popcorn anime (anime that you can waste your time on if you have time to waste). \r\nStory 7/10 \r\nSchwarzesmarken follows a group of mech pilots in east Germany that is in a cold war situation where the berlin wall is still up. They are using mechs to combat a threat against humanity known as the beta which are these aliens. The main story is not about the mechs versusthe aliens but the pressure the pilots face at home where a corrupt government is breathing down their neck every second they are off the battlefield. As I said it is popcorn anime so the story is not the most major aspect what you come to see are the mechs fighting and the scenes where the corrupt government show their true colors. \\n\\n\r\nArt 6/10\\n\\n\r\nThe art used in this anime is kind of bland other than the characters faces and hair. Every character in the show are all wearing the same uniforms throughout the anime. All the backgrounds seem to be reused a lot for both off and on battle scenes. The mechs and aliens used where CGI but like the costumes all the mechs are the same just with a different color  for other groups of pilots. A lot of the animations used for aliens and mechs seem to be reused a lot in the fight scenes.  There is censorship in the scenes where we see aliens kill people which is half the screen being covered in black which is a problem since those are the scenes the aliens would have the most impact.   \\n\\n\r\nSound 5/10 \\n\\n\r\nThe music was not really memorable in this anime and neither where the sound effects. when watching the subbed version of the anime I liked how the characters where able to say German words and phrases effectively.\\n\\n\r\nCharacter 7/10\\n\\n\r\nThe squad of pilots in the anime consist of some likable characters(except Anette who was useless). The characters just want to fight the aliens but hate how they have to deal with spies from the government hiding among st them. It takes a while for characters in the anime to figure out who to trust. A lot of the squad do get a good portion of screen time while a few other characters in the main squad don't. The human villains in the anime are pretty cliche with a massive ego to boot which makes you wish to see them get their comeuppance at some point. \\n\\n\r\nEnjoyment 7/10\\n\\n\r\nAs I say this is a popcorn anime that I used to kill some time I dont think anyone can binge watch it because it does not absorb you or get you wanting more. \\n\\n\r\nOverall 7/10\\n\\n",
            "date": "2016-05-04T10:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 217855,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925361.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cyborg_Dragon",
                "username": "Cyborg_Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=217855"
        },
        {
            "content": "To describe this anime quickly\r\nThe BETA invaded in 1973 and have almost completely consumed the Continent of Eurasia. This takes place in 1983, the Minsk BETA hive in poland has activated and the BETA are assualting East Germany. At the Same time East Germany is At Civil war with itself in a four way faction war( Unificationists vs Nationals vs Soviet backed vs Western backed)\r\nIf you wanted more of what the first 2 episodes on Muv Luv Alternative : Total Eclipse was Schwarzesmarken is what you want\r\nThis Anime is Dark and shows us how stupid people can be during an alien invasion that could leadto human extinction. While throwing some curve balls, almost every episode leaves off with a major cliff hanger to compel you to watch the next episode.\\n\\n\r\nThe Art is good and seeing infantry getting Eating by BETA is a sight to behold\\n\\n\r\nThe sound nothing super exceptional but nothing bad\\n\\n\r\nDont have alot of time to get to know the characters though they are well done\\n\\n\r\nI loved every episode. Schwarzesmarken is what the Muv Luv universe is like (Not Total Eclipse)",
            "date": "2018-02-11T15:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 271295,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5021906.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheRedLine",
                "username": "TheRedLine"
            },
            "url": "https://myanimelist.net/reviews.php?id=271295"
        }
    ],
    [
        {
            "content": "ok..this is my first review in MAL webpage..the reason why i write this review because i want to let everybody know that this anime is quite gud for patience viewer.\r\nMuv Luv Schwarzesmarken take place way before the Muv Luv Total Eclipse. In addition to B.E.T.A invasion (slightly ugly than titans in AOT if u ask me) they add in some history plot like during the Cold War era , the splitting within Germany between West n East etc. To fight this SOB , eishi or we called as pilot will manned Tactical Surface Fighter or TSF..a humanoid jet fighter. From what i see..this animation isfar better than Muv Luv Total Eclipse. The character , music n other are slightly average but u can go through with it with ease.\\n\\n\r\nGive this anime a chance n patiently watch..if u cant watch this slow paced anime then u will never like other awesome slow pace anime like Steins:Gate .\\n\\n",
            "date": "2016-02-02T03:02:00+00:00",
            "helpful_count": 67,
            "mal_id": 209952,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4574594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkReaver24",
                "username": "DarkReaver24"
            },
            "url": "https://myanimelist.net/reviews.php?id=209952"
        },
        {
            "content": "So let me start off by saying \"I F**KING HATE THIS SHOW.\" Really I do. And yet, I can't find myself giving this show any less than a 10. \r\nHowever, the reason I hate this show is because the writers are dicks and they know it. So this whole show revolves around the Cold War Era. Much like in the U.S. with the Red Scare, there was a struggle in Eastern Germany about loyalty. People selling out their own friends and family for self-preservation. This is the shows main focus. The Mechas and Aliens are really second to the situation.\r\nWell in the first few episodeswe met X-Chan. There is serious suspicion about this character whether X-Chan is a traitor or not. There is one scene in I believe the third episode where they show X-Chan's \"evil smile\"... and that is it. That is all we have to work on to determine whether or not X-Chan is truly a traitor or a Red Herring.\\n\\n\r\nThis is why this show is truly brilliant . As I kept watching I was searching for something, anything, to whether to trust our suspect or not. I kept playing all possible scenarios in my head, searched for something I missed, but to no avail because there was nothing there. There was nothing I could decrypt. All I could do is watch the events unfold. We don't even find out the truth till almost the very end.\\n\\n\r\nThis isn't an accident. The writers want you to squirm. They want you to wrench and search to try to figure it out knowing very well you can't. They want you to question everything and create evidence in your head that you believe true that probably is non-existent. This very well replicates the Red Scare in America. There was no way to truly tell if you could trust someone. There wasn't magical signals to tell. All you do is hope that you didn't get accused.\\n\\n\r\nThis show is probably one of the deepest anime out there. This whole show is a deconstruction of the mystery genre. There are no clues out there for you to find. All you can do is wait for something to happen even though every second you will try to figure it out. You will assure your self that you know the truth when you don't.\\n\\n\r\nIt almost doesn't matter whether X-Chan is a traitor or not. What matters is they are implanting that idea in your head. And that seed will sprout.\\n\\n\r\nThe fact that the average is a 7 is almost a joke to me. If I had to recommend a show to anyone I think this would have to be one of the first ones YOU MUST WATCH.",
            "date": "2016-04-11T17:24:00+00:00",
            "helpful_count": 55,
            "mal_id": 216165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3580001.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lonelynightm",
                "username": "lonelynightm"
            },
            "url": "https://myanimelist.net/reviews.php?id=216165"
        },
        {
            "content": "So basically my mates and I decided to do a showing of a show this season and we chose Schwarzesmarken. \r\nIt turned out to be a pretty interesting and exciting masterpiece about human behaviours studies and complicated human relationships.\r\nNon-spoilerino summary: In an alternate version of the 1980s, the Cold War rages on even amidst an invasion of alien creatures. Set in communist East Germany, Schwarzesmarken tells the heroic tales of the country’s strongest mecha unit, The 666th TSF Squadron Schwarzesmarken (Black Marks), as it fights against the dreadful and looks-like-shit aliens, BETAs, and shows the West the superiority of communist doctrine and technology. \r\nStory 10/10:\r\nNoperfect story exists without plotwists. People likes Urobuchi’s works/masterpieces/craps for this particular reason. While it appears on the surface to be just generic mecha+harem anime, Schwarzesmarken stands out from the crowd thanks to its setting.\\n\r\nIt’s as much about the hell of living within a totalitarian communist state as it is breathing under immense war-stress as they are on to fight deadly aliens with giant robots. The people live in the fear of secret police, STASI, that a wrong word can send them to prison and get tortured as traitors. Thanks to this, you’re never sure which characters are trustworthy and which are informants, and this is the source of all the dramas later on. \\n\r\nAbove that, Schwarzesmarken simulates the wartime psychology of military combatants during the Cold War Era with East German precision. Characters in this show are more prone to act out of control and without normal common sense, which is this show’s true beauty. The way the story is told is revolutionary as well. Focus of the show is always shifting from one to another thus a large amount of information is able to be conveyed to the viewers. Schwarzesmarken manages to take the viewers by surprise everytime as it displays hidden symbolisms in every singular frames. \\n\r\nOn the other hand it shows a slight hint on the structural weakness of a non-democracy ruling institution. The secret police is fighting with the military and the politicians in front of a survival crisis—the invasion of BETAs. It just show communism won’t last and freedom to people is the ultimate solution to rule.\\n\\n\\n\r\nCharacters 10/10:\\n\r\nThe MC, Theodor Eberbach, is not the generic MC you can see in every show or justice-wannabe Shirou. He’s a normal dude like you and me who wants to go away from troubles. Though for sake of the plot he must save the world and get all the booties. He’s the most normal beings yet the most boring person in the show. \\n\\n\r\n*Spoiler*\\n\r\n-------------------------------------------------------------\\n\r\nExcept he bangs his sister.\\n\r\n-------------------------------------------------------------\\n\r\n*Spoiler*\\n\\n\r\nThe loli on the front cover, Katia, is nothing but a plot device. A defector from the West, believes that everyone can get along if they just sit down and talk, just your generic naïve character and moe trope. Annoying as hell as she starts speaking thanks to her VA, she literally does nothing and react to nothing. The female version of Raku from Nichijou, she is oblivious not to feelings but betrayal that will cost her life. She just exists because the story needs her to.\\n\\n\r\nIrisdina is the Shirou and the punching bag of the show. Full of justice and regrets of killing her own brother when he was accused of treason to continue her living, she decided to fight the ugly BETAs. As the leader of the 666th TSF Schwarzesmarken, she owns great booty and convinced the MC to save the world. Should be the OTP with the MC. \\n\\n\r\nAnd here comes the miracle that saves and carries the show, Lise. As Theodor’s step-sister, she joined the show before the climax. Because she is the climax of the show. Later revealed as a spy  from the STASI, she ,as all other anime little sister, adores his onii-chan to a obsessive degree. She later shows her true colour and sell out the captain, Irisdina due to her jealousy. The rollercoaster she brings doesn’t stop here as she is the main force to stop her precious onii-chan to rescue his love. Lise also carries a heavy role as the leader of the divided fraction within STASI. Basically she is just a cute sister that wants to dominate the country and live with her precious onii-chan happily ever after. For that she paid a heavy price including selling out her friends and her body to STASI.\\n\\n\r\n*Spoiler*\\n\r\n-------------------------------------------------------------\\n\r\n-----Of course she offers her body to her precious onii-chan. Every 2D imouto’s ultimate tactical weapon it is.----\\n\r\n-------------------------------------------------------------\\n\r\n*Spoiler*\\n\\n\r\nLise shows a conflicted and complicated personality that perfectly symbolise the twitched soul under communism supremacy. She performs numerous treacherous acts just to be with her precious onii-chan. She even sacrificed her purity so that she can secure a better future, just to be with her onii-chan.\\n\r\nThen she displays a truly brutal and violent behaviour that suits her yandere-imouto character seasmlessly. At the end she is just a tragedic little sister whose one-and-only wish is her onii-chan’s affection and love.\\n\\n\\n\r\nArt 6/10:\\n\r\nLooks miles better than that crap from Studio DEEN so it means Schwarzesmarken is a OK looking anime. Nothing to write home about it. Although the BETAs looks like utter craps, there is a scene where aliens that looks like balllsacks with eyelashes. Truly indecent yet not scary. RIP the mecha design, it’s just tin boxes moving around in this show.\\n\\n\\n\r\nMusic 7/10:\\n\r\nSchwarzesmarken got Fripside to do a pretty decent opening song. It sounds like Black Bullet’s OP. The ending fits the show pretty well too. The sounds effects in the show that emphasizes on “Mai Fatherland” and “Go and Die you Capitalist Pigs” enhances the show’s viewing experience.\\n\\n\\n\r\nOverall 8/10:\\n\r\nPlotwist and marvellous storytelling with an emphasize on wartime PTSD that happens along with a forbidden incest love, what can you ask for more?\\n\r\nSchwarzesmarken may not be the most “hard-mecha” such as Gundam or “silly-romance mecha” such as Macross, but it is a mindbending show that involves viewers to rethink the possibility of communism and most of it, the weight of a little sister’s love.\\n",
            "date": "2016-03-08T18:37:00+00:00",
            "helpful_count": 45,
            "mal_id": 212519,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3454089.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Melvin117",
                "username": "Melvin117"
            },
            "url": "https://myanimelist.net/reviews.php?id=212519"
        },
        {
            "content": "This is probably going to be my entryway into the Muv-Luv series despite it being a spin-off. I love how it gives a certain point of realism into the story, even though its littered with swarms of mecha-on-monter action. I watched this with my fellow co-workers but none of them seemed to enjoy it because it was too \"grim\", but for me, it was great. Not only does it portray each of the character's feelings very well, but what really shines through is the emotions that war brings upon them. The conflict, the struggle, & the desperateness of East Germany, It feels very real. Iloved how they decided to use historical nations reminiscent of WWI-WWII because it helps understand what's really happening under all the confusion. If you're solely in it for the mecha battles, its cool too, they're really action-packed, & long that it somewhat keeps me on the edge of my seat.",
            "date": "2016-02-09T19:44:00+00:00",
            "helpful_count": 42,
            "mal_id": 210538,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EmeraldTiger98",
                "username": "EmeraldTiger98"
            },
            "url": "https://myanimelist.net/reviews.php?id=210538"
        },
        {
            "content": "There are two kinds of people that might watch Schwarzesmarken: those who have played the Muv-Luv trilogy and those who haven't. And depending on which side you fall on, your view on this anime will be quite different, although both sides will have their own problems with it, albeit totally different ones.\r\nSo before I get into this, there are a couple things I'd like to clarify for those who are unaware. Muv-Luv is a 3-part visual novel series released between 2002 and 2006, the last part of which, Muv-Luv Alternative, is widely considered to be one of the greatest visual novels ever made. However, eversince its release now 10 years ago, the company behind it, Age, have done literally nothing other than create a myriad of side stories, spinoffs and fandiscs based on the Muv-Luv universe. They've never even tried to come up with a new franchise for a whole decade now, instead they've decided to just keep milking their one and only masterpiece until it can be milked no more, which is... understandable I guess, but still pretty saddening. In any case, the Muv-Luv trilogy has never gotten an anime adaptation and perhaps never will, but in 2012 there was actually an anime release... based on one of its countless spinoffs called Total Eclipse. Not only was this a rather strange decision since any anime-only viewers would miss out on tons of plot elements due to being unfamiliar with the main series, but also Total Eclipse turned out to be an incredibly mediocre anime in and of itself, focusing just as much on fanservice as actual story progression, if not more. And now, 4 years later, history repeats itself, as yet another one of the franchise's spinoffs has gotten adapted, namely Schwarzesmarken. But of course for any anime-only viewers, the exact same problems as last time still remain.\\n\\n\r\nThe good news however is that the story of Schwarzesmarken is largely separate from the one of the main story of Muv-Luv. This is because a) it's a prequel, taking place almost 20 years before the events of Alternative, b) the character cast is completely different, and c) it plays out on the other side of the planet, in Germany instead of Japan. So in that sense it works out fairly well as a standalone anime... but far from perfectly. This is because Schwarzesmarken intentionally leaves out just about all initial exposition about the state of the world itself, any detailed information about the BETA's functionalities and tendencies, as well as a lot of the planet's history ever since the BETA's initial sightings on Mars in 1958 and their eventual invasion of Earth in 1973. And this is all simply because the anime assumes that you already know all that from playing through Alternative. So it's not that the story won't make sense for anime-only viewers (it will), but you'll miss out on a lot of depth and detail. It also works the other way around as you'll be able to relate a lot more to events which have previously only been mentioned briefly in Alternative as it plays out in real time here instead of something which just happened far away and almost 20 years prior from the game's perspective.\\n\\n\r\nOverall though, Schwarzesmarken is still a pretty big improvement over Total Eclipse at the very least. The tone is a lot more on point with what Muv-Luv is supposed to feel like, with a lot of death, drama, politics and tragic events (though not as much sci-fi). There is also pretty much no fanservice at all this time around which I'm very thankful for. So atmosphere-wise Schwarzesmarken is a lot more similar to the main series, but there are still some clear differences. The most notable one would probably be the direction the plot goes in, and specifically who the real enemies in the story are. In the main series, it's naturally the BETA that everyone is fighting since humanity's mere existence is on the line, but in Schwarzesmarken they almost feel like the secondary threat a lot of the time. Of course there are still a lot of battles between the human TSF squadrons and their alien invaders, but in this case there seems to be just as much internal conflict as external. This is because this takes place in Germany in the early 1980s, which of course means that it's in the middle of the country's split in two, I.E: West Germany and East Germany. The squadron the story primarily follows is the East German Army's 666th TSF Squadron, a.k.a. the \"Schwarzesmarken\". They do their part in fighting the BETA on a daily basis, but they see their western neighbors as just as much of a potential threat as the aliens themselves, and the west is of a similar mindset. It's almost like a three-way war going on, except that the two human sides are having more of a cold war standoff and throwing insults at each other most of the time, but occasionally end up clashing head-on as well. This is unsurprisingly also used as a consistent and reliable method for generating drama, as some characters find themselves on different political sides despite caring for each other on a personal level. And on top of that there's also the good old truth that killing off main characters is not exactly something Muv-Luv has ever been afraid to do, and although it might not exactly be on the level of the main series, Schwarzesmarken is still not afraid to do the same. It gives the post-apocalyptic story a much greater sense of realism and intensity that way, and it definitely pays off.\\n\\n\r\nSchwarzesmarken is definitely not a bad anime by any means, but I still find it a bit difficult to actually recommend it to people. Because if you haven't played through the Muv-Luv trilogy prior to it, then you should definitely go do that first, and if you have played through it then try as you might but you'll find that it's almost impossible to not end up subconsciously comparing Schwarzesmarken to the main series as you're watching it. There will constantly be this nagging voice in the back of your head saying \"I wish I was just replaying the real game instead\". Schwarzesmarken isn't bad, but just by being part of the Muv-Luv universe the expectations on it will be so much higher than it ever has a chance of living up to, and Alternative is just such an incredible work of art that Schwarzesmarken ends up looking a lot worse than it actually is simply by being compared to something so unreasonable. I think the only way you can truly see Schwarzesmarken for what it is is by first playing through the visual novels and then literally forcing yourself to go into the anime with the lowest expectations possible. If you tell yourself prematurely that it's probably going to suck, then you might be positively surprised. But if you don't, you'll probably just be disappointed.\\n\\n\r\nThough pretty much all these problems would be solved if Age just decided to actually adapt the real Muv-Luv series already... which I've actually heard some rumors as of late that it might happen in the future after Alternative's localization Kickstarter project turned out to be such a huge success a few months ago. Maybe in another 5-10 years, who knows. One can only hope.",
            "date": "2016-03-27T11:20:00+00:00",
            "helpful_count": 36,
            "mal_id": 214385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=214385"
        },
        {
            "content": "When you see the cover image or read the Synopsis, you might just get cancer and think its terra bad and boring, but its actually REALLY ****** GOOD.\r\nAnime is set in germany which is pretty weird, using mechas and fighting aliens called BETAs, sounds bad for most people. Germany is split into east and west and they dont like each other, like korea.\r\nMy favorite part about the anime is its realism to politics you could say? MCs are the good guys and then there are bad guys ofc. Good guys do the right shit and bad guys try kill the good guys LEL.\r\nDont wanna spoilso review kinda vague( really vague actually huehue)\\n\\n\r\nBasically this review is to make anyone who reads this watch it GO WATCH IT PLZ ONEIGAISHIMASU\\n\\n\r\nguarantee good shit\\n\\n\r\n*Thoughts after finishing \\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\nIncest is daijoubu (in anime at least)=good shit :)",
            "date": "2016-03-08T01:48:00+00:00",
            "helpful_count": 35,
            "mal_id": 212481,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5034187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mejo369",
                "username": "mejo369"
            },
            "url": "https://myanimelist.net/reviews.php?id=212481"
        },
        {
            "content": "Having seen a fair amount of sci-fi related series and mecha as one of my favorite genres, Schwaresmarken stands out as a strange show to me. It’s not because the series is set in the same universe as the Muv-Luv franchise or based on a light novel. Rather, the series is more like a political flair that’s masked by the intense violence of creatures, monstrosity known to their world as BETA.\r\nFirst let’s get a few things out of the way. The series is a spin-off series based on the light novel. (although a visual novel also exists) Historically, the timeline began around the late 1970swhen BETA arrives in Eastern Europe. Eastern Germany gets besieged by them and mankind suffers heavy losses. That is, mankind builds the TSF (Tactical Surface Fighters) that basically translates into heavy duty mechanized machines designed to fight them. 5 years later, Eastern Germany is still suffering with its weakened forces and the Warsaw Pact isn’t holding them much longer either. However, they are supported by the infamous Nationale Volksarmee's 666th Tactical Surface Fighter Squadron, also known the “Black Marks”. The story tells of this infamous group as they fight for survival not only on the frontlines against BETA but also within its own forces, political struggles, and national conflicts.\\n\\n\r\nApproaching this series with trepidation, Schwarzesmarken’s storytelling is sometimes decent, sometimes bad, and then sometimes just dreadful. There’s a lot of mixed feelings when diving into such a complex universe. Furthermore, the show is only a 1-cour so terms like ‘rushing’ or ‘butchered adaptation’ can be applied here. To be fair, enjoying this series at fullest would include an understanding of the Muv Luv universe. However, watching this series as a standalone is possible and the experience getting out of the show may be enjoyable. That is, if you really and I mean, really like what it has to offer. \\n\\n\r\nWhere to start really? The first episode easily establishes a few factors. BETA is on the rampage in Europe and the show isn’t shy to show death on screen with an immense amount of violence. There’s some emotional storytelling going on as well when we see pilots during their last moments. In essence, it should come to no surprise that Schwarzesmarken is trying to paint the idea of BETA being humanity’s ultimate enemy. Or is it really? Behind the frontlines, there’s a fair amount of political and interpersonal flair going on. You see, West and East Germany haven’t exactly been the best of friends. The show easily makes it clear that the two are only united for the purpose of surviving and destroying a common foe. By historical standards, the Warsaw Pact is a collective defense treaty but in this series, it’s almost like an armistice. West and East Germany have their own ideals so naturally, they can’t really get along. One of the major forces in the series besides the 666th squadron is Stasi, an official security force of German Democratic Republic that’s designed to enforce their laws. Spies, treason, and disobedience are met with punishment including death. Furthermore, they have control of a massive intelligence network that almost serves as this series’ version of Big Brother. Sounds scary right? To be quite honest, humanity’s enemies aren’t just BETA but also making an enemy of themselves. And it’s a sad story when we see the body counts.\\n\\n\r\nAs complex as the show seems, the characters aren’t too difficult to understand once you really see their background stories. Theodor, the main male protagonist has suffered losses in his life including the assumed death of his sister. Irisdina Bernhard, the captain of the squad has been rumored to backstab her own family to get to where she is in the present. Then, we have Katia who tries to desperately appeal to her ideal of “let’s put our differences aside! If we all unite, we can defeat the BETA!” Such an illusion really. The show makes it clear that there’s no genuine friendship between certain nations. Nonetheless, the character cast gives the most prominence for these three characters while the others are mainly supporting players. That’s sad to say as I’ve heard the light novels gave more characterization emphasis on characters like Sylvia, Pham, Beatrix, among others. As I’ve mentioned before, the adaptation serves more of a story to depict the nature of sci-fi warfare. The addition of the military, political conflicts, and personal battles are attempts to create an emotional story. Does it work? In some some ways, yes. However, the majority of the show feels like it tries to stuff down the viewers’ throats with emotions that really is weakly timed. Sure, characters die on and off but it does it really give strong reasons to why we should care about them? The first half of the show has several characters die for mankind’s cause. But to this end, I don’t find their losses to be memorable. It’s not just how predictable how some deaths occur but rather their lack of characterization. The only characters that seems to be relevant in the show are Theodor, Katia, and Irisdina. Later, we also see a surprise character return to the series although I can hardly call it that. In terms of relationship dynamics, that’s hardly anything to take home to. Theodor’s a cold guy who can work with others on a professional level but rarely ever opens up to others. His childhood is tragic and in a way, I guess we should feel sorry for him. Katia’s relationship is perhaps the lightest in the show and also inspires him to fight the good fight. Then, there’s Irisdina, probably the least trustworthy main character because of the rumored gossips about her past. Although on professional standards, she does have a good relationship with Theodor and Katia. The show also seems to establish that Irisdina and Beatrix (a prominent member of Stati) has some sort of history but that’s overshadowed by the actual conflicts going on. I refer to the one about war against BETA.\\n\\n\r\nIn terms artwork and design, it’s mostly mediocre level in terms of technical quality although I do give some praise to the studio for portraying the technological aspects of the series. It manages to capture the grim atmosphere with the bloodshed and death scenes. And while the pilot suits are designed to make the women look like eye candies, it is also quite convincing. Character expressions are important so the series did its best to capture their emotions. In retrospect, it did a fair job as every episode seems to make their reactions look and feel real. In addition, the TSF are designed with a decent amount of effort ranging from its arsenal, structure, and capabilities. Action wise, the show is powerful enough to convince us that it’s a sci-fi warfare despite the CGI. On the other hand, BETA’s designs looks silly with the insectoid-like eyes and absurd body proportions. They look like aliens that popped out of some B-movie.\\n\\n\r\nSoundtrack is actually quite important now that I’ve taken the show at a close glance. Remember, the series is grim without much humor but portrayed as a sci-fi warfare story. In other words, the show did its best to portray that atmospheric setting with more melancholic music. Either way, it does seem to work out in that regards when delivering its intentions. However, character voice mannerism is a weak sign of the show as there’s nothing really a character that stands out individually. In fact, Katia’s voice sounds like a child for someone as part of the military. On the other hand, I do like how characters like Beatrix is portrayed with their manipulative nature expressed by voice acting.\\n\\n\r\nAfter watching Schwarzesmarken, I have to conclude and say that the show is a brave attempt at making this into a memorable war story. But what does it really achieve? A poorly directed and produced series that seems to not be able to connect with itself. The story feels loose while the info dump has a strange pacing. Furthermore, there’s a lack of characterization on most of the 666th squad. I think the show is geared at more of an audience that is very familiar with the Muv Luv universe. To casual fans, the experience isn’t going to be something great and shouldn’t with what it presented.\\n",
            "date": "2016-03-28T06:05:00+00:00",
            "helpful_count": 29,
            "mal_id": 214521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214521"
        },
        {
            "content": "So about 10 hours ago I finished Schwarzesmarken. \r\nAlthough it's not the best show of the season, it's the one I enjoyed the most. Surprising considering it goes up against KonoSuba. \r\nOh and don't stop watching straight after the credits end, there is always an after credits scene which is important to the story. \r\nHistorical Authenticity:  I'm not allowed to use the word \"accuracy\" because there were no aliens in Germany. German text appears in place of Japanese when written down and from what I can tell it's very accurate. Ignore that Schwarzesmarken is grammatically incorrect. There is a reason behind that. The endcard reads \"Fortsetzung folgt\" which translates to Episode follows (or To be continued as Crunchyroll prefers.) \\n\r\nOverall from what I had seen the show remains faithful to East Germany, http://i.imgur.com/5E9KJU3.png?1. Aside from changing their plug sockets.\\n\\n\r\nStory: As you know, 1980s East Germany. Poland has fallen leaving them the last barrier to western Europe. They had me caught at 1980s East Germany. I am interested in Cold War history and what is basically fascist rule. I always love the idea of secret police, such as the Stasi. Which is great because who appears in the show? That's right, the Staatssicherheit (German for State Security). I've never watched or played Muv-Luv but I am told politics plays a large role in them as it does in Schwarzesmarken. Remember the aliens attacked humanity? Yeah, they aren't the enemy. The Stasi are. From what I can tell that is the message of the show. The humans are your enemy. It's pretty thrilling. If I was to go any further I would be spoiling the show. Honestly you just need to watch it.\\n\\n\r\nArt and Sound: I've been told the CGI in this show isn't as good as others but it's good enough to look at. It works as well considering the BETA are aliens are shouldn't look like anything on the Earth. As for character designs they are decent enough. As usual in anime the Asian one doesn't look Asian, but she is wonderful anyway. Same with the Polish one. There were two German stereotype girls and Irisdina's hair was pretty to look at. Katia wears too much eye liner. \\n\r\nAs for sound I've been listening to the Ed song, Kanashimi ga Jidai wo Kakeru, while I write the review. It's peaceful. The Op song white forces gets you excited to watch the show and it was well implemented in the final episode. Voice acting was good and I don't think the actors and actresses messed up German pronunciation. There was a stand out song that played in episode 11 which was very epic for the situation. I'll find it hopefully. \\n\r\nOther than that I can't think of any stand out songs. Maybe I'll find them when I do a rewatch, hopefully that rewatch will be on Blu Ray. \\n\\n\\n\r\nCharacter: We needed two courses/24 episodes. Although I liked the characters as much as I could I still couldn't get attached to all of them. \\n\r\nIrisdina does have a prequel novel that I don't think has been translated by anyone yet but the show does manage to get you understand her views. \\n\r\nTheodore Eberbach is our harem leader, except the show never feels like a harem. If you watch the show you will see how the characters interact with each other. \\n\r\nKatia wears too much eye liner.\\n\r\nAs for the other members of Schwarzesmarken they are good characters and as I said, you will need to watch the show to understand how they interact. \\n\\n\r\nEnjoyment: I was \"excited\" to watch Schwarzesmarken every week. Just like how the people who watched One Punch Man felt. \\n\r\nAs a person that likes politics and \"history\" this show was great for me. It was always tense and after episode 1 it showed how dark and deadly the show can be. \\n\r\nI enjoyed it so much I want to read the Light Novel and play the Visual novel. \\n\r\nWhat's that? It's on Steam Greenlight: https://steamcommunity.com/sharedfiles/filedetails/?id=651346103\\n\r\nGo vote for it if you want more from the Schwarzesmarken Kompanie.\\n\r\nThey will take that as interest for a second visual novel and a translation for the Light Novel.\\n\\n\r\nOverall: After opening the Steam link and listening to the opening for it I am feeling pretty good. The show has interesting themes and characters. It's a must watch for those that like political drama and the Muv-Luv universe. \\n\\n\r\nIn short you should watch it. It was wonderful.\\n\\n\r\n\"Der Weg geht weiter...\"\\n\\n\r\nDeutsche Demokratische Republik 666th TSF Kompanie, Schwarzesmarken.\\n\\n\r\nAufweidersen.\\n",
            "date": "2016-03-28T07:21:00+00:00",
            "helpful_count": 22,
            "mal_id": 214528,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/IKnowBestu",
                "username": "IKnowBestu"
            },
            "url": "https://myanimelist.net/reviews.php?id=214528"
        },
        {
            "content": "Black Marks\r\nBlack marks also known as (Muv-Luv Alternative : Schwarzesmarken) is the new cow to milk out of this franchise. First let me clarify that this is a Light Novel adaption, just like total eclipse, written by YET ANOTHER author. Now, when you adapt something like that into anime you’d expect the script writer and the director to bother fixing the issues that total eclipse’s adaption had, but nope, they did not. They not only managed to make it even worse, they also decided it’d be asmart idea to have LIDEN FILMS animate it, now they managed to pull of Arsan Senki fine, even with issues here and there, but as I said in my TE review, you do not give a studio that doesn’t have enough money to produce a 2-cour mecha show without resorting to CG mechs. Considering 80% of what is on screen are mechs and giant aliens, if you have them cg not only does this kill the animation, but the entire fun of the show. Even a poorly done show like A/Z was more interesting, and that was done by A-1 & Troyca with even worse CG.\\n\\n\r\n- SECTION 1 ART & ANIMATION -   \\n\\n\r\nAs mentioned above, the animation mostly consists of CG mechs, regardless how fluent it is, it feels out of the place and unnecessary, even the action scenes feel weak in comparison to Total Eclipse, which was way worse in terms of production budget. Actual drawn scenes have okay animation as in they don’t do any drastic movements, lazy, but nicely covered. \\n\r\nThe art designs and character design is decades better than TE, but then again it suffers from the exact same issues as the previous title did. Dull and repeating backgrounds that offer little variety and mostly covered in white because of the snow, which at this point pretty much shows that they were trying to save as much budget as they can from this so they can produce Arslan S2 with minimum production issues, which is sad to see as they could’ve handled it much better. Character designs look almost identical, just change the hair color and you’re done.\\n\\n\r\n- SECTION 2 DIRECTING & SCRIPT –\\n\\n\r\nThe directing in this show is all over the place, the guy thought it would be a smart idea to have the characters take their setting and outcomes so seriously that that it makes attack on titan look like the little baby in comparison, there’s usually a level of how much the voice actors have to get immersed to make you feel like you’re really there, like you understand them. However, if you have them take it WAY to seriously, they’ll come out ruining the moment or being too noisy. For example Attack on Titan was a nicely animated drama, it had top tier direction and immersion, but the voice actors tried too hard to make it sound like its life or death, which led to the most anticlimactic outcome for me. However, for short stories it worked, like Levi’s ova’s, so you’d expect it to work here as well, no chance bud.\\n\\n\r\nScript writing is almost average… As in, they managed to get it to the setting properly, but still feels uneasy to read through, there are very weird moments example where she sleeps with her brother because she felt depressed because no one trusted her, like WHAT?! During action scenes and crucial moments it’s below to average at best, having melodramatic characters and ideals that seem extremely out of place for what this is, it’s even a political drama as well as an alien war drama because NATIONALISM! And REASONING! Corruption and such, so when he tries to make the script for one scene it comes out even worse in the next, so you’d expect the director to even it out, but no it didn’t happen. He was over blowing the scenes with characters trying to make it seem like hell when you can’t even relate to them.\\n\\n\\n\r\n- SECTION 3 PRODUCTION VALUES & MUSIC –\\n\\n\r\nProduction values aren’t even on the norm to be considered decent. As 80% of the show is CG, and the animation is at a minimum the voice acting over done and script thrown out of the window, there is almost no satisfaction in terms of watching it, the designs are forgettable and basic; uniforms are standard with no unique touch to them.\\n\r\nThe music is even more forgettable, it’s better than Total Eclipse that’s for sure, but I cannot recall any specific track, maybe the one that played during episode eleven, but damn, it seems to be very difficult to hit the proper score for this, I mean, the Visual Novel adaption of the Alternative Light Novels had 30 tracks, but mostly used 5 of them on certain sections, the others were so played for less than a minute so you’d forget them, what I aim to say with this is that, it had almost no music being played, and yet. Was more memorable and better directed and presented than this misery, if you so want to see Schwarzesmarken for yourself, I’d suggest you turn off your brain if you want to get past episode 4. Or read the Novels it is based off, as they are most definitely better. \\n\\n\r\n- FINAL SECTION ENJOYMENT –\\n\r\nHaving liked the Alternative VN, I wanted to give this a go to see if it’ll be as interesting as I expected it to be, but was disappointed severely with it’s production and presentation, it seems these kinds of stories need at least 20 episodes to be something more or a long running 10-15 novels (50 hour if it’d be a VN) to flesh out and finish it the story. However, with the budget it got and timeslot it had to run through, it couldn’t be more than a mere distraction. I disliked the series after the 2nd episode and it started getting on my nerves towards the end. I highly suggest you look elsewhere if you want a war drama; it’s slightly better in terms of production than TE, but worse in terms of script and direction, so it fails to deliver the expectations and would leave you wanting this to be much better. \\n",
            "date": "2016-04-10T08:45:00+00:00",
            "helpful_count": 10,
            "mal_id": 216024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4053205.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seppiroth32",
                "username": "Seppiroth32"
            },
            "url": "https://myanimelist.net/reviews.php?id=216024"
        },
        {
            "content": "Overall  (7/10)\r\nRight of the bat, I'm gonna say it's not a great anime, it really isn't. High Average at best, but cut it some slack. The 12 episodes given as screen time was just *way* too short to give the whole story justice. It's dark, but the nitty gritty details of the whole thing aren't really highlighted, they give you a few shots just to get the general idea. I'd say that they actually conveyed the main points and prompt pretty well, but as a lore enthusiast, I can't help but be disappointing with the lack of content. So much potential down the drainprobably thanks to them having to cut a lot of the content out due to this restriction. It would have felt better if they gave it 25 episodes. Pity\\n\\n\r\nHowever, as a follower of the Muv-Luv series, I couldn't help but watch the whole thing until the end. It was refreshing to see and there haven't been too many mecha animes recently (relatively speaking) that i can recall.\\n\\n\r\nSTORY (6/10)\\n\r\nIt tickles the history nerd in me to see someones take on a crazy question: \"What if very anti-human aliens decided to visit Earth during the Cold War?\"\\n\r\nAn already unstable period becoming even more unstable! Perfect, what more could you want?\\n\\n\r\nThe world has just 'recovered' from WWII and everyone should be good with things, but humans aren't a peaceful bunch. Queue the Cold War! Red Vs Blue! But wait, the BETA appear, maybe people can finally get together, trust each other, and work as a cohesive group.\\n\\n\r\nNah, screw that, who needs that when you can get all the power you want? The Black Marks portrays the bad side of people and how dark politics and war can really get. Forget the romanticizing, if you're new to dark anime and you want to get a teaser of what the dark side is like, this series is a good introduction. See how humans are just as much a problem as aliens are!\\n\\n\r\nI personally like stories like this, which is why i watched the thing in the first place. I find that Despair and Hope (especially in the middle of a war) are very exciting themes to any anime, and the onset of an seemingly unending alien force that wants to annihilate you, your family, your cow and every one else to be a good prompt for even more themes.\\n\\n\r\nThere are a *few* plot holes that i wish they filled out properly. Nothing major, but they did add one too many spoons of Deus Ex Machina for my taste. Then again, I could just be negative like that. Entertainment like this wouldn't be entertainment if it was completely realistic, so i think it went down fairly smoothly\\n\\n\r\nArt and Sound (6.5/10)\\n\r\nThe OP and ED aren't bad, but they aren't the best.\\n\r\nI'm sure they can get some peoples blood up, for sure, but\\n\r\nI'm just not the type to look at the music of an anime into that much detail.\\n\r\nIt's SFX where quite nice. It sounded quite typical for a mecha/war anime, but not cheesy or corny. \\n\r\nThe art seems like it's new-gen art on a budget. It fills out the basic ideas of many of the images, but some details were not given any effort, such as the deck of the battleships in one of the scenes, or the uniform details on some of the characters.\\n\r\nThe art isn't stiff, however, and most (if not all) of the parts fitted well into the whole\\n\\n\r\nCharacter (7/10)\\n\r\nI actually liked the characters in this one. I'm biased, deal with it.\\n\r\nMost didn't lack substance, considering the time of the anime and most of the 666th squad seemed to build on something at least. The members were given equal attention which made them fairly emotionally invest-able to the watcher. There were some lines, however, that didn't seem to fit and felt like they were put there just to give weight to the current event or character for that one single moment, so it was a little shallow.\\n\\n\r\nEnjoyment (9/10) (Slight Spoilers)\\n\r\nI gave it a Nine for a few reasons:\\n\r\n-It's a dark anime. I like dark anime\\n\r\n-Mechas!\\n\r\n-Cold War Era + Mechas! Aww yeahh.\\n\r\n-Politics, an old time favorite of mine, grinds my gears cause it's a real and valid thing that happens. Always nice to see how the story ends.\\n\r\n-People actually die in the squad, It's kinda realistic!\\n\r\n-They continued Muv-Luv! Yussssss, i thought it was a dead series.\\n\\n\\n",
            "date": "2016-09-26T08:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 230277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5725691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FearenRehnet",
                "username": "FearenRehnet"
            },
            "url": "https://myanimelist.net/reviews.php?id=230277"
        },
        {
            "content": "I don't normally write reviews, but when I do it's because I feel the need to express an opinion that may not be the popular one so that people aren't mislead by the oh-so-common mob-rating mentality that we've all seen time and time again. I mean, it makes sense, people will go to rate something and if they're too far from the average may re-think their rating in order to be closer to normal. It's a psychology thing...anyway, on to my review.\r\nThere's no way this deserves to be (as I write this) ranked #4492. On the other hand, I don't know if it really deservesto be in 133 peoples' favourite lists, but I can at least wrap my head around why certain people would drop this in their top ten. Really, on the surface, it's another generic mecha...okay, yeah, it's a fairly generic mecha through and through but wait! There's more! The setting is definitely a breath of fresh air for me, there hasn't been another one like this in a while that intrigues me. And while the characters aren't extraordinarily special, they definitely grow and become quite unique as the show progresses - even when you get down into the multitude of side characters. Heck, there are a lot people who have < 5 minutes of screen time in every episode put together that feel like they have their own unique personality which is extremely impressive considering the number of side characters (I'm not even talking about the main supporting...well, harem I guess). Sure, a lot of the main characters are fairly stock, but I think the effort that went into writing good extras balances that out a bit.\\n\\n\r\nI can't help but feel that people pegged it as one of the few promising shows this season on Crunchyroll and then saw the generic trash it was pretending to be for the first couple episodes and gave up on it (but obviously not before dropping a trash review on it). \\n\\n\r\nDo I think it's a perfect mecha? No. But do I think it at least deserves to be in the high hundreds or low thousands? Definitely. It's sure as hell better than Aldnoah.Zero's second season and arguably better than the first; also, once the last couple episodes come out, I'm almost positive I'll be able to say it's better than the first season too. \\n\\n\r\nDo yourself a favour and give it a watch through to the end, it definitely finds it's groove around mid-season which makes the overall quality match up a lot more with the great art, animation, and sound/music choices. If you like mecha, you'll like this. If you hate mecha, you'll probably appreciate the world history and politics. I do at least recommend you give it a shot if the expository history lesson in (I think) the first episode intrigues you at all, even if mecha isn't your thing. I like to think there's a reason that the actual reviews (probably from people who have invested a little bit of time in this show) all come with quite high ratings.",
            "date": "2016-03-10T02:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 212603,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4722136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/scottishrob13",
                "username": "scottishrob13"
            },
            "url": "https://myanimelist.net/reviews.php?id=212603"
        },
        {
            "content": "This anime is our entry to the Muv-Luv universe and has shattered our expectations. This is worth watching\r\nThis anime is mainly a spin-off and takes place long before Muv-Luv's main events during the earliest stages of the BETA invasion, during the Cold War and the splitting of Germany. We like the historical add-on to the anime plot!\r\nDespite there being mechs used, they aren't used in a cliche manner.\r\nThis anime is really good to be honest. It has good art quality with nicely saturated colors and plenty of detail. The audio is also extremely good as well, having a deep cinema-like feel to it.\r\nThis anime honestlyfeels like it has some aspects from Evangelion and will take a bit of time to watch, but we recommend it to everyone.\\n",
            "date": "2016-03-21T12:36:00+00:00",
            "helpful_count": 9,
            "mal_id": 213548,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208294.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nazo-The-Weeb",
                "username": "Nazo-The-Weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=213548"
        },
        {
            "content": "Schwarzesmarken is an anime that focus about human rivalry and political tension in the middle of a war with alien invaders. I think this anime got ignored (maybe because of it being of muv luv universe or being mecha which a lot of people seem to dislike) but I want that people would give a chance to this great anime.\r\nSo as said Schwarzesmarken focus on the humans in Europe (east Germany to be precise) and about their on going war with the BETA, an alien invaders that took most of Asia in a very short time. Being the last defense line of Europe, the eliteunit of \"Schwarzesmarken\" need to defend their country while also dealing with secret police, political tension with west Germany and the UN and of course internal conflicts. The show does a great job showing us that even in the face of humanity fiercest enemy, humans still won't get along and fight each other, possibly risking everything to get their ambitions. \\n\\n\r\nWe see ideals clashes and political discussions which are very interesting, but we also get a good balance of action-mecha fights and military operations, whether it's against humans or against BETA. The story is without a doubt the strongest point of the story.\\n\\n\r\nUnfortunately, it isn't the same for the characters. There is a large cast and we can't get enough focus about everyone. Sure, the main character Theodor Eberbach start as a schmuck and get a character development. But we can say it only about him. The rest are either without personality, or with one gimmick that make them who their are (one is a bitch, one is a strong head etc). \\n\r\nWe have also Katia, which is a great character. While at first seems like a Moe blob that only cries, she is tough and have strong personality-but Katia being cool doesn't fix the rest of the characters-problems that could be fix with more episodes and more time to focus about them. \\n\\n\r\nFor example Beatrix brehme, which built up to be a big villain, was  a cardboard character without nothing to make her stand out except her cool design, a shame, really.\\n\\n\r\nThe designs overall were good. There was a lot of doubt about it before it came out but the art and animation were good. Nothing that stands out, but good. The voice acting was excellent. \\n\r\nThe music fit nicely to the show, and was pleasant to hear. \\n\\n\r\nOverall, Schwarzesmarken is a great anime. I enjoyed every second of it. I think more people should give it a chance because it was mostly ignored when it aired. The only people who paid attention to it were fans of the franchise, and I believe that even if you don't know Muv Luv or don't want to play the visual novels, you will still enjoy it, as a solid series with war setting and great Mecha battles.\\n",
            "date": "2016-04-08T06:50:00+00:00",
            "helpful_count": 7,
            "mal_id": 215821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647204.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PunkChinaDoll",
                "username": "PunkChinaDoll"
            },
            "url": "https://myanimelist.net/reviews.php?id=215821"
        },
        {
            "content": "I watched it when it came out, so im a little late on this review but whatever.\r\nI have some extremed mixed feelings for this series. On one hand, they have charecter development and even deaths and some extreamly well made drama at some points but at other moments in the series I was bored as f*ck. \r\nI would have given this a 6 or a 5/10 if it were not for the last three episodes because those were reeeeally good. \r\nFirst time I almost started crying (I never did cry but at the same time, i never have to any of the animes i've watched).\r\nsoshould you see it?   Yeah, if you are patient you should because it pays off in the end, and I do not regret seeing it. Minus points for the fanservice tho.",
            "date": "2016-09-02T09:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 228115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5009346.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jolle808",
                "username": "Jolle808"
            },
            "url": "https://myanimelist.net/reviews.php?id=228115"
        },
        {
            "content": "This review is going to make a lot of comparisons to the original visual novel series of Muv Luv, expect a very bias review. If you are a visual novel/mecha fan I suggest you avoid this series and read the games first so you don't get spoiled. Chomp! ect.\r\nAs a big fan of the Muv Luv visual novel trilogy I was pretty unenthused to hear that a spinoff called \"Schwarzesmarken\" was being made into anime based on the light novel series of said name.\r\nWhile I am a fan of the original vn I cant say I appreciate Age trying to make a universe out ofthe series, the whole point of the original series was that it was a parody of mecha tropes in mainly 90's mecha anime and took a bunch of walking trope characters and set them in a misery filled war against campy/horrifying looking alien creatures.\\n\\n\r\nThe source story spent alot of time making you like these generic characters and actually care about them when they were placed in the worst situation ever but Schwarzesmarken takes itself a little too seriously without making you care for its own new cast beforehand.\\n\\n\r\nThe main character, Theodore, does a pretty funny personality flip between the first two episodes from, uncaring edgemaster to a patriot fighting for freedom. It comes off as really rushed, like the director had no clue how to make the reveal that Theodore was a broken person since he lost his sister and just made it more matter of fact like.\\n\r\nI think Theodore would have been a little more interestering if they let his stay an asshole for a little longer so that when he actually starts caring about the things happening around him the impact for the viewer would be more satisfying.\\n\\n\r\nWhile Takeru, from the original vn, was a very basic character also he was more like a self insert for you to experience the other characters and learn more about the rest of the cast and then share his pain when his way of life was destroyed and replaced by never ending fighting. Theodore kinda is just there since you need to have at a male character in this almost fully female cast.\\n\\n\r\nEvery character in this show is boring, I can't even remember the names of most of them and I have no clue why I should care about anyone aside from the fact that the evil Germans are really, really evil. They show this by having the bad guys torture people and have really sick smiles of enjoyment while doing this, like really? These are the bad guys? Shits as subtle as having them kill a cat and pushing an old women down stairs.\\n\\n\r\nKatia has very few scenes with Theodore so you don't really feel a connection between them, they just seem to work together. Theodore cares way more about banging his sister then any other character in the show and it makes it really awkward when people start dropping like flies towards the end and they play it off like Theodore lost a precious person that could never be replaced. Like when the hell did he even talk to them? I'm going to just assume that a lot of content was cut from the light novels to fit into the 12 episodes.\\n\\n\r\nI did like the CG animation in this show, I normally hate CG but the snow filter then ran on every single mecha scene really disguised the other wise ugly cg movement. Still am dreading the new CG dystopian anime future that is coming though.\\n\\n\r\nThis show is pretty much just a commercial for the light novel series that has ended and the new visual novel adaption that has part 1 released and part 2 coming out later. Expect rushed scenes of exposition and plot points that solve themselves a little to fast. I would suggest you check out the Steam green light page for the Schwarzesmarken visual novel in English in hope that we can get a more complete well written version of the story because it does have some nice mecha designs and Katia is pretty cute if annoyingly idealistic.\\n",
            "date": "2016-03-27T20:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 214472,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3431123.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeWeebGod",
                "username": "AnimeWeebGod"
            },
            "url": "https://myanimelist.net/reviews.php?id=214472"
        },
        {
            "content": "although Schwarzesmarken is set up as spin off of the muv luv:TE but for me it feels like a prequel rather then spin off really, since the mech(almost the same) and the beta(they are still the same but there are new enemy like fortress type) but i enjoyed and satisfied with each episode that came out.\r\ngood mecha fight, good character progression and story phasing, and well balanced between story and battle makes it worth the time i spend watching this.\r\nand the story itself can teach you about history to, about the revolution of east german(i hate history classes) with it's own unique story progress andnot make me confussed about it until the end of episode that is the one that makes me sit on and watch it until the end, although personally i didn't like the ost(a pop music with 666 symbol on the op scene and gruesome story to tell, well it's kinda don't fit aren't they..?).\\n\\n\r\noverall if you like a good mecha anime with unique story (gruesome yet make you excited) and good character telling and progression, this one is good for you i highly recommend it",
            "date": "2016-03-21T05:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 213516,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4879108.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/F4nz",
                "username": "F4nz"
            },
            "url": "https://myanimelist.net/reviews.php?id=213516"
        },
        {
            "content": "Basic summary of the show - set in the Muv Luv Alternative universe where aliens known as BETA start invading Earth and eating people, and stuff. It's 1983 and our heroes are part of a divided Germany and the BETA is pretty much at their doorstep.\r\nLuckily there isn't any real need to dive into the Muv Luv universe as a whole (it's great though), since the anime is pretty much a very good standalone gateway into the franchise itself.\r\nFripSide OP. I'm a big sucker for fripSide's music so this is a big plus for me haha. ED complements the show very well.\r\nThe anime actually startsoff slow here, the first three episodes feels rushed and a little disjointed because of set up and character development etc, but it starts getting good around episode five, and it kept me waiting for a new episode every week. \\n\\n\r\nIf you're into mecha, this is for you. If you're into dark shows where characters have basically no plot armor and you fear for their lives, this is for you.",
            "date": "2016-03-29T23:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 214761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Falverick",
                "username": "Falverick"
            },
            "url": "https://myanimelist.net/reviews.php?id=214761"
        },
        {
            "content": "As a prequel of MAL-TE, this doesn't have much of an impact, since the setting was just simply odd as to how the 80's were able to produce 25th century tech and yes I'm referring to them TSF which were just too advance for the timeline, it would have been much appropriate if original creator Uchida Hiroki could have just set it in some alternate time line where the cold war extents to the 25th century and then them BETA's comes surging in . It doesn't matter whether it's MAL-TE or this or any upcoming sequel or prequel the setting was just too ill fittedto such time line, so:\\n\\n\r\nStorywise, the prequel focuses on man's struggle with not only with the swarms of BETAs, but within its own struggles inside an oppressive state. Now forget about the plot where a group of veterans whose reputation for kicking the BETAs butt were outstanding, the real plot was more on the geopolitics of the cold war and it was very good that original creator Uchida-san nail it very well, cu'z during the cold war such purges and paranoia does exist within the once reputed \"IRON CURTAIN\". And yes the things we see in the anime did have such reality during the cold war. \\n\\n\r\nThe art, was impressive and one wouldn't find any knee high sock wearing bimbo, nor would one find a Yamato Nadeshiku, though one would still find a usual white haired girl, red head and a blond girl. I never understand as to why character designer Hara Suuchi did follow the standard uniform of the National Peoples Army and instead used the standard green fatigue uniform that the JSDF wore during the 70's. Also, I can't seem to dig as to why Katia and Lise have to look like lolis.\\n\\n\r\nSound.........well, for the opening I do like when it was preformed by Fripside,   but not the closing, also I do find the seiyu who did Katia's voice as annoying, since it kinda make her the way she is, an naive little girl, who has no idea of what she's getting into. Also, the voice of Lise really did make up as this deceptive crazy girl the way the character is.\\n\\n\r\nNow for the characters of this anime, aside from the fact that some of the character's name were hardly German, nearly all of which where portrayed as a bunch of Stoic individual whom have no other option but to accept their fate in the hands of their oppressor the Stasi, however each character were a different kind of stoic human being, like Theodore Eberbach  was portrayed as this distrusting stoic character who is just trying to hid from the Stasi's radar by accepting his sacred duty to protect East Germany, but in reality he's in survival mode and just wanna live long enough until the BETAs get him, though he was suppose to have a relationship with a supposed Stasi Dog, Irisdina, it came too little too late, cu'z Irisdina have to die in the hands of an opportunistic Stasi dog who is a CIA doggy wannabe Axman. Now, I hate the fact that Theodore was basically portrayed to be both a siscon and a lolicon, given that his sister Lise made love to him and Katia, being deigned as this young girl who maybe 16 was being made to be in a relationship with Theodore whom we can say is probably 25 , now don't that look like corrupting  a minor? Oh, and his surname Eberbach is Jewish. Now as for the main girl Irisdina Brendhard, her name is hardy German or at least her surname which is Saxon btw, now I kinda like that she is portrayed as this stoic who know how to get around, but I kinda hate it when she has a 2nd in command Gretel Jeckeln whom I can't say at first as to whose side she is, and her surname Jeckeln is Welsh , there is also  Thi-Rang Pham, who is name is Vietnamese, so why would someone from South East Asia doing in Europe? Now I could go on but then again there is no point. But I've notice that most violence where often done on the girls, which kinda make me sympathize with the female characters and at time make me wanna bash the original creator for such violence on women.\\n\\n\r\nThe Enjoyment for me was the part when the Stasi got owned and Gemany was united, but I can ignore as to how this anime exudes such violence on women, why, well Irsidina was often seen being bullied by Axman and Beatrix,  Anette suffering some kind of nervous breakdown, Lise giving up her humanity just to be with Theodore, Phram and Sylvia receiving such domestic type of violence in the hands of the Stasi, Gretel getting her ass kicked by a crazy chick with brocon syndrome and Irisdina getting shot by Axman, let not forget the lolicon element for Theodore and Katia, so for that:\\n\\n\r\nOverall, it's a \"4\" since this kind of anime should only be watched by guys and guys only, definitely not for girls with feminist ideas.",
            "date": "2016-04-05T13:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 215592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=215592"
        },
        {
            "content": "Schwarzmarken is a show that handles a lot of themes without turning into a mess. Its a show that has a slow pacing so I would not be for everyone however it makes for a good popcorn anime (anime that you can waste your time on if you have time to waste). \r\nStory 7/10 \r\nSchwarzesmarken follows a group of mech pilots in east Germany that is in a cold war situation where the berlin wall is still up. They are using mechs to combat a threat against humanity known as the beta which are these aliens. The main story is not about the mechs versusthe aliens but the pressure the pilots face at home where a corrupt government is breathing down their neck every second they are off the battlefield. As I said it is popcorn anime so the story is not the most major aspect what you come to see are the mechs fighting and the scenes where the corrupt government show their true colors. \\n\\n\r\nArt 6/10\\n\\n\r\nThe art used in this anime is kind of bland other than the characters faces and hair. Every character in the show are all wearing the same uniforms throughout the anime. All the backgrounds seem to be reused a lot for both off and on battle scenes. The mechs and aliens used where CGI but like the costumes all the mechs are the same just with a different color  for other groups of pilots. A lot of the animations used for aliens and mechs seem to be reused a lot in the fight scenes.  There is censorship in the scenes where we see aliens kill people which is half the screen being covered in black which is a problem since those are the scenes the aliens would have the most impact.   \\n\\n\r\nSound 5/10 \\n\\n\r\nThe music was not really memorable in this anime and neither where the sound effects. when watching the subbed version of the anime I liked how the characters where able to say German words and phrases effectively.\\n\\n\r\nCharacter 7/10\\n\\n\r\nThe squad of pilots in the anime consist of some likable characters(except Anette who was useless). The characters just want to fight the aliens but hate how they have to deal with spies from the government hiding among st them. It takes a while for characters in the anime to figure out who to trust. A lot of the squad do get a good portion of screen time while a few other characters in the main squad don't. The human villains in the anime are pretty cliche with a massive ego to boot which makes you wish to see them get their comeuppance at some point. \\n\\n\r\nEnjoyment 7/10\\n\\n\r\nAs I say this is a popcorn anime that I used to kill some time I dont think anyone can binge watch it because it does not absorb you or get you wanting more. \\n\\n\r\nOverall 7/10\\n\\n",
            "date": "2016-05-04T10:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 217855,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925361.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cyborg_Dragon",
                "username": "Cyborg_Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=217855"
        },
        {
            "content": "To describe this anime quickly\r\nThe BETA invaded in 1973 and have almost completely consumed the Continent of Eurasia. This takes place in 1983, the Minsk BETA hive in poland has activated and the BETA are assualting East Germany. At the Same time East Germany is At Civil war with itself in a four way faction war( Unificationists vs Nationals vs Soviet backed vs Western backed)\r\nIf you wanted more of what the first 2 episodes on Muv Luv Alternative : Total Eclipse was Schwarzesmarken is what you want\r\nThis Anime is Dark and shows us how stupid people can be during an alien invasion that could leadto human extinction. While throwing some curve balls, almost every episode leaves off with a major cliff hanger to compel you to watch the next episode.\\n\\n\r\nThe Art is good and seeing infantry getting Eating by BETA is a sight to behold\\n\\n\r\nThe sound nothing super exceptional but nothing bad\\n\\n\r\nDont have alot of time to get to know the characters though they are well done\\n\\n\r\nI loved every episode. Schwarzesmarken is what the Muv Luv universe is like (Not Total Eclipse)",
            "date": "2018-02-11T15:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 271295,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5021906.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheRedLine",
                "username": "TheRedLine"
            },
            "url": "https://myanimelist.net/reviews.php?id=271295"
        }
    ],
    [
        {
            "content": "Yo Minna!\r\nWhy not recall what happened to Germany after WWII? Germany was split into the \"Bundesrepublik Deutschland\" (west) and the DDR (Deutsche Demokratische Republik-East Germany) and they kinda hated each other but it was more a reaction due to the Cold War. So you probably ask why is this related to an anime review? Well, the setting of this anime is an alternative version of East Germany in the 1980s. I was wondering if there was an anime that has that \"after WWII\" setting and this anime was close to it. The title was supposed to be in German with the meaning \"Black Marks\", butit ended up being a grammar flop in my opinion. What should be \"Schwarze Marken\" became \"Schwarzesmarken\" in the end and here is the review to it.\\n\\n\r\nPlot and Story Line\\n\r\nAs said in the intro, the plot of Schwarzesmarken tkes place in an alternative version of East Germany in the 1980s. West Germany is also there and as our history books, the anime too, shows the hatred between the two sides. Of course history alone would be too boring in an anime, so the makers of Schwarzesmrken added up a little drama, a little bit of Sci-Fi and some Mecha-military action. Out came an anime that has a solid and interesting plot with a couple of good background stories and full of action, drama and intrigue. But what is this anime actually about?\\n\r\nWell, in such a divided Germany, a new species of extraterrestrial origin called BETA are doing everything just to destroy the world. They are really ugly and creepy monsters that come in all forms and sizes. The story of Schwarzesmarken follows the East Germany Army's  666th TSF Squadron, also known as the \"Black Marks\". With Mecha suits that we've unfortunately seen so many times and the most advanced technology, they fight the BETA in order to free the planet of those extremely dangerous creatures. \\n\r\nThe all BETA story is actually just the foundation of the anime. The highlight of the story is actually a set of circumstances that involve our main characters Theodor Eberbach, Irisdina Bernhard, Katia Waldheim and Lise Hohenstein into the political tensions between the two Germanies. \\n\r\nWhen I firstly started watching Schwarzesmarken I thought that this is gonna end up as one more \"kill the ugly creatures that want to destroy human kind\" anime, but it did not. Because in all that awesome action fights with the BETA comes that intriguing political tension drama between the the East and the West. Not being enough to all that politics comes up another mystery side story about Katia, who she really is and where she actually comes from.  And after some episodes Theodor's past catches up and just adds up with all the drama from before. Trust me guys, the show becomes something like an anime soap opera, but a very good one to be honest. That's exactly what makes the anime so good. You have all that military action and in the middle of it some drama between our main protagonist. Of course, romance too. In that way, Schwarzesmarken has something for everyone's soul. \\n\r\nThe thing that I liked the most about Schwarzesmarken is definitely the link to the past and the situation in the Cold War. I always wanted to watch an anime based on the happenings after WWII and that's why I decided to watch this one. True the BETA stuff wasn't a thing I was expecting, but it ended up being a good anime. You really get the feeling of all the hatred and the tensions between the East and West. \\n\r\nThe story of Schwarzesmarken is a little bit complex, but so intriguing and amazing that you won't regret watching it. Of course, action overload and amazing mecha fights. And all that fits perfectly into 12 episodes which is also the reason this anime got an \"Honorable mention\" in \"My Top 5 Anime You Can Watch in Less Than 6h\". \\n\\n\r\nCharacters\\n\r\nThis is another good part of Schwarzesmarken-the characters. They are all realistic personalities and very interesting too.\\n\\n\r\nMy personal favorite was the leader of the 666th Squadron, Irisdina Bernhard. She is a tough leader and a very independent young woman. She has to bear much pressure on her shoulders being the hero of the nation. Also there is no doubt that her exemplary leadership and tactical skill are the key for the survival and ongoing success of her team.\\n\\n\r\nAlso very important in the Schwarzesmarken story is our little Katia Waldheim. She is extremely idealistic, hardworking and adored by the maintenance crew. She has a natural talent and good instinct when it comes to piloting the TSF. She does seem like that overly perfect character that annoys you from time to time, but she is not. Besides, her background story becomes the most intriguing part of the anime so...\\n\\n\r\nAnimation and Style\\n\\n\r\nThe Animation of Schwarzesmarken is okay. It is definitely not bad, but not a masterpiece either. I think the colors could have been a little bit brighter, they are too dull in my opinion. And since everything is most of the time covered in snow, you don't get to enjoy beautiful backgrounds and stuff. The style is aso not special but again, also not bad. It is an ordinary anime style with no special extras. The one thing that the makers could have changed is the style of the robots, the TSF. Giving them a different name doesn't make the more special than the ones in Code Geass, Giulty Crown etc. I was disappointed, considering the fact that Germany is the leader in the mechanic industry. They could have come up with something new. \\n\\n\\n\r\nConclusion\\n\r\nOn the whole, Schwarzesmarken is a very good anime with a lot of action first of all. The fights and the battle tactics are amazing and very interesting. Linking to the past events in German history, Schwarzesmarken chooses the perfect setting for a political drama like the one we have here. Still there are so many more amazing things that are coming which I can't tell because they would be huge spoilers. I recommend, watch Schwarzesmarken and enjoy! \\n",
            "date": "2016-06-10T10:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 220426,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3873351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animegirlism",
                "username": "animegirlism"
            },
            "url": "https://myanimelist.net/reviews.php?id=220426"
        },
        {
            "content": "A prequel to the Muv Luv series?...well here's one thing this anime prequel won't spoil for LA, because LA hasn't watched Muv Luv Alternative: Total Eclipse, how does getting into this anime franchise fair?...well.\r\nOn the surface of this anime, it looks like a typical alien wanting to kill the last of humanity with mech fighter being the only ones the drive them back, but we're in an alternative vers. of East Germany here during what feels like a World War I and II setting, there are more than just aliens as a threat to the rest of humanity. This anime does look into what happenswhen humans go to their extremes in order for peace or destruction through political and militaristic means, as well as what relationships between people can do through those extremes. \\n\\n\r\nThe plot does have somewhat a slow start but does get intense with plot twists and political dealings and betrayals later on, yes this anime is edgy although LA will say it kinda has the right to be called this due to the setting alone, the aliens are just icing on the cake. There are A LOT of deaths and some of the more coming from the main cast do impact the story and characters to change society in this derelict-power mongering world they are in.\\n\\n\r\nIn terms of characters, due to how the story is ruthless to it's characters both emotionally and development-wise to the cast in general you will grow attached to both the 666th TSF Squad or the individual characters as they have a lofty goal they want to strife for to see, thus even the \"obvious death flag main cast's deaths\" contribute to the characters wanting even more to strife for their goal, the villains themselves are extremely clever (though the political faction are kinda evil for evil sakes cliched), but LA will say that a great villain from this anime comes from Beatrix Brehme voiced by ''Yukari Tamura'', LA won't say much but she directly contrasts to the 666th TSF Squad's ambitions as well. \\n\\n\r\nIn terms of animation by ixtl and LIDENFILMS, well the character designs are pretty distinct from one another due to either their accessories or hair color and style (although LA always confused Circe Steinhoff and Gretel Jeckeln), backgrounding was very well done as it evoked Winter in Europe quite well as well overall some good backgrounding overall. The mech's go in between CGI and traditional and to be perfectly honest the mech designs are outright awesome to look at (though it's like any mech designs with some accessories here and there), now onto the CGI aliens, yes, they used CGI on the alien but LA can ignore this as they ARE SUPPOSE to look \"ugly and alien\", finally the battle scenes overall were impressive to watch and were animated quite well it became even more intense when the plot reaches it's intensity.\\n\\n\r\n The ending by all means wrap up some loose plotlines and LA will say the ending was a decent climax with a plot twist that makes it somewhat depressing at the same time, nonetheless the ending gave LA quite the impression.\\n\\n\r\nSchwarezesmarken is LA's first entryway to the Muv Luv series and really by all means with what LA has been saying about this anime's characters, plot and themes alone got LA interested and this anime might be a hidden gem of Winter 2016 if only people just didn't look at this anime as \"edgy\" and nothing more. Because of this, LA ''might'' look the Total Eclipse after this...good job Schwarezesmarken you got LA interested in your franchise.",
            "date": "2016-03-27T14:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 214417,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214417"
        },
        {
            "content": "The reason I'm writing this review, despite there being several positive others, is to attempt to correct what I feel is an underrating. Schwarzesmarken seems to be a generic mecha v monster anime (Muv-Luv, Gunparade March, and so on) but it is far more than that.\r\nSchwarzesmarken is an entry in the Muv-Luv universe, but it cuts out some of the romance and focuses on the setting and story, which in my opinion helps it go above and beyond others of it's kind. It tells the story of the BETA invasion into Europe, focusing on East Germany during the (BETA are strange-ass aliens who invaded Earth,for those who haven't seen Muv-Luv) and simultaneously delivers a commentary on the global political scenario present during the 1980's and the aftereffects of the Cold War. This, while incorporating drama and plot-twists, as well as good ol' mecha action. Too much? No.\\n\\n\r\nStory 8.5/10 :\\n\r\nI don't believe in generous marking personally, but Schwarzesmarken merits an 8.5. As said before, it successfully incorporates drama, idealism, a little romance, and pretty good action into one show, without individually detracting from any of them. The idealism might make you wince at times, but the tale told about the 666th Squadron's fight against both the BETA and human foes is an enthralling one. \\n\\n\r\nArt 8/10: \\n\r\nThe art is good, but nothing to write home about. The action sequences are well animated, and the backgrounds and character designs suit the grittiness of the narrative. Some of the mech CGI sequences are a little iffy, but when isn't CGI iffy?\\n\\n\r\nSound 7/10:\\n\r\nThe sound did it's job, but again, nothing special. The OP sets the scene well, while the ED is average. The BGM complements the show well, however.\\n\\n\r\nCharacters 9/10:\\n\r\nNow, this is where Schwarzesmarken shines. The main characters have detailed and comprehensive backstories, and for a 12-episode anime the character development is phenomenal, if a little focused. The interactions between the squad, and our protagonist's ideological leaps and emotional growth are a pleasure to watch. The supporting cast could have done with a little more time, but we can't have everything. The cast also, surprisingly, seems to avoid falling into the tropes and character archetypes that haunt anime for the most part, which in itself is intriguing. (Well, not the idealistic I-wanna-save-the-world loli, but she doesn't really ruin it.)\\n\\n\r\nEnjoyment 9/10:\\n\r\nIf the message hasn't gotten across, THIS SHOW IS WORTH YOUR TIME.\\n\r\nThe first few episodes are a little dull, and full of cliches, which might be why people don't like the anime, but if you stick it out, you'll certainly conclude this anime with satisfaction, and perhaps, a little wistfulness. \\n\\n\r\nIt is perhaps not a masterpiece, but it's certainly better than most anime out there, and has a little something to suit every viewer's tastes. Every week when the episodes came out, I prioritized Schwarzesmarken over Grimgar or KonoSuba, which says something. :p\\n\r\n If you're looking for something to watch, Schwarzesmarken is it.\\n\\n",
            "date": "2016-04-19T15:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 216707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5187168.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BrerRabbit211",
                "username": "BrerRabbit211"
            },
            "url": "https://myanimelist.net/reviews.php?id=216707"
        },
        {
            "content": "I have on numerous occassions been known to describe a certain type of anime as \"all being about women with large breasts driving robots.\" Whilst I originally intended this as a blanket derogatory comment on the pornography of plot and character (not actual pornography of course - as that's usually on message) I should have known that eventually something would show up that would make me eat my own words.\r\nYes .. there are women with exceptionally large breasts .. and yes they are driving robots. But something about the tyrannical despot background gives it all a complex, thrilling, savage, manipulative and incestuous edge that isfrankly incredibly impressive in an I-Claudius, first few season game of thrones type way. For the avoidance of doubt and with my humble apologies to those who have not learned English to a native level - those are the right words even though you may not fully understand why till you watch it.\\n\\n\r\nOf course, if you found this review in any way offensive I would strongly advise avoiding this, but if you are at the most mildy offended and are still intrigued I'd strongly suggest at least an attempted viewing. Took me a lot of booze and a couple of goes to loosen up enough get past episode 1 but I promise that neither myself or my prim elitist tendancies regretted anything about it the next morning.",
            "date": "2016-07-24T13:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 224870,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kinkyjohn",
                "username": "kinkyjohn"
            },
            "url": "https://myanimelist.net/reviews.php?id=224870"
        },
        {
            "content": "My opinion:\r\nSchwarzesmarken tries to look original by covering its generic plot and characters with political matters, betrayals, Stasi officers and other chicaneries, it tries to arise emotions by needlessly killing off characters and tries to be memorable through cheesy scenes and lines that only made me cringe. \r\nI had hope in this show up to the moment they decided it is the best decision to make the MC have sex with his newly brought back from the dead sister.\r\nStory: 3/10\r\nThe story takes place in 1980 portraying a divided Germany and the political battles it harbours as well presenting the battles of the East German Army's666th TSF Squadron against the overwhelming numbers of BETA monster. \\n\\n\r\nThe plot does have some good features such as describing the struggles of civilians during war, the sky being blue, the water being wet  and the grass  being green. Yeah, I just listed some random things because I couldn't find anything good about it.\\n\\n\r\nThe premise of Schwarzesmarken is overused to the point that you think twice about watching it. It is the generic “survive the monster apocalypse” scenario that has been executed much better in other series, not having anything to distinguish itself from the rest of the similar themed anime shows.\\n\r\nThe plot is riddled with holes, cheesy scenes, cliche plot twists, utterly dumb decisions based on dumb reactions and meaningless deaths.\\n\\n\r\nThese are some flaws I remember:\\n\r\n1. The fact that the robots can fly removes most of the tension from the battles.\\n\r\n2. The plot twists are predictable thus becoming annoying.\\n\r\n3. The people are afraid of Stasi informants but they talk freely around mechanics and other staff members.\\n\r\n4. Ludicrous lines such as “I love you, I would do anything for you. Onii-chan, take me.”\\n\r\n5. Lots of meaningless deaths.\\n\r\n6. Why is the 666 Squadron’s commander the country’s last hope?\\n\r\n7. The sister x brother situation.\\n\r\n8. The BETA monsters are intelligent creatures but not intelligent enough to make them interesting.\\n\r\n9. Huge explosions resulting from small amounts of fuel.\\n\\n\\n\r\nCharacters: 2/10\\n\r\nMost of the character are dull, one-dimensional and generic with the protagonist as an exception to the rule. \\n\r\nWe have the mature, cold on the outside but kind on the inside Irisdina , the airhead and mentally damaged Annet, the manly guy, the tough girl Sylvia, the caring and smiling Katia, the yandere Lise and a bunch of other characters that are not memorable.\\n\\n\r\nTheodor Eberbach is the protagonist of the series, at first I liked Theodor because he was a cold guy with a cool air about him but then he became a generic MC who says “I want to protect my friends” and that is about all the “development” his character receives.\\n\\n\r\nLise Hohenstein is the yandere sister that fell in love with Theodor (her brother) and later decided to free him from that world by killing him. She does have an interesting background story as a Stasi dog but her character ultimately fails at making the show better.\\n\\n\r\nCaptain Irisdina Bernhard is one of the main heroines of Schwarzesmarken, she is the leader of the 666 squadron and the starting point of a revolution. Irisdina’s character is dull and receives no development, the only part she plays is the hero captain for others to look up to.\\n\\n\r\nThe villains of the series are boring, the BETA monsters are more intriguing than the so called villains.\\n\\n\\n\r\nAestethics: 7/10\\n\r\nThe animation is fluid containing enough gore and blood, the character design and backgrounds are fine but the monster design is bad.\\n\\n\r\nSound: 3/10\\n\r\nThe opening theme is fine and the ending theme is decent but the insufficient and poor background music is a huge minus considering this show belongs to mecha and action genres.\\n\\n\r\nEnjoyment: 5/10\\n\r\nI can’t say I liked or hated Schwarzesmarken, it was just another bad show that made me want to get it over with and left me with a “meh, I wasted my time” feeling. It did amuse me to a certain degree with its stupidity but I will forget all about watching it in one or two weeks. \\n\\n\r\nOverall: 3/10\\n\r\nSchwarzesmarken brings nothing new to the table, it does not have a good plot or strong characters nor is it particularly engaging but it does have many flaws. I would not recommend watching Schwarzesmarken unless you really, really want to watch it.",
            "date": "2017-02-27T13:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 241528,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5778347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cinefil_original",
                "username": "Cinefil_original"
            },
            "url": "https://myanimelist.net/reviews.php?id=241528"
        },
        {
            "content": "This is one of the most underrated anime series I've ever seen. Based in East Germany in 1983 during the eatly years of the BETA invasion it shows a bunch of sub-plots that are fairly interesting.\r\nThe main storry follows the 666º TFS Squadron, also known as \"The Number Of The Beast· (Schwarzesmarken), leaded by Captain Irisdina Benrhard. The main character is Theodor Eberbach, a pilot that got caught by the Stasi while he was trying to escape with his family through the Berlin Wall, since then he was tortured and forced to work for the army.\r\nAlmost all of the characters are interesting, having to liveand fight against their inner fears, like being afraid of losing a teammate or a family member. The character development is well done and you can see episode by episode how they are evolving, getting closer, trusting (and untristing, sometimes) each other.\\n\\n\r\nAnimation is good in general, I haven't noticed a low point in this one. Action scenes are the best part, although I've never liked the way the BETAs looks, th TSF moves are really good and the effects in their attacks are also well exectuded, CGI isn't annoying and you can enjoy it a lot. \\n\\n\r\nThe lowest point, I've got to admit, are the anachronism, like \"how did they get to have TSF in the 80's\" and stuff like that. But since it's in an alternative universe I think that's acceptable.",
            "date": "2016-06-12T16:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 220603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3933755.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kougar",
                "username": "Kougar"
            },
            "url": "https://myanimelist.net/reviews.php?id=220603"
        },
        {
            "content": "Story: 6. The plot was terrible. This anime is supposed to be about people in giant robots fighting aliens. Instead, it just ends up focusing on infighting without some sort of good transition. Plus, this kind of seemed like a mix between Attack on Titan and Gundam/Evangelion. \r\nArt: 9. I liked the art, and the animation, since there were not any scenes with bad animation/art and the movements of the characters were perfect.\r\nSound: 9. The sound and the effects were great, but they could be a little cleaner.\r\nCharacter: 7. The character build is not very good. It seems unappealing. If it weren't for my willto finish all animes I started, I would've dropped this because of the terrible plot and character build. The sister is basically a walking yandere cliche, and the character build you see in the captain is just too normal and not original at all, and the brother doesn't really do anything to help her. Plus, I have a hard time figuring out who exactly is the main antagonist: the BETA or the Stasi?\\n\r\nEnjoyment: 7. The art was good, but the story could use a lot of improvement and the characters shouldn't just be walking cliches.\\n\r\nOverall: 7. In terms of character and plot, this story was terrible and lacked originality. But, I applaud the art and thought the sound was at least semi-decent.",
            "date": "2016-06-01T23:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 219821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Craig_L",
                "username": "Craig_L"
            },
            "url": "https://myanimelist.net/reviews.php?id=219821"
        },
        {
            "content": "Aldnoah Zero with less BS but more baggage.\r\nFirst off, mecha is a a rough genre for me as I think fighting in giant humanoid robots sounds like nonsense. That said Schwarzesmarken is a step above most mecha in that it doesn't involve a genius high school boy who defeats the enemy with a brilliant plan one one in the entire world's military thought of. The action is exciting and fun, the geopolitics and history is fascinating and the characters have understandable motivations. \r\nHowever, the main flaw is the anime trying to juggle too many things at once and not entirely succeeding at all of them.Trying to fit in the harem romance, intrigue, warfare, deception, etc is difficult and drags what could be an excellent anime to merely pretty good.\\n\\n\r\nMecha Octane Rating: 8/10 The attempt at using actual tactics and teamwork instead of last minute bursts of understanding and guts make this better than most mecha anime.\\n\\n\r\nHarem Development Index: 1/10 It's hard to even argue that it is a harem, but the MC is surrounded by beautiful ladies and there's brief scenes of possible romance that go nowhere.\\n",
            "date": "2018-10-11T23:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 291549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7467432.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vedeo",
                "username": "vedeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=291549"
        },
        {
            "content": "Irisdinia is believed to be a survivor of an attempted coup d'etat by betraying her own family to the Stasi, the repressive secret police of Eastern Germany who did not take kindly to treason or spies. However, Earth was now under threat from an alien race known as the \"BETA\" that devours any human they find. Irisdinia was now a hero, captain of the 666th Squadron \"Schwarzesmarken\", responsible for wiping out Laser Class BETA which were the greatest threat against human forces due to their long range beams.\r\nWhile out repelling an invasion they come across a distress signal from a lone UN TSF. Katia isrescued and is taken in by the squadron under asylum as they needed someone capable to replace one of their lost members. Watched over by Theodore, Katia reminds him a lot of his sister Lise who he got separated from while trying to flee from the Stasi to the Western border. As Katia continues to secretly search for her convicted lost father despite the risk of being apprehended by the Stasi, Theodore continues to be haunted by his own ordeal with the Stasi but he soon finds himself fighting against more than just the BETA.\\n\\n\r\nThis is an OVA that's a prequel to the Muv Luv spin-off \"Muv Luv Alternative\" that takes place 18 years prior. It gives you a quick crash course on the Alternative universe during the opening first episode but it would probably be best if you you've seen the older prequel, Total Eclipse which gives a better picture of the world setting.\\n\\n\r\nLike Total Eclipse it starts off similarly filled with angst, doom and gloom but doesn't lighten up as the show goes on. You have to pay attention fairly closely to understand what's going on and even then, you'd need a bit of historical background on Germany to know what's what. As usual, the character development keeps the show interesting as you watch them grow through their struggles and there are some intense fights but there are also a few \"WTH!?\" out-of-the-blue random moments. Fan service and gore are both mild compared to Total Eclipse but there are some brief scenes of sexual exploitation.\\n\\n\r\nBe sure to watch on after the ending credits as there's more to each episode.",
            "date": "2018-09-18T05:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 289314,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7426800.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xcomprr",
                "username": "xcomprr"
            },
            "url": "https://myanimelist.net/reviews.php?id=289314"
        },
        {
            "content": "To sum it up, this anime is average. The politics is even more stupid than real politics, I mean, the hierachy of this anime is all messed up, and seriously? Teenagers? Again? Why the only ones who can save the world have to be a teenager?\r\nThe story it annoys me, we have a bunch of aliens, from the moon, but no one seems to be experimenting the weakness and strength of aliens, and the best way to win a war is not with Mechas, it is with Chemical weapons, Nuclear Weapons, Radiation, etc. Why the ****** would a government create a Mecha in which mustuse a lot of resources in a place where hunger and death was all around?\\n\\n\r\nAfter watching so many animes you start to realize the cliches and repetition in the stories. You'll also realize that some character are really really stupid, and do some things without reason at all, or worse, they do something that sounds noble, but appear to be stupid enough to not even realize that there will be consequences to those actions, that is one of the main reason that some animes suck, they think people are evil just because they are evil, we don't come to this world already evil.",
            "date": "2016-04-24T10:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 217056,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2317235.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lucandore",
                "username": "Lucandore"
            },
            "url": "https://myanimelist.net/reviews.php?id=217056"
        },
        {
            "content": "The world is under attack by an alien life form known as Beta and East Germany appears to be next on the aliens' munch list. Schwarzesmarken is supposedly the best mech platoon in Eastern Germany, and charged with performing surgical strikes to give the country a chance. Our protagonist, a young, disagreeable pilot, serves on this mech squad where he must survive countless waves of ugly CGI aliens and the generous breast sizes of his fellow pilots. However, his country is also under dire straits internally as various government factions vie for control, leading to Stalin-style purges and wasted resources. Will his unit survive thedual threat of alien invasion and internal civil war?\\n\\n\r\nLet me preface the rest of the review by noting that this is the first work I've seen in the Muv-Luv universe. Schwarzesmarken is an action-based mech show with a very pessimistic overall mood- full of random killings, deaths, betrayals, and really just anything to compare the worst of humanity with the worst the aliens can bring. I've read of some people having PTSD after watching Total Eclipse- while I didn't experience anything to that level here I would say that it's probably comparable to Aldnoah Zero. While it is a pretty engaging watch from a thriller perspective, it isn't full of particularly smart people; bad choices are made pretty much throughout the entire plot. Furthermore, the story is rife with inconsistencies and gotchas that are jarring and off-putting. If you're just looking for some action and don't mind the plot, it's a pretty fun watch. Otherwise, I'd say this is only average at best.\\n\\n\r\nAnimation:\\n\r\nI came across mixed overall for the animation in the show. I liked how they set the dark atmosphere with moody clouds and many grays in the palette but more often than not, this was overshadowed by ugly CGI and rather repulsive and anatomically illogical aliens- though I have to say the laser-class aliens add a humorously cute flair to the otherwise dreadful alien mobs. The mechs are also drawn via CGI and though they're better than those a decade ago, movements still feel off occasionally. The characters themselves are fairly diverse in appearance though most of the girls are overly proportioned in the chest region. The show also uses overly-heavy eye shadows on the girls, which just makes the antagonists' instant-giveaway look all the more apparent. I also found the mech outfits rather outlandish; seems to be specifically tailored to highlight bouncy parts. Expressions are pretty generic and other than a few sequences with Katia, rather bland overall.\\n\\n\r\nThe show has a lot of action, be it mech battles against mechs or aliens or ground warfare with conventional arms. Though a majority of the show is just bullet spamming, some of the sequences aren't bad (even a few moments of tactical brilliance) - I'd still put it a few levels beneath a Gundam show, however. There is a lot of death and a bit of gore, though the camera angle tends to shy away from the bloodiest scenes. Given the rather serious tonality of the show, there isn't much accidental ecchi here. Other than the obvious harem-friendly figures of the female cast, there are just a few suggestive scenes.\\n\\n\r\nSound:\\n\r\nThe show opens with a fast-paced OP with a nice melody and the typical electronic instrumentation of FripSide (think Railgun). The ED is a cool down piece by two of the VAs- the first few measures would probably fit just as well in a breakup scene in a drama. The BGM is pretty well utilized with a wide range of instrumentation. Peaceful moments are full of light orchestral and piano pieces with wide reverb. Battles are much more intense with vocal choirs and brass/electronic instrumentation joining the string-leads, some pieces here are particularly good both melodically and in giving a sense of tension.\\n\\n\r\nThe VA cast, like the character cast, is quite huge; there are some notable surprises though. I think Nozomi Yamamoto gives by far the strongest performance here. She gives her character a commanding yet reassuring feel, which is just perfect for her role. It is also impressively different from her previous role as Julie in Absolute Duo. I think this is also one of the first roles in which I've seen Yukari Tamura play an antagonist; though in this case her character doesn't have much depth.\\n\\n\r\nStory:\\n\r\nSchwarzesmarken tells a fast-paced yet vile story about our inability to work with each other. It is a fine plot for those who don't try to poke holes at it, but unfortunately for me poking around is what I like doing. If you really dig into it, this story is chuck full of inconsistencies, miracles, and improbable circumstances; unfortunately, many of these surface too late in the show to divulge in this review.\\n\\n\r\nThe story follows one central plotline that pivots wildly between various events; you really are just along for the ride. Many of the show's twists are predictable, some are along the lines of things you don't want to be true but know will be true... The show builds to a final, mech battle climax that is a bit of a letdown given the falling action. This is followed by a fair conclusion that ties up loose ends fairly well. I still can't get over the fact that, despite having advanced mech technology, they don't try at all to save their injured.\\n\\n\r\nIf you're looking for a thriller with lots of last second saves and plenty of action, this is your kind of story. If you're looking for thought-provoking political dialogue or any real depth to the almost universal mech question of \"why are we fighting\", you won't find it here. The disposability of the famous \"Schwarzesmarken\" team members really leaves a sour aftertaste for me.\\n\\n\r\nCharacter:\\n\r\nThis is kind of a mess. If you check the character ratings for the show on anidb, you'll see that most of them are horridly rated. There are many issues in this section that would negatively affect the characters. First, the huge breadth of primary and supporting characters makes it difficult for the viewer to relate to everyone. Second, the show attempts to make as many characters dynamic as possible; this only backfires as it makes a lot of characters (such as Kirce) feel very simple-minded. Third, the show can't choose whom to pair up with the protagonist, I counted five potential visual novel potential routes in this animation. Fourth, despite the incredibly important nature of Katia to the story's plot, she gets relatively little development- often just shoved aside by Lise. Which brings up number five, Lise is just an unnecessary distraction that ends in exactly how one would predict. Finally, sixth, the antagonists are abhorrent cookie-cutter villains with no depth.\\n\\n\r\nI usually like dynamism in characters, but the usage in this show just feels cheesy. This combined with unstable character relationships (especially those involving the protagonist) really bring down this section.\\n\\n\r\nValue:\\n\r\nSchwarzesmarken is a relatively dark show. Perhaps there is some parallels with the real world situation of today; but philosophizing aside, the show's fairly good production and entertainment values are overshadowed by an inconsistent storyline and weak characters- and no I'm not just ranting about the various pointless deaths in the show. I'm going to go on a limb and say this is a good watch for those who liked Valvrave- lots of interesting mech battles but little if any real core substance and heart.",
            "date": "2016-05-16T23:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 218737,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=218737"
        }
    ]
]