[
    [
        {
            "content": "It seems there may be a new trend in anime in recent years. The concept of monster girls who lives in the human world is becoming more and more of a trend. Rosario + Vampire, Kore wa Zombie Desu ka?, Monster Musume no Iru Nichijou, and even to an extent, To Love Ru Darkness display traits where its main character cast composes of non-human female characters. So where does that put Jitsu wa Watashi wa? Nowhere too different really. To sum it up easily, this is a series about a guy who discovers that there are non-human beings living in his world. And one ofthem is not so far away as much as he thinks.\\n\\n\r\nAdapted from the manga of the same name, Jitsu wa Watashi wa (Actually, I am…) is a harem rom-com. There’s two ways the series goes about this. One is the way the characters are introduced, one by one in oddball fashions to the main character. The second is how the main character connects with them with a variety of feelings. And if you can guess, it mostly steers into a road of romance. However, it is also interesting to note that the series takes itself more as a comedy rather than human drama. How can human even fit into the same phrase here? \\n\\n\r\nWell, there’s the one human protagonist we meet from the very beginning. Known to his friends and peers as Kuromine and others as “Eromine” (there’s reason for this explained comically later), he is essentially the average teenager you can expect to see in any school related series. One day at school, he discovers a startling secret. He discovers that his secret crush, Shiragami Youko is actually a vampire. The key word here is ‘actually’. This is because the show is a matter of not ‘if’ but ‘when’. By predictable plot standards, it’s easy to guess that Kuromine will find out the secrets of other characters too. But for starters, his discovery of Youko lands him into some awkward waters. The way the show sets their relationship essentially begins as a form of pact. Kuromine likes Youko and vows to keep her secret from others. In turn, Youko begins to understand Kuromine and naturally begins to develop similar feelings. And as far as that goes, their school life begins to take into a road of misadventures as others get involved with their “relationship”.\\n\\n\r\nAs a series about rom-com, the main protagonist is hardly outstanding. He is the typical nice guy, the beta harem type that you can find literally in any similar series. What does make him slightly interesting is that he is honest and loyal. The first few episodes establishes this as he promises to keep Youko’s true identity as a secret. If not, Youko would have to be change schools in order to avoid shame. His personality seems to have influence on others as well as the characters encountered by him understands his intentions more than they originally had thought. This seemingly also attracts others towards him as they see Kuromine as a sincere person. Characters such as Nagisa begins to have conflicting thoughts about him as the series progresses, Youko falls further and further in love, while he attracts other weirdos like self-proclaimed pervert, Shiho Shishido. As amusing as this sounds, there’s hardly any good characterization on them. The series easily makes its point that it’s more of a comedy gag show rather than something to take seriously. The plot is also structured in episodic-like nature with some episodes that have little to no connections with the rest. \\n\\n\r\nDespite this, I do have to admit that the show has genuine comedy. This comes mainly from the character face expressions. In essence, we get two types. The first is human-like ones from Kuromine and his childhood friend Mikan. Their reactions to many events in the show is priceless and often seems like a work of art. Although it’s not as powerful as to the manga, it still retains its clever facial tone. The second is the dialogues. Because Kuromine is helping to keep a secret, there will be a lot of times where he gets into complicated scenarios where he may have to make up something in order to avoid trouble. Think of it more as “lying with the truth” and the dialogues that comes from it is hilarious. Of course, expect misunderstandings and events to get complicated more than they seem. \\n\\n\r\nThe series ultimately can be a hit or miss for fans when it comes to adaptation. To me, it’s a bit of both. I wouldn’t say it’s a failure but neither is it compelling. Rather than following the manga straightforward, the adaptation reshuffles certain chapters to make the overall story flow better. While this seems like a positive at first, it can also lead to important elements of the original omitted or parts added in too quickly. The good part that comes with this is the better pacing as some of the episodic scenarios can be frustrating and almost like if it’s testing the patience of the audience.\\n\\n\r\nTMS Entertainment is not a powerhouse but their involvement for this show does have some good values. The character designs aren’t outstanding as the characters looks generic and lacks the compelling feel of the manga. However, it makes it up for the facial expressions in particular Kuromine and Youko. Every episode has them and it’s hard to ignore. Otherwise, background work such as the school, neighborhood, and communities lacks concrete in detail. There’s also some bits of fan service used mainly for comedy gags. Don’t really expect much though as the show again often emphasizes comedy rather than eye candy.\\n\\n\r\nIn similar terms, the soundtrack is just fine as it is. The OP and ED theme song plays on note with comedy although can be easily forgettable. There’s also some spoilers in the theme songs so fast forwarding them if you want a better experience as an anime original viewer. There’s also a problem with Youko’s voice as she sounds like a character that is younger than she actually is. It will take some time to get used to as I did throughout the show. On the contrary, character voice mannerisms during “climatic scenes” are easily laughable for its comedic intent. When combined with the face expressions, the show really brings out a colorful side to the humor. \\n\\n\r\nSo what’s to say about Jitsu wa Watashi wa in the end? It’s probably a better idea to watch it for yourself. The show is something that should be watched if you want a fun laugh rather than any sort of realistic drama. The romance is almost like a satire at times as it feels dense yet amusing as the story progresses. And of course, who can forget about our colorful cast of monster girls? In retrospect, this show is more like an imaginative storytelling that can strike as peculiar when a guy learns what actually is…",
            "date": "2015-09-28T10:00:00+00:00",
            "helpful_count": 65,
            "mal_id": 199970,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=199970"
        },
        {
            "content": "If I were to choose whether I liked it or not, I'd say I liked it. The plot is decent, the characters are funny, and the anime is without flaw... OK, it isn't flawless. But it does have a certain charm to it, and I never even had the thought of dropping it. It was really entertaining. But the ending left room for improvement, and the characters' sub-par performance, in terms of uniqueness, quality and improvisation, could have been avoidable. If it gets a sequel, I'd watch it, though. \r\nStory: 7/10\r\nThe plot takes a very rough road to its destination. Once you're in a fewepisodes, you'll start noticing you've picked a favourite girl (or guy, I suppose) subconsciously. And you'll be routing for that girl (or guy...). But then that character loses all its screen time, and \"vanishes\" as a \"supporting character\". And that can be irritating at times. So, all in all, the plot is something you either like, or you don't. And the character development is slow, if not non-existent. You'll start noticing after they mention how much Asahi \"changed\", that he didn't really change at all. Honestly, the only characters that sort of changed are Nagisa and Mikan. The rest stay the same, more or less, until the end. It really does depend on your point of view, but despite the ups and downs, this anime is generally likable. And so is the plot, albeit with little progress. It could have been better. But it wasn't.\\n\\n\r\nThough it does have similar jests in respect to other anime, it is nonetheless interesting. If you are looking for a slice-of-life anime, or a serious and/or malicious plot, you're out of luck. If you're a fantasy fan like me, and are interested in the supernatural, then this may or may not be for you, as it lacks the seriousness some people prefer in fantasies (i.e less comedy, more battle). But if you love anime without a greater goal, in other words, simple yet moving stories, then this anime might be a great opportunity for you.\\n\\n\r\nArt: 8/10\\n\r\nIt's interesting how something so simple can be so very fitting to a single series. I cannot say I saw a single mistake in the animation, albeit through my untrained eyes. In my ever so humble opinion, in terms of quality, it really hits the mark. For example, the running animation is particularly detailed, and the facial expressions are hilarious. I cannot say they did a bad job converting the manga art, either. To be honest, it's great. And, as the Japanese like to say, Omoshiroi (For reference: 面白い).\\n\\n\r\nSound: 8/10\\n\r\nThe OP and ED were splendid! The voice actors were really good, as well. Though one highschooler sounded like a thirty-five year old man. Overall, the soundtrack was brought to life in a unique way, seeing as how I can't think of any similar songs. Simply put, the OP outweighed the anime, in a sense. One of the few that I didn't skip, and it fits to the theme very well, as well. (Too many 'well's... Oh, well...)\\n\\n\r\nCharacters: 7/10\\n\r\nI can't say I was completely satisfied. They could've been better. But overall, I'd say they were good. If only Mikan and Nagisa had been portrayed better. It felt to me like they were lacking enough impact of sorts in the plot.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThe lightheartedness is refreshing, especially after last season, so this is certainly the anime to watch if you're in the mood to relax. The comedy is only a bit better than average, though. The romance leaves room for improvement, as well. But to me, this anime is one of the highlights of the season.\\n\\n\r\nOverall: 8/10\\n\r\nThis anime is, or can be, very funny at times, and dull at others. But depending on the viewers' mood, this anime could be the best way to cheer yourself up, or the best way to fall into despair. Now, when I say something like that, you'd be thinking: \"What the hell are you talking about!? This anime is awesome!\" or \"This series is so abysmal, I can't wait for it it to fail miserably!\" Both statements are correct. Both are false. This anime is better than average. It's also worse than average. It's a better than average comedy. It is a worse than average harem. It has worse than average characters, but better than average personalities. I could go on, but you get my point. Depending on the person you are, you may like this, or you may not. Now, to be completely honest, this anime gets an 8/10. Not because I gave it that score, but because the anime genuinely gives you a homely feeling. It does. Really. It's not something you really notice at first. Or in all situations. But you'll notice when you're really tired (mentally, and physically), perhaps after a long day of work. It's relaxing. And extremely so. If you lower the volume a bit, once Asahi starts shouting, you'll know what I mean. I personally can say out of experience that most people will overlook this show. And it's their loss. No anime is perfect, but this one was great, to say the least. It's also a great way to get into the manga itself. If you really hate anime like this, then I can't say you are wrong. But if you try it out, you might actually come to like it.\\n\\n\r\nAlright, lastly, to add a few recommendations, let's list some similar anime:\\n\\n\r\n■ Monster Musume no Iru Nichijou\\n\r\n■ Himouto! Umaru-chan\\n\r\n■ Yamada-kun to 7-nin no Majo (TV)\\n\r\n■ MM!\\n\r\n■ D-Frag!\\n\r\n■ To LOVE-Ru",
            "date": "2015-09-29T21:37:00+00:00",
            "helpful_count": 55,
            "mal_id": 200122,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4316151.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shoichi",
                "username": "Shoichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200122"
        },
        {
            "content": "TL;DR: pacing is awful, characters are generic and removable, + for sound and animation, poor conclusion.\r\nI felt like I've been betrayed after finishing this show. Yeah the general premise of it isn't by any means original, but given the circumstances of the show, it could have been a decent rom/com. Ironic enough the score I'm giving it is classified as \"decent.\" The show has a promising first few episodes, filled with comedy more than anything else. \r\nReally, there isn't too much to say about this adaptation because it lacked a lot of development in every aspect. The story seemed to follow the usual trend ofboy meets girl, they fall in love with each other, beat around the bush for 10 episodes and then conclude with a cute scene at the end. Certainly I thought it was going to be like this but the last 2 episodes decided it was okay to do the inexplicable. Not going to spoil it, but what happens pretty much kicks everything prior down the drain. Makes me think that whoever did the anime adaptation decided (from what i heard) to change it from the manga. If the manga was like this then -_-. Overall for the story: worked up to nothing, falls flat and leaves a lot to be desired. \\n\\n\r\nCharacters are all very generic. We got the goody two shoes male protagonist, the dense main heroine, the jealous kuudere heroine, the childhood friend, and the hentai heroine. Nothing special by any means and as a matter of fact, this show really revolves around the male protagonist and the dense and jealous heroines. The other two seem to play no part in progressing the story and seem to be in on screen for no particular reason. All the other characters are generic side characters as well. The most interesting character to me was the principal, but she had very little screen time and it would've been nice to know more about her. Yeah the characters lacked a lot of originality, but some redeeming qualities were their interactions. It was funny for the most part, but most of the drama filled scenes seemed forced. Characters were not memorable.\\n\\n\r\nSound was overall decent. The opening animation seemed to give off the wrong impression of the show, but it was catchy. The ED has to be one of my more favorite ED's out there. Most of the soundtrack was forgettable, one stand out though being the one @ the pool scene. VA's were eh sound effects eh.\\n\\n\r\nAnimation in this show is different from a lot of other shows where it really focuses on the facial features of characters. It is really bubbly and does a good job projecting the emotions our characters are feeling. Action scenes could have been better.\\n\\n\r\nI liked this show for the first 9 episodes, but it definitely dropped the ball with it's pacing. A lot of questions were left unresolved and some (what i think) key scenes were brushed over just to be one of those \"remember when\" moments. There were too many removable characters for me to really give a crap about the 3 main ones. I really am disappointed in how it ended because I was enjoying the slapstick humor. Too many plotholes and too many plotpoints that were completely disregarded.\\n",
            "date": "2015-09-28T17:05:00+00:00",
            "helpful_count": 41,
            "mal_id": 200013,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663713.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TakeTheWindward",
                "username": "TakeTheWindward"
            },
            "url": "https://myanimelist.net/reviews.php?id=200013"
        },
        {
            "content": "How can a romantic school comedy work if the main protagonist is someone who can't lie and the female protagonist is a very dense person? Jitsu wa Watashi wa, or \"Actually, I am...\", is a romantic school anime which incorporates supernatural elements as well as comedic ones to enhance the narrative.\r\nAs mentioned earlier, the story is simple and centers around Kuromine Asahi, the \"leaky basket\", and Shiragami Youko, who happens to be a \"dense\" vampire. Having a person who can't keep secrets can only lead to problems. The anime utilizes these situations to its advantage to present amusing situations and develop their relationship. However, thecomedic situations are often similar, getting old quickly; the same applies to the story, which seems to have the same approach as other similar anime.\\n\\n\r\nNew characters are introduced as the narrative progresses, all with one common aspect: all have a supernatural background, whether it is an alien or a transforming werewolf. This is an interesting aspect that provides diversity to the characters and story, yet as the story unfolds, instead of exploring the supernatural nature of these characters, it just focuses on the romantic aspect and feelings these have for the lead character. I found this personally a letdown, making it not much different from the other romantic school comedies.\\n\\n\r\nThe cast of characters presented in Jitsu wa Watashi wa were unique in their own way, each with a supernatural background, though with generic personalities. There is Kuromine, who is a clumsy, shy, \"leaky basket\" but with a good heart. Then there is the vampire Shiragami, a dense and unaware person of her surroundings, who in the beginning seems to be very shy and unsocial person. There is the perverted werewolf who has double personalities,Shishido Shido; the alien Aizawa Nagisa with a very serious attitude, and the childhood friend, whose glasses are possessed. Not to forget the demonic director and her sister, as well as the usual cast of supporting characters such as friends.\\n\\n\r\nCharacter development is not the strongest point in the anime, though throughout the anime the spectator observes how the romantic feelings for Kuromine affects the different characters. \\n\\n\r\nThe animation is well done, as well as the characters, who have a distinctive design comparing with the other modern anime. The comedy is enhanced through amusing face expressions. The eyes of the characters were toned down a bit to make the characters more appealing, comparing it to the manga. Some of the soundtracks used in Jitsu wa Watashi wa fits well, such as the rock themes, with other less interesting themes which is common in other anime. I personally enjoyed listening to some of the voice actors, as I like the Kansai accent. The opening had a catchy tune, though nothing outstanding.\\n\\n\r\nJitsu wa Watashi wa was overall an enjoyable experience, with interesting character designs, though failing into exploring these to its full potential, making the narrative itself rather dull and generic. Nevertheless, the occasional comedic situations managed to keep the story interesting. What could have been a good romantic comedy with interesting characters and interesting story progression, turned out to be rather lackluster in comparison, but entertaining.\\n\\n\r\nThank you for reading.",
            "date": "2015-09-28T12:02:00+00:00",
            "helpful_count": 29,
            "mal_id": 199980,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=199980"
        },
        {
            "content": "TL;DR Review\r\nStory-\r\nMC has to keep a girls secret or else she'll be deported to Mexico, I mean back home to her parents and will move schools. The MC can't keep a secret at all, so they try to turn that into a plot device only to not make any other plot devices. That's pretty much the show. Nothing else really happens apart from more characters popping up and a harem. \r\nArt-\r\nIt's average. Not good or bad really.\r\nSound-\r\nIt gets the job done but doesn't pop out at all. I can't remember any of the background songs used apart from the intro and ending.\r\nCharacter-\r\nThe characters are prettypoorly written. Just your standard cut and paste characters from anime you've already seen before. Got the airhead, got the tsundere, got the pervert, and got the MC everyone likes for some reason.\\n\\n\r\nShould you Watch?\\n\r\nNo.",
            "date": "2015-09-29T20:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 200117,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2172737.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Meowsorz",
                "username": "Meowsorz"
            },
            "url": "https://myanimelist.net/reviews.php?id=200117"
        },
        {
            "content": "Basicly it's a boy loves girl but can't confess ... He finds out her secret and tries to keep it despite being a \"leaky basket\", to prove so he ends up being friends with her instead of just confessing his feelings. \r\nMoreover other girls come into the story to make things more difficult ... more complicated for him to get closer to \"the girl\" who is pretty dense when it comes to her feelings and romance, and then mistakes his affection for her thinking he's in love with THE OTHER GIRL. \r\nComedy wise... not so funny it got me yawning most of the time, Isimply couldn't find it funny nor cute. But hey it's my personal opinion, others might have found it funny I just didn't.\\n\\n\r\nIn the END he never confesses. I must say it was 1 of the few animes I didn't enjoy at all. \\n\\n\r\nIt's a hangup story with no end.",
            "date": "2015-10-14T02:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 201215,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/yume81",
                "username": "yume81"
            },
            "url": "https://myanimelist.net/reviews.php?id=201215"
        },
        {
            "content": "May I just start off saying... wow I loved the art and the sound of this anime.  The story was okay, and it was one of those almost skit like anime that never goes anywhere.  A love triangle story where they just do the classic ping pong back and forth and no one can solidify a relationship.  That is not where this anime shines.  This anime shines from the funny and outrageous things that happen and the Faces that go with those scenes.  Nothing like seeing a devil get whats coming by a human but the human has the smileof a devil while the devil has the look of .. ow I messed up ... forgive me.  In all honesty that is why I liked it but I did think the romance was cute but nothing to write home about.  Lastly I will say I plan on reading the manga if I get time, as the ending of the anime certainly leaves many lose ends.  Which it did not seem like they were trying to leave as many lose ends as they did they just got rushed is more the feeling.  So if your like me and want a more complete story I would say read the manga because from other sources the anime jumps around the manga so it is hard to pick up after watching.  That being said it was still well done and I laughed so if your just an anime person I would give this a shot.",
            "date": "2017-02-22T21:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 241181,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=241181"
        },
        {
            "content": "Story: 7/10\r\nThe story was good and enjoyable. I like the unique aspect of a boy who cannot lie or keep a secret to be entrusted with very important secrets. Seeing him freak out and panic brought a very light comedic aspect to the show.\r\nSound: 8/10\r\nThe sound effects were normal that you would see in  other animes. The voice acting was good and above average. Now the music was very enjoyable and loved listening to it. I loved the song during emotional moments.\r\nArt: 7/10\r\nAverage art style. Nothing really that stood out to me. The art you would think to see in the average school animeis what you will get here.\\n\\n\r\nCharacters: 8/10\\n\r\nI loved the male mc. He is funny but also a very great friend. He knows what he wants and doesn't get distracted by the other women in the show. People may call this a harem, but because of the male lead i would say it is a lot different from other harem anime in which he is only interested in the female lead. He also isnt a straight out pervert and only want to see girls naked.\\n\\n\r\nOverall: 6/10\\n",
            "date": "2017-02-14T10:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 240586,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6021786.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Quaisar",
                "username": "Quaisar"
            },
            "url": "https://myanimelist.net/reviews.php?id=240586"
        },
        {
            "content": "Jitsu wa Watashi wa is indeed a surprising unexpected gem for the summer season, and has a certain thing that makes you to keep watching it even with its mediocrity. I won't say it is totally mediocre, but most of its elements are rather seen in other anime which makes it not suitable for other viewers. Despite those, it is still a fun romance to watch because of good and proper pacing and execution.\r\nThe story is set to be in an ideal school harem setting, it is about a generic brown-haired guy named Kuromine Asahi who can't keep secrets. Together with the introduction of eachgirl the anime progresses fast. Just like any other harem, there is this \"main girl\" who will likely end up with the main guy but as you watch this you may also root for the others, as they are likable and you won't have the reason to hate them. About the plot, it's common and generic but a few twists like different attributes to the abilities each character have and being an entertaining romcom make it somewhat special. There is also this clashing of romance and comedy that some viewers may not like, but only a little. \\n\\n\r\nNothing to complain about the art, it's really plain and ordinary and doesn't leave any good or bad impression. Scenes aren't that detailed but the character designs are pretty and clever. What makes the art good I think are the colors used for details and character designs. It makes it more lively and vivid, which is what a comedy anime need. It contributes to the atmosphere greatly. Lastly, who can forget their facial expressions? They are very funny, fresh to the eyes, and can make you laugh. \\n\\n\r\nEach voice actor did a great job portraying their respective characters. The soundtracks are really forgettable, though they are also responsible for setting the mood of each scene. The opening is somewhat catchy and makes you jumpy, it really suits the anime's playful and cheerful atmosphere. The ending is a gorgeous song, with it's calmer melody it portrays the drama and romantic side of the anime. My only complain about the sound is the insert music in every later half of each episode. Although it is not a bad song, it gets quite out of hand and becomes annoyingly unnecessary.\\n\\n\r\nNow for the characters, they each have their own traits making them easy to distinguish from each other. Being a harem, one would expect that each character have their screen time one by one each episode. But this is not the case in Jitsu wa Watashi wa. Not only each character have their backstories, they are mostly part of each episode and no one gets left out. The main characters' personalities like being dense and bucket with holes spark a unique kind of chemistry which is good for an effective romance. Being a Romcom developments are slow, but you can see in each episode how well the creators execute scenes and dialogues for their developments.\\n\\n\r\nI'm not sure if this can give any laughs, but man, this is pretty entertaining for me. Some jokes are recycled, but most of the time you may get something you won't expect. Jitsu wa Watashi wa is a friendly supernatural Romcom that can stand on its own merits. \\n\\n\r\nThe summer season was fun indeed, but Jitsu wa Watashi wa was just left out in the corner and was overlapped by more mainstream anime. It is quite underrated and it deserves more than what it gets. Overall, it has a few flaws but it's still covered by its own shines. It is certainly not bad, but it has its limits for being good as well. \\n\\n\r\nStory - 8\\n\r\nArt - 7\\n\r\nSound - 7\\n\r\nCharacter - 8\\n\r\nEnjoyment - 9\\n\r\nOverall - 8",
            "date": "2015-11-04T04:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 202643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3779267.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BaptizED",
                "username": "BaptizED"
            },
            "url": "https://myanimelist.net/reviews.php?id=202643"
        },
        {
            "content": "Hey , hey, Jitsuwata is over\r\nHey, hey, what can I say?\r\nHey, hey I'm making a review.\r\nAnd here's how I'm gonna do it.\r\nStory: \r\n1 time:\r\nThe plot may depend on the usual harem genre, but it cannot be consider as a true if there is an absences of competition among the harem members for the guy's affection.\r\n2 Times:\r\nThe plot does contain certain comedy that makes this anime's story category nice.\r\n3 times:\r\nSo for the story category I hereby give it a 6, since just like the usual it always involves the guy getting his ass on the line.\r\nArt:\r\n1 time:\r\nThe anime's art doesn't rely on the usual fanservice tosell.\\n\\n\r\n2 times: \\n\\n\r\nIt still has that moe and panchira thing that is a quintessential in all anime /manga, also the character's school uniforms weren't uniform, in fact I can't understand as to wtf was going on the mind of original creator Matsuda, Eiji for the cast's nonuniformal school uniforms.\\n\\n\r\n3 Times: \\n\\n\r\nTherefore, I think a decent 4 would do just fine.\\n\\n\r\nSound:\\n\\n\r\n1 time:\\n\\n\r\nFrankly, I jaz have nothing much to say about the character's voices, except that I like the opening theme.\\n\\n\r\n2 times:\\n\\n\r\nHowever both Yoko and Mikan's voices sounded a little bit mature.\\n\\n\r\n3 times:\\n\\n\r\nEven so I  give this category a Fair 6. Since there isn't much for me to say.\\n\\n\\n\r\nCharacter:\\n\\n\r\n1 time:\\n\\n\r\nIn this anime, it was basically all about Youko, Nagisa and Kuromine, now Like I've said this anime may have a harem genre it wasn't a true harem,  since even the presences of Mikan and Akane, there not much competition for Kuromine's affection, even Nagisa wasn't trying hard enough to get Kuromine's affection, in fact what she did  in episode 12 was merely wishy washy  that it kinda annoys me.\\n\\n\r\n2 Times:\\n\\n\r\nKuromine on the other hand was suppose to be this character who can't lie and yet he was present as an oxymoron, I may have hated the way he was portrayed, also Mikan wasn't give much of her own aired time which was unfortunate. \\n\\n\r\n3 Times:\\n\\n\r\nThen again his relationship for Youko is what gives this anime it's climax, so a Good 7 is in order.\\n\\n\r\nEnjoyment:\\n\\n\r\n1 time:\\n\\n\r\nAll I can say is that despite of the usual, it was still enjoyable enough to be watched and that's that, no more 2 times and 3 times.\\n\\n\r\nOverall \\n\\n\r\nI'm just gonna go for a Fair 6, since the anime itself was enjoyable, but the anime's title 'Jitsu wa Watashi wa\" was just too outta place, original creator Matsuda, Eiji should have titled his creation as \"Harem no Himitsu\" my harem's secrets since it was all about the guy who has to keep his harem's secrets a secrets.  Season 2?????????Maybe not.\\n\\n\r\nPEACE Chicos. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-09-30T03:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 200134,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=200134"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nJitsu wa Watashi wa loves its secrets. Many people (myself included) like secrets. It does not matter which side, either keeping or having them. Keeping them is all about trust between the parties, because once one person reveals the secret then it is a secret no longer. (This brings into question how many have to know a secret before it is no longer a secret, but that is a conversation for another day.) And having them is all about knowing who, if anyone, to tell.\r\nThere is actually a third side: the people not in theknow. I found myself on this side once. For one of my birthdays, my parents and siblings told me that we were meeting up with my grandparents for a small dinner. I thought this was perfectly normal given we have done this in the past.\\n\\n\r\nBut when we arrived at the restaurant, my entire family – uncles, aunts, and cousins – were waiting for me. Yes, a surprise birthday party. I was baffled that they were able to keep it a secret for so long. I will never forget that feeling when it first dawned on me what had actually happened: a weird, happy feeling of betrayal.\\n\\n\r\nIn my case, the secret was ultimately harmless. In Jitsu’s case, the secrets it holds are more important than any birthday party could hope to be.\\n\\n\r\nSTORY\\n\\n\r\nJitsu starts off innocently enough. Kuromine, a shy, unable-to-lie (contextually, keep a secret) boy has a crush on Shiragami, the silent, beautiful girl in his class. He musters the courage to one day give her a love letter, only to find her with wings out and fangs bared. In other words, he found out her secret: she is a vampire.\\n\\n\r\nThis is how Jitsu sets up almost all of its encounters with the various girls in the harem. Said girl is hiding an absurd secret that, coincidentally, Kuromine stumbles upon. This is the first anime’s sign of its repetitive nature. Many of the jokes rely on the same shticks, such as “Ero-mine-kun” and the principal of the school getting ragged on by her great-great-granddaughter, the teacher. Many of the jokes also rely on the same premise of misplaced expectations: the characters say the opposite of what is about to happen next. (“There is no way this is going to happen,” followed immediately by it happening.)\\n\\n\r\nTo be fair, the anime can get pretty clever with its jokes, especially when the jokes are based on the secret motif. The episode where Kuromine has to pretend that the small, actual Aizawa is a figure that he made – subsequently earning him strange looks from everyone, including Aizawa – is smart because the joke not only plays off of the premise of the show but also incorporates the aspects of one of its characters.\\n\\n\r\nYet it is the constant avoidance of progressing the relationships that is the most egregious. As a romance-harem anime, little progression may be expected, but Jitsu does not stall the progression. Instead, the anime actively seeks to halt the progression. Kuromine, Aizawa, and Akemi each have feelings they want to share, but the anime never gives them that chance. And even when it does, they are either conveniently interrupted by a falling giant vampire or they are misunderstood after a character falls on another. Even the writing has the characters always fumbling over their words, preventing them from forming complete sentences to get their thoughts across.\\n\\n\r\nIn a way, this halting is the point. The anime is all about secrets. The bigger ones are revealed, such as aliens and gender-switching wolf men. The other secrets – the real feelings of the characters – never getting revealed falls in line with the anime’s own motif in that, sometimes, secrets have to be kept private.\\n\\n\r\nNow, the anime goes about this in a roundabout manner when just the coincidental interruptions are stopping the secrets from surfacing. Meaning, the secrets are technically kept secret not by the characters but by random bad luck. Still, having this explanation cures some of the repetition within Jitsu.\\n\\n\r\nLooking at the anime on a broad scale, the overarching plot is simple: Shiragami is not allowed to have her secret known to anyone. Otherwise, her father will take her out of (human) school. Hence, Kuromine keeps this and the other girls’ secrets secret for the whole season, once again following the show’s motif.\\n\\n\r\nStill on a broad scale, the anime does not explore a definitive theme. This is not technically a negative since the anime wanted to be nothing more than a slice-of-life comedy. But refusing to be more purposeful in its presentation is not a positive, either.\\n\\n\r\nOn a smaller scale, there is the romantic subplot (mainly) between Kuromine and Shiragami where Shiragami’s parents mirror their relationship – a human and a vampire falling in love. Such mirroring is nice, but, since the relationship between the new (would-be) lovebirds never blossoms, the subplot serves little purpose within the anime.\\n\\n\r\nGoing to an even smaller scale, Jitsu is mostly episodic in its presentation. Individual episodes rarely follow one another, instead focusing on slice-of-life antics. The group trying to make chocolate to save the world from an impending asteroid, Aizawa teaching Shiragami to dodge the sun’s rays by utilizing the shadows, and Shishido demonstrating pretty clearly what it means to be “grown-up” are a sampling of the events.\\n\\n\r\nThese slice-of-life events bring about the laid-back nature of the show, keeping the mood from reaching overly dramatic levels and hence maintaining the comedy throughout the season. The final episode is the only strange one due to it not feeling like a final episode for two reasons. One, there is (yet again) not a confession between Kuromine and Shiragami. And two, not everyone is included.\\n\\n\r\nSo while the anime works as a slice-of-life, a myriad of issues bog down the show extensively.\\n\\n\r\nANIMATION\\n\\n\r\nOne of the better parts of Jitsu is, surprisingly, the art and animation.\\n\\n\r\nDue to the wacky nature of the comedy, the actual animation has a lot of movement involved. Characters running, blood flying, and explosions exploding are rampant throughout the season. Subtler movements, for hair and for eyes, are also present. The animation itself is nothing intricate, but the animation manages to consistently stay at a high level.\\n\\n\r\nIn terms of the artistic direction, the art is a mix of negatives and positives. On the negative side, the locations visited are nothing special. The school’s classrooms, hallways, and nearby facilities are the most common, leading to a lack of detail and diversity. Shiragami’s room is also visited but only occasionally. Rarely does the anime include places outside of the school and Shiragami’s room – an amusement park and Shiragami’s father’s house are some of the only exceptions. The camera is similar in the sense that little experimentation is done with it throughout the season. Running segments in the hallways (there are a lot of these) are as fancy as it gets.\\n\\n\r\nOn the positive side, Jitsu places a lot of attention on the reactions of the characters. A myriad of different eyes, mouths, and faces are used constantly, improving the comedy of the anime. Lighting is also given focus: shadowing on the characters and differing light sources for the backgrounds demonstrate this.\\n\\n\r\nThe anime also employs subtle techniques. Akane’s auras that flow around her is one such technique, and Shiragami putting the back of her hand over her mouth by instinct is another. These are small details, but they add to the overall execution of the show.\\n\\n\r\nBut it is the characters’ designs that come out on top. Kuromine is designed as a self-insert character (bland colors and boring features), but his design does not take away from the girls of the show. The girls, in contrast to Kuromine, have vibrant colors, pretty eyes, and unique features that make them look like actual characters.\\n\\n\r\nFor example, Shiragami’s long, green hair, two sharp fangs, and black pantyhose with skirt and blue top give the vampire a quirky yet refined look. Aizawa is another character with a nice design: her short blue hair, her tie with collared shirt, and her bolt (her alien antenna when she is seen in her small form) paint her as both the professional class representative and the alien that she is. Shishido’s design, with her chained collar (for her wolf self) and her spotted jacket (contrasting with her sexy self), further proves the strength of the characters’ designs and the overall strength of the art.\\n\\n\r\nCHARACTERS\\n\\n\r\nJitsu does not create the most compelling of characters; they are what many would say are “not well-written.” However, the anime does provide a handful of characters whose personalities fit within the confines of the show and one character whose message is something that anyone can take to heart.\\n\\n\r\nStarting with Kuromine’s friends – the group of three boys who silently support him from the sidelines – they exist almost exclusively to balance out the male-to-female ratio in the show. This is not to say that they are unfunny or absent throughout the season, but they do not do much outside of giving Kuromine courage from time to time and subconsciously satisfying the audience.\\n\\n\r\nSpeaking of the main protagonist, Kuromine, as his design indicates, is a self-insert character. He is kind to everyone, he always tries to make the best out of every situation, and he has every (weird) girl in the school vying for him. His unique characteristic, however, is his inability to have a poker face. For this reason, the students call him a “Leaky Basket” for never being able to keep a secret. So it is only right that he must keep the secret of every harem member. Unfortunately, since the anime does little else with Kuromine beyond his initial introduction, and the girls outshine him in terms of comedy, his character is as lackluster as they come.\\n\\n\r\nAizawa is on about the same level as Kuromine. She is an alien piloting a human-sized robot that looks just like her. She tries to maintain order through her position as class representative, but she is perhaps the most spur-of-the-moment and most chaotic person in the group.\\n\\n\r\nAizawa is cute and she is fun, but her character does little else besides impede the relationship between Kuromine and Shiragami. She develops feelings for the “Leaky Basket” halfway or so through the season – due to this kindness and because he kept her secret – causing her to feel distressed, both about hurting her two best friends and about hurting herself. By the show’s end, she (internally) says she will step aside for the other two lovebirds, yet it is clear that she is not completely over her feelings.\\n\\n\r\nThen there is Akemi, the childhood friend of Kuromine. Yes, she has a crush on him (the common childhood trope). And, yes, she has a secret that she hides from everyone else. (Her glasses harbor a spirit of fortune who is not-so-lucky.) Her character is actually not that important and even not that relevant to the anime. All that matters with her is her glasses which caused yet another situation in which Aizawa gets to mess up the prominent pairing of Kuromine and Shiragami.\\n\\n\r\nIt is not until Shishido arrives that the characters start to gain some traction. She is Shiragami’s childhood friend, and, coincidentally enough, she is a wolf man. When the moon shines bright (or if she even sees a picture of the moon), she changes into her male self and vice versa. Still, her most known feature is her perverted nature: She regularly puts her head under the skirts of the other girls among other lewd activities. Though this is not what makes her character better than the rest.\\n\\n\r\nWhat does make her character better is her ability to read the situation. She is able to do this because of her perverted nature. She is, as she would say, “honest with her feelings.” Where the rest of the characters try to mask their feelings or play off the emotions they are feeling, Shishido is there to point out what everyone is really thinking. She is a funny and helpful person which is about all you can ask of from a side character.\\n\\n\r\nSurprisingly, Shiragami is the strongest character of the show for a reason that may not seem immediately obvious. Shiragami is a vampire, or, more specifically, she is a half-vampire. She tans easily in the sun, she cannot swim, and she does not own a coffin because it is too luxurious for her. Her most defining feature, though, is how dense she is. As the characters say, this feature is why she is a perfect match for Kuromine: She is too dense to understand his painfully obvious feelings for her (“opposites attract”).\\n\\n\r\nThis is all that Shiragami’s character is. Like the others, she does not develop as a character. She may ever-so-slightly stray away from her path – calling Kuromine by his first name is as adventurous as she gets – but, for the most part, she remains the same quirky vampire girl from start to finish.\\n\\n\r\nBut she reveals something through her thoughts. In episode nine, Shiragami has a heart-to-heart with Kuromine where she says the following line: “It’s important to keep my secret, but I realized that there are even more important things.” When she says “important things” what she means are friends.\\n\\n\r\nThis a beautiful sentiment. Nobody should ever be lonely in life. There are strangers to greet, people to befriend, and relationships to share. For Shiragami, her secret stopped her from having these connections. She was not able to have the kind of school life that she wanted, and, indeed, the kind of life that everyone deserves.\\n\\n\r\nKuromine is the one that allows her to realize her mistake in thinking a secret is more important than enjoying life with others. And through his persistence to connect with Shiragami, Shiragami makes friends with Aizawa and then Akemi and then everyone else in the show. In other words, she finally obtains those “important things.”\\n\\n\r\nThe anime may not have the most compelling of characters, but, at the minimum, this message that life is best spent with others is truly wonderful.\\n\\n\r\nSOUND\\n\\n\r\nOne of the best pieces of the original soundtrack is the transition music between the A and B parts of the episode. It is not many notes, and it is only an acoustic guitar accompanied by a flute, but the simplicity of the track and its wonderful slice-of-life feel make the track a joy to hear.\\n\\n\r\nThe rest of the OST is standard for this type of anime. Slice-of-life tunes, triumphant ensembles, and sad compositions fill the air as the anime is watched. There is a notable track, however. Technically two tracks are worth talking about, but they are the “same”: the insert song and the instrumental version of the insert song. The former is annoying. It is used way too much, it is played at strange times, and it is formed of silly English lyrics. The latter is wonderful. It is used less frequently, it is played at the perfect times, and it is formed of just simple and soft sounds.\\n\\n\r\nLooking at the opening theme, it is a fun track which the water-droplet effect at the very beginning flags. The first half is somewhat mellow, contrasting nicely with Jitsu’s usually rambunctious self. The second half of the track still maintains the same pacing, but it chooses to ramp up the instruments and the vocals while also changing up the base beat. The track ends how it started, giving it a welcomed full-circle effect.\\n\\n\r\nThe ending theme is arguably not just the best track among all of the music but also the best part of the entire anime. It is a hip-hop track, although, instead going fast and hard with the lyrics, the track slows everything down. The track itself is meant to reflect how much more fun everything is in a group (following the theme from Shiragami) which is corroborated by both the change in mood in the second half of the track and the visuals. Alongside the rhyming, the background singers, and the extremely catchy beat, the ED is a wonderful track to listen to both in and out of the anime. (Plus, it is fun to sing the “jitsu wa watshi wa” lyric.)\\n\\n\r\nAs for the voice acting performances, they were fantastic, reaching the same level of quality as the ED. Yuu Serizawa as Shiragami does not have too many anime under her belt (approximately twenty), but she gives the cute vampire an innocent and charming voice. Inori Minase as Aizawa has been in more anime, using her slightly tomboyish voice to fit the “Iron Lady” extremely well. And Natsuki Hanae as Kuromine is just as formidable, providing the main protagonist with a lot of screaming and straining. Also, a special shout-out to Mao Ichimichi as Akane for giving the little devil a sinister yet adorable way of speaking.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt makes me a bit sad that this one did not reach a higher level of popularity because, regardless of its faults, this is still an entertaining show.\\n\\n\r\nI was drawn to this one due to the romance stuff. This anime is saturated in blushing, flirting, and loving, so many of the jokes – no matter how repetitive – were always making me laugh. Simple stuff like Shiragami sitting close to Kuromine when Shishido got clingy, and Kuromine and Shiragami’s private moment at the pool at night, made my heart flutter.\\n\\n\r\nThe characters themselves were rather fun, too. Shiragami acting all cute when Kuromine was there to support her and be her friend. Aizawa always misunderstanding everything and her running gag with her “Memory Erasure Device.” Shishido caring about nothing but sexy or perverted acts.\\n\\n\r\nBut if I am being honest, I did not particularly care much for Akemi due in part to her mean-spirited attitude towards Kuromine. I get that she was using a “teasing him so much because she likes him” mentality, and she does become less frustrating later on in the season. But the frequency of her meanness in the beginning made me dislike her. Luckily, the other girls make up for her annoyance handily enough.\\n\\n\r\nAs for the other characters, I found Kuromine’s other friends to be fine, but Akane and Akari were right alongside Shiragami and the other funny girls. Akane and Akari’s constant bickering and insults and abuse towards each other was really funny to me because of just how far they would take it, like Akari throwing Akane by the horns or Akane blowing up Akari’s newly-purchased car.\\n\\n\r\nJitsu wa Watashi wa is a comedy-fantasy-romance-school-shounen-supernatural anime, but that does not mean one should automatically discount its contents. The sound work is strong, the character designs are vibrant, and the main message of the characters is beautiful. Of course, this does not make up for the repetitive writing and the simplistic characters. At the same time, this does not take away from the laughs the show has in store. Putting it another way, it should come as no surprise – as no secret – that this one is just plain fun.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, misunderstandings galore, gross repetition, and problems on each scale of the narrative obfuscate some of the cleverness the plot holds\\n\\n\r\nAnimation: Good, above average actual animation, a mix of strong and weak artistic direction, and nice character designs\\n\\n\r\nCharacters: Fine, Kuromine, Shiragami, and the rest of the cast are individually bland, but their group’s message that life is better with friends is a beautiful mantra\\n\\n\r\nSound: Good, good OP, great ED, okay OST, above average VA performances\\n\\n\r\nEnjoyment: Good, lots of romance combined with fun characters create a high amount of entertainment\\n\\n\r\nFinal Score: 6/10",
            "date": "2016-03-20T06:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 213417,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=213417"
        },
        {
            "content": "Romantic-comedies are one of those staple genres in every part of the world, with some focusing more on the romantic aspects while others focus more on the comedic sied of things. Despite being quite a bit unrealistic in relation to the romance part, most rom-coms are very much grounded in reality. Jitsu Wa Watashi Wa is just the opposite with its non-sense comedy.\r\nJitsu Wa Watashi Wa (Actually, I am…) is the anime adaptation of the rom-com manga of the same name, published by Shounen Champion and created, written and illustrated by Eiji Matsuda. The adaptation is directed by Yasutaka Yamamoto (Mondaiji-tachi ga Isekai kara KuruSou Desu yo?, Valkyria Chronicles).\\n\\n\r\nAsashi Kuromine is a high-schooler with a strange peculiarity: he can’t lie or hide his emotions. Also, he has a crush on Youko Shiragami, a mysterious girl from his class that never participates in PE class and is always the last student to leave school. One day, he decides to confess his feelings after-school. Because of that, he discovers that she is, actually, a vampire. Now he has to keep her secret, while trying to get closer to her and dealing with other supernatural beings and even aliens.\\n\\n\r\nJitsu Wa Watashi Wa is not your usual rom-com, it has too much of a taste for the weird and nonsensical to be one. At first, the comedy is a bit weird, but it builds up on its own weirdness to become something that reminded me a bit of Monty Python, with all of its craziness and novelty. As crazy as it sounds, air-headed vampires, randomly appearing ice-creams and a devil with a sweet tooth are normal occurrences in Jitsu Wa Watashi Wa . The comedy never becomes stale, as, with each new character, new interactions and situations become possible. While they don’t evolve much in terms of development, all of them are instantly likeable with a decent degree of depth. Also, most of the characters are twists in the “normal” horror monsters: vampire, werewolf… Still, it is a rom-com, and, as a result, most of the development is based around the fact that characters fall in love with each other.\\n\\n\r\nThe characters’ interaction is wonderfully crazy and, somehow, they always outdo themselves, with crazier and crazier situations arising. This is only possible because of the great variety of the characters and their (sometimes conflicting) personalities. “Sexiness” contests, meteors’ attacks, spicy bread russian roulette and even plain old festivals are just some examples of the type of stuff that happens in Jitsu Wa Watashi Wa.\\n\\n\r\nThe visuals are vibrant, but take some time to get used too. After the initial reactions, it becomes pleasing to look at, but never reaches anything other than that. Likewise, the character design is colorful and eye-catching, creating a unique style.\\n\\n\r\nAs an adaptation, it was pretty good. It changed the order of the events depicted on the manga, but stayed faithful most of the time. Unfortunately, it is not as great as the manga, simply because of the way the comedy’s “snowballing” nature. Given a second season, it could reach the same levels of the manga.\\n\\n\r\nJitsu Wa Watashi Wa strength lies not in its story or characters, but its unique comedy. Despite its great quality, its enjoyment depends on the viewer’s own sense of humor. As a result of loving wacky comedy, I enjoyed the comedy of the series, but, again, it may not be for everybody.\\n\\n\r\nI would recommend Jitsu Wa Watashi Wa to people looking for an unusual rom-com that focus mostly in its comedy aspect and also to people looking to a Japanese-styled Monty Python.",
            "date": "2015-10-08T12:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 200774,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4599119.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Keatle",
                "username": "Keatle"
            },
            "url": "https://myanimelist.net/reviews.php?id=200774"
        },
        {
            "content": "Jitsuwa Watashi was a breath of fresh air. It followed a simple story that was easy to follow, without the emotional commitment. It's a pallet-cleanser anime. I had just bawled my eyes out after watching AnoHana, and I need something to ease the pain. I decided to try it on a whim, and ended up watching the whole thing in one sitting. \r\nIt delivers a refreshingly light humor that let me just relax while I watched. I credit much of that to the timing of its jokes, as well as the pacing of the story. \r\nThis show is definitely a hidden gem.",
            "date": "2016-03-02T10:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 212103,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5090678.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sunnyundies",
                "username": "sunnyundies"
            },
            "url": "https://myanimelist.net/reviews.php?id=212103"
        },
        {
            "content": "Is it even possible for something that is very cliched to still be very enjoyable? For example, a lot of anime involve vampires, secrets, harems, and mutual feelings to never be confessed, and those are just among what this anime contains. Even though I knew this, I really looked forward to watching this particular anime when the July 2015 season rolled around; I couldn't shake off the feeling that it was going to be fun to watch. Sure enough, I was right, although I wasn't able to catch up to it in time for it to end. Well, now that I've finally been able tofinish it, what do I think now?\\n\\n\r\nLadies and gentlemen, it's no secret that I'm now reviewing \"Jitsu wa Watashi wa\", known as \"Actually, I Am....\" in English!\\n\\n\r\nJitsu wa Watashi wa follows a boy named Asahi Kuromine, who is referred to as a \"leaky basket\" due to how bad of a liar he is. One day, he finds himself faced with an important secret; his classmate and crush, Youko Shiragami, is actually a vampire! In order to avoid getting her pulled out of school due to her secret being exposed, Asahi tries his best to keep Youko's secret and ends up befriending her in the process. *coughfriendzonecough* Along the way, he discovers the supernatural secrets of others, such as the class rep, Nagisa Aizawa (an alien), and Youko's childhood friend, Shiho Shishido (a \"wolf man\"), and he must keep those secrets, too. Geez, that's a lot of secrets for one leaky basket to keep!\\n\\n\r\nI bet you'd look at the summary and think, \"Haven't I seen this somewhere before?\" As I mentioned at the beginning of this review, Jitsu wa Watashi wa is packed with cliches from fellow romantic comedy anime. You know what, though? That didn't stop the comedy from being hilarious or at least amusing; even if a joke didn't get me laughing out loud, I would at least be smiling the whole time! Its cast of characters helped this show, too; most of them are very fun to watch. Even though the romance between Youko and Asahi ends up not progressing much throughout, it was still fun to see them together.\\n\\n\r\nThe animation for this anime was pretty great. I haven't seen too much of TMS Entertainment's anime, but out of the ones I have seen, this is definitely some of the most appealing I've ever seen out of them, with its bright colors. The voice actors definitely nailed their roles, as well. I especially liked Inori Minase as Nagisa; I really felt that her voice fit her character. The opening theme, \"Himitsu wo Choudai\" by Ars Magna, is such a fun song to listen to and one that definitely fits this anime; the ending theme, \"Ienai Ienai\" by Hilcrhyme, is also a very nice song to listen to.\\n\\n\r\nOverall, Jitsu wa Watashi wa is definitely a fun anime to watch. If you like romantic comedies and don't mind the cliches, I'd definitely recommend for you to check it out. Even if you don't like it, though.... well, it's no secret that we all have our own opinions!",
            "date": "2016-08-05T10:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 225988,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=225988"
        },
        {
            "content": "Alright, first and foremost before we even start this review: *Read the damn manga.*\r\nIt's already completed and the story, arcs and characters are way better portrayed there.\r\nThe anime adaptation, however, was only a poorly executed atempt to advertise the manga. But don't get me wrong, it is, in fact, not a complete trainwreck. Each episode mirros the original source really well and the humor is pretty much the same. The voice acting is decent to and Inori Minase as (best girl) Nagisa is, as usual, masterfully well acted from her part.\r\nThe weak points of this series is the fact that it's only 13 episodes long,which barely covers all of the character development the manga has in its totality, not to mention that some characters that are of great importance in the manga  don't even appear in some of the episodes. So yeah, if you manage to finish watching them all, you'll feel that something was missing and that something just didn't feel right. And that's exactly why: it only showed a portion of the whole thing that comes after the arc that was covered in the anime.\\n\\n\r\nIf you're a fan of romantic comedies and monster girls, this series is definitely for you, but only watch the anime as an introduction of the whole thing that the manga of Jitsu wa Watashi wa is, because it is absolutely incredible and I cannot recommend it enough.\\n\\n",
            "date": "2018-04-24T11:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 278889,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6374930.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Edil23",
                "username": "Edil23"
            },
            "url": "https://myanimelist.net/reviews.php?id=278889"
        },
        {
            "content": "Secrets are the spice in a person's life.  Everyone has a secret, and it's because of these little factoids about ourselves that make us different...and make people want to know about them even more.  So, with Jitsu wa Watashi wa, or \"Actually, I am...\", what kind of secrets will we learn about today?\r\nStory: Kuromine Asahi is a relatively average guy in school.  He's normal, but has one fatal flaw to his character, and that is, he can't hold onto someone's secret for the life of him.  As such, he has been called the \"Leaky Basket\" by all of his peers becauseany kind of secret he is told immediately comes out in a blaze of glory.  But, Asahi has a secret of his own; he likes Shiragami Youko, a girl who acts very distant from the rest of the class with weird habits like leaving school in the evening and sitting out during P.E.  So, on his way to confess to her because he knows her weird habits like a creepy stalker, he bursts into the classroom and sees Youko...with wings coming out of her back.  Oh boy, here we go again...\\n\\n\r\nJitsu wa, as the shorthanded way of saying this series' name is, revolves around Asahi and his band of merry fellow main characters as they go through various antics that appear either in front of them, or just come to them from some god unknown force.  Since this is a school anime, the base storyline is a bunch of highschoolers spending time together, and that's really about it.  However, Jitsu wa's biggest draw comes from the way its seemingly random story is presented.  \\n\\n\r\nComedy is the main reason to be drawn to this series, as it's brand of comedy...cannot be explained in words very easily, so I will attempt to elaborate.  As the main focal point of the series, Jitsu wa's spectrum of comedy goes from sheer stupidity of the main cast (like accidentally revealing their respective secrets) and the following retorts ironically by our main protagonist who apparently can't keep a secret, to seemingly random, balls to the wall, what the fuck just happened scenes that again, cannot be accurately explained in words.  It's this blend of comedy that really makes the series unique compared to any other supernatural high school show.  The only issue I have is that they don't execute the jokes well enough to properly integrate them into the series, and as a result, sometimes feel a bit forced.  \\n\\n\r\nThe main issues this show has comes in a pair of two.  First, the show doesn't flow all that well.  The entire show is comprised of random chapters from the manga squished together to form an adaptation story of its own.  As such, a lot of the events that occur happen either much later or earlier than they should making for some uneven flow and jumps in how things happen, and the biggest problem, is that there are characters that feel like they just show up out of nowhere without much explanation.  (Cue Fuku)  The other issue is the fact that the show plays itself more as a generic romcom more than anything else which doesn't translate well when compared to the source material.  \\n\\n\r\nIn the end, this adaptation of one of the more out there stories in anime today fumbled a lot with how it wanted to present itself.  Acting more as an allusion to the Jitsu wa Watashi wa series, this adaptation failed to properly explain certain things with what it wanted to show us, and made some progressional issues that seemed a bit rushed.  While it still has the comedic charm with its inexplainable brand of comedy, there were still aspects to it that didn't have as much of an impact as it should've.  Plus, it kinda ended in a weird place.  That would not be the chapter that I would say you should end the series on.  \\n\\n\r\nOverview:\\n\r\n+/-  Random but hilarious comedy (Positive or negative depending on your perception of funny.)\\n\r\n-  Bland base story (Highschool, again.)\\n\r\n-  Pacing and explanation issues\\n\\n\r\nCharacters: With its brand of comedy, Jitsu wa provides us with some interesting characters to fill in the bubbles as to who says what.  \\n\\n\r\nFirst, we have Kuromine Asahi, the main protagonist of the series, and the leaky basket.  As the person who can't hold a secret to save his life, Asahi spends the entire series trying to keep the girl he befriends but secretly loves, Shiragami Youko.  (As well as other characters because honestly, everyone in this show is a genuine idiot.  It's not an insult.  They are legitimately stupid.)  Ironically playing as the straight man, Asahi retorts back any kind of stupid statement or idea that is suggested by any of the other characters, before being promptly sucked into said idea and thus, is plagued with the stupidity of the people around him.  Really though, that's all Asahi's character is.  Throughout the whole series, Asahi says to everyone that he loves Youko, and he stays that way with every passing episode.  There's no growth for him because he starts at the point of saying he'll protect her secret, and ends with saying that he'll protect her secret.  So really, there's no difference and as such, there's no development for his character.\\n\\n\r\nThen we have Shiragami Youko, the vampire (or Dumpire as I like to call her.  Dumb Vampire = Dumpire) and main female protagonist of the series.  First seen as a distant and reserved girl, Youko is actually really cheerful and absent minded most of the time.  Rather than the male being completely oblivious to the girls' feelings, Youko is a girl who is dense herself and can't see Asahi's feelings.  As such, she, with help of Asahi shooting himself in the foot at the confession, thinks of him as nothing more than a friend.  But not only that, a PRECIOUS friend.  The whole show plays around with this idea of these two characters dancing the waltz of \"Will they or won't they\" while also having other players to the mix of this strange semblance of a romance show.  \\n\\n\r\nAnd finally, we have Aizawa Nagisa, or Screw Girl, as I like to call her.  (You know, cause she has a screw on the back of her head?)  As an alien who is about as tall as a nendoroid, Nagisa is the stoic member of the cast whose slightly militant-like personality causes her to lose any credibility that she was taught in the military because she reveals her secret about 10 minutes of her existing.  (Like I said, everyone in this show is stupid to some extent.)  Nagisa mostly plays as the secondary female of the series and, with the help of another character, Mikan, create the harem aspect of the series which is rather prominent in the series in the grand scheme of things.\\n\\n\r\nThe rest of the characters in Jitsu wa play mostly supporting roles for the series, which is a real shame because some of the best characters of the entire series either get shelved off to the side as supporting cast, or show up so late that they won't have enough time to make much of an impact.  It's this treatment of the cast members that disappoint me because a lot of these \"supporting members\" are actually the ones that bring a lot of joy in the manga, which would've help boosted this adaptation from being what looks like a generic romcom.\\n\\n\r\nOverview:\\n\r\n+ Unique, interesting, and above all, wonderfully stupid characters\\n\r\n-  A lot of the cast members were just casted off to the side\\n\\n\r\nArt: Art for Jitsu wa is a bit of a touchy subject.  Made by TMS, this adaptation brings the Jitsu wa series to life through a style of animation that is both similar, and different to the original style in the manga.  \\n\\n\r\nContrary to the goofy and overall wacky artstyle that this series has, filled with very unique facial expression oddly never seen in any series ever, as well as overdramatic events that make the series well known, TMS opted for a more moe artsyle where the characters look a bit more \"normal\" and didn't have that goofy looking style that the original show had.  This artstyle is just average in its own right, with nothing really outstanding about it to make it stand out as a series visually.  Sure we get some of Jitsu wa's signature facial expressions, but there's really nothing that special about it.\\n\\n\r\nOverview:\\n\r\n+/- Mediocre, moe-style art\\n\\n\r\nSound: As for the soundtrack, the OP for Jitsu wa is a perfect representation of the series.  With a very upbeat track that skips to its own tune, this track is, while not extraordinary, is pretty memorable.  It's catchy, it's fun, and overall pretty nice to listen to.  \\n\\n\r\nThe ED on the other hand is a bit of a random style to fit with this show.  With a kind of rapping/melancholic style of music to it (I have no idea what to call it.), the ED admittedly isn't something that I would call good, but it's pretty unique for a song style/choice, I'll give it that.\\n\\n\r\nOverview:\\n\r\n+ Catchy, memorable OP\\n\r\n+/-  Odd ED (Has good and bad aspects to it.)\\n\\n\r\nPersonal Enjoyment: As someone who has read the Jitsu wa manga to the most recent chapter, I was mystified about seeing the adaptation.  Since the series look rather different than what it looked like in the manga, I assumed that there were going to more than just stylistic changes to the entire series and was a bit scared about how things would turn out.  In the end, it wasn't an Isuca incident, but I still don't like it.\\n\\n\r\nWhat did I like about this series?\\n\\n\r\nSure I got a few laughs out of the whole thing but honestly, I didn't really like this adaptation.  The show felt like a romcom or harem anime, not Jitsu wa.  They took chapters from random parts of the manga's timeline and turned it into the series (sometimes completely out of order too) which made me wonder why they did that in all honesty rather than just sticking with the inherent plot.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nThis adaptation didn't feel like Jitsu wa.  Jitsu wa is a series that for me, is one that has twists and turns on every corner with complete balls to the wall and random crap that happens so out of this world that busting your sides is just a norm for people who read the series.  They didn't use a lot of the characters to their full potential and as such, made the series less special on account of the lack of screentime for some of the best characters of the entire series.  I'm also not a fan of the stylistic change of the artstyle and where the anime ended, because that is a very awkward place to end it.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nAll in all, Jitsu wa is another anime vs. manga scenario.  Even though I say that this adaptation doesn't completely feel like Jitsu wa, there are enough elements of it to allude and at least explain the main story of the series.  (Even though they still did screw it up a bit.)  As such, if you want to know about the Jitsu wa series without reading 90+ chapters and see the random antics in animated form, go for this adaptation.  Just be warned to see some crazy shit.  Because things can go from 0-100 FAST.",
            "date": "2015-09-28T16:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 200008,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=200008"
        },
        {
            "content": "Oh joy! I get to spend Easter (orthodox holidays) in Germany, where people wouldn't recognize good humor if it hit them in the face... Lets download some comedy anime so that I have something to watch while I'm there. Lets see... A guy who can't lie has to keep a secret about a vampire girl? That sounds hilarious! The only way they could possibly screw it up is if they added completely needless... They added god damned slapstick...\r\nYou see people, the point of slapstick comedy is to take hard, painful, boring situations and turn them to funny ones. A cat chasing a mouse for exampleis mundane, but when you add slapstick to it, it becomes funny. Now in a situation that's already comedic on its own, such as an idiot who can't lie trying to keep a vampire's secret, SLAPSTICK DOESN'T FIT.\\n\\n\r\nSo as you can guess, the scenario revolves around a guy who can't lie, who accidentally finds out the girl he likes is in truth a vampire. It is decided that since she got caught she should give up on high-school, but upon hearing this, the protagonist swears to keep her secret, essentially sealing a pact between them. Except the vampire girl is a dumb idiot who friendzones him from the start and the way the series goes it's a wonder she hadn't got discovered already, with her moronic behavior. Along the way things get slightly more complicated when the protagonist's previous crash also turns out to be a weirdo (a chibi alien in this case, operating a human-sized robotic version of herself) and she is also discovered. So basically it is a trio of the alien chick liking the protagonist but the protagonist being oblivious to it, the protagonist liking the vampire but the vampire being oblivious to it, and the vampire trying to support the alien girl hooking up with the protagonist.\\n\\n\r\nIn  sort, the protagonist forms his own harem full of forced tsunderes or dumb morons. To sum it up, while original, it isn't the most likable of casts, especially since their performances come out really unnatural, because we REALLY NEEDED THE F@CKING SLAPSTICK. What's truly annoying though, is that the anime was clearly written by two joke writers with completely different ideas of what humor is. And the stupid one apparently outranked the smart one. I believe the dialogue below should explain this well:\\n\\n\r\nWriter 1: And just as the main character is in a moral dilemma between lying to his friends and letting his alien love interest have her skirt flipped...\\n\\n\r\nWriter 2: We'll add a chase scene to it!\\n\\n\r\nWriter 1:He... What?\\n\\n\r\nWriter 2: You know, chase scene. Because that's what people think of when you say \"good humor\". Sylvester an Tweety.\\n\\n\r\nWriter 1: You are a mockery of everything I work for.\\n\\n\r\nWriter 2: Well too f@cking bad, I'm the boss, deal with it.\\n\\n\r\nIf this show was written by one idiot I'd just say \"good, it's stupid, end of story\". But it is clear through all that chaos that really intelligent writing is hiding underneath all the trash, but it keeps getting interrupted for filler bullsh!t. The show follows tired cliches because it's afraid of venturing the more dangerous path, even though it clearly has the potential to do so. And if there's something I hate more than natural stupid crap, it's crap that had the potential to be smart, but instead got scared and joined the comfort zone of being stupid like all the others. And even worse it ends up being JUVENILE crap.\\n\\n\r\nVisuals have a fresh look about them and the voice acting is ok. But the show is too juvenile, too kid-focused to be of any real fun to a crowd that doesn't think hitting on doorbells and then running away is a good prank. Stay away.",
            "date": "2016-05-01T03:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 217594,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=217594"
        },
        {
            "content": "A young man who could never hide secrets and the girls that their secrets should notbe known by anyone, even shades of irony in the basic plot of this anime immediately indicated that he would be a great comedy. And it turns out it is true! Through the hard struggle when trying to protect confidential Asahi Youko and Nagisa, and then coupled with the behavior of the characters witty as mystical creatures (and alien) that violates the general conception of them, this anime is able to give birth to jokes were quite original. Although a bit unfortunate that he could not maintain its quality isalways at the same level, especially when he stepped out of two earlier themes, secrets and playful behavior, overall, this is a comedy anime that is very satisfying. And the same thing can also be said for the romantic side. Anime is clearly not the best romantic story, but there remains a sweettaste that can be found on the triangular relationship Asahi, Youko, and Nagisa. Perhaps the reason is because as someonewho has a secret to someone who protectsthe secret with a vengeance, the feelings of the characters seem real and grow naturally and not something imposed fromnowhere. As a result, every scene involving their feelings, even the most simple as when they spoke shyly, will instantly become more meaningful.",
            "date": "2017-02-26T01:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 241414,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241414"
        },
        {
            "content": "I'm new to anime in general, and Jitsu wa Watashi wa is one of the first series I ever completed. So take my review for what it is, a noob's review.\r\nThe first episode drew me in almost immediately, and I related with the protagonist very quickly. Aside from the \"fantasy\" side of the story, the overall plot isn't anything out of the ordinary. Your basic love triangle type deal with complications along the way. However the characters are memorable and the school setting is fitting. Also, there are a few twists in the story that do make it stand out, especially for a romantic comedy.It has plenty of endearing moments. \\n\\n\r\nI dig the opening theme music too. Overall, very satisfied and would recommend to anyone just starting out with anime. This is going to get me to watch more and more.",
            "date": "2015-09-28T20:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 200027,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4893767.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/davidvkimball",
                "username": "davidvkimball"
            },
            "url": "https://myanimelist.net/reviews.php?id=200027"
        },
        {
            "content": "Jitsu wa Watashi wa (Actually I am...)\r\nTo be honest with you all, I never expected to see such decent anime from the summer-season (Heat Season for Ecchi anime) of 2015 like this one.\r\nOkay. Let's be honest with ourselves. Arts for Jitsu wa Watashi wa was poor. There were number of my mates who thought the anime was going to be crap just by seeing the arts and genre under it, which was 'Romance' and 'Ecchi' and 'Comedy' and 'Vampires'.\r\nOooh, is it going to be 'Twilight' all over again...... That was what I was thinking.\r\nHow wrong I was.\r\nStory itself was quite well designed and all characterswere very loveable, But most of all, the show itself was very, very entertaining. I felt like watching a light-hearted shoujo anime show, and watching a great show about friendship and love story of Shounen Anime at the same time.\\n\\n\r\nIf art was good, perhaps I would even go far to give the score of 8, but I just couldn't say that art for this anime was near excellent.\\n\\n\r\nFor those of you who does not like romance anime, I recommend you this one to get into the world of 'Love-Come'. (Of course, those of you who love Love-Come can still watch it you know.)\\n\\n\r\nWell then, until my next review......\\n\\n\r\nSayonara~",
            "date": "2015-10-12T00:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 201068,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4922917.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/islay",
                "username": "islay"
            },
            "url": "https://myanimelist.net/reviews.php?id=201068"
        }
    ],
    [
        {
            "content": "It seems there may be a new trend in anime in recent years. The concept of monster girls who lives in the human world is becoming more and more of a trend. Rosario + Vampire, Kore wa Zombie Desu ka?, Monster Musume no Iru Nichijou, and even to an extent, To Love Ru Darkness display traits where its main character cast composes of non-human female characters. So where does that put Jitsu wa Watashi wa? Nowhere too different really. To sum it up easily, this is a series about a guy who discovers that there are non-human beings living in his world. And one ofthem is not so far away as much as he thinks.\\n\\n\r\nAdapted from the manga of the same name, Jitsu wa Watashi wa (Actually, I am…) is a harem rom-com. There’s two ways the series goes about this. One is the way the characters are introduced, one by one in oddball fashions to the main character. The second is how the main character connects with them with a variety of feelings. And if you can guess, it mostly steers into a road of romance. However, it is also interesting to note that the series takes itself more as a comedy rather than human drama. How can human even fit into the same phrase here? \\n\\n\r\nWell, there’s the one human protagonist we meet from the very beginning. Known to his friends and peers as Kuromine and others as “Eromine” (there’s reason for this explained comically later), he is essentially the average teenager you can expect to see in any school related series. One day at school, he discovers a startling secret. He discovers that his secret crush, Shiragami Youko is actually a vampire. The key word here is ‘actually’. This is because the show is a matter of not ‘if’ but ‘when’. By predictable plot standards, it’s easy to guess that Kuromine will find out the secrets of other characters too. But for starters, his discovery of Youko lands him into some awkward waters. The way the show sets their relationship essentially begins as a form of pact. Kuromine likes Youko and vows to keep her secret from others. In turn, Youko begins to understand Kuromine and naturally begins to develop similar feelings. And as far as that goes, their school life begins to take into a road of misadventures as others get involved with their “relationship”.\\n\\n\r\nAs a series about rom-com, the main protagonist is hardly outstanding. He is the typical nice guy, the beta harem type that you can find literally in any similar series. What does make him slightly interesting is that he is honest and loyal. The first few episodes establishes this as he promises to keep Youko’s true identity as a secret. If not, Youko would have to be change schools in order to avoid shame. His personality seems to have influence on others as well as the characters encountered by him understands his intentions more than they originally had thought. This seemingly also attracts others towards him as they see Kuromine as a sincere person. Characters such as Nagisa begins to have conflicting thoughts about him as the series progresses, Youko falls further and further in love, while he attracts other weirdos like self-proclaimed pervert, Shiho Shishido. As amusing as this sounds, there’s hardly any good characterization on them. The series easily makes its point that it’s more of a comedy gag show rather than something to take seriously. The plot is also structured in episodic-like nature with some episodes that have little to no connections with the rest. \\n\\n\r\nDespite this, I do have to admit that the show has genuine comedy. This comes mainly from the character face expressions. In essence, we get two types. The first is human-like ones from Kuromine and his childhood friend Mikan. Their reactions to many events in the show is priceless and often seems like a work of art. Although it’s not as powerful as to the manga, it still retains its clever facial tone. The second is the dialogues. Because Kuromine is helping to keep a secret, there will be a lot of times where he gets into complicated scenarios where he may have to make up something in order to avoid trouble. Think of it more as “lying with the truth” and the dialogues that comes from it is hilarious. Of course, expect misunderstandings and events to get complicated more than they seem. \\n\\n\r\nThe series ultimately can be a hit or miss for fans when it comes to adaptation. To me, it’s a bit of both. I wouldn’t say it’s a failure but neither is it compelling. Rather than following the manga straightforward, the adaptation reshuffles certain chapters to make the overall story flow better. While this seems like a positive at first, it can also lead to important elements of the original omitted or parts added in too quickly. The good part that comes with this is the better pacing as some of the episodic scenarios can be frustrating and almost like if it’s testing the patience of the audience.\\n\\n\r\nTMS Entertainment is not a powerhouse but their involvement for this show does have some good values. The character designs aren’t outstanding as the characters looks generic and lacks the compelling feel of the manga. However, it makes it up for the facial expressions in particular Kuromine and Youko. Every episode has them and it’s hard to ignore. Otherwise, background work such as the school, neighborhood, and communities lacks concrete in detail. There’s also some bits of fan service used mainly for comedy gags. Don’t really expect much though as the show again often emphasizes comedy rather than eye candy.\\n\\n\r\nIn similar terms, the soundtrack is just fine as it is. The OP and ED theme song plays on note with comedy although can be easily forgettable. There’s also some spoilers in the theme songs so fast forwarding them if you want a better experience as an anime original viewer. There’s also a problem with Youko’s voice as she sounds like a character that is younger than she actually is. It will take some time to get used to as I did throughout the show. On the contrary, character voice mannerisms during “climatic scenes” are easily laughable for its comedic intent. When combined with the face expressions, the show really brings out a colorful side to the humor. \\n\\n\r\nSo what’s to say about Jitsu wa Watashi wa in the end? It’s probably a better idea to watch it for yourself. The show is something that should be watched if you want a fun laugh rather than any sort of realistic drama. The romance is almost like a satire at times as it feels dense yet amusing as the story progresses. And of course, who can forget about our colorful cast of monster girls? In retrospect, this show is more like an imaginative storytelling that can strike as peculiar when a guy learns what actually is…",
            "date": "2015-09-28T10:00:00+00:00",
            "helpful_count": 65,
            "mal_id": 199970,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=199970"
        },
        {
            "content": "If I were to choose whether I liked it or not, I'd say I liked it. The plot is decent, the characters are funny, and the anime is without flaw... OK, it isn't flawless. But it does have a certain charm to it, and I never even had the thought of dropping it. It was really entertaining. But the ending left room for improvement, and the characters' sub-par performance, in terms of uniqueness, quality and improvisation, could have been avoidable. If it gets a sequel, I'd watch it, though. \r\nStory: 7/10\r\nThe plot takes a very rough road to its destination. Once you're in a fewepisodes, you'll start noticing you've picked a favourite girl (or guy, I suppose) subconsciously. And you'll be routing for that girl (or guy...). But then that character loses all its screen time, and \"vanishes\" as a \"supporting character\". And that can be irritating at times. So, all in all, the plot is something you either like, or you don't. And the character development is slow, if not non-existent. You'll start noticing after they mention how much Asahi \"changed\", that he didn't really change at all. Honestly, the only characters that sort of changed are Nagisa and Mikan. The rest stay the same, more or less, until the end. It really does depend on your point of view, but despite the ups and downs, this anime is generally likable. And so is the plot, albeit with little progress. It could have been better. But it wasn't.\\n\\n\r\nThough it does have similar jests in respect to other anime, it is nonetheless interesting. If you are looking for a slice-of-life anime, or a serious and/or malicious plot, you're out of luck. If you're a fantasy fan like me, and are interested in the supernatural, then this may or may not be for you, as it lacks the seriousness some people prefer in fantasies (i.e less comedy, more battle). But if you love anime without a greater goal, in other words, simple yet moving stories, then this anime might be a great opportunity for you.\\n\\n\r\nArt: 8/10\\n\r\nIt's interesting how something so simple can be so very fitting to a single series. I cannot say I saw a single mistake in the animation, albeit through my untrained eyes. In my ever so humble opinion, in terms of quality, it really hits the mark. For example, the running animation is particularly detailed, and the facial expressions are hilarious. I cannot say they did a bad job converting the manga art, either. To be honest, it's great. And, as the Japanese like to say, Omoshiroi (For reference: 面白い).\\n\\n\r\nSound: 8/10\\n\r\nThe OP and ED were splendid! The voice actors were really good, as well. Though one highschooler sounded like a thirty-five year old man. Overall, the soundtrack was brought to life in a unique way, seeing as how I can't think of any similar songs. Simply put, the OP outweighed the anime, in a sense. One of the few that I didn't skip, and it fits to the theme very well, as well. (Too many 'well's... Oh, well...)\\n\\n\r\nCharacters: 7/10\\n\r\nI can't say I was completely satisfied. They could've been better. But overall, I'd say they were good. If only Mikan and Nagisa had been portrayed better. It felt to me like they were lacking enough impact of sorts in the plot.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThe lightheartedness is refreshing, especially after last season, so this is certainly the anime to watch if you're in the mood to relax. The comedy is only a bit better than average, though. The romance leaves room for improvement, as well. But to me, this anime is one of the highlights of the season.\\n\\n\r\nOverall: 8/10\\n\r\nThis anime is, or can be, very funny at times, and dull at others. But depending on the viewers' mood, this anime could be the best way to cheer yourself up, or the best way to fall into despair. Now, when I say something like that, you'd be thinking: \"What the hell are you talking about!? This anime is awesome!\" or \"This series is so abysmal, I can't wait for it it to fail miserably!\" Both statements are correct. Both are false. This anime is better than average. It's also worse than average. It's a better than average comedy. It is a worse than average harem. It has worse than average characters, but better than average personalities. I could go on, but you get my point. Depending on the person you are, you may like this, or you may not. Now, to be completely honest, this anime gets an 8/10. Not because I gave it that score, but because the anime genuinely gives you a homely feeling. It does. Really. It's not something you really notice at first. Or in all situations. But you'll notice when you're really tired (mentally, and physically), perhaps after a long day of work. It's relaxing. And extremely so. If you lower the volume a bit, once Asahi starts shouting, you'll know what I mean. I personally can say out of experience that most people will overlook this show. And it's their loss. No anime is perfect, but this one was great, to say the least. It's also a great way to get into the manga itself. If you really hate anime like this, then I can't say you are wrong. But if you try it out, you might actually come to like it.\\n\\n\r\nAlright, lastly, to add a few recommendations, let's list some similar anime:\\n\\n\r\n■ Monster Musume no Iru Nichijou\\n\r\n■ Himouto! Umaru-chan\\n\r\n■ Yamada-kun to 7-nin no Majo (TV)\\n\r\n■ MM!\\n\r\n■ D-Frag!\\n\r\n■ To LOVE-Ru",
            "date": "2015-09-29T21:37:00+00:00",
            "helpful_count": 55,
            "mal_id": 200122,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4316151.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shoichi",
                "username": "Shoichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200122"
        },
        {
            "content": "TL;DR: pacing is awful, characters are generic and removable, + for sound and animation, poor conclusion.\r\nI felt like I've been betrayed after finishing this show. Yeah the general premise of it isn't by any means original, but given the circumstances of the show, it could have been a decent rom/com. Ironic enough the score I'm giving it is classified as \"decent.\" The show has a promising first few episodes, filled with comedy more than anything else. \r\nReally, there isn't too much to say about this adaptation because it lacked a lot of development in every aspect. The story seemed to follow the usual trend ofboy meets girl, they fall in love with each other, beat around the bush for 10 episodes and then conclude with a cute scene at the end. Certainly I thought it was going to be like this but the last 2 episodes decided it was okay to do the inexplicable. Not going to spoil it, but what happens pretty much kicks everything prior down the drain. Makes me think that whoever did the anime adaptation decided (from what i heard) to change it from the manga. If the manga was like this then -_-. Overall for the story: worked up to nothing, falls flat and leaves a lot to be desired. \\n\\n\r\nCharacters are all very generic. We got the goody two shoes male protagonist, the dense main heroine, the jealous kuudere heroine, the childhood friend, and the hentai heroine. Nothing special by any means and as a matter of fact, this show really revolves around the male protagonist and the dense and jealous heroines. The other two seem to play no part in progressing the story and seem to be in on screen for no particular reason. All the other characters are generic side characters as well. The most interesting character to me was the principal, but she had very little screen time and it would've been nice to know more about her. Yeah the characters lacked a lot of originality, but some redeeming qualities were their interactions. It was funny for the most part, but most of the drama filled scenes seemed forced. Characters were not memorable.\\n\\n\r\nSound was overall decent. The opening animation seemed to give off the wrong impression of the show, but it was catchy. The ED has to be one of my more favorite ED's out there. Most of the soundtrack was forgettable, one stand out though being the one @ the pool scene. VA's were eh sound effects eh.\\n\\n\r\nAnimation in this show is different from a lot of other shows where it really focuses on the facial features of characters. It is really bubbly and does a good job projecting the emotions our characters are feeling. Action scenes could have been better.\\n\\n\r\nI liked this show for the first 9 episodes, but it definitely dropped the ball with it's pacing. A lot of questions were left unresolved and some (what i think) key scenes were brushed over just to be one of those \"remember when\" moments. There were too many removable characters for me to really give a crap about the 3 main ones. I really am disappointed in how it ended because I was enjoying the slapstick humor. Too many plotholes and too many plotpoints that were completely disregarded.\\n",
            "date": "2015-09-28T17:05:00+00:00",
            "helpful_count": 41,
            "mal_id": 200013,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4663713.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TakeTheWindward",
                "username": "TakeTheWindward"
            },
            "url": "https://myanimelist.net/reviews.php?id=200013"
        },
        {
            "content": "How can a romantic school comedy work if the main protagonist is someone who can't lie and the female protagonist is a very dense person? Jitsu wa Watashi wa, or \"Actually, I am...\", is a romantic school anime which incorporates supernatural elements as well as comedic ones to enhance the narrative.\r\nAs mentioned earlier, the story is simple and centers around Kuromine Asahi, the \"leaky basket\", and Shiragami Youko, who happens to be a \"dense\" vampire. Having a person who can't keep secrets can only lead to problems. The anime utilizes these situations to its advantage to present amusing situations and develop their relationship. However, thecomedic situations are often similar, getting old quickly; the same applies to the story, which seems to have the same approach as other similar anime.\\n\\n\r\nNew characters are introduced as the narrative progresses, all with one common aspect: all have a supernatural background, whether it is an alien or a transforming werewolf. This is an interesting aspect that provides diversity to the characters and story, yet as the story unfolds, instead of exploring the supernatural nature of these characters, it just focuses on the romantic aspect and feelings these have for the lead character. I found this personally a letdown, making it not much different from the other romantic school comedies.\\n\\n\r\nThe cast of characters presented in Jitsu wa Watashi wa were unique in their own way, each with a supernatural background, though with generic personalities. There is Kuromine, who is a clumsy, shy, \"leaky basket\" but with a good heart. Then there is the vampire Shiragami, a dense and unaware person of her surroundings, who in the beginning seems to be very shy and unsocial person. There is the perverted werewolf who has double personalities,Shishido Shido; the alien Aizawa Nagisa with a very serious attitude, and the childhood friend, whose glasses are possessed. Not to forget the demonic director and her sister, as well as the usual cast of supporting characters such as friends.\\n\\n\r\nCharacter development is not the strongest point in the anime, though throughout the anime the spectator observes how the romantic feelings for Kuromine affects the different characters. \\n\\n\r\nThe animation is well done, as well as the characters, who have a distinctive design comparing with the other modern anime. The comedy is enhanced through amusing face expressions. The eyes of the characters were toned down a bit to make the characters more appealing, comparing it to the manga. Some of the soundtracks used in Jitsu wa Watashi wa fits well, such as the rock themes, with other less interesting themes which is common in other anime. I personally enjoyed listening to some of the voice actors, as I like the Kansai accent. The opening had a catchy tune, though nothing outstanding.\\n\\n\r\nJitsu wa Watashi wa was overall an enjoyable experience, with interesting character designs, though failing into exploring these to its full potential, making the narrative itself rather dull and generic. Nevertheless, the occasional comedic situations managed to keep the story interesting. What could have been a good romantic comedy with interesting characters and interesting story progression, turned out to be rather lackluster in comparison, but entertaining.\\n\\n\r\nThank you for reading.",
            "date": "2015-09-28T12:02:00+00:00",
            "helpful_count": 29,
            "mal_id": 199980,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=199980"
        },
        {
            "content": "TL;DR Review\r\nStory-\r\nMC has to keep a girls secret or else she'll be deported to Mexico, I mean back home to her parents and will move schools. The MC can't keep a secret at all, so they try to turn that into a plot device only to not make any other plot devices. That's pretty much the show. Nothing else really happens apart from more characters popping up and a harem. \r\nArt-\r\nIt's average. Not good or bad really.\r\nSound-\r\nIt gets the job done but doesn't pop out at all. I can't remember any of the background songs used apart from the intro and ending.\r\nCharacter-\r\nThe characters are prettypoorly written. Just your standard cut and paste characters from anime you've already seen before. Got the airhead, got the tsundere, got the pervert, and got the MC everyone likes for some reason.\\n\\n\r\nShould you Watch?\\n\r\nNo.",
            "date": "2015-09-29T20:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 200117,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2172737.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Meowsorz",
                "username": "Meowsorz"
            },
            "url": "https://myanimelist.net/reviews.php?id=200117"
        },
        {
            "content": "Basicly it's a boy loves girl but can't confess ... He finds out her secret and tries to keep it despite being a \"leaky basket\", to prove so he ends up being friends with her instead of just confessing his feelings. \r\nMoreover other girls come into the story to make things more difficult ... more complicated for him to get closer to \"the girl\" who is pretty dense when it comes to her feelings and romance, and then mistakes his affection for her thinking he's in love with THE OTHER GIRL. \r\nComedy wise... not so funny it got me yawning most of the time, Isimply couldn't find it funny nor cute. But hey it's my personal opinion, others might have found it funny I just didn't.\\n\\n\r\nIn the END he never confesses. I must say it was 1 of the few animes I didn't enjoy at all. \\n\\n\r\nIt's a hangup story with no end.",
            "date": "2015-10-14T02:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 201215,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/yume81",
                "username": "yume81"
            },
            "url": "https://myanimelist.net/reviews.php?id=201215"
        },
        {
            "content": "May I just start off saying... wow I loved the art and the sound of this anime.  The story was okay, and it was one of those almost skit like anime that never goes anywhere.  A love triangle story where they just do the classic ping pong back and forth and no one can solidify a relationship.  That is not where this anime shines.  This anime shines from the funny and outrageous things that happen and the Faces that go with those scenes.  Nothing like seeing a devil get whats coming by a human but the human has the smileof a devil while the devil has the look of .. ow I messed up ... forgive me.  In all honesty that is why I liked it but I did think the romance was cute but nothing to write home about.  Lastly I will say I plan on reading the manga if I get time, as the ending of the anime certainly leaves many lose ends.  Which it did not seem like they were trying to leave as many lose ends as they did they just got rushed is more the feeling.  So if your like me and want a more complete story I would say read the manga because from other sources the anime jumps around the manga so it is hard to pick up after watching.  That being said it was still well done and I laughed so if your just an anime person I would give this a shot.",
            "date": "2017-02-22T21:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 241181,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=241181"
        },
        {
            "content": "Story: 7/10\r\nThe story was good and enjoyable. I like the unique aspect of a boy who cannot lie or keep a secret to be entrusted with very important secrets. Seeing him freak out and panic brought a very light comedic aspect to the show.\r\nSound: 8/10\r\nThe sound effects were normal that you would see in  other animes. The voice acting was good and above average. Now the music was very enjoyable and loved listening to it. I loved the song during emotional moments.\r\nArt: 7/10\r\nAverage art style. Nothing really that stood out to me. The art you would think to see in the average school animeis what you will get here.\\n\\n\r\nCharacters: 8/10\\n\r\nI loved the male mc. He is funny but also a very great friend. He knows what he wants and doesn't get distracted by the other women in the show. People may call this a harem, but because of the male lead i would say it is a lot different from other harem anime in which he is only interested in the female lead. He also isnt a straight out pervert and only want to see girls naked.\\n\\n\r\nOverall: 6/10\\n",
            "date": "2017-02-14T10:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 240586,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6021786.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Quaisar",
                "username": "Quaisar"
            },
            "url": "https://myanimelist.net/reviews.php?id=240586"
        },
        {
            "content": "Jitsu wa Watashi wa is indeed a surprising unexpected gem for the summer season, and has a certain thing that makes you to keep watching it even with its mediocrity. I won't say it is totally mediocre, but most of its elements are rather seen in other anime which makes it not suitable for other viewers. Despite those, it is still a fun romance to watch because of good and proper pacing and execution.\r\nThe story is set to be in an ideal school harem setting, it is about a generic brown-haired guy named Kuromine Asahi who can't keep secrets. Together with the introduction of eachgirl the anime progresses fast. Just like any other harem, there is this \"main girl\" who will likely end up with the main guy but as you watch this you may also root for the others, as they are likable and you won't have the reason to hate them. About the plot, it's common and generic but a few twists like different attributes to the abilities each character have and being an entertaining romcom make it somewhat special. There is also this clashing of romance and comedy that some viewers may not like, but only a little. \\n\\n\r\nNothing to complain about the art, it's really plain and ordinary and doesn't leave any good or bad impression. Scenes aren't that detailed but the character designs are pretty and clever. What makes the art good I think are the colors used for details and character designs. It makes it more lively and vivid, which is what a comedy anime need. It contributes to the atmosphere greatly. Lastly, who can forget their facial expressions? They are very funny, fresh to the eyes, and can make you laugh. \\n\\n\r\nEach voice actor did a great job portraying their respective characters. The soundtracks are really forgettable, though they are also responsible for setting the mood of each scene. The opening is somewhat catchy and makes you jumpy, it really suits the anime's playful and cheerful atmosphere. The ending is a gorgeous song, with it's calmer melody it portrays the drama and romantic side of the anime. My only complain about the sound is the insert music in every later half of each episode. Although it is not a bad song, it gets quite out of hand and becomes annoyingly unnecessary.\\n\\n\r\nNow for the characters, they each have their own traits making them easy to distinguish from each other. Being a harem, one would expect that each character have their screen time one by one each episode. But this is not the case in Jitsu wa Watashi wa. Not only each character have their backstories, they are mostly part of each episode and no one gets left out. The main characters' personalities like being dense and bucket with holes spark a unique kind of chemistry which is good for an effective romance. Being a Romcom developments are slow, but you can see in each episode how well the creators execute scenes and dialogues for their developments.\\n\\n\r\nI'm not sure if this can give any laughs, but man, this is pretty entertaining for me. Some jokes are recycled, but most of the time you may get something you won't expect. Jitsu wa Watashi wa is a friendly supernatural Romcom that can stand on its own merits. \\n\\n\r\nThe summer season was fun indeed, but Jitsu wa Watashi wa was just left out in the corner and was overlapped by more mainstream anime. It is quite underrated and it deserves more than what it gets. Overall, it has a few flaws but it's still covered by its own shines. It is certainly not bad, but it has its limits for being good as well. \\n\\n\r\nStory - 8\\n\r\nArt - 7\\n\r\nSound - 7\\n\r\nCharacter - 8\\n\r\nEnjoyment - 9\\n\r\nOverall - 8",
            "date": "2015-11-04T04:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 202643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3779267.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BaptizED",
                "username": "BaptizED"
            },
            "url": "https://myanimelist.net/reviews.php?id=202643"
        },
        {
            "content": "Hey , hey, Jitsuwata is over\r\nHey, hey, what can I say?\r\nHey, hey I'm making a review.\r\nAnd here's how I'm gonna do it.\r\nStory: \r\n1 time:\r\nThe plot may depend on the usual harem genre, but it cannot be consider as a true if there is an absences of competition among the harem members for the guy's affection.\r\n2 Times:\r\nThe plot does contain certain comedy that makes this anime's story category nice.\r\n3 times:\r\nSo for the story category I hereby give it a 6, since just like the usual it always involves the guy getting his ass on the line.\r\nArt:\r\n1 time:\r\nThe anime's art doesn't rely on the usual fanservice tosell.\\n\\n\r\n2 times: \\n\\n\r\nIt still has that moe and panchira thing that is a quintessential in all anime /manga, also the character's school uniforms weren't uniform, in fact I can't understand as to wtf was going on the mind of original creator Matsuda, Eiji for the cast's nonuniformal school uniforms.\\n\\n\r\n3 Times: \\n\\n\r\nTherefore, I think a decent 4 would do just fine.\\n\\n\r\nSound:\\n\\n\r\n1 time:\\n\\n\r\nFrankly, I jaz have nothing much to say about the character's voices, except that I like the opening theme.\\n\\n\r\n2 times:\\n\\n\r\nHowever both Yoko and Mikan's voices sounded a little bit mature.\\n\\n\r\n3 times:\\n\\n\r\nEven so I  give this category a Fair 6. Since there isn't much for me to say.\\n\\n\\n\r\nCharacter:\\n\\n\r\n1 time:\\n\\n\r\nIn this anime, it was basically all about Youko, Nagisa and Kuromine, now Like I've said this anime may have a harem genre it wasn't a true harem,  since even the presences of Mikan and Akane, there not much competition for Kuromine's affection, even Nagisa wasn't trying hard enough to get Kuromine's affection, in fact what she did  in episode 12 was merely wishy washy  that it kinda annoys me.\\n\\n\r\n2 Times:\\n\\n\r\nKuromine on the other hand was suppose to be this character who can't lie and yet he was present as an oxymoron, I may have hated the way he was portrayed, also Mikan wasn't give much of her own aired time which was unfortunate. \\n\\n\r\n3 Times:\\n\\n\r\nThen again his relationship for Youko is what gives this anime it's climax, so a Good 7 is in order.\\n\\n\r\nEnjoyment:\\n\\n\r\n1 time:\\n\\n\r\nAll I can say is that despite of the usual, it was still enjoyable enough to be watched and that's that, no more 2 times and 3 times.\\n\\n\r\nOverall \\n\\n\r\nI'm just gonna go for a Fair 6, since the anime itself was enjoyable, but the anime's title 'Jitsu wa Watashi wa\" was just too outta place, original creator Matsuda, Eiji should have titled his creation as \"Harem no Himitsu\" my harem's secrets since it was all about the guy who has to keep his harem's secrets a secrets.  Season 2?????????Maybe not.\\n\\n\r\nPEACE Chicos. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-09-30T03:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 200134,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=200134"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nJitsu wa Watashi wa loves its secrets. Many people (myself included) like secrets. It does not matter which side, either keeping or having them. Keeping them is all about trust between the parties, because once one person reveals the secret then it is a secret no longer. (This brings into question how many have to know a secret before it is no longer a secret, but that is a conversation for another day.) And having them is all about knowing who, if anyone, to tell.\r\nThere is actually a third side: the people not in theknow. I found myself on this side once. For one of my birthdays, my parents and siblings told me that we were meeting up with my grandparents for a small dinner. I thought this was perfectly normal given we have done this in the past.\\n\\n\r\nBut when we arrived at the restaurant, my entire family – uncles, aunts, and cousins – were waiting for me. Yes, a surprise birthday party. I was baffled that they were able to keep it a secret for so long. I will never forget that feeling when it first dawned on me what had actually happened: a weird, happy feeling of betrayal.\\n\\n\r\nIn my case, the secret was ultimately harmless. In Jitsu’s case, the secrets it holds are more important than any birthday party could hope to be.\\n\\n\r\nSTORY\\n\\n\r\nJitsu starts off innocently enough. Kuromine, a shy, unable-to-lie (contextually, keep a secret) boy has a crush on Shiragami, the silent, beautiful girl in his class. He musters the courage to one day give her a love letter, only to find her with wings out and fangs bared. In other words, he found out her secret: she is a vampire.\\n\\n\r\nThis is how Jitsu sets up almost all of its encounters with the various girls in the harem. Said girl is hiding an absurd secret that, coincidentally, Kuromine stumbles upon. This is the first anime’s sign of its repetitive nature. Many of the jokes rely on the same shticks, such as “Ero-mine-kun” and the principal of the school getting ragged on by her great-great-granddaughter, the teacher. Many of the jokes also rely on the same premise of misplaced expectations: the characters say the opposite of what is about to happen next. (“There is no way this is going to happen,” followed immediately by it happening.)\\n\\n\r\nTo be fair, the anime can get pretty clever with its jokes, especially when the jokes are based on the secret motif. The episode where Kuromine has to pretend that the small, actual Aizawa is a figure that he made – subsequently earning him strange looks from everyone, including Aizawa – is smart because the joke not only plays off of the premise of the show but also incorporates the aspects of one of its characters.\\n\\n\r\nYet it is the constant avoidance of progressing the relationships that is the most egregious. As a romance-harem anime, little progression may be expected, but Jitsu does not stall the progression. Instead, the anime actively seeks to halt the progression. Kuromine, Aizawa, and Akemi each have feelings they want to share, but the anime never gives them that chance. And even when it does, they are either conveniently interrupted by a falling giant vampire or they are misunderstood after a character falls on another. Even the writing has the characters always fumbling over their words, preventing them from forming complete sentences to get their thoughts across.\\n\\n\r\nIn a way, this halting is the point. The anime is all about secrets. The bigger ones are revealed, such as aliens and gender-switching wolf men. The other secrets – the real feelings of the characters – never getting revealed falls in line with the anime’s own motif in that, sometimes, secrets have to be kept private.\\n\\n\r\nNow, the anime goes about this in a roundabout manner when just the coincidental interruptions are stopping the secrets from surfacing. Meaning, the secrets are technically kept secret not by the characters but by random bad luck. Still, having this explanation cures some of the repetition within Jitsu.\\n\\n\r\nLooking at the anime on a broad scale, the overarching plot is simple: Shiragami is not allowed to have her secret known to anyone. Otherwise, her father will take her out of (human) school. Hence, Kuromine keeps this and the other girls’ secrets secret for the whole season, once again following the show’s motif.\\n\\n\r\nStill on a broad scale, the anime does not explore a definitive theme. This is not technically a negative since the anime wanted to be nothing more than a slice-of-life comedy. But refusing to be more purposeful in its presentation is not a positive, either.\\n\\n\r\nOn a smaller scale, there is the romantic subplot (mainly) between Kuromine and Shiragami where Shiragami’s parents mirror their relationship – a human and a vampire falling in love. Such mirroring is nice, but, since the relationship between the new (would-be) lovebirds never blossoms, the subplot serves little purpose within the anime.\\n\\n\r\nGoing to an even smaller scale, Jitsu is mostly episodic in its presentation. Individual episodes rarely follow one another, instead focusing on slice-of-life antics. The group trying to make chocolate to save the world from an impending asteroid, Aizawa teaching Shiragami to dodge the sun’s rays by utilizing the shadows, and Shishido demonstrating pretty clearly what it means to be “grown-up” are a sampling of the events.\\n\\n\r\nThese slice-of-life events bring about the laid-back nature of the show, keeping the mood from reaching overly dramatic levels and hence maintaining the comedy throughout the season. The final episode is the only strange one due to it not feeling like a final episode for two reasons. One, there is (yet again) not a confession between Kuromine and Shiragami. And two, not everyone is included.\\n\\n\r\nSo while the anime works as a slice-of-life, a myriad of issues bog down the show extensively.\\n\\n\r\nANIMATION\\n\\n\r\nOne of the better parts of Jitsu is, surprisingly, the art and animation.\\n\\n\r\nDue to the wacky nature of the comedy, the actual animation has a lot of movement involved. Characters running, blood flying, and explosions exploding are rampant throughout the season. Subtler movements, for hair and for eyes, are also present. The animation itself is nothing intricate, but the animation manages to consistently stay at a high level.\\n\\n\r\nIn terms of the artistic direction, the art is a mix of negatives and positives. On the negative side, the locations visited are nothing special. The school’s classrooms, hallways, and nearby facilities are the most common, leading to a lack of detail and diversity. Shiragami’s room is also visited but only occasionally. Rarely does the anime include places outside of the school and Shiragami’s room – an amusement park and Shiragami’s father’s house are some of the only exceptions. The camera is similar in the sense that little experimentation is done with it throughout the season. Running segments in the hallways (there are a lot of these) are as fancy as it gets.\\n\\n\r\nOn the positive side, Jitsu places a lot of attention on the reactions of the characters. A myriad of different eyes, mouths, and faces are used constantly, improving the comedy of the anime. Lighting is also given focus: shadowing on the characters and differing light sources for the backgrounds demonstrate this.\\n\\n\r\nThe anime also employs subtle techniques. Akane’s auras that flow around her is one such technique, and Shiragami putting the back of her hand over her mouth by instinct is another. These are small details, but they add to the overall execution of the show.\\n\\n\r\nBut it is the characters’ designs that come out on top. Kuromine is designed as a self-insert character (bland colors and boring features), but his design does not take away from the girls of the show. The girls, in contrast to Kuromine, have vibrant colors, pretty eyes, and unique features that make them look like actual characters.\\n\\n\r\nFor example, Shiragami’s long, green hair, two sharp fangs, and black pantyhose with skirt and blue top give the vampire a quirky yet refined look. Aizawa is another character with a nice design: her short blue hair, her tie with collared shirt, and her bolt (her alien antenna when she is seen in her small form) paint her as both the professional class representative and the alien that she is. Shishido’s design, with her chained collar (for her wolf self) and her spotted jacket (contrasting with her sexy self), further proves the strength of the characters’ designs and the overall strength of the art.\\n\\n\r\nCHARACTERS\\n\\n\r\nJitsu does not create the most compelling of characters; they are what many would say are “not well-written.” However, the anime does provide a handful of characters whose personalities fit within the confines of the show and one character whose message is something that anyone can take to heart.\\n\\n\r\nStarting with Kuromine’s friends – the group of three boys who silently support him from the sidelines – they exist almost exclusively to balance out the male-to-female ratio in the show. This is not to say that they are unfunny or absent throughout the season, but they do not do much outside of giving Kuromine courage from time to time and subconsciously satisfying the audience.\\n\\n\r\nSpeaking of the main protagonist, Kuromine, as his design indicates, is a self-insert character. He is kind to everyone, he always tries to make the best out of every situation, and he has every (weird) girl in the school vying for him. His unique characteristic, however, is his inability to have a poker face. For this reason, the students call him a “Leaky Basket” for never being able to keep a secret. So it is only right that he must keep the secret of every harem member. Unfortunately, since the anime does little else with Kuromine beyond his initial introduction, and the girls outshine him in terms of comedy, his character is as lackluster as they come.\\n\\n\r\nAizawa is on about the same level as Kuromine. She is an alien piloting a human-sized robot that looks just like her. She tries to maintain order through her position as class representative, but she is perhaps the most spur-of-the-moment and most chaotic person in the group.\\n\\n\r\nAizawa is cute and she is fun, but her character does little else besides impede the relationship between Kuromine and Shiragami. She develops feelings for the “Leaky Basket” halfway or so through the season – due to this kindness and because he kept her secret – causing her to feel distressed, both about hurting her two best friends and about hurting herself. By the show’s end, she (internally) says she will step aside for the other two lovebirds, yet it is clear that she is not completely over her feelings.\\n\\n\r\nThen there is Akemi, the childhood friend of Kuromine. Yes, she has a crush on him (the common childhood trope). And, yes, she has a secret that she hides from everyone else. (Her glasses harbor a spirit of fortune who is not-so-lucky.) Her character is actually not that important and even not that relevant to the anime. All that matters with her is her glasses which caused yet another situation in which Aizawa gets to mess up the prominent pairing of Kuromine and Shiragami.\\n\\n\r\nIt is not until Shishido arrives that the characters start to gain some traction. She is Shiragami’s childhood friend, and, coincidentally enough, she is a wolf man. When the moon shines bright (or if she even sees a picture of the moon), she changes into her male self and vice versa. Still, her most known feature is her perverted nature: She regularly puts her head under the skirts of the other girls among other lewd activities. Though this is not what makes her character better than the rest.\\n\\n\r\nWhat does make her character better is her ability to read the situation. She is able to do this because of her perverted nature. She is, as she would say, “honest with her feelings.” Where the rest of the characters try to mask their feelings or play off the emotions they are feeling, Shishido is there to point out what everyone is really thinking. She is a funny and helpful person which is about all you can ask of from a side character.\\n\\n\r\nSurprisingly, Shiragami is the strongest character of the show for a reason that may not seem immediately obvious. Shiragami is a vampire, or, more specifically, she is a half-vampire. She tans easily in the sun, she cannot swim, and she does not own a coffin because it is too luxurious for her. Her most defining feature, though, is how dense she is. As the characters say, this feature is why she is a perfect match for Kuromine: She is too dense to understand his painfully obvious feelings for her (“opposites attract”).\\n\\n\r\nThis is all that Shiragami’s character is. Like the others, she does not develop as a character. She may ever-so-slightly stray away from her path – calling Kuromine by his first name is as adventurous as she gets – but, for the most part, she remains the same quirky vampire girl from start to finish.\\n\\n\r\nBut she reveals something through her thoughts. In episode nine, Shiragami has a heart-to-heart with Kuromine where she says the following line: “It’s important to keep my secret, but I realized that there are even more important things.” When she says “important things” what she means are friends.\\n\\n\r\nThis a beautiful sentiment. Nobody should ever be lonely in life. There are strangers to greet, people to befriend, and relationships to share. For Shiragami, her secret stopped her from having these connections. She was not able to have the kind of school life that she wanted, and, indeed, the kind of life that everyone deserves.\\n\\n\r\nKuromine is the one that allows her to realize her mistake in thinking a secret is more important than enjoying life with others. And through his persistence to connect with Shiragami, Shiragami makes friends with Aizawa and then Akemi and then everyone else in the show. In other words, she finally obtains those “important things.”\\n\\n\r\nThe anime may not have the most compelling of characters, but, at the minimum, this message that life is best spent with others is truly wonderful.\\n\\n\r\nSOUND\\n\\n\r\nOne of the best pieces of the original soundtrack is the transition music between the A and B parts of the episode. It is not many notes, and it is only an acoustic guitar accompanied by a flute, but the simplicity of the track and its wonderful slice-of-life feel make the track a joy to hear.\\n\\n\r\nThe rest of the OST is standard for this type of anime. Slice-of-life tunes, triumphant ensembles, and sad compositions fill the air as the anime is watched. There is a notable track, however. Technically two tracks are worth talking about, but they are the “same”: the insert song and the instrumental version of the insert song. The former is annoying. It is used way too much, it is played at strange times, and it is formed of silly English lyrics. The latter is wonderful. It is used less frequently, it is played at the perfect times, and it is formed of just simple and soft sounds.\\n\\n\r\nLooking at the opening theme, it is a fun track which the water-droplet effect at the very beginning flags. The first half is somewhat mellow, contrasting nicely with Jitsu’s usually rambunctious self. The second half of the track still maintains the same pacing, but it chooses to ramp up the instruments and the vocals while also changing up the base beat. The track ends how it started, giving it a welcomed full-circle effect.\\n\\n\r\nThe ending theme is arguably not just the best track among all of the music but also the best part of the entire anime. It is a hip-hop track, although, instead going fast and hard with the lyrics, the track slows everything down. The track itself is meant to reflect how much more fun everything is in a group (following the theme from Shiragami) which is corroborated by both the change in mood in the second half of the track and the visuals. Alongside the rhyming, the background singers, and the extremely catchy beat, the ED is a wonderful track to listen to both in and out of the anime. (Plus, it is fun to sing the “jitsu wa watshi wa” lyric.)\\n\\n\r\nAs for the voice acting performances, they were fantastic, reaching the same level of quality as the ED. Yuu Serizawa as Shiragami does not have too many anime under her belt (approximately twenty), but she gives the cute vampire an innocent and charming voice. Inori Minase as Aizawa has been in more anime, using her slightly tomboyish voice to fit the “Iron Lady” extremely well. And Natsuki Hanae as Kuromine is just as formidable, providing the main protagonist with a lot of screaming and straining. Also, a special shout-out to Mao Ichimichi as Akane for giving the little devil a sinister yet adorable way of speaking.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt makes me a bit sad that this one did not reach a higher level of popularity because, regardless of its faults, this is still an entertaining show.\\n\\n\r\nI was drawn to this one due to the romance stuff. This anime is saturated in blushing, flirting, and loving, so many of the jokes – no matter how repetitive – were always making me laugh. Simple stuff like Shiragami sitting close to Kuromine when Shishido got clingy, and Kuromine and Shiragami’s private moment at the pool at night, made my heart flutter.\\n\\n\r\nThe characters themselves were rather fun, too. Shiragami acting all cute when Kuromine was there to support her and be her friend. Aizawa always misunderstanding everything and her running gag with her “Memory Erasure Device.” Shishido caring about nothing but sexy or perverted acts.\\n\\n\r\nBut if I am being honest, I did not particularly care much for Akemi due in part to her mean-spirited attitude towards Kuromine. I get that she was using a “teasing him so much because she likes him” mentality, and she does become less frustrating later on in the season. But the frequency of her meanness in the beginning made me dislike her. Luckily, the other girls make up for her annoyance handily enough.\\n\\n\r\nAs for the other characters, I found Kuromine’s other friends to be fine, but Akane and Akari were right alongside Shiragami and the other funny girls. Akane and Akari’s constant bickering and insults and abuse towards each other was really funny to me because of just how far they would take it, like Akari throwing Akane by the horns or Akane blowing up Akari’s newly-purchased car.\\n\\n\r\nJitsu wa Watashi wa is a comedy-fantasy-romance-school-shounen-supernatural anime, but that does not mean one should automatically discount its contents. The sound work is strong, the character designs are vibrant, and the main message of the characters is beautiful. Of course, this does not make up for the repetitive writing and the simplistic characters. At the same time, this does not take away from the laughs the show has in store. Putting it another way, it should come as no surprise – as no secret – that this one is just plain fun.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, misunderstandings galore, gross repetition, and problems on each scale of the narrative obfuscate some of the cleverness the plot holds\\n\\n\r\nAnimation: Good, above average actual animation, a mix of strong and weak artistic direction, and nice character designs\\n\\n\r\nCharacters: Fine, Kuromine, Shiragami, and the rest of the cast are individually bland, but their group’s message that life is better with friends is a beautiful mantra\\n\\n\r\nSound: Good, good OP, great ED, okay OST, above average VA performances\\n\\n\r\nEnjoyment: Good, lots of romance combined with fun characters create a high amount of entertainment\\n\\n\r\nFinal Score: 6/10",
            "date": "2016-03-20T06:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 213417,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=213417"
        },
        {
            "content": "Romantic-comedies are one of those staple genres in every part of the world, with some focusing more on the romantic aspects while others focus more on the comedic sied of things. Despite being quite a bit unrealistic in relation to the romance part, most rom-coms are very much grounded in reality. Jitsu Wa Watashi Wa is just the opposite with its non-sense comedy.\r\nJitsu Wa Watashi Wa (Actually, I am…) is the anime adaptation of the rom-com manga of the same name, published by Shounen Champion and created, written and illustrated by Eiji Matsuda. The adaptation is directed by Yasutaka Yamamoto (Mondaiji-tachi ga Isekai kara KuruSou Desu yo?, Valkyria Chronicles).\\n\\n\r\nAsashi Kuromine is a high-schooler with a strange peculiarity: he can’t lie or hide his emotions. Also, he has a crush on Youko Shiragami, a mysterious girl from his class that never participates in PE class and is always the last student to leave school. One day, he decides to confess his feelings after-school. Because of that, he discovers that she is, actually, a vampire. Now he has to keep her secret, while trying to get closer to her and dealing with other supernatural beings and even aliens.\\n\\n\r\nJitsu Wa Watashi Wa is not your usual rom-com, it has too much of a taste for the weird and nonsensical to be one. At first, the comedy is a bit weird, but it builds up on its own weirdness to become something that reminded me a bit of Monty Python, with all of its craziness and novelty. As crazy as it sounds, air-headed vampires, randomly appearing ice-creams and a devil with a sweet tooth are normal occurrences in Jitsu Wa Watashi Wa . The comedy never becomes stale, as, with each new character, new interactions and situations become possible. While they don’t evolve much in terms of development, all of them are instantly likeable with a decent degree of depth. Also, most of the characters are twists in the “normal” horror monsters: vampire, werewolf… Still, it is a rom-com, and, as a result, most of the development is based around the fact that characters fall in love with each other.\\n\\n\r\nThe characters’ interaction is wonderfully crazy and, somehow, they always outdo themselves, with crazier and crazier situations arising. This is only possible because of the great variety of the characters and their (sometimes conflicting) personalities. “Sexiness” contests, meteors’ attacks, spicy bread russian roulette and even plain old festivals are just some examples of the type of stuff that happens in Jitsu Wa Watashi Wa.\\n\\n\r\nThe visuals are vibrant, but take some time to get used too. After the initial reactions, it becomes pleasing to look at, but never reaches anything other than that. Likewise, the character design is colorful and eye-catching, creating a unique style.\\n\\n\r\nAs an adaptation, it was pretty good. It changed the order of the events depicted on the manga, but stayed faithful most of the time. Unfortunately, it is not as great as the manga, simply because of the way the comedy’s “snowballing” nature. Given a second season, it could reach the same levels of the manga.\\n\\n\r\nJitsu Wa Watashi Wa strength lies not in its story or characters, but its unique comedy. Despite its great quality, its enjoyment depends on the viewer’s own sense of humor. As a result of loving wacky comedy, I enjoyed the comedy of the series, but, again, it may not be for everybody.\\n\\n\r\nI would recommend Jitsu Wa Watashi Wa to people looking for an unusual rom-com that focus mostly in its comedy aspect and also to people looking to a Japanese-styled Monty Python.",
            "date": "2015-10-08T12:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 200774,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4599119.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Keatle",
                "username": "Keatle"
            },
            "url": "https://myanimelist.net/reviews.php?id=200774"
        },
        {
            "content": "Jitsuwa Watashi was a breath of fresh air. It followed a simple story that was easy to follow, without the emotional commitment. It's a pallet-cleanser anime. I had just bawled my eyes out after watching AnoHana, and I need something to ease the pain. I decided to try it on a whim, and ended up watching the whole thing in one sitting. \r\nIt delivers a refreshingly light humor that let me just relax while I watched. I credit much of that to the timing of its jokes, as well as the pacing of the story. \r\nThis show is definitely a hidden gem.",
            "date": "2016-03-02T10:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 212103,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5090678.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sunnyundies",
                "username": "sunnyundies"
            },
            "url": "https://myanimelist.net/reviews.php?id=212103"
        },
        {
            "content": "Is it even possible for something that is very cliched to still be very enjoyable? For example, a lot of anime involve vampires, secrets, harems, and mutual feelings to never be confessed, and those are just among what this anime contains. Even though I knew this, I really looked forward to watching this particular anime when the July 2015 season rolled around; I couldn't shake off the feeling that it was going to be fun to watch. Sure enough, I was right, although I wasn't able to catch up to it in time for it to end. Well, now that I've finally been able tofinish it, what do I think now?\\n\\n\r\nLadies and gentlemen, it's no secret that I'm now reviewing \"Jitsu wa Watashi wa\", known as \"Actually, I Am....\" in English!\\n\\n\r\nJitsu wa Watashi wa follows a boy named Asahi Kuromine, who is referred to as a \"leaky basket\" due to how bad of a liar he is. One day, he finds himself faced with an important secret; his classmate and crush, Youko Shiragami, is actually a vampire! In order to avoid getting her pulled out of school due to her secret being exposed, Asahi tries his best to keep Youko's secret and ends up befriending her in the process. *coughfriendzonecough* Along the way, he discovers the supernatural secrets of others, such as the class rep, Nagisa Aizawa (an alien), and Youko's childhood friend, Shiho Shishido (a \"wolf man\"), and he must keep those secrets, too. Geez, that's a lot of secrets for one leaky basket to keep!\\n\\n\r\nI bet you'd look at the summary and think, \"Haven't I seen this somewhere before?\" As I mentioned at the beginning of this review, Jitsu wa Watashi wa is packed with cliches from fellow romantic comedy anime. You know what, though? That didn't stop the comedy from being hilarious or at least amusing; even if a joke didn't get me laughing out loud, I would at least be smiling the whole time! Its cast of characters helped this show, too; most of them are very fun to watch. Even though the romance between Youko and Asahi ends up not progressing much throughout, it was still fun to see them together.\\n\\n\r\nThe animation for this anime was pretty great. I haven't seen too much of TMS Entertainment's anime, but out of the ones I have seen, this is definitely some of the most appealing I've ever seen out of them, with its bright colors. The voice actors definitely nailed their roles, as well. I especially liked Inori Minase as Nagisa; I really felt that her voice fit her character. The opening theme, \"Himitsu wo Choudai\" by Ars Magna, is such a fun song to listen to and one that definitely fits this anime; the ending theme, \"Ienai Ienai\" by Hilcrhyme, is also a very nice song to listen to.\\n\\n\r\nOverall, Jitsu wa Watashi wa is definitely a fun anime to watch. If you like romantic comedies and don't mind the cliches, I'd definitely recommend for you to check it out. Even if you don't like it, though.... well, it's no secret that we all have our own opinions!",
            "date": "2016-08-05T10:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 225988,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=225988"
        },
        {
            "content": "Alright, first and foremost before we even start this review: *Read the damn manga.*\r\nIt's already completed and the story, arcs and characters are way better portrayed there.\r\nThe anime adaptation, however, was only a poorly executed atempt to advertise the manga. But don't get me wrong, it is, in fact, not a complete trainwreck. Each episode mirros the original source really well and the humor is pretty much the same. The voice acting is decent to and Inori Minase as (best girl) Nagisa is, as usual, masterfully well acted from her part.\r\nThe weak points of this series is the fact that it's only 13 episodes long,which barely covers all of the character development the manga has in its totality, not to mention that some characters that are of great importance in the manga  don't even appear in some of the episodes. So yeah, if you manage to finish watching them all, you'll feel that something was missing and that something just didn't feel right. And that's exactly why: it only showed a portion of the whole thing that comes after the arc that was covered in the anime.\\n\\n\r\nIf you're a fan of romantic comedies and monster girls, this series is definitely for you, but only watch the anime as an introduction of the whole thing that the manga of Jitsu wa Watashi wa is, because it is absolutely incredible and I cannot recommend it enough.\\n\\n",
            "date": "2018-04-24T11:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 278889,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6374930.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Edil23",
                "username": "Edil23"
            },
            "url": "https://myanimelist.net/reviews.php?id=278889"
        },
        {
            "content": "Secrets are the spice in a person's life.  Everyone has a secret, and it's because of these little factoids about ourselves that make us different...and make people want to know about them even more.  So, with Jitsu wa Watashi wa, or \"Actually, I am...\", what kind of secrets will we learn about today?\r\nStory: Kuromine Asahi is a relatively average guy in school.  He's normal, but has one fatal flaw to his character, and that is, he can't hold onto someone's secret for the life of him.  As such, he has been called the \"Leaky Basket\" by all of his peers becauseany kind of secret he is told immediately comes out in a blaze of glory.  But, Asahi has a secret of his own; he likes Shiragami Youko, a girl who acts very distant from the rest of the class with weird habits like leaving school in the evening and sitting out during P.E.  So, on his way to confess to her because he knows her weird habits like a creepy stalker, he bursts into the classroom and sees Youko...with wings coming out of her back.  Oh boy, here we go again...\\n\\n\r\nJitsu wa, as the shorthanded way of saying this series' name is, revolves around Asahi and his band of merry fellow main characters as they go through various antics that appear either in front of them, or just come to them from some god unknown force.  Since this is a school anime, the base storyline is a bunch of highschoolers spending time together, and that's really about it.  However, Jitsu wa's biggest draw comes from the way its seemingly random story is presented.  \\n\\n\r\nComedy is the main reason to be drawn to this series, as it's brand of comedy...cannot be explained in words very easily, so I will attempt to elaborate.  As the main focal point of the series, Jitsu wa's spectrum of comedy goes from sheer stupidity of the main cast (like accidentally revealing their respective secrets) and the following retorts ironically by our main protagonist who apparently can't keep a secret, to seemingly random, balls to the wall, what the fuck just happened scenes that again, cannot be accurately explained in words.  It's this blend of comedy that really makes the series unique compared to any other supernatural high school show.  The only issue I have is that they don't execute the jokes well enough to properly integrate them into the series, and as a result, sometimes feel a bit forced.  \\n\\n\r\nThe main issues this show has comes in a pair of two.  First, the show doesn't flow all that well.  The entire show is comprised of random chapters from the manga squished together to form an adaptation story of its own.  As such, a lot of the events that occur happen either much later or earlier than they should making for some uneven flow and jumps in how things happen, and the biggest problem, is that there are characters that feel like they just show up out of nowhere without much explanation.  (Cue Fuku)  The other issue is the fact that the show plays itself more as a generic romcom more than anything else which doesn't translate well when compared to the source material.  \\n\\n\r\nIn the end, this adaptation of one of the more out there stories in anime today fumbled a lot with how it wanted to present itself.  Acting more as an allusion to the Jitsu wa Watashi wa series, this adaptation failed to properly explain certain things with what it wanted to show us, and made some progressional issues that seemed a bit rushed.  While it still has the comedic charm with its inexplainable brand of comedy, there were still aspects to it that didn't have as much of an impact as it should've.  Plus, it kinda ended in a weird place.  That would not be the chapter that I would say you should end the series on.  \\n\\n\r\nOverview:\\n\r\n+/-  Random but hilarious comedy (Positive or negative depending on your perception of funny.)\\n\r\n-  Bland base story (Highschool, again.)\\n\r\n-  Pacing and explanation issues\\n\\n\r\nCharacters: With its brand of comedy, Jitsu wa provides us with some interesting characters to fill in the bubbles as to who says what.  \\n\\n\r\nFirst, we have Kuromine Asahi, the main protagonist of the series, and the leaky basket.  As the person who can't hold a secret to save his life, Asahi spends the entire series trying to keep the girl he befriends but secretly loves, Shiragami Youko.  (As well as other characters because honestly, everyone in this show is a genuine idiot.  It's not an insult.  They are legitimately stupid.)  Ironically playing as the straight man, Asahi retorts back any kind of stupid statement or idea that is suggested by any of the other characters, before being promptly sucked into said idea and thus, is plagued with the stupidity of the people around him.  Really though, that's all Asahi's character is.  Throughout the whole series, Asahi says to everyone that he loves Youko, and he stays that way with every passing episode.  There's no growth for him because he starts at the point of saying he'll protect her secret, and ends with saying that he'll protect her secret.  So really, there's no difference and as such, there's no development for his character.\\n\\n\r\nThen we have Shiragami Youko, the vampire (or Dumpire as I like to call her.  Dumb Vampire = Dumpire) and main female protagonist of the series.  First seen as a distant and reserved girl, Youko is actually really cheerful and absent minded most of the time.  Rather than the male being completely oblivious to the girls' feelings, Youko is a girl who is dense herself and can't see Asahi's feelings.  As such, she, with help of Asahi shooting himself in the foot at the confession, thinks of him as nothing more than a friend.  But not only that, a PRECIOUS friend.  The whole show plays around with this idea of these two characters dancing the waltz of \"Will they or won't they\" while also having other players to the mix of this strange semblance of a romance show.  \\n\\n\r\nAnd finally, we have Aizawa Nagisa, or Screw Girl, as I like to call her.  (You know, cause she has a screw on the back of her head?)  As an alien who is about as tall as a nendoroid, Nagisa is the stoic member of the cast whose slightly militant-like personality causes her to lose any credibility that she was taught in the military because she reveals her secret about 10 minutes of her existing.  (Like I said, everyone in this show is stupid to some extent.)  Nagisa mostly plays as the secondary female of the series and, with the help of another character, Mikan, create the harem aspect of the series which is rather prominent in the series in the grand scheme of things.\\n\\n\r\nThe rest of the characters in Jitsu wa play mostly supporting roles for the series, which is a real shame because some of the best characters of the entire series either get shelved off to the side as supporting cast, or show up so late that they won't have enough time to make much of an impact.  It's this treatment of the cast members that disappoint me because a lot of these \"supporting members\" are actually the ones that bring a lot of joy in the manga, which would've help boosted this adaptation from being what looks like a generic romcom.\\n\\n\r\nOverview:\\n\r\n+ Unique, interesting, and above all, wonderfully stupid characters\\n\r\n-  A lot of the cast members were just casted off to the side\\n\\n\r\nArt: Art for Jitsu wa is a bit of a touchy subject.  Made by TMS, this adaptation brings the Jitsu wa series to life through a style of animation that is both similar, and different to the original style in the manga.  \\n\\n\r\nContrary to the goofy and overall wacky artstyle that this series has, filled with very unique facial expression oddly never seen in any series ever, as well as overdramatic events that make the series well known, TMS opted for a more moe artsyle where the characters look a bit more \"normal\" and didn't have that goofy looking style that the original show had.  This artstyle is just average in its own right, with nothing really outstanding about it to make it stand out as a series visually.  Sure we get some of Jitsu wa's signature facial expressions, but there's really nothing that special about it.\\n\\n\r\nOverview:\\n\r\n+/- Mediocre, moe-style art\\n\\n\r\nSound: As for the soundtrack, the OP for Jitsu wa is a perfect representation of the series.  With a very upbeat track that skips to its own tune, this track is, while not extraordinary, is pretty memorable.  It's catchy, it's fun, and overall pretty nice to listen to.  \\n\\n\r\nThe ED on the other hand is a bit of a random style to fit with this show.  With a kind of rapping/melancholic style of music to it (I have no idea what to call it.), the ED admittedly isn't something that I would call good, but it's pretty unique for a song style/choice, I'll give it that.\\n\\n\r\nOverview:\\n\r\n+ Catchy, memorable OP\\n\r\n+/-  Odd ED (Has good and bad aspects to it.)\\n\\n\r\nPersonal Enjoyment: As someone who has read the Jitsu wa manga to the most recent chapter, I was mystified about seeing the adaptation.  Since the series look rather different than what it looked like in the manga, I assumed that there were going to more than just stylistic changes to the entire series and was a bit scared about how things would turn out.  In the end, it wasn't an Isuca incident, but I still don't like it.\\n\\n\r\nWhat did I like about this series?\\n\\n\r\nSure I got a few laughs out of the whole thing but honestly, I didn't really like this adaptation.  The show felt like a romcom or harem anime, not Jitsu wa.  They took chapters from random parts of the manga's timeline and turned it into the series (sometimes completely out of order too) which made me wonder why they did that in all honesty rather than just sticking with the inherent plot.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nThis adaptation didn't feel like Jitsu wa.  Jitsu wa is a series that for me, is one that has twists and turns on every corner with complete balls to the wall and random crap that happens so out of this world that busting your sides is just a norm for people who read the series.  They didn't use a lot of the characters to their full potential and as such, made the series less special on account of the lack of screentime for some of the best characters of the entire series.  I'm also not a fan of the stylistic change of the artstyle and where the anime ended, because that is a very awkward place to end it.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nAll in all, Jitsu wa is another anime vs. manga scenario.  Even though I say that this adaptation doesn't completely feel like Jitsu wa, there are enough elements of it to allude and at least explain the main story of the series.  (Even though they still did screw it up a bit.)  As such, if you want to know about the Jitsu wa series without reading 90+ chapters and see the random antics in animated form, go for this adaptation.  Just be warned to see some crazy shit.  Because things can go from 0-100 FAST.",
            "date": "2015-09-28T16:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 200008,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=200008"
        },
        {
            "content": "Oh joy! I get to spend Easter (orthodox holidays) in Germany, where people wouldn't recognize good humor if it hit them in the face... Lets download some comedy anime so that I have something to watch while I'm there. Lets see... A guy who can't lie has to keep a secret about a vampire girl? That sounds hilarious! The only way they could possibly screw it up is if they added completely needless... They added god damned slapstick...\r\nYou see people, the point of slapstick comedy is to take hard, painful, boring situations and turn them to funny ones. A cat chasing a mouse for exampleis mundane, but when you add slapstick to it, it becomes funny. Now in a situation that's already comedic on its own, such as an idiot who can't lie trying to keep a vampire's secret, SLAPSTICK DOESN'T FIT.\\n\\n\r\nSo as you can guess, the scenario revolves around a guy who can't lie, who accidentally finds out the girl he likes is in truth a vampire. It is decided that since she got caught she should give up on high-school, but upon hearing this, the protagonist swears to keep her secret, essentially sealing a pact between them. Except the vampire girl is a dumb idiot who friendzones him from the start and the way the series goes it's a wonder she hadn't got discovered already, with her moronic behavior. Along the way things get slightly more complicated when the protagonist's previous crash also turns out to be a weirdo (a chibi alien in this case, operating a human-sized robotic version of herself) and she is also discovered. So basically it is a trio of the alien chick liking the protagonist but the protagonist being oblivious to it, the protagonist liking the vampire but the vampire being oblivious to it, and the vampire trying to support the alien girl hooking up with the protagonist.\\n\\n\r\nIn  sort, the protagonist forms his own harem full of forced tsunderes or dumb morons. To sum it up, while original, it isn't the most likable of casts, especially since their performances come out really unnatural, because we REALLY NEEDED THE F@CKING SLAPSTICK. What's truly annoying though, is that the anime was clearly written by two joke writers with completely different ideas of what humor is. And the stupid one apparently outranked the smart one. I believe the dialogue below should explain this well:\\n\\n\r\nWriter 1: And just as the main character is in a moral dilemma between lying to his friends and letting his alien love interest have her skirt flipped...\\n\\n\r\nWriter 2: We'll add a chase scene to it!\\n\\n\r\nWriter 1:He... What?\\n\\n\r\nWriter 2: You know, chase scene. Because that's what people think of when you say \"good humor\". Sylvester an Tweety.\\n\\n\r\nWriter 1: You are a mockery of everything I work for.\\n\\n\r\nWriter 2: Well too f@cking bad, I'm the boss, deal with it.\\n\\n\r\nIf this show was written by one idiot I'd just say \"good, it's stupid, end of story\". But it is clear through all that chaos that really intelligent writing is hiding underneath all the trash, but it keeps getting interrupted for filler bullsh!t. The show follows tired cliches because it's afraid of venturing the more dangerous path, even though it clearly has the potential to do so. And if there's something I hate more than natural stupid crap, it's crap that had the potential to be smart, but instead got scared and joined the comfort zone of being stupid like all the others. And even worse it ends up being JUVENILE crap.\\n\\n\r\nVisuals have a fresh look about them and the voice acting is ok. But the show is too juvenile, too kid-focused to be of any real fun to a crowd that doesn't think hitting on doorbells and then running away is a good prank. Stay away.",
            "date": "2016-05-01T03:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 217594,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=217594"
        },
        {
            "content": "A young man who could never hide secrets and the girls that their secrets should notbe known by anyone, even shades of irony in the basic plot of this anime immediately indicated that he would be a great comedy. And it turns out it is true! Through the hard struggle when trying to protect confidential Asahi Youko and Nagisa, and then coupled with the behavior of the characters witty as mystical creatures (and alien) that violates the general conception of them, this anime is able to give birth to jokes were quite original. Although a bit unfortunate that he could not maintain its quality isalways at the same level, especially when he stepped out of two earlier themes, secrets and playful behavior, overall, this is a comedy anime that is very satisfying. And the same thing can also be said for the romantic side. Anime is clearly not the best romantic story, but there remains a sweettaste that can be found on the triangular relationship Asahi, Youko, and Nagisa. Perhaps the reason is because as someonewho has a secret to someone who protectsthe secret with a vengeance, the feelings of the characters seem real and grow naturally and not something imposed fromnowhere. As a result, every scene involving their feelings, even the most simple as when they spoke shyly, will instantly become more meaningful.",
            "date": "2017-02-26T01:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 241414,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241414"
        },
        {
            "content": "I'm new to anime in general, and Jitsu wa Watashi wa is one of the first series I ever completed. So take my review for what it is, a noob's review.\r\nThe first episode drew me in almost immediately, and I related with the protagonist very quickly. Aside from the \"fantasy\" side of the story, the overall plot isn't anything out of the ordinary. Your basic love triangle type deal with complications along the way. However the characters are memorable and the school setting is fitting. Also, there are a few twists in the story that do make it stand out, especially for a romantic comedy.It has plenty of endearing moments. \\n\\n\r\nI dig the opening theme music too. Overall, very satisfied and would recommend to anyone just starting out with anime. This is going to get me to watch more and more.",
            "date": "2015-09-28T20:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 200027,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4893767.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/davidvkimball",
                "username": "davidvkimball"
            },
            "url": "https://myanimelist.net/reviews.php?id=200027"
        },
        {
            "content": "Jitsu wa Watashi wa (Actually I am...)\r\nTo be honest with you all, I never expected to see such decent anime from the summer-season (Heat Season for Ecchi anime) of 2015 like this one.\r\nOkay. Let's be honest with ourselves. Arts for Jitsu wa Watashi wa was poor. There were number of my mates who thought the anime was going to be crap just by seeing the arts and genre under it, which was 'Romance' and 'Ecchi' and 'Comedy' and 'Vampires'.\r\nOooh, is it going to be 'Twilight' all over again...... That was what I was thinking.\r\nHow wrong I was.\r\nStory itself was quite well designed and all characterswere very loveable, But most of all, the show itself was very, very entertaining. I felt like watching a light-hearted shoujo anime show, and watching a great show about friendship and love story of Shounen Anime at the same time.\\n\\n\r\nIf art was good, perhaps I would even go far to give the score of 8, but I just couldn't say that art for this anime was near excellent.\\n\\n\r\nFor those of you who does not like romance anime, I recommend you this one to get into the world of 'Love-Come'. (Of course, those of you who love Love-Come can still watch it you know.)\\n\\n\r\nWell then, until my next review......\\n\\n\r\nSayonara~",
            "date": "2015-10-12T00:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 201068,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4922917.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/islay",
                "username": "islay"
            },
            "url": "https://myanimelist.net/reviews.php?id=201068"
        }
    ],
    [
        {
            "content": "I thought it was pretty good overall, I think its pretty funny and i liked most of the characters.\r\nDon't expect to much from the story tho.... ( I hope this isnt a spoiler ) But literally  nothing changes AT ALL in the story, aside from some minor things, but don't expect a very satisfying ending. \r\nBut ending aside i thought this anime was overall a good comedy.\r\nRomance wise it kinda sucked cause nothing really happened on the romance aspect.\r\nI thought the art was colorful and over all good. (some of the faces they make are pretty damn funny) \r\nSound was pretty good, I don'treally notice those things that much....\\n\r\nSo ya.... I found this anime to be pretty average but i did enjoy it over all.",
            "date": "2016-10-04T20:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 231113,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5624301.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stormcrow0510",
                "username": "Stormcrow0510"
            },
            "url": "https://myanimelist.net/reviews.php?id=231113"
        },
        {
            "content": "It's another typical Harem, boy likes girl and girls like boy. No one admits their love to anyone and the show ends. This shows charm gradually falls, as the main characters main characteristic falls off at some point in the show. In the show he meets a cute girl who has no friends, so one day when he decides to share his feelings he discovers she is a vampire. In the show he has a reputation for sharing people's secrets, which this quality is never an issue and never mentioned later in the show. The show wasn't bad, although like many harem there's always thatone character that just gets on your nerves, and this show in my opinion has a few of those. Over all it was bearable, nothing entirely new though.",
            "date": "2015-10-21T21:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 201723,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763225.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShadowBunny",
                "username": "ShadowBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=201723"
        },
        {
            "content": "There isn't much that can really be said about Jitsu wa Watashi wa. The story seems to take on tropes from other anime and could almost be considered a reverse Rosario to Vampire.\r\nJitsu wa Watashi wa is set in an ordinary High School. Kuromine Asahi is known as a leaky basket to his friends because he is such an open book that he's unable to convincingly tell a lie. For the longest time, he has had feelings for Shiragami Youko who's one of his classmates. After a bunch of encouragement from his friends, he decides to try to confess to her after school. He discovers,however, that things are not what they seem when he finds out that his crush is actually a vampire. After finding out that she's unable to have friends due to a promise she made with her father, Kuromine Asahi vows to protect her secret so that she doesn't have to leave school. \\n\\n\r\nThat's about the gist of the story. From this point on, the show comically adds characters one after another that come to like him. The show goes on like this with the typical dramas associated with a typical harem rom-com and ends on a rather pitiful conclusion where nothing is resolved. While the characters, sound and art are all very generic and rather forgettable, the show had enough potential that, had it followed the source material, would have been far better than it actually is. \\n\\n\r\nFor me, this anime was a hit and a miss. It had moments where it was okay, but it was too centered on being a comedy for it to make any kind of logical sense. Instead of things going the way they should have, Jitsu wa Watashi wa goes out with a flop rather than a bang. It's good if you're after some lighthearted humor, but if you're expecting a story, you'll find yourself quite disappointed.\\n\\n\r\nI highly recommend reading the manga rather than watching the anime.",
            "date": "2015-11-12T21:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 203259,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kaitsja",
                "username": "Kaitsja"
            },
            "url": "https://myanimelist.net/reviews.php?id=203259"
        },
        {
            "content": "(Disclosed in this review will be a SPOILER-FREE section, and a SPOILER-HEAVY section, in that order. If you'd like to stop at the SPOILER-FREE section, go right ahead, if you want to keep trucking along, feel free to. \r\nLet me start off this review by breaking down my feelings of this anime into a simple description:\r\nThis anime is pretty much a mediocre reverse Rosario + Vampire, where the monsters go to a human school and it's THEIR secret of being monsters that need to be kept secret, especially the main love interest, who is a bubbly, ditzy vampire girl.\r\nNow that that's out of the way,let's get on with the review proper.\\n\\n\r\nSTORY: (I *will* be describing the plot for the sake of highlighting an element that I feel went unused)\\n\r\nKuromine Asahi is a nice enough guy, going to high school, hanging out with friends, etc. However, he's become infamous for being unable to keep secrets to save his life, and everyone knows it!\\n\\n\r\nHowever, since he doesn't get bullied or picked on for it, that's not really all that big a deal for him personally. Sure, he might feel bad that he's never let in on the joke or trusted to keep his lips zipped, but he's overall accepted it.\\n\\n\r\nUnfortunately, that all changes when his little lime-haired crush, Youko Shiragami, turns out to be a vampire in disguise. What's especially dangerous is the fact that she's taken on an agreement with her father to come home should she be found out, which is something that neither she, nor Kuromine wants.\\n\\n\r\nYou would think that with a plot like this, KNOWING that Asahi has been built up as an incompetent confidant would pay off with some good comedic bits and maybe even a bending of tropes by letting secondary characters in on it, stopping him from slipping up, right? Nope, regardless of this little quirk of his, Asahi never manages to let her secret slip unless he's speaking to another monster, which is incredibly boring and very disappointing.\\n\\n\r\nAnd of course, this is a harem show too, much like Rosario + Vampire, with a cold, yet endearing secondary love interest with cool-colored hair, a master of sexual promiscuity, and a mischief-maker involved in the harem. I'm describing them fairly basically, but none of the harem are at all as near-identical to their R+V counterparts as Youko is to Moka.\\n\\n\r\nNot to mention there are teachers with somewhat quirky attitudes, basic and generic episodic harem plots, and a finale that isn't really all that grand, but still kinda beats out the rest of the series in quality. \\n\\n\r\nOverall, the story is fine enough on its own, but it got dragged down by all the parallels I was able to draw between it and Rosario + Vampire.\\n\\n\r\nThat said, though, I did watch it all the way through and enjoyed it more than R+V, mostly because it doesn't have NEARLY as much annoying fanservice. \\n\\n\r\nART: \\n\r\nThe art is pretty good, easily the show's best quality, in my opinion. Since it's a slice of life show, it's laid back and slower than what you'd probably get from an action show, which is probably a good thing. Because if Youko launched into the air and tried to kick someone, my brain would instantly super-impose Inner Moka's \"Know your place\" catchphrase onto the scene.\\n\\n\r\nSOUND: \\n\r\nAgain, pretty good. I don't recall the OP or ED, but I think I remember being fine with them overall and with slice of life shows like this, I don't normally pay the music any mind, but with it being what it's supposed to be, background music, I think it did well. \\n\\n\r\nCHARACTER: \\n\r\nOkay, time for a little game I like to call Rosario + Vampire or Not! The object of the game? Find as many parallels as you can! \\n\\n\r\nA main love interest who is a sweet, bubbly vampire on a crash course for the protagonist? CHECK!\\n\\n\r\nA perverted werewolf that has a penchant from promiscuous actions? CHECK!\\n\\n\r\nA mischievous character that doesn't have a snowballs chance in hell of being with the protag? CHECK! Or we could go with the idea of a mischief-making loli as well, which also fits the parallel! CHECKITY CHECK!!\\n\\n\r\nA monster boy that acts like a total street punk and tries to fight the protag? CHECK!\\n\\n\r\nA constant need for the main cast to keep a secret for the sake of one of the main characters? CHECK! \\n\\n\r\nI could go on, but I think you get the idea. \\n\\n\r\nENJOYMENT: \\n\r\nI enjoyed this anime well enough, enjoying the characters present, with the exception of Akemi Mikan and that stupid spirit inside her glasses. She constantly torments and embarrasses the main protagonist, which doesn't exactly give her chances of winning his heart very good odds.\\n\\n\r\nThere's a point in the anime where she's feeling down and wistfully thinking about the protag, clearly wanting to be with him, but there comes a time where I can't help feeling like Asahi should've called off any minute semblance of friendship the two have. Sadly, Asahi's kind of a pushover, as harem protags often tend to be. \\n\\n\r\nRegardless, the episodic plots, though somewhat generic, do have some highlights, especially when the principal of the school is brought into the limelight. She can be pretty hilarious when she wants to be.\\n\\n\r\nOVERALL: \\n\r\nAs I said, I enjoyed this fairly enough, but it could really be forgettable if not for the R+V comparison. Asahi is just another nice guy protag that becomes an utter pushover whenever any of the girls are involved, but he's totally got that inner courage to stand up to others for their sakes. Youko is pretty ditzy sometimes, especially when the most creative thing about her, her explanation of vampires, gets exploited for gags. Mikan is worst girl, period. Nagisa Aizawa is fairly creative from an surface level, but she's at heart a kind of typical alien character. The plot is basic and disappointing in some aspects and I wish the series the best in its original form.\\n\\n\r\n(SPOILERS SECTION!! LET'S PLAY ONE LAST ROUND OF ROSARIO VAMPIRE OR NOT TO WRAP THINGS UP!!)\\n\\n\r\nSo as things begin to get dramatic near the end of the series, Asahi has a misunderstanding about Youko and she disappears off to her home, making everyone think that she's been found out and has to leave the school. Asahi's intentions are laid bare to chase after her and bring her back even if he has to meet her father to do it. Some characters object, and he even finds an obstacle or two along the way, but he eventually arrives at her home and has an encounter with Youko's father, Mr. Big Bad Vampire Dad, but ultimately convinces him to let her return.\\n\\n\r\nNow, the parallel in this regard isn't perfect, in Rosario Vampire, the finale had Moka's rosary be used to save the school from being discovered, thus making Surface Moka disappear, leaving only her true self. After a little while, Tsukune decides to see her father to have him make a new Rosary so he can have his bubbly main love interest back.\\n\\n\r\nThe obstacles Tsukune has to face along the way are the parents of Kurumu and Mizore, trying to force Tsukune to marry their respective daughters, but he makes it and straight-up struggles with Moka's father for the rosary.\\n\\n\r\nIn Actually, I Am! Asahi has a misunderstanding about the circumstances of Youko's departure, that she was actually visiting her father who had come down with a fever or something, and it's only really after Asahi accidentally spills the beans about knowing about Youko's secret that things get rough. The obstacles that Asahi faces are mostly from Nagisa trying to stop him from pursuing her because she totes loves him. And the encounter with Youko's father is more akin to a big chase scene, which is more comedic in nature.\\n\\n\r\nThese parallels to Rosario Vampire are kind of my main reason for making this review, and though I stand by those comparisons, I still think I overall enjoyed this more than R+V. Mostly because the anime of R+V fucking sucks when compared to its source material.",
            "date": "2018-10-21T22:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 292263,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Reploid7",
                "username": "Reploid7"
            },
            "url": "https://myanimelist.net/reviews.php?id=292263"
        },
        {
            "content": "Quick Summary:\r\nThis anime is a pretty standard paranormal school romance/ecchi comedy series. It does not do quite enough to stand out from the rest, but it has enough character to not just feel like a carbon copy. Enjoyable, if you find the genre enjoyable, possibly underwhelming or disappointing if you don't.\r\nStory: 6\r\nBoy meets girl. Boy is dense, girl is dense. Harem are attracted to his ineffectual, yet kind ways. Hijinks ensue. You've earnestly seen it all before, perhaps better, but do not let that keep you away otherwise. While the story definitely taps into ecchi waters (The Were-person character), I actually think this series isa little sweeter than it is perverted (although, again, it is that too). The story is rather lacking in most senses, it's just a light school romance anime, that so happens to have paranormal girls in it. The show does not go much further than that, and the romance is never romanticized (bad sentence, but the best way I can describe it). It is \"sweet\", instead of\"melodramatic\", and perhaps \"silly\" over \"funny\". I kind of watched it as an endearing copy of \"Rosario,\" and the like.\\n\\n\r\nArt: 8\\n\\n\r\nI don't really think any particular part stood out to shock and awe me, but it is just overall a good looking anime. Not terrifically full of budget shots, nothing too distracting for complaints. \\n\\n\r\nSound: 7\\n\\n\r\nI don't really cover sound in my reviews, I do not think this section should only mean a review of the OP and ED music, but as I do not speak Japanese, any of the nuances in the voice acting are lost on me, and I am not musically trained, so the soundtrack to an anime series can only ever be registered as good background effect, of which almost all anime succeeds when the series is good enough.\\n\\n\r\nCharacter: 7\\n\\n\r\nAs with all harem comedies, the characters all fall into their types, and it's hard to suggest any character truly stood out as being unique. Although I of course came to enjoy all the characters, I've enjoyed their counterparts in a hundred other shows, so I gave it a 7 for keeping the status quo.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nAll that being said, I'm a sucker for a sweet romance filled with laughs, so I enjoyed it just fine. It was losing me a bit at the end (the modern trend of never having a character actually progress in their declaration of love serves only to irritate me, but I understand why they keep writing it) but I laughed in probably every episode, so worth it.\\n\\n\r\nOverall: 7\\n\\n\r\nOverall, not a bad show, not a great show. A solid \"B\" series, getting \"awws,\" and \"lols,\" in equal measure from me as a viewer. As mentioned earlier, if you dig these kind of animes, you'll probably enjoy yourself. If you're not a fan of these cookie-cutter type series, probably steer clear.\\n\\n\r\nRecommendations:\\n\\n\r\n1. Rosario to Vampire. Same GENERAL idea as \"Jitsu wa Watashi wa,\" in that they're romantic comedies set in a school with a paranormal harem. Rosario is much more ecchi (as mentioned earlier) and Jitsu is a bit more sweet, and slice-of-lifey.\\n\\n\r\n2. Monster Musume no Iru Nichijou. You lose the school element, but you still retain the general premise of a slice-of-life comedic romance with a cast of paranormal females pursuing a normal, male human.\\n\\n\r\n3. Seto no Hanayome. While I think Hanayome is the superior title, both kind of revolve around the same principle of paranormal romance set against the backdrop of a overbearing paranormal father with gangster vibes (although Hanayome is explicitly so, and Jitsu is implicit, such as the scene where her father, while cleaning a katana, has the Wolf-person go out on a job).",
            "date": "2018-10-05T14:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 290978,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CosmicOwlDream",
                "username": "CosmicOwlDream"
            },
            "url": "https://myanimelist.net/reviews.php?id=290978"
        },
        {
            "content": "The anime itself is good with nice characters and light-hearted story. The comedy is top notch, The romance is just good enough. At first, I didn't want to try this thinking this is a harem (Really dislike that genre), and thought this was just gonna be a typical harem. Well even though it doesn't have a harem tag, it is indeed a pseudo-harem if you can call it that, but this does have character development. Unlike a lot of harems, the main pair is the main focus even after the other characters are introduced, in a lot of harem anime's, The main pairing/main focus whichthe whole show is centered around is just forgotten. Also unlike other harem anime, there are not too many love interests, I mean there are quite a few but not a lot like 7-8 like the other shows.. Also, the MC's devotion to the girl he likes stays true and pursuits and will likely reject others to pursue the one who he truly loves instead of being oblivious and dense or straight out ignoring other girls. Which makes the anime worthwhile for me (for a guy who hates harem).\\n\r\nMy only gripe with the show is the ending and some of the girl's reason for falling in love (well 1 girl really).\\n\r\nThe ending is like many others, \"Well here is the deal, we made the first season,  you liked it, now you want a second season but we won't make it so you can buzz off and continue with the manga\".\\n\r\nAnd the girl problem is like many harem anime, some of the reason for falling is stupid and doesn't make sense.(LOOKING AT YOU CHILDHOODFRIEND) \\n\\n\r\nAnd this is my review and my opinion, if you don't like it, its fine really. My apologies if i compared this to harem animes too much, my hate for that genre is something that I can't help with. \\n\\n\r\n(Also the manga is good and will likely wrap up the story good, I am on chp132 and it's really good so far because things are going somewhere, I suggest those of who are into the story, continue with the manga, its worth it)",
            "date": "2018-08-19T18:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 286909,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6375975.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SpiritAmbition",
                "username": "SpiritAmbition"
            },
            "url": "https://myanimelist.net/reviews.php?id=286909"
        },
        {
            "content": "This anime had a ton of potential. However very little tension and plot development was built up, and whenever some tension was built up... the story falls flat on its face with comedy. This anime should have been a Harem or Romance, If anything this anime is a comedy with minor romance. But if your looking for a good laugh, Anime is not the place you should be looking as American and British television do comedy best. In short, this anime has generally no point to it and is nothing like Rosario + Vampire which must have been where the creator got the idea from.",
            "date": "2017-08-03T17:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 254623,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6373476.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 2,
                    "sound": 10,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Syndicate909",
                "username": "Syndicate909"
            },
            "url": "https://myanimelist.net/reviews.php?id=254623"
        },
        {
            "content": "This is a fairly lighthearted comedy anime with a vampire and a bit of romance in it. Jt js worth watching for a comedy, some genuinely hilarious episodes, slightly unusual art style and because of Nagisa Azawa. Comedy is a bit on a blunt side, but is still entertaining.\r\nDetailed breakdown below.\r\nStory:\r\nThe main reason for watching this is comedy. Comedy sorta reminded me of \"Gintama humor\", in the sense that comedic scenes often features one character freaking out or overreacting to something, while others are desperately trying to diffuse situation. Unlike gintama, jokes are fairly tame. At least one episode was incredibly funny. So the mainpoint of interest in this anime is laughs.\\n\\n\r\nArt:\\n\r\nThe art style is a bit unusual - characters feature fairly big, or should I say \"tall\" rounded eyes. It sorta reminded me of Urusei Yatsura and 1980s animes like Gunbuster, but at the same time there are elements of newer \"spikier\" style used in modern animes with faster, bolder lines (hope this still make sense) and triangular faces. Basically this slight quirk allows creation of very charming and innocent/amusing-looking characters. Animation is fairly fluid too. Characters and backgrounds aren't INCREDIBLY detailed, but they work great for the style selected.\\n\\n\r\nSound:\\n\r\nInteresting intro song, and some nice music in this anime. Also, Seiyuu voicing Nagisa Azawa did absolutely amazing job.\\n\\n\r\nCharacter:\\n\r\nThe most memorable character in the series is Nagisa Azawa. As far as I can tell, she is either supposed to be a \"Tsundere\" or \"Straight-laced\" girl, but her freaking out and overreacting looks cute, amusing and natural, and in the end she doesn't really fit into any archetype. Main duo is less interesting than Nagisa, and resemble archetypes more. Yoko is a classic ditz, while Asashi is a guy who is a bit clueless. In the end, even though characters were probably based on one or another cliche, their interactions look very interesting, due to heavy focus on comedy.\\n\\n\r\nEnjoyment: \\n\r\nI found it to be very entertaining. One of the first episodes had me laughing, which doesn't happen often with the recent anime. I liked the art style (this minor detail with eyes added quite a lot of charm to the anime), and enjoyed watching Nagisa-related scenes. Basically, it was entertaining, funny and occasionally even hilarious.\\n\\n\r\nOverall:\\n\r\nA solid comedy that is worth a watch. However, it never gets dark, and never really deals with any \"heavy\" subjects, so it is mostly worth watching if you want lighthearted fun. For \"heavy stuff\" you'll need something else.",
            "date": "2017-01-19T17:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 238650,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=238650"
        },
        {
            "content": "Jitsu wa harkens back to the days when harems were about innocently discovering your feelings for one another, when we did no need an ecchi moment every five minutes to keep us engaged, and when protagonist leads were hopeless wimps. This show falls into the comedic harem genre as a semi-modern twist on Karin, where the protagonist was the heroine. This show is pretty out there with many crazy developments and ridiculous, comedic situations, but probably won't satisfy those who need concrete relationship progress or those looking for ecchi.\r\nIn the show, we follow our protagonist, Asahi, who is literally an open book and can neverlie. He has a longtime crush on the quiet beauty in the class, Youko. However, when he goes to confess, he learns that she is in fact a vampire, and must now do everything he can to keep the secret or else she has to transfer out. Will he be able to hide this mega scoop from his childhood friend, the school newspaper president?\\n\\n\r\nI found the show a fun ride, perhaps mostly for the nostalgic \"do I really like him?\" element that is missing from the instant girlfriend harems of today. That said, it's definitely a goofy show with a lot of impractical elements I'd say are comparable with the crazy latter half of Seto no Hanayome. If you're looking for a harem that is more focused on comedy than actual character development, here's your show.\\n\\n\r\nAnimation:\\n\r\nThe animation in this show is rather unique. There are multiple aspects that would make this blend in as a show from the late 2000s; for example, the show has a rather saturated color palette and the character styling is also a bit dated with extra-bold eye liner- everything just looks a tad silly. The characters themselves aren't my choice for cutest design or styling; that said they are pretty unique in both appearance and \"special traits\"- it will make sense once you watch it.\\n\\n\r\nIn terms of action, there are some comedic chases but nothing to really get excited over. There is a bit of ecchi, especially later in the show with the introduction of the perverted Shiho. That said, with the likes of the latest iteration of DxD and Maou Testament, I've grown completely immune to the level of ecchi here.\\n\\n\r\nSound:\\n\r\nThe show opens with a playful guy song, though I don't particularly like the vocals or the verse transitions. The ED is a calm, light rap piece that I didn't particularly fancy either. The most memorable music piece of this show is the insert song Hologram, which plays in various instrumentations to fit the mood (the original electronic version is most clearly heard in episode 5). The BGM is otherwise supportive but not memorable.\\n\\n\r\nThe VA cast is relatively junior. This is Yuu Serizawa's first major role that I've heard, and she's sporting a Kansai accent. Inori Minase has been around awhile though this is also the largest role that I've seen from her as well. Reina Ueda's role is interesting in that her character's personality is the exact opposite of what I saw in Taimadou, I didn't particularly like her character here though. I also paid a bit of attention to Mao, the school chairperson, as she's apparently going to be in like everything in the upcoming season. Honestly, I think the VA performance was relatively average here.\\n\\n\r\nStory:\\n\r\nThe show is fairly similar in plot progression as in Nogizaka Haruka no Himitsu. Basically, there is a central plotline that follows Asahi and Youko in their daily lives, which apparently become a lot more interesting after their meeting. The wild circus ride is pretty episodic and mostly just goofing off until the last few episodes. There we find a bit of rising action that quickly tapers off after an extremely predictable climax.\\n\\n\r\nGiven the heavily supernatural aspect of this show and the sheer randomness of certain scenes, I consider this an extremely light harem, to the extent that it might be more fitting just to call it a romantic comedy. Don't take the show too seriously as there'd be no way the characters' secrets wouldn't have gotten out eventually given the way they act throughout the show.\\n\\n\r\nCharacter:\\n\r\nIf I were voting purely based on the amount of fun the characters have, this show would rate pretty highly. Unfortunately, it is nowhere near as strong in terms of actual development. Asahi is a dated protagonist who is (fill in your typical protagonist characteristics from the late 2000s here) nice, shy, weak, and completely unable to admit his feelings. He meets our vampire, Youko, who is actually very outgoing and playful, but suppresses her desires so that her secret doesn't get out. Unfortunately for him, she is slow when it comes to love and thus can't figure out Asahi's feelings despite his inability to hide his true feelings. There is perhaps a bit of a nice timeline parallel with Youko's parents made in the middle of the show but it doesn't come out to anything in this season.\\n\\n\r\nIn addition to not making much progress relationship-wise, the show also has too many of the crazy-type in the supporting list. You have the childhood friend who apparently isn't disciplined despite bullying others for news stories and the mischievous school president who only answers to her relative, who happens to be Asahi's homeroom teacher, Akari.\\n\\n\r\nValue:\\n\r\nThough there were some fun moments in the show, it's a bit juvenile in tonality overall. And I wish they had made a bit more progress in their actual relationships. If you're looking for comedy with a more modern and cute flair, I'd consider Nisekoi to be a superior choice. If you're browsing for the vampire twist, I think Karin is still a better choice for actual character development. And if you want more of a serious vampire piece, Fortune Arterial has that covered.",
            "date": "2016-04-03T17:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 215392,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=215392"
        },
        {
            "content": "Normally I'm all about the mecha and action shows and I write reviews for fans with similar tastes. So it seems odd that I'd give a romantic comedy a five. But it's funny and heartwarming, plus it's not a typical harem show either. Yes several ladies are crushing on our main character but not in a manner that has you screaming [i]\"JUST PICK ONE YOU IDIOT!\"[/i]; nor does it make you stop and question why they'd fall for him in the first place. It doesn't take itself too seriously by drowning you with it's romantic overtures and the comedy is never sidelined to advance theplot. It successfully sells exactly what it offers; a romantic comedy that doesn’t sacrifice one aspect to satisfy the other. It's bright and vivid giving the show the kind of slick animation we've come to expect in 2015. My highest recommendation\\n",
            "date": "2017-04-05T22:15:00+00:00",
            "helpful_count": 0,
            "mal_id": 244798,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=244798"
        },
        {
            "content": "Is there some kind of trend about making shitty endings in summer or something?... Well... Jitsu Wa Watashi Wa's wasn't that bad, I mean... It was pretty ok, but still, absolutely nothing happened. Seriously, if they do a second season... please Asahi, confess already.\r\nAnyways, this anime kinda felt like some kind of To Love Ru but without ecchi (you know, couse every girl had a different thing n stuff). The characters were ok and the art style it's creepy as fuck at times. The story was acceptable and it had some good comedy in it, pretty predictable tho. I loved the opening btw, I'll giveem that. So, If you're into typical harem series, you should give this one a try",
            "date": "2015-12-17T11:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 205796,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205796"
        }
    ]
]