[
    [
        {
            "content": "*Minimum Spoiler Foodgasmic Review*\r\nIf you did not watch S1 or S2 then go watch them ASAP before reading this! \r\nTL;DR: This show has hype, humour, fan service, stakes getting crazy high and unexpected twists and turns all in 20 minutes. What more do you want? Oagariyo!\r\n[Story: 5/10 , Characters: 7/10, Art: 3/10, Sound: 6/10, Enjoyment: 8/10]\r\n\"I mean a new wave is coming, you know? Riding it is way more exciting\" - Rindo Kobayashi\r\nIf there is one genre that can always hype people up time after time, it's the classic shounen genre in anime. It's like scrambled eggs. The recipe is very simple yet the executionto get it consistently right day after day is difficult. Fortunately, Shokugeki no Soma - Sana no Sara somehow pulls it together to make it work for the fans albeit it's crappy plot arcs and dismal animation laziness. I guess over the top fanservice can save any show after all, provided if executed right. It's also important to note that the anime adaptation does not deviate too far from the source manga. If you enjoyed S1 a lot and felt S2 could've been better then you will surely have a table flip moment while watching S3 thinking for a manga that's widely popular and well funded, why the hell can't they pour money into it to do justice this show deserves.  \\n\\n\r\nThe story is alright, not too complicated but just slightly predictable. It's wise to watch the OVA before watching this so you have a back story on who the Elite 10s are. Although the first arc, Moon Festival, is really well done with it's pacing and plot development; the second arc, Central, is just one unrealistic & ridiculous plot line where nothing makes sense but it's enjoyable to watch since it's a chain of shokugeki after shokugeki tossed in with delicious fanservice to quench viewers' thirst. However, don't worry too much. You will always start watching every episode with a big grin and end the episode with even a bigger grin, because, you know why. It is sad that the season ends midway to the central arc with one huge reveal but maybe next season's plot would be better executed. \\n\\n\r\n\"Come at me with all your might you pretentious elite bastard. Or do you want to have a convenient excuse for when you lose?\" - Kurokiba Ryou\\n\\n\r\nThe best part about SnS is that even though it has a huge cast, it somehow manages to make everyone useful. You actually care about the cast since you know sooner or later they will have screen time along with some purpose, even if it is moaning in pure orgasmic pleasure. Purpose is purpose. The main cast returns once again since no one really dies in the show. Moreover, finding out who the Elite 10 are quite exciting. They presented them in the best way possible. Plus, as the show goes on, you get to see why they really are the Elite 10 through their cooking methods & knowledge of food, they outclass the regulars at the academy, especially, Eishi Tsukasa, the first seat. Despite being the best student with his immaculate cooking and speed, he still has his own insecurities and deals with anxiety like everyone else. Though it is exaggerated at times, but it makes him more human than most characters. The major villain is of course, Azami. Although, his villainous purpose makes no sense. However he is a villain and that's all that matters. He just wants people to eat gourmet food. Aside from Soma, Erina, Elite 10s and Azami, the side characters get their deserved screen time to showcase how much they have developed over the season. Notably, Alice and Ryou really stands out in this series as their development have the most impact to the plot.  \\n\\n\r\n\"There is a profound difference between the abilities of those who are the Elite Ten and those who are not\" - Eishi Tsukasa\\n\\n\r\nAside from the linear driven plot and dynamic characters, this show really fell flat in its animation quality. It feels as the season progresses, the budget invested in the quality of animation drops. Compared to the battle scenes of first season to battle scenes in this season, there is significant evidence of animation laziness. Even the fan service is lacking in that oomph that season 1 had with their gregarious cloth explosions to just mere still images of the characters in barely any garments moaning in the background. This isn't what the viewers want. Give them what they want. Regardless, of the poor animation quality, at least the background music was decent enough with the OP and ED being pretty good like previous seasons. The major saving grace had to be the seiyuus. They did a phenomenal job, especially Erina's new voice actor. She was able to fill the void left from her previous voice actor. \\n\\n\r\n\"You can never achieve such a world of flavour just by slapping on bacon onto salmon!\" - Kurokiba Ryou \\n\\n\r\nOverall, SnS S3 is a good enough ecchi shounen anime about food that is worth watching. I think at this point, the people who are watching S3 are the dedicated fans, myself included. So even if they skimp out on the budget and pacing of the plot with subpar character development of a star studded character line, people will still enjoy binging this show. Ultimately, it's not a bad show. If one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food. It's still enjoyable to eat but just a bit unhealthy. Also Season 4 has been confirmed. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!\\n",
            "date": "2017-12-19T11:10:00+00:00",
            "helpful_count": 80,
            "mal_id": 265604,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=265604"
        },
        {
            "content": "The 3rd season of Shokugeki leaves something to be desired in every way.\r\nJ.C.Staff's adaption of this manga series has never been masterful. For the most part it has been just phoned in. The spottiness of the animation, ugly CGI and off-model characters have always been somewhat present in this series, but the 3rd season marks a turn for the worse even when compared to the previous 2nd season. \r\nUsing manga panels directly as a storyboard and making sure the female characters' boobs look like they are about to burst from their uniforms worked fine for the first season, because that's when the writing and theplot was immaculate. This isn't so much the case with 3rd season. Even though the first arc has a very nicely structured conflict with a satisfying resolution, the following major arc that covers the rest of the episodes ramps up the action in a worst way possible, and goes almost full shounentard. As I had read the manga before diving into the animation this time around, I was hoping for J.C.Staff to salvage the plot and place emphasis on the elements which worked - which is the opposite of what they did do.\\n\\n\r\nWhat made the first season of Shokugeki good, anyway? The characters, and both their *intrapersonal* and interpersonal struggles. Souma's ability to rise to the challenge and help the people around him do the same made him a superb character. The interactions between him and Megumi were especially crucial, giving the viewers catharsis shockwaves. The people found their inner strength, and the (romantic) tensions between Souma and Erina kept us praying for more development. The slower passages gave the long season a much better flow. (minor spoilers starting now:)\\n\\n\r\nThe introduction of a \"classical\" villain and a conflict which is fought between two factions ruins all these intricacies in the 3rd season. Especially the middle section of this season feels like an endless stream of boring shokugeki. There are too many new bad guys and not enough interest in the stakes from my part. The dramatic tension of the whole series is undermined by the illogical motives of both the villain and the supporting faction. It's impossible to come up with reasons for as to why half of the top ten seats voted to place Azami as the director of Tootsuki. The fact they did do so pigeonholes these characters and the rest of the supporting forces, as their motivations have to be justified somehow down the line, even though that's impossible. \\n\\n\r\nBasically, the biggest plot twist of the entire series is a spectacular asspull.\\n\\n\r\nThe problems of the manga's plot are heightened by the fact that all the anime does is ramp up the tension, throwing caution out of the window. The sound design of this season is surprisingly stark. There are a variety of dramatic scores which are played surprisingly loud during shokugeki and otherwise. There are numerous instances where the director has decided to use montages and flashbacks to really try to bring out the feels out of the viewer. I was taken aback by how disconnected I felt from the story, even compared to my reading experience. The anime would have benefitted from downplaying the action and giving the characters more air to breath.\\n\\n\r\nSo why is this anime even good, then? The third season has still a lot of momentum and strong characters backing it up. Even though the plot is a little contrived, the development between Erina and her father is still very enjoyable. That’s all that matters and all that the conflict should really be about – resolving Erina’s literal daddy issues. Even though Erina’s payoff scenes were handled without much directional finesse, they still made the show worthwile. Additionally, even though Azami leaves something to be desired as the bad guy for the series, the first seat, Tsukasa Eishi, works much better as an opponent for Souma. If there’s something good to be said about the factions and the entire conflict, it would be the emergence of tension between these two characters.\\n\\n\r\nThe final verdict? Well, the animation is spotty, the sound design is crap, the CGI is fugly, directing is unimaginative, and emphasis has been placed on the wrong things. But it’s still god damn Shokugeki no Souma. It’s impossible to ruin the entire franchise at this point. I had fun times watching this season, and I’m hungry for the 2nd cour.",
            "date": "2017-12-19T02:57:00+00:00",
            "helpful_count": 64,
            "mal_id": 265568,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4243495.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Tiemuuu",
                "username": "Tiemuuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=265568"
        },
        {
            "content": "I just finished the series and i was amazed. In my opinion this is the best season so far and i think that it is my favourite show now. The story in this season was pretty unpredictable yet i would call it amazing. The Shokugekis were extremely intense and i was always excited how it turns out because as i mentioned before it is pretty unpredictable although the outcome is guessable. I love that the elite ten were intrduced and even a bit of their characters has been mentioned. I dont want to spoiler anything so i wont tell much but the ending where erinagets a certain information and everything seems connected now i love the show so much more.\\n\r\nIt is unavoidable to watch this!\\n\\n\r\nPerfect season!",
            "date": "2017-12-19T12:14:00+00:00",
            "helpful_count": 53,
            "mal_id": 265617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6654060.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Wurzelsepp",
                "username": "Wurzelsepp"
            },
            "url": "https://myanimelist.net/reviews.php?id=265617"
        },
        {
            "content": "So what's the big premise of this show? ... to just watch the same happen over and over again? Souma has been winning so many matches lately, and yet it's almost like nothing happens. 3 seasons in, and yet they keep introducing all kinds of \r\ntournaments, where the winner, gets nothing in exchange. The fanservice keeps being the same, every reaction keeps being the same. To be honest, the food gets more development than the actual characters, it's strange. As far as this goes, this one cour has the be the worst of them all, with no progress in the story, and rather, it's filledwith nonsense to sell more. \\n\\n\r\nThe big idea: Souma wants to enter the Elite Ten. How is he going to do it?: No idea, 3 seasons in and nothing has happened. When is he going to do it?: Again 3 seasons in, but apparently seeing people excited and being almost nude because of food seems more interested than the actual \"plot\", if you can call that a plot.\\n\\n\r\nStory-wise, not much here, in any case, this has been been the worst season of them all. The only big thing is Souma fighting for the place he lives in. After that (And before that) it's a rollercoaster of nonsense, all of these together with no explanation of the actions of some characters, leaving you without 0 clues, so you end up not knowing anything. It's a joke. While this one was 12 episodes it felt like reading the 3 first chapters of a manga. Almost 4 episodes contained what 1 chapter of manga could have, it was slow pased leaving a lot of cliffhangers in the end, so in the next episode they keep doing the same. So, repeat this 2 more times and you are done.\\n\\n\r\nAt least this part's art was better than the so garbage part 2. Not to sound rude of course, but the lack of quality in animation has always been part of this show, only concentrating on making face expresions look ridiculously weird and making girls excited from eating. Leaving behind any proper proprortions of the body, leaving behind all the work the Manga creator has put into it, just so the fanservice can take over it. (w) \\n\\n\r\nSound: I guess it was decent. There isn't anything remarkable at this point, everything seems in place, from the OP to the ED, to Background sounds and music to voice acting. Like previous season, they knew how to remix their music so they don't overlap over the voices. But they forgot that not everything is music, they are using a weird amount of music in every episode it gets annoying, and not exciting as i'm guessing they want it to be.\\n\\n\r\nCharacter: Again, they keep introducing characters that seem quite interesting, just so they get defeated in some sort of Shokugeki and never appear again. While the main characters have already been developed, it seems they don't care about anyone else.\\n\\n\r\nEnjoyment: Not best experience i've had, i could've dropped the series in the middle, but i decided to continue... i ended regreting not dropping it. It seriously feels like a joke, rather than a \"cooking\" show. Where's the progress? Oh, I see.\\n\\n\r\n3/10.",
            "date": "2018-02-22T14:00:00+00:00",
            "helpful_count": 34,
            "mal_id": 272196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5782169.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shiraishiku",
                "username": "Shiraishiku"
            },
            "url": "https://myanimelist.net/reviews.php?id=272196"
        },
        {
            "content": "Shokugeki is... A cooking battle shonen. For me some shows will always be defined by their premise, and this is certainly one of them. Gintama is historical science fiction comedy. Mushishi is supernatural hiking. And this is Chopped ramped alllll the way up to 11. The best part about this, is that the show knows it is, and consequently pours its all into being exactly what it is: a carousel of mouth watering food, excessive dinner-induced fanservice, and quirky, plucky characters.\r\nTo be honest there's not much more to say about this next installment in the series. The plot is advancing closer to the point we'vebeen waiting for since the beginning of season one, the animation remains solid all around and beautiful when it comes to food, the characters are continuing their bits of growth while maintaining most of the running gags, and its an absolute blast to watch. And that lack of excess fat might be why its so darn entertaining, and a tie back to my first point: this show knows exactly what it is, and it does exactly that at a consistently high level. its self assured, and that's what keeps its edge.\\n\\n\r\nIts sharpest point outside the premise comes in the form of its characters. The show as a whole contains a large cast list, and the vast majority of these people are not only given backstories, but evolve alongside the main character. The show desperately needs this to compensate for the lack of true action scenes one would typically associate with the genre, and it does so with aplomb. Accomplishing the balancing act of having a true main character while still developing other pieces is one that few shows attempt, and even fewer pull off to the extent Shokugeki continues to.\\n\\n\r\nIn short, this is not the deepest anime. But it keeps an ever expanding, colorful cast, an endearing main character, some incredible sounding food, and is conceptually an inventive spin on the standard shounen anime. An absolute blast!",
            "date": "2017-10-30T18:29:00+00:00",
            "helpful_count": 25,
            "mal_id": 262143,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5430414.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/joschmo11",
                "username": "joschmo11"
            },
            "url": "https://myanimelist.net/reviews.php?id=262143"
        },
        {
            "content": "Story wise, there is one main story, subdivided into arcs (seasons), subdivided into events. Events can be 1 episode or a couple. \r\nWith some anime you feel like wanting to skip to the end of the story just to know how it finishes, however, Shokugeki no Souma keeps me fixated to the screen the entire time. When the episode is finished, I am thinking 'already finished?' that was like 5 minutes max'. It just sucks you in.\r\nI personally like cooking, but this anime is so much more than that. It is like Hyaku (I expect) or Diamond no Ace. The story is about a subject,but subplots and characters make it great. Also the side-characters add to the plot and are not just annoying.\\n\\n\r\nThe sound, the art and everything else support each other resulting in a great anime.\\n",
            "date": "2017-11-25T03:03:00+00:00",
            "helpful_count": 14,
            "mal_id": 263908,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3045127.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mythicism",
                "username": "Mythicism"
            },
            "url": "https://myanimelist.net/reviews.php?id=263908"
        },
        {
            "content": "Another Shokugeki no Souma season has ended, so my review with no more adieu:\r\nMediocre 5, Story:\r\nSo far nothing has change from its plot it's same old same old master chef or a Hell's Kitchen kind of thing regardless as to whom the protagonist faces, so let's be honest here, this ain't about them Tostsuki competitors, this just all about food porn with lots of exaggerated pizzazz's and nothing else. I'll have a spicy steam bun pls......\r\nArt 7, Good:\r\nOk so there were some changes in the art, but then again, it's good cu'z there some good fanservices that has just been added in this 3rd sequel,and no longer regulated to just one individual, unlike in the 2 previous season where we don't get to see some panty flashes nor underwear fanservice in the 1st season , in the 2nd season it all on Ryoko, now it is with anyone who's feeling the ecstasy of tasting food and in the bathroom scene with Erina changing with her lesbian lackey Arato and also with Alice when she is stepping on Ryou's shoulder. I'll have a Mafu Tufo pls......   \\n\\n\r\nMediocre 5, Sound:\\n\\n\r\nIt doesn't matter if Taneda Risa isn't doing Erina's voice anymore, as long as it's the same seiyuu who does the voices of the usual character.\\n\\n\\n\r\nMediocre 5, Character: \\n\\n\r\nSo them Top 10 seats were now the Central, thanks to the new boss in town who also happens to be Erina's dreaded daddy Azami Nakiri, ok so now Erina has to run away and live with them Polar Star people whom she sees them as the lower tribe under the totem pole, but ya know it was kinda funny that she has to work her ass by using her so called \"God's Tongue\"  as a food taster for the tenant living in it, thought she wasn't forced into doing it, but the good thing was it did paid up as them Polar Star people started to win in the shokugeki against them Centrals. Even so, it was still the usual characters and not even the adding of the 10 seats and the Centrals would make any difference at all since it is the same Souma, the same Erina, the same Megumi and so on and so forth. Can I have some desert?  \\n\\n\\n\r\nMediocre 5, Enjoyment:\\n\\n\r\nAs I've watched the first two season of this franchise, my enthusiasm has gone from with gusto for the season one to not bad for season 2 and now it's basically this again, to simply put it, part of me feels like watching this is as a chore but part of me feels like why not 3rd in row kind of thing. I'll have a venison steak pls \\n\\n\r\nMediocre 5, Overall:\\n\\n\r\nWell, I have mixed feelings about this 3rd sequel and to end it in a cliffhanger, ain't that bad, but, I still feel like that watching the up coming sequel would be just too boring even if it is still yet to be aired. Then again, depending on how it goes , things might look up....I still don't get why Souma still wears his old middle school uniform instead of donning the Totsuki official uniform. Check pls.........\\n\\n\\n\r\nKeep the change.......  \\n\\n\\n\\n",
            "date": "2017-12-21T11:02:00+00:00",
            "helpful_count": 10,
            "mal_id": 265849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=265849"
        },
        {
            "content": "The problem with shows like this one is they inspire such blind devotion that people overlook its glaring flaws. I'll admit right now that I love this show, and although I'm enjoying this season, there are quite a few things that bother me.\r\nThe plot this season is definitely uping the stakes compared to previous seasons. It is quite enthralling but is also frustratingly flawed. There are of course all of the instances of the main character being unnaturally successful at everything he does, but like whatever. What bothers me is all the moments where I'm just awestruck as things that shouldn't and can't happen ina realistic world shape the events of the story. The main conflict in this season stems from such an occurrence.\\n\\n\r\nThe budget for this show has unfortunately tanked hard. The animation is just SOOOOO unbelievably lazy. Everything is flash, they overuse all the lazy anime tactics: switching to a goofy, super cartoony animation in order to make animating easier, rarely showing legs while people walk, frequently focusing on still images, animating almost nothing on the character but their mouth. They've even removed nearly all of the elaborate visual foodgasm metaphors. The sound is just normal anime sound, decent voice acting, basic anime music and sound effect. Is whatever.\\n\\n\r\nYou know the characters by now, or at least the main ones. There has been a good number of them up until this point. That's why they decided to add like 20 new characters, whose names you'll never learn, as regulars on the roster. I hate when shows do this. Ya, it keeps things interesting, but like in the same way that starting a new anime and watching the first 4ish episodes before doing the same thing again, keeps things interesting. I like many of the characters they introduced up until this point which is unfortunate because now there are so many characters that I don't get to see the few I like. Additionally all, and I mean ALL of the characters in this show are SUPER tropes, so get ready for that.\\n\\n\r\nLuckily this show is super enjoyable, otherwise, there'd be no redeeming it. The fact that they managed to make such a crappy, lazy season like this and still make it enjoyable is astonishing. It is however not nearly as good as the hype would suggest.",
            "date": "2017-12-04T14:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 264523,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6357466.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rdeyoung8",
                "username": "rdeyoung8"
            },
            "url": "https://myanimelist.net/reviews.php?id=264523"
        },
        {
            "content": "This review will be short and simple.\r\nStory: 10/10\r\nArt: 10/10\r\nSound: 8/10\r\nCharacter: 10/10\r\nEnjoyment: 10/10\r\nI love nearly everything about this anime, the character development, the humor, art-style and plot.\r\nThe anime overall is just simply amazing, it has everything you need in an anime.\r\nIn season one there was a problem with character development and that there basically wasn't any but since then the stories are interesting from every character and how they intertwine on how they met or how they came to be where they are now.\r\nMy one problem with the anime is the music and sound, I'm not a fan of it.\r\nI didn't notice at first but afterre-watching it the sound ruined it for me.\\n\r\nWhen someone tastes some good food the music just doesn't fit, all the way through the first season they overused this OST,\\n\r\n https://www.youtube.com/watch?v=P8fe6PsF6gU .\\n\r\nBut since season one the music has improved a lot and probably will be perfect in the future, but at this moment in the anime the sound hold it back from being faultless and perfection.\\n\\n\r\nThis is my personal favorite and many others, the reason is because it is not to far fetched and the characters are interesting. \\n\\n\r\nOverall: 9/10",
            "date": "2017-11-29T11:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 264191,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6048263.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Panda_Bates",
                "username": "Panda_Bates"
            },
            "url": "https://myanimelist.net/reviews.php?id=264191"
        },
        {
            "content": "Four things:\r\nI don't want to sound edgy and am not hating on this because it's popular. I'm being honest. I loved the first two seasons. This third season is proof that a studio can really dumb down significantly the plot/thematics and everything else and the fans will still love it to death. \r\nThis show has become as ugly as sin. At first I didn't mind the change in character design, since it made the characters look a bit older. However, it clearly shows that in basically every single shot except for detailed close-ups, the characters look significantly worse than in prior seasons. Also the animationdowngrade makes everything more of an eyesore. \\n\\n\r\nThe camera is CONSTANTLY SLIIIIIIIDING. I checked back on previous seasons for comparison and yes, the camera slid a lot back then as well. But in this season it's been put on overdrive. I'm 99.9% sure this was done as an attempt to mask the drop in animation quality. You will pretty much NEVER see a stillshot except in comical moments when a chibi style is utilized. Exceptionally irritating and lazy. \\n\\n\r\nThe overall trope showcasing the underdog/secret overdog reforming the system as well as the theme of pristine, heartless, haute cuisine v.s. personal, self expressive cooking has always been the lifeblood and undercurrent of SnS. It doesn't knock you in the head screaming in your ear that it has these themes. There was at least some subtlety to it and respected the viewer's intelligence. But in the second arc of this season, the show just shoves it front and center making the most basic, black and white scenario. The whole \"rebels\" of polar star vs Central just was beyond basic. Took away all forms of subtlety to the show's theme. Given, this is probably the manga's fault.\\n\\n\r\nOverall, I doubt things will get better at this point. The fact the show is still apparently just as popular as the prior two seasons will give the creators no incentive to bump up the standards. These complaints apply to the second half of the San no Sara season as well.",
            "date": "2018-04-24T17:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 278920,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6040311.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/yenrz1345",
                "username": "yenrz1345"
            },
            "url": "https://myanimelist.net/reviews.php?id=278920"
        },
        {
            "content": "First of all i would like to say that i´m not a native english speaker o i might have some mistekes.\r\nStory: Food wars didn´t really had a plot in the last tw seasons, it was just the clasic shonen formula of becoming the strongest in something, in this case the best cheff. It was not a problem for the  show, it could with it´s great art and animation, the epic soundtrack and the funny characters become an interesting anime to watch. Anyway, this \"formula\" was already a bit repetitive, so t was necessary to include some neew staff, the problem starts when this newstory is bad.\\n\r\nwhen Azami first appeared, i was truly interested on him. I mean, Erina had always seemed to have a secret past due to her flashbacks so I wanted to see how it was going to be developed. It was really disapointing when i realized his objective. After the chapter 5, I think it turned into a cliche story in which the main characters have to fight against the bad guys whose objectives are just being bad. I know that we dont yet know why Azami is acting as he is but the felling that i get from what a watched is that noone would do that in real life. \\n\r\nThe other aspect i would like to talk about is the inclusion of the filler characters that appeared on the last chapters. I just don´t understan how strong they are. they are much better than everyone else but they had never even been mentioned??? with them i will just pretend they don´t exist.\\n\r\nHowever there are some things that i have really liked. The fist one i the first arc os the seaon, which i conider to be teh best part of the whole serie. it is an extension of what we had already een in the other seasons but with a very good rival. Then I am interested in what could happen with yukihira´s father.\\n\\n\r\nArt: It continues with the same kind of art from the last two seasons having great character designs and pretty decent backgrounds (thinking they are almost always in a kitchen). Then, the animation is solid, i wouldn say it is bad o good anyway. Finnaly, it makes a very good job a making the meals, which look gorgeous and makes you feel hungry at every moment.\\n\\n\r\nSound: I consider the soundtrack of the fisrt season to be the best one, but this one is also preety good and the voice actors are Ok. I like a lot both the opening and ending songs, being one of my personal favourites of the year.\\n\\n\r\nCharacters: In this season he only one who recives a bit of character development is Erina, she passed from being  pride and powerful girl to become a \"princess\" who need to be saved. this is something very common on tsunderes so i wouldn´t say it is bad. Then, i have realy liked the personalitiees of the elite ten beingf pretty funny and intereesting to watch.  I´ve already talked about Azami in the story part so i won´t repeat it here.\\n\\n\r\nPersnal Enjoyment: this i a very entertinig show to watch, principaly if you like Shonens like me. I would just recomend not to expect too much abut the story and just relax and watch the show. i have really enjoyed it and I would give it a strog seven and a light eight.",
            "date": "2017-12-28T10:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 266650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635073.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Luca_Graziani",
                "username": "Luca_Graziani"
            },
            "url": "https://myanimelist.net/reviews.php?id=266650"
        },
        {
            "content": "\"Shokugeki no Souma looks stupid, it's just a story about a guy that likes to cook food\"\r\nGood god, this anime series....\r\nThe anime that made me start cooking good food other than eggs and burgers.\r\nShokugeki no Souma San no Sara showed me so much about what it takes and what is like to cook.\r\nIt's unbelievable the way they can put out such an intresting and joyful story, and combine it with the so well done music and sounds.\r\nThe time that we have waited for this season was not too long, but it was kind of painful, at least for me, in a way that I wantedso bad to continue watching and enjoying the way they make food and show it to the viewers.\\n\\n\r\nStory-10/10\\n\r\nThis season was so good, it's unvelievable how they made such good work with the adaptation, it was so good that made me rewatch some of the episodes in the same day. Its amazing the work Yuuto Tsukuda (the creator of SnS) has put into this season, it's unbelievably remarkable in every episode.\\n\\n\r\nArt-10/10\\n\r\nCouldn't ask for better design and art, fits perfectly with the theme of food.\\n\\n\r\nSound-10/10\\n\r\nUndeniably my favourite openings and theme musics of all animes that I've watched until today, every second of the opening is amazing, it spoils much even though you have no idea until the end. The ending music is amazing as well since at the end of every episode makes me smile somehow.\\n\\n\r\nCharacter-9.5/10\\n\r\nYukihira Souma--->My favoutite character in any anime because of his behaviour and sense of challenge and doesn't stay depressed after losing any match.\\n\r\nEvery othert character is so well developed, some of the times you think you know a certain character because what you saw in previous episodes, but in SnS is really intresting how they change ideas and opinions from one episode to another.\\n\\n\r\nEnjoyment-10/10\\n\r\nCouldn't enjoy more than this, it's on my top 3 for some reason, every episode makes me feel like there is so much to the anime than it looks, its exceptionally amazing how they made every episode enjoyable to this point.\\n\\n\r\nOverall-10/10\\n\r\nI can't say much more about it, it's most likely I don't have words to describe how outstanding this show is, I can only say one thing, and that is ---> Shokugeki no Souma\\n\\n\r\n*this is an edit from my other review",
            "date": "2017-12-20T17:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 265772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5879564.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChaosMeat",
                "username": "ChaosMeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=265772"
        },
        {
            "content": "Shokugeki no Souma manga is one of the best, but the anime? mehh, too many rushed and misplaced scenes, not only the minor ones, but also the crucial ones, like when souma reveal his father to azami and (unintentionally) to erina, that scene should be when the polar star dorm residences were having a party after souma defeat eizan and in the anime this scene is after souma vs tsukasa and tadokoro wins against central, WTF! the anime really ruins the manga's masterpiece, as the manga reader I find the anime really sucks! someone said to me that they need this to make a cliffhanger,the hell with that! for me it just like they want to make the anime really different from the manga, what a bad adaptation indeed!",
            "date": "2017-12-19T14:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 265628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gokuya81",
                "username": "Gokuya81"
            },
            "url": "https://myanimelist.net/reviews.php?id=265628"
        },
        {
            "content": "For those who are familliar with the manga this 3 season of Shokugeki no Souma wasn't disappointing at all and Jc Staff did a great job at adapting the source material. The main focus in this season is presenting The Elite Ten members to its audience and how their power and status influence the lives of students and hierarchy of Totsuki Academy. You will see the real meaning behind the \"Food Wars\" title in this season, a clash of ambitions, ideals and cooking styles between Totsuki and the Elite Ten members.\r\nThis season starts off great with our usual fearless  Souma who takes anyone's cookingchallenge head on  with his own style that he polished across years. I like how they connected the stuff he learned during the stagiare and autumn selections arc and used it during his confrontation with one of the Elite ten seat taking a step foward and improving his qualities as a chief at Totsuki. The battles give you a bump of adrenaline and they reduced the number of foodgasm scenes and replaced them with beautiful symbolism who is fitting for the cooking style of each character. \\n\\n\r\nThe recepies as we are used are very detailed, the food is delicious and this anime knows how to built up the tension before each match and release it at the perfect moment during the food challenge. It also showed a glimpse on how a restaurant works and the reality on the struggle to attract customers and please their needs during the moon festival arc.\\n\\n\r\nAs for the characters Erina , Alice ,Ryuu and Souma get nice development in this season. They did a good job at portraying Erina's reasons and motivations of becoming a chief and strenghten her bond with Alice . Beside our usual funny interactions between the characters we have some heartwarming moments that are perfect for your heart.They did a great job at showing Azami's  clash of ideals and ambitions with the Totsuki director and created a fitting atmosphere for his character in this series. \\n\\n\r\nIn conclusion this season stands proud and is the Shokugeki no Souma anime that we all love and enjoy watching. So if you liked the previous seasons you will love this one!\\n\\n\\n",
            "date": "2017-12-19T11:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 265612,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=265612"
        },
        {
            "content": "This, ultimately, feels like half of a complete series.\nI have long been a fan of the Food Wars series, with it's excellent character sets, great story arcs and fantastically imaginative 'battles'. Food Wars is a wonderfully funny and imaginative action series, but this is definitely the worst season yet - so far.\nFor me, Food Wars S3 falls down in two specific areas:\nFirstly, S3 doesn't seem to have the same level of competition as the other seasons. Yukihira's enemies in the previous seasons are now his friends, and the new opponents feel very lifeless and one-dimensional. Secondly, this is a really slow series, with some ofthe most infuriating cliffhangers in anime - the first and last few minutes of each episode, more often than not, are the only moments with any substance, the rest of each episode feeling really flat.\\n\\n\nFood Wars is a fantastic series. However, Season Three is the weak link. If you haven't seen it yet, it might be worth waiting until the story continues in April 2018 and binging the whole lot for a better experience.\\n",
            "date": "2018-01-20T08:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 269128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6829196.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TAYLORtCC",
                "username": "TAYLORtCC"
            },
            "url": "https://myanimelist.net/reviews.php?id=269128"
        },
        {
            "content": "STORY - 9\r\nART - 9\r\nSOUND - 9\r\nCHARACTER - 10\r\nENJOYMENT - 10\r\nTake the lid off the pot and a steam of emanating enjoyment comes out yet again in the third season of Shokugeki no Souma. The Third Plate is a cooking anime of high-stakes that delivered the same qualities that its predecessors had already achieved, bringing in more entertainment to the plates.\r\nWhat was the key difference compared to the previous seasons that this season cooked for us? It was the heavy hitters of the prodigious culinary school. The very best of the best. The biggest players. After all, the majority of the story had only focusedon the enrolled students so this change of pace was a welcome addition. Not only did it bring a realization to the existing characters, it opened up their mind into the world of professional cooking which developed a couple of characteristics. It also gave some of the most suspenseful food battles, knowing the risks and rewards in facing the upperclassmen. Another thing to see here was the skills they have accumulated over the time being together. Their support and trust towards each other goes to show their deep connections. They learned together, being able to progress with their friends and these interactions is one of the most strongest aspect of the show because of that. It served a crucial part in highlighting many of the characters or challenges during the journey. Well, enough with the seriousness and let's soak ourselves in comedy here for a bit. With the advent of new characters comes with it a bunch of different personalities that were amusing. Of course, this show wouldn't be the same without the fanservice or golden chibi comedy. There's a good balance between the transition from the important to funnier parts that just welled you up with a variety of emotions. Pure entertainment indeed.\\n\\n\r\nOn to the next part, maybe something that took a slight decline was in the art. Though it's only for a little, the use of CGI did felt a bit surprising because it was jarring. There were also scenes that had a noticeable crookedness in the character expressions. Thankfully, the visualization in the dishes were still top-notch so you better bring along a couple of foods while watching (or you'll eat through your screen). In the kitchen, you'll get a sense of how much efforts went into cooking with the smooth movements from the animation. While it's still as fluid as ever with that, for other things such as comedy, there's a lack of exaggerative action so it's not as effective as before. Something that did improved was the things related to the characters. One is the design of the new cookers which had their own charm. The second would be the voice-acting in the change of riskier atmosphere. As this time the consequences seemed a bit more closer to them, the doubt or panic within had a deeper significance. Particularly with a certain girl, I'm surprised by how much the voice can change when her hidden personality is brought out. Anyways, the soundtracks pretty much remained the same good quality, whether that'd be going side-by-side with the cuisine, tenser situations or happier scenes.\\n\\n\r\nYou can think of The Third Plate as a dish that got closer to completion as the episodes goes by. It started off with a rich base from the culmination of the two previous seasons and added in new things that changed the final flavor. There were a couple of issues with the art and animation, but the introduction of new characters and plot were effective in giving off that extra taste. In the end, the third season became an amazing food that was full of appetizing ingredients.",
            "date": "2018-01-12T08:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 268300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=268300"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nOnions taste delectable.\r\nI didn’t always believe so, though. For a long time, I avoided their presence, viewing them as a white blight upon the meals they complemented. But now? I try to get them on everything (where it makes sense). Burgers. Pizza. Tacos. Onions no longer go unwelcome but instead have won me over, earning a seat at my table any day of the week.\r\nJust as taste buds change, anime can do the same. For Shokugeki no Souma: San no Sara, some of its own changes both help and hurt what once was.\r\nSTORY\r\nThree seasons in,Shokugeki already knows itself pretty well at this point. The mixture of character comedy, hyped upsets, and a slathering of ecchi delivers unto the audience its signature brand of food-fueled fun. With Souma himself still aiming for his goal to be the best of the best, this next part in the series decides to put its skillet back on the burner as the plot heats up.\\n\\n\r\nBefore doing so, though, it goes back a bit further to its roots (and not the farm kind). Where the continued Tournament Arc bogged down the previous season to a large extent, it now channels some of the older magic which had made everything so intriguing to begin with. The story events concern less with structured cook-offs and more about these weird competitions that lead to positives and negatives within the sphere of their school.\\n\\n\r\nFor instance, Souma’s wholesome attempts during the festival demonstrate the power of a warm, handcrafted meal, and his rigged war against Eizan reflect the plight that the Polar Star Dormitory faces as the evil Central takes over. While multiple exist, these two examples highlight how the show finally remembers the meaning and the stakes behind these culinary clashes.\\n\\n\r\nMoreover, Shokugeki also strikes a better balance between these battles and its silly comedic forays. Souma and Nao may bond over their horrific concoctions, yet the off-the-books duel with Tsukasa elevates tension as fate hangs undetermined. This balance overall leads to less repetition (especially an avoidance of umami dialogue) among the events and thus a stronger sense of purpose throughout the season.\\n\\n\r\nUnfortunately, the ecchi elements are once again tuned down as the general seriousness wafting in the air prevents much in the way of over-the-top sexuality. Prominent thematic ideas also sour away as these developments commence. However, major reveals right at the conclusion make the audience yell at their waiter for seconds regardless.\\n\\n\r\nSo, despite whatever smaller shortcomings Shokugeki contains, the beginning of this third season demonstrates a return to proper form for the series, making excitement a possible item on the menu.\\n\\n\r\nART & ANIMATION\\n\\n\r\nLike most anime deep into their stories – which in this case means episodes – not a whole lot more can or even needs to be said about the presented visual flavor. Shokugeki is no different. Sort of.\\n\\n\r\nAs an appetizer, the character designs still wear their personalities, their attractiveness, and their styles front and center. Newcomers Azami and Rindou seat themselves right alongside the familiar looks of Souma, Erina, and the others. The former wraps himself in dreary, washed-out colors for an evil presence, and the latter sports a catlike appearance to capture her carefree yet sinister attitude. Some sweet designs, indeed.\\n\\n\r\nMany a detailed shot likewise make their return. The various foodstuffs are as mouthwatering as ever, and the imaginative moments as combatants live up to their respective skills keep the fun going. So, in other words, Shoukugeki has grandma’s recipe and smartly follows the ingredients for a tasty product.\\n\\n\r\nSimilar thoughts go for the actual animation. The series has never had the best movement possible when given its static shots, crazy reactions, and occasional jokey style. That all remains true still, making for the show some standard, passable levels on this front.\\n\\n\r\nThe dreaded panning camera, the stiff actions, the speedy backgrounds, and the rough CG segments, though, are now much more noticeable than ever, breaking the artistic flow to the point of concern. It could also be argued that, by now, the series shouldn’t be having these problems anymore to begin with. That it has had enough time to think about correcting or avoiding them (whether they were present or not).\\n\\n\r\nIf nothing else, even the visuals for the ending track lack appeal as they reuse clips not only from previous seasons but also from this current season. A rather clear indication that the dial has been turned down on the artistic stove.\\n\\n\r\nCHARACTERS\\n\\n\r\nWithin the start to this third season, not too much occurs personally for Souma and the other cast members. However, Shokugeki has writing and moments which back their continued quests among the foodie sphere which they call home.\\n\\n\r\nMost notably, Erina finally receives more than a morsel with some much-needed backstory to complement her difficult, arrogant personality. Her sad childhood filled with manipulation and loneliness humanizes the young woman, and her stay with the friendly people at the Polar Star Dormitory provides her with a warm atmosphere that she has never quite experienced before.\\n\\n\r\nOther side characters order up a helping of growth, too. Alice is Erina’s rival, but she is also her family, and so her heartfelt letters and her determined protection serve to add another dimension to her character. Kuga, Eizan, and Tsukasa hold spots among the top elites, and their challenges, losses, and nerves (respectively) bring about extra pep. And Subaru turns over that new leaf still when he supports Souma during the festival, putting his best foot (and food) forward.\\n\\n\r\nThe most impactful character for this season of Shokugeki, though, goes to Azami, Erina’s father and the horrible man spearheading the lamented direction the school now takes. He envisions a world where only the most exquisite delicacies exist, and anything less than perfection may as well be chuff fit only for the trash.\\n\\n\r\nAs such, he homogenizes the teachings and the courses for the students, throwing away diversity without a second thought. His antagonistic approach not only makes him a character the audience loves to hate but also explores this theme on the importance of individuality both for the characters themselves and the expressive food they create.\\n\\n\r\nOtherwise, the remainder of the cast do their thing. Souma stands up for his cherished friends while simultaneously battling those above him directly and immediately. Megumi cheers him on. Satoshi attempts to maintain stability behind-the-scenes amidst the chaos despite the threat to his seat on the upper council. They and the rest round out the show without feeling left out or forced into the proceedings for the sake of screen time.\\n\\n\r\nAll in all, the characters continue to be one of the show’s strongest aspects.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nMuch like the visual direction, the audio for this third season of Shokugeki does not change much (if at all) from its previous offerings. The voice-acting performances are as swell as always. The original soundtrack still has its rousing and homely compositions. And the various sounds as meats and as vegetables cook, alongside the usage of utensils and devices, fill the ears with a scrumptious, professional “aroma.”\\n\\n\r\nThe only major differences from this continuation come from the opening track and the ending track.\\n\\n\r\n“BRAVER” leads the audience in. Sweet drum fills and a steady guitar riff get the action going, but the vocal shifts and intensity build the fire behind this piece. Combined with its quick pace, the buildup, and the stuttering finish, it forms into a hyper-charged listen that pumps up the audience just as much as Souma when he steps into the kitchen.\\n\\n\r\n“Kyokyojitsujitsu” leads the audience out. The groovy bass tastes best within the instrumentation, but the recognizable female vocalist from nano.RIPE (the band for this song) and the slick guitar playing are no slouch overs either. Unfortunately, the total package lacks the same sense of passion and purpose as its OP counterpart.\\n\\n\r\nAlthough the ED does not have the same clout as the other music tracks, the familiar strength in the other parts of the audio direction and that new OP deliver on their promise of high execution per usual.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt’s almost always nice to see a series continue its success as it moves past its origins and into the crux of its journey. Thankfully, this anime follows this statement about as well as it can.\\n\\n\r\nPersonally speaking, I liked this season if only because Erina – as my favorite character from the show – was involved way more than last season. Plus, the setup for the betrayal by the council members, while somewhat annoying, will make for an inevitable (I presume) string of recompense once Souma and crew take them down.\\n\\n\r\nThe other parts of the anime were still fun, too. The comedic bits had me laughing. The romance hints got me all smiley and giddy. The food battles had me cheering on the good guys from afar. In short, I have been a fan of this story since the beginning, and that stance has not changed yet.\\n\\n\r\nAt the time of this review, the second half of this split-cour has already completed its airing, so I have another buffet to attend at some point in the near future. Until then, my stomach rumbles for the next appetizing bite out of this successful anime.\\n\\n\r\nShokugeki no Souma: San no Sara dishes out its third plate in a more-favorable-than-not fashion. While the worsening artistry harm its chances, the newer plot developments get the ball rolling again, the characters are just as interesting as ever, and the audio component has not lost its edge. Onions can cause crying, but such tears are not required here.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, as the plot heats up, this next sequel in the franchise returns to form with a familiar structure and better balance in its narrative even if the reduced ecchi and thematic elements induce desire\\n\\n\r\nArt & Animation: Fine, while the character designs and the detailed images still receive Michelin stars, movement and other visual elements worsen to a more noticeable extent than ever before\\n\\n\r\nCharacters: Good, Erina earns a much-needed morsel, Alice and similar side characters step up, Azami is a solid new antagonist, and Souma and crew round out the rest of the cast with their usual quirks\\n\\n\r\nMusic & Sound: Good, the sweet OST, VA performances, and audio elements return once again, and the OP is pretty cool, but the ED has less going for it\\n\\n\r\nEnjoyment: Good, more Erina, more of the same entertaining traits, and more to look forward to in due time\\n\\n\r\nFinal Score: 6/10",
            "date": "2018-11-15T23:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 294143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294143"
        },
        {
            "content": "Here we are with the Third Plate.\r\nShokugeki no Souma is probably the epitome of the cooking anime genre. The first two seasons were groundbreaking, with the amount of research (accurate research at that) going into it being truly phenomenal. It is a cooking anime with a true focus on cooking as an artform, and following Yukihira Souma as he grows as a chef and a person.\r\nSwitching over to the third season, at this point, in compairison to the first two seasons, it is slightly lacking. The selling point of seasons one and two were the brilliantly and comically exaggerated foodgasms that people would experience uponeating a particularly memorable dish. However, upto this point in this season, there have been no truly notable foodgasms, though the series seems to be gearing up for something major, if the last episode was anything to go by.\\n\r\nThe attention to detail is still there, And I find myself waiting for the next truly amazing foodgasm.",
            "date": "2017-11-05T14:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 262612,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/anand891996",
                "username": "anand891996"
            },
            "url": "https://myanimelist.net/reviews.php?id=262612"
        },
        {
            "content": "Disclaimer: This is a spoiler-free review on the anime \"Shokugeki no Souma: San no Sara\". Please excuse me if I make a mistake or you don't understand a part, as English is not my first language. Thank you.\r\nShokugeki no Souma: San No Sara leaves a good taste, despite its flaws\r\nI said when I evaluated the second season that Shokugeki no Souma is a franchise of pure fun, that although it is not perfect, achieves its mission: entertain and make you hungry.\r\nIn Ni no Sara the biggest problem was that a large part of the manga was summarized, giving the sensation of haste. In addition, theart decreased in quality. These technical errors also moved to the third season, as I said in my first impressions. However, as far as the script is concerned, the speed was lowered a little.\\n\\n\r\nAnd still it's a bit hasty.\\n\\n\r\nSan no Sara is slightly disappointing\\n\\n\\n\r\nThe adaptation of J.C. Staff of this popular manga has never been perfect. While the first season had a higher level in terms of animation, art and accuracy of adaptation, sinned in certain excesses in the fanservice ... even more than the manga, which is already saying a lot. In addition, it also had rhythm problems introducing long flashbacks.\\n\\n\r\nThe second sinned in the opposite, venting tomes of the manga with amazing speed for a season of only 12 episodes. That accompanied by the aforementioned decrease in technical quality. In the case of the third season, divided into two parts of 12 episodes, we still see a little fluent animation, a subpar use of the CGI and failures in the models of the characters.\\n\\n\r\nHowever, these first 12 episodes covered more reasonable ground than Ni no Sara, so from the point of view of adaptation, restraint has been resumed. Especially with the first arch, that of the Moon Banquet. There we had a well structured conflict and a satisfactory resolution was reached, but in the second the bets went up too much.\\n\\n\r\nThe introduction of Nakiri Azami turned Shokugeki no Souma to a very typical shonen, but it is an evil that also suffers the manga. One of the great strengths of this anime and manga is that Yukihira Souma is an exceptional character, both for his attitude of never giving up, and for the way he helps others improve and inspires them. His relationship with Megumi and Erina, although it has all the appearance of a typical love triangle, focuses much more on food.\\n\\n\r\nAnd more than enemies, Souma has rivals in the art of cooking, with the exception of Etsuya Eizan, who has always been a caricatured villain. On the other hand, since the entrance of Azami, history has taken a more typical route. Now if there is a confrontation between good and evil in the kitchen, that although it is embodied in the differences of culinary philosophy, it is underpinned by the pathological fear of Erina to her father.\\n\\n\r\nThis serves to raise the emotion and risk in the story, but makes Shokugeki no Souma: San no Sara, be less unique.\\n\\n\r\nThe members of the Student Council of the Elite 10 have been replaced, many new villains are introduced, whom we hardly have time to know before they are defeated. The number of shokugeki confrontations soars and suddenly the series ends, choosing as final the \"plot twist\" of the identity of Souma's father. Something that was only a secret for Azami and Erina.\\n\\n\r\nEven so, I can not say that San no Sara is bad, because it is not. The series continues to maintain its momentum and if we evaluate it as a unit, considering what has already been seen and knowing what is to come, the quality remains. Although Azami is such a classic villain, his introduction gives sense to the attitude that Erina used to have. This gives more strength to her personal change throughout history.\\n\\n\r\nSimilarly, Tsukaha Eishi, the best student of Tootsuki, is by far the best possible rival for Souma and his participation in history, although short, was very well executed. Although slightly disappointing, this third season divided in two, is still Shokugeki no Souma. It retains all the strengths of the series and remains equally entertaining and causes us the same hunger.\\n\\n\r\nI'm already waiting for spring, to see the second half or fourth season, depending on how you say it. The question is, will there be another season later or will this resume everything until the end? Considering that the manga is at its peak, Shokugeki no Souma deserves another season to have a decent closing. Meanwhile, it's a solid 7.5 for me.\\n\\n\r\nNot for nothing is one of the most popular series, always.\\n\\n\r\nSUMMARY\\n\\n\r\nShokugeki no Souma is still not as good as in his first season, but remains at the same level as his second. In addition, it serves the table for the second part of San no Sara, which promises to be better.\\n\\n\\n\\n",
            "date": "2018-02-05T14:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 270749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6887246.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CanAKATheIndigo",
                "username": "CanAKATheIndigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=270749"
        },
        {
            "content": "“You’re out of my league, first seat”  –  Yukihira Souma\r\nShokugek No Souma: San No Sara, simply put is, pure hype. You wait in anticipation every week for that 25 minute time slot where Souma takes on the elite chefs at Tohtsuki Academy with all the crazy foodgasms and each episode leaves you wanting more of this. Shokugeki No Souma, in general, makes great use of the Ecchi scenes by using them effectively and not going over the top. It’s a great combination of Shounen and Ecchi. I did like the first season the most and the second season was satisfying at theleast, but I wouldn’t say that the third season is not worth watching, though it disappointed me in a few aspects.\\n\\n\\n\\n\r\nFirst of all, the story picks up right after the “Stagiaire” and dives straight into the Moon Festival at Tohtsuki. It also introduces the Elite Ten as they play a major part for rest of the story. The Moon Festival arc is rather well paced and builds up a lot of anticipation for the rivalry between Souma and Kuga, the 8th seat, during the moon festival. I absolutely loved this arc and the eventual consequences of their “battle”. After this arc, I felt that the plot lost its edge. Enter Nakiri Azami, the main antagonist of the third season. He intends to “revolutionize” the Academy and has most of the Elite Ten backing him up. The previous director, Nakiri Senzaemon is ousted after a coup planned by the Elite Ten and Azami. This still doesn’t register with me as it doesn’t make sense that the director can be over-ruled by a bunch of students. They might be crazy god-level students, but students nonetheless. Well, whatever, as long as the story demands it. The plot is basically unrealistic after the first arc, but that doesn’t mean you will not enjoy it. It is still crazy exciting to watch the chain of shokugeki. As I said, every episode will leave you wanting for more and more of Shokugeki No Souma. The season ends with a great reveal, so I’m really thrilled for Season 4 and I hope it’s better executed.\\n\\n\\n\\n\r\nThe main cast returns for this season as well, obviously. Something I appreciate about SnS is the character development each character, however minor his/her role might be, gets. The entire cast gets their fair share of screen time and we know that they will be featured in the future episodes. Personally, I love all the characters in SnS and this season, the introduction of the Elite Ten added so many new possibilities to the on-going story. Kobayashi Rindo, the sociable second seat is probably my favorite character in the show right now. I also love Tsukasa Eishi’s character. He has a sense of supremacy over everyone else since he is aware of his vast knowledge of the ingredients and astounding ability to cook and yet he is also portrayed as pessimistic about his work and has his own insecurities. In my opinion, Eishi seems more intimidating that the primary antagonist himself. His unusual character is quite intriguing and I hope to see more of him. I did not understand what was Azami’s purpose for starting his “revolution”, but I’m sure there is a lot more to Azami’s character and it’ll be divulged next season, and that’s something I’m looking forward to.\\n\\n\r\nThe animation in this season isn’t as impressive as the first season. The shokugeki lack the intensity from the previous seasons. Even the foodgasms aren’t that appealing to the eye, but as I said, it’s Food Wars, and at this point I’ll take anything they throw at me. I’m delighted to say that the music is pleasant. The opening and endings were as good as the previous seasons and it added to the build-up.\\n\\n\r\nOn the whole, Shokugeki No Souma: San No Sara is worth watching. It won’t disappoint you, trust me. As a critic I saw a few faults but as a loyal fan of the series, I found it really gratifying. I waited patiently every week for every episode of the season, and I was left satisfied and yearning for more at the end. Even at the end of the season, I couldn’t help but think if I could jump to season four right away. It’s simply that good, at least for me it was. I’ll give this season an overall rating of 7 but if you ask me how much I enjoyed it, it’s a 9!",
            "date": "2017-12-20T21:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 265790,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6598594.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xEternalSnowx",
                "username": "xEternalSnowx"
            },
            "url": "https://myanimelist.net/reviews.php?id=265790"
        }
    ],
    [
        {
            "content": "*Minimum Spoiler Foodgasmic Review*\r\nIf you did not watch S1 or S2 then go watch them ASAP before reading this! \r\nTL;DR: This show has hype, humour, fan service, stakes getting crazy high and unexpected twists and turns all in 20 minutes. What more do you want? Oagariyo!\r\n[Story: 5/10 , Characters: 7/10, Art: 3/10, Sound: 6/10, Enjoyment: 8/10]\r\n\"I mean a new wave is coming, you know? Riding it is way more exciting\" - Rindo Kobayashi\r\nIf there is one genre that can always hype people up time after time, it's the classic shounen genre in anime. It's like scrambled eggs. The recipe is very simple yet the executionto get it consistently right day after day is difficult. Fortunately, Shokugeki no Soma - Sana no Sara somehow pulls it together to make it work for the fans albeit it's crappy plot arcs and dismal animation laziness. I guess over the top fanservice can save any show after all, provided if executed right. It's also important to note that the anime adaptation does not deviate too far from the source manga. If you enjoyed S1 a lot and felt S2 could've been better then you will surely have a table flip moment while watching S3 thinking for a manga that's widely popular and well funded, why the hell can't they pour money into it to do justice this show deserves.  \\n\\n\r\nThe story is alright, not too complicated but just slightly predictable. It's wise to watch the OVA before watching this so you have a back story on who the Elite 10s are. Although the first arc, Moon Festival, is really well done with it's pacing and plot development; the second arc, Central, is just one unrealistic & ridiculous plot line where nothing makes sense but it's enjoyable to watch since it's a chain of shokugeki after shokugeki tossed in with delicious fanservice to quench viewers' thirst. However, don't worry too much. You will always start watching every episode with a big grin and end the episode with even a bigger grin, because, you know why. It is sad that the season ends midway to the central arc with one huge reveal but maybe next season's plot would be better executed. \\n\\n\r\n\"Come at me with all your might you pretentious elite bastard. Or do you want to have a convenient excuse for when you lose?\" - Kurokiba Ryou\\n\\n\r\nThe best part about SnS is that even though it has a huge cast, it somehow manages to make everyone useful. You actually care about the cast since you know sooner or later they will have screen time along with some purpose, even if it is moaning in pure orgasmic pleasure. Purpose is purpose. The main cast returns once again since no one really dies in the show. Moreover, finding out who the Elite 10 are quite exciting. They presented them in the best way possible. Plus, as the show goes on, you get to see why they really are the Elite 10 through their cooking methods & knowledge of food, they outclass the regulars at the academy, especially, Eishi Tsukasa, the first seat. Despite being the best student with his immaculate cooking and speed, he still has his own insecurities and deals with anxiety like everyone else. Though it is exaggerated at times, but it makes him more human than most characters. The major villain is of course, Azami. Although, his villainous purpose makes no sense. However he is a villain and that's all that matters. He just wants people to eat gourmet food. Aside from Soma, Erina, Elite 10s and Azami, the side characters get their deserved screen time to showcase how much they have developed over the season. Notably, Alice and Ryou really stands out in this series as their development have the most impact to the plot.  \\n\\n\r\n\"There is a profound difference between the abilities of those who are the Elite Ten and those who are not\" - Eishi Tsukasa\\n\\n\r\nAside from the linear driven plot and dynamic characters, this show really fell flat in its animation quality. It feels as the season progresses, the budget invested in the quality of animation drops. Compared to the battle scenes of first season to battle scenes in this season, there is significant evidence of animation laziness. Even the fan service is lacking in that oomph that season 1 had with their gregarious cloth explosions to just mere still images of the characters in barely any garments moaning in the background. This isn't what the viewers want. Give them what they want. Regardless, of the poor animation quality, at least the background music was decent enough with the OP and ED being pretty good like previous seasons. The major saving grace had to be the seiyuus. They did a phenomenal job, especially Erina's new voice actor. She was able to fill the void left from her previous voice actor. \\n\\n\r\n\"You can never achieve such a world of flavour just by slapping on bacon onto salmon!\" - Kurokiba Ryou \\n\\n\r\nOverall, SnS S3 is a good enough ecchi shounen anime about food that is worth watching. I think at this point, the people who are watching S3 are the dedicated fans, myself included. So even if they skimp out on the budget and pacing of the plot with subpar character development of a star studded character line, people will still enjoy binging this show. Ultimately, it's not a bad show. If one were to compare the different seasons to get a better idea of how this season is, then S1 is gourmet food, S2 is home-cooked food and S3 is just street food. It's still enjoyable to eat but just a bit unhealthy. Also Season 4 has been confirmed. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Osomatsu!!!\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!\\n",
            "date": "2017-12-19T11:10:00+00:00",
            "helpful_count": 80,
            "mal_id": 265604,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=265604"
        },
        {
            "content": "The 3rd season of Shokugeki leaves something to be desired in every way.\r\nJ.C.Staff's adaption of this manga series has never been masterful. For the most part it has been just phoned in. The spottiness of the animation, ugly CGI and off-model characters have always been somewhat present in this series, but the 3rd season marks a turn for the worse even when compared to the previous 2nd season. \r\nUsing manga panels directly as a storyboard and making sure the female characters' boobs look like they are about to burst from their uniforms worked fine for the first season, because that's when the writing and theplot was immaculate. This isn't so much the case with 3rd season. Even though the first arc has a very nicely structured conflict with a satisfying resolution, the following major arc that covers the rest of the episodes ramps up the action in a worst way possible, and goes almost full shounentard. As I had read the manga before diving into the animation this time around, I was hoping for J.C.Staff to salvage the plot and place emphasis on the elements which worked - which is the opposite of what they did do.\\n\\n\r\nWhat made the first season of Shokugeki good, anyway? The characters, and both their *intrapersonal* and interpersonal struggles. Souma's ability to rise to the challenge and help the people around him do the same made him a superb character. The interactions between him and Megumi were especially crucial, giving the viewers catharsis shockwaves. The people found their inner strength, and the (romantic) tensions between Souma and Erina kept us praying for more development. The slower passages gave the long season a much better flow. (minor spoilers starting now:)\\n\\n\r\nThe introduction of a \"classical\" villain and a conflict which is fought between two factions ruins all these intricacies in the 3rd season. Especially the middle section of this season feels like an endless stream of boring shokugeki. There are too many new bad guys and not enough interest in the stakes from my part. The dramatic tension of the whole series is undermined by the illogical motives of both the villain and the supporting faction. It's impossible to come up with reasons for as to why half of the top ten seats voted to place Azami as the director of Tootsuki. The fact they did do so pigeonholes these characters and the rest of the supporting forces, as their motivations have to be justified somehow down the line, even though that's impossible. \\n\\n\r\nBasically, the biggest plot twist of the entire series is a spectacular asspull.\\n\\n\r\nThe problems of the manga's plot are heightened by the fact that all the anime does is ramp up the tension, throwing caution out of the window. The sound design of this season is surprisingly stark. There are a variety of dramatic scores which are played surprisingly loud during shokugeki and otherwise. There are numerous instances where the director has decided to use montages and flashbacks to really try to bring out the feels out of the viewer. I was taken aback by how disconnected I felt from the story, even compared to my reading experience. The anime would have benefitted from downplaying the action and giving the characters more air to breath.\\n\\n\r\nSo why is this anime even good, then? The third season has still a lot of momentum and strong characters backing it up. Even though the plot is a little contrived, the development between Erina and her father is still very enjoyable. That’s all that matters and all that the conflict should really be about – resolving Erina’s literal daddy issues. Even though Erina’s payoff scenes were handled without much directional finesse, they still made the show worthwile. Additionally, even though Azami leaves something to be desired as the bad guy for the series, the first seat, Tsukasa Eishi, works much better as an opponent for Souma. If there’s something good to be said about the factions and the entire conflict, it would be the emergence of tension between these two characters.\\n\\n\r\nThe final verdict? Well, the animation is spotty, the sound design is crap, the CGI is fugly, directing is unimaginative, and emphasis has been placed on the wrong things. But it’s still god damn Shokugeki no Souma. It’s impossible to ruin the entire franchise at this point. I had fun times watching this season, and I’m hungry for the 2nd cour.",
            "date": "2017-12-19T02:57:00+00:00",
            "helpful_count": 64,
            "mal_id": 265568,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4243495.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Tiemuuu",
                "username": "Tiemuuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=265568"
        },
        {
            "content": "I just finished the series and i was amazed. In my opinion this is the best season so far and i think that it is my favourite show now. The story in this season was pretty unpredictable yet i would call it amazing. The Shokugekis were extremely intense and i was always excited how it turns out because as i mentioned before it is pretty unpredictable although the outcome is guessable. I love that the elite ten were intrduced and even a bit of their characters has been mentioned. I dont want to spoiler anything so i wont tell much but the ending where erinagets a certain information and everything seems connected now i love the show so much more.\\n\r\nIt is unavoidable to watch this!\\n\\n\r\nPerfect season!",
            "date": "2017-12-19T12:14:00+00:00",
            "helpful_count": 53,
            "mal_id": 265617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6654060.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Wurzelsepp",
                "username": "Wurzelsepp"
            },
            "url": "https://myanimelist.net/reviews.php?id=265617"
        },
        {
            "content": "So what's the big premise of this show? ... to just watch the same happen over and over again? Souma has been winning so many matches lately, and yet it's almost like nothing happens. 3 seasons in, and yet they keep introducing all kinds of \r\ntournaments, where the winner, gets nothing in exchange. The fanservice keeps being the same, every reaction keeps being the same. To be honest, the food gets more development than the actual characters, it's strange. As far as this goes, this one cour has the be the worst of them all, with no progress in the story, and rather, it's filledwith nonsense to sell more. \\n\\n\r\nThe big idea: Souma wants to enter the Elite Ten. How is he going to do it?: No idea, 3 seasons in and nothing has happened. When is he going to do it?: Again 3 seasons in, but apparently seeing people excited and being almost nude because of food seems more interested than the actual \"plot\", if you can call that a plot.\\n\\n\r\nStory-wise, not much here, in any case, this has been been the worst season of them all. The only big thing is Souma fighting for the place he lives in. After that (And before that) it's a rollercoaster of nonsense, all of these together with no explanation of the actions of some characters, leaving you without 0 clues, so you end up not knowing anything. It's a joke. While this one was 12 episodes it felt like reading the 3 first chapters of a manga. Almost 4 episodes contained what 1 chapter of manga could have, it was slow pased leaving a lot of cliffhangers in the end, so in the next episode they keep doing the same. So, repeat this 2 more times and you are done.\\n\\n\r\nAt least this part's art was better than the so garbage part 2. Not to sound rude of course, but the lack of quality in animation has always been part of this show, only concentrating on making face expresions look ridiculously weird and making girls excited from eating. Leaving behind any proper proprortions of the body, leaving behind all the work the Manga creator has put into it, just so the fanservice can take over it. (w) \\n\\n\r\nSound: I guess it was decent. There isn't anything remarkable at this point, everything seems in place, from the OP to the ED, to Background sounds and music to voice acting. Like previous season, they knew how to remix their music so they don't overlap over the voices. But they forgot that not everything is music, they are using a weird amount of music in every episode it gets annoying, and not exciting as i'm guessing they want it to be.\\n\\n\r\nCharacter: Again, they keep introducing characters that seem quite interesting, just so they get defeated in some sort of Shokugeki and never appear again. While the main characters have already been developed, it seems they don't care about anyone else.\\n\\n\r\nEnjoyment: Not best experience i've had, i could've dropped the series in the middle, but i decided to continue... i ended regreting not dropping it. It seriously feels like a joke, rather than a \"cooking\" show. Where's the progress? Oh, I see.\\n\\n\r\n3/10.",
            "date": "2018-02-22T14:00:00+00:00",
            "helpful_count": 34,
            "mal_id": 272196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5782169.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shiraishiku",
                "username": "Shiraishiku"
            },
            "url": "https://myanimelist.net/reviews.php?id=272196"
        },
        {
            "content": "Shokugeki is... A cooking battle shonen. For me some shows will always be defined by their premise, and this is certainly one of them. Gintama is historical science fiction comedy. Mushishi is supernatural hiking. And this is Chopped ramped alllll the way up to 11. The best part about this, is that the show knows it is, and consequently pours its all into being exactly what it is: a carousel of mouth watering food, excessive dinner-induced fanservice, and quirky, plucky characters.\r\nTo be honest there's not much more to say about this next installment in the series. The plot is advancing closer to the point we'vebeen waiting for since the beginning of season one, the animation remains solid all around and beautiful when it comes to food, the characters are continuing their bits of growth while maintaining most of the running gags, and its an absolute blast to watch. And that lack of excess fat might be why its so darn entertaining, and a tie back to my first point: this show knows exactly what it is, and it does exactly that at a consistently high level. its self assured, and that's what keeps its edge.\\n\\n\r\nIts sharpest point outside the premise comes in the form of its characters. The show as a whole contains a large cast list, and the vast majority of these people are not only given backstories, but evolve alongside the main character. The show desperately needs this to compensate for the lack of true action scenes one would typically associate with the genre, and it does so with aplomb. Accomplishing the balancing act of having a true main character while still developing other pieces is one that few shows attempt, and even fewer pull off to the extent Shokugeki continues to.\\n\\n\r\nIn short, this is not the deepest anime. But it keeps an ever expanding, colorful cast, an endearing main character, some incredible sounding food, and is conceptually an inventive spin on the standard shounen anime. An absolute blast!",
            "date": "2017-10-30T18:29:00+00:00",
            "helpful_count": 25,
            "mal_id": 262143,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5430414.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/joschmo11",
                "username": "joschmo11"
            },
            "url": "https://myanimelist.net/reviews.php?id=262143"
        },
        {
            "content": "Story wise, there is one main story, subdivided into arcs (seasons), subdivided into events. Events can be 1 episode or a couple. \r\nWith some anime you feel like wanting to skip to the end of the story just to know how it finishes, however, Shokugeki no Souma keeps me fixated to the screen the entire time. When the episode is finished, I am thinking 'already finished?' that was like 5 minutes max'. It just sucks you in.\r\nI personally like cooking, but this anime is so much more than that. It is like Hyaku (I expect) or Diamond no Ace. The story is about a subject,but subplots and characters make it great. Also the side-characters add to the plot and are not just annoying.\\n\\n\r\nThe sound, the art and everything else support each other resulting in a great anime.\\n",
            "date": "2017-11-25T03:03:00+00:00",
            "helpful_count": 14,
            "mal_id": 263908,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3045127.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mythicism",
                "username": "Mythicism"
            },
            "url": "https://myanimelist.net/reviews.php?id=263908"
        },
        {
            "content": "Another Shokugeki no Souma season has ended, so my review with no more adieu:\r\nMediocre 5, Story:\r\nSo far nothing has change from its plot it's same old same old master chef or a Hell's Kitchen kind of thing regardless as to whom the protagonist faces, so let's be honest here, this ain't about them Tostsuki competitors, this just all about food porn with lots of exaggerated pizzazz's and nothing else. I'll have a spicy steam bun pls......\r\nArt 7, Good:\r\nOk so there were some changes in the art, but then again, it's good cu'z there some good fanservices that has just been added in this 3rd sequel,and no longer regulated to just one individual, unlike in the 2 previous season where we don't get to see some panty flashes nor underwear fanservice in the 1st season , in the 2nd season it all on Ryoko, now it is with anyone who's feeling the ecstasy of tasting food and in the bathroom scene with Erina changing with her lesbian lackey Arato and also with Alice when she is stepping on Ryou's shoulder. I'll have a Mafu Tufo pls......   \\n\\n\r\nMediocre 5, Sound:\\n\\n\r\nIt doesn't matter if Taneda Risa isn't doing Erina's voice anymore, as long as it's the same seiyuu who does the voices of the usual character.\\n\\n\\n\r\nMediocre 5, Character: \\n\\n\r\nSo them Top 10 seats were now the Central, thanks to the new boss in town who also happens to be Erina's dreaded daddy Azami Nakiri, ok so now Erina has to run away and live with them Polar Star people whom she sees them as the lower tribe under the totem pole, but ya know it was kinda funny that she has to work her ass by using her so called \"God's Tongue\"  as a food taster for the tenant living in it, thought she wasn't forced into doing it, but the good thing was it did paid up as them Polar Star people started to win in the shokugeki against them Centrals. Even so, it was still the usual characters and not even the adding of the 10 seats and the Centrals would make any difference at all since it is the same Souma, the same Erina, the same Megumi and so on and so forth. Can I have some desert?  \\n\\n\\n\r\nMediocre 5, Enjoyment:\\n\\n\r\nAs I've watched the first two season of this franchise, my enthusiasm has gone from with gusto for the season one to not bad for season 2 and now it's basically this again, to simply put it, part of me feels like watching this is as a chore but part of me feels like why not 3rd in row kind of thing. I'll have a venison steak pls \\n\\n\r\nMediocre 5, Overall:\\n\\n\r\nWell, I have mixed feelings about this 3rd sequel and to end it in a cliffhanger, ain't that bad, but, I still feel like that watching the up coming sequel would be just too boring even if it is still yet to be aired. Then again, depending on how it goes , things might look up....I still don't get why Souma still wears his old middle school uniform instead of donning the Totsuki official uniform. Check pls.........\\n\\n\\n\r\nKeep the change.......  \\n\\n\\n\\n",
            "date": "2017-12-21T11:02:00+00:00",
            "helpful_count": 10,
            "mal_id": 265849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=265849"
        },
        {
            "content": "The problem with shows like this one is they inspire such blind devotion that people overlook its glaring flaws. I'll admit right now that I love this show, and although I'm enjoying this season, there are quite a few things that bother me.\r\nThe plot this season is definitely uping the stakes compared to previous seasons. It is quite enthralling but is also frustratingly flawed. There are of course all of the instances of the main character being unnaturally successful at everything he does, but like whatever. What bothers me is all the moments where I'm just awestruck as things that shouldn't and can't happen ina realistic world shape the events of the story. The main conflict in this season stems from such an occurrence.\\n\\n\r\nThe budget for this show has unfortunately tanked hard. The animation is just SOOOOO unbelievably lazy. Everything is flash, they overuse all the lazy anime tactics: switching to a goofy, super cartoony animation in order to make animating easier, rarely showing legs while people walk, frequently focusing on still images, animating almost nothing on the character but their mouth. They've even removed nearly all of the elaborate visual foodgasm metaphors. The sound is just normal anime sound, decent voice acting, basic anime music and sound effect. Is whatever.\\n\\n\r\nYou know the characters by now, or at least the main ones. There has been a good number of them up until this point. That's why they decided to add like 20 new characters, whose names you'll never learn, as regulars on the roster. I hate when shows do this. Ya, it keeps things interesting, but like in the same way that starting a new anime and watching the first 4ish episodes before doing the same thing again, keeps things interesting. I like many of the characters they introduced up until this point which is unfortunate because now there are so many characters that I don't get to see the few I like. Additionally all, and I mean ALL of the characters in this show are SUPER tropes, so get ready for that.\\n\\n\r\nLuckily this show is super enjoyable, otherwise, there'd be no redeeming it. The fact that they managed to make such a crappy, lazy season like this and still make it enjoyable is astonishing. It is however not nearly as good as the hype would suggest.",
            "date": "2017-12-04T14:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 264523,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6357466.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rdeyoung8",
                "username": "rdeyoung8"
            },
            "url": "https://myanimelist.net/reviews.php?id=264523"
        },
        {
            "content": "This review will be short and simple.\r\nStory: 10/10\r\nArt: 10/10\r\nSound: 8/10\r\nCharacter: 10/10\r\nEnjoyment: 10/10\r\nI love nearly everything about this anime, the character development, the humor, art-style and plot.\r\nThe anime overall is just simply amazing, it has everything you need in an anime.\r\nIn season one there was a problem with character development and that there basically wasn't any but since then the stories are interesting from every character and how they intertwine on how they met or how they came to be where they are now.\r\nMy one problem with the anime is the music and sound, I'm not a fan of it.\r\nI didn't notice at first but afterre-watching it the sound ruined it for me.\\n\r\nWhen someone tastes some good food the music just doesn't fit, all the way through the first season they overused this OST,\\n\r\n https://www.youtube.com/watch?v=P8fe6PsF6gU .\\n\r\nBut since season one the music has improved a lot and probably will be perfect in the future, but at this moment in the anime the sound hold it back from being faultless and perfection.\\n\\n\r\nThis is my personal favorite and many others, the reason is because it is not to far fetched and the characters are interesting. \\n\\n\r\nOverall: 9/10",
            "date": "2017-11-29T11:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 264191,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6048263.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Panda_Bates",
                "username": "Panda_Bates"
            },
            "url": "https://myanimelist.net/reviews.php?id=264191"
        },
        {
            "content": "Four things:\r\nI don't want to sound edgy and am not hating on this because it's popular. I'm being honest. I loved the first two seasons. This third season is proof that a studio can really dumb down significantly the plot/thematics and everything else and the fans will still love it to death. \r\nThis show has become as ugly as sin. At first I didn't mind the change in character design, since it made the characters look a bit older. However, it clearly shows that in basically every single shot except for detailed close-ups, the characters look significantly worse than in prior seasons. Also the animationdowngrade makes everything more of an eyesore. \\n\\n\r\nThe camera is CONSTANTLY SLIIIIIIIDING. I checked back on previous seasons for comparison and yes, the camera slid a lot back then as well. But in this season it's been put on overdrive. I'm 99.9% sure this was done as an attempt to mask the drop in animation quality. You will pretty much NEVER see a stillshot except in comical moments when a chibi style is utilized. Exceptionally irritating and lazy. \\n\\n\r\nThe overall trope showcasing the underdog/secret overdog reforming the system as well as the theme of pristine, heartless, haute cuisine v.s. personal, self expressive cooking has always been the lifeblood and undercurrent of SnS. It doesn't knock you in the head screaming in your ear that it has these themes. There was at least some subtlety to it and respected the viewer's intelligence. But in the second arc of this season, the show just shoves it front and center making the most basic, black and white scenario. The whole \"rebels\" of polar star vs Central just was beyond basic. Took away all forms of subtlety to the show's theme. Given, this is probably the manga's fault.\\n\\n\r\nOverall, I doubt things will get better at this point. The fact the show is still apparently just as popular as the prior two seasons will give the creators no incentive to bump up the standards. These complaints apply to the second half of the San no Sara season as well.",
            "date": "2018-04-24T17:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 278920,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6040311.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/yenrz1345",
                "username": "yenrz1345"
            },
            "url": "https://myanimelist.net/reviews.php?id=278920"
        },
        {
            "content": "First of all i would like to say that i´m not a native english speaker o i might have some mistekes.\r\nStory: Food wars didn´t really had a plot in the last tw seasons, it was just the clasic shonen formula of becoming the strongest in something, in this case the best cheff. It was not a problem for the  show, it could with it´s great art and animation, the epic soundtrack and the funny characters become an interesting anime to watch. Anyway, this \"formula\" was already a bit repetitive, so t was necessary to include some neew staff, the problem starts when this newstory is bad.\\n\r\nwhen Azami first appeared, i was truly interested on him. I mean, Erina had always seemed to have a secret past due to her flashbacks so I wanted to see how it was going to be developed. It was really disapointing when i realized his objective. After the chapter 5, I think it turned into a cliche story in which the main characters have to fight against the bad guys whose objectives are just being bad. I know that we dont yet know why Azami is acting as he is but the felling that i get from what a watched is that noone would do that in real life. \\n\r\nThe other aspect i would like to talk about is the inclusion of the filler characters that appeared on the last chapters. I just don´t understan how strong they are. they are much better than everyone else but they had never even been mentioned??? with them i will just pretend they don´t exist.\\n\r\nHowever there are some things that i have really liked. The fist one i the first arc os the seaon, which i conider to be teh best part of the whole serie. it is an extension of what we had already een in the other seasons but with a very good rival. Then I am interested in what could happen with yukihira´s father.\\n\\n\r\nArt: It continues with the same kind of art from the last two seasons having great character designs and pretty decent backgrounds (thinking they are almost always in a kitchen). Then, the animation is solid, i wouldn say it is bad o good anyway. Finnaly, it makes a very good job a making the meals, which look gorgeous and makes you feel hungry at every moment.\\n\\n\r\nSound: I consider the soundtrack of the fisrt season to be the best one, but this one is also preety good and the voice actors are Ok. I like a lot both the opening and ending songs, being one of my personal favourites of the year.\\n\\n\r\nCharacters: In this season he only one who recives a bit of character development is Erina, she passed from being  pride and powerful girl to become a \"princess\" who need to be saved. this is something very common on tsunderes so i wouldn´t say it is bad. Then, i have realy liked the personalitiees of the elite ten beingf pretty funny and intereesting to watch.  I´ve already talked about Azami in the story part so i won´t repeat it here.\\n\\n\r\nPersnal Enjoyment: this i a very entertinig show to watch, principaly if you like Shonens like me. I would just recomend not to expect too much abut the story and just relax and watch the show. i have really enjoyed it and I would give it a strog seven and a light eight.",
            "date": "2017-12-28T10:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 266650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635073.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Luca_Graziani",
                "username": "Luca_Graziani"
            },
            "url": "https://myanimelist.net/reviews.php?id=266650"
        },
        {
            "content": "\"Shokugeki no Souma looks stupid, it's just a story about a guy that likes to cook food\"\r\nGood god, this anime series....\r\nThe anime that made me start cooking good food other than eggs and burgers.\r\nShokugeki no Souma San no Sara showed me so much about what it takes and what is like to cook.\r\nIt's unbelievable the way they can put out such an intresting and joyful story, and combine it with the so well done music and sounds.\r\nThe time that we have waited for this season was not too long, but it was kind of painful, at least for me, in a way that I wantedso bad to continue watching and enjoying the way they make food and show it to the viewers.\\n\\n\r\nStory-10/10\\n\r\nThis season was so good, it's unvelievable how they made such good work with the adaptation, it was so good that made me rewatch some of the episodes in the same day. Its amazing the work Yuuto Tsukuda (the creator of SnS) has put into this season, it's unbelievably remarkable in every episode.\\n\\n\r\nArt-10/10\\n\r\nCouldn't ask for better design and art, fits perfectly with the theme of food.\\n\\n\r\nSound-10/10\\n\r\nUndeniably my favourite openings and theme musics of all animes that I've watched until today, every second of the opening is amazing, it spoils much even though you have no idea until the end. The ending music is amazing as well since at the end of every episode makes me smile somehow.\\n\\n\r\nCharacter-9.5/10\\n\r\nYukihira Souma--->My favoutite character in any anime because of his behaviour and sense of challenge and doesn't stay depressed after losing any match.\\n\r\nEvery othert character is so well developed, some of the times you think you know a certain character because what you saw in previous episodes, but in SnS is really intresting how they change ideas and opinions from one episode to another.\\n\\n\r\nEnjoyment-10/10\\n\r\nCouldn't enjoy more than this, it's on my top 3 for some reason, every episode makes me feel like there is so much to the anime than it looks, its exceptionally amazing how they made every episode enjoyable to this point.\\n\\n\r\nOverall-10/10\\n\r\nI can't say much more about it, it's most likely I don't have words to describe how outstanding this show is, I can only say one thing, and that is ---> Shokugeki no Souma\\n\\n\r\n*this is an edit from my other review",
            "date": "2017-12-20T17:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 265772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5879564.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChaosMeat",
                "username": "ChaosMeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=265772"
        },
        {
            "content": "Shokugeki no Souma manga is one of the best, but the anime? mehh, too many rushed and misplaced scenes, not only the minor ones, but also the crucial ones, like when souma reveal his father to azami and (unintentionally) to erina, that scene should be when the polar star dorm residences were having a party after souma defeat eizan and in the anime this scene is after souma vs tsukasa and tadokoro wins against central, WTF! the anime really ruins the manga's masterpiece, as the manga reader I find the anime really sucks! someone said to me that they need this to make a cliffhanger,the hell with that! for me it just like they want to make the anime really different from the manga, what a bad adaptation indeed!",
            "date": "2017-12-19T14:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 265628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gokuya81",
                "username": "Gokuya81"
            },
            "url": "https://myanimelist.net/reviews.php?id=265628"
        },
        {
            "content": "For those who are familliar with the manga this 3 season of Shokugeki no Souma wasn't disappointing at all and Jc Staff did a great job at adapting the source material. The main focus in this season is presenting The Elite Ten members to its audience and how their power and status influence the lives of students and hierarchy of Totsuki Academy. You will see the real meaning behind the \"Food Wars\" title in this season, a clash of ambitions, ideals and cooking styles between Totsuki and the Elite Ten members.\r\nThis season starts off great with our usual fearless  Souma who takes anyone's cookingchallenge head on  with his own style that he polished across years. I like how they connected the stuff he learned during the stagiare and autumn selections arc and used it during his confrontation with one of the Elite ten seat taking a step foward and improving his qualities as a chief at Totsuki. The battles give you a bump of adrenaline and they reduced the number of foodgasm scenes and replaced them with beautiful symbolism who is fitting for the cooking style of each character. \\n\\n\r\nThe recepies as we are used are very detailed, the food is delicious and this anime knows how to built up the tension before each match and release it at the perfect moment during the food challenge. It also showed a glimpse on how a restaurant works and the reality on the struggle to attract customers and please their needs during the moon festival arc.\\n\\n\r\nAs for the characters Erina , Alice ,Ryuu and Souma get nice development in this season. They did a good job at portraying Erina's reasons and motivations of becoming a chief and strenghten her bond with Alice . Beside our usual funny interactions between the characters we have some heartwarming moments that are perfect for your heart.They did a great job at showing Azami's  clash of ideals and ambitions with the Totsuki director and created a fitting atmosphere for his character in this series. \\n\\n\r\nIn conclusion this season stands proud and is the Shokugeki no Souma anime that we all love and enjoy watching. So if you liked the previous seasons you will love this one!\\n\\n\\n",
            "date": "2017-12-19T11:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 265612,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=265612"
        },
        {
            "content": "This, ultimately, feels like half of a complete series.\nI have long been a fan of the Food Wars series, with it's excellent character sets, great story arcs and fantastically imaginative 'battles'. Food Wars is a wonderfully funny and imaginative action series, but this is definitely the worst season yet - so far.\nFor me, Food Wars S3 falls down in two specific areas:\nFirstly, S3 doesn't seem to have the same level of competition as the other seasons. Yukihira's enemies in the previous seasons are now his friends, and the new opponents feel very lifeless and one-dimensional. Secondly, this is a really slow series, with some ofthe most infuriating cliffhangers in anime - the first and last few minutes of each episode, more often than not, are the only moments with any substance, the rest of each episode feeling really flat.\\n\\n\nFood Wars is a fantastic series. However, Season Three is the weak link. If you haven't seen it yet, it might be worth waiting until the story continues in April 2018 and binging the whole lot for a better experience.\\n",
            "date": "2018-01-20T08:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 269128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6829196.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TAYLORtCC",
                "username": "TAYLORtCC"
            },
            "url": "https://myanimelist.net/reviews.php?id=269128"
        },
        {
            "content": "STORY - 9\r\nART - 9\r\nSOUND - 9\r\nCHARACTER - 10\r\nENJOYMENT - 10\r\nTake the lid off the pot and a steam of emanating enjoyment comes out yet again in the third season of Shokugeki no Souma. The Third Plate is a cooking anime of high-stakes that delivered the same qualities that its predecessors had already achieved, bringing in more entertainment to the plates.\r\nWhat was the key difference compared to the previous seasons that this season cooked for us? It was the heavy hitters of the prodigious culinary school. The very best of the best. The biggest players. After all, the majority of the story had only focusedon the enrolled students so this change of pace was a welcome addition. Not only did it bring a realization to the existing characters, it opened up their mind into the world of professional cooking which developed a couple of characteristics. It also gave some of the most suspenseful food battles, knowing the risks and rewards in facing the upperclassmen. Another thing to see here was the skills they have accumulated over the time being together. Their support and trust towards each other goes to show their deep connections. They learned together, being able to progress with their friends and these interactions is one of the most strongest aspect of the show because of that. It served a crucial part in highlighting many of the characters or challenges during the journey. Well, enough with the seriousness and let's soak ourselves in comedy here for a bit. With the advent of new characters comes with it a bunch of different personalities that were amusing. Of course, this show wouldn't be the same without the fanservice or golden chibi comedy. There's a good balance between the transition from the important to funnier parts that just welled you up with a variety of emotions. Pure entertainment indeed.\\n\\n\r\nOn to the next part, maybe something that took a slight decline was in the art. Though it's only for a little, the use of CGI did felt a bit surprising because it was jarring. There were also scenes that had a noticeable crookedness in the character expressions. Thankfully, the visualization in the dishes were still top-notch so you better bring along a couple of foods while watching (or you'll eat through your screen). In the kitchen, you'll get a sense of how much efforts went into cooking with the smooth movements from the animation. While it's still as fluid as ever with that, for other things such as comedy, there's a lack of exaggerative action so it's not as effective as before. Something that did improved was the things related to the characters. One is the design of the new cookers which had their own charm. The second would be the voice-acting in the change of riskier atmosphere. As this time the consequences seemed a bit more closer to them, the doubt or panic within had a deeper significance. Particularly with a certain girl, I'm surprised by how much the voice can change when her hidden personality is brought out. Anyways, the soundtracks pretty much remained the same good quality, whether that'd be going side-by-side with the cuisine, tenser situations or happier scenes.\\n\\n\r\nYou can think of The Third Plate as a dish that got closer to completion as the episodes goes by. It started off with a rich base from the culmination of the two previous seasons and added in new things that changed the final flavor. There were a couple of issues with the art and animation, but the introduction of new characters and plot were effective in giving off that extra taste. In the end, the third season became an amazing food that was full of appetizing ingredients.",
            "date": "2018-01-12T08:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 268300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=268300"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nOnions taste delectable.\r\nI didn’t always believe so, though. For a long time, I avoided their presence, viewing them as a white blight upon the meals they complemented. But now? I try to get them on everything (where it makes sense). Burgers. Pizza. Tacos. Onions no longer go unwelcome but instead have won me over, earning a seat at my table any day of the week.\r\nJust as taste buds change, anime can do the same. For Shokugeki no Souma: San no Sara, some of its own changes both help and hurt what once was.\r\nSTORY\r\nThree seasons in,Shokugeki already knows itself pretty well at this point. The mixture of character comedy, hyped upsets, and a slathering of ecchi delivers unto the audience its signature brand of food-fueled fun. With Souma himself still aiming for his goal to be the best of the best, this next part in the series decides to put its skillet back on the burner as the plot heats up.\\n\\n\r\nBefore doing so, though, it goes back a bit further to its roots (and not the farm kind). Where the continued Tournament Arc bogged down the previous season to a large extent, it now channels some of the older magic which had made everything so intriguing to begin with. The story events concern less with structured cook-offs and more about these weird competitions that lead to positives and negatives within the sphere of their school.\\n\\n\r\nFor instance, Souma’s wholesome attempts during the festival demonstrate the power of a warm, handcrafted meal, and his rigged war against Eizan reflect the plight that the Polar Star Dormitory faces as the evil Central takes over. While multiple exist, these two examples highlight how the show finally remembers the meaning and the stakes behind these culinary clashes.\\n\\n\r\nMoreover, Shokugeki also strikes a better balance between these battles and its silly comedic forays. Souma and Nao may bond over their horrific concoctions, yet the off-the-books duel with Tsukasa elevates tension as fate hangs undetermined. This balance overall leads to less repetition (especially an avoidance of umami dialogue) among the events and thus a stronger sense of purpose throughout the season.\\n\\n\r\nUnfortunately, the ecchi elements are once again tuned down as the general seriousness wafting in the air prevents much in the way of over-the-top sexuality. Prominent thematic ideas also sour away as these developments commence. However, major reveals right at the conclusion make the audience yell at their waiter for seconds regardless.\\n\\n\r\nSo, despite whatever smaller shortcomings Shokugeki contains, the beginning of this third season demonstrates a return to proper form for the series, making excitement a possible item on the menu.\\n\\n\r\nART & ANIMATION\\n\\n\r\nLike most anime deep into their stories – which in this case means episodes – not a whole lot more can or even needs to be said about the presented visual flavor. Shokugeki is no different. Sort of.\\n\\n\r\nAs an appetizer, the character designs still wear their personalities, their attractiveness, and their styles front and center. Newcomers Azami and Rindou seat themselves right alongside the familiar looks of Souma, Erina, and the others. The former wraps himself in dreary, washed-out colors for an evil presence, and the latter sports a catlike appearance to capture her carefree yet sinister attitude. Some sweet designs, indeed.\\n\\n\r\nMany a detailed shot likewise make their return. The various foodstuffs are as mouthwatering as ever, and the imaginative moments as combatants live up to their respective skills keep the fun going. So, in other words, Shoukugeki has grandma’s recipe and smartly follows the ingredients for a tasty product.\\n\\n\r\nSimilar thoughts go for the actual animation. The series has never had the best movement possible when given its static shots, crazy reactions, and occasional jokey style. That all remains true still, making for the show some standard, passable levels on this front.\\n\\n\r\nThe dreaded panning camera, the stiff actions, the speedy backgrounds, and the rough CG segments, though, are now much more noticeable than ever, breaking the artistic flow to the point of concern. It could also be argued that, by now, the series shouldn’t be having these problems anymore to begin with. That it has had enough time to think about correcting or avoiding them (whether they were present or not).\\n\\n\r\nIf nothing else, even the visuals for the ending track lack appeal as they reuse clips not only from previous seasons but also from this current season. A rather clear indication that the dial has been turned down on the artistic stove.\\n\\n\r\nCHARACTERS\\n\\n\r\nWithin the start to this third season, not too much occurs personally for Souma and the other cast members. However, Shokugeki has writing and moments which back their continued quests among the foodie sphere which they call home.\\n\\n\r\nMost notably, Erina finally receives more than a morsel with some much-needed backstory to complement her difficult, arrogant personality. Her sad childhood filled with manipulation and loneliness humanizes the young woman, and her stay with the friendly people at the Polar Star Dormitory provides her with a warm atmosphere that she has never quite experienced before.\\n\\n\r\nOther side characters order up a helping of growth, too. Alice is Erina’s rival, but she is also her family, and so her heartfelt letters and her determined protection serve to add another dimension to her character. Kuga, Eizan, and Tsukasa hold spots among the top elites, and their challenges, losses, and nerves (respectively) bring about extra pep. And Subaru turns over that new leaf still when he supports Souma during the festival, putting his best foot (and food) forward.\\n\\n\r\nThe most impactful character for this season of Shokugeki, though, goes to Azami, Erina’s father and the horrible man spearheading the lamented direction the school now takes. He envisions a world where only the most exquisite delicacies exist, and anything less than perfection may as well be chuff fit only for the trash.\\n\\n\r\nAs such, he homogenizes the teachings and the courses for the students, throwing away diversity without a second thought. His antagonistic approach not only makes him a character the audience loves to hate but also explores this theme on the importance of individuality both for the characters themselves and the expressive food they create.\\n\\n\r\nOtherwise, the remainder of the cast do their thing. Souma stands up for his cherished friends while simultaneously battling those above him directly and immediately. Megumi cheers him on. Satoshi attempts to maintain stability behind-the-scenes amidst the chaos despite the threat to his seat on the upper council. They and the rest round out the show without feeling left out or forced into the proceedings for the sake of screen time.\\n\\n\r\nAll in all, the characters continue to be one of the show’s strongest aspects.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nMuch like the visual direction, the audio for this third season of Shokugeki does not change much (if at all) from its previous offerings. The voice-acting performances are as swell as always. The original soundtrack still has its rousing and homely compositions. And the various sounds as meats and as vegetables cook, alongside the usage of utensils and devices, fill the ears with a scrumptious, professional “aroma.”\\n\\n\r\nThe only major differences from this continuation come from the opening track and the ending track.\\n\\n\r\n“BRAVER” leads the audience in. Sweet drum fills and a steady guitar riff get the action going, but the vocal shifts and intensity build the fire behind this piece. Combined with its quick pace, the buildup, and the stuttering finish, it forms into a hyper-charged listen that pumps up the audience just as much as Souma when he steps into the kitchen.\\n\\n\r\n“Kyokyojitsujitsu” leads the audience out. The groovy bass tastes best within the instrumentation, but the recognizable female vocalist from nano.RIPE (the band for this song) and the slick guitar playing are no slouch overs either. Unfortunately, the total package lacks the same sense of passion and purpose as its OP counterpart.\\n\\n\r\nAlthough the ED does not have the same clout as the other music tracks, the familiar strength in the other parts of the audio direction and that new OP deliver on their promise of high execution per usual.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt’s almost always nice to see a series continue its success as it moves past its origins and into the crux of its journey. Thankfully, this anime follows this statement about as well as it can.\\n\\n\r\nPersonally speaking, I liked this season if only because Erina – as my favorite character from the show – was involved way more than last season. Plus, the setup for the betrayal by the council members, while somewhat annoying, will make for an inevitable (I presume) string of recompense once Souma and crew take them down.\\n\\n\r\nThe other parts of the anime were still fun, too. The comedic bits had me laughing. The romance hints got me all smiley and giddy. The food battles had me cheering on the good guys from afar. In short, I have been a fan of this story since the beginning, and that stance has not changed yet.\\n\\n\r\nAt the time of this review, the second half of this split-cour has already completed its airing, so I have another buffet to attend at some point in the near future. Until then, my stomach rumbles for the next appetizing bite out of this successful anime.\\n\\n\r\nShokugeki no Souma: San no Sara dishes out its third plate in a more-favorable-than-not fashion. While the worsening artistry harm its chances, the newer plot developments get the ball rolling again, the characters are just as interesting as ever, and the audio component has not lost its edge. Onions can cause crying, but such tears are not required here.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, as the plot heats up, this next sequel in the franchise returns to form with a familiar structure and better balance in its narrative even if the reduced ecchi and thematic elements induce desire\\n\\n\r\nArt & Animation: Fine, while the character designs and the detailed images still receive Michelin stars, movement and other visual elements worsen to a more noticeable extent than ever before\\n\\n\r\nCharacters: Good, Erina earns a much-needed morsel, Alice and similar side characters step up, Azami is a solid new antagonist, and Souma and crew round out the rest of the cast with their usual quirks\\n\\n\r\nMusic & Sound: Good, the sweet OST, VA performances, and audio elements return once again, and the OP is pretty cool, but the ED has less going for it\\n\\n\r\nEnjoyment: Good, more Erina, more of the same entertaining traits, and more to look forward to in due time\\n\\n\r\nFinal Score: 6/10",
            "date": "2018-11-15T23:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 294143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294143"
        },
        {
            "content": "Here we are with the Third Plate.\r\nShokugeki no Souma is probably the epitome of the cooking anime genre. The first two seasons were groundbreaking, with the amount of research (accurate research at that) going into it being truly phenomenal. It is a cooking anime with a true focus on cooking as an artform, and following Yukihira Souma as he grows as a chef and a person.\r\nSwitching over to the third season, at this point, in compairison to the first two seasons, it is slightly lacking. The selling point of seasons one and two were the brilliantly and comically exaggerated foodgasms that people would experience uponeating a particularly memorable dish. However, upto this point in this season, there have been no truly notable foodgasms, though the series seems to be gearing up for something major, if the last episode was anything to go by.\\n\r\nThe attention to detail is still there, And I find myself waiting for the next truly amazing foodgasm.",
            "date": "2017-11-05T14:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 262612,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/anand891996",
                "username": "anand891996"
            },
            "url": "https://myanimelist.net/reviews.php?id=262612"
        },
        {
            "content": "Disclaimer: This is a spoiler-free review on the anime \"Shokugeki no Souma: San no Sara\". Please excuse me if I make a mistake or you don't understand a part, as English is not my first language. Thank you.\r\nShokugeki no Souma: San No Sara leaves a good taste, despite its flaws\r\nI said when I evaluated the second season that Shokugeki no Souma is a franchise of pure fun, that although it is not perfect, achieves its mission: entertain and make you hungry.\r\nIn Ni no Sara the biggest problem was that a large part of the manga was summarized, giving the sensation of haste. In addition, theart decreased in quality. These technical errors also moved to the third season, as I said in my first impressions. However, as far as the script is concerned, the speed was lowered a little.\\n\\n\r\nAnd still it's a bit hasty.\\n\\n\r\nSan no Sara is slightly disappointing\\n\\n\\n\r\nThe adaptation of J.C. Staff of this popular manga has never been perfect. While the first season had a higher level in terms of animation, art and accuracy of adaptation, sinned in certain excesses in the fanservice ... even more than the manga, which is already saying a lot. In addition, it also had rhythm problems introducing long flashbacks.\\n\\n\r\nThe second sinned in the opposite, venting tomes of the manga with amazing speed for a season of only 12 episodes. That accompanied by the aforementioned decrease in technical quality. In the case of the third season, divided into two parts of 12 episodes, we still see a little fluent animation, a subpar use of the CGI and failures in the models of the characters.\\n\\n\r\nHowever, these first 12 episodes covered more reasonable ground than Ni no Sara, so from the point of view of adaptation, restraint has been resumed. Especially with the first arch, that of the Moon Banquet. There we had a well structured conflict and a satisfactory resolution was reached, but in the second the bets went up too much.\\n\\n\r\nThe introduction of Nakiri Azami turned Shokugeki no Souma to a very typical shonen, but it is an evil that also suffers the manga. One of the great strengths of this anime and manga is that Yukihira Souma is an exceptional character, both for his attitude of never giving up, and for the way he helps others improve and inspires them. His relationship with Megumi and Erina, although it has all the appearance of a typical love triangle, focuses much more on food.\\n\\n\r\nAnd more than enemies, Souma has rivals in the art of cooking, with the exception of Etsuya Eizan, who has always been a caricatured villain. On the other hand, since the entrance of Azami, history has taken a more typical route. Now if there is a confrontation between good and evil in the kitchen, that although it is embodied in the differences of culinary philosophy, it is underpinned by the pathological fear of Erina to her father.\\n\\n\r\nThis serves to raise the emotion and risk in the story, but makes Shokugeki no Souma: San no Sara, be less unique.\\n\\n\r\nThe members of the Student Council of the Elite 10 have been replaced, many new villains are introduced, whom we hardly have time to know before they are defeated. The number of shokugeki confrontations soars and suddenly the series ends, choosing as final the \"plot twist\" of the identity of Souma's father. Something that was only a secret for Azami and Erina.\\n\\n\r\nEven so, I can not say that San no Sara is bad, because it is not. The series continues to maintain its momentum and if we evaluate it as a unit, considering what has already been seen and knowing what is to come, the quality remains. Although Azami is such a classic villain, his introduction gives sense to the attitude that Erina used to have. This gives more strength to her personal change throughout history.\\n\\n\r\nSimilarly, Tsukaha Eishi, the best student of Tootsuki, is by far the best possible rival for Souma and his participation in history, although short, was very well executed. Although slightly disappointing, this third season divided in two, is still Shokugeki no Souma. It retains all the strengths of the series and remains equally entertaining and causes us the same hunger.\\n\\n\r\nI'm already waiting for spring, to see the second half or fourth season, depending on how you say it. The question is, will there be another season later or will this resume everything until the end? Considering that the manga is at its peak, Shokugeki no Souma deserves another season to have a decent closing. Meanwhile, it's a solid 7.5 for me.\\n\\n\r\nNot for nothing is one of the most popular series, always.\\n\\n\r\nSUMMARY\\n\\n\r\nShokugeki no Souma is still not as good as in his first season, but remains at the same level as his second. In addition, it serves the table for the second part of San no Sara, which promises to be better.\\n\\n\\n\\n",
            "date": "2018-02-05T14:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 270749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6887246.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CanAKATheIndigo",
                "username": "CanAKATheIndigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=270749"
        },
        {
            "content": "“You’re out of my league, first seat”  –  Yukihira Souma\r\nShokugek No Souma: San No Sara, simply put is, pure hype. You wait in anticipation every week for that 25 minute time slot where Souma takes on the elite chefs at Tohtsuki Academy with all the crazy foodgasms and each episode leaves you wanting more of this. Shokugeki No Souma, in general, makes great use of the Ecchi scenes by using them effectively and not going over the top. It’s a great combination of Shounen and Ecchi. I did like the first season the most and the second season was satisfying at theleast, but I wouldn’t say that the third season is not worth watching, though it disappointed me in a few aspects.\\n\\n\\n\\n\r\nFirst of all, the story picks up right after the “Stagiaire” and dives straight into the Moon Festival at Tohtsuki. It also introduces the Elite Ten as they play a major part for rest of the story. The Moon Festival arc is rather well paced and builds up a lot of anticipation for the rivalry between Souma and Kuga, the 8th seat, during the moon festival. I absolutely loved this arc and the eventual consequences of their “battle”. After this arc, I felt that the plot lost its edge. Enter Nakiri Azami, the main antagonist of the third season. He intends to “revolutionize” the Academy and has most of the Elite Ten backing him up. The previous director, Nakiri Senzaemon is ousted after a coup planned by the Elite Ten and Azami. This still doesn’t register with me as it doesn’t make sense that the director can be over-ruled by a bunch of students. They might be crazy god-level students, but students nonetheless. Well, whatever, as long as the story demands it. The plot is basically unrealistic after the first arc, but that doesn’t mean you will not enjoy it. It is still crazy exciting to watch the chain of shokugeki. As I said, every episode will leave you wanting for more and more of Shokugeki No Souma. The season ends with a great reveal, so I’m really thrilled for Season 4 and I hope it’s better executed.\\n\\n\\n\\n\r\nThe main cast returns for this season as well, obviously. Something I appreciate about SnS is the character development each character, however minor his/her role might be, gets. The entire cast gets their fair share of screen time and we know that they will be featured in the future episodes. Personally, I love all the characters in SnS and this season, the introduction of the Elite Ten added so many new possibilities to the on-going story. Kobayashi Rindo, the sociable second seat is probably my favorite character in the show right now. I also love Tsukasa Eishi’s character. He has a sense of supremacy over everyone else since he is aware of his vast knowledge of the ingredients and astounding ability to cook and yet he is also portrayed as pessimistic about his work and has his own insecurities. In my opinion, Eishi seems more intimidating that the primary antagonist himself. His unusual character is quite intriguing and I hope to see more of him. I did not understand what was Azami’s purpose for starting his “revolution”, but I’m sure there is a lot more to Azami’s character and it’ll be divulged next season, and that’s something I’m looking forward to.\\n\\n\r\nThe animation in this season isn’t as impressive as the first season. The shokugeki lack the intensity from the previous seasons. Even the foodgasms aren’t that appealing to the eye, but as I said, it’s Food Wars, and at this point I’ll take anything they throw at me. I’m delighted to say that the music is pleasant. The opening and endings were as good as the previous seasons and it added to the build-up.\\n\\n\r\nOn the whole, Shokugeki No Souma: San No Sara is worth watching. It won’t disappoint you, trust me. As a critic I saw a few faults but as a loyal fan of the series, I found it really gratifying. I waited patiently every week for every episode of the season, and I was left satisfied and yearning for more at the end. Even at the end of the season, I couldn’t help but think if I could jump to season four right away. It’s simply that good, at least for me it was. I’ll give this season an overall rating of 7 but if you ask me how much I enjoyed it, it’s a 9!",
            "date": "2017-12-20T21:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 265790,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6598594.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xEternalSnowx",
                "username": "xEternalSnowx"
            },
            "url": "https://myanimelist.net/reviews.php?id=265790"
        }
    ],
    [
        {
            "content": "Good god, this anime series....\r\nThe anime that made me start cooking good food other than eggs and burgers.\r\nShokugeki no souma is just so amazing, it's only been 4 episodes and they look so good, that all of them made me smile of enjoyment like it was nothing.\r\nIt's unbelievable the way they can put out such an intresting and joyful story, and combine it with the so well done music and sounds.\r\nThe time that we have waited for this season was not too long, but it was kind of painful, at least for me, in a way that I wanted so bad to continue watching andenjoying the way they make food and show it to the viewers.\\n\r\nThe first episode was so refreshing, really made me feel like it has been so long since I last watched season 2, with the opening, the animation, the sound, and above all else, THE FOOD !\\n\r\nEpisode 2 and 3 showed a little bit more what Souma wanted and we were waiting for the beast to come out of his den !\\n\r\nEpisode 4 was so astounding, I won't spoil, but in the end of the episode, if you are like me, you will have that huge smile coming out of enjoyment.\\n\\n\r\nThis is my new blog it about the most intellectual anime charaters. You will find your idol in this post\\n\r\n[topanimecharacters.blogspot.com/2017/12/top-20-most-intellectual-anime.html]",
            "date": "2017-12-17T18:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 265455,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jeanna_Asher",
                "username": "Jeanna_Asher"
            },
            "url": "https://myanimelist.net/reviews.php?id=265455"
        },
        {
            "content": "I believe no one needs an intro to this anime anymore since this is the 3rd season. And with the sequel for season 3 on air now, i believe everyone is SUPER HYPED WATCHING IT because i know i do! In order to commemorate the airing second course, let's continue reviewing season 3! The Prequel to a Storm\r\nFor those who have read my previous reviews on the series, you all should know i am a HUGE fan of this show and i have explained why that is in those reviews. For season 3, the hype is no less than the previous season, if not more.Season 3 of Shokugeki no soma lets us dive deeper into the Totsuki Culture and the mysteriously eluded Elite ten as well as introduce the prelude to the BIGGEST arc of the series, and most probably the best one! \\n\\n\r\n[HEAVY SPOILERS] Proceed with caution\\n\\n\r\nStory : 9 / 10 \\n\\n\r\nThe story this time around is highly anticipated, especially for those who have not read the manga. This is because the entirety of the story is like a dive into the deep sea of mystery that is the Elite ten, and the beginning of a major arc of course! The story opens up with another traditional Totsuki Culture that is the Totsuki Festival! (Name validation required). Aside from the very interesting way of how the festival is ran and organized (the different levels of district, club stalls and food served), the real highlight of this is the challenge that Some has extended to Kuga. This is one of the more indirect challenges that has happened in Shokugeki no soma. While the previous battles had all been conducted in a Shokugeki. This indirect battle is actually spanned over the course of a few days. I find this very interesting as not only does it offer a fresh new perspective of battle. It also shows in detail of how Soma overcame the difficulty of matching an Elite ten member despite his inexperience in the festival field compared to Kuga who has dominated the field before. The process and determination of Soma to create a winning platform with a simple stall and innovative idea is overwhelmingly incredible. Not to mention, the cooperation of friends and foes alike to help Soma with the success of his stall is also nice to watch. All in all, this is one of the more creative and fun arcs of the story to watch because of how different and fresh it is. \\n\\n\r\nThe transition of the end of the festival into the latter half of the story is also very smooth considering both arcs are totally opposite from one another. From a lighthearted and fun festival challenge into a deeper and darker plot. The entirety of this arc is nothing less of astounding. There are so many highlights here it's really hard to conclude how fun this arc is so i'll try to describe how fun it is as clear as i can. First up is the of course, the Elite Ten. After getting a better insight of Kuga, you are shown a demonstration of the special First Seat's skills as a chef.  Later on in the show, you can also see other elite's performance such as Eizan. That itself is already a treat on top of the already glorious food wars. \\n\\n\r\nNext up is the irony of the plot. Shortly after the 2nd arc starts, you can clearly see how much of a twist the show takes. The show revealed the darker side of the story NONE OF US has expected up to this point.  Director Azami's dark intentions with the future of Totsuki,  Erina's sad, scarring dark past, and the unlikely event that the Elite Ten approved of Nakiri Azami's election and betrayed Totsuki. Everything about the sudden change in plot is filled with interesting plotlines and hints at a very excitable fourth season in the making. \\n\\n\r\nThirdly, is the individual character's reactions during the plot itself. Confused and bewildered, some even angered at the sudden change in Totsuki, many of the students are cornered to dealing with the Purge. Each using their own ways to cope. Soma being soma of course went for the hardest route to overturn fate, Alice and Hisako (Ryo being forced) decided to rescue and protect Erina from her father. During the entirety of the Purge, you can feel and see how each student struggles against the inevitable fate. And yet, even faced with such drastic odds, decide to keep fighting for Totsuki's future. How can anyone not want to be moved by something like this!? It contained everything! Fear, Cooperations, Struggle, Trust, Courage, Determination. Everything was there and it was perfectly executed into a twist of masterpiece. And the final highlight of the second half of the show, and that is Nakiri Erina. I will elaborate more in the character section since this is more character than story related\\n\\n\r\nArt 10/10\\n\r\nHonestly, nothing i could say that haven't already been said. Creative graphics, mouth watering plates of food, side serving of ecchi. \\n\\n\r\nSound 10/10\\n\r\nOpening and soundtrack is awesome as usual. Soundtrack becomes something more to an ominous and tension filled song which complements the plot well. One major change for me is the ending animation. Not much on the song but the animation really captured me. Why? Well, the moment the ending song starts. every single plate that has been served is visually collaged and displayed. The rush of feels when seeing this is not easily described. It's like this short animation is telling you how much the show has shown us. And come on! The dishes all look visually stunning so if you aren't the sentimental type at least looking at the dishes gets your mouth watering thinking about the previous matches.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nI am honestly torn between giving it a 10 or a 5. So i decided to give it a 7 instead. See, anybody who watched this season probably knows what i'm trying to say. You might even get it if you see between the lines of what i was saying above. Basically, apart from soma and ryo, you don't really get any showcase from the returning characters! When i mean showcase, i mean that the returning characters do not get to show their skills in any of the episodes (mainly hayama, alice, takumi, tadokoro). After the intern at different shops, it'd be ecstatic to see how much the characters have grown in terms of skills just like Ryo did during his battle with central and soma during his battle with Eizan. Although you do get nice snippets of them during the festival and see them struggle to survive in the Purge, you don't actually see them cook as they did in the previous series (Season 1 preliminary matches and Season 2 official matches) . However, it is not all bad since this season is wholly focused on two different things. The plot and \\n\\n\r\nThe new characters!! That's right! With the sour one out of the way, let's talk about why we're here [apart from the story] First up, THE ELITE TEN! In the previous 2 seasons, there were scarce mentions of the Elite Ten but in this season you get to know them more, both in terms of cooking battle skills and personality quips. And both aspects were wholly entertaining. I do not even need to MENTION that we got 3 battles with the Elites this season alone!! What more can a guy ask for? To make things even more exciting, this means that next season, we won't be having any more intermission apart from the best of the best fights and plot! Imagine what the other Elite ten can do and their personalities! The second of course is the woman whom we owe the ferocity of this season to... NAKIRI ERINA! Seriously, this has got to be the biggest change in Shokugeki history. With her character growth this season, i'm actually surprised they managed to fit it in 12 episodes. From her nature as a born princess to be revealed to have such a tragic past and to turn her into a vulnerable and lost person is such a drastic change i never imagined possible in this series. Not only do you get to see her past, you also get to enjoy an innocent and new tsundere side of Erina you have never seen before! Watching her try to crawl away from her father's control and learn to live amongst other polar star students and exposed to their culture is nothing less than entertaining. It's like watching a person being reborn. It's honestly these characters that have brought season 3 to an all time high and built a great foundation for season 4!\\n\\n\r\nEnjoyment: For strict anime watchers, go for it! Please! Do it! Even if it's just for my sake! Compared to the first 2 seasons, this is like tasting Tsukasa's dish! For Manga reader like myself, you probably will be more hyped for second course like me!! But no spoilers given for that season ;)\\n",
            "date": "2018-04-23T22:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 278846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6515137.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JayJ017",
                "username": "JayJ017"
            },
            "url": "https://myanimelist.net/reviews.php?id=278846"
        },
        {
            "content": "This show brings a whole new meaning to Food Porn. \r\nAs a chef, it is inspiring and as a former student of Johnson & Wales University, it takes me back to the cutthroat grading of my chef instructors and watching classmates drop out left and right. \r\nIf you hate Ecchi anime, I can still recommend it. The adult themes are very tame for the genre.\r\nIf you love cooking or food, I would recommend 100%.\r\nI don't know how to pad this out any more. It is a show well worth watching unless you are a super prudish anorexic with an aversion to comedy.",
            "date": "2018-02-22T21:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 272217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DHawth13",
                "username": "DHawth13"
            },
            "url": "https://myanimelist.net/reviews.php?id=272217"
        },
        {
            "content": "THE REVIEW IS STRICTLY BASED ON THE ANIME AND NOT THE MANGA.\r\nI have been putting off watching this anime series for quite sometime because of the supposed eechi content. Now that i have seen it, it is not that bad. i watched 3 seasons including the OVA and i still ended up liking each season the same as its prequel.\r\ni have given this anime an overall 9 rating because of the following reasons\r\n1) The MC is a red-head- the reason is rather petty but i think a red head mc has a fresh outlook than the multi colour hair types.\r\n2) The MC is calm, cooland badass. Unlike the shounen heroes who are loud and annoying, souma has the aura that says he is a smart cookie.\\n\\n\r\n3)I love his improv and innovative cooking style that stems from down to earth yet quality ideas.\\n\\n\r\n4) The best part of the story is in totski academy way of running the show. i have come to appreciate how every day is a competition that gives each student a run for his money. the shokugeki also keeps viewers on our toes as we wonder which dish will rip asunder whose clothes.\\n\\n\r\n5) Ishiki's lack of clothes. \\n\\n\r\n6) The supporting characters do not rant too much on the nakama crap. They are pretty self reliant who do support each other without imposing their will.\\n\\n\r\n7) The humour is decent too. the aldini brothers, nikumi, erina's tsundere, they are funny. esp the way souma's face puffs up while he is trying to figure something out is so cute.\\n\\n\r\n8) While Joichiro  up and leaves like every good dad (who abandons the kid in an apartment with all amenities and who knows how the parent affords the cost), its nice to see him once in a while. \\n\\n\r\n9) Tsukasa Eishi- As a chef of his caliber, everything about him screams Elite and intimidating. he is selfish, conceited and makes no secret of it. yet his attempts at projecting himself as a lighthearted and oddly wavering person who is nervous, easily succumbing to a non existent pressure and overly unmindful of his acting pegs him as a calculating person. there is definitely more that meets the eye. you cant hate him.\\n\\n\r\nThat being said, there were a few things peculiar to the shounen genre that puts this anime right back into the average aisle.\\n\\n\r\nThe clothes rip too many times to miraculously put back together\\n\\n\r\nMC's father being a legend who is admired by anti-hero, possible love interest and friends alike.\\n\\n\r\nthe loud kurokiba ryo. its is like an anime cannot work without the loud guy.\\n\\n\r\nThe groundwork so far laid now is towards an average story revolving around a small town chef who ventures into the outside world to make a mark for himself. Somehow i feel that season 3 felt like some broken pieces were glued together just to hold up this predictable plot. While the competitions and shokugeki were the main part of the anime, the story line looks forced making joichiro's past either an important turning point or just a quintessential shounen trite that brings out some last minute ass pull. Then again, i have not read the manga and i don not know how much the anime deviated from the source material. so i can safely assume that the manga may be better.\\n\\n\r\nWhat nakiri azami is trying to do roping in the elite ten and some promising yet short lived side characters is a plot development that i saw coming miles away. the yohan leibert look alike swoops in to purge a place he believes is ill run, the next thing the MC will set things right and anti hero gets a change of heart. \\n\\n\r\non chara:\\n\\n\r\ntodokoro megumi- she is that character we either love or hate. she made no impression on me.\\n\r\nThe echi content magnifies the already revealing chara like nikumi. You hardly see her wearing more than a bikini. Or nakiri whose breasts looks like she came out of a wet t shirt contest. \\n\r\nwhile erina was just the pompous tsun, i thought Alice had much more to her personality. her dumb comedy is fun. with kurokiba, the duo has the most humour besides tsukasa.\\n\r\nAgreed that marui aka shinpachi, don club chief and cauldron witch brought some humorous scenes, all the other chara fell flat. They were necessary to the plot but the mark they made is superficial.\\n\\n\r\nsomething i noticed: perhaps its just me.\\n\r\nsome chara resemble chara art of other anime  a tad bit too much.\\n\r\nshinomiya: midorima\\n\r\ndojima: hanamichi\\n\r\nrindou: ayato sakamaki\\n\r\ntsukasa: shun, ichigo hitofuri, yashiro and some others\\n\r\nkuga: kise\\n\r\nsaiba: yomo renji\\n\r\nmomo: random loli\\n\r\ntakumi: alibaba(magi)\\n\r\nmarui:shinpachi\\n\r\nazami: yohan leibert\\n\r\neizen: aizen\\n\\n\r\ni do recommend anyone who likes fast paced anime to binge watch it. \\n\\n\\n",
            "date": "2018-01-23T07:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 269428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5500800.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/akirakishitani",
                "username": "akirakishitani"
            },
            "url": "https://myanimelist.net/reviews.php?id=269428"
        },
        {
            "content": "*THIS REVIEW CONTAINS SPOILERS*\r\nShokugeki no Soma season 1 and 2 waw a show I really enjoyed and loved.So,it was no wonder that I would definetely watch the third season.However,because of school,I decided that it woukld be best to wait until all episodes were aired and therefore binge watch it during Christmas vacations.And so I did.Here's my personal opinion about it:\r\nStory:9/10\r\nI personally find the Central Arc to be quite interesting as we will finally see some serious Shokugeki,meet the Elite Ten and generally meet the characters better.To be honest,I found the Moon Festival Arc a bit off(despite the fact that it prepares the ground for theCentral Arc).Personally,I would enjoy it more as an OVA before the third season and the episode where Soma and the others meet the Elite Ten to be put as the first episode of the thrid season.However,I still enjoyed this arc but with some doubts:\\n\r\n1)I would like Erina's father to not only appear during it but to actually cancel it.I think it would give the story some more suspense.\\n\r\n2)I would like to see some more of the Elite Ten.The Moon Festival Arc could be a great chance to learn about the Elite Ten's cooking skills,meet them as individuals and generally see some of the rest of the characters.\\n\r\n3)I would like some more Shokugekis and foodgasms.\\n\r\nPlus,the last scene was just EPIC.\\n\r\nDespite all these,however,I still enjoyed the story.The creator knows better than me,after all.\\n\\n\r\nArt:6/10\\n\r\nDuring the previous two seasons,I had not any complaints about the art,since the story and suspense were more than enough to get me going.However,during this season,I noticed some downfall in the quality of the art(especially too much chibi) and weird desings at times plus lots of scenes from previous seasons and/or episodes.\\n\\n\r\nSound:7/10\\n\r\nThe sound was nothing special,though I liked the opening theme(and the fact that all the plates from the previous seasonswere shown in the ending theme) and the voice acting.I would like more soundtracks during the episodes and maybe something new.I mean,it is the THIRD season.\\n\\n\r\nCharacter:6/10\\n\r\nTwo noticeable things about the characters here:\\n\r\n1)Erina.While I neither liked nor disliked her,I grew up to sympathize with her during this season.Her character progression is outstanding,Also,her behaviour towards Soma has changed a lot(and this is something I LOVED).Erina is living proof that you should not judge a book by its cover.\\n\r\n2)Tsukasa Eishi's character.I did not think that he was such a wallflower.Honestly,I thought he was more of the arrogant type...\\n\r\nAll the others,nothing important to notice,I guess.Only that Alice is a much softer and good person than she seems.\\n\\n\r\nEnjoyment:10/10\\n\r\nI enjoyed this season just I enjoyed the other 2.Truly outstanding in this aspect.\\n\\n\r\nOverall:9/10\\n\r\nWhile I loved the third season,I still have mixed feelings about it.It didn't have the same vibe as the others and it actually made think that \"Okay,I can live without it for a day or two\".Should you watch it?I would say yes but keep in mind that it is not the same SnS.Just my inpression,though.Last but not least,I have it a 9/10 only beacuse I think that the seond half will be better than this,since we will be in the center of the..Central Arc.I just hope that my decision to put 9 is coorect bcause either way,I would rate it around 6-7,maybe 8. After all,in my opinion,it is something you can wait to see completed,after the spring continuation of it.Well,if you cannot wait...DIG IN!\\n",
            "date": "2017-12-31T04:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 266969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5648915.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kawainoodledesu",
                "username": "kawainoodledesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266969"
        },
        {
            "content": "Picking up right where the second season (and its associated OVA) left off, Shokugeki no Souma: San no Sara continues the story of Souma, underdog student at a renowned and extremely competitive culinary academy, focusing especially on his latest ambition to challenge Totsuki's Elite Ten, a group made up of some of the school's most reputable chefs-in-training. This most recent entry in the series retains the heated cooking battles and whacky foodgasms that the franchise owes its incredible popularity to. However, unlike the seasons that preceded it, San no Sara throws in a polarizing plot development about halfway through, which shakes up the show's toneconsiderably.\\n\\n\r\nSimply put, the show's most underwhelming aspect, objectively speaking, lies in its visual presentation, notably its animation. There is very little animation to speak of, overall, considering most scenes involve panning and zooming over still images, rather than actual movement. This is a shame, especially considering the high-quality, energetic animation of its previous installments went a long way in bringing the culinary battles to life, and was, in part, what made the series so appealing in the first place.\\n\\n\r\nThe artstyle retains the same quality as the previous two seasons for the most part. During the few instances when they are depicted, landscapes are detailed and picturesque, though for the majority of the show, background art is of little consequence and barely noticeable. Character designs are still wonderfully done, being both memorable and interesting, and newcomer Rindou Kobayashi is no expection.\\n\\n\r\nThe CGI used in the first couple of episodes is quite ugly and distracting, but fortunately, plays such a minuscule role that it is relatively easy to forgive. In addition, San no Sara seems to rely on more chibi scenes than its precedessors, which could possibly indicate the same lower effort/budget as the sparse animation.\\n\\n\r\nThe first story arc in San no Sara feels like an organic continuation of the formula Shokugeki has established since its first few episodes. What this means is that we are provided with more of the fun and intensity that we have come to love and expect from the show. Souma behaves and performs just as we expect him to, his opponent is fleshed out in a way we have come to expect, and hijinks from the supporting cast are served up as well, functioning as a decent way to remind us of who they are and allowing them to interact with each other in new and entertaining ways. This introductory arc works well by playing to its strengths, while consciously refusing to go out of its way in subverting any expectations. And maybe this is necessary, as the latter arc is like nothing the show has ever done before.\\n\\n\r\nSmack dab in the middle of this third season, the show throws in a plot twist that shakes the very foundation of Shokugeki. Likely, this unexpected development will prove divisive amongst fans of the series, as it brings with it a wide array of strong changes to the formula.\\n\\n\r\nFor one, it leads to the emergence of a \"main villain\" of sorts, something which is quite typical for a shounen anime. Which is why the very idea may leave a bitter taste in some viewers' mouths, especially those who appreciated Shokugeki's refreshing new take on the genre, devoid of any big bads, and black-and-white depictions of morality. It also doesn't help that said main antagonist comes off quite one-dimensional, defined almost entirely by his cruelty and wickedness.\\n\\n\r\nWhile the development serves to weaken the series' innovative approach to redefining shounen anime, forcing it closer and closer to conforming to more and more tired clichés, it isn't all bad. On the bright side, the shift does a great job of igniting Erina's character development, and causes a large portion of the cast to band together, which is incredibly satisfying to watch after getting to know them over the span of so many episodes.\\n\\n\r\nSpeaking of the cast, it continues to shine through as the show's strongest asset. Souma continues to be a fantastic protagonist, balancing goofiness and badassery incredibly well, and working well as a foil to the snooty, elitist students of Totsuki Academy. After Souma, the majority of San no Sara's focus is on Erina, who receives a lion's share of the character development this season and becomes increasingly more likeable and easy to root for.\\n\\n\r\nAmongst the newly-introduced characters, Rindou Kobayashi is a standout, being equal parts mischievous and endearing. Though her role is relatively small, she leaves quite a lasting impression and will hopefully become more prominent in later seasons. Tsukasa also works well as a contrast to Souma, personality-wise, and an antagonistic force, cooking-wise. The most disappointing of the newer characters is, without a doubt, Azami, who functions more as a plot device than a fleshed-out character.\\n\\n\r\nFor a twelve-episode season, San no Sara also does a decent job of giving its supporting cast small moments here and there. The banding together that occurs in the latter half of the season provides an opportunity for generally-shunned characters to get some lines and interactions in before they completely disappear from the limelight. Given the considerable size of the cast and limited time to work with, the show's ability to fit this in is quite commendable.\\n\\n\r\nIn its third season, the wildly popular cooking series significantly deviates from its own status quo in a number of ways. Animation is underwhelmingly sparse, the visual variety can be distracting and questionable at times, and a controversial plot development at its midway point leaves a polarizing mark on the franchise as a whole.\\n\\n\r\nAt its heart, however, it still retains its charm, high-octane culinary showdowns, and incredibly likeable and memorable cast. On top of all that, it goes out with a bang thanks to a well-executed (and long-awaited) reveal in its final moments, which will make the wait until the fourth season even harder to endure. Overall, San no Sara still manages to hold up as a strong entry, thanks mostly to it recognizing its own strengths and keeping them at its core, even in light of its visual presentation and sudden plot twist, which are, at best, mixed bags.",
            "date": "2017-12-26T20:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 266494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4543813.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Edward979797",
                "username": "Edward979797"
            },
            "url": "https://myanimelist.net/reviews.php?id=266494"
        },
        {
            "content": "TL;DR This review is split into 3 paragraphs\r\n1st paragraph= opinions for people who have never watched the show\r\n2nd paragraph= opinions as a sequel\r\n3rd paragraph= opinions as an adaptation of the manga\r\nAs a starting point for newcomers this season left a lot to be desired. A vast amount of characters are introduced to the season's detriment as the number of supporting characters already meant that some were struggling to stay relevant. This coupled with very few lasting effects from the final battle of two of the three story arcs leaves the season very disappointing. Compared to the stakes or tension of the fights from previous seasons,the fights this season felt like they were filler to the much heavier and darker story unfolding in the background. I highly recommend you watch the previous seasons before this one or at the very least watch the ending song fully as I feel like it recaps the story so far decently enough. That being said, why is anyone watching a show starting at its third season?\\n\\n\r\nAs a sequel, this season felt like a lot of set up for what is to come, feeling more like a interlude rather than an actual continuation, like a calm before the storm. Hopefully the next season will provide the pay off for all the investment put in this season. The music for this season is by far the best the series has had, the OP perfectly captures feeling of the series and the themes of the season, accompanied by visuals that hint at whats to happen in the season without spoiling anything. The ED feels like a tribute to the previous seasons with its farewell sounding lyrics and visuals of every dish ever made in the series and highlight scenes of the previous seasons.\\n\\n\r\nAs someone who knows what is to come, this season is everything I expected, I was a little disappointed with the 12 episode length but with the next season coming out 3 months from now instead of a year I can wait for the next season. The season adapted the source material faithfully and there is nothing left to say without spoiling upcoming events as my disappointment stems from the season finishing too soon and nothing about the season.",
            "date": "2017-12-25T06:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 266340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6225204.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LoH500",
                "username": "LoH500"
            },
            "url": "https://myanimelist.net/reviews.php?id=266340"
        },
        {
            "content": "Shokugeki no Souma is a fun anime.\r\nWhile my enjoyment is in a descending line, my intriguement in the show is evergrowing. \r\nIt has goofy characters, completely filled with over the top clichés and stereotypes, making the anime seem borderline parody.\r\nEven the seemingly harem element to it is played as a joke, which is a pretty hard thing to do. And even when it does stuff which can never be done in reality, even that is a joke.\r\nBut, even that only goes so far.\r\nA joke is a joke, and repeating it a million times doesn't make it endlessly funny.\r\nAnd honestly, that's what Shokugeki no Souma isdoing right now, not to mention that barely anything substantial happened in these past episodes.\\n\r\nEven the plot is barely a 5, because it's not really interesting or clever.\\n\r\nIt sticks to the basics.\\n\r\n\"My dad is secretly a super amazing chef\"\\n\r\n\"I make girls around me fall in love because I am also a super amazing chef\"\\n\r\n\"Evil figure related to main heroine takes over my school oh noo\"\\n\\n\r\nThis doesn't stop me from liking it though, it's still a really fun anime.",
            "date": "2017-12-07T16:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 264719,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5613930.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pure_trash",
                "username": "Pure_trash"
            },
            "url": "https://myanimelist.net/reviews.php?id=264719"
        },
        {
            "content": "Shokugeki No Soma is a strange beast. It annoys me, but makes me laugh all the same. It's like one of those annoying friends who keep on bugging you, but you can't help but like them a little.\r\nStory: The story in Shokugeki No Soma is the low point of the series, meaning, there isn't much story. Soma wants to become a better chef than his dad and ends up going to a high class culinary school. The plot is simple, but it works. In the world of Shokugeki No Soma people settle a lot of their disputes through food battles, which have people make extremereactions according to the food. This ends up with mostly being ecchi stuff, like people losing their clothing, but can be fun (\"Oops. I turned into a young girl for a second\" hint hint). Tragically, I think the writers must have had a hard time writing about food as it mostly boils down to \"The umami of this works well with the umami of that. The sourness enhances the umami. Umami this, umami that...\". It's like 90% of all taste is suddenly umami. I call that \"bullshit\" or \"horse crap\".\\n\r\nArt & Sound: The shows art style is nice and flexible, switching fluently between detailed drawings and a more simplistic style (usually when the character aren't acting seriously or for comedic relief). This is well done and goes well with the show. Also, the food is nicely drawn and kinda makes me hungry sometimes. The sound is also very well done, with nice voice acting and good sound effects.\\n\r\nCharacters: The character are a diverse trope filled with most of the stereotypical characters, some mixes and a few, a bit, original. They are enjoyable enough, but usually doesn't get you too invested in their lives.\\n\r\nOverall: Shokugeki no Soma annoys me often, especially with way they describe flavors, but it's a fun watch with enough to keep me watching it all the way. If you're not super against flashing of skin (with awkwardly placed light beams or items placed in front of the more daring areas) or drawn underwear, and want some, over the top, extreme comedy this is a nice watch. Intensive, mostly brainless fun.\\n\r\nEnjoy!",
            "date": "2018-12-06T14:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 295357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=295357"
        },
        {
            "content": "So, I'm not entirely sure why MAL separated the third season of Food Wars! into two separate pages, but I'm here to review the first twelve episodes. \r\nBasically, this season takes a turn for the nasty as far as plot goes. No, the anime hasn't lost any quality, but the story gets a little darker than usual (which is kind of my forte). You're going to get a lot more character development for Erina in this season, which was lacking in seasons prior. \r\nIf you're only in this series to see Shokugekis then, unfortunately, this season will disappoint you. There's much more character focus goingon in this first half of the season, although that isn't necessarily a bad thing. Mind you, that doesn't mean you won't see Soma throw down in one way or another. \\n\\n\r\nPersonally, I think this anime is just getting started, and it has a lot more story to tell before it's finished.",
            "date": "2018-06-25T11:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 282193,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=282193"
        },
        {
            "content": "Hi, im colonel archbishop AfkChaos, fighting in the war against \"Netflix isn't an anime.\" Im currently in A.I.C.O acers. Hiding in plain sight, beside the crops of bad character development. HEHE im practically invisible with my handy sniper rifle.\r\nI've left the comfort of my home to review an anime I used to love, and hope future devs learn from Shokugeki's mistakes.\r\nThe first mistake? Well, take notes, because this is what happens when you make a unique anime dependent on aesthetics and art style. The anime is pretty simple, but they realized \"oh snap we need character development and backstory. You don't do that three seasonsin after flashback no jutsu'ing more beloved and interesting characters.\\n\r\nYou want me to feel sympathy for a rich girl whose sad her dad will take the school away from her wealthy corrupt grand dad who uses child workers for money? While her dad is a better chef and just wants the kids to excel and follow the curriculum? Who didn't break any laws or rules??????????\\n\r\nSHE WOULDN'T EVEN HAVE THE GOD TONGUE WITHOUT HIM????????????????????????\\n\\n\r\nStory: No one really knows. Seriously, the pacing is soooooooo bad that we get a different \"path\" for where its going all the time. Erin was by far the least interesting character and now we are forced to cram character development, changing of the main protagonist without climax, climax, making a static character into a dynamic character, changing the plot, changing the atmosphere (shokugeki), changing Yukihara's relationship with Erin, and developing a love interest. This? This was all attempted in 60 minutes of run time. \\n\\n\r\nCharacters: LOL!\\n\\n\r\nSound: Ya ya same one\\n\\n\r\nEnjoyment: If it's not broken, don't fix it. This anime sucks now. Also, the ecchi atmosphere is gone. Im usually not a fan of ecchi's but it was so well done. Now it's just crammed in there unnecessarily? Like moments that bathos the whole scene. How can I get emotional in a scene where the writer is telling me it's not serious, so HERE boobs????\\n\\n\r\nOverall: Don't waste your time. Pretend it all ended and imagine the rest for yourself.",
            "date": "2018-05-17T07:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 280785,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1939228.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/afkchaos",
                "username": "afkchaos"
            },
            "url": "https://myanimelist.net/reviews.php?id=280785"
        },
        {
            "content": "SnS San no Sara is basically a mix between the first and second season of SnS title. This is quite visible when we see the technical quality that it presents. But this third plate holds more than those technical qualities alone. It holds potential and promise.\r\nThis third plate holds two different meat, which the first is called Moon Banquet Festival. This arc can be translated as a plot to show what those Elite 10 members are capable of, ranged from one of the lower ranked to the highest one. This results in a realization of strength gap between the MC and those members of theElite 10. It’s a far gap, but not far enough to say unreachable.\\n\\n\r\nThat first arc is presented in a tidy and well-structured way, maybe even more than that of the few earlier arcs in the first season. By no mean this Moon Banquet Festival arc is impactful, but we can feel a different, fresher breeze than what we feel in the second season. Yes, in a way, this arc stands as one of the most unique arc in SnS title.\\n\\n\r\nThen comes the second meat, called Nakiri Azami’s arc. In here, comes the exiled demon lord which causes wreck and havoc here and there, in the name of salvation. While this arc is a very classical shounen-ic one, where there is a definite evil antagonist and the MC fight against him, and presented in a pretty straight-forward manner, this arc also represent one major thing that exist in the world of cooking, and more generally in the world of art.\\n\\n\r\nThis arc represent the clash of ideals between quality and originality. A quality that is regarded very high. The ephitome of objectivity and no one can deny. Only a few, gifted and selected ones truly capable to make this way into realization. All should follow this way and this way alone can bring the world of art (cooking) to a higher plane. \\n\r\nAgainst that, there’s originality. A way that emphasizes creativity and individual differences. A way that speak of enjoyment in venturing a stormy place called hardwork. Instead of talking about a very high sky, which everyone sees sky that way, this way talks about a never-seen sky.\\n\\n\r\nWhen we see it that way, this arc holds a very big promise of the story in the future and realize that this arc is only the start. We will see how both sides struggle to defend their own ideals and that is something to be expected and enjoyed. \\n\\n\r\nDespite the big promise that it holds, however, delivering it is a different thing to talk about. While we can see this arc as an exciting start of the wars that will come, at the same time we can feel that this arc is the start of a very big pitfall, that compares evenly with the Autumn Election arc. Nevertheless, enjoy the continuation of this third plate ~\\n",
            "date": "2018-04-11T00:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 277716,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6744806.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tirta_Firdaus",
                "username": "Tirta_Firdaus"
            },
            "url": "https://myanimelist.net/reviews.php?id=277716"
        },
        {
            "content": "Before I start this review this review will be covering seasons 1-3 and I will be updating this review when the 4th season comes out which I think it comes out of spring of 2018 so your looking at April May time frame anyways lets start the review. I am surprisingly pleased with this anime because when I first saw it I put it off because I thought I would hate it but then one day I decided to give it a watch and I do not regret it. the weakness part is the story the story is ok its not bad but not greatthe story follows the Main Character named Souma he has been cooking under his dad his whole life mastering his craft so to speak. and one day his dad took off out of nowhere and send his son to the top cooking school in japan. now the characters I feel that the characters make this anime work if it wasn't for the characters it would fail this anime did a really good job on characters there was no almost no useless characters each character had its own personality and back stories for each character were solid and character development is decent. now lets get into the Ecci and I will admit I hates Ecci anime series 9/10 times but this show is in that 10 percent the ecci scenes only really happen when they eat the food which is great because it is a way to show how good the food is and the ecci seems very subtle and not in your face this is one of the few times I actual enjoy Ecci in an anime or manga series. if you hate the ecci tag I would personally still give it a shot. the art and sound are great no problems here. this anime was really close to a 8/10 but I thought the story was a little weak but Overall good anime I would definitely give it a shot.",
            "date": "2018-03-16T19:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 274019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7052310.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DJM47",
                "username": "DJM47"
            },
            "url": "https://myanimelist.net/reviews.php?id=274019"
        },
        {
            "content": "I gave it a 10/10 just for the ending, man that was so good. This is by far the best season out of food wars for me, a mix of dictatorship and food? sign me up! It was extremely nice to see new characters especially the introduction of the Elite Ten and they did not disappoint me at all, especially the First Seat. I'm really glad to see the development of Erina and her backstory, although I didn't expect one I enjoyed it. I love seeing the bonds between the different main cast growing. The food battles also did not disappoint!  I'm really hypedfor the new season!",
            "date": "2018-02-18T20:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 271905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5589309.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lmfaoalice",
                "username": "lmfaoalice"
            },
            "url": "https://myanimelist.net/reviews.php?id=271905"
        },
        {
            "content": "Shokugeki is hands down my favorite shounen anime. Not being an expert in the genre, this is the first of them that has captivated me in several ways. The story is simple, following the journey of several students through the rigorous and exclusive Totsuki Culinary Academy. It isn't anything new, but is very engaging and provides an excellent canvas for where the show really shines. The Characters. This show has the single best and most well balanced cast of characters I have ever seen in any anime. I genuinely have a hard time choosing a favorite due to how excellent every character is. Third platein particular has done an excellent job of not only introducing new characters (The Elite Ten and Central Elite) as well as HUGELY improving the character of Erina Nakiri, who I found lackluster in the first two series. Her backstory is heavily explored in third plate, and I hope they continue this in April, when 4th plate is scheduled to release. The art and sound are both incredible, they have to be in order for us to be engaged in a food anime like this. In total, I have to give Shokugeki a ten simply because of its lovable cast of characters. There are so many characters in this show, each with their own lovable and memorable personalities. Id recommend this show to anyone interested in watching a unique anime with an excellent sense of humor and wonderful cast of characters.",
            "date": "2018-02-04T11:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 270659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BobRossSSBM",
                "username": "BobRossSSBM"
            },
            "url": "https://myanimelist.net/reviews.php?id=270659"
        },
        {
            "content": "**This review contains minor spoilers. Don't kill me if you get spoiled :P**\r\nNow before you (the fanboys) rush into my profile calling me a hypocrite for not 9/10ing Food Wars for the third time, hear me out here. It's a good show. Just that it wasn't good enough. I think J.C Staff themselves understood that something was wrong, hence the step of making a split cour and figuring out how to get things right next time. Dewa, hajimeru yo!\r\nStory: 6/10\r\nSomehow this felt kinda average to be honest. I expected it to go at a better pace and cover stuff properly but frankly I couldn't findmuch that was amazing. Thanks to more focus on Erina and her cliched adventures and a certain badly characterized father the story part took a nosedive, although not too great as the focus wasn't that deep. It's difficult to go deeper without entering minor spoiler territory so bear with me. Central was a pretty cliched move and their motivations were weird and cliched at best, not to mention if there WERE any in the first place. On the other hand that certain father's motivations himself were also terribly disappointing... As a fellow manga reader I was quite disappointed with this in the manga as well, but enough of that. If there was one focus and one downfall of this anime in quality, both have that father as the reason. Now you might point at that mean score and popularity chart and look at me questionably to which I say, it's the fanboys. Being a Shounen, there are obviously bound to be fanboys who take no notice of the issues surrounding an anime or it's sequel and just blindly 10/10 or in my case 9/10 everything. I'm guilty of that myself but I won't do that for this season. Season 3 slightly disappointed me as a fan and as an anime watcher. A small reason for that 6 in particular is also that cliffhanger in the end...\\n\\n\r\nArt: 7/10\\n\\n\r\nNow something I noticed in this season particularly was that the art sometimes felt distorted and the characters looked a little weird in close-ups. This wasn't there in the previous two seasons and I felt kinda like I was watching a remaster of a 1995 anime at best which is obviously not a very good sign. What was the saving grace of the anime? The backgrounds. The cinematography to some extent. Both were decently done and even the character designs made me fall in love with the characters yet again. Not a bad job. Decently done at best.\\n\\n\r\nSound: 8/10\\n\\n\r\nApart from the usual brilliance of the BGM, we also had the added benefit of an amazing OP and more importantly an amazing ED. The BGM was timed perfectly with the emotion and situation while the aforementioned OPEDs hyped you up. If you like me love to download anime OSTs then this is the place for you. \\n\\n\r\nCharacter: 6/10\\n\\n\r\nNow it's impossible to avoid the spoiler territory with this section especially since the character in question is the main focus of the anime (he's on the flipping cover as well). The purported rise and actual fall of Food Wars Season 3. Azami. His motivations weren't explained at all. And Sanzaemon's exile felt kinda forced as well. Yukihara and gang were amazing as always, but the character who was the key focus himself was flawed so everyone suffers. I tried many times to wrap my head around Azami but couldn't understand him at all... And for the second character who brought this down, Erina. To all those who've read my last two reviews of the series know very well of my hatred and grudge against Hime-deres, Erina included. What made it worse this time? The unnecessary focus on the 'oh so weak' Erina-sama. She and Azami double-handedly crushed any potential the season had to improve...\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nNevertheless, Food Wars as usual was an excellent anime to enjoy and I certainly DID enjoy Food Wars a lot, just not to the extent of the previous two seasons. In my opinion, I'm glad J.C Staff bit the pill and split cours to understand what went wrong and how to fix it. Since I'm a Food Wars fanboy, I obviously was a little biased towards it but tried my best to tone it down. I really hope J.C hit back with another super hit season. This time one that actually has the quality to back itself up like Seasons 1 and 2.\\n\\n\r\nOverall: 7.2\\n\\n\r\nTo get an idea of how much I love Food Wars here are my scores for the previous two seasons: 8.8 and 9.4. Fanboy much? Now look at this one, 7.2. A lot happened didn't it? I know, you know and J.C Staff knows. To the most conservative of people, this show was decent at BEST. And no amount of fanboy nagging can change that. To all those who watched season 2 and are a fan, continue, if you're just in it for fun, you might get it here. Thankfully the potential is not ruined, but again, the question remains, is it too late? Can J.C save Food Wars? Let's see this Spring.\\n\\n\r\nP.S: Megumi retains her rank as best girl for the third time in a row! Megumi best girl >3",
            "date": "2018-02-03T05:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 270496,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=270496"
        },
        {
            "content": "OKAY YALL, I DONT HAVE A ONE TRACK MIND SO IM GOING TO WRITE WHATEVER COMES TO MIND WHEN I THINK OF THIS ANIME!\r\nFirst off, the story was less thrilling in the beginning. The first 2 seasons before this did a better job of capturing my attention in the beginning, but knowing how great this anime is I kept thru. In the end I loved it, whats new LOL, but just incase someone has the same tastes as me PUSH THRU!\r\nAlso, prepare for a big cliffhanger! Ive been waiting for the day for some back story on Erina! It lets you see her as moreof a human than just someone with \"gods tongue\". Shows friendship and how much the Polar Star dorm and the students mean to each other. \\n\\n\r\nTo be honest, I was expecting more of Souma's dad but unfortunately he only makes one brief appearance. I was looking for him throat the whole season LOL. Other than that, this season and the last and the one before that is all worth watching. MAKE SURE YOU WATCH SEASON 1 & 2 BEFORE THIS. I don't know what kind of person would want to watch season 3 first and then watch 1 and 2 tho.. LOL",
            "date": "2018-01-22T03:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 269313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6701917.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rawrsaysno",
                "username": "rawrsaysno"
            },
            "url": "https://myanimelist.net/reviews.php?id=269313"
        },
        {
            "content": "Hey folks, this will be a review for Shokugeki no Souma: San no Sara. This season was a mix of bad and good. We return to wondering whats going to happen, and being drawn into the events more personally. However it comes at the cost of the story and art being sub par. \r\nThe story of Shokugeki no Souma was never a intricate part to enjoying the series imo. That being said this season makes it seem rather silly, and draws you out of the experience just with its ridiculousness. The first half of the show focuses on the moon festival, which wasn't bad. Howeverthe second half we are introduced to a new villain who begins to change the show completely. \\n\\n\r\nUnlike other shounen shows there is no violence, no death, no real physical ramifications for the characters. The first season toyed with the idea that losing meant the end of your cooking career but otherwise the world works like it does today. This villain somehow gains far more control over things than seems reasonable with the knowledge that no real harm, physical, or financial would come to the students or teachers. Cant really describe it without spoilers but this is easily the worst part of this season and really felt unnecessary. \\n\\n\r\nThe art also took a hit in general. Characters and scenes poorly done, and easily noticeable to someone who typically doesn't notice these things. The first season was beautiful. This season however was watchable but disappointing. \\n\\n\r\nThe characters remain mostly the same. Everyone is enjoyable and has grown a bit. We are also introduced to a new set of characters who are the new bad guys of the show, and are exceptional chefs.\\n\\n\r\nOverall I enjoyed this season. Maybe it sounds weird after rating the story and art poorly, but it didn't hit what the show was at its core. The story though stupid and unnecessary successfully gives us new challenges and reasons to be invested in the cooking again. This season was truly action packed. The people who didn't like the slow pacing during the autumn selections will probably have a better time watching this season. I enjoyed the slower more intricate pacing of season 1, but I still really enjoyed watching this season as well. Fan service has also been toned down. There were maybe three episodes with it, but unlike the first season it felt out of place and silly.\\n\\n\r\nI'm still looking forward to the next season. I do hope they take the time to make the art extraordinary like they did in the past. \\n\\n\r\nTLDR: Stupid story, and lower quality art. However just as enjoyable as the rest of the series. No reason to not watch it if you have seen the previous seasons. If you haven't then I still highly recommend the show in general.",
            "date": "2018-01-04T13:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 267411,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=267411"
        },
        {
            "content": "Goddamnit JC Staff.  When I heard that the third season was gonna have 2 cours, I thought that I could hold off on watching it till next season.  But no, you chopped it in half and put me behind schedule.  Personal salt aside, the third heaping of Food Wars porn starts putting the show into some bittersweet territory.\r\nStory:\r\nThe first half of the third season of Food Wars brings us a duality of arcs from its original manga, serving us up the moon festival and the beginning of the series's downfall respectively in a somewhat bitter tasting presentation that begs the question ofwhere the show is going to go from here.  \\n\\n\r\nAt first, we're given a nice sampling of more of Totsuki's culinary festivities with the moon festival, doing what Shokugeki does best by creating your standard shounen rivalries in a competitive atmosphere where each side brings their own tools and weapons to the table to create an action and thrill driven plot that we've come to know from the series.  The arc is actually pretty satisfying to watch and provides some good screentime for the just introduced elite ten members the series has been hinting at for some time.  But the second half, oh...the second half.  \\n\\n\r\nI honestly don't know what direction the series is going at this point.  What started as a heated and competitive series that pit young chefs, each with their own style and personal stake in every competition or event escalated so dramatically into the equivalent of a battle for the end of the world that I fail to understand the logic of why things had to elevate so fast, especially for students that're still in their first year of high school!  (We still have 2 more years left if the trend of school-based shows are any indication.)  \\n\\n\r\nThe series turns its head into something of a fascist vs. capitalist kind of argument where many, many leaps of logic have to be considered for any of this to make much sense.  It begins the eventual long trend of series slowly lending itself to a battle for survival with a hilarious amount of twists and turns presented that boil down to the villains being narcissistic assholes without any redeeming qualities to serve as fodder to show that our protagonists have the will to fight and aren't willing to back down.  At least in the past they gave SOME positive merit to the opposing force in the way of the protagonist that actually turned many opponents into supplementary allies.  Here though?  Aside from the elite ten, everyone's an asshole that's not worth the time of day to talk about.\\n\\n\r\nOverview:\\n\r\n+ Good first half\\n\r\n-  Second half...starts going rancid\\n\\n\r\nCharacters:\\n\\n\r\nIf you're curious, Soma and the rest of the Polar Star Dorm (or main protagonists I guess) don't really change all that much.  So I'm not covering them.\\n\\n\r\nIf there's any silver lining from the second half, it's Erina.  Finally getting much needed explanation and backstory for one of the most stuck-up characters in the series made her so much more redeemable than what we were presented with before, and gave her positive growth that I for one was thankful to see.  She feels a lot less annoying to watch, and it's one of the few things from the beginning of 'Central' that I can praise the series for doing.  \\n\\n\r\nAside from her, we're given a taste of several members of the elite ten, giving more depth as to what these esteemed prodigy chefs specialize in so we're familiar with how they operate when the time to face these final bosses come.  The introductions are done pretty imbalanced cause several take the spotlight above others, but when we get to the second half of the third plate, we'll get to everyone else eventually.  \\n\\n\r\nThen halfway through the series there's what seemingly is the big endgame boss to the Shokugeki no Soma series as a whole, Nakiri Azami.  This guy is just designed for you to hate him.  The man who instills a fascist regime over Totsuki really doesn't have any positives going for him, especially when he's drawn monochrome and has Aizen's voice.  (Which I admit, sounds cool, but the character himself is shit.)  At least with previous antagonistic characters we get some form of redemption and reason behind their actions, qualities that make villains interesting and more complex than being the guy sitting there twirling his evil mustache.  This man has no redeeming qualities and simply just stands there with a coy smile as the pillar that siphons all of the hate I have for potentially having a really cool endgame antagonist who isn't just doing what he's doing cause of dumb reasons.  \\n\\n\r\nOverview:\\n\r\n+ Redemption for Erina\\n\r\n+ Depth for new cast additions\\n\r\n-  Seemingly main villain is severely disappointing\\n\\n\r\nArt:\\n\\n\r\nJ.C. Staff always pulls out all the stops for Soma, giving us the bright and colorful style that they've done for 3 cours in the past with gourmet food that literally glistens when you look at it and makes you want to eat at that very moment.  The typical stripping scenes combined with orgasmic moans are also rather commonplace so...expect that.  All of that's the same, but what else is on the menu?\\n\\n\r\nSome...interesting stylistic choices for parts of the show were made for the art aside from the standard quality we're familiar with.  For one thing, several scenes in the first half are done in  CGI which while are brief, are pretty noticeable for the time they're on-screen.  Not only that, but the show turns to create these super detailed and super ugly faces at times for several of its characters.  (Especially for that one battle in the second half)  It's not...bad per say, but it's just a kind of interesting style choice that was done cause it was put in the show previously.\\n\\n\r\nOverview\\n\r\n+ Some interesting...style choices\\n\r\n+ Standard, still really good looking art and food\\n\\n\r\nSound:\\n\\n\r\nTo be honest, I didn't really pay much attention to the soundtrack.  Much of it was largely uninteresting this time around and definitely didn't have the same quality that previous OPs and EDs have.  \\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nNow this is the part of the review where I get to have fun and rant, cause Central is a piece of hot garbage that I really am not looking forward to.  I just don't understand why the show had to turn itself from a heated and sometimes overly dramatic cooking-based battle series into an end of the world scenario where the heroes have to fight an oppressive force in a David and Goliath story that turned things on its head so fast that it's hard to put into words have quickly things escalated.  What's worse is that there's just SO MUCH SMACK TALKING that an entire episode will be filled with nothing but how 'great' and 'refined' the people of Central are that I could only come to the conclusion of: they're assholes.  That's it.  \\n\\n\r\nLike...you had Subaru, an intimidating guy who despite being a bit of an asshole, actually had something to him that you could at least sympathize with.  Erina, a girl who has had her fair share of pompous problems in the past, soften up and grow as a character.  And even Kuga from this season, who has so much more depth than these new asshole characters who exist only to be assholes.  I fail to wrap my head around why a series that's had such a good history of providing antagonistic characters with positive traits go so wrong by filling those in the 'bad guy' role with irritating stuck-up characters that make Erina's previous actions those of a saint.\\n\\n\r\nDid I like this series?\\n\\n\r\nThe moon festival was a good arc, and I really liked the way the show provided brought some struggle and positive qualities to a member of the Elite ten who from the show's own volition made them out to be like gods.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nCentral.  I LOATHE this arc and everything that this new story direction stands for.  And this shit goes on for a LONG WHILE.  So if you're like me and not a fan of it, don't expect it to go away any time soon.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nI'm honestly torn because on one hand, Shokugeki is a good series, and those who like it should continue liking it.  But Central is just one of those things that irks me about the show cause in doing this, the show becomes less about the students and the individual stories of these chefs and their plight to learn and hone their craft, and more of a battle of good and evil just using cooking as the weapon.  Really, if you're a fan of the series, continue watching, but be wary that the Shokugeki you knew before has changed form.",
            "date": "2017-12-27T13:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 266547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=266547"
        },
        {
            "content": "Another season of Shokugeki no Souma and this time things arent as predictable as were in previous seasons.\r\nUnlike previous seasons this time shoukugeki gets a lot more story focused(always keeping in mind the whole focus of the foodgasm series)by involving Erina and her father with Soma and his family.\r\nWe get to know more about Erinas past and present(she becomes more present this season than in the previous ones)and also we get to know(some of them in action)some of the elite ten of the academy.\r\nI personally really liked this approach.And it makes sense as it shows something a bit different than Souma trying to bear everyonein a Shokugeki.\\n\\n\r\nErinas father is a short of plot twist(his past and present)that is really welcome in the series mostly because it spices things up a bit and the series becomes a bit less predictable.\\n\r\nThe fanservice is still present obviously but there are arent as many scenes as in previous seasons.\\n\\n\r\nThe art direction and animation like in previous seasons is spot on.\\n\\n\r\nIt short of ends with a cliffhanger concerning Soumas father but the series will have a continuation  in April. I really enjoyed this season more than i expected and am looking forward to the next one.",
            "date": "2017-12-26T00:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 266415,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6655231.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fulgore",
                "username": "Fulgore"
            },
            "url": "https://myanimelist.net/reviews.php?id=266415"
        }
    ],
    [
        {
            "content": "PLOT: Season three continues where they have left off! The main characters are looking back from the previous season and seeing how far they have come. During the first half of the season... It consists of a shokugeki at the school's food festival. The rest of the season contains a HUGE shocker for one of the main characters (don't want to spoil it because you guys need to see it!!) This has caused everyone on campus to be shook and woke! The shokugekis continues to be amazing and orgasmic; (I can't lie at the fact that the food looks pretty food...) Plus, it has causedfor the main characters to rise above the challenge.\\n\\n\r\nCHARACTERS: Soma, Erina, Megumi, Takumi & everyone that you know & love are still here! Teaming up together is their greatest strength to survive this culinary school! Their ongoing challenge depends on their strengths and everything that they have learned so far! Plus, they have a great support system behind them :).\\n\\n\r\nOVERALL: Great season so far!! (Better than season 2 to be honest...) The halfway point of season 3 became the highlight & the main focus that caused everyone in the academy to stand on their grounds. Plus, we get to learn more knowledge of some of the main characters' pasts & how still affects them today; & WE ALREADY KNOW THAT WE ARE GOING TO HAVE A SEASON 4!! I recommend watching this season for its great storylines, characters, and amazing dishes overall! (JUST PLEASE MAKE A COOKBOOK FOR THE DISHES THAT WERE MADE SO FAR IN THE SERIES!! I'M WILLING TO ORDER ONE!!)",
            "date": "2017-12-19T16:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 265645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=265645"
        },
        {
            "content": "\"LA wanted more...LA wants a 3rd Plate for all LA cares... \"\r\nOrder Up...ONCE AGAIN!!!\r\nShokugeki no Souma's 3rd Season left off where the 2nd Plate's OVA left off with by showing us the Elite Ten in all their glory with Souma bringing in a Shokugeki to Terunori Kuga voiced by Yuki Kaji, the 8th Seat during the Cultural Festival. The second half of this season on the other hand...\r\nThe Cultural Festival arc for LA, showed that Souma was improving his craft and even experiences form his past experiences brings him help and even victory. If there was anything the Cultural Festival arc gave off was showingus the prowess of the Elite Ten, or if anything a taste of them..pardon the pun.\\n\\n\r\nThe second half on the other hand brings in something LA had been waiting since the second season. ERINA NAKIRI development!!!!!!!!!. As well as one of the biggest changes to the plot ever in the form of Azami voiced by Show Hayami.\\n\\n\r\nAzami is probably the first fully fledged villain in this anime and he even has a connection to Erina which brings about her development in the first place showing us HOW Erina turned into the cruel God Tongue she became because of Azami as a factor. Erina was LA's favourite character in the entire series even from the first season so seeing her develop out of her cruel and stubborn personality she had and now opening up was great for LA, even if Erina opened up even before this due to the second season and her coming out of her shell in a ways (just not directly through Souma but his friends instead). \\n\\n\r\nOnce Azami comes into the picture...just everything changes...maybe for the better in terms of the plot for LA and LA loves it, now Souma being the underdog of Totsuki Academy he now has become the saviour and last hope to save Totsuki instead. If there was flaws to this 3rd Plate, LA would say that people would say that they will always see the victory coming when it comes to Souma...because main protagonist but uhhh to defend this, LA would say that AS SOUMA being the main protagonist and him learning from his experiences and Shokugeki's he's becoming an even better chef time and again, sure it's victory and everything but it's showing us that Souma is growing as a chef and he'll need it with Azami in the picture. The second would be that Azami is just soo much of blatant villain it's hilarious, oddly enough LA can defend this too, as his ambition and being the Cerberus Syndrome changing the mood of this entire series breathes a different yet still good life into the anime series. Lastly would be.....it's too short but thankfully a second season...of this 3rd season wow t-t-t-that's a thing now is happening so bring in the main and dessert, LA wants that to be 24 episodes!!!\\n\\n\r\nThe animation once again done by JC Staff doesn't skimp on the animation and the ever deliciously animated food. So consistent and delicious as always and oddly enough JC Staff loosened on the fanservice this season...maybe because of Azami?...huh that could be a reason.\\n\\n\r\nAs for voice acting, well it's decent and expected as always. However there is one thing that has changed that LA will bring up and probably the most interesting chnage in terms of voice cast and that is the change of Erina Nakiri of Risa Taneda to Hisako Kanemoto. LA finds Risa Taneda to be synonymous to Erina Nakiri, so hearing Hisako trying to mimic Risa's tsundereness is actually done well. This is just LA and all but when LA hears Erina in the 3rd Plate, LA just hears Hisako over and over again, LA doesn't know Erina now has loosened with her tsundereness and lost her ojou regality and that's ok, LA is fine with it as it kinda makes sense to the plot and everything and Hisako Kanemoto still does a brilliant job in replacing Risa Taneda. But LA will always hear Hisako as Erina, not Risa but that's completely ok.\\n\\n\r\nThis 3rd Plate Entree, was showing us only the taste of what's to come, from Azami, to Erina's character development to showing us the Elite Ten and what Souma and the Polar Star dorm are up against in order to bring back order to Totsuki.\\n\\n\r\nBRING ON THE 3rd PLATE...MAIN & DESSERT PLEASE!!!...",
            "date": "2017-12-19T14:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 265629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=265629"
        },
        {
            "content": "SIMPLY BURSTING WITH EXCITEMENT\r\nI truly enjoyed the first and second seasons of the anime, and this was no different. \r\nThe story/plot this season was much better compared with the previous seasons, I had started to worry this anime would slip into a repetitive nature with Soma just battling stronger opponents every few episodes. I won't spoil anything in this review but the show managed to add greater stakes and for that they truly deserve credit for. The big reveal in the final episode was quite satisfying to.\r\nThis season was quite wonderful in how entertaining it was. I don't tend to fall prey to cliffhangers easilyso I might decide to wait a couple days to watch the next episode after its been released. Not this time! I kept a vigilant lookout for when each episode dropped and they also managed to get me pumped for the next season too.\\n\\n\r\nCharacter development this season hit the nail on its head. Especially with Nakiri Erina, I felt she had been abandoned to a measly side character the previous seasons when more could have been done with her. I was surprised to see so much of the story revolve around her and it was great.\\n\r\nThe addition of a formidable antagonist was just what this anime needed to give it a boost.\\n\\n\r\nIF YOUVE SEEN THE FIRST AND SECOND SEASON THEN THIS IS A MUST WATCH. \\n",
            "date": "2017-12-19T13:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 265624,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4899579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SenninSage",
                "username": "SenninSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=265624"
        },
        {
            "content": "This is a review from someone who actually hated this anime some time ago so let me tell you what makes this a good show\r\n\"Don't include story summaries, users already have the synopsis written for them.\"\r\nThere is no synopsis so back off mods\r\n\"Try your very best to not write any spoilers.\"\r\nOk I try\r\nThis season is what made me fall for the anime and I need to spoil some of the plot in order to explain myself:\r\nThe school is not going to allow students to cook what they want or specialize in the style of cooking that they like. \r\nWhy did that stupid reason make mefall for this anime?\\n\\n\r\nWell is simple, every single Chef have their own cooking method and their own way to tackle a dish, in other words everyone is different and it shows in their cooking, the very essence of a Chef can be seem as an artist who is interest in honing his skills in the style of cooking of their choice, this may not resonate with people who are used to watch guys screaming and trowing kamehameha but bear with me on this one...\\n\\n\r\nWhen you take away a Chef`s freedom to experiment different recipes or cooking methods of their choice you are actually stripping away part of their personality, part of who they are as a person, because at the end of the day cooking is an art and the show uses cooking to express the personalities of their characters.\\n\\n\r\nAnd if you are still wondering why this is an issue or why should you care...\\n\\n\r\nThe answer is simple you shouldn`t\\n\\n\r\nThe reason I care so much about this show is because I love cooking and I have a lot of love for food\\n\\n\r\nThis may not resonate with someone who is not interested in those subjects and that is ok \\n\\n\r\nIn summary:\\n\r\nIn this season the school wants to destroy what makes each and every single one of these Chef`s unique and now they have to find a way to fight against that or accept defeat and lose who they are\\n\\n\r\nIf my review peak a little of you interest do yourself a favor and watch the show.",
            "date": "2017-11-26T16:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 264013,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4644144.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sxe68",
                "username": "sxe68"
            },
            "url": "https://myanimelist.net/reviews.php?id=264013"
        }
    ]
]