[
    [
        {
            "content": "If Michael Bay ever made an anime, it'll be like Triage X. \r\nI've stated in the past that a lot could be gathered from a show's 1st episode, but it's rare that I come across cases where the very 1st opening scene sums up the anime just as well. Not even a full second into Triage X and the 1st thing the audience is greeted with are melon-size oppai. With that being said, leave any sense of decency you may have at the front door, and revert back to your hormone-filled pubescent days because Tri-hard X is as brazen as it gets.\r\nGUNS!!!.. BOOBS!!!.. EXPLOSIONS!!!.., annnnndMORE BOOBS!!!\\n\\n\r\nLet's face it; there are only two reasons for anyone to watch this:\\n\r\n#1, for the \"plot\" \\n\r\n#2, for the \"plot\"\\n\\n\r\nBut as far as the actual content goes, there's very little here worth discussing. This is an anime that exists solely as a container for boobs and action. Any plot points brought up that gives hints towards a character or narrative arc goes nowhere. From the mysterious inner-workings of the various organizations that the viewer is made aware of to the straightforward overarching narrative that contained it, all of it was merely brushed over. Mini-arc formats that began with no buildup and ended with no solid conclusion. Outside of being an advertisement for the manga and all the \"plot\" it may contain, Triage couldn't be bothered with the trivial matter of \"caring.\" But man cannot live off boobs alone, so in substitution for a story, the show gives us chicken scratch that vaguely passes as one.\\n\\n\r\n This chicken scratch was manifested with our protagonist, Arashi Mikami, as we find out that he's a part of a band of assassins that kill off members of society that they deem unworthy. With the help of a few armed titties with legs and his weapon of choice, they take on several assignments where they're tasked with cleaning house, leaving no grunt unscathed and no boob untouched. Wait, boobs and assassins? Is this Akame Ga Kill 2.0? All shit talking aside, the show could have done a lot more with the material than what it aimed for. No, I wasn't expecting much, to begin with, but they made no effort in hiding the fact that it was only there to boost sales and intrigue for the source material. The anime did very little to stand on its own, and it reflected profoundly on its drab presentation. The most we get are hints towards something brewing just below the surface; hints that ultimately panned out to the creators saying \"Just go buy and read the manga already.\" This was marked off with an underwhelming ending that even the show's protagonist seems to be aware of, as the closing lines delivered by him felt like the studio's way of saying they simply didn't give a fuck: \\n\r\n\"No. Nothing's been resolved.\"\\n\r\nThey just went about finishing it without a proper resolution or care in the world, giving the audience narrative blue-balls in the process. Everything was just left up in the air, like the Freeze frame ending of an 80s movie. To give you an idea, it's like if I stopped writing this paragraph mid-senten\\n\\n\r\nThe art/animation was relatively simplistic, which is a shame since I thought it was the perfect material to push boob physics even further. Although there was nothing overtly offensive about the production, there was also nothing impressive about it either. It was just the bare minimum needed to get by, almost cynically pushed off an assembly line with the paint still wet. \\n\\n\r\nAnd just like the animation, the soundtrack was equally generic, with your usual J-rock opening and OST that does nothing to stand out. Every musical cue felt incredibly phoned-in. The music fits the show in the same way every tween TV drama has your typical strum of an acoustic guitar hanging in the background. And as your eyes glaze over from watching GUNS, BOOBS, EXPLOSIONS, the soundtrack is just there, chiming along in the most unassertive way imaginable.  \\n\\n\r\nBut enough of that, time to cover the wonderful people we follow throughout Try-hard X's episode run. \\n\\n\r\nI'm hesitant to even refer to this cast as \"characters,\" honestly speaking, there's only one actual person in the entire show. The rest is bodypillow models in the making. Our main protagonist, Arashi Mikami, is as stoic as they get, in other words, he has as much personality as a brick wall. With a brooding personality stuck in angst hell and dialogue equally as stiff, every moment he's on screen, I could just feel a bit of my soul being sucked out.\\n\\n\r\nThe rest of the cast can be summed up with a simple formula: archetype + boobs\\n\\n\r\nThey're all busty females with one predominant personality quirk, so basically, well-endowed smurfs. The only \"development\" they get are the ones hanging from their chest. Of course, this is only a bad thing if you were expecting more, but if you just came into this for dumb action and TNA, then this character lineup is godsent.\\n\r\nThe antagonists were all overblown manchildren. It helped add to the campy nature the show unintentionally stumbled in. Also, none of them were afraid of groping a few sweater puppies either, so expect a lot of fun \"boob-play\" sessions. \\n\\n\r\nGUNS, BOOBS & EXPLOSIONS; a tried and true formula \\n\\n\r\nWhile Triage X was flawed on every level imaginable, it still managed to keep me entertained. I was brought to a time in my youth where sex and violence were all it took to appease me. It was certainly good schlock entertainment at times and if nothing else, kept my interest long enough before abandoning ship.\\n\\n\r\nIf you're simply looking for an easy-to-consume time-waster along the lines of a brainless blockbuster, then Triage X should fit the bill. And while it plays out well in that sleazy entertainment realm that it shamelessly occupies, you'll be hard-pressed to find anything else here. It's a show that focuses more on the \"plot\" than it does the plot and is very much aware of its ploy. The lower you set your bar, both in terms of standards and maturity, the better, as Triage X is wholly satisfied with its awarded consolation prize of being lowbrow smut.",
            "date": "2015-06-14T08:35:00+00:00",
            "helpful_count": 146,
            "mal_id": 190312,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=190312"
        },
        {
            "content": "\"I wanted to see if all human beings had a conscience. When they realize that their evil deeds have brought them death, do they feel regret?\"\r\n(This review, nor this series is nothing so pretentious)\r\nPreface: \r\nAh, Triage X. Heralded as \"that\" anime that crops up every season, promising huge bra sizes and more swinging breasts and panty shots than you can shake a stick at- Triage X does that and more. In more than one way, it's the spiritual successor to the long pined after season 2 of High School of the Dead, and in its own way ends up being something else entirely. It's kindof the Rugrats: All Grown Up version of HOTD, if you will.\\n\\n\r\nBefore I start reviewing, let it suffice to say that nobody went into Triage X looking for an emotionally moving, intellectual, character driven plot... No, it's just dumb fun.\\n\\n\r\nLet's get into it, shall we? \\n\\n\r\n(Note: I'm going to break out the fanservice scale again for this one.)\\n\\n\\n\r\nArtwork and Animation: 7 {Fanservice: 10 Bouncing Boobs out of 10}\\n\\n\r\nI hadn't seen anything by Xebec before, but I have to say that it looked just fine. The bloody gunshots, dismemberments, stabs, rips, gouges, beatings, and many other wounds were appropriately juicy. There are currently censors on the versions that are available to watch now, but I assume it will be filled to the brim with giant breasts and butt shots when the home video release comes out. Truly bringing Shoji Sato's vision of the perfect look to life.\\n\\n\r\nI'm not really sure how low the budget is, but it doesn't bother me. The CGI bike actually looks decent too. (Maybe I've been watching some badly low budget stuff lately and am tainted.) \\n\\n\\n\r\nSound and Voice Acting: 8 {Fanservice: 8 Sexy Moans out of 10}\\n\\n\r\nNothing really to complain about here. One standout though, and that's Fuyuka Ooura as Dr. Yuko Sagiri. Also the voice of Miyo Takano, she really brings the chilling, dangerous element to the voice part here.\\n\r\nThe opening and ending songs are solid J Rock stuff, and the insert songs are mostly hard rock that fit the action, and string sections for more serious parts.\\n\\n\\n\r\nCharacters and Story: 6 {Fanservice: 8 Hyped Up Set Pieces Involving Action Girls!}\\n\\n\r\nOkay, let's be real. These characters' backstories, aside from Hitsugi and Arashi, are NOT explored. In the grand scheme of the show, does it really matter? This show about action girls with implausibly large chests being super badass and not takin' no shit. It's not a character drama, it just needs some people in there that you can watch rip shit up. \\n\\n\r\nThis is high action at its best. Ultraviolent at times (Execution style headshot with a crossbow into a burning warehouse, YEAH!). Ultrasexual at others (Bath scene while discussing torture methods- shout out to Higurashi!). They even got the Mad Max (and more recently 'cool' in Walking Dead) *cuffed to something, throws a hack saw* \"You can saw through your arm faster than you can get through those handcuffs, if you want to get away\".  (Lampshaded, too- for good measure)\\n\\n\r\nOverall, full of cool action scenes taken straight out of famous movies- bike chases, crashing through windows, biological weapons, torture, huge shootouts, explosions, skyscrapers- it's a giant mashup of action cliché where everything is over exaggerated. This is the essence of Shoji Sato. \\n\\n\r\nTriage X does actually have a functional episodic plot, objectively speaking. I don't know if you've seen Dexter, the Showtime series, but Mr. Sato ripped the plot off, adding a medical theme and some hot chicks instead of a psychopath who shoots 3s (except for Yvonne Strahovski). \\n\\n\r\nIt's that coupled with a late night titty movie with action girls, except in TV form. It's a 10 episode version of those lovably bad B movies that come on really late at night that you watch drunk or when you can't sleep.\\n\r\nThis isn't prime time TV, this isn't movie theater stuff. It's a bargain bin item in that sketchy, dark corner of the video store with the stained carpet under that blinky light. \\n\\n\r\n(If you don't know- Dexter is about a forensic investigator who moonlights as a serial killer of people he believes escaped justice).\\n\\n\\n\r\nEnjoyment and Overall: 9, 7 {Fanservice: 10 Jiggly Pairs of Physics Breaking Boobs}\\n\\n\r\nI can't convince anyone else that it's lovable schlock and not utter ecchi harem garbage, but it's in fact the B movie kind of schlocky! (B is for \"best\"). However, if you fux with High School of the Dead, you probably like Shoji Sato's work, and it's the perfect schlock. I think Shoji Sato is a secret genius. \\n\\n\r\nI also think Triage X and HOTD are both great for what they are- giving these hardcore ecchi fans what they want, no matter how vehemently they deny it! People want ambiguously underage girls with huge boobs shooting stuff up, along with a blank slate main male character who gets all the Tang to project themselves onto.\\n\\n\r\nIt's true. \\n\\n\r\nLook at the state of the anime industry today- As I said above, there's always that anime, (or several of them) that does nothing but pander to its sexually repressed audience. Shoji Sato knows his audience, and he is laughing all the way to the bank. \\n\\n\\n\r\nWrap-up and Recommendation:\\n\\n\r\nIf you like High School of the Dead and are looking for even bigger action and boobs (Yuko has a 43.7 inch band size, holy impossible two headed cow!) you have come to the right place. There's just enough story to keep it moving onto bigger and badder set pieces, and is really the only anime this season I've been excited to watch every week. Call me a weirdo, masochist, whatever. \\n\\n\r\nAs a friend once told me, \"If you eat fancy steak every night, sometimes you just want to eat a greasy hamburger.\" Triage X is a big, greasy anime hamburger.\\n\\n\\n\r\nFinal Score: 7 \\n\r\n{Fanservice: 9 Parts Sexy, 1 Part Rule of Cool}",
            "date": "2015-06-11T11:41:00+00:00",
            "helpful_count": 87,
            "mal_id": 190098,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=190098"
        },
        {
            "content": "This anime changed the way I look at breasts. \r\nWhere should I begin with this mess of a series? \r\nWell seeing as the creators thought the most important part of the series was the female characters breasts I will start there. \r\nThe male character designs are OK, no real issues. Then you see the female characters and they all have breasts that are ridiculously huge. They look like they are painful to carry around. I'm watching an anime series where breasts are making me feel sick and I'm just in disbelief at how horrendous it all is. This series tries so desperately to be sexy,but ends up being as ugly as your mom. If you find the designs sexy then that's OK. I repeatedly felt uneasy looking at some of the images on screen; more on that later though.\\n\\n\r\nSo I have no issue with fan service. I've seen an anime where a 10 year old girl got cunnilingus from her sex slave and it didn't even phase me; that's what anime does to a guy. So even though that was a weird thing to watch, I didn't feel that disgusted by it, because the tone of the series wasn't serious. In Triage X every bad guy is a rapist. Almost every female character is dominated by a man at some point. Triage X is trying to be serious and that makes it so much worse. I'd pick out a scene as an example of its tone being a detriment to the series, but it's easier to point at it and say \"all of it is wrong\". People thought that this was worth creating. The series is as self aware as a piece of dog shit on the pavement, which is to say not at all self aware. Some people claim this series is meant to be fun. Well lets look at what \"fun\" the series has to offer.\\n\\n\r\nThe dictionary definition of fun: amusing, entertaining, or enjoyable.\\n\r\nTriage X's plot is primarily about people murdering rapists. How is this handled though? It shows a guy with sex slaves, he humiliates them then gets shot, repeat until end of series. So the creators of this series try their hardest to make sexy characters and then put them in situations where they are victims. Now I'm not saying the creators like watching fictional characters be sexually tortured, but they probably have a copy of Rapelay on their PC's.\\n\\n\r\nI'm not going to say you are a bad person if you get off to this series. It's not as if there is a network of PC's connected through a series of cables where you can stream videos of women having sex. You have to make due with Triage X's creepy guys drugging women and fucking them in dimly lit areas. When there's such little choice for visual stimulation in the world I can see why this would be satisfying to some individuals.\\n\\n\r\nOther than the gigantic breasts Triage X offers very little. The plot is uninspired, the characters are one-dimensional, and the animation and sound are average for this sort of thing. Overall I have to call this the worst anime that I have seen.\\n\\n\r\n- Thank you for reading my review. You don't have to like my opinions, but I'll still love you regardless. <3",
            "date": "2015-06-19T06:27:00+00:00",
            "helpful_count": 69,
            "mal_id": 190620,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3533067.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EspRyan",
                "username": "EspRyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=190620"
        },
        {
            "content": "Big Boobed Babes. Every season has to have at least one show filled to the brim with these and it Triage X has probably taken the title for most big boobed girls in an anime. Now for the sake of the review I'm going to completely exclude all the boobs and other extreme fan service. \r\nStory: 7/10\r\nIt was actually well.... interesting. An underground assassination group who got rid of the corrupt and other dangerous people in the city. However, it was only good as a concept because once it gets into the main story line it starts to become a jumbled mess. Having to figureout who belongs to who what their job is and role just became a hassle and ends up taking away from viewing pleasure. Not talking about the boobs.\\n\\n\r\nCharacters: 3/10\\n\r\nYea.... There's Arashi and Mikoto as the main duo who actually have pretty good chemistry together, though Mikoto starts to become a bit of a dispy girl in the end. And well theres no other way to describe them but big boobed pink hair, big boobed sword girl, big boobed nurse and that other big boobed girl who only says around 40 lines total. And then everyone else is basically pointless to try to remember. So as far as character development it can really only be either Arashi or Mikoto who receive some and good thing is they do, albeit brief.\\n\\n\r\nSound: 7/10\\n\r\nSo the sound is fairly nice to listen to, a lot of hard rock songs constantly keep an nice upbeat \"go fight em\" attitude. The OP and ED were actually pretty good but personally whenever I saw parts of the ED I just kept thinking about all the road burn.....\\n\\n\r\nArt: 8/10\\n\r\nNothing special but it has its moments. Most of the bike scenes and other action scenes looked very well done and the CGI was blended in nicely. \\n\\n\r\nEnjoyment: 6/10\\n\r\nIt was a nice little anime to pass the time so I liked it, but I can't recommend it to anyone just because of the boobs. \\n\\n\r\nScore (without boobs) 5.7\\n\r\nScore (with boobs) 4",
            "date": "2015-06-10T21:27:00+00:00",
            "helpful_count": 30,
            "mal_id": 190054,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=190054"
        },
        {
            "content": "What do you got when you combined, action, blood, guns, gore, big boobies and lots of eye-candy? You get something like this, a 10 episode anime whose theme, setting and plot are a complete oxymoron which is typical of studio Xebec, since most of it's genres are compose of popping eye-candy whose direction is complete head scratchier.\r\nNote: I haven't read the manga yet, so my review is only for the anime.\r\nStory\r\nThe story is just your typical vigilantes kind of thing where there is the usual good guys who fight against them bad guys out side of the law, which to me is ok. But, theones who are doing the crime fighting that involves people in the health care industry is kinda of awkward, but nevertheless it's ok, but how they got into that kind of side business is a big plot hole to say the least.\\n\\n\r\nMy verdict: A decent 4.\\n\\n\\n\r\nArt\\n\\n\\n\r\nFrankly it was typical of studio Xebec to always include eye candy in their genre, now let's face it the only thing that make this anime and manga sell is sex, which it the very mantra of every men's magazine where \"sex sells.\" Here the main selling point was mostly on the boobies, where distinguishing the young girls from the older ones isn't much a priority of the illustrator , in fact the youngest character Oriha Nashida can pass as a twenty-something bimbo. Despite of my disgust, those big boobies and some panty flashes really did got me. \\n\\n\r\nMy Verdict: a Very Good 8.  \\n\\n\\n\r\nSound\\n\\n\r\nBasically the opening and closing isn't my cuppa tea, also the character voices regardless of age doesn't have that youthful tone, in fact  Mikoto and Oriha doesn't have that teen age tone in it, were it that really doesn't impress me at all.\\n\\n\r\nMy verdict: a Poor 3.\\n\\n\\n\r\nCharacter\\n\\n\r\nFor the most part the character's themselves are either an oxymoron or a plot hole. So who were the characters?\\n\\n\\n\r\nArashi Mikami, the main protagonist whom as a child and a victim of a terror attack he received a lot of organ transplant from his dead friend  Ryu Mochizuki. Ok at first I find it hard as to how his body was able to cope up with multiple organ transplant in one operation, co'z in reality such operation would prove to be 100% fatal even with new drugs. The oxymoron about him was that he can ride a bike, so why does he have to ride shotgun along with Mikoto where both can shoot while riding? I was really unfortunate that he didn't even think about banging her while they were in the showers, which would have added more intensity to this anime and it was very obvious that the two don't mind being naked together.\\n\\n\r\n Mikoto Kiba, in the anime, it was never mentioned that she is of Yakuza royalty and her brother was murdered, but nevertheless, it was a big plot hole as to how she learned how to shoot and fight. Pretty much she just one of the eye candies in this anime. \\n\\n\\n\r\nOriha Nashida, the big plot hole about her was that she is this child prodigy / idol whom it was unknown as to how she got mixed up with being one of the members of \"Black Label\" who like things that goes BOOM! In fact that's what we the audience only knows about her.\\n\\n\\n\r\nSayo Hitsugi, about her, well at least we got know her beginnings, not much to say.\\n\\n\r\nYuko Sagiri, so how does a well endowed doctor got to be a master swords woman is a mystery at least in this anime.\\n\\n\r\n Miki Tsurugi, being an anesthesiologist was pretty much an oxymoron for her character, since a specialist like that only deals with the prevention of pain and not concocting brews like date-rape drugs or PCP's where she uses it to interrogated suspect and afterwards they won't remember a thing, geez , Manga artist  Shōji Satō really has no idea that such drug can be concocted by either a pharmacist or a drug dealer.\\n\\n\\n\r\nMy Verdict: Poor 3...blame it on Manga artist  Shōji Satō.\\n\\n\r\nEnjoyment\\n\\n\r\nTBH, it was the eye candy that provides the true entertainment than anything else, one can simply forget the rest.\\n\\n\r\nMy Verdict: Good 7 for the boobies and panties.\\n\\n\r\nOverall\\n\\n\r\nWelp, since it was obvious that this anime was rushed and poorly assembled there is no doubt that this anime should've  be better off left as a manga.\\n\\n\r\nSo my verdict: a Pathetic 1. \\n\\n\\n\\n",
            "date": "2015-06-10T19:53:00+00:00",
            "helpful_count": 14,
            "mal_id": 190047,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=190047"
        },
        {
            "content": "All I wanted was a fun fanservice anime to help embellish my ecchi bone like I am always known to do. Is this too much to ask for? Is it hard to make a fanservice anime that is actually fun? Unfortunately yes. I don’t deny the tough task of trying to make a fun anime that can please many people. However, when it is plainly obvious that the writers did not give this thing the time of day that it desperately needed from how it is presented, there is no excuse to justify laziness of this magnitude.\r\nFrom the beginning, I thought Triage X started outwith some decent, albeit typical, layout of the characters and story as this secret organization based on a hospital staff of girls. Fanservice was quite voluptuous with decent looking art designs on the girls as well as the guys, with an interesting shot of a nude guy’s butt interestingly enough. Then I watched episode two. Same thoughts by the end of it, even though the plot arc was kinda forgettable. Finally I got to episode three, and by the time I was halfway through it, I thought to myself, “Is this just episode one and two over again?” Not in the sense that it was literally like the previous episodes, but the fact that all of the episodes have a similar structure: Black Label helps with this situation involving kidnappings of partially naked ladies or other terrorist antics. That’s pretty much it. Sometimes these arcs feel as though they were an afterthought and that we are supposed to forget about them by the next episode.\\n\\n\r\nNow this wouldn’t be too bad based on how there are anime that are episodic in nature. But unfortunately, with the case of Triage X, it is, what I would call, a soulless anime. All of the characters have absolutely nothing to them that makes them even the slightest bit interesting or gripping. I came to this conclusion based on how predictable and formulaic they come across; if you’ve seen most seinen-type action anime, Triage X is about as typical as you can get from the genre. Not only that, but the writers don’t even try to give me a minute to let me get to know any of them to help me differentiate between each character. Because of this, I couldn’t really pinpoint a specific character trait that makes any of them unique. All they have going for them is that they are just characters to move the plot along, or lack thereof. This is never a good sign when you are trying to get to know any character in an anime.\\n\\n\r\nThere is even one scene where the girls have a spring bath scene together, because of course there has to be one, and converse about miscellaneous topics and events. The problem is that it is in the last episode when we barely even had time to get to know any of them to care. Of course, this problem of vapid characterization seem minor on the female cast compared to the main hero, Arashi Mikami. It’s not just the bland characterization that makes Arashi so bad, but also his poor charisma and personality. I would say that Arashi has the personality of a wooden board or brick but I think those examples would be too generous when describing. At the very least he has the audacity to admit that “nothing was resolved” near the end of the show to ensure that it was a mess from the start.\\n\\n\r\nThis poor characterization also comes down to just how incredibly poor the writing is. Not just that the dialogue itself is painstakingly awful, but just how stilted and awkward the voice actors portrayed it. Any character dialogue between each other felt very flat to the point where I almost felt like I was watching a hentai conversation taking place. That might seem ironic considering this is an ecchi anime, but there are a lot of ecchi anime that do conversations, even at the level of Triage X’s caliber, decent enough to be passable. The majority of the dialogue consists of constant exposition and predictable one-liners.\\n\\n\r\nWith Triage X being an action/ecchi hybrid, clearly you would think that they would balance the two genres accordingly, right? Well, that doesn’t seem to be the case since they are both executed with minimal efficiency. Action being the majority of what Triage X has going for it, it is by far the most lackluster I have seen in a while. This coincides with the criticism of the animation, which is sub-par at its best. Action sequences, at times, feel more finicky and less fluid because of this problem. Not to mention the amount of corners they cut that made the action such a jarring experience. There are even action scenes where the action felt incredibly rushed, to the point where it was already over before I had the chance to even start getting into it. By the time the fifth action sequence emerged, I started to lose interest to even try to enjoy the action.\\n\\n\r\nFanservice is usually the selling point to anime like Triage X. However, I was surprised and disappointed how little fanservice there was. And even when these fanservice moments happened, they were not super special to even watch the uncensored version for. In fact, if you just watch the uncensored version just to see some nipples and ass, I guarantee that almost all that time would amount to about five or six minutes, at most. I don’t count the ones that are involved in action sequences only because they mostly serve the action than the fanservice. Whatever how many panty shots, beach scenes, skimpy outfits, and boobs Triage X has going for it, they do not leave a lasting impression from how dry the animation direction is. This is especially even more surprising since this is the same studio that brought us Highschool of the Dead. While not a great show by any measure, at least had some semblance of a budget going for it. When your ED is literally just a girl riding on a motorcycle from point A to point B with her boobs slightly bouncing for no reason, no amount of budget could save laziness of that magnitude.\\n\\n\r\nI know this seems too big of a review for me to convince anyone that Triage X is bad, but it’s not just because it is bad. It is because it is the worst anime I’ve ever had the audacity to sit through. I was not angry during. I was not incredibly disappointed. I was just bewildered by how something this bad could ever be approved to go on air. Dropping this could not be done by me as I wanted to continue watching this to see if it could get any worse than before. The truth of the matter was: It didn’t get any worse or better because it was already at the lowest point of quality anyway.\\n\\n\r\nGrade: F-",
            "date": "2015-12-06T01:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 204895,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=204895"
        },
        {
            "content": "Triage X Production Committee:\r\nLead Producer [clapping his hands]: Okay, everyone, listen up. We had just been given the green-light to produce Triage X, a manga illustrated and written by Satou Shoji. You know, the person who did the illustrations for the Highschool of the Dead manga.\r\n[Everyone nods their heads and say, “Okay.\"]\r\nLead Producer [looking at the Triage X manga on the table]: Now, this may be embarrassing, but I had not read this manga, yet. I had just skimmed it recently, and I’ve noticed that there are many scenes involving big-breasted women shooting guns. Now, tell me. Besides, adding in large breasted women and guns,what else should be included in this animation production?\\n\\n\r\n[A few people look at each other, nervously, until someone raises their hand.]\\n\\n\r\nPerson A: But, sir, that’s pretty much it. The story could be summarized as this: “A group of vigilantes, mainly women and one man, go around killing people deemed as ‘cancers of society’.” You can think of it as a cheesy 70’s to 80’s film with lots of action and suggestive content. Other than that, there’s nothing else to it.\\n\\n\r\nLead Producer [confused]: Really? What about the character development? And the actions scenes, are they awesome and exciting?\\n\\n\r\nPerson B [interrupting]: There isn’t much in character development at all. All the female characters have big ass watermelons, like a size ‘F’ or ‘G’, attached to their chest and all they said is how much they need to get rid of the ‘cancers’ of society. The main guy character does get some development, but not much and his backstory of how he became who he is, is laughable.\\n\\n\r\n[Person B takes a deep breath.]\\n\\n\r\nPerson B: The action scene are somewhat ‘cool’ and ‘exciting’. There are many explosions, gunfights, and hand-to-hand combat action. Although, I have to question why civilians don’t hear these explosions and gunfights, and call the cops right away? But, whatever, logic is dead in this series!\\n\\n\r\nLead Producer [looking at Person B]: Okay. I understand that there is little to no character development, and the actions scene are cool, but unrealistic. But, we still need to add in other stuff, besides guns and large-breasted women.\\n\\n\r\nPerson C [clearing his throat]: Okay. Let me give you my suggestions.\\n\\n\r\n1. Add lots of fanservice material, such as bouncing breasts, boob physics, little to no clothes on, bathes and hot springs.\\n\r\n2. Add a fucking motorcycle because that shit is OP. \\n\r\n3. Have the cops/main detective be as stupid as possible\\n\r\n4. Have everyone wear dark glasses or have dark shadows covering their faces.\\n\r\n5. Make the villains do typical villainy stuff like torture women, drug women, abuse women; pretty much anything done to a women makes you automatically a villain.\\n\r\n6. Add lots of unnecessary melodrama and lots of pseudo-philosophical crap to make the main characters question crap.\\n\\n\r\nPerson C [thinking]: That pretty much covers it.\\n\\n\r\nLead Producer: Based on what I heard, it seems that there is a lot of fanservice material, is that correct?\\n\\n\r\nPerson C [nodding his head]: That is correct.\\n\\n\r\nLead Producer [pounding the table]: If that’s the case, then censor everything, I want the boobs censored by steam, scenery censorship or dark shadows. I want gore not too gory by reducing the amount of blood or turn the scene into a negative color.  And for the panty scenes, either pan the camera or add some objects to block its view. Are there any questions?\\n\\n\r\n[Lead Producer looks around the room.]\\n\\n\r\nLead Producer: Okay. If there are no questions, then let’s get to work!\\n\\n\r\nThe End",
            "date": "2015-06-22T11:20:00+00:00",
            "helpful_count": 11,
            "mal_id": 190931,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=190931"
        },
        {
            "content": "A review of *Triage X, an anime by Shouji Satou, the creator of Highschool of the Dead.* \r\nBased on a manga by the creator the infamous *Highschool of the Dead*, *Triage X* is the latest anime about guns, explosions, and over-the-top fanservice that follows a group of assassins that eliminate the \"cancers\" of society.\r\nAfter the first few episodes, Triage X showed promise beyond its fanservice exterior thanks to its intriguing concept. The focus on an individual character for a two to three episode arc actually provided slight character development and fun action sequences. Unfortunately, after a decent start, the writing takes a turn for theworst to the point where it is not even that entertaining anymore.\\n\\n\r\nAs with any work based on a manga by Shouji Satou, the characters have insanely oversized breasts. Fanservice in a fanservice series is not necessarily a bad thing. If that is the point of the anime, at least do the fanservice well, and that is not the case for *Triage X*. During the dramatic scenes, taking the series seriously is almost impossible with two large things that defy the laws of physics sticking out all the time. Even during the fanservice scenes, it is rarely “sexy.” Maybe it will appeal to a certain demographic, but not me.\\n\\n\r\nEven at a light 10 episodes, *Triage X* does little to make itself a worthwhile experience. Unless you are a fan of the manga, Highschool of the Dead, or offensively large breasts, do not waste your time with Triage X; it does not even manage to be a guilty pleasure.\\n\r\n_Watch if you like:_ Action, Highschool of the Dead, Fanservice,\\n\r\n*-3.5/10*\\n",
            "date": "2015-06-12T13:48:00+00:00",
            "helpful_count": 11,
            "mal_id": 190173,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=190173"
        },
        {
            "content": "Well I finished it moments ago so let's do a review.\r\nSTORY 3/10\r\nI think there was meant to be a story in there at some point... I didn't really catch it. So anyway, this is practically big tits fanservice the anime. If you like this kind of thing then go ahead and watch it. Let's see... I have little idea as to what they are even doing and the parts I do know I don't really care about at all. They didn't seem to be to emphasized. Something about childhood friend dying. I don't really know. \r\nAround the 7th or so episode they began to insertsome sort of story and then the season ends suddenly and I was kind of just thinking \"Well... I don't understand... Why is this so important? What are you doing? Is your repeated action necessary?\"\\n\\n\r\nART 7/10\\n\\n\r\nThe animation was fairly good though about 80% of what is animated is just breasts. I guess they did a good job...\\n\\n\r\nSOUND 3/10\\n\\n\r\nSound? I can't remember any sound. All I remember is the girls breasts swaying back and forth as she rode her motorcycle.\\n\\n\r\nCHARACTER 4/10\\n\\n\r\nThere was very little background given for a lot of the characters. I don't know, maybe the breasts have occupied all of my memories of this show. I can't remember any character names and I was looking at them recently before I began my review. I don't know I just don't think I care.\\n\\n\r\nENJOYMENT 5/10\\n\\n\r\nI guess I enjoyed it. It was okay. It was also predominantly just breasts.\\n\\n\r\nOVERALL 5/10\\n\\n\r\nI honestly believe they were just trying to insert as many large breasts into every frame as they could. I just... I don't even.",
            "date": "2015-06-10T14:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 190019,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4664945.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nyan_Pasu",
                "username": "Nyan_Pasu"
            },
            "url": "https://myanimelist.net/reviews.php?id=190019"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nWhen I was in the third grade, I came down with something pretty awful. My eyes burned, head ached, and I was sweating profusely. Plus, I had this terrible cough. I’ll never forget the x-ray I saw that day, with the huge blotch over my lung. The diagnosis came back pneumonia. Now, as a youngling, I had pretty much no idea the gravity of the situation I was in. All I knew was that I had to take this gross liquid because the pill was ginormous. I missed Halloween, too, which was completely unfair. Luckily (asme typing this should be evidence enough) I made it through this ordeal, and I owe it all to the medicine and care I received from both the doctors and my family. Triage X is “similar” in that “doctors” aim to eliminate “sickness,” but this anime is itself a disease in every sense of the word.\\n\\n\\n\r\nSTORY\\n\\n\r\nTriage follows Arashi Mikami, a boy whose body is half him and half the friend he saved during a deadly explosion. He, Mikoto Kiba, and many others make up a group of people who aim to excise the “lesions” of society to make the world a better place, one visit at a time.\\n\\n\r\nAnime is no stranger to “fan-service.” For those unfamiliar with the term, fan-service is (contextually) when an anime includes scenes or segments for the purpose of pleasing the audience. Normally, the vast majority of fan-service is of the sexual variety, as is the case here with Triage. A misconception that people often have is that all fan-service is automatically bad. Fan-service can be good or bad in the same sense that the narrative, characters, or any other facet of a show can be good or bad. What truly matters is the execution of it. In Triage’s case, the fan-service fails to deliver. It isn’t used as part of the plot, it doesn’t exist to accentuate a particular character or idea, and it certainly doesn’t come off as tasteful. Instead, the fan-service employed by Triage is overtly forceful, and so blatant that its only purpose is to distract the audience from the rest of the show. Furthermore, the fan-service is wholly lazy; it mostly boils down to a low shot of some woman’s panties or having the camera focus on her chest. There are other methods used – bathing scenes, clothes that are a bit too revealing, etc. – all of which aren’t appealing and instead feel tiresome after witnessing them for the umpteenth time in the same episode, let alone across the full series.\\n\\n\r\nWhat does lie behind the half-naked women and medically-concerning-sized breasts? It’s hard to say, really, because Triage itself doesn’t know. While the opening synopsis said that the show “followed” Arashi, this only occurs for maybe the first episode or so. Afterwards, the show flits between random plot lines in order to bring about some semblance of worth to the characters doing the doctoring. This would be at least acceptable – focusing on one character’s arc at a time – but there exist two problems that persist between each.\\n\\n\r\nThe first is the inconsistency in the cast. When the show sets its sights on another plot line, it seemingly forgets about many of the other characters. Think of it like tunnel vision; the anime runs with the idea it has for a particular arc without taking into account the characters around it. This includes both the mains and the sides. Many side characters exist for the express purpose of being dealt with in the arc they appear, sometimes within the first few minutes. The second is the isolation of the events themselves. Each arc does have actual happenings, despite everything that it does. But none of what goes down in one sequence seems to transpose to another. What this causes is a degree of incoherency that prevents the show from maintaining any kind of meaning. The group takes care of one problem in one place, with another popping up someplace else, without any of the separate instances having relevancy to developments made later.\\n\\n\r\nThis is excruciatingly true when it comes to the ending, which is perhaps one of the worst in anime to date. There is (at first) seemingly zero continuation from the previous events, with the resulting fan-service – now the unabashed focal point – being more confusing than arousing. There is some attempt made to explain how they got to this point, but it becomes lost among the “ghost stories,” some paradoxical talk involving certainty and uncertainty, and, once again, an irrelevant plot point. Yet, the icing on the cake is the final two minutes or so. It’s literally just Arashi walking down an expressway before cutting to black. When you look back at everything that it did, the finale is an ironically poignant way to define this tale: a whole lot of nothing.\\n\\n\r\nANIMATION\\n\\n\r\nThere is little to note when it comes to Triage’s overall art direction. The locations visited are typical for a city – a nearby dock with accompanying freighter, a television producing skyscraper, and a local school dot the landscape. It serves its purpose as being an area for the characters to interact in without doing much else. The show also decides to make use of CG for many of its motorcycle portions involving Arashi and Mikoto, but they always look too stiff and unnatural, coming off as displeasing to the eye. Censorship is also rampant, which heavily goes against the anime’s ideals.\\n\\n\r\nThe anime makes a “big” decision by having the majority of its female cast be equipped with breasts that are quite huge. There is a line, though, where the size of the boobs transitions away from believability and into comicality. This anime moves beyond this line, where the girls lose their provocativeness because of the absurd designs they are given. Oriha is attributed with an interesting look by having her a bit more squat and bigger in terms of size when compared to most female anime designs, but the diversity ends there.\\n\\n\r\nActual animation just barely manages to be average. The show does make the most of smaller details such as hair and cloth shuffling. There are also a lot of explosions, gun firing, fist throwing, samurai sword swinging, and other crazy action sequences. Nothing is too elaborate, but the show tries to do what it can. There is a lot of sitting with minimal facial expressions on top of this, but the anime alleviates this negative to an extent by providing a lot of motion for the breasts it always brings to the forefront.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Triage is, perhaps unsurprisingly, extremely mediocre. Important side characters such as Masamune (the lead doctor) and Isoroku (the lead detective) don’t receive nearly enough attention despite having a place in the plot. Some side members don’t even receive any sort of characterization due to only having literal brief glimpses of their person. Most prominently is Kaname, who seems to be the leader of the terrorist organization the group is fighting, but outside her laidback behavior, nothing else is known about her.\\n\\n\r\nCertain main characters like Miki and Mikoto are only known for their tiger-tooth and way-too-late romantic feelings for Arashi, respectively. Speaking of Arashi, he, too, succumbs to the anime’s inability to explore almost its entire cast. For him, there is talk about discovering his inner “self,” considering the situation he’s in mentally and the issue he experienced as a child. It’s all very strange, though, because it never seems as if he has a problem with anything he deals with. He doesn’t undergo turmoil, even when his subconscious – taking on a form resembling his friend – always warns or questions his motives. But Arashi never falters, going through with whatever he does, having some sort of epiphany about himself rather than learning from the dilemmas in front and around him. It also doesn’t help that, despite being the star of the show, he garners some of the least overall time on-screen, making it inherently difficult to work with his character development in the first place.\\n\\n\r\nThe only character that manages to do anything remotely worthwhile is Sayo, the blue-haired fighter. For the majority of the season, there isn’t much known about her besides the massive strength she wields and the mask she normally wears while brawling. However, following an incident against people similar to her, she “awakens” to her past, remembering the tribulations she had to conquer as a child to get to the point in her life she finds herself in. This doesn’t occur without her first going berserk; these traumatic memories resurface hard and fast, causing her to essentially lose herself once more. It isn’t until Arashi, whose problems mirror that of Sayo, comes to her rescue. Her character development is meant to exemplify the notion that the pasts we have are not something that should control us. Instead, we should embrace who were then because it helped to shape who we are now. She even attempts to instill her newfound insight onto the same people who led her down this path of enlightenment, signifying the change in her person. Sayo proves that Triage can, in some fashion, produce a character that isn’t fully forgetful.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme tries really hard to be cool, but it succeeds in only reaching this descriptor halfway. The first portion of the track is a lot of guitar without much substance, but the latter portion, with the dual vocals, does manage to have that “good guys versus the world” vibe to it. The ending theme, on the other hand, remains rather lame from start to finish. The instruments and beat sound an awful lot like the opening theme, but here, the track comes off a bit more hopeful and subsequently loses that cool edge it was undoubtedly aiming for.\\n\\n\r\nAs for the remainder of the soundtrack, it doesn’t have the strength to stand on its own. Many of the pieces take on a techno or rock-n-roll composition to coincide with the action taking place, and there is the occasional piano melody to round out those “touching” moments. But they aren’t nearly as impactful as they should be. Like the art style, the OST exists as background filler and nothing more.\\n\\n\r\nVoice acting is somewhere around average, with no notable performances to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis is a weird one for me, because I’m actually a fan of all anime, “ecchi” material included. But having the fan-service as forward as it was didn’t make me happy to see in the slightest. Rather, I would always question why it was being done in the first place. There are a lot of breasts and underwear to stare at throughout the entirety of this one, so my own personal questioning was happening a lot. Some characters could be cute at times, such as Mikoto or Arashi’s class friend Hinako, but they weren’t endearing enough to be too likable and not fun enough to get a laugh out of me. Even Oriha’s idol singing, which was designed to bring about happy times, did nothing for me.\\n\\n\r\nThere were a few scenes throughout the experience that were so ridiculous, though, that I did manage to smile. Chikage’s whole storyline was poorly handled to the point of hilarity and Kyouji, the over-the-top evil son of the gang leader, could not be taken seriously at all. That was somewhat the point of his behavior – he’s one of those “dumb” bad guys. He would fondle women, drug them, and force them to do his bidding; a real scumbag you love to hate. Sadly, he never got his just desserts because the anime didn’t complete his (the main) plotline. Which, at this point, should be expected from the show’s overall ineptitude.\\n\\n\r\nTriage X never wavers from its abysmal story, unappealing character designs, and boring sound-work. It can’t even do fan-service right, despite leaning on it for the whole series. Comparing what I went through back then to this one, I’d choose the pneumonia.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, poorly executed fan-service, inconsistent and incoherent plot, with one of the worst endings in anime\\n\\n\r\nAnimation: Bad, boring art style, bad character designs, average actual animation\\n\\n\r\nCharacters: Bad, nearly the entire cast is handled poorly with the exception of Sayo\\n\\n\r\nSound: Bad, okay OP, bad ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Bad, nothing sexy or attractive about the show, with some minor laughs caused by the absurdity of it all\\n\\n\r\nFinal Score: 2/10",
            "date": "2015-07-04T02:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 192252,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=192252"
        },
        {
            "content": "At first i liked the name, then i saw a edgelord with a helmet and he had 2 friends who are one fairly chested and another flat chested and the flat chested friend was jealous of the fairly chested and started rubbing her chest until it grew, it didn't.\r\nand then later on a guy touched this girls breasts and he said...\r\n\"That's strange...how many years has it been? I guess squeezing them really doesn't make them bigger.\r\nShe got salty and was going to punch him but he slowly levitated to the ground.\r\nIn the end he didn't needed his trusty bike or his edge fairly chested friend,he simply walked away with his only friend, his vibranium helmet\\n\\n\r\n10/10 anime and 11/10 Jiggle Physics, surpassed even DOA5 and Rumble Of Roses at the same time.\\n\\n\\n\r\nBoing Boing! Uguu~",
            "date": "2015-06-19T14:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 190661,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2409897.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hyperzinuh",
                "username": "Hyperzinuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=190661"
        },
        {
            "content": "Warning: The following review will contain sarcasm to a certain degree, be 100% Subjective and focused on the Anime,  and will be ignoring any Manga or Light Novel related  \"cannon\" material if the Anime is based of one.\r\nStory: Now I felt that the story here was great, I loved what the plot in the start based itself around and what it came to chase and how it was portrayed. To me it was new, exciting and as mentioned above: I could relate to it as something this world would not take harm of having - a organisation that cleans out what we don'tneed more of / at all. Although I feel that the story drifted a bit towards the end - they still kept true to the main \"goal\" which is nice although a CERTAIN episode which I had looked forward too for some weeks since it's start let me in a bit of disappointment as Mr Steam winded up stealing the show and making the plot seem irrelevant compared to the \"service\" at display - a true bummer. To have a Anime with a story that hits me SO good but to have it \"leave\" in such a manner really knocks me down.\\n\\n\r\n~ Story: 5 ~\\n\\n\r\nArt: There is little to say about art these days, which a few exceptions of course but Triage X had nothing that was MIND blowing but not bad either, I personally thought this art style was great and didn't mind the few bits of CGI which was displayed as they made it blend in better than what I have seen other animes manage to display - Yet, suffice to say I am not that much of a fan seeing the MAIN character have SUCH an expression: it was made up for once I learned what he had been trough, I also think I'd be left with a permanent face like that if it was the case.\\n\\n\r\n~ Art: 7 ~\\n\\n\r\nSound: I don't judge this part as I am not the type of person to pick on sounds nor music, all I really care for is if the MAIN theme song (Intro song) and the \"highlight\" song (Example: The one played off when the MC is about to kick some a**) is alright. And sounds otherwise, I will point it out should something REALLY be off but in this anime I didn't find anything in particular.\\n\\n\r\n~ Sound: ?? ~\\n\\n\r\nCharacter(s): Oh yes! Most likely what I enjoyed the most about this anime besides the plot: the characters! Like so many other of my favorite animes I feel that Triage X did a good job melding together all these different personalities and looking characters in a mix that winded up leaving me with a gang of people which made me smile, laugh, cry, grit my teeth, drool and much more. That is what I WANT from a anime, personalities that -ALTHOUGH nothing can be called 100% original anymore: they make it feel so due to WHO they are, HOW they are put together and WHAT they make of it, good work done here in my opinion.\\n\\n\r\n~ Character(s): 7 ~\\n\\n\r\nEnjoyment: Did I enjoy Triage X? Yes. Why did I? Simple: when you take all of the posts above and mix it together, you get the type of anime I appreciate despite its flaws - where one here might have been \"big\" to a certain degree, I can look over that for everything else. And would I RECOMMEND anyone to watch Triage X? If you like action, some story here and there, a aggressive plot with characters like shown here: then yes. I would recommend it for those out there that might have missed out this tiny gem.\\n\\n\r\n~ Enjoyment 7 ~\\n\\n\r\nOverall: Triage X came off to me to begin with as a action filled Anime of which you don't see the likes off all the time. One with content that needed to be censored upon release which was not just ONLY erotic material and that had a story-line / a plot which might as well could have been based on something we need to do in this world - Removing the tumors of society: this was something I loved and it grasped a hold of me and made sure I held out til the very end - which I was a bit sad to see that only was 10 episodes. It has what a good Anime in my eyes need - Action, alright Music, Art which is acceptable, characters that I feel match together in a functional way and of course: some fan-service. Triage X is a anime that will make you wonder what you are watching if you are not into this style of anime, but for those who likes this style - They are inn for a great 10 episode anime which will leave them taking a long walk down the local main road.\\n\\n\r\n~ Overall: 7 ~",
            "date": "2015-06-19T10:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 190642,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rexxgrim",
                "username": "Rexxgrim"
            },
            "url": "https://myanimelist.net/reviews.php?id=190642"
        },
        {
            "content": "In the end, everyone needs a breast and titties show once in a while. \r\nWhen the series started airing, many people has been dazzled by amount of boobs bounce with hot upbeat steam, it beats and jiggle so hard that you can’t help but to amazingly stare. Moments of scene, where 95% of the series time has been cover up by this wonderful piece of art. However, it would be a great mistake to simply judge and dismiss this series based upon first impression. \r\nThe show premise is actually interesting while it is not really exploiting of the whole potential of the theme. It’s goodbut the half potential to make it better also has been wasted. Maybe because considering the short episode, some of moments kinda rushed and they don’t have the approximated time to create a fine piece of series. If the episodes could be extended more, I think the story line will be improved a lots more. In this show, we meet a Chairman of Mochizuki General Hospital named Masamune Mochizuki that has a special unit assassin under him to cures the dangerous disease that has been spread among the community all over this time. However, this disease is special and not affecting physical or mental health. To put it clearly, the disease is none other than Corruptions, Illegal drugs business, and any other high rated crimes that has been pointed as black zone evil deeds. Thus, this assassin has been sent out to annihilate the “cancer” of disease out from community. To make it easier, it’s like Japanese version of swat. \\n\\n\r\nFight scene in the series is also one of few reasons why I like about in this series. Triage X has many good fight scenes I’ve ever seen involve the main lead. Put aside the magic stuff behind, their fight scene has been put out nicely. Altogether it turned out as a surprising element to me. Not involved sword or magic stuff, just practically about fight between a fist and kick. It’s that simple, yet many of us really love that kind of fight. \\n\\n\r\nOur main lead also definitely worthy of praise. He’s not indecisive type of person. Nowadays, anime industries overwhelmed with indecisive type of main lead that only act in the nearly last minutes or never ever fight back for what they loved until it already too late or gone from their grasp. Arashi while on the other hand showed firm principle and resolution through the series. He also had shown us that he is not hesitating to do something even though he is already cornered by the enemies. That’s particularly interesting to see once in awhile. Furthermore, the development of character keep improved which I totally love to see. It’s fine if slow, as long as it’s there. \\n\\n\r\nHowever the series still has its own flaws. There is rarely a male fighting a male fight scene. Most of the character in the series also female overwhelmed the male. I prefer of it being balanced, that’s better to see. Boobs scene is totally unneeded; I love when they put ecchi moments, but when it cover up almost all of the time, that’s just porn. The plot also has been forced, and rushed which make it looks ridiculous and honestly speaking both OP and ED totally bad. \\n\\n\r\nI had my share of fun. The series might be ridiculous, but I do enjoy those moments. If you want to enjoy the series worth, then don’t think too hard. It’s generic but somehow I think that’s better. Some shows try very hard to be different that just make them worse. In this one, you can still enjoy what it had to offer beside the boobs.  \\n",
            "date": "2018-01-18T23:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 268998,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=268998"
        },
        {
            "content": "Now Triage X is nothing more than adolescent misogyny that was typical of anime that first got anime marketed to the United States in the first place; so we can stifle all that. Let's explain why I initially gave it an eight despite all it's obvious \"flaws\". If the character designs, outfits, \"nudity\", etc. offends you, then this wasn't marketed towards you. Further if the violence, rape culture,  and drug abuse offend then this is really not marketed towards you. AND I will take this moment to tell you to avoid Triage X.\r\n However; if you want a more adult anime an anime thatreminds us that not all anime (or any media for that matter) need to be intended for kids. Just look at the picture for this show, if you saw that and thought let me watch this what did you expect? A romantic comedy in a high school nurses office? Plot and story? Drama? Nope!\\n\r\nIt's buxom women, guns, and motorcycles, period. Some bad people get killed, explosions happen, it's got all those bad things that some people don't like. Which is why I gave it a six; it has content that isn’t for everyone. If that's what you want, then it's gold and delivers! It makes me nostalgic for the OVA days that kept me into anime these decades.\\n\r\nIt's like I said about Diabolik Lovers, if this is exactly what you're looking for then it's a treat. The difference is, I can imagine a target  audience for Triage X.\\n",
            "date": "2016-12-12T22:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 235364,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=235364"
        },
        {
            "content": "What can I saw about Triage X. Hm, well, the premise was decent. I like the idea of mercenary assassins killing evil individuals in order to protect the world and keep corruption from spreading. Unfortunately, I don't think this anime quite reached its true potential. Why? Because they focused too much on the boobs and not enough on the plot - I mean the story. What at first sounds like an interesting story filled with action and a multi-faceted plot soon becomes an anime that is essentially boobs and violence. Now, there is nothing wrong with this, but when I went into the anime, Iwas expecting something a little more serious than jiggling breasts. I mean, I kinda knew there would be some fanservice, but not this much. While I'm not sure I would have minded this in another anime, in this one, I feel like the story itself suffered because the animators focused more on making every woman's boobs bounce than they did on making a good story. This anime is basically an urban fantasy version of Queen's Blade, which has been hailed as one of the greatest failures in anime history.\\n\\n\r\nThis story had its hand in way too many genres. It's basically a secret society show about high school teenagers and large-breasted women who work at a hospital during the day and secretly assassinate people by night. It tries to be a slice-of-life high school show, a medical drama, an action series, a crime mob series, and worst of all, a bad fanservice series. Now, contrary to my complaints, I do not dislike fanservice. I don't. If the anime does it right, I can enjoy fanservice as much as I do every other genre. I love To LOVE-Ru and its epic boob falls, Highschool DxD is one of my favorite anime, and I thought the fanservice in Cat Planet Cuties was adorable. But this? Triage X's fanservice is just a bunch of women with swollen, misshapen breasticles. Seriously. I don't even think the guy who did the illustrations for this knew what a real pair of breasts look like. Every girl in this anime has tits so large they'd sag. It's disturbing. And the fact that even the high school girls have boobs that big makes it even worse. I love fanservice, but even in a bad fanservice show, I at least expect the illustrations to be gorgeous. These just bothered me.\\n\\n\r\nNow, let's take a look at what this show failed at. First off, the high school aspect of the show. We're basically given nothing about this. We see a few scenes where two of the characters are in high school, but that's about it. It's never developed beyond being there to tell us that the characters are leading a double life. The medical aspect of the show is like a really bad metaphor. The entire idea is that these people are doctors who exercise tumors, and the people they assassinate are the tumors. While that sounds really cool, the idea never went beyond the metaphor phase. The crime aspect could have also been interesting, but I don't even think the people directing this knew how real crime lords and drug cartels acted. Every bad guy was basically just an insane scumbag who committed crimes with all the subtlety of a bull in a China shop. They didn't even try to stay below the radar. They didn't try to be clever. You know that girl in the GIF image with arrows on her nipples? Yeah, that's basically how every criminal is in this story - about as subtle as a jack hammer. It's completely ridiculous.\\n\\n\r\nThe problem is none of these themes mesh. It doesn't help that all of the characters are one-dimensional. Perhaps its because the director tried shoving too many genres into a 10 episode series, but none of the aspects work well together, and the character's aren't fleshed out enough to carry the story on its own. Maybe if this story has 24 episodes to develop its characters, it could have been better. But then again, I feel like if this anime had 24 episodes, it would just be 14 more episodes filled with nothing but oversized breasts.\\n\\n\r\nNow then, despite all of my complaints, this anime did do some things right. The animations are sick, like, awesome sick. The animators were really spot on with keeping the animations fluid, and all of the characters stayed on model, so you didn't have any characters who suddenly looked different because they couldn't retain that characters unique design while animating. Considering this anime has a lot going on, that is a very impressive feet. However, aside from the technical aspects of this anime, nothing else about it really stood out as good to me.",
            "date": "2015-07-18T09:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 193725,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4266195.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bvarnell89",
                "username": "Bvarnell89"
            },
            "url": "https://myanimelist.net/reviews.php?id=193725"
        },
        {
            "content": "From time to time, one has to rinse the palette with some unadulterated craziness.  When going into Triage X one should expect to see sex, violence, drugs, and rock n’ roll in all its hedonistic glory. You will be treated to a cast of curvy girls with a range of different personalities, and a premise ripe for a violent journey into the criminal underworld.\r\nHowever, does the anime live up to these expectations? Looking at it as something in the exploitation-genre, the series succeeds in putting all the ingredients in place, but the actual execution offers little to nothing. Despite the fact that its maindraw is action and fan-service, it lacks most of the things that can make it entertaining, which is over-the-top spectacle, a seductive tone, and character-chemistry.\\n\\n\r\nRegarding the animation, I cannot find much to complain about as the design and the fluid motion were executed well. The soundtrack, while nothing too spectacular, fits the series and does its job with its rock n’ roll tunes. On a technical level Triage X succeeds in being presentable. The direction however needed a better grasp on how the premise could have been made more fun. I’ll give examples below.\\n\\n\r\nBig-breasted characters may appear on-screen, yet they just stand there half the time doing nothing of interest, tits are simply shoved in your face casually. There is a difference between being in the viewer’s face about it, and being seductive, making something taboo and tempting. On the opposite side of the spectrum, the show goes from casual to dark and edgy in a heart-beat, taking its time to victimize the women on display, corrupting them into mindless freaks hooked up on drugs, or abusing and torturing them for sadistic pleasure. While this is only what one might expect from exploitation, the fun is sucked out when presented in a flavorless and mean-spirited way, hovering dangerously close to being offensive had it not been a show you're not supposed to take seriously. \\n\\n\r\nSame thing applies to the action, there is a difference between action and violence, with the former being about exciting feats like jumping out of an airplane, while the latter is about making you wince at something that looks painful. The majority of Triage X focuses on violence that is quick and bloody, rather than exciting stunts, speeding chases, or explosions. This is why I would argue that the show can only be enjoyed on a technical stand-point, it’s just a good-looking series of uneventful things flying by.\\n\\n\r\nWhat I missed the most was the dynamic between the characters. I can only count two scenes where they interacted in interesting and exciting ways. I will take my hat off for the back-story and fleshing out they provided for the main character and two of the girls. This is however something I had hoped to see more of through-out the series with the rest of the cast.\\n\\n\r\nTo sum it up, Triage X is a series that misses its mark, with action that isn’t memorable, undeveloped characters, and fan-service that offers no sexual tension. Last but not least, with a plot that ends up unresolved in the end with very little being accomplished, I would recommend skipping the anime entirely as it is a waste of time.",
            "date": "2015-06-19T03:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 190614,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4319803.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Markezzo",
                "username": "Markezzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=190614"
        },
        {
            "content": "This anime is incredibly straightforward, wherein if you watch the first episode you'll have a pretty good idea of what the rest of the show entails. The story is focused on conspiracies, corruption, and the underground of society being cleaned up by vigilantes, which isn't too original, but it works well enough. The focus here is on the action, though only in rare cases does this action ever involve strategy or any depth to it. Rather, most of the time, it's just really fast, cool, and full of explosions. Whether that's enough to support an entire show depends on personal preference. There's an overarching storyrelated to a drug and factions that are trying to take control of it, however, this story doesn't get anywhere close to a resolution, as the anime ends in the middle of the arc it seems like, and the attempt at trying to make it feel more complete by ending it on a side mission didn't help at all. Furthermore, the story itself felt kind of rushed, particularly in terms of the villains seeming like they die too quickly as they have complexity to their motivations and backgrounds hinted at but never expounded on. I'm not sure if the original story itself was lacking in that regard, or there were issues with time, but overall it felt like it needed more episodes. While the plot was lacking, I will say that I liked the character set quite a bit, wherein all of them looked and acted pretty awesome, and there were some good emotional moments throughout, of especial note is Hitsugi who actually had a pretty great character arc if you take into account the OVA. She's an exception though, as most characters don't really get much development at all, but regardless they pull off being really likable, which is the other core aspect that supports the anime.\\n\\n\r\nI liked how clean the art style was and loved the designs, but it felt quite low budget at times, especially in terms of animation. The soundtrack was far better than you would expect of a show like this, though that ultimately just comes down to a couple tracks. The OP/ED are pretty solid and fit well with the sense of style the show is trying to portray. The ED on the last episode was cheap as hell though, and they probably just should have used the normal visuals.\\n\\n\r\ntl;dr: A show that for better or for worse is focused on style over substance but does well enough in that regard.",
            "date": "2018-12-03T08:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 295189,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=295189"
        },
        {
            "content": "So, I came across this anime a while back. It seemed like a pretty good piece to check out. Since I love the animation and ecchi, I decided to give it a try. \r\nMy first impression of this anime was actually better than my last. I honestly expected this manga to be like highschool of the dead but it turned out to be more like Perfect Half ( https://mangazuki.me/perfect-half/ ). Since I didn't Love this anime that much I'll only talk about the good parts.\r\nCharacters: 8/10\r\nThe characters were the only thing good about the anime. They had the whole theme built around them. I wasvery curiously to see if there was some development in their behavior and finally got to see that(at least).\\n\\n\r\nThe ecchi: (8/10)\\n\\n\r\nSince very few people add this into their review, I'm one of the people who do, Ecchi had become a famous and important genre for the success of any anime. A good anime needs to have good ecchi scenes. This anime particularly had some very good ecchi scenes coupled with good animation and art \\n\\n\r\nThis anime had a lot more potential to become of the best anime out there but sadly it failed",
            "date": "2018-07-03T13:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 282896,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3693803.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blacklotiss",
                "username": "Blacklotiss"
            },
            "url": "https://myanimelist.net/reviews.php?id=282896"
        },
        {
            "content": "Triage X was a interesting anime. Take out the numerous amounts of boob showing and it's a decent series.\r\nThe one thing that I didn't like was how the series ended...\r\nI didn't even notice that the series ended properly until I checked how many episodes were left\r\nTrue at the end it was kind of obvious what with a scene playing the ending song\r\nBUT!\r\nI hoped for more details on what happens afterwards\r\nOverall the show was great; it was interesting to see what the backstory of the characters were however I wished they could have at least made 20 episodes to continue on with the story.....\r\nMainly for peoplewho either like action/boobs (not trying to be offensive or anything but honestly the number of times boobs are shown is just..... a lot okay!) or have read the manga and wanted to see the animated version of the series",
            "date": "2015-07-03T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 192228,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=192228"
        }
    ],
    [
        {
            "content": "If Michael Bay ever made an anime, it'll be like Triage X. \r\nI've stated in the past that a lot could be gathered from a show's 1st episode, but it's rare that I come across cases where the very 1st opening scene sums up the anime just as well. Not even a full second into Triage X and the 1st thing the audience is greeted with are melon-size oppai. With that being said, leave any sense of decency you may have at the front door, and revert back to your hormone-filled pubescent days because Tri-hard X is as brazen as it gets.\r\nGUNS!!!.. BOOBS!!!.. EXPLOSIONS!!!.., annnnndMORE BOOBS!!!\\n\\n\r\nLet's face it; there are only two reasons for anyone to watch this:\\n\r\n#1, for the \"plot\" \\n\r\n#2, for the \"plot\"\\n\\n\r\nBut as far as the actual content goes, there's very little here worth discussing. This is an anime that exists solely as a container for boobs and action. Any plot points brought up that gives hints towards a character or narrative arc goes nowhere. From the mysterious inner-workings of the various organizations that the viewer is made aware of to the straightforward overarching narrative that contained it, all of it was merely brushed over. Mini-arc formats that began with no buildup and ended with no solid conclusion. Outside of being an advertisement for the manga and all the \"plot\" it may contain, Triage couldn't be bothered with the trivial matter of \"caring.\" But man cannot live off boobs alone, so in substitution for a story, the show gives us chicken scratch that vaguely passes as one.\\n\\n\r\n This chicken scratch was manifested with our protagonist, Arashi Mikami, as we find out that he's a part of a band of assassins that kill off members of society that they deem unworthy. With the help of a few armed titties with legs and his weapon of choice, they take on several assignments where they're tasked with cleaning house, leaving no grunt unscathed and no boob untouched. Wait, boobs and assassins? Is this Akame Ga Kill 2.0? All shit talking aside, the show could have done a lot more with the material than what it aimed for. No, I wasn't expecting much, to begin with, but they made no effort in hiding the fact that it was only there to boost sales and intrigue for the source material. The anime did very little to stand on its own, and it reflected profoundly on its drab presentation. The most we get are hints towards something brewing just below the surface; hints that ultimately panned out to the creators saying \"Just go buy and read the manga already.\" This was marked off with an underwhelming ending that even the show's protagonist seems to be aware of, as the closing lines delivered by him felt like the studio's way of saying they simply didn't give a fuck: \\n\r\n\"No. Nothing's been resolved.\"\\n\r\nThey just went about finishing it without a proper resolution or care in the world, giving the audience narrative blue-balls in the process. Everything was just left up in the air, like the Freeze frame ending of an 80s movie. To give you an idea, it's like if I stopped writing this paragraph mid-senten\\n\\n\r\nThe art/animation was relatively simplistic, which is a shame since I thought it was the perfect material to push boob physics even further. Although there was nothing overtly offensive about the production, there was also nothing impressive about it either. It was just the bare minimum needed to get by, almost cynically pushed off an assembly line with the paint still wet. \\n\\n\r\nAnd just like the animation, the soundtrack was equally generic, with your usual J-rock opening and OST that does nothing to stand out. Every musical cue felt incredibly phoned-in. The music fits the show in the same way every tween TV drama has your typical strum of an acoustic guitar hanging in the background. And as your eyes glaze over from watching GUNS, BOOBS, EXPLOSIONS, the soundtrack is just there, chiming along in the most unassertive way imaginable.  \\n\\n\r\nBut enough of that, time to cover the wonderful people we follow throughout Try-hard X's episode run. \\n\\n\r\nI'm hesitant to even refer to this cast as \"characters,\" honestly speaking, there's only one actual person in the entire show. The rest is bodypillow models in the making. Our main protagonist, Arashi Mikami, is as stoic as they get, in other words, he has as much personality as a brick wall. With a brooding personality stuck in angst hell and dialogue equally as stiff, every moment he's on screen, I could just feel a bit of my soul being sucked out.\\n\\n\r\nThe rest of the cast can be summed up with a simple formula: archetype + boobs\\n\\n\r\nThey're all busty females with one predominant personality quirk, so basically, well-endowed smurfs. The only \"development\" they get are the ones hanging from their chest. Of course, this is only a bad thing if you were expecting more, but if you just came into this for dumb action and TNA, then this character lineup is godsent.\\n\r\nThe antagonists were all overblown manchildren. It helped add to the campy nature the show unintentionally stumbled in. Also, none of them were afraid of groping a few sweater puppies either, so expect a lot of fun \"boob-play\" sessions. \\n\\n\r\nGUNS, BOOBS & EXPLOSIONS; a tried and true formula \\n\\n\r\nWhile Triage X was flawed on every level imaginable, it still managed to keep me entertained. I was brought to a time in my youth where sex and violence were all it took to appease me. It was certainly good schlock entertainment at times and if nothing else, kept my interest long enough before abandoning ship.\\n\\n\r\nIf you're simply looking for an easy-to-consume time-waster along the lines of a brainless blockbuster, then Triage X should fit the bill. And while it plays out well in that sleazy entertainment realm that it shamelessly occupies, you'll be hard-pressed to find anything else here. It's a show that focuses more on the \"plot\" than it does the plot and is very much aware of its ploy. The lower you set your bar, both in terms of standards and maturity, the better, as Triage X is wholly satisfied with its awarded consolation prize of being lowbrow smut.",
            "date": "2015-06-14T08:35:00+00:00",
            "helpful_count": 146,
            "mal_id": 190312,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=190312"
        },
        {
            "content": "\"I wanted to see if all human beings had a conscience. When they realize that their evil deeds have brought them death, do they feel regret?\"\r\n(This review, nor this series is nothing so pretentious)\r\nPreface: \r\nAh, Triage X. Heralded as \"that\" anime that crops up every season, promising huge bra sizes and more swinging breasts and panty shots than you can shake a stick at- Triage X does that and more. In more than one way, it's the spiritual successor to the long pined after season 2 of High School of the Dead, and in its own way ends up being something else entirely. It's kindof the Rugrats: All Grown Up version of HOTD, if you will.\\n\\n\r\nBefore I start reviewing, let it suffice to say that nobody went into Triage X looking for an emotionally moving, intellectual, character driven plot... No, it's just dumb fun.\\n\\n\r\nLet's get into it, shall we? \\n\\n\r\n(Note: I'm going to break out the fanservice scale again for this one.)\\n\\n\\n\r\nArtwork and Animation: 7 {Fanservice: 10 Bouncing Boobs out of 10}\\n\\n\r\nI hadn't seen anything by Xebec before, but I have to say that it looked just fine. The bloody gunshots, dismemberments, stabs, rips, gouges, beatings, and many other wounds were appropriately juicy. There are currently censors on the versions that are available to watch now, but I assume it will be filled to the brim with giant breasts and butt shots when the home video release comes out. Truly bringing Shoji Sato's vision of the perfect look to life.\\n\\n\r\nI'm not really sure how low the budget is, but it doesn't bother me. The CGI bike actually looks decent too. (Maybe I've been watching some badly low budget stuff lately and am tainted.) \\n\\n\\n\r\nSound and Voice Acting: 8 {Fanservice: 8 Sexy Moans out of 10}\\n\\n\r\nNothing really to complain about here. One standout though, and that's Fuyuka Ooura as Dr. Yuko Sagiri. Also the voice of Miyo Takano, she really brings the chilling, dangerous element to the voice part here.\\n\r\nThe opening and ending songs are solid J Rock stuff, and the insert songs are mostly hard rock that fit the action, and string sections for more serious parts.\\n\\n\\n\r\nCharacters and Story: 6 {Fanservice: 8 Hyped Up Set Pieces Involving Action Girls!}\\n\\n\r\nOkay, let's be real. These characters' backstories, aside from Hitsugi and Arashi, are NOT explored. In the grand scheme of the show, does it really matter? This show about action girls with implausibly large chests being super badass and not takin' no shit. It's not a character drama, it just needs some people in there that you can watch rip shit up. \\n\\n\r\nThis is high action at its best. Ultraviolent at times (Execution style headshot with a crossbow into a burning warehouse, YEAH!). Ultrasexual at others (Bath scene while discussing torture methods- shout out to Higurashi!). They even got the Mad Max (and more recently 'cool' in Walking Dead) *cuffed to something, throws a hack saw* \"You can saw through your arm faster than you can get through those handcuffs, if you want to get away\".  (Lampshaded, too- for good measure)\\n\\n\r\nOverall, full of cool action scenes taken straight out of famous movies- bike chases, crashing through windows, biological weapons, torture, huge shootouts, explosions, skyscrapers- it's a giant mashup of action cliché where everything is over exaggerated. This is the essence of Shoji Sato. \\n\\n\r\nTriage X does actually have a functional episodic plot, objectively speaking. I don't know if you've seen Dexter, the Showtime series, but Mr. Sato ripped the plot off, adding a medical theme and some hot chicks instead of a psychopath who shoots 3s (except for Yvonne Strahovski). \\n\\n\r\nIt's that coupled with a late night titty movie with action girls, except in TV form. It's a 10 episode version of those lovably bad B movies that come on really late at night that you watch drunk or when you can't sleep.\\n\r\nThis isn't prime time TV, this isn't movie theater stuff. It's a bargain bin item in that sketchy, dark corner of the video store with the stained carpet under that blinky light. \\n\\n\r\n(If you don't know- Dexter is about a forensic investigator who moonlights as a serial killer of people he believes escaped justice).\\n\\n\\n\r\nEnjoyment and Overall: 9, 7 {Fanservice: 10 Jiggly Pairs of Physics Breaking Boobs}\\n\\n\r\nI can't convince anyone else that it's lovable schlock and not utter ecchi harem garbage, but it's in fact the B movie kind of schlocky! (B is for \"best\"). However, if you fux with High School of the Dead, you probably like Shoji Sato's work, and it's the perfect schlock. I think Shoji Sato is a secret genius. \\n\\n\r\nI also think Triage X and HOTD are both great for what they are- giving these hardcore ecchi fans what they want, no matter how vehemently they deny it! People want ambiguously underage girls with huge boobs shooting stuff up, along with a blank slate main male character who gets all the Tang to project themselves onto.\\n\\n\r\nIt's true. \\n\\n\r\nLook at the state of the anime industry today- As I said above, there's always that anime, (or several of them) that does nothing but pander to its sexually repressed audience. Shoji Sato knows his audience, and he is laughing all the way to the bank. \\n\\n\\n\r\nWrap-up and Recommendation:\\n\\n\r\nIf you like High School of the Dead and are looking for even bigger action and boobs (Yuko has a 43.7 inch band size, holy impossible two headed cow!) you have come to the right place. There's just enough story to keep it moving onto bigger and badder set pieces, and is really the only anime this season I've been excited to watch every week. Call me a weirdo, masochist, whatever. \\n\\n\r\nAs a friend once told me, \"If you eat fancy steak every night, sometimes you just want to eat a greasy hamburger.\" Triage X is a big, greasy anime hamburger.\\n\\n\\n\r\nFinal Score: 7 \\n\r\n{Fanservice: 9 Parts Sexy, 1 Part Rule of Cool}",
            "date": "2015-06-11T11:41:00+00:00",
            "helpful_count": 87,
            "mal_id": 190098,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=190098"
        },
        {
            "content": "This anime changed the way I look at breasts. \r\nWhere should I begin with this mess of a series? \r\nWell seeing as the creators thought the most important part of the series was the female characters breasts I will start there. \r\nThe male character designs are OK, no real issues. Then you see the female characters and they all have breasts that are ridiculously huge. They look like they are painful to carry around. I'm watching an anime series where breasts are making me feel sick and I'm just in disbelief at how horrendous it all is. This series tries so desperately to be sexy,but ends up being as ugly as your mom. If you find the designs sexy then that's OK. I repeatedly felt uneasy looking at some of the images on screen; more on that later though.\\n\\n\r\nSo I have no issue with fan service. I've seen an anime where a 10 year old girl got cunnilingus from her sex slave and it didn't even phase me; that's what anime does to a guy. So even though that was a weird thing to watch, I didn't feel that disgusted by it, because the tone of the series wasn't serious. In Triage X every bad guy is a rapist. Almost every female character is dominated by a man at some point. Triage X is trying to be serious and that makes it so much worse. I'd pick out a scene as an example of its tone being a detriment to the series, but it's easier to point at it and say \"all of it is wrong\". People thought that this was worth creating. The series is as self aware as a piece of dog shit on the pavement, which is to say not at all self aware. Some people claim this series is meant to be fun. Well lets look at what \"fun\" the series has to offer.\\n\\n\r\nThe dictionary definition of fun: amusing, entertaining, or enjoyable.\\n\r\nTriage X's plot is primarily about people murdering rapists. How is this handled though? It shows a guy with sex slaves, he humiliates them then gets shot, repeat until end of series. So the creators of this series try their hardest to make sexy characters and then put them in situations where they are victims. Now I'm not saying the creators like watching fictional characters be sexually tortured, but they probably have a copy of Rapelay on their PC's.\\n\\n\r\nI'm not going to say you are a bad person if you get off to this series. It's not as if there is a network of PC's connected through a series of cables where you can stream videos of women having sex. You have to make due with Triage X's creepy guys drugging women and fucking them in dimly lit areas. When there's such little choice for visual stimulation in the world I can see why this would be satisfying to some individuals.\\n\\n\r\nOther than the gigantic breasts Triage X offers very little. The plot is uninspired, the characters are one-dimensional, and the animation and sound are average for this sort of thing. Overall I have to call this the worst anime that I have seen.\\n\\n\r\n- Thank you for reading my review. You don't have to like my opinions, but I'll still love you regardless. <3",
            "date": "2015-06-19T06:27:00+00:00",
            "helpful_count": 69,
            "mal_id": 190620,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3533067.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EspRyan",
                "username": "EspRyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=190620"
        },
        {
            "content": "Big Boobed Babes. Every season has to have at least one show filled to the brim with these and it Triage X has probably taken the title for most big boobed girls in an anime. Now for the sake of the review I'm going to completely exclude all the boobs and other extreme fan service. \r\nStory: 7/10\r\nIt was actually well.... interesting. An underground assassination group who got rid of the corrupt and other dangerous people in the city. However, it was only good as a concept because once it gets into the main story line it starts to become a jumbled mess. Having to figureout who belongs to who what their job is and role just became a hassle and ends up taking away from viewing pleasure. Not talking about the boobs.\\n\\n\r\nCharacters: 3/10\\n\r\nYea.... There's Arashi and Mikoto as the main duo who actually have pretty good chemistry together, though Mikoto starts to become a bit of a dispy girl in the end. And well theres no other way to describe them but big boobed pink hair, big boobed sword girl, big boobed nurse and that other big boobed girl who only says around 40 lines total. And then everyone else is basically pointless to try to remember. So as far as character development it can really only be either Arashi or Mikoto who receive some and good thing is they do, albeit brief.\\n\\n\r\nSound: 7/10\\n\r\nSo the sound is fairly nice to listen to, a lot of hard rock songs constantly keep an nice upbeat \"go fight em\" attitude. The OP and ED were actually pretty good but personally whenever I saw parts of the ED I just kept thinking about all the road burn.....\\n\\n\r\nArt: 8/10\\n\r\nNothing special but it has its moments. Most of the bike scenes and other action scenes looked very well done and the CGI was blended in nicely. \\n\\n\r\nEnjoyment: 6/10\\n\r\nIt was a nice little anime to pass the time so I liked it, but I can't recommend it to anyone just because of the boobs. \\n\\n\r\nScore (without boobs) 5.7\\n\r\nScore (with boobs) 4",
            "date": "2015-06-10T21:27:00+00:00",
            "helpful_count": 30,
            "mal_id": 190054,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=190054"
        },
        {
            "content": "What do you got when you combined, action, blood, guns, gore, big boobies and lots of eye-candy? You get something like this, a 10 episode anime whose theme, setting and plot are a complete oxymoron which is typical of studio Xebec, since most of it's genres are compose of popping eye-candy whose direction is complete head scratchier.\r\nNote: I haven't read the manga yet, so my review is only for the anime.\r\nStory\r\nThe story is just your typical vigilantes kind of thing where there is the usual good guys who fight against them bad guys out side of the law, which to me is ok. But, theones who are doing the crime fighting that involves people in the health care industry is kinda of awkward, but nevertheless it's ok, but how they got into that kind of side business is a big plot hole to say the least.\\n\\n\r\nMy verdict: A decent 4.\\n\\n\\n\r\nArt\\n\\n\\n\r\nFrankly it was typical of studio Xebec to always include eye candy in their genre, now let's face it the only thing that make this anime and manga sell is sex, which it the very mantra of every men's magazine where \"sex sells.\" Here the main selling point was mostly on the boobies, where distinguishing the young girls from the older ones isn't much a priority of the illustrator , in fact the youngest character Oriha Nashida can pass as a twenty-something bimbo. Despite of my disgust, those big boobies and some panty flashes really did got me. \\n\\n\r\nMy Verdict: a Very Good 8.  \\n\\n\\n\r\nSound\\n\\n\r\nBasically the opening and closing isn't my cuppa tea, also the character voices regardless of age doesn't have that youthful tone, in fact  Mikoto and Oriha doesn't have that teen age tone in it, were it that really doesn't impress me at all.\\n\\n\r\nMy verdict: a Poor 3.\\n\\n\\n\r\nCharacter\\n\\n\r\nFor the most part the character's themselves are either an oxymoron or a plot hole. So who were the characters?\\n\\n\\n\r\nArashi Mikami, the main protagonist whom as a child and a victim of a terror attack he received a lot of organ transplant from his dead friend  Ryu Mochizuki. Ok at first I find it hard as to how his body was able to cope up with multiple organ transplant in one operation, co'z in reality such operation would prove to be 100% fatal even with new drugs. The oxymoron about him was that he can ride a bike, so why does he have to ride shotgun along with Mikoto where both can shoot while riding? I was really unfortunate that he didn't even think about banging her while they were in the showers, which would have added more intensity to this anime and it was very obvious that the two don't mind being naked together.\\n\\n\r\n Mikoto Kiba, in the anime, it was never mentioned that she is of Yakuza royalty and her brother was murdered, but nevertheless, it was a big plot hole as to how she learned how to shoot and fight. Pretty much she just one of the eye candies in this anime. \\n\\n\\n\r\nOriha Nashida, the big plot hole about her was that she is this child prodigy / idol whom it was unknown as to how she got mixed up with being one of the members of \"Black Label\" who like things that goes BOOM! In fact that's what we the audience only knows about her.\\n\\n\\n\r\nSayo Hitsugi, about her, well at least we got know her beginnings, not much to say.\\n\\n\r\nYuko Sagiri, so how does a well endowed doctor got to be a master swords woman is a mystery at least in this anime.\\n\\n\r\n Miki Tsurugi, being an anesthesiologist was pretty much an oxymoron for her character, since a specialist like that only deals with the prevention of pain and not concocting brews like date-rape drugs or PCP's where she uses it to interrogated suspect and afterwards they won't remember a thing, geez , Manga artist  Shōji Satō really has no idea that such drug can be concocted by either a pharmacist or a drug dealer.\\n\\n\\n\r\nMy Verdict: Poor 3...blame it on Manga artist  Shōji Satō.\\n\\n\r\nEnjoyment\\n\\n\r\nTBH, it was the eye candy that provides the true entertainment than anything else, one can simply forget the rest.\\n\\n\r\nMy Verdict: Good 7 for the boobies and panties.\\n\\n\r\nOverall\\n\\n\r\nWelp, since it was obvious that this anime was rushed and poorly assembled there is no doubt that this anime should've  be better off left as a manga.\\n\\n\r\nSo my verdict: a Pathetic 1. \\n\\n\\n\\n",
            "date": "2015-06-10T19:53:00+00:00",
            "helpful_count": 14,
            "mal_id": 190047,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 1,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=190047"
        },
        {
            "content": "All I wanted was a fun fanservice anime to help embellish my ecchi bone like I am always known to do. Is this too much to ask for? Is it hard to make a fanservice anime that is actually fun? Unfortunately yes. I don’t deny the tough task of trying to make a fun anime that can please many people. However, when it is plainly obvious that the writers did not give this thing the time of day that it desperately needed from how it is presented, there is no excuse to justify laziness of this magnitude.\r\nFrom the beginning, I thought Triage X started outwith some decent, albeit typical, layout of the characters and story as this secret organization based on a hospital staff of girls. Fanservice was quite voluptuous with decent looking art designs on the girls as well as the guys, with an interesting shot of a nude guy’s butt interestingly enough. Then I watched episode two. Same thoughts by the end of it, even though the plot arc was kinda forgettable. Finally I got to episode three, and by the time I was halfway through it, I thought to myself, “Is this just episode one and two over again?” Not in the sense that it was literally like the previous episodes, but the fact that all of the episodes have a similar structure: Black Label helps with this situation involving kidnappings of partially naked ladies or other terrorist antics. That’s pretty much it. Sometimes these arcs feel as though they were an afterthought and that we are supposed to forget about them by the next episode.\\n\\n\r\nNow this wouldn’t be too bad based on how there are anime that are episodic in nature. But unfortunately, with the case of Triage X, it is, what I would call, a soulless anime. All of the characters have absolutely nothing to them that makes them even the slightest bit interesting or gripping. I came to this conclusion based on how predictable and formulaic they come across; if you’ve seen most seinen-type action anime, Triage X is about as typical as you can get from the genre. Not only that, but the writers don’t even try to give me a minute to let me get to know any of them to help me differentiate between each character. Because of this, I couldn’t really pinpoint a specific character trait that makes any of them unique. All they have going for them is that they are just characters to move the plot along, or lack thereof. This is never a good sign when you are trying to get to know any character in an anime.\\n\\n\r\nThere is even one scene where the girls have a spring bath scene together, because of course there has to be one, and converse about miscellaneous topics and events. The problem is that it is in the last episode when we barely even had time to get to know any of them to care. Of course, this problem of vapid characterization seem minor on the female cast compared to the main hero, Arashi Mikami. It’s not just the bland characterization that makes Arashi so bad, but also his poor charisma and personality. I would say that Arashi has the personality of a wooden board or brick but I think those examples would be too generous when describing. At the very least he has the audacity to admit that “nothing was resolved” near the end of the show to ensure that it was a mess from the start.\\n\\n\r\nThis poor characterization also comes down to just how incredibly poor the writing is. Not just that the dialogue itself is painstakingly awful, but just how stilted and awkward the voice actors portrayed it. Any character dialogue between each other felt very flat to the point where I almost felt like I was watching a hentai conversation taking place. That might seem ironic considering this is an ecchi anime, but there are a lot of ecchi anime that do conversations, even at the level of Triage X’s caliber, decent enough to be passable. The majority of the dialogue consists of constant exposition and predictable one-liners.\\n\\n\r\nWith Triage X being an action/ecchi hybrid, clearly you would think that they would balance the two genres accordingly, right? Well, that doesn’t seem to be the case since they are both executed with minimal efficiency. Action being the majority of what Triage X has going for it, it is by far the most lackluster I have seen in a while. This coincides with the criticism of the animation, which is sub-par at its best. Action sequences, at times, feel more finicky and less fluid because of this problem. Not to mention the amount of corners they cut that made the action such a jarring experience. There are even action scenes where the action felt incredibly rushed, to the point where it was already over before I had the chance to even start getting into it. By the time the fifth action sequence emerged, I started to lose interest to even try to enjoy the action.\\n\\n\r\nFanservice is usually the selling point to anime like Triage X. However, I was surprised and disappointed how little fanservice there was. And even when these fanservice moments happened, they were not super special to even watch the uncensored version for. In fact, if you just watch the uncensored version just to see some nipples and ass, I guarantee that almost all that time would amount to about five or six minutes, at most. I don’t count the ones that are involved in action sequences only because they mostly serve the action than the fanservice. Whatever how many panty shots, beach scenes, skimpy outfits, and boobs Triage X has going for it, they do not leave a lasting impression from how dry the animation direction is. This is especially even more surprising since this is the same studio that brought us Highschool of the Dead. While not a great show by any measure, at least had some semblance of a budget going for it. When your ED is literally just a girl riding on a motorcycle from point A to point B with her boobs slightly bouncing for no reason, no amount of budget could save laziness of that magnitude.\\n\\n\r\nI know this seems too big of a review for me to convince anyone that Triage X is bad, but it’s not just because it is bad. It is because it is the worst anime I’ve ever had the audacity to sit through. I was not angry during. I was not incredibly disappointed. I was just bewildered by how something this bad could ever be approved to go on air. Dropping this could not be done by me as I wanted to continue watching this to see if it could get any worse than before. The truth of the matter was: It didn’t get any worse or better because it was already at the lowest point of quality anyway.\\n\\n\r\nGrade: F-",
            "date": "2015-12-06T01:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 204895,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=204895"
        },
        {
            "content": "Triage X Production Committee:\r\nLead Producer [clapping his hands]: Okay, everyone, listen up. We had just been given the green-light to produce Triage X, a manga illustrated and written by Satou Shoji. You know, the person who did the illustrations for the Highschool of the Dead manga.\r\n[Everyone nods their heads and say, “Okay.\"]\r\nLead Producer [looking at the Triage X manga on the table]: Now, this may be embarrassing, but I had not read this manga, yet. I had just skimmed it recently, and I’ve noticed that there are many scenes involving big-breasted women shooting guns. Now, tell me. Besides, adding in large breasted women and guns,what else should be included in this animation production?\\n\\n\r\n[A few people look at each other, nervously, until someone raises their hand.]\\n\\n\r\nPerson A: But, sir, that’s pretty much it. The story could be summarized as this: “A group of vigilantes, mainly women and one man, go around killing people deemed as ‘cancers of society’.” You can think of it as a cheesy 70’s to 80’s film with lots of action and suggestive content. Other than that, there’s nothing else to it.\\n\\n\r\nLead Producer [confused]: Really? What about the character development? And the actions scenes, are they awesome and exciting?\\n\\n\r\nPerson B [interrupting]: There isn’t much in character development at all. All the female characters have big ass watermelons, like a size ‘F’ or ‘G’, attached to their chest and all they said is how much they need to get rid of the ‘cancers’ of society. The main guy character does get some development, but not much and his backstory of how he became who he is, is laughable.\\n\\n\r\n[Person B takes a deep breath.]\\n\\n\r\nPerson B: The action scene are somewhat ‘cool’ and ‘exciting’. There are many explosions, gunfights, and hand-to-hand combat action. Although, I have to question why civilians don’t hear these explosions and gunfights, and call the cops right away? But, whatever, logic is dead in this series!\\n\\n\r\nLead Producer [looking at Person B]: Okay. I understand that there is little to no character development, and the actions scene are cool, but unrealistic. But, we still need to add in other stuff, besides guns and large-breasted women.\\n\\n\r\nPerson C [clearing his throat]: Okay. Let me give you my suggestions.\\n\\n\r\n1. Add lots of fanservice material, such as bouncing breasts, boob physics, little to no clothes on, bathes and hot springs.\\n\r\n2. Add a fucking motorcycle because that shit is OP. \\n\r\n3. Have the cops/main detective be as stupid as possible\\n\r\n4. Have everyone wear dark glasses or have dark shadows covering their faces.\\n\r\n5. Make the villains do typical villainy stuff like torture women, drug women, abuse women; pretty much anything done to a women makes you automatically a villain.\\n\r\n6. Add lots of unnecessary melodrama and lots of pseudo-philosophical crap to make the main characters question crap.\\n\\n\r\nPerson C [thinking]: That pretty much covers it.\\n\\n\r\nLead Producer: Based on what I heard, it seems that there is a lot of fanservice material, is that correct?\\n\\n\r\nPerson C [nodding his head]: That is correct.\\n\\n\r\nLead Producer [pounding the table]: If that’s the case, then censor everything, I want the boobs censored by steam, scenery censorship or dark shadows. I want gore not too gory by reducing the amount of blood or turn the scene into a negative color.  And for the panty scenes, either pan the camera or add some objects to block its view. Are there any questions?\\n\\n\r\n[Lead Producer looks around the room.]\\n\\n\r\nLead Producer: Okay. If there are no questions, then let’s get to work!\\n\\n\r\nThe End",
            "date": "2015-06-22T11:20:00+00:00",
            "helpful_count": 11,
            "mal_id": 190931,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=190931"
        },
        {
            "content": "A review of *Triage X, an anime by Shouji Satou, the creator of Highschool of the Dead.* \r\nBased on a manga by the creator the infamous *Highschool of the Dead*, *Triage X* is the latest anime about guns, explosions, and over-the-top fanservice that follows a group of assassins that eliminate the \"cancers\" of society.\r\nAfter the first few episodes, Triage X showed promise beyond its fanservice exterior thanks to its intriguing concept. The focus on an individual character for a two to three episode arc actually provided slight character development and fun action sequences. Unfortunately, after a decent start, the writing takes a turn for theworst to the point where it is not even that entertaining anymore.\\n\\n\r\nAs with any work based on a manga by Shouji Satou, the characters have insanely oversized breasts. Fanservice in a fanservice series is not necessarily a bad thing. If that is the point of the anime, at least do the fanservice well, and that is not the case for *Triage X*. During the dramatic scenes, taking the series seriously is almost impossible with two large things that defy the laws of physics sticking out all the time. Even during the fanservice scenes, it is rarely “sexy.” Maybe it will appeal to a certain demographic, but not me.\\n\\n\r\nEven at a light 10 episodes, *Triage X* does little to make itself a worthwhile experience. Unless you are a fan of the manga, Highschool of the Dead, or offensively large breasts, do not waste your time with Triage X; it does not even manage to be a guilty pleasure.\\n\r\n_Watch if you like:_ Action, Highschool of the Dead, Fanservice,\\n\r\n*-3.5/10*\\n",
            "date": "2015-06-12T13:48:00+00:00",
            "helpful_count": 11,
            "mal_id": 190173,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3578061.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JamestheReviewer",
                "username": "JamestheReviewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=190173"
        },
        {
            "content": "Well I finished it moments ago so let's do a review.\r\nSTORY 3/10\r\nI think there was meant to be a story in there at some point... I didn't really catch it. So anyway, this is practically big tits fanservice the anime. If you like this kind of thing then go ahead and watch it. Let's see... I have little idea as to what they are even doing and the parts I do know I don't really care about at all. They didn't seem to be to emphasized. Something about childhood friend dying. I don't really know. \r\nAround the 7th or so episode they began to insertsome sort of story and then the season ends suddenly and I was kind of just thinking \"Well... I don't understand... Why is this so important? What are you doing? Is your repeated action necessary?\"\\n\\n\r\nART 7/10\\n\\n\r\nThe animation was fairly good though about 80% of what is animated is just breasts. I guess they did a good job...\\n\\n\r\nSOUND 3/10\\n\\n\r\nSound? I can't remember any sound. All I remember is the girls breasts swaying back and forth as she rode her motorcycle.\\n\\n\r\nCHARACTER 4/10\\n\\n\r\nThere was very little background given for a lot of the characters. I don't know, maybe the breasts have occupied all of my memories of this show. I can't remember any character names and I was looking at them recently before I began my review. I don't know I just don't think I care.\\n\\n\r\nENJOYMENT 5/10\\n\\n\r\nI guess I enjoyed it. It was okay. It was also predominantly just breasts.\\n\\n\r\nOVERALL 5/10\\n\\n\r\nI honestly believe they were just trying to insert as many large breasts into every frame as they could. I just... I don't even.",
            "date": "2015-06-10T14:51:00+00:00",
            "helpful_count": 8,
            "mal_id": 190019,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4664945.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nyan_Pasu",
                "username": "Nyan_Pasu"
            },
            "url": "https://myanimelist.net/reviews.php?id=190019"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nWhen I was in the third grade, I came down with something pretty awful. My eyes burned, head ached, and I was sweating profusely. Plus, I had this terrible cough. I’ll never forget the x-ray I saw that day, with the huge blotch over my lung. The diagnosis came back pneumonia. Now, as a youngling, I had pretty much no idea the gravity of the situation I was in. All I knew was that I had to take this gross liquid because the pill was ginormous. I missed Halloween, too, which was completely unfair. Luckily (asme typing this should be evidence enough) I made it through this ordeal, and I owe it all to the medicine and care I received from both the doctors and my family. Triage X is “similar” in that “doctors” aim to eliminate “sickness,” but this anime is itself a disease in every sense of the word.\\n\\n\\n\r\nSTORY\\n\\n\r\nTriage follows Arashi Mikami, a boy whose body is half him and half the friend he saved during a deadly explosion. He, Mikoto Kiba, and many others make up a group of people who aim to excise the “lesions” of society to make the world a better place, one visit at a time.\\n\\n\r\nAnime is no stranger to “fan-service.” For those unfamiliar with the term, fan-service is (contextually) when an anime includes scenes or segments for the purpose of pleasing the audience. Normally, the vast majority of fan-service is of the sexual variety, as is the case here with Triage. A misconception that people often have is that all fan-service is automatically bad. Fan-service can be good or bad in the same sense that the narrative, characters, or any other facet of a show can be good or bad. What truly matters is the execution of it. In Triage’s case, the fan-service fails to deliver. It isn’t used as part of the plot, it doesn’t exist to accentuate a particular character or idea, and it certainly doesn’t come off as tasteful. Instead, the fan-service employed by Triage is overtly forceful, and so blatant that its only purpose is to distract the audience from the rest of the show. Furthermore, the fan-service is wholly lazy; it mostly boils down to a low shot of some woman’s panties or having the camera focus on her chest. There are other methods used – bathing scenes, clothes that are a bit too revealing, etc. – all of which aren’t appealing and instead feel tiresome after witnessing them for the umpteenth time in the same episode, let alone across the full series.\\n\\n\r\nWhat does lie behind the half-naked women and medically-concerning-sized breasts? It’s hard to say, really, because Triage itself doesn’t know. While the opening synopsis said that the show “followed” Arashi, this only occurs for maybe the first episode or so. Afterwards, the show flits between random plot lines in order to bring about some semblance of worth to the characters doing the doctoring. This would be at least acceptable – focusing on one character’s arc at a time – but there exist two problems that persist between each.\\n\\n\r\nThe first is the inconsistency in the cast. When the show sets its sights on another plot line, it seemingly forgets about many of the other characters. Think of it like tunnel vision; the anime runs with the idea it has for a particular arc without taking into account the characters around it. This includes both the mains and the sides. Many side characters exist for the express purpose of being dealt with in the arc they appear, sometimes within the first few minutes. The second is the isolation of the events themselves. Each arc does have actual happenings, despite everything that it does. But none of what goes down in one sequence seems to transpose to another. What this causes is a degree of incoherency that prevents the show from maintaining any kind of meaning. The group takes care of one problem in one place, with another popping up someplace else, without any of the separate instances having relevancy to developments made later.\\n\\n\r\nThis is excruciatingly true when it comes to the ending, which is perhaps one of the worst in anime to date. There is (at first) seemingly zero continuation from the previous events, with the resulting fan-service – now the unabashed focal point – being more confusing than arousing. There is some attempt made to explain how they got to this point, but it becomes lost among the “ghost stories,” some paradoxical talk involving certainty and uncertainty, and, once again, an irrelevant plot point. Yet, the icing on the cake is the final two minutes or so. It’s literally just Arashi walking down an expressway before cutting to black. When you look back at everything that it did, the finale is an ironically poignant way to define this tale: a whole lot of nothing.\\n\\n\r\nANIMATION\\n\\n\r\nThere is little to note when it comes to Triage’s overall art direction. The locations visited are typical for a city – a nearby dock with accompanying freighter, a television producing skyscraper, and a local school dot the landscape. It serves its purpose as being an area for the characters to interact in without doing much else. The show also decides to make use of CG for many of its motorcycle portions involving Arashi and Mikoto, but they always look too stiff and unnatural, coming off as displeasing to the eye. Censorship is also rampant, which heavily goes against the anime’s ideals.\\n\\n\r\nThe anime makes a “big” decision by having the majority of its female cast be equipped with breasts that are quite huge. There is a line, though, where the size of the boobs transitions away from believability and into comicality. This anime moves beyond this line, where the girls lose their provocativeness because of the absurd designs they are given. Oriha is attributed with an interesting look by having her a bit more squat and bigger in terms of size when compared to most female anime designs, but the diversity ends there.\\n\\n\r\nActual animation just barely manages to be average. The show does make the most of smaller details such as hair and cloth shuffling. There are also a lot of explosions, gun firing, fist throwing, samurai sword swinging, and other crazy action sequences. Nothing is too elaborate, but the show tries to do what it can. There is a lot of sitting with minimal facial expressions on top of this, but the anime alleviates this negative to an extent by providing a lot of motion for the breasts it always brings to the forefront.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Triage is, perhaps unsurprisingly, extremely mediocre. Important side characters such as Masamune (the lead doctor) and Isoroku (the lead detective) don’t receive nearly enough attention despite having a place in the plot. Some side members don’t even receive any sort of characterization due to only having literal brief glimpses of their person. Most prominently is Kaname, who seems to be the leader of the terrorist organization the group is fighting, but outside her laidback behavior, nothing else is known about her.\\n\\n\r\nCertain main characters like Miki and Mikoto are only known for their tiger-tooth and way-too-late romantic feelings for Arashi, respectively. Speaking of Arashi, he, too, succumbs to the anime’s inability to explore almost its entire cast. For him, there is talk about discovering his inner “self,” considering the situation he’s in mentally and the issue he experienced as a child. It’s all very strange, though, because it never seems as if he has a problem with anything he deals with. He doesn’t undergo turmoil, even when his subconscious – taking on a form resembling his friend – always warns or questions his motives. But Arashi never falters, going through with whatever he does, having some sort of epiphany about himself rather than learning from the dilemmas in front and around him. It also doesn’t help that, despite being the star of the show, he garners some of the least overall time on-screen, making it inherently difficult to work with his character development in the first place.\\n\\n\r\nThe only character that manages to do anything remotely worthwhile is Sayo, the blue-haired fighter. For the majority of the season, there isn’t much known about her besides the massive strength she wields and the mask she normally wears while brawling. However, following an incident against people similar to her, she “awakens” to her past, remembering the tribulations she had to conquer as a child to get to the point in her life she finds herself in. This doesn’t occur without her first going berserk; these traumatic memories resurface hard and fast, causing her to essentially lose herself once more. It isn’t until Arashi, whose problems mirror that of Sayo, comes to her rescue. Her character development is meant to exemplify the notion that the pasts we have are not something that should control us. Instead, we should embrace who were then because it helped to shape who we are now. She even attempts to instill her newfound insight onto the same people who led her down this path of enlightenment, signifying the change in her person. Sayo proves that Triage can, in some fashion, produce a character that isn’t fully forgetful.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme tries really hard to be cool, but it succeeds in only reaching this descriptor halfway. The first portion of the track is a lot of guitar without much substance, but the latter portion, with the dual vocals, does manage to have that “good guys versus the world” vibe to it. The ending theme, on the other hand, remains rather lame from start to finish. The instruments and beat sound an awful lot like the opening theme, but here, the track comes off a bit more hopeful and subsequently loses that cool edge it was undoubtedly aiming for.\\n\\n\r\nAs for the remainder of the soundtrack, it doesn’t have the strength to stand on its own. Many of the pieces take on a techno or rock-n-roll composition to coincide with the action taking place, and there is the occasional piano melody to round out those “touching” moments. But they aren’t nearly as impactful as they should be. Like the art style, the OST exists as background filler and nothing more.\\n\\n\r\nVoice acting is somewhere around average, with no notable performances to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis is a weird one for me, because I’m actually a fan of all anime, “ecchi” material included. But having the fan-service as forward as it was didn’t make me happy to see in the slightest. Rather, I would always question why it was being done in the first place. There are a lot of breasts and underwear to stare at throughout the entirety of this one, so my own personal questioning was happening a lot. Some characters could be cute at times, such as Mikoto or Arashi’s class friend Hinako, but they weren’t endearing enough to be too likable and not fun enough to get a laugh out of me. Even Oriha’s idol singing, which was designed to bring about happy times, did nothing for me.\\n\\n\r\nThere were a few scenes throughout the experience that were so ridiculous, though, that I did manage to smile. Chikage’s whole storyline was poorly handled to the point of hilarity and Kyouji, the over-the-top evil son of the gang leader, could not be taken seriously at all. That was somewhat the point of his behavior – he’s one of those “dumb” bad guys. He would fondle women, drug them, and force them to do his bidding; a real scumbag you love to hate. Sadly, he never got his just desserts because the anime didn’t complete his (the main) plotline. Which, at this point, should be expected from the show’s overall ineptitude.\\n\\n\r\nTriage X never wavers from its abysmal story, unappealing character designs, and boring sound-work. It can’t even do fan-service right, despite leaning on it for the whole series. Comparing what I went through back then to this one, I’d choose the pneumonia.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, poorly executed fan-service, inconsistent and incoherent plot, with one of the worst endings in anime\\n\\n\r\nAnimation: Bad, boring art style, bad character designs, average actual animation\\n\\n\r\nCharacters: Bad, nearly the entire cast is handled poorly with the exception of Sayo\\n\\n\r\nSound: Bad, okay OP, bad ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Bad, nothing sexy or attractive about the show, with some minor laughs caused by the absurdity of it all\\n\\n\r\nFinal Score: 2/10",
            "date": "2015-07-04T02:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 192252,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=192252"
        },
        {
            "content": "At first i liked the name, then i saw a edgelord with a helmet and he had 2 friends who are one fairly chested and another flat chested and the flat chested friend was jealous of the fairly chested and started rubbing her chest until it grew, it didn't.\r\nand then later on a guy touched this girls breasts and he said...\r\n\"That's strange...how many years has it been? I guess squeezing them really doesn't make them bigger.\r\nShe got salty and was going to punch him but he slowly levitated to the ground.\r\nIn the end he didn't needed his trusty bike or his edge fairly chested friend,he simply walked away with his only friend, his vibranium helmet\\n\\n\r\n10/10 anime and 11/10 Jiggle Physics, surpassed even DOA5 and Rumble Of Roses at the same time.\\n\\n\\n\r\nBoing Boing! Uguu~",
            "date": "2015-06-19T14:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 190661,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2409897.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hyperzinuh",
                "username": "Hyperzinuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=190661"
        },
        {
            "content": "Warning: The following review will contain sarcasm to a certain degree, be 100% Subjective and focused on the Anime,  and will be ignoring any Manga or Light Novel related  \"cannon\" material if the Anime is based of one.\r\nStory: Now I felt that the story here was great, I loved what the plot in the start based itself around and what it came to chase and how it was portrayed. To me it was new, exciting and as mentioned above: I could relate to it as something this world would not take harm of having - a organisation that cleans out what we don'tneed more of / at all. Although I feel that the story drifted a bit towards the end - they still kept true to the main \"goal\" which is nice although a CERTAIN episode which I had looked forward too for some weeks since it's start let me in a bit of disappointment as Mr Steam winded up stealing the show and making the plot seem irrelevant compared to the \"service\" at display - a true bummer. To have a Anime with a story that hits me SO good but to have it \"leave\" in such a manner really knocks me down.\\n\\n\r\n~ Story: 5 ~\\n\\n\r\nArt: There is little to say about art these days, which a few exceptions of course but Triage X had nothing that was MIND blowing but not bad either, I personally thought this art style was great and didn't mind the few bits of CGI which was displayed as they made it blend in better than what I have seen other animes manage to display - Yet, suffice to say I am not that much of a fan seeing the MAIN character have SUCH an expression: it was made up for once I learned what he had been trough, I also think I'd be left with a permanent face like that if it was the case.\\n\\n\r\n~ Art: 7 ~\\n\\n\r\nSound: I don't judge this part as I am not the type of person to pick on sounds nor music, all I really care for is if the MAIN theme song (Intro song) and the \"highlight\" song (Example: The one played off when the MC is about to kick some a**) is alright. And sounds otherwise, I will point it out should something REALLY be off but in this anime I didn't find anything in particular.\\n\\n\r\n~ Sound: ?? ~\\n\\n\r\nCharacter(s): Oh yes! Most likely what I enjoyed the most about this anime besides the plot: the characters! Like so many other of my favorite animes I feel that Triage X did a good job melding together all these different personalities and looking characters in a mix that winded up leaving me with a gang of people which made me smile, laugh, cry, grit my teeth, drool and much more. That is what I WANT from a anime, personalities that -ALTHOUGH nothing can be called 100% original anymore: they make it feel so due to WHO they are, HOW they are put together and WHAT they make of it, good work done here in my opinion.\\n\\n\r\n~ Character(s): 7 ~\\n\\n\r\nEnjoyment: Did I enjoy Triage X? Yes. Why did I? Simple: when you take all of the posts above and mix it together, you get the type of anime I appreciate despite its flaws - where one here might have been \"big\" to a certain degree, I can look over that for everything else. And would I RECOMMEND anyone to watch Triage X? If you like action, some story here and there, a aggressive plot with characters like shown here: then yes. I would recommend it for those out there that might have missed out this tiny gem.\\n\\n\r\n~ Enjoyment 7 ~\\n\\n\r\nOverall: Triage X came off to me to begin with as a action filled Anime of which you don't see the likes off all the time. One with content that needed to be censored upon release which was not just ONLY erotic material and that had a story-line / a plot which might as well could have been based on something we need to do in this world - Removing the tumors of society: this was something I loved and it grasped a hold of me and made sure I held out til the very end - which I was a bit sad to see that only was 10 episodes. It has what a good Anime in my eyes need - Action, alright Music, Art which is acceptable, characters that I feel match together in a functional way and of course: some fan-service. Triage X is a anime that will make you wonder what you are watching if you are not into this style of anime, but for those who likes this style - They are inn for a great 10 episode anime which will leave them taking a long walk down the local main road.\\n\\n\r\n~ Overall: 7 ~",
            "date": "2015-06-19T10:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 190642,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rexxgrim",
                "username": "Rexxgrim"
            },
            "url": "https://myanimelist.net/reviews.php?id=190642"
        },
        {
            "content": "In the end, everyone needs a breast and titties show once in a while. \r\nWhen the series started airing, many people has been dazzled by amount of boobs bounce with hot upbeat steam, it beats and jiggle so hard that you can’t help but to amazingly stare. Moments of scene, where 95% of the series time has been cover up by this wonderful piece of art. However, it would be a great mistake to simply judge and dismiss this series based upon first impression. \r\nThe show premise is actually interesting while it is not really exploiting of the whole potential of the theme. It’s goodbut the half potential to make it better also has been wasted. Maybe because considering the short episode, some of moments kinda rushed and they don’t have the approximated time to create a fine piece of series. If the episodes could be extended more, I think the story line will be improved a lots more. In this show, we meet a Chairman of Mochizuki General Hospital named Masamune Mochizuki that has a special unit assassin under him to cures the dangerous disease that has been spread among the community all over this time. However, this disease is special and not affecting physical or mental health. To put it clearly, the disease is none other than Corruptions, Illegal drugs business, and any other high rated crimes that has been pointed as black zone evil deeds. Thus, this assassin has been sent out to annihilate the “cancer” of disease out from community. To make it easier, it’s like Japanese version of swat. \\n\\n\r\nFight scene in the series is also one of few reasons why I like about in this series. Triage X has many good fight scenes I’ve ever seen involve the main lead. Put aside the magic stuff behind, their fight scene has been put out nicely. Altogether it turned out as a surprising element to me. Not involved sword or magic stuff, just practically about fight between a fist and kick. It’s that simple, yet many of us really love that kind of fight. \\n\\n\r\nOur main lead also definitely worthy of praise. He’s not indecisive type of person. Nowadays, anime industries overwhelmed with indecisive type of main lead that only act in the nearly last minutes or never ever fight back for what they loved until it already too late or gone from their grasp. Arashi while on the other hand showed firm principle and resolution through the series. He also had shown us that he is not hesitating to do something even though he is already cornered by the enemies. That’s particularly interesting to see once in awhile. Furthermore, the development of character keep improved which I totally love to see. It’s fine if slow, as long as it’s there. \\n\\n\r\nHowever the series still has its own flaws. There is rarely a male fighting a male fight scene. Most of the character in the series also female overwhelmed the male. I prefer of it being balanced, that’s better to see. Boobs scene is totally unneeded; I love when they put ecchi moments, but when it cover up almost all of the time, that’s just porn. The plot also has been forced, and rushed which make it looks ridiculous and honestly speaking both OP and ED totally bad. \\n\\n\r\nI had my share of fun. The series might be ridiculous, but I do enjoy those moments. If you want to enjoy the series worth, then don’t think too hard. It’s generic but somehow I think that’s better. Some shows try very hard to be different that just make them worse. In this one, you can still enjoy what it had to offer beside the boobs.  \\n",
            "date": "2018-01-18T23:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 268998,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=268998"
        },
        {
            "content": "Now Triage X is nothing more than adolescent misogyny that was typical of anime that first got anime marketed to the United States in the first place; so we can stifle all that. Let's explain why I initially gave it an eight despite all it's obvious \"flaws\". If the character designs, outfits, \"nudity\", etc. offends you, then this wasn't marketed towards you. Further if the violence, rape culture,  and drug abuse offend then this is really not marketed towards you. AND I will take this moment to tell you to avoid Triage X.\r\n However; if you want a more adult anime an anime thatreminds us that not all anime (or any media for that matter) need to be intended for kids. Just look at the picture for this show, if you saw that and thought let me watch this what did you expect? A romantic comedy in a high school nurses office? Plot and story? Drama? Nope!\\n\r\nIt's buxom women, guns, and motorcycles, period. Some bad people get killed, explosions happen, it's got all those bad things that some people don't like. Which is why I gave it a six; it has content that isn’t for everyone. If that's what you want, then it's gold and delivers! It makes me nostalgic for the OVA days that kept me into anime these decades.\\n\r\nIt's like I said about Diabolik Lovers, if this is exactly what you're looking for then it's a treat. The difference is, I can imagine a target  audience for Triage X.\\n",
            "date": "2016-12-12T22:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 235364,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=235364"
        },
        {
            "content": "What can I saw about Triage X. Hm, well, the premise was decent. I like the idea of mercenary assassins killing evil individuals in order to protect the world and keep corruption from spreading. Unfortunately, I don't think this anime quite reached its true potential. Why? Because they focused too much on the boobs and not enough on the plot - I mean the story. What at first sounds like an interesting story filled with action and a multi-faceted plot soon becomes an anime that is essentially boobs and violence. Now, there is nothing wrong with this, but when I went into the anime, Iwas expecting something a little more serious than jiggling breasts. I mean, I kinda knew there would be some fanservice, but not this much. While I'm not sure I would have minded this in another anime, in this one, I feel like the story itself suffered because the animators focused more on making every woman's boobs bounce than they did on making a good story. This anime is basically an urban fantasy version of Queen's Blade, which has been hailed as one of the greatest failures in anime history.\\n\\n\r\nThis story had its hand in way too many genres. It's basically a secret society show about high school teenagers and large-breasted women who work at a hospital during the day and secretly assassinate people by night. It tries to be a slice-of-life high school show, a medical drama, an action series, a crime mob series, and worst of all, a bad fanservice series. Now, contrary to my complaints, I do not dislike fanservice. I don't. If the anime does it right, I can enjoy fanservice as much as I do every other genre. I love To LOVE-Ru and its epic boob falls, Highschool DxD is one of my favorite anime, and I thought the fanservice in Cat Planet Cuties was adorable. But this? Triage X's fanservice is just a bunch of women with swollen, misshapen breasticles. Seriously. I don't even think the guy who did the illustrations for this knew what a real pair of breasts look like. Every girl in this anime has tits so large they'd sag. It's disturbing. And the fact that even the high school girls have boobs that big makes it even worse. I love fanservice, but even in a bad fanservice show, I at least expect the illustrations to be gorgeous. These just bothered me.\\n\\n\r\nNow, let's take a look at what this show failed at. First off, the high school aspect of the show. We're basically given nothing about this. We see a few scenes where two of the characters are in high school, but that's about it. It's never developed beyond being there to tell us that the characters are leading a double life. The medical aspect of the show is like a really bad metaphor. The entire idea is that these people are doctors who exercise tumors, and the people they assassinate are the tumors. While that sounds really cool, the idea never went beyond the metaphor phase. The crime aspect could have also been interesting, but I don't even think the people directing this knew how real crime lords and drug cartels acted. Every bad guy was basically just an insane scumbag who committed crimes with all the subtlety of a bull in a China shop. They didn't even try to stay below the radar. They didn't try to be clever. You know that girl in the GIF image with arrows on her nipples? Yeah, that's basically how every criminal is in this story - about as subtle as a jack hammer. It's completely ridiculous.\\n\\n\r\nThe problem is none of these themes mesh. It doesn't help that all of the characters are one-dimensional. Perhaps its because the director tried shoving too many genres into a 10 episode series, but none of the aspects work well together, and the character's aren't fleshed out enough to carry the story on its own. Maybe if this story has 24 episodes to develop its characters, it could have been better. But then again, I feel like if this anime had 24 episodes, it would just be 14 more episodes filled with nothing but oversized breasts.\\n\\n\r\nNow then, despite all of my complaints, this anime did do some things right. The animations are sick, like, awesome sick. The animators were really spot on with keeping the animations fluid, and all of the characters stayed on model, so you didn't have any characters who suddenly looked different because they couldn't retain that characters unique design while animating. Considering this anime has a lot going on, that is a very impressive feet. However, aside from the technical aspects of this anime, nothing else about it really stood out as good to me.",
            "date": "2015-07-18T09:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 193725,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4266195.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bvarnell89",
                "username": "Bvarnell89"
            },
            "url": "https://myanimelist.net/reviews.php?id=193725"
        },
        {
            "content": "From time to time, one has to rinse the palette with some unadulterated craziness.  When going into Triage X one should expect to see sex, violence, drugs, and rock n’ roll in all its hedonistic glory. You will be treated to a cast of curvy girls with a range of different personalities, and a premise ripe for a violent journey into the criminal underworld.\r\nHowever, does the anime live up to these expectations? Looking at it as something in the exploitation-genre, the series succeeds in putting all the ingredients in place, but the actual execution offers little to nothing. Despite the fact that its maindraw is action and fan-service, it lacks most of the things that can make it entertaining, which is over-the-top spectacle, a seductive tone, and character-chemistry.\\n\\n\r\nRegarding the animation, I cannot find much to complain about as the design and the fluid motion were executed well. The soundtrack, while nothing too spectacular, fits the series and does its job with its rock n’ roll tunes. On a technical level Triage X succeeds in being presentable. The direction however needed a better grasp on how the premise could have been made more fun. I’ll give examples below.\\n\\n\r\nBig-breasted characters may appear on-screen, yet they just stand there half the time doing nothing of interest, tits are simply shoved in your face casually. There is a difference between being in the viewer’s face about it, and being seductive, making something taboo and tempting. On the opposite side of the spectrum, the show goes from casual to dark and edgy in a heart-beat, taking its time to victimize the women on display, corrupting them into mindless freaks hooked up on drugs, or abusing and torturing them for sadistic pleasure. While this is only what one might expect from exploitation, the fun is sucked out when presented in a flavorless and mean-spirited way, hovering dangerously close to being offensive had it not been a show you're not supposed to take seriously. \\n\\n\r\nSame thing applies to the action, there is a difference between action and violence, with the former being about exciting feats like jumping out of an airplane, while the latter is about making you wince at something that looks painful. The majority of Triage X focuses on violence that is quick and bloody, rather than exciting stunts, speeding chases, or explosions. This is why I would argue that the show can only be enjoyed on a technical stand-point, it’s just a good-looking series of uneventful things flying by.\\n\\n\r\nWhat I missed the most was the dynamic between the characters. I can only count two scenes where they interacted in interesting and exciting ways. I will take my hat off for the back-story and fleshing out they provided for the main character and two of the girls. This is however something I had hoped to see more of through-out the series with the rest of the cast.\\n\\n\r\nTo sum it up, Triage X is a series that misses its mark, with action that isn’t memorable, undeveloped characters, and fan-service that offers no sexual tension. Last but not least, with a plot that ends up unresolved in the end with very little being accomplished, I would recommend skipping the anime entirely as it is a waste of time.",
            "date": "2015-06-19T03:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 190614,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4319803.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Markezzo",
                "username": "Markezzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=190614"
        },
        {
            "content": "This anime is incredibly straightforward, wherein if you watch the first episode you'll have a pretty good idea of what the rest of the show entails. The story is focused on conspiracies, corruption, and the underground of society being cleaned up by vigilantes, which isn't too original, but it works well enough. The focus here is on the action, though only in rare cases does this action ever involve strategy or any depth to it. Rather, most of the time, it's just really fast, cool, and full of explosions. Whether that's enough to support an entire show depends on personal preference. There's an overarching storyrelated to a drug and factions that are trying to take control of it, however, this story doesn't get anywhere close to a resolution, as the anime ends in the middle of the arc it seems like, and the attempt at trying to make it feel more complete by ending it on a side mission didn't help at all. Furthermore, the story itself felt kind of rushed, particularly in terms of the villains seeming like they die too quickly as they have complexity to their motivations and backgrounds hinted at but never expounded on. I'm not sure if the original story itself was lacking in that regard, or there were issues with time, but overall it felt like it needed more episodes. While the plot was lacking, I will say that I liked the character set quite a bit, wherein all of them looked and acted pretty awesome, and there were some good emotional moments throughout, of especial note is Hitsugi who actually had a pretty great character arc if you take into account the OVA. She's an exception though, as most characters don't really get much development at all, but regardless they pull off being really likable, which is the other core aspect that supports the anime.\\n\\n\r\nI liked how clean the art style was and loved the designs, but it felt quite low budget at times, especially in terms of animation. The soundtrack was far better than you would expect of a show like this, though that ultimately just comes down to a couple tracks. The OP/ED are pretty solid and fit well with the sense of style the show is trying to portray. The ED on the last episode was cheap as hell though, and they probably just should have used the normal visuals.\\n\\n\r\ntl;dr: A show that for better or for worse is focused on style over substance but does well enough in that regard.",
            "date": "2018-12-03T08:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 295189,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=295189"
        },
        {
            "content": "So, I came across this anime a while back. It seemed like a pretty good piece to check out. Since I love the animation and ecchi, I decided to give it a try. \r\nMy first impression of this anime was actually better than my last. I honestly expected this manga to be like highschool of the dead but it turned out to be more like Perfect Half ( https://mangazuki.me/perfect-half/ ). Since I didn't Love this anime that much I'll only talk about the good parts.\r\nCharacters: 8/10\r\nThe characters were the only thing good about the anime. They had the whole theme built around them. I wasvery curiously to see if there was some development in their behavior and finally got to see that(at least).\\n\\n\r\nThe ecchi: (8/10)\\n\\n\r\nSince very few people add this into their review, I'm one of the people who do, Ecchi had become a famous and important genre for the success of any anime. A good anime needs to have good ecchi scenes. This anime particularly had some very good ecchi scenes coupled with good animation and art \\n\\n\r\nThis anime had a lot more potential to become of the best anime out there but sadly it failed",
            "date": "2018-07-03T13:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 282896,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3693803.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blacklotiss",
                "username": "Blacklotiss"
            },
            "url": "https://myanimelist.net/reviews.php?id=282896"
        },
        {
            "content": "Triage X was a interesting anime. Take out the numerous amounts of boob showing and it's a decent series.\r\nThe one thing that I didn't like was how the series ended...\r\nI didn't even notice that the series ended properly until I checked how many episodes were left\r\nTrue at the end it was kind of obvious what with a scene playing the ending song\r\nBUT!\r\nI hoped for more details on what happens afterwards\r\nOverall the show was great; it was interesting to see what the backstory of the characters were however I wished they could have at least made 20 episodes to continue on with the story.....\r\nMainly for peoplewho either like action/boobs (not trying to be offensive or anything but honestly the number of times boobs are shown is just..... a lot okay!) or have read the manga and wanted to see the animated version of the series",
            "date": "2015-07-03T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 192228,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=192228"
        }
    ]
]