[
    [
        {
            "content": "Phi Brain has one of the widest gaps between an astoundingly moronic premise and a brilliant execution that I've ever seen in an anime series. \r\nThe series can be summed up as \"basically a less merchandise-driven Yu-Gi-Oh, but instead of HEART OF THE CARDS it's UNDERSTAND THE FEELINGS OF PUZZLES\". Denouements for each episode are easy to see, especially if you've ever seen any other anime series in your life. The animation is bad by 2011 standards and the character designs are amateurish. By all accounts this show should be awful and a waste of time.\r\nAnd yet, it is neither, due to its dedication atbeing hilariously over the top.\\n\\n\r\nTake, for example, a flashback in the first episode wherein a certain person implores the main character to solve unsolveable puzzles and ease their pain. Or the moment, also in the first episode, where the female lead asks about what to do, to which the main character replies \"Isn't it obvious? It's PUZZLE TIME!\" as a salsa tune kicks in. While Yu-Gi-Oh had moments of shining brilliance such as this, they were mere glimmers amidst the sea of generic shounen merchandise glut and couldn't bring up the show. With Phi Brain, these moments ARE the sea, and just when you think the well has run dry, an unnecessary character revelation or an inappropriate phrase pops up and gives you such a giddy whiplash that you're sold all over again.\\n\\n\r\nAnd the show is currently only four episodes in! Should it continue this trajectory for the remainder of its 25 episode run, it may end up as one of the better offerings from the Fall 2011 season.\\n\\n\r\nPeople who complain that the puzzles are mostly solved off-screen are missing the point. The show really isn't about the puzzles, and they're given the focus that they get so that the viewer can solve it him/herself and feel like they, too, can be the GOD OF PUZZLES and not focus too much on how things like sudoku and the rush hour puzzle are presented as brain-busting puzzles that only the most brilliant of minds could ever hope to solve.\\n\\n\r\nOther factors that work in this show's favor are Jun Fukuyama, who is hamming up his role so much that he probably wore a curly tail and snout to recording sessions, and the opening theme song, which is the aural equivalent of a plastic army figurine melting in a microwave.\\n\\n\r\nThe viewing experience of Phi Brain is akin to watching a three-legged dog energetically hobble its way down the street, trying to dodge passersby and obstacles, in order to reach a fire hydrant to piss on. You have much better things to spend your time on than watch this dog. Your brain deserves to be devoted to much better. And yet you stare transfixed at this dog, from the second you first notice it to the moment the last drip falls, and you finally know true beauty and contentment.",
            "date": "2011-10-27T14:17:00+00:00",
            "helpful_count": 134,
            "mal_id": 46317,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/550605.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/moonlightgirl",
                "username": "moonlightgirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=46317"
        },
        {
            "content": "To put 'Phi Brain: Kami no Puzzle' in a nutshell, imagine watching a game of chess between two supposed grandmasters, with the added bonus of being able to hear snippets of the players' thoughts. There is just one catch: you cannot see the chessboard.\r\nStory: \r\nPhi Brain's concept is not out of this world: a genius highschooler taking on a dark organisation by relying on his wit to solve some of the most difficult of puzzles known to man. And the show could have been a hit, if not for the fact it decided that viewers do not need to know how the puzzles were solved.The whole kick of a psychological anime, then, is lost, as viewers simply don't feel the engagement, or the experience of sitting at the edge of your chair trying to glimpse what is going on inside the protagonist's mind. \\n\\n\r\nSound:\\n\r\n(Bypassing the category of Art, which is really not noteworthy) OP song is apt, ED song is generic, and the soundtrack is nothing amazing to speak of. The factor that adds points to the sound factor is actually the casting of voice actors, which are generally appropriate and convincing. \\n\\n\r\nCharacter:\\n\r\nLike everything else in this show, the characters are run-of-the-mill: a reluctant hero with a supportive female sidekick and a rival who is always trying to outdo him. While I will not go so far as to state that they are completely one-dimensional, they are predictable enough that interactions quickly become bland.\\n\\n\r\nEnjoyment:\\n\r\nDespite all these mediocre qualities, Phi Brain does provide decent entertainment. The caveat though, is that you have to see it as an average highschool action/game anime and approach it without expectations of seeing Death Note's level of analysis, or Liar Game's level of sheer genius. \\n\\n\r\nOverall:\\n\r\nWhile this anime obviously flopped when it tries to provide a mental ride for viewers, I have to be fair and say that true psychological masterpieces are rare. For all its merits, Phi Brain is not bad; it just induces you into the familiar state of passive viewership. And if Phi Brain was even trying to be intelligent, there would probably be no greater insult.",
            "date": "2011-10-10T04:54:00+00:00",
            "helpful_count": 103,
            "mal_id": 45229,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109686.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jen9204",
                "username": "Jen9204"
            },
            "url": "https://myanimelist.net/reviews.php?id=45229"
        },
        {
            "content": "Phi Brain is all about solving puzzles, however if you think that you'll be able to solve puzzles along with the protagonists, then I'll put that hope to rest now; you're not. Whilst you'll get the occasional glimpse at the whole puzzle, they are for the most part exclusively for the characters.\r\nThe character designs are very brash and crude, very much like the show itself, and whilst I am hesitant to call them outright bad they are certainly below average. This is a low budget anime, and so the animation and art is poor, expect to see many off model shots every episode, which areoften so bad that they are distracting. Whilst this is the case, the animation level doesn't detract too much from the anime as a whole.\\n\\n\r\nThe music is worlds apart from the art, the opening \"Brain Diver\" is a catchy and energetic song that fits the series well, and the ending, \"Hologram\" is a pleasant track that grows on you as the series progresses. The soundtrack is also pretty good, which at points makes up for the appalling animation quality. It isn't amazing, but is remarkable considering the budget, and works well to make the action scenes tense.\\n\\n\r\nDuring the first few episodes you will find yourself hard pressed to like the main characters, as the first few episodes focus on making Kaito look as cool as possible by having him casually solve difficult puzzles and the like, to the point where it feels like they're trying to force it down our throats. Gammon comes across as loud and obnoxious, and Cubic seems like an arrogant child prodigy. However as the series progresses past the first few episodes and onto the main plot, the characters become much more likable. This is because they stop trying to outdo each other in both arrogance and in puzzle solving and start working together against the antagonists of the series, the POG.\\n\\n\r\nThe story starts off very simply, the POG will set Kaito a puzzle and he'll proceed to solve it using his Orpheus armband, often with the help of one of the geniuses that Kaito meets during the first few episodes. Fortunately the plot becomes more engrossing before too long which makes the series more interesting and reduces the repetitiveness. Don't expect anything deep or complicated from the main plot of Phi Brain as it's still straightforward and standard shounen, but it's an improvement. The puzzles act as a way for the characters to fight each other, and in later episodes \"battle puzzles\" are introduced, where the two contestants directly match their wits. This is quite entertaining at times, however, the fact you can't see the puzzle in its entirety is frustrating, as it alienates you from the tactics employed.\\n\\n\r\nPhi Brain improves as it progresses, but it never reaches the level of quality I would have liked, however that does not mean it's bereft of entertainment, and although it doesn't have the gripping battles of wit it was aiming for, it's a simple  shounen that you can find fairly enjoyable if you aren't feeling too critical.",
            "date": "2012-09-03T10:32:00+00:00",
            "helpful_count": 80,
            "mal_id": 71505,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=71505"
        },
        {
            "content": "Isn't it weird that a show about puzzle solving \"geniuses\" turns out to be one of the dumbest anime to date... But it's all in good fun if you don't take it seriously.\r\n*This review goes up to episode 4, and will update as more episodes come along*\r\nSTORY: Yeah, it's puzzle time! We get a lot of mystery anime involving solving shit coming our way and a lot of them are, well, blegh. That's the response you would get from any character in this anime, despite the \"fact\" that they are \"geniuses\" and they can solve puzzles, it isn't a mystery to say that Phi Brainis pure brain rot.\\n\r\nYou can't get anymore stupider than this anime, it's absurd, it's a poorly told story, the characters are \"geniuses\", however it's, honestly, quite fun.\\n\\n\r\nYou would have to be quite an idiot to take this anime seriously, especially when lines like \"Solve those poor puzzles, set them free\" or the classic, \"This puzzle wants to be solved!\" are spoken. This anime takes itself deathly serious, there are no jokes or even tongue in cheek moments, it's serious shit, especially when a whole town can be blown up if a puzzle can't be solved! But, this is some really silly, silly, silly shit, and not even an ounce of seriousness should be applied here at any time, it's completely goofy, and from this point of view, it is incredibly fun to watch as good popcorn entertainment.\\n\r\nBut, any who, the story is about a high school teenager Daimon Kaito who can solve any puzzle and just can't resist the urge to solve them no matter what the risk, life threatening or not (No matter how ridiculous that sounds).\\n\r\nAnd one day, he is challenged to solve a super puzzle called a sage puzzle, and, of course, solves it, with the help of his trusty female side kick Nonoha, and an arm band that he obtains that makes him into an even more bad ass puzzle solver (This is something I never would have thought to call bad ass, it's also the equivalent to how Yugi from Yugioh turns into the bad ass card dueling pharaoh, but almost not as ridiculous, almost), and also later on obtains the title of Einstein, which has to be part of a hilarious satire... I wish, as other characters (More puzzle solving bad asses) with titles like Edison continue to show up.\\n\r\nThe main characters consists of Daimon Kaito, the bad ass puzzle solver, Nonoha Itou, the plucky female side kick who can be more than just a side kick chore holder, Gammon, the insta-frien-emy-rival who likes to show up to solve puzzles too and contribute to comedic situations, and several others that will be revealed along the way.\\n\\n\r\nTo be honest, this anime already feels like it's gone on long enough, the puzzles of life or death situations are tiresome, it isn't really fun watching Kaito solve everything in seconds, and just feels like a waste of time, but, it's still silly enough to enjoy all of that, and not even one brain cell to required to have in order to enjoy this anime, it's pretty simple, but it's dumb enough to kill brain cells if you try to apply one to the show while watching it, and it's a 25 episode series, so there's going to be a lot of puzzles, more ridiculous moments, and did I forget to say puzzles? Because this anime has a one track mind only focused on the stupidity and ridiculousness that comes along with the dangers of puzzle solving, if that makes any sense...\\n\\n\r\nANIMATION: While the character designs are very distinctive, they are bit rough looking, but animated well enough. There are a lot of still frames and crude animation though, but it still good animation none the less. Most of the backgrounds are settings at typical looking schools and cities, but there is a lot of interesting (That word is being used as loosely as possible) puzzle related animation segments going during puzzle time, so it's not hard on the eyes in the slightest.\\n\\n\r\nSOUND: Kinda what you should expect from any shonen anime, though this is one about puzzles, it is just anything not really noticeable, background music wise. The opening theme song, Brain Diver, however, is incredibly catchy. The voice acting is okay, but of all the characters, Gammon sticks out the most as a crazy sounding puzzle solving lunatic who speaks random english from time to time. And if anything, the dialogue is simply the best thing about this anime, the characters are so serious sounding all the time, yet it's completely mind boggling in why would they say stuff so ridiculous.\\n\\n\r\nOVERALL:\\n\r\nThe Good:\\n\r\n+ Puzzle solving shonen show, something different.\\n\r\n+ Goofy and silly as it can get, go into this without taking it seriously and you're in for a blast.\\n\r\n+ Hilarious dialogue, and awesome theme song.\\n\\n\r\nMixed\\n\r\n+/- Goofy characters.\\n\\n\r\nThe Bad:\\n\r\n- Simply one of the stupidest shows this year has to offer, story is too simple for it's own good.\\n\r\n- Too ridiculous at times, Daimon is a little too fast at solving puzzles to the point of getting repetitive.\\n\\n\r\nMaybe this show works because it's so stupid, I mean the writers couldn't possibly be taking this seriously, so it's surely all for fun, and you would be stupid to get mad at it this for being silly and absurd, after all, the dialogue is just too silly to get angry over. \"Save those puzzles!\"",
            "date": "2011-10-19T12:46:00+00:00",
            "helpful_count": 17,
            "mal_id": 45837,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=45837"
        },
        {
            "content": "Puzzles. Solving them is extremely fun, and supposedly they have a heart. Some puzzles are so damn dangerous that you could die if you mess up. The word \"puzzles\" is mentioned a lot of times in this show. It gets quite annoying. \r\nStory: The main character is a fuckin' smart-ass, and he's nicknamed Einstein.  He is put into a situation where he has to solve super-duper-mega-pooper dangerous puzzles for absolutely No. MothaFucking. Reason. The show is about puzzle solving, yet 80% of the god damned episode we see the main characters in school. Or doing something crappy unrelated to puzzles. And when the showgets to the \"Puzzles\", they're solved so fking fast, and I mean DBZ fast. We get no time to think about it, making the whole show a regular high school Drama/Comedy anime. At some times they'll even put in music trying to make it seem \"exciting\", but they fail hard.\\n\\n\r\nWith an added \"Plus\" they say something about \"ruining/destroying the world\" or SOME crap like that. BUT, WHAT THE FUCK ARE PUZZLES GOING TO DO TO THE WORLD? Do they EXPECT every SINGLE FUCKING PERSON IN THE WORLD TO TRY THESE DANGEROUS PUZZLES (having the knowledge that they could die if they fail) THAT THEY SPEND BILLIONS ON JUST TO CREATE? DAFAQ IS WRONG WITH THEM?\\n\\n\r\nWhat I don't understand is why this is a \"mystery\" show when there IS NO MYSTERY. The protagonist solves everything in a flash. We don't even see his thought process, IS HE A FUCKING MACHINE? Detective Conan actually gives us clues, time, and information, and enough of it for US to even solve, where this show completely lacks in.\\n\\n\r\nYUGIOH! Yes. A Golden armband is given to the protagonist (Diamon Kaito), which unleashes his inner \"Yugi\", making him 100 times more smarter and helps him do the impossible. His eye colour also changes, even though there's no point to it. (Use sharingan Kaito!)\\n\\n\\n\r\nArt: The art is shitty. It's what CARTOONS use. Calling an anime a cartoon is mean. BUT HELL YEA THIS SHOW DESERVES IT! STUPID CARTOON!\\n\\n\r\nSound: The opening was decent, and there's nothing terrible about the character voices.\\n\\n\r\nCharacter: Typical shounen characters. A sarcastic, \"knows everything and wins all the time\" main character. A tsundere female who's just there to piss me off. A guy who thinks of the main character as a rival and always tries to be better than him. And another girl who.. wait my bad, a Guy who dresses, talks, acts, like a girl. Guess his name... Anna. What the hell is wrong with the producers? Isn't this for children? Are they encouraging children to do Cross-dressing? My bad it's just Japan.\\n\\n\r\nEnjoyment: I don't like unfinished business so I'll be watching this till the end. But it sucks big hairy Great Golden Ape's uknowut.\\n\\n\r\nOverall: A poor attempt of making an \"Intelligent, mysterious\" show.",
            "date": "2012-03-15T15:31:00+00:00",
            "helpful_count": 10,
            "mal_id": 56045,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/deadeaddead",
                "username": "deadeaddead"
            },
            "url": "https://myanimelist.net/reviews.php?id=56045"
        },
        {
            "content": "I like this show (and its second season) a lot.  Pretty much one of the very few 2011-2012 anime shows that I really am looking forward to watching almost every single week.  \r\nOut of the many shows that Sunrise have made, I think Phi Brain is somewhere at the top, because it's not about Gundams and physical fighting. There's also a certain air of unpredictability when it comes to this series. \r\nYou have to keep in mind, Phi Brain was made for NHK Educational channel, which is an offshoot of NHK. It's intended to encourage/motivate Japan's youth to challenge themselves.  On theofficial Phi Brain website, for every new episode that airs, they post the accompanying puzzle that showed up in the episode. What's pretty amusing is that the anime stars characters, who are not exactly good candidates for being on an educational channel. \\n\\n\r\nThe show's setting, itself, cannot exactly be taken seriously as it takes place in a reality where puzzles are essentially EVERYTHING. In that world, being super good at a puzzle essentially makes you a celebrity or a target of a some kind of organization. However, if you've played a lot of Professor Layton games, you will get use to this kind of setting in no time. That's what makes that kind of reality unique, in a sense. Not every day will you come across a show that focuses on puzzles, and not about who's being number 1 master/champion of the world.  \\n\\n\r\nStory ~\\n\\n\r\nI was expecting a lot of filler throughout most of the show along with the POG people challenging each of the main characters, which would be atypical of a shounen show set up.  HOWEVER, it never ended up the way I was expecting as there are plenty of random things that do go on in the show.  In the end, the story is no longer just about puzzles and how wrong it is to make them dangerous. It's about friendship, childhood trauma, emotions, and the true meaning of trust. That's what I admire about it. \\n\\n\r\nPuzzle-wise, I enjoyed several of them. The show started off with ones you would sort of expect, but then, some of them do become ridiculous hard to your brain.  They don't always explain how the puzzles work, but I don't mind that at all. You can always try it yourself online.  (And this clearly improves with the second season.)      \\n\\n\r\nThe first OP was awesome. May'n's Brain Driver was a pretty solid and fitting song towards the animation direction that the OP presented itself with. However, the 2nd OP for the second season, if you ever get there, it just blows May'n's away.  (Overall though, they're both good.)    ED wise, I like both first and second season's EDs. \\n\\n\r\nArt ~\\n\\n\r\nKind of what I expect of Sunrise animation. Nothing too spectacular, but it's good enough as it is. They did a lot of good research behind puzzle designs and did pretty well on conveying the character expressions. \\n\\n\r\nSound ~\\n\\n\r\nI think it speaks for itself. Sunrise does their sound and music like any other anime companies.  I already put my input as to what I said about the OPs and EDs so no further comment is necessary for those.\\n\\n\r\nCharacter ~\\n\\n\r\nOut of the zillion anime character archetypes to use, Phi Brain puts together a: semi-grouchy puzzle prodigy, a photographic memory tomboy (-yandere-ish as some call her?), a baby face computer genius, a super convincing cross-dressing artist, a high strung tough crazy/sadistic(?) biker guy, and eventually, an apple juice loving student president. (And then, Kaito's childhood friend who is....*spoiler* so I won't be saying anything about him.) These guys are just lovable in their own ways. All their personalities are different as well as their antics. Even if some of them display, er.... \"fan-service\"-ish qualities, I pretty much disregard it because it's not bad compared to the shounen manga/anime that displays fanservice purely for guys. =__=;;  \\n\\n\r\nI initially wasn't sure what to expect from these characters , but the people behind the show, were able to play with these personalities in order to make the show engaging.  Sometimes, they used the characters to poke fun at their own selves so I like that. ^_^  So much for some cliches....\\n\\n\r\nWe're also able to get into a backstory with some of them, even though, Kaito's past is the main focus. I think season 2 will continue with flexing out some of the other characters' pasts, from the looks of it, even if it's still Kaito past-focused.  The side characters, for this show, are never forgotten in any way. They each get a role to shine in, whether it's a backstory or not.  \\n\\n\r\nSide note: A lot of people wonder what's wrong with the main character, Kaito, and why he treats all these other characters, supposedly his friends, the way he does. There is a reason for this and it's all part of his character development. People need to be patient about him, because his original personality was really.......*spoiler spoiler*\\n\\n\r\nEnjoyment ~ \\n\\n\r\nIf you've reached this far in my review, you can clearly tell that I have enjoyed this show immensely right into the second season. Things got pretty good by the end of the first season, and the second season just leaves the main characters without too much break/mercy.  \\n\\n\r\nOverall ~\\n\\n\r\nIf you can understand that this show....\\n\\n\r\n+ Shouldn't be taken too seriously, while it still has its serious parts (that reminds me of Poke'mon Black/White, the game, just a little bit). \\n\r\n+ Don't expect the puzzles to be fully explained out or solved slowly, at least in season 1. \\n\r\n+ Don't mind a cross-dresser, who is soooo convincing that even after you know the truth, it's still hard to believe.\\n\r\n+ Don't mind the antagonist to be a bit \"creepy\" with Kaito and probably some other people. \\n\r\n+ Isn't all black vs. white. There are a lot of gray areas with the characters. \\n\r\n+ Kaito's own actions are influenced by \"something\". \\n\\n\r\nThen, this is a show that's worth a shot. It's not exactly the level of \"Fantastic Children\", but, it's one of the better shows for me, at least, as oppose to a show full of harlems, stupid fanservice, pointless comedies,pointless fighting, undeveloped characters, and magic girls.  \\n",
            "date": "2012-05-21T12:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 61659,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bokuranokiseki",
                "username": "Bokuranokiseki"
            },
            "url": "https://myanimelist.net/reviews.php?id=61659"
        },
        {
            "content": "When I first heard about this anime, not gonna lie, I thought it was full retard.  Then I watched it, and was really impressed for these reasons:\r\nPacing - The pacing is perfect, they just throw you in the deep end unquestioning, not giving you time to dwell on some of the more ludicrous aspects.  These aspects must exist though to support the story; with the plot so fast at first, they become easily accepted.\r\nSetting - Always enjoy a good school setting with alot of interesting characters that support it.  \r\nStory -  It's about puzzles.  I'm not that into puzzles personally,but it intrigues me with how it's presented.  A break from grunts and powerups is welcome every now and again.  Plus it has already shown flashes of depth that may or may not pan out eventually, but for now it doesn't take itself too seriously.\\n\\n\r\nVibe -  Gives a good vibe, I really look forward to this release every week, even over other popular animes.\\n\\n\r\nit's a show about puzzles, a guy who's good at puzzles, strong friends that surround him to help him solve puzzles.  I won't go into the armband of woo or the code geass eye thing that lets him use his full brain power or the cliche'd personaility of the main character because to really enjoy this you have to go into it with low expectations, there is no hype for this because the high reviews and praise come from people who enjoyed this show for what it is, fun puzzle madness.  enjoy",
            "date": "2011-11-05T21:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 46917,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=46917"
        },
        {
            "content": "Before I start, I would like to say that this is my first review, woo-hoo. Phi Brain is currently at it's 23rd episode, awaiting the 24th, so I thought, why not review? There are only two more episodes anyways.\r\nPhi Brain is probably one of the oddest kind of 'mainstream' shounen I have seen thus far. I have a feeling that not too many people like it, and I can under stand why, but it's actually quite interesting.\r\nStory: 7\r\nPhi Brain has a very interesting concept. The problem lies with how the it was shown. See, solving puzzles and all, all that is extremely interest. I likepuzzles, you like puzzles. Puzzles are great. They're fun. But in Phi Brain, we're dealing with large-scale puzzles that can get you killed. It starts off when Kaito gets the Orpheus armband, and he starts solving puzzles like a bamf. But the thing is, we never how the characters are solving them and what is going through their minds when they are. I mean, they show us how the puzzles work. (They only started showing us that in the later episodes) But they don't show how the Solvers solve 'em. \\n\\n\r\nArt: 5\\n\\n\r\nI didn't really like the art. It was just not in my taste, and it was plain... weird, I guess? Not to say that the art was terribly bad. There are a few random moments where the art would be good. Not to mention that the animation wasn't that great in itself. It felt a little to choppy and 2-D. Also, the weird lines on the young people's faces. More so, on their cheeks. Now at first I thought, oh it's like Hetalia, where they're all blushing! BUT NO IT'S NOT. First of all, these so called 'blushes' aren't even a colour similar to blood. They're like black or brown, and somehow I find it hard to believe that that's how you look when you blush. They actually kinda look like whiskers. That whole idea kinda threw me off, but whatever. It's okay.\\n\\n\r\nSound: 6\\n\\n\r\nI didn't really like the theme song at all, and the OST wasn't something so impressive. The theme song made Kaito look all awesome and cool and much more than he really is... I suppose. I mean not to say he isn't cool. But wait. I'm deviating. Anyway, the OP threw me off, because it was more of a title song than anything, talking about puzzles and all. I guess I don't really like title songs much. (Let's make Pokemon an exception :3) However, the reason I am giving this part a 6 is because of the ending theme since it was really nice and pretty to listen to. \\n\\n\r\nAnd the seiyuu selection was pretty cool too. I mean Asanuma Shintarou? Fukuyama Jun? Pretty awesome if you ask me. Especially Jun's voice acting of Gammon. It just goes to show his vocal variety.\\n\\n\r\nCharacter: 7\\n\\n\r\nThere are many interesting characters in Phi Brain. However, like the first three main characters are so typical. First we have our protagonist, Daimon Kaito. And then our clueless female sidekick with a useful ability (in her case, her memory), Nonoha. And then a rival who becomes their friend, Gammon. And a group of people to fight against, the POG.\\n\\n\r\nNow when Kaito gets suddenly encouraged or something like that, he'd grin and say. \"Guess what time it is? It's puzzle time!!\"\\n\\n\r\nPUZZLE TIME. You know puzzle time. Good ol' puzzle time. Let's sit in a circle and solve a jigsaw puzzle. Because you know, it's puzzle time.\\n\\n\r\nKaito also goes on to show that the puzzles have emotions. No, don't blame the puzzle. It's never the puzzle's fault. It's the people who make the puzzle. Never blame the puzzle. Can't you see? This puzzle wants to be solved! It wants to be happy! Set free! \\n\\n\r\nNow, there are a possibility of three reactions for this:\\n\r\n1) LOLWUT\\n\r\n2) Woah, it's scary how much he's obsessed.\\n\r\n3) Hmm, interesting.\\n\\n\r\nNow I had the first reaction, which is what kept me watching until now. Kaito is seriously obsessed with puzzles. There's not a single puzzle he won't solve, or can't solve.\\n\\n\r\nNow Nonoha, is our typical female sidekick that helps Kaito in his time of need. The kind of girl who is extremely worried about him, but won't exactly do anything. Well, something like that. I guess she tries to do something for him, but epically fails? That kinda thing, I guess.\\n\\n\r\nAnd then there's Rook. Oh gosh, Rook. There is such a deep meaning in his name. I don't want to spoil too much, but he's the kind of guy with a roneriness-complex, and Kaito was his light, so he's all yan-yan over him. And it's not even yandere. It's just yan, because there's nothing deredere about him. So he can go batshit-crazy over the fact that Kaito has friends other than him. \\n\\n\r\nEnjoyment: 8\\n\\n\r\nTo be honest, it was actually pretty enjoyable, since I was really interested at first. The good thing about Phi Brain is that it usually leaves off at a really cliff hanger-y place. So that makes it more fast-paced and enjoyable to watch, because you want to know what happened next.\\n\\n\r\nOverall: 7\\n\\n\r\nIf you're the kind of person that likes mainstream shounen (which isn't a bad thing, because a lot of people including me like it, so it wouldn't make sense if I bashed it) then this is for you. However, if you don't like not understanding about what the protagonist is thinking about and you don't like 2-D art, then this is not for you. Furthermore, if you don't like puzzles in general, then this is also not for you.",
            "date": "2012-03-15T10:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 56033,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=56033"
        },
        {
            "content": "This show would basically be your generic shounen, if not for a couple of....interesting....things\r\nstory:  pretty much revolves around kaito, everybody is either out to murder him or out to get puzzle time with him. no seriously, puzzle time with kaito will be MINE! there is a background story about evil plots, a divine puzzle and other stuff, but the main focal point is definitely puzzle time with kaito.\r\nart: average, probably not 2011 worthy, but honestly i'm not to obssesed with this as long as they don't give it.....american tier \"art\"\r\nsound: opening was really good, the sounds during the show weren't spectacular, but they didn'tannoy me either.\\n\\n\r\ncharacters: only a couple of main characters had much depth to them, i've already seen season 2 which helped build to alot of characters depth, i will say that the first season probably did not nearly as much though. Ana is best character, just saying\\n\\n\r\nenjoyment: to be honest i reallly did enjoy it for the most part. in fact, i laughed alot because of how....ridiculously overdone it was, with you know....that and that. you'll probably either laugh alot or get pissed off alot. if your the type who gets pissed off i'd probably abandon, because its super over the top all the time every time.\\n\\n\r\noverall, i'd give it like an 8. because its puzzle time\\n\\n",
            "date": "2016-03-16T07:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 213052,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695065.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nekotan7",
                "username": "nekotan7"
            },
            "url": "https://myanimelist.net/reviews.php?id=213052"
        },
        {
            "content": "Daimon Kaito is genius, who loves to solve puzzles. Sounds interesting, but...well read on.\r\nStory\r\nPhi Brain is supposedly a story about a kid who likes or rather has a unique talent to solve puzzles. Unfortunately, most of the story focus on other things rather than solving puzzles. Very rarely are we given a glimpse on how the puzzle is solved, heck we are not even given enough time to think about it! For a guy like me who likes puzzles, it was big let down. Where the heck is the thinking, explaining, etc? Heck I saw more puzzle solving in the new HunterXHunter series than inthis one! Big disappointment. Instead of puzzles what do we get? Well you get your typical \"high school\" action/drama/comedy anime that try to get you to \"appreciate\" puzzles, but does a miserable job at it. They go so far as to even talk about some nonsense about love for puzzles or crap like that. Yippie. Fortunately, it improves story wise after the first 13 episodes or so, and keeps us interested, but that ending was plain terrible! It seemed rather predictable and just wasn't genuine. It seemed too happy go luck after the darker episodes that we were shown. I give a 5.\\n\\n\r\nArt\\n\r\nI'm not sure who did the artwork in this show, but it's terrible. I mean bad. I probably wouldn't be bad if it were ohhh let's say 1995, but heck even then some animes had better quality than this one. The panning still shots with vocabulary , cheap graphics, oh God the humanity!!! Let's just say that the animation is less than adequate or mediocre...another 3!\\n\\n\r\nSound\\n\r\nIt's not particularly great, but it's not terrible either. Brain Diver (the OP) is ok, but nothing great. Voice acting and sound effects do not really stand out. I give it a 5. \\n\\n\r\nCharacter\\n\r\nPretty mediocre. The characters are your typical characters, Daimon is a clone of your typical sarcastic know it all \"leader.\" Nonoha is your typical tsundere type with a more happy mood. I can go on, but really none of these characters stand out. I'd say the worse has to be Anna who is guy (yes a guy) who looks like a girl,...wait haven't I seen this before? Come on man!!! I give the characters a 5.\\n\\n\r\nEnjoyment/Overall\\n\r\nAfter watching it completely, it did improve story wise, but that ending just killed it. It was terrible. The start was bad, then it improved considerably and I enjoyed the tests that Rook would put Kaito through, but after all that it turns out too happy imho. Now I hear there's going to be a 2nd season? For what? Either way this season wasn't great, neither was it very very bad. Just pretty mediocre imho. I give it a 6.5.",
            "date": "2011-12-12T19:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 49063,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=49063"
        },
        {
            "content": "I was deeply in love with this series ever since the first episode...\r\nStory 10/10: \r\n        The way it was thought out was in a magnificent glory of fragrance. Episode after episode had me hooked until the very end, when they solved all those complicated puzzles it kind of made me feel dumb because I knew that I couldn't solve it. Even if it didn't give us a chance to solve them I really don't mind because I watch anime for the overall enjoyment.\r\nArt 10/10:\r\n      I really loved how they made Ana Gram lookso much like a girl! Gammon was pretty funny looking but I didn't mind one bit! I always thought Nonoha was a very beautiful girl even if her hair wasn't down. Cubic looked like a little kid, I always just wanted to jump into the screen and pinch his cheeks x3. Finally, Kaito Daimon, he looks like one of those guys that would be in a gang (well sort of) the thing that I really loved about him is how when the armlet activates one of his eye's turns red! x3\\n\\n\r\nSound 10/10:\\n\r\n       I very much enjoyed the opening song, it was a good choice and it almost matched the story line. The ending wasn't half bad either... anyway all of the voice actors did an outstanding job trying to match the character's personality, everything was just impressive.\\n\\n\r\nCharacter 10/10:\\n\r\n       Kaito was a pretty cool guy in the beginning and to the end, he was smart, he looked cool, and he was a kind guy too! Nonoha reminded me of Sakura from Naruto because of the strength they both had, I also enjoyed Nonoha from how caring she was. Gammon was my second favorite character (My first is Rook) because of how he hides the fact that he actually cares about people, but yet people can't see that. Ana Gram was a good person I especially liked him because he's a Hideyoshi x3, (I was so fooled by the girl voice and looks ). I very much liked Cubic because of him being so short and him being such a genius, also he seemed to be bad but was actually  a nice person deep down. \\n\\n\r\nEnjoyment 10/10:\\n\r\n       I absolutely loved every last detail about it and how it was designed, it all flowed in a harmonic web of destiny. \\n\\n\r\nOverall 10/10:\\n\r\n      Best Anime i've seen about puzzles that is...\\n\\n\r\nIf I recommend it:\\n\r\n      Watch it I'm sure you'll enjoy it like I did.",
            "date": "2013-12-29T04:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 126147,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439501.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cyrenia",
                "username": "Cyrenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=126147"
        },
        {
            "content": "Story:\r\nIt opens with some idiot leading the way and stop Hammertime. From the ceiling giant hammers. From there I had to watch. So it turns out that like many other animes it takes place in a school and in a ruins behind the school where a hidden power probably rests. The story itself like the name revolves around puzzles and solving them, for the first episode the action is pretty tame, but it still manages to catch my interest. (probably just me) The way things look it seems to be similar to a tower of druaga setting where main clears levels or something but itis too early to say.\\n\\n\r\nArt:\\n\r\nAs expected of the modern age the art is pretty good and the character designs are somewhat interesting yet as always the main just stands out.\\n\\n\r\nSound:\\n\r\nThe opening sounds great, and the voice acting appears to be good.\\n\\n\r\nCharacters:\\n\r\nSome of the characters are pretty cookiecutter childhood friend who tsukkomis the main's obsession with puzzles violently. The main is Kaito, a super genius whose goal is to solve puzzles just for the sake of solving them,plus some sort of past promise. You have thee student council president and chairman in kahootz and finally an idiot celebrity.\\n\\n\r\nEnjoyment:\\n\r\nCause I like puzzles and I can pause the video and solve them at my pace. It was interesting pace which had a decent closed story within itself\\n\\n\r\nOverall it may depend on who likes it this will be updated by the sixth and final episode probably.",
            "date": "2011-10-05T21:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 44927,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447572.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dim100",
                "username": "dim100"
            },
            "url": "https://myanimelist.net/reviews.php?id=44927"
        },
        {
            "content": "If you're new to anime, you may like Phi Brain?\r\nIf you are able to pride yourself on your patience, you may like Phi Brain?\r\nPerhaps you are just an eternal optimist - you have the ability to see the best in any situation?\r\nI see myself as quite an optimist...\r\nSomeone who doesn't like feeling dissapointed and thus, only ventures into the interesting, holding has high hopes and wanting to enjoy -  Phi Brain is a test! \r\nCharacters...\r\nThe typical 'popular' types that are slotted anime's on a regular basis.\r\nWriters knowing that the audience will see familiarities this character shares with a number 'highly popular' characters from otheranime that have massive fanbases; the 'clone' is instantely accept. \\n\r\nThough often, ittle effort has been made to take a 'type' and make it stand out from the thousand of others of that 'type', this lack of individuality easily equals 'generic'.\\n\r\nHere are a few examples:\\n\r\n- a passive male main, the hero central to the plot; he's of school age (a schoolboy infact) who is hailed a 'genious' - this is his ability, though he doesn't partical stand out; he isn't popular or awkward, he's just a modest medium who fits in, displaying little personality as he's he's 'all-work-no-play'\\n\r\n- his tsundere, stroppy, tomboyish childhood friend female sidekick who assaulted him for reason upon her debut; doesn't seem to have any reason to be around and doesn't seem to hang around with anyone else, her only reason for being present appears to be; love interest and occasional damzel in destress\\n\r\n- the token smug starter rival\\n\r\n- the unhinged, eccentric 'bad boy'\\n\\n\r\nStory...\\n\r\nThe story has every potential to be decent, it's simply about a boy who's a genious and can solve complex puzzels, puzzels in many sences of the word; the series has went from getting out of booby traped ruins, to solving a conspiracy - this story could cover a lot of grounds, yet unfortunately, like many series's out their, the story takes a back seat; in order to providen 'funny' entertainment, the priority order of material is; character type>tried-tested-and-approved scenario>current plot.\\n\\n\r\nArt...\\n\r\nThe best aspect of the series - the characters are very pretty, the scenery is well detailed, the colour pallet is very bright yet mellow and the characters in motion look very fluid.\\n\\n\r\nEnjoyment...\\n\r\nNone too enjoyable for a veteran like myself; even lowering my expectations didn't work - it makes one think 'If I want a mystery, I'll watch '...' instead' and 'I'll turn to '...' to view 'that' character type played out in a decent manner'. \\n\r\nUnless this series does a dramatic 180 some time very soon, 25 ep's is honestly too long.\\n\\n\r\nOverall...\\n\r\nMediocre - though many generic anime's do 'generic' better then this.",
            "date": "2011-10-27T03:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 46291,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=46291"
        },
        {
            "content": "I have to admit that the first couple episodes I was pretty bored but then by like the fifth episode it got pretty interesting. Kaito Daimon is the main character of this anime. He is a genius solver of puzzles. There are two people involved in puzzles. The people who solve them (solvers) and the people who create them (givers). Kaito has to challenge many puzzles that put his own life or the life of someone dear to him in danger. If you don't think that's a thrilling part of the anime then you're completely wrong. In this sense it makes Kaito actually seem likea real hero because he saves their lives by solving the puzzle. If you think this anime you actually can solve the puzzle with Kaito then you'll be sadly disappointed. These puzzles that he encounter cannot be solved by the viewer by themselves. That is something that actually did disappoint me.\\n\\n\r\nHowever despite that what really truly brings the show are the characters. You learn to love Kaito. It is because he has this backstory that makes you just want to hug him. He lost his parents due to a puzzle they couldn't solve. Nonoha is a very important character in the anime as well. You'll learn that she is someone truly dear to Kaito. Nonoha is a childhood friend of Kaito who can't solve puzzles but she has an amazing photographic memory. What I love about this season is that the main antagonist is actually Kaito childhood best friend. Also the other characters, Jikukawa, Cubik. Ana Gram and Gammon are technically Kaito's crew. Each character plays a very important part for Kaito in this season.\\n\\n\r\nWhat I love about this show is that there is more than one season. This season the first season really helps establish the world that the characters live in and the other seasons really build off of it. This show was entertaining because of its original storyline and its dynamic characters. You don't need to love puzzles to love this show and I think that something I love about this anime. So give it a chance  at least because you'll find yourself liking it too.",
            "date": "2014-10-29T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 166671,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4213381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/cjoycoolio",
                "username": "cjoycoolio"
            },
            "url": "https://myanimelist.net/reviews.php?id=166671"
        },
        {
            "content": "10 Okabe-sans out of 10. One of the most epic anime to ever exist. Every episode was an ephemeral and viscerally compelling experience in action, drama, music, and graphics. Every puzzle was meticulously crafted from what seemed to be generations of research, experience, and dedication. No puzzle was like the other and each one worked in myriad ways to bring the plot dead front and center to stun the viewer into being completely shocked at its scale and depth. Yes, this anime was that deep and it even went deeper as the episode count went on and the stunningly designed main characters went through hardtrials of friendship, trust and betrayal as they worked to save the world from the clutches of evil and bring the moon and the sun together at last. The music greatly complemented this with rifts and synths that were characters of a ritzy jazz club to being as emotionally moving and perplexing as a Beethovian symphony. Verily, this anime was unlike any other and was, ultimately, the anime of the last year and 2012. I can bet 10 Apple Juices out of  10, that like Jikugawa, this anime will be unable to resist being something you need to indulge.",
            "date": "2012-04-05T13:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 57979,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/317035.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/27CansOfTuna",
                "username": "27CansOfTuna"
            },
            "url": "https://myanimelist.net/reviews.php?id=57979"
        },
        {
            "content": "I have this policy that I should not write reviews for anime which I have not completely seen, atleast for those which finished airing. This is an anime which made me really happy I stuck to my policy, because my rating dropped from my initial thinking of 7 after first two episodes to 5 later on.\r\nComing to the actual review. The core concept is a good one as is to divine revelation which can make man God. Now how the story develops around it is the anime. Obviously from the title you can guess its in the form of puzzles. People have to slove puzzlesto get closer to this divine power.\\n\\n\r\nIf the plot of the series is revealed in the first few episodes, its interest should be carried in some form till the ending with a good ending. This anime completely fails at it. Not only does it fail to deliver anything interesting, it fails to do even a medicore job and has one of the most crappiest endings ever seen.\\n\\n\r\nThe antagonist is in some form of love with our hero, and keeps chanting his name watching him on a big screen which makes you sure he is gay and that is how the theme is carried.\\n\\n\r\nWhen the hero activates his sort of magical power, do you remember the old atari/nintendo 2D game console 8 bit music, such crappy music plays. Honestly its a failure in every aspect, character, character development, art, sound.\\n\\n\r\nStory: 6\\n\r\nCharacter: 5\\n\r\nCharacter Development: 3\\n\r\nArt: 5\\n\r\nSound: 5\\n\r\nOverall: 5",
            "date": "2012-07-22T15:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 67359,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/282120.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jkalyana",
                "username": "jkalyana"
            },
            "url": "https://myanimelist.net/reviews.php?id=67359"
        },
        {
            "content": "Phi Brain: Kami no Puzzle is a very quirky anime. There's a lot of seriousness, but also a lot of comedy. There's a good balance between the two.\r\nStory:\r\nThe thing that makes Phi Brain strange however, is that the seriousness is about something you'd never really think of in that way; puzzles. There's constant talk of \"setting puzzles free\". Sounds ridiculous, but the show takes it very seriously, and I actually find that I go along with it. Despite the strange sound of such a statement, the seriousness of it is not ruined. The story is actually quite good, despite the strangeness, and I feel quitecompelled by it.\\n\\n\r\nArt:\\n\r\nThe art is fairly nice. I don't think it's anything majorly amazing, however.\\n\\n\r\nSound:\\n\r\nSame as the art. The music fits the atmosphere, however, it's not spectacular. You tend not to notice it; it just blends into the atmosphere.\\n\\n\r\nCharacter:\\n\r\nThe characters in this show are actually quite interesting. Kaito, our main character, is a very ambitious guy. I think as far as diversity goes, Cubic and Anna are quite interesting. I won't spoil the surprise about Anna, but Cubic is quite determined as well, and although he seems to be a cute kid, he does some strange things for the sake of his experiments. Rook is a very enigmatic character, and as a \"villain\", I think he fits the role well, despite his strangely styled hair (can't really decide if it's cool or just weird; it varies per shot.)\\n\\n\r\nEnjoyment:\\n\r\nThe only thing about this show that deters from me liking it more is the fact that they never show you the legwork through the puzzles. The characters just always take wiki walks and arrive at the conclusion with no evidence that they even solved it. Also, despite the cool idea, I feel like Kaito's Armband of Orpheus is a little bit of a cheat. He never really has to solve the puzzles normally, because it activates the rest of his brain so he can use 100% of it to solve the puzzle. Good idea, but a little bit cheap when it comes to the progression of the story.\\n\\n\r\nOverall:\\n\r\nI think this show is actually really good. The seriousness regarding puzzles makes it a little weird, but I find that I really like it. If you like chess type situations between the \"good guys\" and the \"bad guys\", you'll certainly enjoy this show. Overall, definitely worth a watch even if it only sound mildly interesting to you. At first I was unsure of it, but when I started watching, it was better than I expected.",
            "date": "2012-01-10T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 51481,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356067.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ComposerLOST",
                "username": "ComposerLOST"
            },
            "url": "https://myanimelist.net/reviews.php?id=51481"
        },
        {
            "content": "I don't usually write reviews for much of anything.  However, at the moment I feel as if rambling is the best and only way to iterate the immense disappointment that I feel after watching Phi Brain: Kami no Puzzle.\r\nI should start by stating that I loved the premise of this anime, and I was also impressed by the fact that it dared to be artistically different.  Having said those things, I was really excited about Kami no Puzzle, and, although the pilot episode made it clear to me that it was a Shounen anime, I actually liked what I saw in the beginning.\r\nIsuppose that my fancy little clincher and hastily written summation of the anime's pros lead up to this statement:  Somewhere along the line, the ball was dropped, and it hit the ground with a thunderous smack.  Suddenly, the relaxing pace became a race to tie up the story.  The rush, in my opinion, only made it more obvious that some earlier episodes could have been swapped out with episodes that better contributed to plot progression.  To add fuel to my fire, the story's primary and secondary conflicts were poorly addressed, if they were ever really addressed at all.\\n\\n\r\nI suppose that if you really like Shounen, then Kami no Puzzle's formula won't bother you as much as it did me.  Besides, even with all of the humbug obstructing my view, I could see that it had potential and possibly still has that potential.  It's all just a matter of execution.  \\n",
            "date": "2012-05-19T21:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 61563,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102021.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/CCLocs",
                "username": "CCLocs"
            },
            "url": "https://myanimelist.net/reviews.php?id=61563"
        },
        {
            "content": "Story/Plot:\r\nThe entire plot from my stand point was impressive, and well thought out. It has the usual action Anime theme's such and betrayal between old friends being one of the main one. I labeled the story as a ten because there is a plot to this, as I personally do not watch Anime without a plot.\r\nI liked this because I connected with the main character with are usually genius children (not that I'm a genius because that's not how I connected) that like puzzles. Throughout the show its almost as if a game show, you have the characters struggling through life sized, life endangering puzzles.The protagonist, of course being the best at solving the puzzles and often ends up helping his friends. However drama happens that causes the protagonist to lose his abilities sometimes and well... Watch and find out.\\n\\n\r\nArt:\\n\\n\r\nThe art was great and I'm not just saying that. I didn't see any mistakes anywhere but, I'm no professional. However they are great when compared to say, soul eater. However I took a point because I thought that some of the smaller details could have been better done.\\n\\n\r\nSound:\\n\\n\r\nThe sound was great and honestly some of the best for me. The opening song is what I fell in love with however, if you watch this there is a high chance you will walk around singing it as it is highly catchy ( for lack of a better word)\\n\\n\r\nCharacters:\\n\\n\r\nThe characters are all very different in their own way. I say \"In their own way\", because a good bunch of them are genius' and a bunch manipulative. However they got a ten because their personalities made it so that none of them are the same. The Characters do develop at a fast pass however, an example being a good guy becoming a bad guy in the span of about three episodes.\\n\\n\r\nEnjoyment:\\n\\n\r\nThe entire time I was watching this I was full of anticipation. I just couldn't stop. Watching the show go on I couldn't stop myself it I wanted to from feeling that I was there too. I was in the puzzle shouting clues and cheering on the solvers. I just can't wait for season two =D(even if the first hasnt ended yet)\\n\\n\r\nOverall:\\n\\n\r\nLike I was and it really says it all, I can't wait for season two.",
            "date": "2012-03-18T09:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 56257,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/firefull12",
                "username": "firefull12"
            },
            "url": "https://myanimelist.net/reviews.php?id=56257"
        }
    ],
    [
        {
            "content": "Phi Brain has one of the widest gaps between an astoundingly moronic premise and a brilliant execution that I've ever seen in an anime series. \r\nThe series can be summed up as \"basically a less merchandise-driven Yu-Gi-Oh, but instead of HEART OF THE CARDS it's UNDERSTAND THE FEELINGS OF PUZZLES\". Denouements for each episode are easy to see, especially if you've ever seen any other anime series in your life. The animation is bad by 2011 standards and the character designs are amateurish. By all accounts this show should be awful and a waste of time.\r\nAnd yet, it is neither, due to its dedication atbeing hilariously over the top.\\n\\n\r\nTake, for example, a flashback in the first episode wherein a certain person implores the main character to solve unsolveable puzzles and ease their pain. Or the moment, also in the first episode, where the female lead asks about what to do, to which the main character replies \"Isn't it obvious? It's PUZZLE TIME!\" as a salsa tune kicks in. While Yu-Gi-Oh had moments of shining brilliance such as this, they were mere glimmers amidst the sea of generic shounen merchandise glut and couldn't bring up the show. With Phi Brain, these moments ARE the sea, and just when you think the well has run dry, an unnecessary character revelation or an inappropriate phrase pops up and gives you such a giddy whiplash that you're sold all over again.\\n\\n\r\nAnd the show is currently only four episodes in! Should it continue this trajectory for the remainder of its 25 episode run, it may end up as one of the better offerings from the Fall 2011 season.\\n\\n\r\nPeople who complain that the puzzles are mostly solved off-screen are missing the point. The show really isn't about the puzzles, and they're given the focus that they get so that the viewer can solve it him/herself and feel like they, too, can be the GOD OF PUZZLES and not focus too much on how things like sudoku and the rush hour puzzle are presented as brain-busting puzzles that only the most brilliant of minds could ever hope to solve.\\n\\n\r\nOther factors that work in this show's favor are Jun Fukuyama, who is hamming up his role so much that he probably wore a curly tail and snout to recording sessions, and the opening theme song, which is the aural equivalent of a plastic army figurine melting in a microwave.\\n\\n\r\nThe viewing experience of Phi Brain is akin to watching a three-legged dog energetically hobble its way down the street, trying to dodge passersby and obstacles, in order to reach a fire hydrant to piss on. You have much better things to spend your time on than watch this dog. Your brain deserves to be devoted to much better. And yet you stare transfixed at this dog, from the second you first notice it to the moment the last drip falls, and you finally know true beauty and contentment.",
            "date": "2011-10-27T14:17:00+00:00",
            "helpful_count": 134,
            "mal_id": 46317,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/550605.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/moonlightgirl",
                "username": "moonlightgirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=46317"
        },
        {
            "content": "To put 'Phi Brain: Kami no Puzzle' in a nutshell, imagine watching a game of chess between two supposed grandmasters, with the added bonus of being able to hear snippets of the players' thoughts. There is just one catch: you cannot see the chessboard.\r\nStory: \r\nPhi Brain's concept is not out of this world: a genius highschooler taking on a dark organisation by relying on his wit to solve some of the most difficult of puzzles known to man. And the show could have been a hit, if not for the fact it decided that viewers do not need to know how the puzzles were solved.The whole kick of a psychological anime, then, is lost, as viewers simply don't feel the engagement, or the experience of sitting at the edge of your chair trying to glimpse what is going on inside the protagonist's mind. \\n\\n\r\nSound:\\n\r\n(Bypassing the category of Art, which is really not noteworthy) OP song is apt, ED song is generic, and the soundtrack is nothing amazing to speak of. The factor that adds points to the sound factor is actually the casting of voice actors, which are generally appropriate and convincing. \\n\\n\r\nCharacter:\\n\r\nLike everything else in this show, the characters are run-of-the-mill: a reluctant hero with a supportive female sidekick and a rival who is always trying to outdo him. While I will not go so far as to state that they are completely one-dimensional, they are predictable enough that interactions quickly become bland.\\n\\n\r\nEnjoyment:\\n\r\nDespite all these mediocre qualities, Phi Brain does provide decent entertainment. The caveat though, is that you have to see it as an average highschool action/game anime and approach it without expectations of seeing Death Note's level of analysis, or Liar Game's level of sheer genius. \\n\\n\r\nOverall:\\n\r\nWhile this anime obviously flopped when it tries to provide a mental ride for viewers, I have to be fair and say that true psychological masterpieces are rare. For all its merits, Phi Brain is not bad; it just induces you into the familiar state of passive viewership. And if Phi Brain was even trying to be intelligent, there would probably be no greater insult.",
            "date": "2011-10-10T04:54:00+00:00",
            "helpful_count": 103,
            "mal_id": 45229,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109686.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jen9204",
                "username": "Jen9204"
            },
            "url": "https://myanimelist.net/reviews.php?id=45229"
        },
        {
            "content": "Phi Brain is all about solving puzzles, however if you think that you'll be able to solve puzzles along with the protagonists, then I'll put that hope to rest now; you're not. Whilst you'll get the occasional glimpse at the whole puzzle, they are for the most part exclusively for the characters.\r\nThe character designs are very brash and crude, very much like the show itself, and whilst I am hesitant to call them outright bad they are certainly below average. This is a low budget anime, and so the animation and art is poor, expect to see many off model shots every episode, which areoften so bad that they are distracting. Whilst this is the case, the animation level doesn't detract too much from the anime as a whole.\\n\\n\r\nThe music is worlds apart from the art, the opening \"Brain Diver\" is a catchy and energetic song that fits the series well, and the ending, \"Hologram\" is a pleasant track that grows on you as the series progresses. The soundtrack is also pretty good, which at points makes up for the appalling animation quality. It isn't amazing, but is remarkable considering the budget, and works well to make the action scenes tense.\\n\\n\r\nDuring the first few episodes you will find yourself hard pressed to like the main characters, as the first few episodes focus on making Kaito look as cool as possible by having him casually solve difficult puzzles and the like, to the point where it feels like they're trying to force it down our throats. Gammon comes across as loud and obnoxious, and Cubic seems like an arrogant child prodigy. However as the series progresses past the first few episodes and onto the main plot, the characters become much more likable. This is because they stop trying to outdo each other in both arrogance and in puzzle solving and start working together against the antagonists of the series, the POG.\\n\\n\r\nThe story starts off very simply, the POG will set Kaito a puzzle and he'll proceed to solve it using his Orpheus armband, often with the help of one of the geniuses that Kaito meets during the first few episodes. Fortunately the plot becomes more engrossing before too long which makes the series more interesting and reduces the repetitiveness. Don't expect anything deep or complicated from the main plot of Phi Brain as it's still straightforward and standard shounen, but it's an improvement. The puzzles act as a way for the characters to fight each other, and in later episodes \"battle puzzles\" are introduced, where the two contestants directly match their wits. This is quite entertaining at times, however, the fact you can't see the puzzle in its entirety is frustrating, as it alienates you from the tactics employed.\\n\\n\r\nPhi Brain improves as it progresses, but it never reaches the level of quality I would have liked, however that does not mean it's bereft of entertainment, and although it doesn't have the gripping battles of wit it was aiming for, it's a simple  shounen that you can find fairly enjoyable if you aren't feeling too critical.",
            "date": "2012-09-03T10:32:00+00:00",
            "helpful_count": 80,
            "mal_id": 71505,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=71505"
        },
        {
            "content": "Isn't it weird that a show about puzzle solving \"geniuses\" turns out to be one of the dumbest anime to date... But it's all in good fun if you don't take it seriously.\r\n*This review goes up to episode 4, and will update as more episodes come along*\r\nSTORY: Yeah, it's puzzle time! We get a lot of mystery anime involving solving shit coming our way and a lot of them are, well, blegh. That's the response you would get from any character in this anime, despite the \"fact\" that they are \"geniuses\" and they can solve puzzles, it isn't a mystery to say that Phi Brainis pure brain rot.\\n\r\nYou can't get anymore stupider than this anime, it's absurd, it's a poorly told story, the characters are \"geniuses\", however it's, honestly, quite fun.\\n\\n\r\nYou would have to be quite an idiot to take this anime seriously, especially when lines like \"Solve those poor puzzles, set them free\" or the classic, \"This puzzle wants to be solved!\" are spoken. This anime takes itself deathly serious, there are no jokes or even tongue in cheek moments, it's serious shit, especially when a whole town can be blown up if a puzzle can't be solved! But, this is some really silly, silly, silly shit, and not even an ounce of seriousness should be applied here at any time, it's completely goofy, and from this point of view, it is incredibly fun to watch as good popcorn entertainment.\\n\r\nBut, any who, the story is about a high school teenager Daimon Kaito who can solve any puzzle and just can't resist the urge to solve them no matter what the risk, life threatening or not (No matter how ridiculous that sounds).\\n\r\nAnd one day, he is challenged to solve a super puzzle called a sage puzzle, and, of course, solves it, with the help of his trusty female side kick Nonoha, and an arm band that he obtains that makes him into an even more bad ass puzzle solver (This is something I never would have thought to call bad ass, it's also the equivalent to how Yugi from Yugioh turns into the bad ass card dueling pharaoh, but almost not as ridiculous, almost), and also later on obtains the title of Einstein, which has to be part of a hilarious satire... I wish, as other characters (More puzzle solving bad asses) with titles like Edison continue to show up.\\n\r\nThe main characters consists of Daimon Kaito, the bad ass puzzle solver, Nonoha Itou, the plucky female side kick who can be more than just a side kick chore holder, Gammon, the insta-frien-emy-rival who likes to show up to solve puzzles too and contribute to comedic situations, and several others that will be revealed along the way.\\n\\n\r\nTo be honest, this anime already feels like it's gone on long enough, the puzzles of life or death situations are tiresome, it isn't really fun watching Kaito solve everything in seconds, and just feels like a waste of time, but, it's still silly enough to enjoy all of that, and not even one brain cell to required to have in order to enjoy this anime, it's pretty simple, but it's dumb enough to kill brain cells if you try to apply one to the show while watching it, and it's a 25 episode series, so there's going to be a lot of puzzles, more ridiculous moments, and did I forget to say puzzles? Because this anime has a one track mind only focused on the stupidity and ridiculousness that comes along with the dangers of puzzle solving, if that makes any sense...\\n\\n\r\nANIMATION: While the character designs are very distinctive, they are bit rough looking, but animated well enough. There are a lot of still frames and crude animation though, but it still good animation none the less. Most of the backgrounds are settings at typical looking schools and cities, but there is a lot of interesting (That word is being used as loosely as possible) puzzle related animation segments going during puzzle time, so it's not hard on the eyes in the slightest.\\n\\n\r\nSOUND: Kinda what you should expect from any shonen anime, though this is one about puzzles, it is just anything not really noticeable, background music wise. The opening theme song, Brain Diver, however, is incredibly catchy. The voice acting is okay, but of all the characters, Gammon sticks out the most as a crazy sounding puzzle solving lunatic who speaks random english from time to time. And if anything, the dialogue is simply the best thing about this anime, the characters are so serious sounding all the time, yet it's completely mind boggling in why would they say stuff so ridiculous.\\n\\n\r\nOVERALL:\\n\r\nThe Good:\\n\r\n+ Puzzle solving shonen show, something different.\\n\r\n+ Goofy and silly as it can get, go into this without taking it seriously and you're in for a blast.\\n\r\n+ Hilarious dialogue, and awesome theme song.\\n\\n\r\nMixed\\n\r\n+/- Goofy characters.\\n\\n\r\nThe Bad:\\n\r\n- Simply one of the stupidest shows this year has to offer, story is too simple for it's own good.\\n\r\n- Too ridiculous at times, Daimon is a little too fast at solving puzzles to the point of getting repetitive.\\n\\n\r\nMaybe this show works because it's so stupid, I mean the writers couldn't possibly be taking this seriously, so it's surely all for fun, and you would be stupid to get mad at it this for being silly and absurd, after all, the dialogue is just too silly to get angry over. \"Save those puzzles!\"",
            "date": "2011-10-19T12:46:00+00:00",
            "helpful_count": 17,
            "mal_id": 45837,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=45837"
        },
        {
            "content": "Puzzles. Solving them is extremely fun, and supposedly they have a heart. Some puzzles are so damn dangerous that you could die if you mess up. The word \"puzzles\" is mentioned a lot of times in this show. It gets quite annoying. \r\nStory: The main character is a fuckin' smart-ass, and he's nicknamed Einstein.  He is put into a situation where he has to solve super-duper-mega-pooper dangerous puzzles for absolutely No. MothaFucking. Reason. The show is about puzzle solving, yet 80% of the god damned episode we see the main characters in school. Or doing something crappy unrelated to puzzles. And when the showgets to the \"Puzzles\", they're solved so fking fast, and I mean DBZ fast. We get no time to think about it, making the whole show a regular high school Drama/Comedy anime. At some times they'll even put in music trying to make it seem \"exciting\", but they fail hard.\\n\\n\r\nWith an added \"Plus\" they say something about \"ruining/destroying the world\" or SOME crap like that. BUT, WHAT THE FUCK ARE PUZZLES GOING TO DO TO THE WORLD? Do they EXPECT every SINGLE FUCKING PERSON IN THE WORLD TO TRY THESE DANGEROUS PUZZLES (having the knowledge that they could die if they fail) THAT THEY SPEND BILLIONS ON JUST TO CREATE? DAFAQ IS WRONG WITH THEM?\\n\\n\r\nWhat I don't understand is why this is a \"mystery\" show when there IS NO MYSTERY. The protagonist solves everything in a flash. We don't even see his thought process, IS HE A FUCKING MACHINE? Detective Conan actually gives us clues, time, and information, and enough of it for US to even solve, where this show completely lacks in.\\n\\n\r\nYUGIOH! Yes. A Golden armband is given to the protagonist (Diamon Kaito), which unleashes his inner \"Yugi\", making him 100 times more smarter and helps him do the impossible. His eye colour also changes, even though there's no point to it. (Use sharingan Kaito!)\\n\\n\\n\r\nArt: The art is shitty. It's what CARTOONS use. Calling an anime a cartoon is mean. BUT HELL YEA THIS SHOW DESERVES IT! STUPID CARTOON!\\n\\n\r\nSound: The opening was decent, and there's nothing terrible about the character voices.\\n\\n\r\nCharacter: Typical shounen characters. A sarcastic, \"knows everything and wins all the time\" main character. A tsundere female who's just there to piss me off. A guy who thinks of the main character as a rival and always tries to be better than him. And another girl who.. wait my bad, a Guy who dresses, talks, acts, like a girl. Guess his name... Anna. What the hell is wrong with the producers? Isn't this for children? Are they encouraging children to do Cross-dressing? My bad it's just Japan.\\n\\n\r\nEnjoyment: I don't like unfinished business so I'll be watching this till the end. But it sucks big hairy Great Golden Ape's uknowut.\\n\\n\r\nOverall: A poor attempt of making an \"Intelligent, mysterious\" show.",
            "date": "2012-03-15T15:31:00+00:00",
            "helpful_count": 10,
            "mal_id": 56045,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/deadeaddead",
                "username": "deadeaddead"
            },
            "url": "https://myanimelist.net/reviews.php?id=56045"
        },
        {
            "content": "I like this show (and its second season) a lot.  Pretty much one of the very few 2011-2012 anime shows that I really am looking forward to watching almost every single week.  \r\nOut of the many shows that Sunrise have made, I think Phi Brain is somewhere at the top, because it's not about Gundams and physical fighting. There's also a certain air of unpredictability when it comes to this series. \r\nYou have to keep in mind, Phi Brain was made for NHK Educational channel, which is an offshoot of NHK. It's intended to encourage/motivate Japan's youth to challenge themselves.  On theofficial Phi Brain website, for every new episode that airs, they post the accompanying puzzle that showed up in the episode. What's pretty amusing is that the anime stars characters, who are not exactly good candidates for being on an educational channel. \\n\\n\r\nThe show's setting, itself, cannot exactly be taken seriously as it takes place in a reality where puzzles are essentially EVERYTHING. In that world, being super good at a puzzle essentially makes you a celebrity or a target of a some kind of organization. However, if you've played a lot of Professor Layton games, you will get use to this kind of setting in no time. That's what makes that kind of reality unique, in a sense. Not every day will you come across a show that focuses on puzzles, and not about who's being number 1 master/champion of the world.  \\n\\n\r\nStory ~\\n\\n\r\nI was expecting a lot of filler throughout most of the show along with the POG people challenging each of the main characters, which would be atypical of a shounen show set up.  HOWEVER, it never ended up the way I was expecting as there are plenty of random things that do go on in the show.  In the end, the story is no longer just about puzzles and how wrong it is to make them dangerous. It's about friendship, childhood trauma, emotions, and the true meaning of trust. That's what I admire about it. \\n\\n\r\nPuzzle-wise, I enjoyed several of them. The show started off with ones you would sort of expect, but then, some of them do become ridiculous hard to your brain.  They don't always explain how the puzzles work, but I don't mind that at all. You can always try it yourself online.  (And this clearly improves with the second season.)      \\n\\n\r\nThe first OP was awesome. May'n's Brain Driver was a pretty solid and fitting song towards the animation direction that the OP presented itself with. However, the 2nd OP for the second season, if you ever get there, it just blows May'n's away.  (Overall though, they're both good.)    ED wise, I like both first and second season's EDs. \\n\\n\r\nArt ~\\n\\n\r\nKind of what I expect of Sunrise animation. Nothing too spectacular, but it's good enough as it is. They did a lot of good research behind puzzle designs and did pretty well on conveying the character expressions. \\n\\n\r\nSound ~\\n\\n\r\nI think it speaks for itself. Sunrise does their sound and music like any other anime companies.  I already put my input as to what I said about the OPs and EDs so no further comment is necessary for those.\\n\\n\r\nCharacter ~\\n\\n\r\nOut of the zillion anime character archetypes to use, Phi Brain puts together a: semi-grouchy puzzle prodigy, a photographic memory tomboy (-yandere-ish as some call her?), a baby face computer genius, a super convincing cross-dressing artist, a high strung tough crazy/sadistic(?) biker guy, and eventually, an apple juice loving student president. (And then, Kaito's childhood friend who is....*spoiler* so I won't be saying anything about him.) These guys are just lovable in their own ways. All their personalities are different as well as their antics. Even if some of them display, er.... \"fan-service\"-ish qualities, I pretty much disregard it because it's not bad compared to the shounen manga/anime that displays fanservice purely for guys. =__=;;  \\n\\n\r\nI initially wasn't sure what to expect from these characters , but the people behind the show, were able to play with these personalities in order to make the show engaging.  Sometimes, they used the characters to poke fun at their own selves so I like that. ^_^  So much for some cliches....\\n\\n\r\nWe're also able to get into a backstory with some of them, even though, Kaito's past is the main focus. I think season 2 will continue with flexing out some of the other characters' pasts, from the looks of it, even if it's still Kaito past-focused.  The side characters, for this show, are never forgotten in any way. They each get a role to shine in, whether it's a backstory or not.  \\n\\n\r\nSide note: A lot of people wonder what's wrong with the main character, Kaito, and why he treats all these other characters, supposedly his friends, the way he does. There is a reason for this and it's all part of his character development. People need to be patient about him, because his original personality was really.......*spoiler spoiler*\\n\\n\r\nEnjoyment ~ \\n\\n\r\nIf you've reached this far in my review, you can clearly tell that I have enjoyed this show immensely right into the second season. Things got pretty good by the end of the first season, and the second season just leaves the main characters without too much break/mercy.  \\n\\n\r\nOverall ~\\n\\n\r\nIf you can understand that this show....\\n\\n\r\n+ Shouldn't be taken too seriously, while it still has its serious parts (that reminds me of Poke'mon Black/White, the game, just a little bit). \\n\r\n+ Don't expect the puzzles to be fully explained out or solved slowly, at least in season 1. \\n\r\n+ Don't mind a cross-dresser, who is soooo convincing that even after you know the truth, it's still hard to believe.\\n\r\n+ Don't mind the antagonist to be a bit \"creepy\" with Kaito and probably some other people. \\n\r\n+ Isn't all black vs. white. There are a lot of gray areas with the characters. \\n\r\n+ Kaito's own actions are influenced by \"something\". \\n\\n\r\nThen, this is a show that's worth a shot. It's not exactly the level of \"Fantastic Children\", but, it's one of the better shows for me, at least, as oppose to a show full of harlems, stupid fanservice, pointless comedies,pointless fighting, undeveloped characters, and magic girls.  \\n",
            "date": "2012-05-21T12:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 61659,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bokuranokiseki",
                "username": "Bokuranokiseki"
            },
            "url": "https://myanimelist.net/reviews.php?id=61659"
        },
        {
            "content": "When I first heard about this anime, not gonna lie, I thought it was full retard.  Then I watched it, and was really impressed for these reasons:\r\nPacing - The pacing is perfect, they just throw you in the deep end unquestioning, not giving you time to dwell on some of the more ludicrous aspects.  These aspects must exist though to support the story; with the plot so fast at first, they become easily accepted.\r\nSetting - Always enjoy a good school setting with alot of interesting characters that support it.  \r\nStory -  It's about puzzles.  I'm not that into puzzles personally,but it intrigues me with how it's presented.  A break from grunts and powerups is welcome every now and again.  Plus it has already shown flashes of depth that may or may not pan out eventually, but for now it doesn't take itself too seriously.\\n\\n\r\nVibe -  Gives a good vibe, I really look forward to this release every week, even over other popular animes.\\n\\n\r\nit's a show about puzzles, a guy who's good at puzzles, strong friends that surround him to help him solve puzzles.  I won't go into the armband of woo or the code geass eye thing that lets him use his full brain power or the cliche'd personaility of the main character because to really enjoy this you have to go into it with low expectations, there is no hype for this because the high reviews and praise come from people who enjoyed this show for what it is, fun puzzle madness.  enjoy",
            "date": "2011-11-05T21:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 46917,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=46917"
        },
        {
            "content": "Before I start, I would like to say that this is my first review, woo-hoo. Phi Brain is currently at it's 23rd episode, awaiting the 24th, so I thought, why not review? There are only two more episodes anyways.\r\nPhi Brain is probably one of the oddest kind of 'mainstream' shounen I have seen thus far. I have a feeling that not too many people like it, and I can under stand why, but it's actually quite interesting.\r\nStory: 7\r\nPhi Brain has a very interesting concept. The problem lies with how the it was shown. See, solving puzzles and all, all that is extremely interest. I likepuzzles, you like puzzles. Puzzles are great. They're fun. But in Phi Brain, we're dealing with large-scale puzzles that can get you killed. It starts off when Kaito gets the Orpheus armband, and he starts solving puzzles like a bamf. But the thing is, we never how the characters are solving them and what is going through their minds when they are. I mean, they show us how the puzzles work. (They only started showing us that in the later episodes) But they don't show how the Solvers solve 'em. \\n\\n\r\nArt: 5\\n\\n\r\nI didn't really like the art. It was just not in my taste, and it was plain... weird, I guess? Not to say that the art was terribly bad. There are a few random moments where the art would be good. Not to mention that the animation wasn't that great in itself. It felt a little to choppy and 2-D. Also, the weird lines on the young people's faces. More so, on their cheeks. Now at first I thought, oh it's like Hetalia, where they're all blushing! BUT NO IT'S NOT. First of all, these so called 'blushes' aren't even a colour similar to blood. They're like black or brown, and somehow I find it hard to believe that that's how you look when you blush. They actually kinda look like whiskers. That whole idea kinda threw me off, but whatever. It's okay.\\n\\n\r\nSound: 6\\n\\n\r\nI didn't really like the theme song at all, and the OST wasn't something so impressive. The theme song made Kaito look all awesome and cool and much more than he really is... I suppose. I mean not to say he isn't cool. But wait. I'm deviating. Anyway, the OP threw me off, because it was more of a title song than anything, talking about puzzles and all. I guess I don't really like title songs much. (Let's make Pokemon an exception :3) However, the reason I am giving this part a 6 is because of the ending theme since it was really nice and pretty to listen to. \\n\\n\r\nAnd the seiyuu selection was pretty cool too. I mean Asanuma Shintarou? Fukuyama Jun? Pretty awesome if you ask me. Especially Jun's voice acting of Gammon. It just goes to show his vocal variety.\\n\\n\r\nCharacter: 7\\n\\n\r\nThere are many interesting characters in Phi Brain. However, like the first three main characters are so typical. First we have our protagonist, Daimon Kaito. And then our clueless female sidekick with a useful ability (in her case, her memory), Nonoha. And then a rival who becomes their friend, Gammon. And a group of people to fight against, the POG.\\n\\n\r\nNow when Kaito gets suddenly encouraged or something like that, he'd grin and say. \"Guess what time it is? It's puzzle time!!\"\\n\\n\r\nPUZZLE TIME. You know puzzle time. Good ol' puzzle time. Let's sit in a circle and solve a jigsaw puzzle. Because you know, it's puzzle time.\\n\\n\r\nKaito also goes on to show that the puzzles have emotions. No, don't blame the puzzle. It's never the puzzle's fault. It's the people who make the puzzle. Never blame the puzzle. Can't you see? This puzzle wants to be solved! It wants to be happy! Set free! \\n\\n\r\nNow, there are a possibility of three reactions for this:\\n\r\n1) LOLWUT\\n\r\n2) Woah, it's scary how much he's obsessed.\\n\r\n3) Hmm, interesting.\\n\\n\r\nNow I had the first reaction, which is what kept me watching until now. Kaito is seriously obsessed with puzzles. There's not a single puzzle he won't solve, or can't solve.\\n\\n\r\nNow Nonoha, is our typical female sidekick that helps Kaito in his time of need. The kind of girl who is extremely worried about him, but won't exactly do anything. Well, something like that. I guess she tries to do something for him, but epically fails? That kinda thing, I guess.\\n\\n\r\nAnd then there's Rook. Oh gosh, Rook. There is such a deep meaning in his name. I don't want to spoil too much, but he's the kind of guy with a roneriness-complex, and Kaito was his light, so he's all yan-yan over him. And it's not even yandere. It's just yan, because there's nothing deredere about him. So he can go batshit-crazy over the fact that Kaito has friends other than him. \\n\\n\r\nEnjoyment: 8\\n\\n\r\nTo be honest, it was actually pretty enjoyable, since I was really interested at first. The good thing about Phi Brain is that it usually leaves off at a really cliff hanger-y place. So that makes it more fast-paced and enjoyable to watch, because you want to know what happened next.\\n\\n\r\nOverall: 7\\n\\n\r\nIf you're the kind of person that likes mainstream shounen (which isn't a bad thing, because a lot of people including me like it, so it wouldn't make sense if I bashed it) then this is for you. However, if you don't like not understanding about what the protagonist is thinking about and you don't like 2-D art, then this is not for you. Furthermore, if you don't like puzzles in general, then this is also not for you.",
            "date": "2012-03-15T10:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 56033,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=56033"
        },
        {
            "content": "This show would basically be your generic shounen, if not for a couple of....interesting....things\r\nstory:  pretty much revolves around kaito, everybody is either out to murder him or out to get puzzle time with him. no seriously, puzzle time with kaito will be MINE! there is a background story about evil plots, a divine puzzle and other stuff, but the main focal point is definitely puzzle time with kaito.\r\nart: average, probably not 2011 worthy, but honestly i'm not to obssesed with this as long as they don't give it.....american tier \"art\"\r\nsound: opening was really good, the sounds during the show weren't spectacular, but they didn'tannoy me either.\\n\\n\r\ncharacters: only a couple of main characters had much depth to them, i've already seen season 2 which helped build to alot of characters depth, i will say that the first season probably did not nearly as much though. Ana is best character, just saying\\n\\n\r\nenjoyment: to be honest i reallly did enjoy it for the most part. in fact, i laughed alot because of how....ridiculously overdone it was, with you know....that and that. you'll probably either laugh alot or get pissed off alot. if your the type who gets pissed off i'd probably abandon, because its super over the top all the time every time.\\n\\n\r\noverall, i'd give it like an 8. because its puzzle time\\n\\n",
            "date": "2016-03-16T07:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 213052,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695065.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nekotan7",
                "username": "nekotan7"
            },
            "url": "https://myanimelist.net/reviews.php?id=213052"
        },
        {
            "content": "Daimon Kaito is genius, who loves to solve puzzles. Sounds interesting, but...well read on.\r\nStory\r\nPhi Brain is supposedly a story about a kid who likes or rather has a unique talent to solve puzzles. Unfortunately, most of the story focus on other things rather than solving puzzles. Very rarely are we given a glimpse on how the puzzle is solved, heck we are not even given enough time to think about it! For a guy like me who likes puzzles, it was big let down. Where the heck is the thinking, explaining, etc? Heck I saw more puzzle solving in the new HunterXHunter series than inthis one! Big disappointment. Instead of puzzles what do we get? Well you get your typical \"high school\" action/drama/comedy anime that try to get you to \"appreciate\" puzzles, but does a miserable job at it. They go so far as to even talk about some nonsense about love for puzzles or crap like that. Yippie. Fortunately, it improves story wise after the first 13 episodes or so, and keeps us interested, but that ending was plain terrible! It seemed rather predictable and just wasn't genuine. It seemed too happy go luck after the darker episodes that we were shown. I give a 5.\\n\\n\r\nArt\\n\r\nI'm not sure who did the artwork in this show, but it's terrible. I mean bad. I probably wouldn't be bad if it were ohhh let's say 1995, but heck even then some animes had better quality than this one. The panning still shots with vocabulary , cheap graphics, oh God the humanity!!! Let's just say that the animation is less than adequate or mediocre...another 3!\\n\\n\r\nSound\\n\r\nIt's not particularly great, but it's not terrible either. Brain Diver (the OP) is ok, but nothing great. Voice acting and sound effects do not really stand out. I give it a 5. \\n\\n\r\nCharacter\\n\r\nPretty mediocre. The characters are your typical characters, Daimon is a clone of your typical sarcastic know it all \"leader.\" Nonoha is your typical tsundere type with a more happy mood. I can go on, but really none of these characters stand out. I'd say the worse has to be Anna who is guy (yes a guy) who looks like a girl,...wait haven't I seen this before? Come on man!!! I give the characters a 5.\\n\\n\r\nEnjoyment/Overall\\n\r\nAfter watching it completely, it did improve story wise, but that ending just killed it. It was terrible. The start was bad, then it improved considerably and I enjoyed the tests that Rook would put Kaito through, but after all that it turns out too happy imho. Now I hear there's going to be a 2nd season? For what? Either way this season wasn't great, neither was it very very bad. Just pretty mediocre imho. I give it a 6.5.",
            "date": "2011-12-12T19:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 49063,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=49063"
        },
        {
            "content": "I was deeply in love with this series ever since the first episode...\r\nStory 10/10: \r\n        The way it was thought out was in a magnificent glory of fragrance. Episode after episode had me hooked until the very end, when they solved all those complicated puzzles it kind of made me feel dumb because I knew that I couldn't solve it. Even if it didn't give us a chance to solve them I really don't mind because I watch anime for the overall enjoyment.\r\nArt 10/10:\r\n      I really loved how they made Ana Gram lookso much like a girl! Gammon was pretty funny looking but I didn't mind one bit! I always thought Nonoha was a very beautiful girl even if her hair wasn't down. Cubic looked like a little kid, I always just wanted to jump into the screen and pinch his cheeks x3. Finally, Kaito Daimon, he looks like one of those guys that would be in a gang (well sort of) the thing that I really loved about him is how when the armlet activates one of his eye's turns red! x3\\n\\n\r\nSound 10/10:\\n\r\n       I very much enjoyed the opening song, it was a good choice and it almost matched the story line. The ending wasn't half bad either... anyway all of the voice actors did an outstanding job trying to match the character's personality, everything was just impressive.\\n\\n\r\nCharacter 10/10:\\n\r\n       Kaito was a pretty cool guy in the beginning and to the end, he was smart, he looked cool, and he was a kind guy too! Nonoha reminded me of Sakura from Naruto because of the strength they both had, I also enjoyed Nonoha from how caring she was. Gammon was my second favorite character (My first is Rook) because of how he hides the fact that he actually cares about people, but yet people can't see that. Ana Gram was a good person I especially liked him because he's a Hideyoshi x3, (I was so fooled by the girl voice and looks ). I very much liked Cubic because of him being so short and him being such a genius, also he seemed to be bad but was actually  a nice person deep down. \\n\\n\r\nEnjoyment 10/10:\\n\r\n       I absolutely loved every last detail about it and how it was designed, it all flowed in a harmonic web of destiny. \\n\\n\r\nOverall 10/10:\\n\r\n      Best Anime i've seen about puzzles that is...\\n\\n\r\nIf I recommend it:\\n\r\n      Watch it I'm sure you'll enjoy it like I did.",
            "date": "2013-12-29T04:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 126147,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439501.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cyrenia",
                "username": "Cyrenia"
            },
            "url": "https://myanimelist.net/reviews.php?id=126147"
        },
        {
            "content": "Story:\r\nIt opens with some idiot leading the way and stop Hammertime. From the ceiling giant hammers. From there I had to watch. So it turns out that like many other animes it takes place in a school and in a ruins behind the school where a hidden power probably rests. The story itself like the name revolves around puzzles and solving them, for the first episode the action is pretty tame, but it still manages to catch my interest. (probably just me) The way things look it seems to be similar to a tower of druaga setting where main clears levels or something but itis too early to say.\\n\\n\r\nArt:\\n\r\nAs expected of the modern age the art is pretty good and the character designs are somewhat interesting yet as always the main just stands out.\\n\\n\r\nSound:\\n\r\nThe opening sounds great, and the voice acting appears to be good.\\n\\n\r\nCharacters:\\n\r\nSome of the characters are pretty cookiecutter childhood friend who tsukkomis the main's obsession with puzzles violently. The main is Kaito, a super genius whose goal is to solve puzzles just for the sake of solving them,plus some sort of past promise. You have thee student council president and chairman in kahootz and finally an idiot celebrity.\\n\\n\r\nEnjoyment:\\n\r\nCause I like puzzles and I can pause the video and solve them at my pace. It was interesting pace which had a decent closed story within itself\\n\\n\r\nOverall it may depend on who likes it this will be updated by the sixth and final episode probably.",
            "date": "2011-10-05T21:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 44927,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447572.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dim100",
                "username": "dim100"
            },
            "url": "https://myanimelist.net/reviews.php?id=44927"
        },
        {
            "content": "If you're new to anime, you may like Phi Brain?\r\nIf you are able to pride yourself on your patience, you may like Phi Brain?\r\nPerhaps you are just an eternal optimist - you have the ability to see the best in any situation?\r\nI see myself as quite an optimist...\r\nSomeone who doesn't like feeling dissapointed and thus, only ventures into the interesting, holding has high hopes and wanting to enjoy -  Phi Brain is a test! \r\nCharacters...\r\nThe typical 'popular' types that are slotted anime's on a regular basis.\r\nWriters knowing that the audience will see familiarities this character shares with a number 'highly popular' characters from otheranime that have massive fanbases; the 'clone' is instantely accept. \\n\r\nThough often, ittle effort has been made to take a 'type' and make it stand out from the thousand of others of that 'type', this lack of individuality easily equals 'generic'.\\n\r\nHere are a few examples:\\n\r\n- a passive male main, the hero central to the plot; he's of school age (a schoolboy infact) who is hailed a 'genious' - this is his ability, though he doesn't partical stand out; he isn't popular or awkward, he's just a modest medium who fits in, displaying little personality as he's he's 'all-work-no-play'\\n\r\n- his tsundere, stroppy, tomboyish childhood friend female sidekick who assaulted him for reason upon her debut; doesn't seem to have any reason to be around and doesn't seem to hang around with anyone else, her only reason for being present appears to be; love interest and occasional damzel in destress\\n\r\n- the token smug starter rival\\n\r\n- the unhinged, eccentric 'bad boy'\\n\\n\r\nStory...\\n\r\nThe story has every potential to be decent, it's simply about a boy who's a genious and can solve complex puzzels, puzzels in many sences of the word; the series has went from getting out of booby traped ruins, to solving a conspiracy - this story could cover a lot of grounds, yet unfortunately, like many series's out their, the story takes a back seat; in order to providen 'funny' entertainment, the priority order of material is; character type>tried-tested-and-approved scenario>current plot.\\n\\n\r\nArt...\\n\r\nThe best aspect of the series - the characters are very pretty, the scenery is well detailed, the colour pallet is very bright yet mellow and the characters in motion look very fluid.\\n\\n\r\nEnjoyment...\\n\r\nNone too enjoyable for a veteran like myself; even lowering my expectations didn't work - it makes one think 'If I want a mystery, I'll watch '...' instead' and 'I'll turn to '...' to view 'that' character type played out in a decent manner'. \\n\r\nUnless this series does a dramatic 180 some time very soon, 25 ep's is honestly too long.\\n\\n\r\nOverall...\\n\r\nMediocre - though many generic anime's do 'generic' better then this.",
            "date": "2011-10-27T03:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 46291,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=46291"
        },
        {
            "content": "I have to admit that the first couple episodes I was pretty bored but then by like the fifth episode it got pretty interesting. Kaito Daimon is the main character of this anime. He is a genius solver of puzzles. There are two people involved in puzzles. The people who solve them (solvers) and the people who create them (givers). Kaito has to challenge many puzzles that put his own life or the life of someone dear to him in danger. If you don't think that's a thrilling part of the anime then you're completely wrong. In this sense it makes Kaito actually seem likea real hero because he saves their lives by solving the puzzle. If you think this anime you actually can solve the puzzle with Kaito then you'll be sadly disappointed. These puzzles that he encounter cannot be solved by the viewer by themselves. That is something that actually did disappoint me.\\n\\n\r\nHowever despite that what really truly brings the show are the characters. You learn to love Kaito. It is because he has this backstory that makes you just want to hug him. He lost his parents due to a puzzle they couldn't solve. Nonoha is a very important character in the anime as well. You'll learn that she is someone truly dear to Kaito. Nonoha is a childhood friend of Kaito who can't solve puzzles but she has an amazing photographic memory. What I love about this season is that the main antagonist is actually Kaito childhood best friend. Also the other characters, Jikukawa, Cubik. Ana Gram and Gammon are technically Kaito's crew. Each character plays a very important part for Kaito in this season.\\n\\n\r\nWhat I love about this show is that there is more than one season. This season the first season really helps establish the world that the characters live in and the other seasons really build off of it. This show was entertaining because of its original storyline and its dynamic characters. You don't need to love puzzles to love this show and I think that something I love about this anime. So give it a chance  at least because you'll find yourself liking it too.",
            "date": "2014-10-29T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 166671,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4213381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/cjoycoolio",
                "username": "cjoycoolio"
            },
            "url": "https://myanimelist.net/reviews.php?id=166671"
        },
        {
            "content": "10 Okabe-sans out of 10. One of the most epic anime to ever exist. Every episode was an ephemeral and viscerally compelling experience in action, drama, music, and graphics. Every puzzle was meticulously crafted from what seemed to be generations of research, experience, and dedication. No puzzle was like the other and each one worked in myriad ways to bring the plot dead front and center to stun the viewer into being completely shocked at its scale and depth. Yes, this anime was that deep and it even went deeper as the episode count went on and the stunningly designed main characters went through hardtrials of friendship, trust and betrayal as they worked to save the world from the clutches of evil and bring the moon and the sun together at last. The music greatly complemented this with rifts and synths that were characters of a ritzy jazz club to being as emotionally moving and perplexing as a Beethovian symphony. Verily, this anime was unlike any other and was, ultimately, the anime of the last year and 2012. I can bet 10 Apple Juices out of  10, that like Jikugawa, this anime will be unable to resist being something you need to indulge.",
            "date": "2012-04-05T13:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 57979,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/317035.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/27CansOfTuna",
                "username": "27CansOfTuna"
            },
            "url": "https://myanimelist.net/reviews.php?id=57979"
        },
        {
            "content": "I have this policy that I should not write reviews for anime which I have not completely seen, atleast for those which finished airing. This is an anime which made me really happy I stuck to my policy, because my rating dropped from my initial thinking of 7 after first two episodes to 5 later on.\r\nComing to the actual review. The core concept is a good one as is to divine revelation which can make man God. Now how the story develops around it is the anime. Obviously from the title you can guess its in the form of puzzles. People have to slove puzzlesto get closer to this divine power.\\n\\n\r\nIf the plot of the series is revealed in the first few episodes, its interest should be carried in some form till the ending with a good ending. This anime completely fails at it. Not only does it fail to deliver anything interesting, it fails to do even a medicore job and has one of the most crappiest endings ever seen.\\n\\n\r\nThe antagonist is in some form of love with our hero, and keeps chanting his name watching him on a big screen which makes you sure he is gay and that is how the theme is carried.\\n\\n\r\nWhen the hero activates his sort of magical power, do you remember the old atari/nintendo 2D game console 8 bit music, such crappy music plays. Honestly its a failure in every aspect, character, character development, art, sound.\\n\\n\r\nStory: 6\\n\r\nCharacter: 5\\n\r\nCharacter Development: 3\\n\r\nArt: 5\\n\r\nSound: 5\\n\r\nOverall: 5",
            "date": "2012-07-22T15:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 67359,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/282120.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jkalyana",
                "username": "jkalyana"
            },
            "url": "https://myanimelist.net/reviews.php?id=67359"
        },
        {
            "content": "Phi Brain: Kami no Puzzle is a very quirky anime. There's a lot of seriousness, but also a lot of comedy. There's a good balance between the two.\r\nStory:\r\nThe thing that makes Phi Brain strange however, is that the seriousness is about something you'd never really think of in that way; puzzles. There's constant talk of \"setting puzzles free\". Sounds ridiculous, but the show takes it very seriously, and I actually find that I go along with it. Despite the strange sound of such a statement, the seriousness of it is not ruined. The story is actually quite good, despite the strangeness, and I feel quitecompelled by it.\\n\\n\r\nArt:\\n\r\nThe art is fairly nice. I don't think it's anything majorly amazing, however.\\n\\n\r\nSound:\\n\r\nSame as the art. The music fits the atmosphere, however, it's not spectacular. You tend not to notice it; it just blends into the atmosphere.\\n\\n\r\nCharacter:\\n\r\nThe characters in this show are actually quite interesting. Kaito, our main character, is a very ambitious guy. I think as far as diversity goes, Cubic and Anna are quite interesting. I won't spoil the surprise about Anna, but Cubic is quite determined as well, and although he seems to be a cute kid, he does some strange things for the sake of his experiments. Rook is a very enigmatic character, and as a \"villain\", I think he fits the role well, despite his strangely styled hair (can't really decide if it's cool or just weird; it varies per shot.)\\n\\n\r\nEnjoyment:\\n\r\nThe only thing about this show that deters from me liking it more is the fact that they never show you the legwork through the puzzles. The characters just always take wiki walks and arrive at the conclusion with no evidence that they even solved it. Also, despite the cool idea, I feel like Kaito's Armband of Orpheus is a little bit of a cheat. He never really has to solve the puzzles normally, because it activates the rest of his brain so he can use 100% of it to solve the puzzle. Good idea, but a little bit cheap when it comes to the progression of the story.\\n\\n\r\nOverall:\\n\r\nI think this show is actually really good. The seriousness regarding puzzles makes it a little weird, but I find that I really like it. If you like chess type situations between the \"good guys\" and the \"bad guys\", you'll certainly enjoy this show. Overall, definitely worth a watch even if it only sound mildly interesting to you. At first I was unsure of it, but when I started watching, it was better than I expected.",
            "date": "2012-01-10T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 51481,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356067.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ComposerLOST",
                "username": "ComposerLOST"
            },
            "url": "https://myanimelist.net/reviews.php?id=51481"
        },
        {
            "content": "I don't usually write reviews for much of anything.  However, at the moment I feel as if rambling is the best and only way to iterate the immense disappointment that I feel after watching Phi Brain: Kami no Puzzle.\r\nI should start by stating that I loved the premise of this anime, and I was also impressed by the fact that it dared to be artistically different.  Having said those things, I was really excited about Kami no Puzzle, and, although the pilot episode made it clear to me that it was a Shounen anime, I actually liked what I saw in the beginning.\r\nIsuppose that my fancy little clincher and hastily written summation of the anime's pros lead up to this statement:  Somewhere along the line, the ball was dropped, and it hit the ground with a thunderous smack.  Suddenly, the relaxing pace became a race to tie up the story.  The rush, in my opinion, only made it more obvious that some earlier episodes could have been swapped out with episodes that better contributed to plot progression.  To add fuel to my fire, the story's primary and secondary conflicts were poorly addressed, if they were ever really addressed at all.\\n\\n\r\nI suppose that if you really like Shounen, then Kami no Puzzle's formula won't bother you as much as it did me.  Besides, even with all of the humbug obstructing my view, I could see that it had potential and possibly still has that potential.  It's all just a matter of execution.  \\n",
            "date": "2012-05-19T21:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 61563,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102021.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/CCLocs",
                "username": "CCLocs"
            },
            "url": "https://myanimelist.net/reviews.php?id=61563"
        },
        {
            "content": "Story/Plot:\r\nThe entire plot from my stand point was impressive, and well thought out. It has the usual action Anime theme's such and betrayal between old friends being one of the main one. I labeled the story as a ten because there is a plot to this, as I personally do not watch Anime without a plot.\r\nI liked this because I connected with the main character with are usually genius children (not that I'm a genius because that's not how I connected) that like puzzles. Throughout the show its almost as if a game show, you have the characters struggling through life sized, life endangering puzzles.The protagonist, of course being the best at solving the puzzles and often ends up helping his friends. However drama happens that causes the protagonist to lose his abilities sometimes and well... Watch and find out.\\n\\n\r\nArt:\\n\\n\r\nThe art was great and I'm not just saying that. I didn't see any mistakes anywhere but, I'm no professional. However they are great when compared to say, soul eater. However I took a point because I thought that some of the smaller details could have been better done.\\n\\n\r\nSound:\\n\\n\r\nThe sound was great and honestly some of the best for me. The opening song is what I fell in love with however, if you watch this there is a high chance you will walk around singing it as it is highly catchy ( for lack of a better word)\\n\\n\r\nCharacters:\\n\\n\r\nThe characters are all very different in their own way. I say \"In their own way\", because a good bunch of them are genius' and a bunch manipulative. However they got a ten because their personalities made it so that none of them are the same. The Characters do develop at a fast pass however, an example being a good guy becoming a bad guy in the span of about three episodes.\\n\\n\r\nEnjoyment:\\n\\n\r\nThe entire time I was watching this I was full of anticipation. I just couldn't stop. Watching the show go on I couldn't stop myself it I wanted to from feeling that I was there too. I was in the puzzle shouting clues and cheering on the solvers. I just can't wait for season two =D(even if the first hasnt ended yet)\\n\\n\r\nOverall:\\n\\n\r\nLike I was and it really says it all, I can't wait for season two.",
            "date": "2012-03-18T09:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 56257,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/firefull12",
                "username": "firefull12"
            },
            "url": "https://myanimelist.net/reviews.php?id=56257"
        }
    ]
]