[
    [
        {
            "content": "How long is it? 145 episodes. What’s it about? American Football. All of it? Yes. (And if you liked this series but found it either too long, or a bit childish, definitely check out Cross Game, a highly underrated sports series that is on a whole different maturity and story level.)\r\nEyeshield 21 is definite shonen sports anime. Heck, its even sponsored by the Japanese NFL and received backing in the United States as a football series on a sports channel. And now,…don’t get turned off. Because if you do, you’re missing out on one of the most entertaining series people disregard just because of itsnon-traditional anime content.\\n\\n\r\nReview:\\n\\n\r\nPlease, please, don’t dump this series just because its football. I cannot but regret that I did put off watching this and suffered my way through crap series like Blade of the Immortal. My 2 cents on why you should watch (if you don’t want to slog your way through the rest of this):\\n\r\n• Typical plot (yet this works perfectly fine for this series), interspersed with drama, comedy, and laugh your head off antics of its marvelous characters.\\n\r\n• Marvelous characters (I said it but I will say it again), You will love the characters of Eyeshield, because even Sena isn’t as annoying as it seems. And…Hiruma will send you to hell if you don’t watch this.\\n\r\nNow that you’re here:\\n\\n\r\nCharacters: To put it simply, there is nothing bland about Eyeshield’s cast. From Sena’s traditional shonen perserverance, to Hiruma’s demonic avarice (and he will become your favorite as well), Eyeshield 21 does a masterful job of designing to characters to both appeal to viewers and to transition their interactions with each other smoothly. The rivalry between Sena and Shin is also nonclichedly carried out, and all the supporting characters get their own backstory as well. To tell the truth, I don’t even think that the supporting characters were even ‘technically 2nd tier’. You cannot but feel for the other characters such as the quarterback of the Zokugaku Chameleons whose delinquent team cannot hold themselves together. And so yes, the characters of Eyeshield are not just comedic, but serious, dramatic, and all the time flawed in some way or another. There’s not fun in watching perfect characters now is there?\\n\\n\r\nPlot: Well, its straightforward enough: team has a dream, team wants to go to Christmas Bowl, team must defeat rival teams, team must work together, team must train, then team must win. But this is all you need to watch Eyeshield. It’s 145 episodes does more than enough to advance the adrenaline pumping scenes of the matches. Between moments of drama and football action is raucous comedy which borderlines on the absurd (cough Hiruma gun toting blackmailer), yet makes it more funny all the same. Now come to think of it, you don’t watch a sports series too much for the plot as more for the character development and anime action.\\n\\n\r\nSound and Graphics: Nothing too shabby here. The BGMs were great, the Ops and EDs were equally great. Eyeshield does a decent job of fitting its sound to its action scenes. The animation is more than adequate for the heart pumping football action scenes. Of course its NOT realistic. Who would want to watch realistic football for 145 episodes? Nah, this is where you see special moves like those in DBZ like Sena’s Devil Bat Ghost, Kid’s Rapid Fire Throw. (No fantastical equipment, mind but enough specialty to make you want to continue watching.) That said, animation is definitely decent for this series.\\n\\n\r\nEntertainment/Replay Value : This is something I wouldn’t mind watching more than once. The one bone I have to pick with the series is its sometimes slightly traditional fillers, which it has to have in its 145 episodes. But even with that, Eyeshield 21 is hilarious, action packed, and a touchdown for us viewers.\\n\\n\r\nPoptart’s Rating: 8/10",
            "date": "2009-02-18T09:29:00+00:00",
            "helpful_count": 234,
            "mal_id": 12530,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43946.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Poparteeb",
                "username": "Poparteeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=12530"
        },
        {
            "content": "Eyeshield 21 - Japan's take on American Football.  It's actually quite interesting.  \r\nOk, so for a review on this anime.  As far as sports-driven themed anime series, Eyeshield 21 does not disappoint its audience.  In a nutshell, Eyeshield 21 is the story of Kobayakawa Sena and his rise from a scared little kid to a full-fledged ace running back that looks down linebackers and defensemen 20x (no joke) his size.  \r\nThe story is pretty simple.  Our protagonist team (Deimon) wants to make it to the championship game (in Japan known as the Christmas Bowl) and needs to make itthis season because all of the seniors will be retiring the season after.  The anime does a good job on giving a lot of background information on each of the characters as well as the characters on the other teams Deimon faces.  And the good part is that they don't give it away all at once, but in bits and pieces which wets your appetite a little more each time, in a good way.\\n\\n\r\nCharacter development is key in this series, because essentially, that is what you are witnessing as you watch this anime.  The rise of Deimon, from a really bad team to one of the elite among Japan.  And with that rise to the elite, comes the development of each character - Sena, Monta, the &quot;Ha-ha&quot; brothers, and yes, even Hiruma.  It's really fascinating to watch all of these characters develop their skills and &quot;special abilities&quot; so to speak.\\n\\n\r\nAnd where would the fun go if we couldn't see these skills animated in their full glory.  Eyeshield 21 manages to do that quite well.  Sena's super speed is portrayed well (although it's kind of weird at times to see him run for what seems like 30 yards, but ends up with 4 or 5).  \\n\\n\r\nThere are enough twists and plot surprises in this anime as far as sports anime goes (I know, I'm keeping up with the manga) to leave you interested and wondering exactly how will Deimon get to the Christmas Bowl and how will they win....and *if* they win.  \\n\\n\r\nThe music could be better, but there are a few insert songs that are amazing (i.e. Be Survivor by ZZ) and a few other pieces of music in there.",
            "date": "2007-06-01T18:46:00+00:00",
            "helpful_count": 84,
            "mal_id": 340,
            "reviewer": {
                "episodes_seen": 80,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3959.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VK11",
                "username": "VK11"
            },
            "url": "https://myanimelist.net/reviews.php?id=340"
        },
        {
            "content": "Eyeshield 21 is indeed an outstanding anime. From the very beginning and maybe up to the very end of the anime, it will still be very outstanding. \r\nI might make a review about the characters of Eyeshield 21. From my own observation, each of the characters found in there have their own distinctive and outstanding personalities. I will also say my deepest thanks to Riichiro Inagaki and Yusuke Murata for creating the characters of Eyeshield 21.\r\nHere are some of the behaviors of the characters in Eyeshield 21 (I only mentioned 10 characters):\r\n1. Youichi Hiruma - In his appearance alone, you can really tell that heis a vampire/demon perhaps! Yet, all Eyeshield viewers definitely like this character (even me). Hiruma carries a lot of guns. I love his Devil's Handbook! He even was the one who created the team's chant: &quot;YA-HA!&quot;\\n\\n\r\n2. Nurse Oka - In the later episodes of the show, you can see a very scary nurse! This nurse is indeed ugly! Yet, she hates being called by that word. This nurse does not even rely to medical technologies to cure people but uses witchcraft and black magic. (When she talks, a scary background music covers).\\n\\n\r\n3. Sasuke Kanagushi - The team captain of Dokubari Scorpions. This guy can really predict your team's strategy. Although he has this kind of skill, I find it useless because Hiruma is more powerful than him. Later he became Hiruma's slave.\\n\\n\r\n4. Rui Habashira - The team captain of Zokugaku. He has a very weird long tongue.\\n\\n\r\n5. Ha-Ha Brothers - One of the linemen of Deimon, they like to say &quot;Huh&quot;. Preferably getting stronger and louder.\\n\\n\r\n6. Monta - The word MAX! is definitely from the vocabulary of Monta. He uses that everyday. Catch MAX, Effort MAX, and etc.\\n\\n\r\n7. Kurita - The fattest in Deimon, he looks really like a chestnut. But who cares, Kurita is a little cute. He likes to say Funnuraba to exert more strength when he pushes an enemy lineman or player.\\n\\n\r\n8. Tetsuma - Character from Seibu. When he is being commanded to do something, he'll definitely do it without stopping. He is good at routes.\\n\\n\r\n9. Agon Kongo - Character from Shinryuuji. He envisions himself that he is a football genius (actually for me, he is not). He treats everyone other than himself as worthless trash.\\n\\n\r\n10. Leonard Apollo - He is the coach of the Nasa Aliens. He alone is a racist! He doesn't want Panther-kun to play.\\n\\n\\n\r\nFor more of Eyeshield 21's whackiest and funniest characters, I advise that you watch the show from Episode 1 up to the very last.",
            "date": "2008-02-23T00:06:00+00:00",
            "helpful_count": 33,
            "mal_id": 2650,
            "reviewer": {
                "episodes_seen": 74,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38317.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kiddemon86",
                "username": "kiddemon86"
            },
            "url": "https://myanimelist.net/reviews.php?id=2650"
        },
        {
            "content": "**This review is spoiler free**\r\nAt first glance, there are a lot of reasons why one might not want to watch this show. It's about American Football (narrowing down its audience that might even know what is going on down to just the United States). As stated, Eyeshield 21 is a sports anime, another thing many potential viewers might not like. Lastly, it's shonen, meaning everyone and their brother has probably heard of it before. So why should you watch it? I'll tell you.\r\nStory- 6/10\r\nThis is easily the weakest point of Eyeshield 21. The story isn't anything that will blow your mind, it isn't anything thatwill capture you and it's constant struggle. It's just about going to the Christmas Bowl (basically a football championship game). That's all you are going to get. Some characters that like football wanting to play a game on the highest stage of their highschool careers. As I stated, this is the weakest point of Eyeshield, but it still fits the show. You wouldn't expect a Neon Genesis \"my mind is blown!!!\" moment, and you wouldn't expect a Death Note \"Wow!\" either. \\n\\n\r\nArt- 8/10\\n\\n\r\nI found myself rather impressed with the art of Eyeshield. It isn't necessarily that every character is incredibly detailed, but the details that were added are very impressive to just sit and look at. For instance, Hiruma (my personal favorite character of the show, but we will go over that later) is always described as a manipulative, devil like character. The author could have just stopped there, but instead of being lazy, do you know what they did? They made the football team called the, \"Deimon Devil Bats\" for one. But also, they made him LOOK like a devil. He has pointy ears, a huge devilish grin, incredibly spiky hair and the like. That being said, the art styles for all the characters fit them very well (Hiruma is just the most obvious where it fits). After noticing how Hiruma looked, I found myself analyzing other characters to see if I could find any particular art style that fit there character. The conclusion was, every character has some little thing that fits them, and it is done very well!\\n\\n\r\nSound- 6/10\\n\\n\r\nAnother weaker point of Eyeshield is the sound. It isn't bad by any means, but just be ready to hear the same things a lot. Some examples would be when Sena runs, sometimes you will hear a weird buzzing sound, like he is some sort of rocket at take off. Some of these sounds are great, like before a game when Hiruma yells his special battle chant. On the other hand, other noises you will get tired of VERY quickly. Monta, a star receiver on the Devil Bats, has a catch phrase where he yells \"MAX!!!\". This gets annoying quickly, because he uses it for almost every conceivable situation. Also, being that you should watch this subbed, whenever he yells said catchphrase, it is usually something like this:\\n\\n\r\nIntended: Catch Max!\\n\r\nFinal Product: CATCHEEDUH MAXXXOOOOOH!\\n\\n\r\nI understand that this is a different language, but I do thing a better catch phrase could have been made, to at least be less annoying. Those are my only gripes with the sound, as the voice acting is rather good. All the voices perfectly fit the character they are trying to portray.\\n\\n\r\nCharacter- 10/10\\n\\n\r\nThe strongest point of Eyeshield 21, the characters. Every character has something to like, something to hate, or something that will at least make you FEEL for that character. Whether it is a positive or negative feeling, it is much better to feel negative towards a character than to simply not care. You will most likely find one character that you can relate to in every situation. Also, before we go into this any more, Hiruma will end up being your favorite character. You will see why as the show progresses, but just know and be prepared. Anyway, every character has some sort of different trait that makes them different from any other character. Sena, for instance, has the Shonen persistence that every main character seems to have. That always present drive to get better, get stronger, get faster, what ever the situation. Kurita has more compassion than his weight in Valentine's Day chocolates. Mamori has the motherly caring and protective instincts (especially towards Sena). That is why every character in Eyeshield is so great. Every character, from the main character Sena to a supporting character like Taki, has something there. There are no wasted characters. While some shows like Bleach have a large cast but don't do anything with half of them, Eyeshield uses it's large cast perfectly. Just when you think they have forgotten about Taki, he catches a pass for a 13 yard gain. Just when you think the Devil Bats will never throw a pass in this game, they throw a touchdown. Nothing is left wasted, and anyone can put themselves in any other characters shoes.\\n\\n\r\nEnjoyment- 7/10\\n\\n\r\nThis show is very enjoyable over all. You will find yourself with boring parts though. Sometimes there is a 3 episode wait between games, and sometimes there is a 20 episode wait. The show is paced very well, but it does have the Shonen filler sometimes. There are also a lot of episodes where something is wrong with one character or group of characters, and the entire episode is spent trying to fix whatever happened.\\n\\n\r\nOverall- 7/10\\n\\n\r\nOverall there are no gaping flaws that make this show unwatchable. This is one of the only Shonen I'd recommend to anyone, just because there is something for everyone, whether you like football or not. I hope you decide to try this show out, and to hopefully finish it one day, because it really is worth your time.\\n\\n\r\nThank you for reading my thoughts, and hopefully you found this review helpful.",
            "date": "2015-09-04T07:19:00+00:00",
            "helpful_count": 31,
            "mal_id": 197794,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4680895.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pneumonic",
                "username": "Pneumonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=197794"
        },
        {
            "content": "At first glance, many thought that American football is all about muscle and killing intent. As a child, I watched NFL games and saw players hurt, injured, worst; crushed, suffer fractures and other accidents that led them to disability. As a sportsman(once a varsity basketball player), I hate games runned by power and skill alone.\r\nYa-HA!\r\nEnters Eyeshield 21 that features a with unorthodox players such as shorty, porky and a Demon. The plot is very simple, about an errand boy who became a superstar in a game played by monsters and his team, the Devil Bats journey to National Championships, the Christmas Bowl. It highlights therivalry of the main character, light speed runningback Kobayakawa Sena known as Eyeshield 21 and Linebacker Shin Seijurou who is considered as the perfect player. Like other shounen stories, the protagonist grows strong stronger as he faced stronger opponents until the final decesive battle against his rival.\\n\\n\r\nWhat everyone loved in this anime is its character development and as a sports themed anime, ES21 expressed the importance of teamwork better.\\n\\n\r\nES21 can be a manual itself and gradually showed the rules of the American football. This sports unlike any other team sports is a game of specialties and choosing a position is very vital to he outcome of the team. In the Devil bats case, the team is composed usually of inexperienced guys (and some are weaklings) relying only on their lifestyle, natural talents, hard work and rushed training. Here are their ligitimate line-up:\\n\\n\r\nQB-      H. Youichi - the devilish trickster and master of psychological warfares.\\n\r\nRB/TB- K. Sena- former errand boy with lightspeed legs\\n\r\nRB/FB- Ishimaru - helper from the track & field club\\n\r\nWR-     R. Tarou - dedicated follower of a Baseball catching superstar\\n\r\nWR-     Yukimitsu-  his life was spent on academics\\n\r\nC-        K. Ryoukan- a guy who knows nothing but power\\n\r\nG-        Y. Daikichi - a loyal apprentice of Kurita\\n\r\nG- Ha          -thugs\\n\r\nT- Ha          -same-\\n\r\nT- Brothers -same-\\n\\n\r\nConsidering these data, thechances of playing forthe national championship was estimated 0.1% but saccording to their Leader, Hiruma-sama, as long as its not completely zero, winning is still inevitable.\\n\\n\r\nCompared with other sports anime, I'd say Eyeshield 21 is the smartest of them all. This anime proves that winning isn't only a matter of skills, athleticism, work ethic and determination, it takes some deep tactics, calculations and brainstorming to outwit the opposing team and to stand on the battlefield.\\n\\n\r\nAfter watching this anime, surely you'll never doubt that David really toppled Goliath. Ya-ha!",
            "date": "2008-12-21T23:19:00+00:00",
            "helpful_count": 21,
            "mal_id": 10554,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30049.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/graysky14",
                "username": "graysky14"
            },
            "url": "https://myanimelist.net/reviews.php?id=10554"
        },
        {
            "content": "Eyeshield 21 is an essay in 145 episodes about... American Football! A game that I don't know, like or understand, portrayed in anime! A game that we always believed that was only played in America... In anime! Conclusion: Must Watch.\r\nThe story is as simple as \"sports anime\": a team and its players, represented by the Speed-Light Running Back Kobayakawa Sena as main character, must overcome stronger teams and players by evoluting physically and spiritually in way to get to the ultimate victory (participating in the Christmas Bowl). However, this team is not like your average! They are below the average! In the end, this isthe fight of an underdog team composed by untalented members that had to generate their talent through train and hard work. Very heart warming for people that, like me, don't have talent and have to do everything through hard work.\\n\\n\r\nAdding to this, the characters are pretty much... Brilliant. Each character design is a caricature from the corresponding personality. With this fashion, characters that had not much of a content, turned into people that you are willing to support and even identify with. You find all the stereotypes, but you also discover that they are real and have their reasons.\\n\\n\r\nThe animation is quite good, as well as the art overall, but this series suffers of a disease common to most long anime: repeated animation sequences and loss of detail quality through the series. Of course that if you watch an episode a week like you should and not 15 a day like I did, you will most likely never notice this. However, the slow paced games hook you up to the point of wanting to watch them as soon as possible. Even the filler episodes held enough fun.\\n\\n\r\nA great comedy, with its inspirational and touching moments, and above all a tribute to American Football.",
            "date": "2009-01-02T07:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 10957,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24745.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ladyxzeus",
                "username": "ladyxzeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=10957"
        },
        {
            "content": "This is the type of anime where the main character sena is pretty lame. He does a cool thing or two every 20 episodes or so and then cries about how he sucks the rest of the time. Personally I couldnt stand him as the main character because he never has his own confidence and is always beaten. When you are watching a long series such as this you need some type of motivation to keep you going every 10 or so episodes and they fail to give it in this show. Sena loses pretty much all the time. They work him up to thinkhes gonna succeed and bam its torn down with him failing. I personally cant stand watching that over and over again for 100 episodes. It gets annoying. The rest of the characters are great because they keep working hard no matter what and keep confidence unlike sena. The art is really good, Music is pretty good, story is good, but overall sena is the weakest link in this anime. I personally like main characters with a bit more guts and confidence once they see their own abilities. All this guy does is cry and whine the entire series and somehow comes through for his team because they pump him up just for that one time. He has no courage to do anything and is pretty lame. If you can stomach this for 140 episodes then fine but I personally cant handle someone so weak for a main character.",
            "date": "2008-02-18T14:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 2580,
            "reviewer": {
                "episodes_seen": 100,
                "image_url": "https://cdn.myanimelist.net/images/userimages/37655.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnholyEhre",
                "username": "UnholyEhre"
            },
            "url": "https://myanimelist.net/reviews.php?id=2580"
        },
        {
            "content": "Well, Eyeshield 21, I have to say, I held off on reading/watching the manga/anime, specially because it's a manga/anime about sports, and that doesn'g sound very exciting. But I decided to give it a try anyway, and find out wha the anime really was, and what it was, is awesome.\r\nPlot: Well, the story follows student Kobayakawa Sena, who just got accepted to Deimon High School, Sena is pretty much a whimpy kid who gets bullied around by others, while running away from some bullies, a Senior Student, Hiruma Youichi, the captain of the Football club notices that Sena is really fast, and wants him tojoin,  and after a rather strange series of events, he ends up joining the Football Team( or Amefuto, as they call it, yeah, idk).\\n\r\nSo basically, there's a team, team has a dream, going to the Christmal Bowl (Highschool Football Tournament in Japan), but they have to do it that year, since Hiruma and his fellow student Kurita Ryoukan are graduating that year, they must train, and beat the other rival teams, from which the most recurring ones are the Oujou White Knights and the Shinryuuji Naga.\\n\r\nIt's 145 episodes for the anime (and 333 for the manga) and even though it sounds long, it's very entertaining and worth the time, the matches between teams are great and really entertaining. Besides the football matches, there's also a lot of comedy in this series, most which is absurd, which makes it even better, although most of the time, it is delivered by Hiruma, which makes it even better!\\n\\n\r\nCharacters: To put it simply, there is no boring character in Eyeshield 21, not even Yukimitsu is boring. The authors of Eyeshield 21 did an outstanding job in making all of the characters, they are all equally entertaining and amazing, Sena's rivalry with Shin isn't anything cliche or whatever, instead it's done really well and you wanna see Sena beat Shin in a match. All the other characters also get their own stories, from Jumonji and Taki to Agon and Panther, they are all done so well, that it feels like there are no supporting characters, they all feel like main characters, and that also makes it very exciting, not even the matches focus on the main characters, all the supporting characters have their own rivals they have to beat, and it makes it even more exciting than it already is, sure, some characters are flawed in a way, they can't all be perfect, can they?\\n\\n\r\nSound/Animation: Well, the music was great, all 5 OPs are great, and it's Eyeshield 21 that has the BEST ending theme ever (Blaze Away). Some of the BGM was great too, like Be Survivor, and the animation, well, it's really good, the OPs are done great, and the scenes with special moves like Sena's Devil Bat Ghost or Shin's Trident Tackle, they are all done very well, and all I have to say, is that it looks great.\\n\\n\r\nTeams: Well, obviously there's the Deimon Devil Bats, but there's also the rival teams like the Oujou White Knights, the Kyoshin Poseidon, the Bando Spiders and the Hakushu Dinosaurs, each one of these teams have their own characters and special plays, and I liked all of them, all of the teams are equally amazing, and of course the matches are really entertaining, but I did feel kinda let down that the Teikoku Alexanders aren't in the anime, specially since the match between them and Deimon is definetly the best in the series.\\n\\n\r\nReplay Value: This anime is really worth watching again, I wouldn't mind it, really, it's a shame that most people pass on it because it's a Sports Anime, like I did, but I'm sure people would like it if they watch it, now, I've really come to love this series, but I have to say that it's better to read the manga because the anime just stops after the final rematch with Oujou, and it didn't show the matches agains Hakushu, Teikoku and the World Cup, which I would've loved to see, but anyway, it's a great anime and it's really underrated, so go watch it, or Hiruma will take you to hell, YA-HA!\\n\\n\r\nRating: Flawless",
            "date": "2010-05-10T12:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 25928,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Juusan13",
                "username": "Juusan13"
            },
            "url": "https://myanimelist.net/reviews.php?id=25928"
        },
        {
            "content": "I really, really, really, REALLY wanted this anime to be good. Hell, the manga got me through a whole football camp experience (which is a masterpiece by the way). But the show was clearly hit by the fault, I personally believe, that victimizes plenty of long shounens. Filler, why is there filler! (SPOILER ALERT) They reveal Sena, Eyesheild 21's, true identity in the 5th episode. True, no one believes it is him, but this never happened in the manga and for good reason. And compared to the manga, I found the art to be lacking in so many ways. Maybe I'm just biased because theanime was so mediocre it makes the manga look bad. And I don't want to bash the series either. I am a huge fan of the manga and whole-heartedly recommend that. However, the anime dosen't do much to impress and dissappoints me",
            "date": "2014-03-25T21:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 137015,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644667.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Maloa101",
                "username": "Maloa101"
            },
            "url": "https://myanimelist.net/reviews.php?id=137015"
        },
        {
            "content": "I really love the manga for Eyeshield 21, so I tried to watch the anime. It doesn't really do justice, in my opinion, to the manga at all. The animation is really shoddy, and I really don't like the style. I doesn't feel nearly as dramatic or fast-paced as the manga at all. I definitely recommend the manga, I couldn't force myself to watch more than three episodes of this show, which is really unfortunate because they had good voice actors for the characters, but the animation was just utter garbage and I can't handle bad animation for a manga series so beautifully drawn.",
            "date": "2013-03-01T14:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 88321,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071271.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kiokushitaka",
                "username": "kiokushitaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=88321"
        },
        {
            "content": "Eyeshield 21 is  the best Anime/Manga about sports, it is about a kid named Kobayakawa Sena who discovers the awesome world of American Football or Football as an american like myself would call it. To be honest,ES21 was my first sports anime and it is the one that hooked me to sports anime. it is really funny and whenever i have a bad day, i watch one ep of it and i cheer up. It combines both comedy and sports together to make the best sports Anime/Manga",
            "date": "2009-01-17T20:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 11635,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/130013.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/goldenozaru",
                "username": "goldenozaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=11635"
        },
        {
            "content": "This anime is by far one of the most entertaining anime's that i have ever seen. The anime itself is based on the sport of 'American Football', with this said, I was not initially drawn into watching this anime with knowing this alone. However after spending some time watching the first few episodes, i found myself stuck watching the entire series within a matter of days. This anime is by far one of the most entertaining and captivating animes i have seen, incorporating a large range of characters in the football team 'Daemon Devil Bats', from the quiet and underestimated main character, Sena who playsas the Running back in the team, Haruma the Captain of the team as well as having a some what shady and evil back ground and many many other characters. \\n\\n\r\nThe most captivating thing about this anime is i think the range of characters and their unique and comical personalities which make this sport anime extremely entertaining. Also, the anime's theme itself relvolving around a sport allows it to build up suspense and tension in many of the matches, making you feel like your actually watching a real game! Having to watch more and more until the end of the match!\\n\\n\r\nThe storyline is based on a 'Gopher' names Sena, who unknowingly gains the ability to run extremely fast. He is made to be an incredibly weak main character compared to the regular main heroes in other anime's, however this means throughout the anime we can see Sena grow stronger and more reliable therefore making it quite entertaining. Not only does the anime show the growth of the main character, but this also allows us to know the main character in more depth, as this is a long running anime. With the growth of the main character and many of the other characters in the team throughout many matches and training, you can't help but literally cheer on the Daemon Devil Bats!!\\n\\n\r\nOverall this anime, just hearing that this anime is a sport anime about football, don't let that put you off! This is an incredible anime, having everything an entertaining anime of this genre needs. I HIGHLY recommend anyone and everyone to watch this anime, even if you are not a big fan of anime of this genre.",
            "date": "2013-07-09T09:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 104581,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843695.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/blaqfire",
                "username": "blaqfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=104581"
        },
        {
            "content": "Eyeshield 21, so far, has been the only sports-related anime that I've actually been able to finish - yet, at the same time, it's the longest. In fact, it's the only anime with 100+ episodes that I've actually been able to complete.\r\nHow does a girl get through a 145-episode-long anime series about a sport she pretty much hates? Simple, she doesn't. At the time, I was a fan of stuff like Katekyo Hitman Reborn - and when I saw people point out similarities, I gave Eyeshield 21 a shot...a real one. With the first few episodes, I fell in love with the series - andeverything about it.\\n\\n\r\nSTORY: It's your typical underdog comes out on top type of thing. What makes it different? Nothing, really. However, it's the way that it's executed. They do it in a way that makes you actually want to sit there and watch the damn thing from start to finish. It's about American football, yet it's set in Japan. As far as I knew, the game wasn't even played there. I didn't even realize NFL Japan existed until I saw the show's end credits - but that's not the point. Normally, due to my attending a high school that was OBSESSED with football, I wouldn't have bothered - but, like I said, I ended up trying the series anyway. It converted me from a football-hater to a football-lover. The show has some fillers, and with 145 episodes, that should be expected. I would have rated it a 10, but I was upset that they didn't bother to include the Teikoku Alexanders. Deimon's goal was to win the Christmas Bowl, right? Then why the hell do they end with the semi-finals of the Kanto Tournament? At least go all the way to the first mentioned goal. The ending wasn't bad by any means, but if you've read the manga - it's a bit disappointing because they don't go all the way to the end.\\n\\n\r\nART: The art was done wonderfully. Yes, it could have been better - but for an anime about a sport that most people assume isn't played in Japan, it's very good. I don't know who the animators are, but they did a very good job with this series.\\n\\n\r\nSOUND: I loved all of the OPs and EDs, well except for the two songs used in the last match against Oujou - but the themes were very well done, for the most part. My personal favorite, lyric-wise, would be \"Blaze Away,\" and I have to admit that it's probably the best ED ever in terms of lyrics because you can hear the emotion behind them. In terms of actual sound and melody, I'd prefer \"A Day Dreaming...\" any day. However, all the themes were wonderfully performed - even if they wouldn't all fit everyone's taste, anyone who watches the series and actually listens to the theme music will be able to pick at least one that they like. The BGM was beautifully done too, although it's a shame you never hear the lyrics to \"Midnight Sunshine\" in the actual series because the vocalists (the seiyuus for Sakuraba, Shin, Takami, Otowara, and Wakana - I believe, although I'm not sure if Wakana was really featured) did an amazing job on it, but \"Be Survivor\" and the other songs featured throughout the series were quite entertaining as well.\\n\\n\r\nCHARACTER: Each character has their own distinct and unique personality. Sure, you've still got your stereotypes, but that's not all there is to them. Juumonji starts off as just another delinquent, but as he plays with the Devil Bats, he slowly grows as a man. In the beginning, he seems like he could just walk by a girl getting raped and not do anything - yet, in a later episode, he saves a girl from that fate. Sena's the weak boy who constantly gets forced into doing other people's errands; the thing that makes him efficient at this, preventing himself from being beat up, is his \"golden legs\" that enable him to run at the speed of light. He goes through the most growth in the series, and one can't give away much about his development without spoiling the whole series. Hiruma, on the other hand, had the most depth throughout the whole series - and, to be honest, you still haven't figured him out by the end of it. However, the series goes into enough detail about him that it's impossible to not love the character. Shin, Sakuraba, Takami, and Otowara are really the only Oujou players that get any true development but it would spoil things if we went into that in-depth. I will say this, though. Takami can be just as cunning as Hiruma, Sakuraba is more than just a pretty boy, Otowara isn't just the guy that everyone runs away from when he farts, and Shin's more than just the perfect player (you can't really write much about him without spoiling everything).\\n\\n\r\nTeams - Yes, they're getting their own section. The Deimon Devil Bats are the main team in this series, and the most developed one. You see their growth from the original two (Kurita and Hiruma) to almost full team. You can't help but sympathize with them most of the time, and the producers made it hard for fans to not side with them for each and every game. The second most-developed team is obviously the Oujou White Knights. It's clear, throughout the whole series, that the creators intend for most, if not all, of the viewers to fall in love with both Oujou and Deimon - possibly because they knew the anime series would end where it did and wanted to make it a bit more climactic. Kyoshin Poseidon were there mostly to raise the self-confidence of the \"Deimon Chibis\" since almost all of the starters were 2 meters tall. Shinryuji was there to show how a hard-working team like Deimon can beat even the 'strongest' team in Kanto by focusing all of their strength on winning. Bando was there mostly to show how Musashi was necessary for Deimon to actually guarantee any kind of winning game; they also helped Sena gain the confidence to tell everyone who's behind the Eyeshield 21 mask. The other teams mainly helped Sena to grow as a football player - even Seibu, although Seibu helped Monta too, in that regard.\\n\\n\r\nENJOYMENT: There wasn't much of anything that I didn't enjoy about this anime.\\n\\n\r\nOVERALL: 8/10 - It could have been better, but at the same time, there's not much they could improve on unless the mangaka or the animators were willing to actually go to America to see how practices, practice games, and official games actually go about. It's still pretty good as is even if they did do the research.",
            "date": "2012-01-25T15:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 52549,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1110983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HeyItsCami",
                "username": "HeyItsCami"
            },
            "url": "https://myanimelist.net/reviews.php?id=52549"
        },
        {
            "content": "I have played football for 5 years all throughout highschool. I did not know there was an anime about football untill June of 2009. I normally would stay away from sports anime's as they are boring and dense but I watched an Amv on eyeshield 21 and fell in love. \r\nEverything is real in the anime, well the tournaments and the attitudes the titles of best running back or linemen, and even the plays. Yes the plays in the show are exaggerated as green beams of light cant come from behind you as you run and all that stuff but in football we do thoseplays which makes it exciting to watch and its always a grudge match in eyeshield which alot of football is like!\\n\\n\r\nThe characters have their own personalities which rocks! They develop and get better through the whole series. Though every region like canada and america and japan all play football diffrently as the show explained. \\n\\n\r\nThe art was great and the voice acting was outstanding and it pumps you up to play football. Only complaint was when there was a moment happening in the game the people would talk to eachother wich doesnt happen in football or you would get crushed. None the less it was great to watch and best sports anime out there it recks King of tennis thats for sure! Watch it and enjoy it! YA-HA!!",
            "date": "2009-12-23T17:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 21656,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XlMcNuggetslX",
                "username": "XlMcNuggetslX"
            },
            "url": "https://myanimelist.net/reviews.php?id=21656"
        },
        {
            "content": "A sports anime... huh..\r\nOk, before I start the review I would like to comment on the nature of sports manga or anime.. I'm sure you all know that things in the sports anime are not gonna happen in a reality sense right? For example this anime.. This is about American Football and you will see a RunningBack that runs in a speed of a freaking light. In reality sense, where in the blue hell are you going to find that? See, the logic? But that is the spice of manga or anime in the sports genre can offer. It can defy the law of realityin order to make things exciting.. To be honest, I don't give a damn about American Football.. I think that it is a sport wherein I can't relate because it's too complex for me to understand its rules and nature.. But, thanks to this particular manga, my eyes were opened to the American Football business.. (Though I don' really play)\\n\\n\r\nOne thing that is cool on sports anime is that all the move set have their own names.. It is funny to think that even your simple fake has its own name.. Well, it's just my opinion but at times it is awesome.. It's cool but the back side of it is that, there are two many moves with names..\\n\\n\r\nDamn.. I really enjoy writing reviews..\\n\\n\r\nOk.. I'm going to give my opinions based on the elements in the rating..\\n\\n\r\nStory (9)\\n\r\nLike I said this is sports anime/manga.. Expect that reality is out of question in here.. That's the essence of sports anime/manga.. (Though I'm not referring to all of the series in the sports genre) This series also defies reality in big time scale.. You know, you need basic physics in order to understand why in the blue hell such scenarios happen.. (You don't need to take the physics thing seriously) Example, Sena's run..\\n\\n\r\nOn the struggle sense, I mean the struggle of the group to go to the top is great. You can see that they want the big thing.. They're hungry for supremacy.. They want to prove something. Even I can feel that fire sometimes whenever I watch an episode. I admit, it's inspiring. You can apply it in real life.. Don't give up.. Don't lose your fire.. Don't lose your passion..\\n\\n\r\nArt (9)\\n\r\nThe art was good. I'm the type of viewer that looks first at the drawing or art before reading them.. So, according to my tastes.. this series is great..\\n\\n\r\nSound (9)\\n\r\nAre you a fan of J-rock band BACK-ON? If you do, you will definitely get me.. The songs from that band are awesome!! The opening 4 and some endings, it's awesome.. I really like the rap and rock style of music of BACK-ON.. OK, that's all.. hehe\\n\\n\r\nCharacter (10)\\n\r\nGood job for the creator of this series for making characters of different styles.. First, the protagonist Sena.. He has a balance of awesomeness (when Eyeshield) and wimpiness (when normal mode).. I would also like to thank the creator of this series for creating Hiruma Yoichi wherein I can attribute my somewhat evil and never say die attitude.. As you can see, where in the blue hell are you going to see an athlete that carries legit firearms whether he is in school or in the football field? I also want to point out his catch phrase of saying \"We'll Kill them!! YAHA!\" That is so EPIC!! It is a good cheer.. It can be apply in real life... I apply it in real life!! It's freaking awesome!!! Well, I will no longer give ideas to the other characters.\\n\\n\r\nBottom line in here is that, they are a lot of characters and I'm sure there are one or two characters wherein you can relate your life to..\\n\\n\r\nEnjoyment (10)\\n\r\nI find the match build up interesting and enjoyable.. Each school has its own motif and has its own matchup logo and mascot.. Whenever there is a match there is this kind of build up title card that shows the name of the schools.. I was like watching a wrestling match title card.. (If you get my analogies)\\n\\n\r\nEven though I don't really played American Football my entire life, I can say that it is fun to follow this series, The plays are amazing.. You can see the awesomeness and drama for each match specially when the Deimon DEVIL Bats wins..\\n\\n\r\nOverall (9)\\n\r\nI want to play American FOOTBALL.. Joke..\\n\\n\r\nThis is a good series.. Good drama, awesome defying of reality, awesome complex characters, good match ups and the I really like the chant..\\n\\n\r\nI knew that the anime series is not completed. I wish that they have another series wherein they will finish the story up to the end. Well, the manga is finished, the material is there.. I honestly felt that you can feel the action more when things are animated.. I strongly wish that this must have a continuation..\\n\\n\\n\r\nThat's all.. Thanks for reading..\\n\\n\r\nLightningSnow :)",
            "date": "2012-10-03T08:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 73981,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571221.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lightningsnow",
                "username": "lightningsnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=73981"
        },
        {
            "content": "\"Eyeshield 21\" is traditional sports anime about a kid who learns to believe in himself and become a winner, but at the same time it is also a comedy with a bizarre twist - it's about a group of misfit Japanese high school kids forming a team to play \"American Football\" in their Japanese high school. So you not only have all of the usual \"Gambatte! Gambarimasu!\" (Do your best! I'll do my best!\") sort of stuff, but also an attempt to give a Japanese youth audience a crash course in American-style football. The result is a spectacularly funny comedy, both deliberately - due tothe wacky cast of misfits - and also unintentionally, because of the ongoing attempts to explain the rules and concepts of American football during the eyecatches and off-and-on during the story line. \\n\\n\r\nFirst year high school student Sena has always relied upon his older female friend Mamori to protect him. And when Mamori isn't around, Sena has learned to run away from trouble because he is smaller than most of the bullies that bother him. But now that Sena is in high school he no longer wants to be \"protected by a girl\" and allows himself to be talked into joining his high school's American Football team, which has few players, never wins, and is almost unknown in the high school. But Sena's \"running away\" has developed him into a phenomenon - he can out run most pursuers and thread his way through most obstacles, including football defensive teams. Because of that, the fanatical and demonic captain of the football team, Hiruma, decides to rebuild the team around Sena, with Sena disguised as the mysterious running back \"Eyeshield 21\".\\n\\n\r\nWhat results from this is a fast-paced, unpretentious story with surprisingly adept character development and smart, consistent comedy. Add to this reasonably good animation and a lively soundtrack and you have a nice bit of old-fashioned fun done in a thoroughly up-to-date manner. So forget about anything you ever knew about American High School Football, sit back, grab a bottle of \"sports water\", and enjoy the action.\\n",
            "date": "2009-05-22T18:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 15212,
            "reviewer": {
                "episodes_seen": 53,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111604.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dbaranyi",
                "username": "dbaranyi"
            },
            "url": "https://myanimelist.net/reviews.php?id=15212"
        },
        {
            "content": "It was very very average.\r\nMaybe it's just that I watch too much football.\r\nI dropped after first 3 episodes and finished manga instead.\r\nPositive: how many mangas talk about the gridiron\r\nnot a whole lot.\r\nNovel sport, pretty detailed descriptions, fairly involved storyline.\r\nNegative: exaggerated features, even for a sports manga\r\nHated some details,\r\nI dont like how the author glorifies notre dame. Yeah, ND was good\r\nwhen they were all wearing pigskin helmets and all caucasian.\r\nLast ND champ was in 80's. If they want to talk about real college football,\r\ntalk about SEC football: Florida, LSU, Bama, etc. \r\nAlso, players do not immediately sign into NFL. Most players play in college for mandatory3 years before goin to pros.\\n\r\nThird, I've yet to hear of any real football players with 4.1 speed. That is absolutely and utterly impossible because most players have a pretty big muscle bulk too.\\n\\n\r\nYeah, I ranted, because I care",
            "date": "2010-04-14T21:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 25085,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/136638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zhang1222",
                "username": "Zhang1222"
            },
            "url": "https://myanimelist.net/reviews.php?id=25085"
        },
        {
            "content": "The anime is truly fantastic but it has the drawback that I felt made Hajime no Ippo just as frustrating... No matter how strong and powerful the main character gets they still act like a damn coward!!! They could be in a match 60 episodes into the series with TONS of training and TONS of determination and then once the match starts they CRUMBLE like all they have worked hard for is forgotten and they SHRINK in their shells wishing for some shit to happen! It truly hurts these anime in my opinion. Of course the saving grace is the end where they \"recall amemory\" or they \"see the struggle of others around them trying their hardest\" and they eventually crawl out of their shell and help the team win. HOWEVER after seeing this same approach to every single damn match, as the viewer, you become upset when the main character said he would try his best the day before but when it comes to the start of the game they revert back to their cowardice ways. After 60 episodes Sena needs to grow a pair of balls and run with the idea that he can't let his team down as their Ace!!! I don't mind him being timid and afraid as Sena but when that Eyeshield comes on he needs to become a man and lead his team to victory!",
            "date": "2015-03-17T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 182551,
            "reviewer": {
                "episodes_seen": 69,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3730055.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/beachman4",
                "username": "beachman4"
            },
            "url": "https://myanimelist.net/reviews.php?id=182551"
        },
        {
            "content": "I'm writing this review just because I feel that need to voice my opinion out there about this certain anime. This is the first series that I've written a review for. Keep in mind that I've read the manga before watching the anime and will be judging this anime in two ways: as a adaption of a manga and an anime standing alone. \r\nStory - 9: Well, the story is pretty much straight forward and doesn't require much explaining. It's about playing football. Well, it's more like a story of a small team  getting bigger and grows stronger through the course of the anime.Maybe that's one of the reason that I love the manga so much. I could be over simplified this to much, so please correct me if you need to.\\n\\n\r\nArt - 6: First, I'm comparing the art/graphics to other series. And it doesn't really stand out much with the bland graphics. Second, look at the manga and back at the anime, you can obviously see that the anime doesn't hold a nail to the manga. Yusuke Murata's art style is unique and impact-full. The character design was also done by this great mangaka. I'd almost scream with disbelief when I first saw the anime (an exaggeration, but I did blabber for 20 mins after and my brother had to threw a pillow at me to shut me up). \\n\\n\r\nSound - 7: The openings and the endings are enjoyable in my opinion. The sound tracks are well done and did a good job setting up the mood for the anime. It took me about 2-3 episodes to get used to the voice acting. It's not that the voice acting is bad or anything, it's just that spent way too much time envisioning the voices in my head while reading the manga. One of the reasons why I was quite disappointed when I heard Hiruma's voice for the first time. I would say that they could've done better with the voices.\\n\\n\r\nCharacters - 8.5: Since I've read and re-read the manga for about 6 times I really don't have anything to complain about the character designs. All of them have their own unique traits that are just perfect. Very memorable characters. And yes, I still remember Ishimaru, probably one of the best trick that was done with characters. (I won't say what is it, you'll just have to watch the anime or read the manga. The joke continued very nicely through out the series.) But I do have to complain about how the studio that made this anime ruined some of the character traits and making them very hard to enjoy. I do understand that they have to follow a certain amount time in one episode of the anime and sometime the manga is too short or to fast that they have to add a few extra scenes. I don't mind the filler scenes, but rewritting a character is unacceptable for me. They made Sena looks like a wimp for the first half of episode 13. While in the manga, he did not show ANY of the traits that they gave him in the anime. No wimping, crying or anything. By doing so, they have reduced the enjoying of the anime for many viewers, complaining that Sena is too annoying. \\n\\n\r\nEnjoyment: Standing on its own, it would have been around 8 or 8.5. With the filler scenes. As a adaption of the manga, I could only give this anime a 6. I feel that this anime could have done better with its action scenes.\\n\\n\r\nOverall - 8: Needless to say, this is still a good anime. Might be a little too long, but a good series that needs a little bit appreciation. And if you want more, check out the manga, you won't regret it. \\n\\n\r\n(I locked myself in my room for three days to finish the manga because it was so good that I literally can't stop reading it.)",
            "date": "2016-08-23T14:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 227444,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4390111.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/YuzukiSanae",
                "username": "YuzukiSanae"
            },
            "url": "https://myanimelist.net/reviews.php?id=227444"
        },
        {
            "content": "I would give 10 for all the components.\r\nMany people have been saying that eyeshield 21 is better in manga than anime and that the anime seriously sucks. That is not TRUE AT ALL. Just because it the anime art isn't on par with the manga , just because the animators did not do such a good job in bringing the most epic scenes / badass scenes for eyeshield does not mean the anime sucks.\r\nFirstly , the animation may not be good but it gives life to those characters. It is cute in a way like its so refreshing to watch. We also get to seesome very good characters getting animated like Youichi Hiruma and Habashira Rui.(There probably are some others) but i only like these 2 characters cause they are pretty similar to each other XD. Pretty much why i keep on watching :D\\n\\n\r\nSecondly , the voice actors bring up on to another whole new level for eyeshield 21. There are some scenes that really hits us on point. Like for the part when they lose, and their cries really hit on point. For E.G. Chameleon team , Habashira Rui confrontation. The manga did make me tear up but the anime make the sadness in another whole new level. Hiruma voice also did quite well. Well , there are certainly some down points for some not well-done voice actors but i don't think it affects much in this 145 episodes tv-series. I can overlook the cringe part , that's just how good the anime is.\\n\\n\r\nLastly , I do love both the manga and the anime. I like the manga more than the anime but the anime is just good as well. There are only somethings that can be found in the anime like the animation of the team bonding. It has many episodes where they train as a team and so on blah blah. Those animation makes me like : uhhh ~~ so sweet~~. \\n\\n\r\nNEVERTHELESS , I recommend watching the anime as well as the manga (re-read from 1st chapter) For 2-WAY TRAIN TICKETS to feel trips X)",
            "date": "2017-03-21T01:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 243072,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5519061.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ILoveOreImo",
                "username": "ILoveOreImo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243072"
        }
    ],
    [
        {
            "content": "How long is it? 145 episodes. What’s it about? American Football. All of it? Yes. (And if you liked this series but found it either too long, or a bit childish, definitely check out Cross Game, a highly underrated sports series that is on a whole different maturity and story level.)\r\nEyeshield 21 is definite shonen sports anime. Heck, its even sponsored by the Japanese NFL and received backing in the United States as a football series on a sports channel. And now,…don’t get turned off. Because if you do, you’re missing out on one of the most entertaining series people disregard just because of itsnon-traditional anime content.\\n\\n\r\nReview:\\n\\n\r\nPlease, please, don’t dump this series just because its football. I cannot but regret that I did put off watching this and suffered my way through crap series like Blade of the Immortal. My 2 cents on why you should watch (if you don’t want to slog your way through the rest of this):\\n\r\n• Typical plot (yet this works perfectly fine for this series), interspersed with drama, comedy, and laugh your head off antics of its marvelous characters.\\n\r\n• Marvelous characters (I said it but I will say it again), You will love the characters of Eyeshield, because even Sena isn’t as annoying as it seems. And…Hiruma will send you to hell if you don’t watch this.\\n\r\nNow that you’re here:\\n\\n\r\nCharacters: To put it simply, there is nothing bland about Eyeshield’s cast. From Sena’s traditional shonen perserverance, to Hiruma’s demonic avarice (and he will become your favorite as well), Eyeshield 21 does a masterful job of designing to characters to both appeal to viewers and to transition their interactions with each other smoothly. The rivalry between Sena and Shin is also nonclichedly carried out, and all the supporting characters get their own backstory as well. To tell the truth, I don’t even think that the supporting characters were even ‘technically 2nd tier’. You cannot but feel for the other characters such as the quarterback of the Zokugaku Chameleons whose delinquent team cannot hold themselves together. And so yes, the characters of Eyeshield are not just comedic, but serious, dramatic, and all the time flawed in some way or another. There’s not fun in watching perfect characters now is there?\\n\\n\r\nPlot: Well, its straightforward enough: team has a dream, team wants to go to Christmas Bowl, team must defeat rival teams, team must work together, team must train, then team must win. But this is all you need to watch Eyeshield. It’s 145 episodes does more than enough to advance the adrenaline pumping scenes of the matches. Between moments of drama and football action is raucous comedy which borderlines on the absurd (cough Hiruma gun toting blackmailer), yet makes it more funny all the same. Now come to think of it, you don’t watch a sports series too much for the plot as more for the character development and anime action.\\n\\n\r\nSound and Graphics: Nothing too shabby here. The BGMs were great, the Ops and EDs were equally great. Eyeshield does a decent job of fitting its sound to its action scenes. The animation is more than adequate for the heart pumping football action scenes. Of course its NOT realistic. Who would want to watch realistic football for 145 episodes? Nah, this is where you see special moves like those in DBZ like Sena’s Devil Bat Ghost, Kid’s Rapid Fire Throw. (No fantastical equipment, mind but enough specialty to make you want to continue watching.) That said, animation is definitely decent for this series.\\n\\n\r\nEntertainment/Replay Value : This is something I wouldn’t mind watching more than once. The one bone I have to pick with the series is its sometimes slightly traditional fillers, which it has to have in its 145 episodes. But even with that, Eyeshield 21 is hilarious, action packed, and a touchdown for us viewers.\\n\\n\r\nPoptart’s Rating: 8/10",
            "date": "2009-02-18T09:29:00+00:00",
            "helpful_count": 234,
            "mal_id": 12530,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43946.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Poparteeb",
                "username": "Poparteeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=12530"
        },
        {
            "content": "Eyeshield 21 - Japan's take on American Football.  It's actually quite interesting.  \r\nOk, so for a review on this anime.  As far as sports-driven themed anime series, Eyeshield 21 does not disappoint its audience.  In a nutshell, Eyeshield 21 is the story of Kobayakawa Sena and his rise from a scared little kid to a full-fledged ace running back that looks down linebackers and defensemen 20x (no joke) his size.  \r\nThe story is pretty simple.  Our protagonist team (Deimon) wants to make it to the championship game (in Japan known as the Christmas Bowl) and needs to make itthis season because all of the seniors will be retiring the season after.  The anime does a good job on giving a lot of background information on each of the characters as well as the characters on the other teams Deimon faces.  And the good part is that they don't give it away all at once, but in bits and pieces which wets your appetite a little more each time, in a good way.\\n\\n\r\nCharacter development is key in this series, because essentially, that is what you are witnessing as you watch this anime.  The rise of Deimon, from a really bad team to one of the elite among Japan.  And with that rise to the elite, comes the development of each character - Sena, Monta, the &quot;Ha-ha&quot; brothers, and yes, even Hiruma.  It's really fascinating to watch all of these characters develop their skills and &quot;special abilities&quot; so to speak.\\n\\n\r\nAnd where would the fun go if we couldn't see these skills animated in their full glory.  Eyeshield 21 manages to do that quite well.  Sena's super speed is portrayed well (although it's kind of weird at times to see him run for what seems like 30 yards, but ends up with 4 or 5).  \\n\\n\r\nThere are enough twists and plot surprises in this anime as far as sports anime goes (I know, I'm keeping up with the manga) to leave you interested and wondering exactly how will Deimon get to the Christmas Bowl and how will they win....and *if* they win.  \\n\\n\r\nThe music could be better, but there are a few insert songs that are amazing (i.e. Be Survivor by ZZ) and a few other pieces of music in there.",
            "date": "2007-06-01T18:46:00+00:00",
            "helpful_count": 84,
            "mal_id": 340,
            "reviewer": {
                "episodes_seen": 80,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3959.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VK11",
                "username": "VK11"
            },
            "url": "https://myanimelist.net/reviews.php?id=340"
        },
        {
            "content": "Eyeshield 21 is indeed an outstanding anime. From the very beginning and maybe up to the very end of the anime, it will still be very outstanding. \r\nI might make a review about the characters of Eyeshield 21. From my own observation, each of the characters found in there have their own distinctive and outstanding personalities. I will also say my deepest thanks to Riichiro Inagaki and Yusuke Murata for creating the characters of Eyeshield 21.\r\nHere are some of the behaviors of the characters in Eyeshield 21 (I only mentioned 10 characters):\r\n1. Youichi Hiruma - In his appearance alone, you can really tell that heis a vampire/demon perhaps! Yet, all Eyeshield viewers definitely like this character (even me). Hiruma carries a lot of guns. I love his Devil's Handbook! He even was the one who created the team's chant: &quot;YA-HA!&quot;\\n\\n\r\n2. Nurse Oka - In the later episodes of the show, you can see a very scary nurse! This nurse is indeed ugly! Yet, she hates being called by that word. This nurse does not even rely to medical technologies to cure people but uses witchcraft and black magic. (When she talks, a scary background music covers).\\n\\n\r\n3. Sasuke Kanagushi - The team captain of Dokubari Scorpions. This guy can really predict your team's strategy. Although he has this kind of skill, I find it useless because Hiruma is more powerful than him. Later he became Hiruma's slave.\\n\\n\r\n4. Rui Habashira - The team captain of Zokugaku. He has a very weird long tongue.\\n\\n\r\n5. Ha-Ha Brothers - One of the linemen of Deimon, they like to say &quot;Huh&quot;. Preferably getting stronger and louder.\\n\\n\r\n6. Monta - The word MAX! is definitely from the vocabulary of Monta. He uses that everyday. Catch MAX, Effort MAX, and etc.\\n\\n\r\n7. Kurita - The fattest in Deimon, he looks really like a chestnut. But who cares, Kurita is a little cute. He likes to say Funnuraba to exert more strength when he pushes an enemy lineman or player.\\n\\n\r\n8. Tetsuma - Character from Seibu. When he is being commanded to do something, he'll definitely do it without stopping. He is good at routes.\\n\\n\r\n9. Agon Kongo - Character from Shinryuuji. He envisions himself that he is a football genius (actually for me, he is not). He treats everyone other than himself as worthless trash.\\n\\n\r\n10. Leonard Apollo - He is the coach of the Nasa Aliens. He alone is a racist! He doesn't want Panther-kun to play.\\n\\n\\n\r\nFor more of Eyeshield 21's whackiest and funniest characters, I advise that you watch the show from Episode 1 up to the very last.",
            "date": "2008-02-23T00:06:00+00:00",
            "helpful_count": 33,
            "mal_id": 2650,
            "reviewer": {
                "episodes_seen": 74,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38317.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kiddemon86",
                "username": "kiddemon86"
            },
            "url": "https://myanimelist.net/reviews.php?id=2650"
        },
        {
            "content": "**This review is spoiler free**\r\nAt first glance, there are a lot of reasons why one might not want to watch this show. It's about American Football (narrowing down its audience that might even know what is going on down to just the United States). As stated, Eyeshield 21 is a sports anime, another thing many potential viewers might not like. Lastly, it's shonen, meaning everyone and their brother has probably heard of it before. So why should you watch it? I'll tell you.\r\nStory- 6/10\r\nThis is easily the weakest point of Eyeshield 21. The story isn't anything that will blow your mind, it isn't anything thatwill capture you and it's constant struggle. It's just about going to the Christmas Bowl (basically a football championship game). That's all you are going to get. Some characters that like football wanting to play a game on the highest stage of their highschool careers. As I stated, this is the weakest point of Eyeshield, but it still fits the show. You wouldn't expect a Neon Genesis \"my mind is blown!!!\" moment, and you wouldn't expect a Death Note \"Wow!\" either. \\n\\n\r\nArt- 8/10\\n\\n\r\nI found myself rather impressed with the art of Eyeshield. It isn't necessarily that every character is incredibly detailed, but the details that were added are very impressive to just sit and look at. For instance, Hiruma (my personal favorite character of the show, but we will go over that later) is always described as a manipulative, devil like character. The author could have just stopped there, but instead of being lazy, do you know what they did? They made the football team called the, \"Deimon Devil Bats\" for one. But also, they made him LOOK like a devil. He has pointy ears, a huge devilish grin, incredibly spiky hair and the like. That being said, the art styles for all the characters fit them very well (Hiruma is just the most obvious where it fits). After noticing how Hiruma looked, I found myself analyzing other characters to see if I could find any particular art style that fit there character. The conclusion was, every character has some little thing that fits them, and it is done very well!\\n\\n\r\nSound- 6/10\\n\\n\r\nAnother weaker point of Eyeshield is the sound. It isn't bad by any means, but just be ready to hear the same things a lot. Some examples would be when Sena runs, sometimes you will hear a weird buzzing sound, like he is some sort of rocket at take off. Some of these sounds are great, like before a game when Hiruma yells his special battle chant. On the other hand, other noises you will get tired of VERY quickly. Monta, a star receiver on the Devil Bats, has a catch phrase where he yells \"MAX!!!\". This gets annoying quickly, because he uses it for almost every conceivable situation. Also, being that you should watch this subbed, whenever he yells said catchphrase, it is usually something like this:\\n\\n\r\nIntended: Catch Max!\\n\r\nFinal Product: CATCHEEDUH MAXXXOOOOOH!\\n\\n\r\nI understand that this is a different language, but I do thing a better catch phrase could have been made, to at least be less annoying. Those are my only gripes with the sound, as the voice acting is rather good. All the voices perfectly fit the character they are trying to portray.\\n\\n\r\nCharacter- 10/10\\n\\n\r\nThe strongest point of Eyeshield 21, the characters. Every character has something to like, something to hate, or something that will at least make you FEEL for that character. Whether it is a positive or negative feeling, it is much better to feel negative towards a character than to simply not care. You will most likely find one character that you can relate to in every situation. Also, before we go into this any more, Hiruma will end up being your favorite character. You will see why as the show progresses, but just know and be prepared. Anyway, every character has some sort of different trait that makes them different from any other character. Sena, for instance, has the Shonen persistence that every main character seems to have. That always present drive to get better, get stronger, get faster, what ever the situation. Kurita has more compassion than his weight in Valentine's Day chocolates. Mamori has the motherly caring and protective instincts (especially towards Sena). That is why every character in Eyeshield is so great. Every character, from the main character Sena to a supporting character like Taki, has something there. There are no wasted characters. While some shows like Bleach have a large cast but don't do anything with half of them, Eyeshield uses it's large cast perfectly. Just when you think they have forgotten about Taki, he catches a pass for a 13 yard gain. Just when you think the Devil Bats will never throw a pass in this game, they throw a touchdown. Nothing is left wasted, and anyone can put themselves in any other characters shoes.\\n\\n\r\nEnjoyment- 7/10\\n\\n\r\nThis show is very enjoyable over all. You will find yourself with boring parts though. Sometimes there is a 3 episode wait between games, and sometimes there is a 20 episode wait. The show is paced very well, but it does have the Shonen filler sometimes. There are also a lot of episodes where something is wrong with one character or group of characters, and the entire episode is spent trying to fix whatever happened.\\n\\n\r\nOverall- 7/10\\n\\n\r\nOverall there are no gaping flaws that make this show unwatchable. This is one of the only Shonen I'd recommend to anyone, just because there is something for everyone, whether you like football or not. I hope you decide to try this show out, and to hopefully finish it one day, because it really is worth your time.\\n\\n\r\nThank you for reading my thoughts, and hopefully you found this review helpful.",
            "date": "2015-09-04T07:19:00+00:00",
            "helpful_count": 31,
            "mal_id": 197794,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4680895.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pneumonic",
                "username": "Pneumonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=197794"
        },
        {
            "content": "At first glance, many thought that American football is all about muscle and killing intent. As a child, I watched NFL games and saw players hurt, injured, worst; crushed, suffer fractures and other accidents that led them to disability. As a sportsman(once a varsity basketball player), I hate games runned by power and skill alone.\r\nYa-HA!\r\nEnters Eyeshield 21 that features a with unorthodox players such as shorty, porky and a Demon. The plot is very simple, about an errand boy who became a superstar in a game played by monsters and his team, the Devil Bats journey to National Championships, the Christmas Bowl. It highlights therivalry of the main character, light speed runningback Kobayakawa Sena known as Eyeshield 21 and Linebacker Shin Seijurou who is considered as the perfect player. Like other shounen stories, the protagonist grows strong stronger as he faced stronger opponents until the final decesive battle against his rival.\\n\\n\r\nWhat everyone loved in this anime is its character development and as a sports themed anime, ES21 expressed the importance of teamwork better.\\n\\n\r\nES21 can be a manual itself and gradually showed the rules of the American football. This sports unlike any other team sports is a game of specialties and choosing a position is very vital to he outcome of the team. In the Devil bats case, the team is composed usually of inexperienced guys (and some are weaklings) relying only on their lifestyle, natural talents, hard work and rushed training. Here are their ligitimate line-up:\\n\\n\r\nQB-      H. Youichi - the devilish trickster and master of psychological warfares.\\n\r\nRB/TB- K. Sena- former errand boy with lightspeed legs\\n\r\nRB/FB- Ishimaru - helper from the track & field club\\n\r\nWR-     R. Tarou - dedicated follower of a Baseball catching superstar\\n\r\nWR-     Yukimitsu-  his life was spent on academics\\n\r\nC-        K. Ryoukan- a guy who knows nothing but power\\n\r\nG-        Y. Daikichi - a loyal apprentice of Kurita\\n\r\nG- Ha          -thugs\\n\r\nT- Ha          -same-\\n\r\nT- Brothers -same-\\n\\n\r\nConsidering these data, thechances of playing forthe national championship was estimated 0.1% but saccording to their Leader, Hiruma-sama, as long as its not completely zero, winning is still inevitable.\\n\\n\r\nCompared with other sports anime, I'd say Eyeshield 21 is the smartest of them all. This anime proves that winning isn't only a matter of skills, athleticism, work ethic and determination, it takes some deep tactics, calculations and brainstorming to outwit the opposing team and to stand on the battlefield.\\n\\n\r\nAfter watching this anime, surely you'll never doubt that David really toppled Goliath. Ya-ha!",
            "date": "2008-12-21T23:19:00+00:00",
            "helpful_count": 21,
            "mal_id": 10554,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30049.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/graysky14",
                "username": "graysky14"
            },
            "url": "https://myanimelist.net/reviews.php?id=10554"
        },
        {
            "content": "Eyeshield 21 is an essay in 145 episodes about... American Football! A game that I don't know, like or understand, portrayed in anime! A game that we always believed that was only played in America... In anime! Conclusion: Must Watch.\r\nThe story is as simple as \"sports anime\": a team and its players, represented by the Speed-Light Running Back Kobayakawa Sena as main character, must overcome stronger teams and players by evoluting physically and spiritually in way to get to the ultimate victory (participating in the Christmas Bowl). However, this team is not like your average! They are below the average! In the end, this isthe fight of an underdog team composed by untalented members that had to generate their talent through train and hard work. Very heart warming for people that, like me, don't have talent and have to do everything through hard work.\\n\\n\r\nAdding to this, the characters are pretty much... Brilliant. Each character design is a caricature from the corresponding personality. With this fashion, characters that had not much of a content, turned into people that you are willing to support and even identify with. You find all the stereotypes, but you also discover that they are real and have their reasons.\\n\\n\r\nThe animation is quite good, as well as the art overall, but this series suffers of a disease common to most long anime: repeated animation sequences and loss of detail quality through the series. Of course that if you watch an episode a week like you should and not 15 a day like I did, you will most likely never notice this. However, the slow paced games hook you up to the point of wanting to watch them as soon as possible. Even the filler episodes held enough fun.\\n\\n\r\nA great comedy, with its inspirational and touching moments, and above all a tribute to American Football.",
            "date": "2009-01-02T07:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 10957,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24745.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ladyxzeus",
                "username": "ladyxzeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=10957"
        },
        {
            "content": "This is the type of anime where the main character sena is pretty lame. He does a cool thing or two every 20 episodes or so and then cries about how he sucks the rest of the time. Personally I couldnt stand him as the main character because he never has his own confidence and is always beaten. When you are watching a long series such as this you need some type of motivation to keep you going every 10 or so episodes and they fail to give it in this show. Sena loses pretty much all the time. They work him up to thinkhes gonna succeed and bam its torn down with him failing. I personally cant stand watching that over and over again for 100 episodes. It gets annoying. The rest of the characters are great because they keep working hard no matter what and keep confidence unlike sena. The art is really good, Music is pretty good, story is good, but overall sena is the weakest link in this anime. I personally like main characters with a bit more guts and confidence once they see their own abilities. All this guy does is cry and whine the entire series and somehow comes through for his team because they pump him up just for that one time. He has no courage to do anything and is pretty lame. If you can stomach this for 140 episodes then fine but I personally cant handle someone so weak for a main character.",
            "date": "2008-02-18T14:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 2580,
            "reviewer": {
                "episodes_seen": 100,
                "image_url": "https://cdn.myanimelist.net/images/userimages/37655.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnholyEhre",
                "username": "UnholyEhre"
            },
            "url": "https://myanimelist.net/reviews.php?id=2580"
        },
        {
            "content": "Well, Eyeshield 21, I have to say, I held off on reading/watching the manga/anime, specially because it's a manga/anime about sports, and that doesn'g sound very exciting. But I decided to give it a try anyway, and find out wha the anime really was, and what it was, is awesome.\r\nPlot: Well, the story follows student Kobayakawa Sena, who just got accepted to Deimon High School, Sena is pretty much a whimpy kid who gets bullied around by others, while running away from some bullies, a Senior Student, Hiruma Youichi, the captain of the Football club notices that Sena is really fast, and wants him tojoin,  and after a rather strange series of events, he ends up joining the Football Team( or Amefuto, as they call it, yeah, idk).\\n\r\nSo basically, there's a team, team has a dream, going to the Christmal Bowl (Highschool Football Tournament in Japan), but they have to do it that year, since Hiruma and his fellow student Kurita Ryoukan are graduating that year, they must train, and beat the other rival teams, from which the most recurring ones are the Oujou White Knights and the Shinryuuji Naga.\\n\r\nIt's 145 episodes for the anime (and 333 for the manga) and even though it sounds long, it's very entertaining and worth the time, the matches between teams are great and really entertaining. Besides the football matches, there's also a lot of comedy in this series, most which is absurd, which makes it even better, although most of the time, it is delivered by Hiruma, which makes it even better!\\n\\n\r\nCharacters: To put it simply, there is no boring character in Eyeshield 21, not even Yukimitsu is boring. The authors of Eyeshield 21 did an outstanding job in making all of the characters, they are all equally entertaining and amazing, Sena's rivalry with Shin isn't anything cliche or whatever, instead it's done really well and you wanna see Sena beat Shin in a match. All the other characters also get their own stories, from Jumonji and Taki to Agon and Panther, they are all done so well, that it feels like there are no supporting characters, they all feel like main characters, and that also makes it very exciting, not even the matches focus on the main characters, all the supporting characters have their own rivals they have to beat, and it makes it even more exciting than it already is, sure, some characters are flawed in a way, they can't all be perfect, can they?\\n\\n\r\nSound/Animation: Well, the music was great, all 5 OPs are great, and it's Eyeshield 21 that has the BEST ending theme ever (Blaze Away). Some of the BGM was great too, like Be Survivor, and the animation, well, it's really good, the OPs are done great, and the scenes with special moves like Sena's Devil Bat Ghost or Shin's Trident Tackle, they are all done very well, and all I have to say, is that it looks great.\\n\\n\r\nTeams: Well, obviously there's the Deimon Devil Bats, but there's also the rival teams like the Oujou White Knights, the Kyoshin Poseidon, the Bando Spiders and the Hakushu Dinosaurs, each one of these teams have their own characters and special plays, and I liked all of them, all of the teams are equally amazing, and of course the matches are really entertaining, but I did feel kinda let down that the Teikoku Alexanders aren't in the anime, specially since the match between them and Deimon is definetly the best in the series.\\n\\n\r\nReplay Value: This anime is really worth watching again, I wouldn't mind it, really, it's a shame that most people pass on it because it's a Sports Anime, like I did, but I'm sure people would like it if they watch it, now, I've really come to love this series, but I have to say that it's better to read the manga because the anime just stops after the final rematch with Oujou, and it didn't show the matches agains Hakushu, Teikoku and the World Cup, which I would've loved to see, but anyway, it's a great anime and it's really underrated, so go watch it, or Hiruma will take you to hell, YA-HA!\\n\\n\r\nRating: Flawless",
            "date": "2010-05-10T12:05:00+00:00",
            "helpful_count": 12,
            "mal_id": 25928,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Juusan13",
                "username": "Juusan13"
            },
            "url": "https://myanimelist.net/reviews.php?id=25928"
        },
        {
            "content": "I really, really, really, REALLY wanted this anime to be good. Hell, the manga got me through a whole football camp experience (which is a masterpiece by the way). But the show was clearly hit by the fault, I personally believe, that victimizes plenty of long shounens. Filler, why is there filler! (SPOILER ALERT) They reveal Sena, Eyesheild 21's, true identity in the 5th episode. True, no one believes it is him, but this never happened in the manga and for good reason. And compared to the manga, I found the art to be lacking in so many ways. Maybe I'm just biased because theanime was so mediocre it makes the manga look bad. And I don't want to bash the series either. I am a huge fan of the manga and whole-heartedly recommend that. However, the anime dosen't do much to impress and dissappoints me",
            "date": "2014-03-25T21:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 137015,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644667.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Maloa101",
                "username": "Maloa101"
            },
            "url": "https://myanimelist.net/reviews.php?id=137015"
        },
        {
            "content": "I really love the manga for Eyeshield 21, so I tried to watch the anime. It doesn't really do justice, in my opinion, to the manga at all. The animation is really shoddy, and I really don't like the style. I doesn't feel nearly as dramatic or fast-paced as the manga at all. I definitely recommend the manga, I couldn't force myself to watch more than three episodes of this show, which is really unfortunate because they had good voice actors for the characters, but the animation was just utter garbage and I can't handle bad animation for a manga series so beautifully drawn.",
            "date": "2013-03-01T14:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 88321,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071271.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kiokushitaka",
                "username": "kiokushitaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=88321"
        },
        {
            "content": "Eyeshield 21 is  the best Anime/Manga about sports, it is about a kid named Kobayakawa Sena who discovers the awesome world of American Football or Football as an american like myself would call it. To be honest,ES21 was my first sports anime and it is the one that hooked me to sports anime. it is really funny and whenever i have a bad day, i watch one ep of it and i cheer up. It combines both comedy and sports together to make the best sports Anime/Manga",
            "date": "2009-01-17T20:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 11635,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/130013.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/goldenozaru",
                "username": "goldenozaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=11635"
        },
        {
            "content": "This anime is by far one of the most entertaining anime's that i have ever seen. The anime itself is based on the sport of 'American Football', with this said, I was not initially drawn into watching this anime with knowing this alone. However after spending some time watching the first few episodes, i found myself stuck watching the entire series within a matter of days. This anime is by far one of the most entertaining and captivating animes i have seen, incorporating a large range of characters in the football team 'Daemon Devil Bats', from the quiet and underestimated main character, Sena who playsas the Running back in the team, Haruma the Captain of the team as well as having a some what shady and evil back ground and many many other characters. \\n\\n\r\nThe most captivating thing about this anime is i think the range of characters and their unique and comical personalities which make this sport anime extremely entertaining. Also, the anime's theme itself relvolving around a sport allows it to build up suspense and tension in many of the matches, making you feel like your actually watching a real game! Having to watch more and more until the end of the match!\\n\\n\r\nThe storyline is based on a 'Gopher' names Sena, who unknowingly gains the ability to run extremely fast. He is made to be an incredibly weak main character compared to the regular main heroes in other anime's, however this means throughout the anime we can see Sena grow stronger and more reliable therefore making it quite entertaining. Not only does the anime show the growth of the main character, but this also allows us to know the main character in more depth, as this is a long running anime. With the growth of the main character and many of the other characters in the team throughout many matches and training, you can't help but literally cheer on the Daemon Devil Bats!!\\n\\n\r\nOverall this anime, just hearing that this anime is a sport anime about football, don't let that put you off! This is an incredible anime, having everything an entertaining anime of this genre needs. I HIGHLY recommend anyone and everyone to watch this anime, even if you are not a big fan of anime of this genre.",
            "date": "2013-07-09T09:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 104581,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843695.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/blaqfire",
                "username": "blaqfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=104581"
        },
        {
            "content": "Eyeshield 21, so far, has been the only sports-related anime that I've actually been able to finish - yet, at the same time, it's the longest. In fact, it's the only anime with 100+ episodes that I've actually been able to complete.\r\nHow does a girl get through a 145-episode-long anime series about a sport she pretty much hates? Simple, she doesn't. At the time, I was a fan of stuff like Katekyo Hitman Reborn - and when I saw people point out similarities, I gave Eyeshield 21 a shot...a real one. With the first few episodes, I fell in love with the series - andeverything about it.\\n\\n\r\nSTORY: It's your typical underdog comes out on top type of thing. What makes it different? Nothing, really. However, it's the way that it's executed. They do it in a way that makes you actually want to sit there and watch the damn thing from start to finish. It's about American football, yet it's set in Japan. As far as I knew, the game wasn't even played there. I didn't even realize NFL Japan existed until I saw the show's end credits - but that's not the point. Normally, due to my attending a high school that was OBSESSED with football, I wouldn't have bothered - but, like I said, I ended up trying the series anyway. It converted me from a football-hater to a football-lover. The show has some fillers, and with 145 episodes, that should be expected. I would have rated it a 10, but I was upset that they didn't bother to include the Teikoku Alexanders. Deimon's goal was to win the Christmas Bowl, right? Then why the hell do they end with the semi-finals of the Kanto Tournament? At least go all the way to the first mentioned goal. The ending wasn't bad by any means, but if you've read the manga - it's a bit disappointing because they don't go all the way to the end.\\n\\n\r\nART: The art was done wonderfully. Yes, it could have been better - but for an anime about a sport that most people assume isn't played in Japan, it's very good. I don't know who the animators are, but they did a very good job with this series.\\n\\n\r\nSOUND: I loved all of the OPs and EDs, well except for the two songs used in the last match against Oujou - but the themes were very well done, for the most part. My personal favorite, lyric-wise, would be \"Blaze Away,\" and I have to admit that it's probably the best ED ever in terms of lyrics because you can hear the emotion behind them. In terms of actual sound and melody, I'd prefer \"A Day Dreaming...\" any day. However, all the themes were wonderfully performed - even if they wouldn't all fit everyone's taste, anyone who watches the series and actually listens to the theme music will be able to pick at least one that they like. The BGM was beautifully done too, although it's a shame you never hear the lyrics to \"Midnight Sunshine\" in the actual series because the vocalists (the seiyuus for Sakuraba, Shin, Takami, Otowara, and Wakana - I believe, although I'm not sure if Wakana was really featured) did an amazing job on it, but \"Be Survivor\" and the other songs featured throughout the series were quite entertaining as well.\\n\\n\r\nCHARACTER: Each character has their own distinct and unique personality. Sure, you've still got your stereotypes, but that's not all there is to them. Juumonji starts off as just another delinquent, but as he plays with the Devil Bats, he slowly grows as a man. In the beginning, he seems like he could just walk by a girl getting raped and not do anything - yet, in a later episode, he saves a girl from that fate. Sena's the weak boy who constantly gets forced into doing other people's errands; the thing that makes him efficient at this, preventing himself from being beat up, is his \"golden legs\" that enable him to run at the speed of light. He goes through the most growth in the series, and one can't give away much about his development without spoiling the whole series. Hiruma, on the other hand, had the most depth throughout the whole series - and, to be honest, you still haven't figured him out by the end of it. However, the series goes into enough detail about him that it's impossible to not love the character. Shin, Sakuraba, Takami, and Otowara are really the only Oujou players that get any true development but it would spoil things if we went into that in-depth. I will say this, though. Takami can be just as cunning as Hiruma, Sakuraba is more than just a pretty boy, Otowara isn't just the guy that everyone runs away from when he farts, and Shin's more than just the perfect player (you can't really write much about him without spoiling everything).\\n\\n\r\nTeams - Yes, they're getting their own section. The Deimon Devil Bats are the main team in this series, and the most developed one. You see their growth from the original two (Kurita and Hiruma) to almost full team. You can't help but sympathize with them most of the time, and the producers made it hard for fans to not side with them for each and every game. The second most-developed team is obviously the Oujou White Knights. It's clear, throughout the whole series, that the creators intend for most, if not all, of the viewers to fall in love with both Oujou and Deimon - possibly because they knew the anime series would end where it did and wanted to make it a bit more climactic. Kyoshin Poseidon were there mostly to raise the self-confidence of the \"Deimon Chibis\" since almost all of the starters were 2 meters tall. Shinryuji was there to show how a hard-working team like Deimon can beat even the 'strongest' team in Kanto by focusing all of their strength on winning. Bando was there mostly to show how Musashi was necessary for Deimon to actually guarantee any kind of winning game; they also helped Sena gain the confidence to tell everyone who's behind the Eyeshield 21 mask. The other teams mainly helped Sena to grow as a football player - even Seibu, although Seibu helped Monta too, in that regard.\\n\\n\r\nENJOYMENT: There wasn't much of anything that I didn't enjoy about this anime.\\n\\n\r\nOVERALL: 8/10 - It could have been better, but at the same time, there's not much they could improve on unless the mangaka or the animators were willing to actually go to America to see how practices, practice games, and official games actually go about. It's still pretty good as is even if they did do the research.",
            "date": "2012-01-25T15:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 52549,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1110983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HeyItsCami",
                "username": "HeyItsCami"
            },
            "url": "https://myanimelist.net/reviews.php?id=52549"
        },
        {
            "content": "I have played football for 5 years all throughout highschool. I did not know there was an anime about football untill June of 2009. I normally would stay away from sports anime's as they are boring and dense but I watched an Amv on eyeshield 21 and fell in love. \r\nEverything is real in the anime, well the tournaments and the attitudes the titles of best running back or linemen, and even the plays. Yes the plays in the show are exaggerated as green beams of light cant come from behind you as you run and all that stuff but in football we do thoseplays which makes it exciting to watch and its always a grudge match in eyeshield which alot of football is like!\\n\\n\r\nThe characters have their own personalities which rocks! They develop and get better through the whole series. Though every region like canada and america and japan all play football diffrently as the show explained. \\n\\n\r\nThe art was great and the voice acting was outstanding and it pumps you up to play football. Only complaint was when there was a moment happening in the game the people would talk to eachother wich doesnt happen in football or you would get crushed. None the less it was great to watch and best sports anime out there it recks King of tennis thats for sure! Watch it and enjoy it! YA-HA!!",
            "date": "2009-12-23T17:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 21656,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XlMcNuggetslX",
                "username": "XlMcNuggetslX"
            },
            "url": "https://myanimelist.net/reviews.php?id=21656"
        },
        {
            "content": "A sports anime... huh..\r\nOk, before I start the review I would like to comment on the nature of sports manga or anime.. I'm sure you all know that things in the sports anime are not gonna happen in a reality sense right? For example this anime.. This is about American Football and you will see a RunningBack that runs in a speed of a freaking light. In reality sense, where in the blue hell are you going to find that? See, the logic? But that is the spice of manga or anime in the sports genre can offer. It can defy the law of realityin order to make things exciting.. To be honest, I don't give a damn about American Football.. I think that it is a sport wherein I can't relate because it's too complex for me to understand its rules and nature.. But, thanks to this particular manga, my eyes were opened to the American Football business.. (Though I don' really play)\\n\\n\r\nOne thing that is cool on sports anime is that all the move set have their own names.. It is funny to think that even your simple fake has its own name.. Well, it's just my opinion but at times it is awesome.. It's cool but the back side of it is that, there are two many moves with names..\\n\\n\r\nDamn.. I really enjoy writing reviews..\\n\\n\r\nOk.. I'm going to give my opinions based on the elements in the rating..\\n\\n\r\nStory (9)\\n\r\nLike I said this is sports anime/manga.. Expect that reality is out of question in here.. That's the essence of sports anime/manga.. (Though I'm not referring to all of the series in the sports genre) This series also defies reality in big time scale.. You know, you need basic physics in order to understand why in the blue hell such scenarios happen.. (You don't need to take the physics thing seriously) Example, Sena's run..\\n\\n\r\nOn the struggle sense, I mean the struggle of the group to go to the top is great. You can see that they want the big thing.. They're hungry for supremacy.. They want to prove something. Even I can feel that fire sometimes whenever I watch an episode. I admit, it's inspiring. You can apply it in real life.. Don't give up.. Don't lose your fire.. Don't lose your passion..\\n\\n\r\nArt (9)\\n\r\nThe art was good. I'm the type of viewer that looks first at the drawing or art before reading them.. So, according to my tastes.. this series is great..\\n\\n\r\nSound (9)\\n\r\nAre you a fan of J-rock band BACK-ON? If you do, you will definitely get me.. The songs from that band are awesome!! The opening 4 and some endings, it's awesome.. I really like the rap and rock style of music of BACK-ON.. OK, that's all.. hehe\\n\\n\r\nCharacter (10)\\n\r\nGood job for the creator of this series for making characters of different styles.. First, the protagonist Sena.. He has a balance of awesomeness (when Eyeshield) and wimpiness (when normal mode).. I would also like to thank the creator of this series for creating Hiruma Yoichi wherein I can attribute my somewhat evil and never say die attitude.. As you can see, where in the blue hell are you going to see an athlete that carries legit firearms whether he is in school or in the football field? I also want to point out his catch phrase of saying \"We'll Kill them!! YAHA!\" That is so EPIC!! It is a good cheer.. It can be apply in real life... I apply it in real life!! It's freaking awesome!!! Well, I will no longer give ideas to the other characters.\\n\\n\r\nBottom line in here is that, they are a lot of characters and I'm sure there are one or two characters wherein you can relate your life to..\\n\\n\r\nEnjoyment (10)\\n\r\nI find the match build up interesting and enjoyable.. Each school has its own motif and has its own matchup logo and mascot.. Whenever there is a match there is this kind of build up title card that shows the name of the schools.. I was like watching a wrestling match title card.. (If you get my analogies)\\n\\n\r\nEven though I don't really played American Football my entire life, I can say that it is fun to follow this series, The plays are amazing.. You can see the awesomeness and drama for each match specially when the Deimon DEVIL Bats wins..\\n\\n\r\nOverall (9)\\n\r\nI want to play American FOOTBALL.. Joke..\\n\\n\r\nThis is a good series.. Good drama, awesome defying of reality, awesome complex characters, good match ups and the I really like the chant..\\n\\n\r\nI knew that the anime series is not completed. I wish that they have another series wherein they will finish the story up to the end. Well, the manga is finished, the material is there.. I honestly felt that you can feel the action more when things are animated.. I strongly wish that this must have a continuation..\\n\\n\\n\r\nThat's all.. Thanks for reading..\\n\\n\r\nLightningSnow :)",
            "date": "2012-10-03T08:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 73981,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571221.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lightningsnow",
                "username": "lightningsnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=73981"
        },
        {
            "content": "\"Eyeshield 21\" is traditional sports anime about a kid who learns to believe in himself and become a winner, but at the same time it is also a comedy with a bizarre twist - it's about a group of misfit Japanese high school kids forming a team to play \"American Football\" in their Japanese high school. So you not only have all of the usual \"Gambatte! Gambarimasu!\" (Do your best! I'll do my best!\") sort of stuff, but also an attempt to give a Japanese youth audience a crash course in American-style football. The result is a spectacularly funny comedy, both deliberately - due tothe wacky cast of misfits - and also unintentionally, because of the ongoing attempts to explain the rules and concepts of American football during the eyecatches and off-and-on during the story line. \\n\\n\r\nFirst year high school student Sena has always relied upon his older female friend Mamori to protect him. And when Mamori isn't around, Sena has learned to run away from trouble because he is smaller than most of the bullies that bother him. But now that Sena is in high school he no longer wants to be \"protected by a girl\" and allows himself to be talked into joining his high school's American Football team, which has few players, never wins, and is almost unknown in the high school. But Sena's \"running away\" has developed him into a phenomenon - he can out run most pursuers and thread his way through most obstacles, including football defensive teams. Because of that, the fanatical and demonic captain of the football team, Hiruma, decides to rebuild the team around Sena, with Sena disguised as the mysterious running back \"Eyeshield 21\".\\n\\n\r\nWhat results from this is a fast-paced, unpretentious story with surprisingly adept character development and smart, consistent comedy. Add to this reasonably good animation and a lively soundtrack and you have a nice bit of old-fashioned fun done in a thoroughly up-to-date manner. So forget about anything you ever knew about American High School Football, sit back, grab a bottle of \"sports water\", and enjoy the action.\\n",
            "date": "2009-05-22T18:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 15212,
            "reviewer": {
                "episodes_seen": 53,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111604.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dbaranyi",
                "username": "dbaranyi"
            },
            "url": "https://myanimelist.net/reviews.php?id=15212"
        },
        {
            "content": "It was very very average.\r\nMaybe it's just that I watch too much football.\r\nI dropped after first 3 episodes and finished manga instead.\r\nPositive: how many mangas talk about the gridiron\r\nnot a whole lot.\r\nNovel sport, pretty detailed descriptions, fairly involved storyline.\r\nNegative: exaggerated features, even for a sports manga\r\nHated some details,\r\nI dont like how the author glorifies notre dame. Yeah, ND was good\r\nwhen they were all wearing pigskin helmets and all caucasian.\r\nLast ND champ was in 80's. If they want to talk about real college football,\r\ntalk about SEC football: Florida, LSU, Bama, etc. \r\nAlso, players do not immediately sign into NFL. Most players play in college for mandatory3 years before goin to pros.\\n\r\nThird, I've yet to hear of any real football players with 4.1 speed. That is absolutely and utterly impossible because most players have a pretty big muscle bulk too.\\n\\n\r\nYeah, I ranted, because I care",
            "date": "2010-04-14T21:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 25085,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/136638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zhang1222",
                "username": "Zhang1222"
            },
            "url": "https://myanimelist.net/reviews.php?id=25085"
        },
        {
            "content": "The anime is truly fantastic but it has the drawback that I felt made Hajime no Ippo just as frustrating... No matter how strong and powerful the main character gets they still act like a damn coward!!! They could be in a match 60 episodes into the series with TONS of training and TONS of determination and then once the match starts they CRUMBLE like all they have worked hard for is forgotten and they SHRINK in their shells wishing for some shit to happen! It truly hurts these anime in my opinion. Of course the saving grace is the end where they \"recall amemory\" or they \"see the struggle of others around them trying their hardest\" and they eventually crawl out of their shell and help the team win. HOWEVER after seeing this same approach to every single damn match, as the viewer, you become upset when the main character said he would try his best the day before but when it comes to the start of the game they revert back to their cowardice ways. After 60 episodes Sena needs to grow a pair of balls and run with the idea that he can't let his team down as their Ace!!! I don't mind him being timid and afraid as Sena but when that Eyeshield comes on he needs to become a man and lead his team to victory!",
            "date": "2015-03-17T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 182551,
            "reviewer": {
                "episodes_seen": 69,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3730055.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/beachman4",
                "username": "beachman4"
            },
            "url": "https://myanimelist.net/reviews.php?id=182551"
        },
        {
            "content": "I'm writing this review just because I feel that need to voice my opinion out there about this certain anime. This is the first series that I've written a review for. Keep in mind that I've read the manga before watching the anime and will be judging this anime in two ways: as a adaption of a manga and an anime standing alone. \r\nStory - 9: Well, the story is pretty much straight forward and doesn't require much explaining. It's about playing football. Well, it's more like a story of a small team  getting bigger and grows stronger through the course of the anime.Maybe that's one of the reason that I love the manga so much. I could be over simplified this to much, so please correct me if you need to.\\n\\n\r\nArt - 6: First, I'm comparing the art/graphics to other series. And it doesn't really stand out much with the bland graphics. Second, look at the manga and back at the anime, you can obviously see that the anime doesn't hold a nail to the manga. Yusuke Murata's art style is unique and impact-full. The character design was also done by this great mangaka. I'd almost scream with disbelief when I first saw the anime (an exaggeration, but I did blabber for 20 mins after and my brother had to threw a pillow at me to shut me up). \\n\\n\r\nSound - 7: The openings and the endings are enjoyable in my opinion. The sound tracks are well done and did a good job setting up the mood for the anime. It took me about 2-3 episodes to get used to the voice acting. It's not that the voice acting is bad or anything, it's just that spent way too much time envisioning the voices in my head while reading the manga. One of the reasons why I was quite disappointed when I heard Hiruma's voice for the first time. I would say that they could've done better with the voices.\\n\\n\r\nCharacters - 8.5: Since I've read and re-read the manga for about 6 times I really don't have anything to complain about the character designs. All of them have their own unique traits that are just perfect. Very memorable characters. And yes, I still remember Ishimaru, probably one of the best trick that was done with characters. (I won't say what is it, you'll just have to watch the anime or read the manga. The joke continued very nicely through out the series.) But I do have to complain about how the studio that made this anime ruined some of the character traits and making them very hard to enjoy. I do understand that they have to follow a certain amount time in one episode of the anime and sometime the manga is too short or to fast that they have to add a few extra scenes. I don't mind the filler scenes, but rewritting a character is unacceptable for me. They made Sena looks like a wimp for the first half of episode 13. While in the manga, he did not show ANY of the traits that they gave him in the anime. No wimping, crying or anything. By doing so, they have reduced the enjoying of the anime for many viewers, complaining that Sena is too annoying. \\n\\n\r\nEnjoyment: Standing on its own, it would have been around 8 or 8.5. With the filler scenes. As a adaption of the manga, I could only give this anime a 6. I feel that this anime could have done better with its action scenes.\\n\\n\r\nOverall - 8: Needless to say, this is still a good anime. Might be a little too long, but a good series that needs a little bit appreciation. And if you want more, check out the manga, you won't regret it. \\n\\n\r\n(I locked myself in my room for three days to finish the manga because it was so good that I literally can't stop reading it.)",
            "date": "2016-08-23T14:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 227444,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4390111.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/YuzukiSanae",
                "username": "YuzukiSanae"
            },
            "url": "https://myanimelist.net/reviews.php?id=227444"
        },
        {
            "content": "I would give 10 for all the components.\r\nMany people have been saying that eyeshield 21 is better in manga than anime and that the anime seriously sucks. That is not TRUE AT ALL. Just because it the anime art isn't on par with the manga , just because the animators did not do such a good job in bringing the most epic scenes / badass scenes for eyeshield does not mean the anime sucks.\r\nFirstly , the animation may not be good but it gives life to those characters. It is cute in a way like its so refreshing to watch. We also get to seesome very good characters getting animated like Youichi Hiruma and Habashira Rui.(There probably are some others) but i only like these 2 characters cause they are pretty similar to each other XD. Pretty much why i keep on watching :D\\n\\n\r\nSecondly , the voice actors bring up on to another whole new level for eyeshield 21. There are some scenes that really hits us on point. Like for the part when they lose, and their cries really hit on point. For E.G. Chameleon team , Habashira Rui confrontation. The manga did make me tear up but the anime make the sadness in another whole new level. Hiruma voice also did quite well. Well , there are certainly some down points for some not well-done voice actors but i don't think it affects much in this 145 episodes tv-series. I can overlook the cringe part , that's just how good the anime is.\\n\\n\r\nLastly , I do love both the manga and the anime. I like the manga more than the anime but the anime is just good as well. There are only somethings that can be found in the anime like the animation of the team bonding. It has many episodes where they train as a team and so on blah blah. Those animation makes me like : uhhh ~~ so sweet~~. \\n\\n\r\nNEVERTHELESS , I recommend watching the anime as well as the manga (re-read from 1st chapter) For 2-WAY TRAIN TICKETS to feel trips X)",
            "date": "2017-03-21T01:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 243072,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5519061.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ILoveOreImo",
                "username": "ILoveOreImo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243072"
        }
    ],
    [
        {
            "content": "Eyeshield 21. An Anime about Sports, One sport in particular, American Football. 145 Episodes of American Football. \r\nI liked Eyeshield 21. Always keeping me on the end of my chair ready to cry with them, and to laught and have fun with them. \r\nEvery battle were interesting. With alot of good cliffhangers.\r\nIt seems long sometimes, and Some might say it becomes ''Annoying'' the way the Main Character, Always loose at first, then come back even stronger ready to win. But I enjoyed the very last bit of it.\r\nIt was a great anime. Not the best, But certainly a great Anime.\r\nIf you're willing to put yourtime into an Anime, If you like Sports, If you like Shonens, Or if you like American Football. \\n\r\nYou should definately give Eyeshield 21 a try.\\n",
            "date": "2013-02-07T22:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 86213,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=86213"
        },
        {
            "content": "With just story plot-line, i would say that this story is pretty typical. An average kid who joins a sports team and gradually becomes more powerful. However, I found myself unable to take in a singe breath due to constant bombardment of laughter. The sound effects and jokes in this series is one of the most hilarious I have ever seen and it saved this Anime for me. I seriously recommend this to anyone who wants to lighten their load with a little laugh!",
            "date": "2015-04-22T19:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 186262,
            "reviewer": {
                "episodes_seen": 47,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/varzail",
                "username": "varzail"
            },
            "url": "https://myanimelist.net/reviews.php?id=186262"
        },
        {
            "content": "Eyeshield No.21 as the name suggested is about a boy Sena Kobayakawa, who considers himself as weak, loser but with accidental discovery of Youichi, made him wear this eyeshield which masks his true identity,who finds his another identity with his number in the game 21. Whenever Sena wears it his personality takes 180 degrees change, in terms of confidence.\r\nCharacters:\r\n1. Youichi himura was the main LEAD if you watch the whole series. He is the ring master who spots our protagonist sena, as he was escaping from his bullies. This is unexpected to Sena but youichi makes him join the team.  Youichi gathers new membersby correctly perceiving the true strengths of each of the members that he chose.\\n\r\n2. True Rival from Ojo whites, Seijuro Shin. Shin's character inspires Sena to slowly gain confidence in himself and at last ariouses in him the desire to become strong. There was never shown in the anime any arrogance in Shin, in fact he was the most hardworking sportsment in this anime. In reality he was the one other than youichi who strongly believed in Sena's ability.\\n\r\n3. Musashi's character is amazing too. \\n\r\nBut all the characters were amazing.   Teamwork is shown very well in this anime.\\n\\n\r\nArt: Beautiful. Especially in game scenarios you would forget about the art but get excited to see what happens next.\\n\\n\r\nSound: Appropriate for the series. \\n\\n\r\nI like this anime for the following reasons:\\n\\n\r\n1. Beautiful way of character development from starting to the end.\\n\r\n2. Youichi's mindblowing strategies in the game.\\n\r\n3. Training Sessions for the team members were too amazing.\\n\r\n4. Friendship and collective aim of victory is nowhere to be compared with other sports anime.\\n\r\n5. Humourous. There is Natsuhiko Taki, whose acts are always compliments by crows \"aho(idot) sound. Tetsuo Ishimaru who seems to be invisble to his teammates ( actually i sympathized with him)\\n\\n\r\nOverall: 10/10\\n\r\nI Enjoyed it a lot. From episode 1 to Episode 145 it's more than EXCITING. Whenever matches came, i and my family ( as we watched together) were not able to concentrate upon eating lunch, dinner so did both at a time in front of the screen. When it ended searched for similar anime series but none were able to produce such excitement so far.\\n\\n",
            "date": "2016-07-07T05:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 223379,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3838527.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/deep3anime",
                "username": "deep3anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=223379"
        },
        {
            "content": "Forget about the basket anime or the volleyball anime, try AMERICAN FOOTBALL anime because you know, why not? Out of all sports that you watch, it has to be american football. Some of you right now probably lives in America and kinda knows nothing about american football. \r\nEyeshield 21 is an under rated sports anime because it is a pretty old sport anime and it is american football. Not that many people even knows about this sport unless you live in america, but Eyeshield 21 did this sport an amazing job on making it interesting and enjoyable.\r\nStory: (9/10)\r\nThe protagonist, Sena, isn't your usual hot headedguy but a weakling, who grows as a person quietly but also strongly and together with his newly and weak formed team, they work hard to win the Christmas Bowl, a championship game for American Football. All under the alias, Eyeshield 21\\n\\n\r\nEyeshield 21 did a very good job with pacing for every game is never feels like it ended to abruptly and allows us to know our opponents, showing us that they are just like our main team, all working hard to win the championship and should not be dismissed for their losses are real and painful to them. \\n\\n\r\nEyeshield 21 doesn't just use the fact that their opponents are stronger than them, but use the factor of how small the team is with no reserve, stamina, and time. They use time so well because you, the watchers are aware of how little the time is and it makes your hearts beat fast as you try to think of what can happen next because with so little time this is probably the end for our main team. It uses all these factors very well on making you be on the edge of your seat.\\n\\n\r\nEyeshield 21 started strong and goes on strong but ended with an abrupt ending though, but the kind that you can allow to pass because of how good all of the story are with it's suspenseful matches with heartfelt characters, opponents included, and witty and comedic moments. \\n\\n\r\nArt (8) and Sound (7):\\n\\n\r\nThe sounds is nothing spectacular, with pretty catchy opening song and one soundtrack that stands out more than other, it is nothing of praise but not to be hate either. But the voice acting are just perfect.\\n\\n\r\nThe art though, Eyeshield 21 is a manga drawn by Yusuke Murata, who I considered a God of art. Though at first in his manga, the art is drawn averagely, Yusuke Murata grow as an artist and his art flourished like flowers in spring time. Eyeshield 21 anime did a poor job to capture that beauty of an art but still enjoyable to watch, and the animation can be something to be cried over. Compared to the sports anime of today's time (like kuroko no basket or haikyuu) it is poor with overused scenes. I recommend on watching this first before reading the manga, because if this is the first thing you watch, the art and animation can still enjoyable before reading the manga and realizing what an awful job they did with the animation and art.\\n\\n\r\nCharacters (9/10):\\n\\n\r\nSena is through and through a scaredy cat but Sena's moments being one gets  shorter and shorter because he grows up. He still gets scared yes, but his need of thrill and curiosity of fighting against someone stronger get a hold of him and he rises up, with a straight back and kind heart. His new and empty phone slowly gets filled up for with every matches, the opponents don't stay as opponents but also a friend and a companion in American Football and his team mates stays with him though thick and thin. That's what makes him a fleshed out protaganist, still being him and not changing but growing with a kind personality but is not a pushover.\\n\\n\r\nThe most memorable character is Hiruma, the team's captain, but each of the characters, both in team and the opponents, aren't just a theme but a character, some more well rounded than others, that knows the feeling such as being in the bottom and not being able to be the best they are or something else that is also complex and heartfelt. They are relatable with good character designs, they aren't the characters that you will easily forget.\\n\\n\r\nOverall (9/10):\\n\\n\r\nIf it weren't for the so-so music, the could-be-better animation and its abrupt ending, people would fawn over it much more, I think. But this anime is a must watch for it's good pacing, well rounded characters and humors. Also, it's american football, the sport itself is pretty interesting.",
            "date": "2014-09-27T21:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 162595,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193875.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kimwonshik",
                "username": "kimwonshik"
            },
            "url": "https://myanimelist.net/reviews.php?id=162595"
        },
        {
            "content": "For many anime watchers, American football lacks appeal; I myself do not enjoy watching the NFL and football games in general. However, Eyeshield 21 doesn't require you to be enthused about the game of football, and you don't even need to know the rules right off the bat. Eyeshield 21 is your typical sports anime, and seeing as how American football isn't that popular in Japan, the creators of the anime put in a lot of time and effort to reinforce the basics of football to any newcomers to the sport without being overbearing. Eyeshield 21 has just the right mix of mind games, underdogappeal, and style to make the anime work. While the story is rather linear and predictable, such is the nature of sports anime.\\n\\n\r\nEyeshield 21 takes the standard mold of most sports anime with the main character being a school kid with a unique talent,  surrounded by teammates who want to win a championship. They begin at the bottom of the ladder, and slowly work their way up with dreams to become national champions in the end. In addition, it's make or break with the season, as the ensemble of characters are school students and thus have a limited time to win a championship before they graduate.\\n\\n\r\nSena Kobayakawa is our main character, and his personality is rather bland. He's a coward who is forced into American football, and slowly gains courage to take on stronger foes along the way. Like I didn't see that one coming. He's essentially a workdog for other people -- and even when he's in his \"hero\" mode in which he discards his coward persona for something more shonen-like, his personality is just flat out boring. The character development of Sena throughout the anime is predictable, yet still satisfying to say the least.\\n\\n\r\nApart from Sena and useless girl 1 and useless girl 2 (Suzuna and Mamori), the other characters are very well done. Hiruma in particular was an absolute badass, and kept the anime interesting with his constant blackmails, mind fucks, and aggressive style. Kurita took your gentle giant archetype and gave him a deep backstory that made you feel sympathy towards Hiruma, Musashi, and himself. The 3 Ha-Ha brothers were good comic relief, and helped add a little bit of flavor to Eyeshield 21 with the whole theme of trash overcoming talent with sheer willpower and guts.\\n\\n\r\nThe art is nothing special, but it's easy on the eyes and has a mix of seriousness and comedy infused within it. Hiruma's features in particular really give Eyeshield 21 its identity with the pointy ears and devilish fangs -- all very fitting for a team named the Deimon Devil Bats.\\n\\n\r\nThe sound was all right; I particularly enjoyed Hiruma's theme simply because I have a soft spot for strategic bad asses who have good intentions. And the music that plays when Sena goes into light speed is very fitting as well.\\n\\n\r\nI enjoyed the earlier episodes when I didn't know what to expect. But seriously, every football game Deimon plays takes your same mold of being stomped in the first half, and coming back in a ridiculous fashion in the second. It was enjoyable the first time, but it seriously detracted from the rest of the games as the series progressed, which sucks because the teams during the later parts of the anime are actually interesting by concept. \\n\\n\r\nIt was also pretty easy to predict the scores of the games, and you could usually tell how they would be scored. If the opposing team was up 35 points in the first half, I'd predict that the Devil Bats would score 5 touchdowns with 4 made kicks and one extra touchdown conversion from Sena's trademark move, winning 35-36. Without a kicker, then it's simply 6 touchdowns to reach that number. If the opposing team has an ace receiver / lineback / running back, it's painfully obvious that they're going to whoop the floor with Sena and Monta until they have some epiphany on how to beat their opponents and score a touchdown late in the last 5 minutes of the game. Such is the nature of a sports anime, I suppose. \\n\\n\r\nOverall, I enjoyed Eyeshield 21. It's your run of the mill feel good sports anime with trashy players becoming something special. Don't be discouraged simply because you don't like American football, because you don't need to love the game in order to love this anime.",
            "date": "2013-08-18T23:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 110311,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3017169.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Pluscano",
                "username": "Pluscano"
            },
            "url": "https://myanimelist.net/reviews.php?id=110311"
        },
        {
            "content": "The art and sound are decent in Eyeshield 21, but more importantly its the power and blood boiling excitement attached to the determination of the characters that amazes me.  Eyeshield 21, makes you somehow excited and determined like the characters throughout the show.  As friends and family hang around together full of liveliness, it shows the incredible determination in American football probably more than actual American Football.  The show may go quite overboard sometimes by jumping and touchdowns in seconds, but it stays sane enough to excite you from start to finish.  The characters really gave it to me with humorand pure awesomeness.  The Evil demon Hiruma, never fails to make me laugh with his terribly wicked plans, Kurita shows a softhearted kindness and a powerful and destructive feature, Shin shows a determination to football which is something you can't help but admire about him.  There are players you absolutely hate too, but you can admire how the protagonists keep their cool and win against them in a calm and cool manner.  I have to say though, my least favorite character was Sena who was the actual main Protagonist.  It takes him a while to show his true guts and strength in the show.  He remains a coward for a bit and cools down gradually.  However, he shows his full on skill with absolute determination in his mentality when facing an opponent full heartedly.",
            "date": "2010-05-28T21:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 26549,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sdgheoiman123",
                "username": "sdgheoiman123"
            },
            "url": "https://myanimelist.net/reviews.php?id=26549"
        },
        {
            "content": "I'm not going to go very in-depth about the merit of this pretty typical shounen sports anime but I will list reasons that keep me watching, although I still haven't finished it hehe.  The manga is really worth finishing though!\r\n1.)  Although the manga is a lot better, I'm a sucker for color and movement so I loved seeing everyone animated.  I think everyone else has more or less mentioned this, but the characters make this story/show.  Hiruma is the freaking man, Sena is wonderful to watch, Mamori is super kickass, and everyone else just can't help being awesome as well.It's hard not to fall in love with every single team besides Deimon, despite Deimon being the protagonist team.\\n\\n\r\n2.)  As strange as it sounds, Hirano Aya as Mamori is very refreshing and great to hear.  This is probably my most favorite role of hers.\\n\\n\r\n3.)  THE SPORTS FESTIVAL EPISODE.\\n\\n\r\nYeah so that's it... but if you can't seem to get into the anime, I really urge you to try the manga!!  Common story but I came in knowing zero things about football, and now have no issues following and explaining the Superbowl to my friends lol.  If you're enjoying the recent influx of sports anime, Eyeshield 21 is a very solid offering from the genre.",
            "date": "2014-05-13T10:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 143193,
            "reviewer": {
                "episodes_seen": 65,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yumedarling",
                "username": "yumedarling"
            },
            "url": "https://myanimelist.net/reviews.php?id=143193"
        },
        {
            "content": "Welcome one and all to another Waldy565 episode 1 review - where I review a series based on just the first epi... Let's get started!\r\nStory - So, to briefly sumarise, a high school kid (there's a recurring theme going on somewhere :P) by the name of Seba-kun has had an unfortunate school career - in elementary and junior, he was always bullied by the bigger kids to buy stuff and generally be a mule. But, what I can only assume is a childhood friend, tells Seba to man up and make some friends. Only, the bullies get to him again and throw him in ashed, which just so happens to be the American football club HQ. Anyway, things happen, and a member sees Seba's potential when he is running away from the bullies, and decides to bring him back to HQ. They cover his face, so only they can keep him when they play games, and in homage to his shirt, he is nicknamed \"Eyeshield 21\". Pretty basic stuff, but a nice twist on how someone would join a club.\\n\r\nArt - Fairly standard stuff, bit of a cross between hand-drawn and mediocre CGI. It's nice enough, but that's the thing. It's not lovely, gorgeous, spectacular, nor horrendous or terrible, it's just nice.\\n\r\nNot much to say on the sound front either - the title and ending themes are upbeat and funky, but that's about it. Cool enough.\\n\r\nCharacter is where the show shines. Everyone, even the bullies, has been fleshed out, and it's terrific to see a creator but so much love into a project. When me and my friend start our manga, I'll definitely draw inspiration from these guys and gals and hope I can also give lots of character and charm.\\n\r\nEnjoyment/Verdict - Overall, this is a pretty neat sport anime, that focuses as much on the game as it does on the players and there backgrounds. A great watch, IF a little lengthy (100+!). 8/10",
            "date": "2013-06-13T13:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 100949,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2501829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Waldy565",
                "username": "Waldy565"
            },
            "url": "https://myanimelist.net/reviews.php?id=100949"
        },
        {
            "content": "Eyeshield is one of a kind of anime. Making an anime about a sport few play in Japan turned out to be a good move on their part. The storyline is not exacctly epic, its just the goal to go to the Christmas bowl and play the best of the best. The characters are indeed very different from one another, and there'a a variety of them, to the little bullied kid Sena,the kind hearthed Kurita and the demented Hiruma, among others. I like how some of the characters progress and mature as the show goes on and how some change mentally. I don't think therewas an anime or manga about American Football, but im sure glad they made it because the games are mixed with real life physics and moves an anime can only create, such as throwing a football harder than Brett Favre. As the show goes on, the show introduces new teams, games, characters, and problems characters have to face, such as keeping sena's secret alter ego Eyeshield 21 a secret from the school. There are rivalries just like in real life and the practices are can be brutal, especially if Hiruma is in charge. It starts out pretty slow but then the games are pretty exciting to watch. I really enjoyed this anime and managa because i also enjoy Football. The bottom line is that if you like football, then give it a shot, and if you don't know anything about it, the show explains what positions do and general rules of the game with Mamorinechan's football clinics. You'll know what Im talking about if you watch the show. Overall, its a very good anime due to the facts that no one has tried, or dare to make a football anime that could be successfull and popular. The story starts slow and you wont see the first game until like 3 or 4 episodes or something like that.",
            "date": "2009-09-21T16:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 18997,
            "reviewer": {
                "episodes_seen": 100,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237219.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/darkjager",
                "username": "darkjager"
            },
            "url": "https://myanimelist.net/reviews.php?id=18997"
        },
        {
            "content": "This is one hardcore American/Japanese anime that is worth watching. I'm not really into sports anime, but this one really gave me a glance into a whole new genre that most people don't pursue. Eyeshield 21 is full of action, suspense, not really romance, comedy, and will power!  I recommend this anime not just to football fans, but to everyone  who is looking for something thrilling and funny.",
            "date": "2012-07-19T17:35:00+00:00",
            "helpful_count": 0,
            "mal_id": 67089,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1404841.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Komik",
                "username": "Komik"
            },
            "url": "https://myanimelist.net/reviews.php?id=67089"
        },
        {
            "content": "Whew! I just finished watching the final episode, and what a journey. It really did finish strong, and even though some loose threads weren't tied up, it was an enjoyable ending.\r\nThe anime starts out really strong, and I would easily give it a 10. However, around the episodes were Saizen stopped subbing Eyeshield, the series started to decline in quality especially with the fillers. However, once the Kanto Tournament starts the series really starts to pick up again, and reminded just how awesome this series is; with the intense stakes and games I couldn't pull myself away.\r\nHiruma really steals the show with his demonic personality,and Eyeshield's light speed run is always enjoyable to watch. All the members of the team have a good backstory, and are fleshed out to the point where they don't feel like just a supporting character.\\n\\n\r\nJust watch it. After 1 episode, I guarantee you'll be hooked.",
            "date": "2012-03-26T21:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 57085,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1215093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/godstriker8",
                "username": "godstriker8"
            },
            "url": "https://myanimelist.net/reviews.php?id=57085"
        },
        {
            "content": "I found this Anime simply, amazing. Instead of having short series Anime's who compacts everything into 12 episodes, Eyeshield 21 gives you the full development of the character itself. \r\nThe Anime follows a short and weak gofer, Sena. Throughout his life he has only ran errands for bullies and has always been protected from someone he considers his older sister. Sena had never done anything for himself; until he discovered something he loved, Football. As the Anime goes on, you will see Sena develop not only as an Ace Runningback, but as a person.",
            "date": "2012-02-18T15:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 54135,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1153645.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kingaix",
                "username": "kingaix"
            },
            "url": "https://myanimelist.net/reviews.php?id=54135"
        }
    ]
]