[
    [
        {
            "content": "This anime is extraordinary!\r\nEven when stacked up against Isekai abominations like Death March and Isekai wa Smartphone, it still somehow manages to be even worse! In fact, this might just be the worst Isekai anime that I’ve seen to date, and considering the generally poor quality of the genre, that’s really saying something. So yes, this anime (whatever the hell its name is) is definitely incredible!\r\nIncredibly bad.\r\nThis anime doesn’t even bother to start with the protagonist getting inexplicably transported to a fantasy world. When we’re introduced to him, he’s already been in another world for two years, so it’s almost like this isn’t even anIsekai anime. Gotta love dat lazy writing! Anyway, our protagonist, named Super Ultra Omnipotent Usurper, or Suou for short, is, you guessed it, a perfect being in every way! He’s the most morally just and relatable character ever, is a military genius, and, most importantly, gets all the bitches! Actually, only the latter is true, but the anime still desperately tries to give him character traits that make him more than just a chick magnet. Too bad they fail miserably. \\n\\n\r\nSuou is a conqueror, plain and simple. Not of nations, but of women. Yet what makes him stand out from his fellow Kirito clones? Well, Suou is unique in that when he claims a girl as his property, he makes her a part of his “family.” Thats right, this guy forces his women to become his little sisters and daughters, and makes them address him as “papa” and “big brother.” What a sick bastard. He also doesn’t seem to give a crap about his soldiers and doesn’t bat an eye when they’re slaughtered in combat. And the best part is that the writers still try to portray him as an “I am holier than thou” type of character. What a guy!\\n\\n\r\nThanks to the solar powered smartphone that Suou just so happens to have (Sigh…I don’t even care anymore), our hero is able to look up military tactics of great historical leaders like Alexander the Great and Sun Tzu and implement them in battles. Of course you really can’t tell what battle strategies are being used during fight scenes due to the hideous visuals that make everything look like an utter mess. There are even some scenes that are repeated several times within the same battle because the animators couldn’t be bothered to actually do their job. \\n\\n\r\nA random red haired dude in this anime wisely said “the details don’t matter.” I think the writers must have taken that sentence to heart. Nothing about this anime makes any sense. The plot thus far has gone nowhere, the characters are painfully bland and annoying, and the show isn’t fun to watch. And if you’re watching this for the sole purpose of beating your meat to sexy 2D anime waifus, don’t. It just isn’t worth it.",
            "date": "2018-07-28T12:43:00+00:00",
            "helpful_count": 189,
            "mal_id": 285004,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813391.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/XHellLyterX",
                "username": "XHellLyterX"
            },
            "url": "https://myanimelist.net/reviews.php?id=285004"
        },
        {
            "content": "I was supposed to get me one of those solar ray powered telephone calling systems that grant the access to a fantasy world filled with countless lady persons, but Amazon had sold them out when my telegraph reached their end. Damn it. \r\nSuou Yuuto is one of those lucky bastards who didn't get ninja'd by scalpers, and now he lives the perfect life as the lawfull harem-bro to these MWWM's. No, it does not stand for my wild waifu maiden, but magic-wielding warrior maiden. Basically, anyone with a female knight fetish could pay decent amounts of money for a device like that. If you happento know where I could get one, leave me a pm (asking for a friend).\\n\\n\r\nOn a less serious note, whateverrandom words Valkyria is an anime series you most likely would not/will not enjoy for the reason that it is a copy-paste of every smartphone self-insert harem. The selling point of these series has always been how bad they are, but the sole amount of worth of nothing series has pushed the standards so high that these days bad series need to be impressively bad for them to be worth of anything. Valkyria does not impress with its lack of quality, and that is its biggest flaw. \\n\\n\r\nBasically, this series is like Kingdom if it had been an excuse for generic isekai harem where the mc is the perfect Garu Stu Jesus and female characters just numbers. Speaking of excuses, every bit from the war settings and battles to backstories and slice of life moments are nothing but excuses for our mc to interact with his harem, and add more lady persons to it. Let's be honest here: For this series to ever be wort of anything at all: it should have been hentai.",
            "date": "2018-07-28T10:01:00+00:00",
            "helpful_count": 63,
            "mal_id": 284988,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=284988"
        },
        {
            "content": "The Master of Ragnarok and Blesser of Einherjar is a truly humiliating work. It’s so comically inept and earnest in the name of its intended ambitions and atrocities that it becomes endearingly pathetic for a while. I was wholly prepared to come write about how this show was the ultimate waste of time in terms of creating it, watching it, and especially reviewing it. It still is in many ways, especially when it becomes downright insufferable later on, but this deformed gem belongs in the same realm as classics such as Big Order and The Room. I mean, just look at this thing, this clueless,fugly piece of shit!\\n\\n\r\nThis show is the penultimate production shitshow! To begin with the easiest of targets, the CGI is as prevalent as it is laughable. The stills are more frequent than bits of animation, resulting in some garbage action and hentai-like sequences. The animated fight sequences aren’t much better, so it’s nigh impossible to appreciate the “action” on any level.. As if all that wasn't enough, the people at studio EMT² created this terrible Ufotable-esque art-style similar to the infamous Chaos Dragon, and they struggled heavily to keep their character models consistently drawn. Shame cuz some of the women are so hot that they deserve much better, at least until you realize what utter objects they all are. That’s when that becomes debatable.\\n\\n\r\nThe female characters in this show are borderline humiliating, especially the twin additions to the harem. While they’re at the very least varied in terms of what kind of objects they are and even much of an object they’re characterized as -unlike in Smartphone- they’re still barely effective at best and downright worthless at worst. The best things I can say about them is that they don’t blatantly fall into any archetype, and that some of their designs, namely Siegrune’s, are cool and have fun clothing. The later ones are so disastrously infuriating and  worthless that after the pink-haired girl showed up, they should have stopped this process altogether and spent more time fleshing out we had. Their leader, Yuuto, is downright hysterical; he is a total piece of shit. Outside of the bitches he collects, patronizes, and still refuses to bone, and this one girlfriend he has at home (along with the few generals and whatnot who are useful), he treats everyone under his ranks with as much contempt as the most reprehensible regime leader villains in anime history. This man will force you to become his slave child or his barely any less subservient little sister, and threaten to massacre your clan if you don’t comply. His mistresses are all either his children or little sisters, which is obviously for the most unashamedly fetishistic sexual gratitude for both him and the intended audience. We’re supposed to treat him like a normal harem protagonist cuz he still has most of their hallmarks, or a decent human being just because he regrets having been worse? Fuck outta here! That’s like saying we’re supposed to pretend any of the remaining side-characters aren’t the most onenote and worthless things ever. Even he knows how awful he is, and some of it isn’t even his fault.\\n\\n\r\nThe fact that with all this, they still try to set up moments and entire plot-lines with intrigue, attempt to have character arcs with peak “emotional moments”, and take this show’s story seriously with emotional music and close-ups of women crying in joy or despair to boot, is as rich as it is tragic. It attempts all of that in the name of selling this kind of disastrously nonsensical, badly paced, convoluted, excess, and ill-defined material as something worth getting invested in. They even have several decent fantasy music for the title cards and scenes related to the ongoing war that are often only heard once. When Overlord is just sitting there, cackling in the corner with its superior OP/ED music in the same season this bullfuckery airs, things need to start being re-evaluated. In spite of all this, this show actually tries to indirectly explain the origins of this main character becoming an Isekai protagonist with a single moment of visual storytelling in the opening before eventually elaborating on it. Mad props for the idea, even if the end result was convoluted. For that alone, this thing ain’t as bad as Smartphone, let alone worthy of being called the worst Isekai ever made. \\n\\n\r\nObviously, the quest of enduring this embarrassment is not for everyone. Most of its problems are so self evident that not only are several of them displayed by the title and cover art, but people not keen on wasting their time would be doing exactly that by watching this thing. This blend of ambition, degeneracy, laziness, and ineptitude is a beast meant for only the most skilled hate-watchers to slay. Even I barely survived half of what happened past the fifth episode, and I was having a blast early on and towards the end. For the brave few who choose to embark, and the animation buffs willing to give this a shot, grab a party. and/or alter your state of consciousness first. If you genuinely enjoy something like this, let nothing stop you other than some mind-shatteringly awful filler episodes. All others can pretend this show doesn’t exist; you’re missing nothing of value by doing so.",
            "date": "2018-09-22T11:20:00+00:00",
            "helpful_count": 59,
            "mal_id": 289684,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=289684"
        },
        {
            "content": "A popular genre of late, another \"I've been summoned to another world\" Anime begins. This one drops you into the story in progress, but here are the other things you should know about this take on the alternate world going in:\r\n- Harem. Pretty standard for this genre, and this story is no exception.\r\n- Fanservice plus sexual references. Also typical of this genre.\r\n- The protagonist's special power is knowledge via cellphone, IE using the knowledge of technology and historical battle strategies.\r\n- The setting is a slightly magical version of the Bronze Age.\r\nThe drawing is average, and in scenes with large numbers of people they take advantageof mid-level CG. The animation is also mid level. Plot-wise it may have the same general issues many similar anime have in that the protagonist may never really have to struggle, however this plot is far better constructed than \"In Another World with my Smart Phone\" or \"Death March to the Parallel World Rhapsody\". That is to say there is a clear objective the protagonist desires to reach, rather than randomly wandering and gathering females. Whether that holds out as the series progresses will remain to be seen.\\n\\n\r\nWhile I personally don't really care for aggressive fanservice or over the top harems ('pat my head big brother!'), this anime had enough going for it that if you are a fan of the genre this is one of the better recent options.",
            "date": "2018-07-28T11:43:00+00:00",
            "helpful_count": 47,
            "mal_id": 285000,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5950332.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PhoenixKola",
                "username": "PhoenixKola"
            },
            "url": "https://myanimelist.net/reviews.php?id=285000"
        },
        {
            "content": "Isekai... The term in anime that I really want to avoid due to some anime being isekai and trash as well.. But I can't help reviewing this trash of an anime because I was also one of the few who reviewed a similar anime last year.. And coincidentally that anime aired in summer season of anime as well. Now, I don't have a grudge on all isekai anime (as you may know I love Overlord and Log Horizon), but this type of Isekai where the protagonist are just so generic along with his harem is just... bad. And this anime just transcended from the badone to a worst one. \\n\\n\r\nStory:\\n\r\nThe story is simple to summarize. Guy named Yuuto got transported into a fantasy world filled with Norse mythology. Along him is his trusty sidekick named \"Smartphone\" where on the first episode, we were slammed already by him being the most important character in the world not even showing us how he did it or some sort. There we saw him winning and winning wars with other clans with his harem that is op which he collected by pokeballs, oh I mean which he collected by his \"great\" leadership or \"handsome\" face. Ever wonder how he wins wars? By searching through the internet by his smartphone! Of course there is a WiFi connection in the distant past. Very good story am I right? Along with wars we saw him getting harassed by his Pokemons by means of seducing him but at least he is loyal to his friend in the real world which he can actually talk to even tho he is on the other world already.  Master Of Ragnarok And The Blesser Of Einherjar is a great anime for those who love those silly cliche types of things on a story. But as for me, it is not. \\n\\n\r\nCharacters:\\n\r\nIf the protagonist sounds bad to you, well the others are as well, especially the girls. Looking at the MC,  throughout the episodes I can only sense that... his a good person and thats it.. Development on his traits was not at all present or should I say character development is not at all present in my eyes. We know he is a teenage high schooler but still that doesn't state what he really is or his other traits are. Is he a psychopath that will kill anyone by his own hands? Is he someone willing to sacrifice his own smartphone in exchange to another girl? Maybe he is. And throughout the series we just see him gaining more and more girls even though it is so unnecessary already. Speaking of the girls, they are your typical harem anime girls that their attention is always on the lame MC and always praising how good, caring and great of a person he is.\\n\\n\r\nArt:\\n\r\nIf you are talking about great anime, meaning the anime have a ton of eye-catching visuals either from funny scenes, jam-packed actions or the environment. Ragnarok (or shall I call it MORBOE?), however, fails to please my eyes. Instead it gave me sore eyes with amateur art styles and low budget action scenes of medieval soldiers and horses fighting and stuffs. It was like looking into a 9 year old's coloring book. Not to mention for some reason the ecchi scenes are not really turning me on. Maybe because the eyes of the characters are too much of an anime eye or maybe almost all the girls have little-girl like figures. The opening is not that pleasing for me both visually and musically as well as the ending being topped off with the girls being naked to satisfy your ecchi needs... if you like this anime.\\n\\n\r\nSound:\\n\r\nEvery anime fan have a playlists of anime openings or endings. Even include the OST's (background music) of the anime. Sadly, no music will go to my playlist from this anime. My taste of anime music doesn't fit the opening as well as the ending. Background musics are ehh.. I don't even bother anymore\\n\\n\r\nOverall thoughts and Enjoyment:\\n\r\nIn conclusion, Master Of Ragnarok and The Blesser Of Einherjar is an anime for those who love isekai trash anime like In Another World With My Smartphone. Heck this is way worse than the smartphone anime so if you like this type of stuffs, I recommend you to join Yuuto's quest on getting more Pokemon girls.\\n",
            "date": "2018-09-22T10:38:00+00:00",
            "helpful_count": 36,
            "mal_id": 289682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=289682"
        },
        {
            "content": "Hayao Miyazaki once said: \"Anime was a mistake.\"\r\nAnd yet in 2018, we have 2 series that stand out much: Winter's Mahou Shoujo Site and this season's abominable, unwatchable, god-damn mess of an isekai-harem, I proudly present to you...Hyakuren no Haou to Seiyaku no Valkyria, or what I'd like to call: The Master of Ragna-\"Rock Bottom\" & \"Teenage-Loli Harems AF\" of Einherjar. And not even the Anime Pope (Mother's Basement) has the quintessential formula to save you from the endless frustration of the amount of quirks that this show has going for.\r\n\"This anime is a lot of nothing, BUT a whole lot of nothing.\" - GeoffThew, professional shitbag, signing out from my Mother's Basement.\\n\\n\r\nI thought that Isekai Smartphone from the same season last year and Winter's Death March were unimpressive, unimaginative and best of all, boring as molasses...but this shitshow made EVERY mediocre isekai-harem anime-adapted series (be it LN or manga) before this look like winning formulas in my book (and rightfully yours too).\\n\\n\r\nError No. 1: Story is mind-numbingly conceived out of some tried-and-true references that is uncanningly cringeworthy.\\n\r\nWhat to expect from the fantasy-LN source that was made in 2013, just when the Isekai genre has already been saturated enough? Make some more I guess! That was the nail in the coffin of Seiichi Takayama's absolute failure to come up with something that what is already considered a cash cow and a safety net, and his creativity really is off the charts. Not to mention that at the time before the anime adaptation, this series has 15 volumes (and counting) when the anime adaptation was announced in early March this year! And the financier backing this up? Yup, you guessed it, it's not Japan, it's China (with video platform bilibili's help)! Oh good God, why???\\n\\n\r\nYou want the story? Heck and hell, I'll just summarize here:\\n\r\n- Random guy by the name of Suuou Yuuto takes selfie, got Isekai-ed by a cursed mirror into Yggdrasil (where most isekai stories already established that long, long time ago BUT better executed) where clans have an all-out battle to see who reigns supreme...\\n\\n\r\n- Surprise, surprise! Along with him comes a god-damn solar-powered Smartphone! And thank God Isekai Smartphone's execution is heaps better than this (but still not good) since Natsuko Takahashi, the series composer for both series, came back to hem this job. And honestly, after her work on the fabulous Ore Monogatari in 2015, the majority of the remainders are just plain shovel-ware, and this is no different.\\n\\n\r\n- Deal breaker No. 1: Searching on Wikipedia for war tactics in Yggdrasil...how blatant is this? As if the clan he is responsible in only benefits on the knowledge of the technology, NOT the human! Yuuto has none of it all, he just has the technology-powered Norse mythology going for him while everyone calls him \"Father / Big Brother\" since he's the patriarch...it's a \"cheat\" he says, but I'm not buying that fact at all, and that's that is going for our dear god-awful MC.\\n\\n\r\n- Deal breaker No. 2: All the teenage and loli girls beside \"The Master of Ragna-\"Rock Bottom\"? Other than being used for battle (that's why they are called Einherjars, masters and blessers of unique abilities), they can do one more thing: Harass and caress the male MC for reasons our human minds can conceive why, but for what purpose...?\\n\\n\r\nThe story and setting are both incredibly bad to the point that I can sleep when the episode starts and wake up at the ED song! Simply, just great. Not to mention that Kousuke Kobayashi, the (not 2nd but toxic upgraded) 3rd-rate director behind last season's obnoxious short Alice to Alice, hasn't learned his lesson much, and the production staff under him already gave up trying a lot here. I know the harsh anime industry where are budget limitations, but this show really scrapes that line a whole lot.\\n\\n\r\nError No. 2: Characters (not the VAs), aside from their \"unique\" traits, are nothing short of mediocrity, the bottom of the barrel. \\n\r\nSuou Yuuto...generic as he is, he has the goody-two-shoes feel, until some people have to wake up his ideas and be firm, he did. Problem is, he cannot be straight, and always has to compromise to please everyone. Oh, come on! You can do a better job...right? And your unimpressive denseness is a legit pointing-finger major crisis!\\n\\n\r\nThe Einherjar maidens (Felicia, Siegrune, Linnea, Ingrid, the 2 loli sisters) and even his OWN sister Mitsuki...wow are they a sight to behold! Nah, just kidding, who can I kid when majority of them \"set their aims\" at Yuuto while he flusters with the little sense that he has. Not to mention that their sole purpose is to battle, and while at it, fight for \"supremacy\" to be the right-hand \"embracing\" man of Yuuto. \\n\\n\r\nYuuto's opposition (with the de-facto clans with the blonde he calls \"Bro\" and Steinphor) is hands-down the ONLY part that is decent, as they have balls to show off their power and at least be competent somewhat. I presume at least this area, the production staff tried at least a teeny-weeny effort for them to stand out, and they did, albeit for their screen-time moments.\\n\\n\r\nError No. 3: Art and animation sucks balls...HARD enough to crash and burn.\\n\r\nEMT Squared is a newcomer studio, but that doesn't mean that you have ALL authority to give them this project to handle...and it shows and reflects very badly from start to end. Action sequences are off with the wrong camera focuses and the many stills; character designs are super-off and deformed in terms of body and faces (especially one-sided faces where the designers super-cheaped-out and cut out on drawing 1 eye instead of both), not to mention the stale background art and obsolete animation quality.\\n\\n\r\nError No. 4: Forget about the music aesthetics, they are the worst in terms of representation.\\n\r\nI absolutely despise the sound choices done here, nothing here is ever noteworthy, so don't get me started...except I'm doing that now. The OST is horrible, sound effects at the level of LOLs and hilariously-unfunny bad placements.\\n\\n\r\nWe all never once thought there could be any other anime that will be scraping the bottom of the barrel, but this anime proved us wrong. Bland. boring, cliché, flat, tiresome, you name it, this anime has it all. Whatever it is, this anime is an outright waste-barrel of an excuse of time, talents and effort, and should be shunned and abstained at all costs.",
            "date": "2018-09-22T10:32:00+00:00",
            "helpful_count": 29,
            "mal_id": 289679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289679"
        },
        {
            "content": "The Master of Ragnarok & Blesser of Einherjar or as I like to call it The Master of Rock Bottom is garbage. This is what happens when a studio named Em2 copies and pastes the world most uninspired Iseaki anime (In Another World With My Smartphone). With writing, direction and production so bad it makes shows like Black Clover and Darling in the Franxx look competent. The Master of Ragnarok & Blesser of Einherjar is empty filled of nothingness that can't even respect its own target audience correctly. The show itself is horrendously written crap in the very beginning with numerous red flags popping up overthe course of it that would quickly lead to series killing problems.\\n\\n\r\nNow with that said let's begin with the broken mess.\\n\\n\r\nStory.\\n\r\nYuuto Suoh is a normal high school student who is knowledgeable about urban legends. In order to prove one of these legends, he and his childhood friend Mitsuki Shimoya visit a local shrine nearby. However, while using his smartphone to take a picture of himself next to the shrine's divine mirror, he finds himself mysteriously transported to another world called Yggdrasil.\\n\r\nThis new world he arrives in is heavily steeped in Norse mythology. He also finds that many people fight each other over land domination. Yuuto is later taken in by the so-called Wolf Clan, a group of people with weak military tactics. Using the knowledge of military tactics he gained from school and his smartphone, he gradually makes the Wolf Clan rise to prominence. In turn, he also gains the affection of a group of magic-wielding warrior maidens known as the Einherjar.\\n\r\nAm just going to say this right now the story is a complete dumpster fire.\\n\r\nRight out the gate, this show makes a horrendous first impression where the show starts off with our protagonist already in the fantasy world for two years. We the viewer barely know jack shit about protagonist time from the last 2 years minus that terrible backstory that shows us how he got transported in the word.\\n\r\nThe Master Of Rock Bottom is a horrendously written harem disguised as Iseaki anime that follows every single generic story elements that we all seen before from this genre. male protagonist gets send to the generic fantasy land by accident. A bunch of girls from all types of fetishes and tropes come up to surround the main protagonist cock forming a harem in the process. The main protagonist becomes the strongest person in a set country by dethroning every single competent faction with no issues whatsoever.\\n\r\nHonestly, if you have seen In Another World With My Smartphone as well any other bad Isekai anime then you seen The Master Of Rock Bottom because not only it took everything that was wrong about those bad Isekai anime but this show somehow manages to make they worse to a point where it actually becomes downright insufferable to watch as you constantly shoving its true intentions right down our fucking throats.\\n\r\nOverall the story in The Master of Rock Bottom is absolutely rotten garbage. \\n\r\n0.5/10\\n\\n\r\nChararters. \\n\r\nIt's honestly hard to call the chararters in The Master of Rock Bottom actual characters because every single and I mean every single character are a bunch of trophy pandering husks as they all only exist to please a certain type of audience not much beyond that.\\n\r\nOur main protagonist Yuuto is a generic and uninspired husk who barely has the capable of being an actual protagonist. His motivation is paper fin as we know jack shit about his earth life and his personality as an interesting as a potato.\\n\r\nThe female characters aka Yuuto fetish harem are somehow even worse. Every single female character in this show only has a single character trait and not much beyond that.\\n\r\nThe same thing can apply for side characters and villains.\\n\r\nOverall the characters are complete abominations.\\n\r\n1/10\\n\\n\r\nVisuals.\\n\r\nSaying that The Master Of Rock Bottom looks like garbage is a fast understatement. This is by far the absolute worst looking show I have ever experience from this decade. Black Clover, Beatless and Darling in the Franxx my have horrible production values but least tired to good every now and then this rabbit hole show doesn't even give a damm about looking good. The character designs all atrocious bad as all ugly to look at as they every single character look like they came from DeviantArt in the year 2001. Not to mention all of the female characters are oversexualized to the core meaning throughout this show you will see lolis doing sexual acts left and right.\\n\r\nThe actual animation is hot garbage. Choppy movement left and right, horrendous fight choreography, abysmal use of CGI for the horses and soldiers. Budget cuts everywhere mixed with the shameful use of stock footage.\\n\\n\r\nNow if you the show actual animation was horrendous the opening visuals are somehow even worse. It's is a normally for the anime industry to have opening visuals that look good in order to draw the viewer in but The Master of Rock Bottom can't even do that. Not only do the characters in the opening visuals constantly go off model but the way that the show was directed visually gives me an eyesore. The camerawork is almost as bad as Bubsy 3D on the PlayStation 1 and the way that the show showcased fight scenes in the opening was pure nonsense. How can a hammer red dude be able to move with the hammer like a freaking sword? I understand that training exists but at the same time but how can he be able to block fast sword attacks from that sword chick. In both real life and video games heavy weapons while despite being doing more damage to the foe has a pretty long reaction time cool time thanks to that weight of the hammer facing towards a certain leaving you wide open in the process for enemy fire while you're trying to control the weight of the set heavy weapon.\\n\r\nTo add insult to injury in episode 11 the red dude is was able to spin the heavyweight hammer like a fucking shield without getting tried. That's not how hammers work...\\n\r\nOverall like with this story and characters the visuals are a complete dumpster fire.\\n\r\n0/10\\n\\n\r\nSound.\\n\r\nJust like with most bad Isekai anime that came before it, it's generic and boring Isekai music that we all see before. The same thing applies to both the opening and ending themes which they are uninspired as hell that is filled with crappy imagery.\\n\r\nWhile the soundtrack is generic the sound effects are downright horrible as they sound they just came straight from Berserk 2016. \\n\r\nNow we get to the best part of the more like the final nail of the coffin being the voice acting for both the sub and dub.\\n\r\nThe sub version is filled with boring and shitty performances where it feels like they are reading the show's script. I honestly feel bad for the Seiyus who had to voice characters in this scrapheap of an anime. Now if you thought the sub version was bad the dub version is somehow even worse. Not only the audio quality was abysmal beyond belief but the every single voice actor in the show sound like they were they were doing a fucking hentai production.\\n\r\n2/10\\n\\n\r\nFinal Thoughts.\\n\r\nThis anime is a prime example of why I hate Isekai anime so much. It is a giant eyesore that makes Darling in the Franxx and Black Clover look like they were done by Hideaki Anno. The story, characters, voice acting, music, and the production values are absolutely horrendous beyond belief.\\n\\n\r\nIn my review of How to Not Summon a Demon Lord, I mentioned that I hated the Isekai genre as a whole and that show made hate despise the Isekai genre even more. Now after watching this rabbit hole of a show I officially lost all respect for Isekai genre as a whole to a point where I never want to touch an another modern Iseaki anime again.\\n\r\nScrew this show and screw everything that this anime stands for.\\n\r\nFinal Score 0.5/10.",
            "date": "2018-09-22T11:52:00+00:00",
            "helpful_count": 26,
            "mal_id": 289690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 0,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=289690"
        },
        {
            "content": "I'm putting about as much effort in this review as was put into the anime.\r\nPros:\r\n- OP isn't Slide Ride. \r\n- Smartphone usage is much better than in Isekai wa Smartphone to Tomo ni\r\n- Basic attempt at introducing battle tactics.\r\n- MC actually has a goal beyond just fucking around. \r\n- Ucchi OP \r\nCons:\r\n- The development of the phalanx is wrongly attributed to Alexander the Great and Oda Nobunaga (??????)\r\n- Most of the female cast are the MC's adopted sisters. Naturally, all of them want to bang him. \r\n- Awkward CG\r\n- Tactics only work because everyone else is brain dead. \r\n- \"Oni-sama\" is abused to a muchgreater degree than Mahouka. \\n\r\n- Based on Norse Mythology my ass. \\n\r\n- The katana being the most powerful sword in the world. \\n\r\n- One-dimensional characters. \\n\r\n- Stilted animation and direction. \\n\r\n- Poorly defined world. \\n\r\n- MC just happens to be the most compassionate, smart and charismatic guy around.",
            "date": "2018-08-01T13:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 285315,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760717.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/IllegalSpaceman",
                "username": "IllegalSpaceman"
            },
            "url": "https://myanimelist.net/reviews.php?id=285315"
        },
        {
            "content": "You would think the show would start off from showing how the protagonist works up his way to gain a harem. At least a mediocre harem anime. But no, they went even further, they went beyond the scope of a mediocre harem anime , they went to deepest part of the dumpster and stayed there.\r\nYou would expect it be like Date a Live! at least, but no, dude starts out with op characters. aka, LEGENDARYS, LVL 12 SYNCHRO SUMMONS, GOD DAMN ADD IN EXODIA EQUIPPED WITH THANOS GLOVE TOO BC WHY NOT, is basically how the creators made this anime. \r\nIn all. It just sucks.The main character started off way too op. \\n\r\nThe anime is even milking the smartphone thing. Only redeeming thing about the anime is the mild good waifus. Not on the level with Rem or Zero Two, but at least they got buubs and bootys.",
            "date": "2018-07-28T15:12:00+00:00",
            "helpful_count": 10,
            "mal_id": 285015,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061150.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LoliHitler",
                "username": "LoliHitler"
            },
            "url": "https://myanimelist.net/reviews.php?id=285015"
        },
        {
            "content": "Well everyone seems to hate this anime but all in all it's not that bad.\r\n It has a good protagonist that is not overpowered but actually puts effort in accomplishing things  , good enough art work and it is not based on a game fantasy world like Sword Art Online, Overlord and frankly about a million others!!\r\n I don't have anything against those, in truth I find them quite enjoyable but it is good to have something different once in a while. So to tell the truth I do not understand what everybody has against this anime. \r\n The ending feels very rushed though.",
            "date": "2018-10-10T11:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 291414,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7442625.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KathrineWhite",
                "username": "KathrineWhite"
            },
            "url": "https://myanimelist.net/reviews.php?id=291414"
        },
        {
            "content": "“I don’t think there’s a isekai worst than Sword Art Online”\r\nWriter of MORBE: Hold my beer!\u2028\r\nI’m happy to announce to everyone who thought SAO was the worst isekai ever, that The Master of Ragnarok & Blesser of Einherjar (MORBE) has claimed that title. I have full confidence in saying that The Master of Ragnarok & Blesser of Einherjar is the worst isekai of all time. If someone made a list of everything wrong with a isekai light novel translated to an anime adaption then this would tick every box, that’s how laughably bad it is. \r\nStory- (1/10):\r\n\u2028This anime is very unique in its premise. Usuallyit starts with the protagonist getting inexplicably transported to a fantasy world, but this doesn’t even bother to start with that because who wants to see that again, amirte?! Your next thoughts are probably “we’ll get a proper introduction later on”, but NOPE it  doesn’t go back to explain it either!\\n\r\nWhen we’re introduced to the protagonist, he’s already been in this world for two years, so it’s like this doesn't classify as an Isekai.\\n\\n\r\nThere’s a ton of questions we’ll likely never know the answer to, for example:\\n\r\n- How the protagonist got transported to this world \\n\r\n- What are the rules and intricacies that governs this world e.g. Why are their different clans? what they fighting for?\\n\r\nWhat’s more hilarious is the first episode attempts to cover this through exposition to explain how our protagonist got to his position of power, but it doesn’t explain shit. It just glosses over all the information and important details  \\n\\n\r\nWhat a masterful deconstruction of an isekai anime! It has to be that or lazy writing which is why the story is so shallow and generic.\\n\r\nSeriously, the plot goes nowhere. The protagonist’s goal is to get back to his time period, but not really since he’s done nothing towards this \\n\\n\r\nCharacters- (1/10):\\n\r\nOur protagonist is named Yuuto: a dense, self- insert harem protagonist who’s perfect in every way! He’s handsome, the leader of the Wolf Clan, adored by his devoted subjects, a military genius, the most morally just, and more importantly he has a harem of bitches at his beck and call! What more can you ask for in a MC?!\\n\\n\r\nHonestly, Yuuto’s incredibly bland and severely lacking in character traits that i can’t even fathom why these girls swoon over him. They try to mention Yuuto’s flaw of being overconfident in the past which is why he’s frustrated and calls the red haired musclehead general a ‘baka’ all the time, but here’s the best part- we never see it! We never see Yuuto’s first experience coming into this world so we don’t know how naive and reckless he was or how he overcame it and become the humble beam of perfection we’ve come to know. \u2028\u2028\\n\\n\r\nSo what makes Yuuto standout from your usual self-insert harem/Isekai protagonist? Well, Yuuto is unique in the stance that he claims girls as his property, and forces them to bend the knee to be part of his “family.” Yes, this sick perverted bastard makes these poor girls his sisters and daughters, and has them address him as “big brother” and “papa” to fulfill his incestial fantasies.\\n\\n\r\nWhat else makes Yuuto great? Well he has a smartphone, but not just any ordinary one- a solar powered smartphone! Now our protagonist can search the web to look up military tactics from great historical leaders on Wikipedia to implement their strategies in battles, create advanced war technology and improve his clan with future inventions/concepts e.g. schools for education. \\n\\n\r\nSeriously, I don’t rate Yuuto at all because he isn’t exactly intelligent or strong, just a ordinary teenager with a deus ex machina smartphone. There’s nothing compelling about his character. At least Yuuto acknowledges he’s cheating and completely ordinary without it.\\n\\n\r\nLet’s move on to the girls now. They are all so one dimensional, uninteresting, bland and can be described in a single sentence:\\n\\n\r\nFelicia: Yuuto’s right hand girl (i’m shocked how I remember her name). Why does she have this role? I couldn’t tell you. She isn’t exactly intelligent or strong, just diplomatic and good at organising I guess. \\n\\n\r\nThe other girls include: \\n\r\nPink haired horn clan imouto\\n\r\nAssassin Twins: one being a airhead and the other being a smartass\\n\r\nGrey haired, devoted swordsman girl  \\n\r\nSlave child girl who calls Yuuto “papa”\\n\r\nTomboy blacksmith girl  \\n\\n\r\nThat’s literally all there is to them. \\n\\n\r\nOh, let’s not forget Yuuto’s girl back home who isn’t actually his gf, but the childhood friend he loves and wants to return to. It’s such a poetic tale of how Yuuto has a harem of girls on his dick, but yet he’s still dreaming and fantasising about his unreachable girl that he’ll probably never see again xD\\n\\n\r\nAnother character is Felicia‘s brother. He’s a butthurt teen because their father picked Yuuto over him as his successor to the wolf clan, so he leaves to join another clan to seek revenge. He’s depicted as someone to rival Yuuto, but truly he stood no change against our lord and saviour! Felicia loves her “brother” Yuuto more than her real brother. Why does Felicia have such devotion to Yuuto over her real brother? No real reason. We don’t get to see how their relationship progressed and got so close.\\n\\n\r\nSeriously, can someone break Yuuto’s smartphone already? I’m tired of seeing his irrelevant 5 min conversations every episode with the girl he likes. The conversations are always meaningless shit like a summary of how Yuuto’s day went. Mitsuki is so one dimensional it hurts. She has no depth, no screentime or relevancy to the actual story, so every time they talk I lose any immersion i have in this world. We don’t even see Yuuto and the girl’s relationship before he got transported into this world, hence why it’s so shallow and underdeveloped that I can’t be invested in them whatsoever. \\n\\n\r\nAnimation- (1/10):\\n\r\nThe animation’s trash. The CGI during fight scenes doesn’t even look like fights since the characters don’t even look like they’re hitting each other. There’s a lot of terribly animated still frames too. The battlefields, soldiers uniform and battle strategies aren’t detailed enough, there’s not enough focus on the troops to make it feel like they are at war. Plus, you can’t tell what strategies are being used properly due to the animation.\\n\\n\r\nSound- (1/10):\\n\r\nI can’t even remember the osts because I was too entranced in watching this masterpiece. Seriously, the OP, osts and endings are forgettable.\\n\\n\r\nEnjoyment- (1/10):\\n\r\nI must be a masochist for pain because I hate this show with a burning passion, and regret every minute I spent watching this anime.  \\n\\n\r\nOverall- (1/10);\\n\r\nThe plot has gone nowhere thus far, the characters are painfully bland and annoying, we can’t get a semblance of plot progression without there being eechi fanservice scenes every 5 mins with girls pressing their boobs on Yuuto or literally taking off all their clothes and throwing themselves at him (I kid you not, this actually happened). I forced myself to watch this hoping for one redeemable quality, but I got nothing. The only reason I could recommend watching this is for the sole purpose of fapping to some soft incest hentai, or you’re watching to find out why it’s so bad and received negative reviews. Either way, it’s really not worth it.\\n\\n\r\nPS: Can anyone point me towards where I can watch the prequel? Because it’s as if we’re missing a season’s worth of source material on Yuuto’s life with his childhood friend, the introduction of when he was transported into this world and his rise to power as the Wolf Clan’s leader in those 2 years. This anime had a couple of cool ideas e.g. the setting, the different clans etc, but the lack of content and poor execution destroyed any semblance of potential this might have had.",
            "date": "2018-08-28T14:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 287644,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=287644"
        },
        {
            "content": "Dreadful....\r\nAbsolutely dreadful\r\nI'm not sure where to even begin...I'm someone who loves this genre...I'll go as far as to even enjoy the isekai smart phone anime even if it's to just laugh at how terrible it is. But this anime is different.\r\nFirstly we start off when the mc on the battle field. How did he get there? Idk. Why was he there? Idk. Unlike most isekais this anime starts off with the mc already in a different world. We have no idea how he got there, why he was there or why the mc is at the position that he is currently in(the anime tries toexplain it later on but does a poor job at it...)\\n\\n\r\nI'd write more about this but I'd be wasting my time. I'll just give you my advice...dont waste your time....trust me it's not worth it. The fan service is alright for the series but like there are other anime that have better fan service. You shouldnt waste your time with something like this. The anime will bore you to death plus the world build is horrible. What makes isekai anime entertaining is the fact that we can see the world in the eyes of a character who is foreign to the world. Without proper world building no matter how many lolis and \"oppai\" you put into the series it will suck...and not in a good way. I cant even cringe watch this show smh...",
            "date": "2018-07-28T15:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 285014,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141186.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Aesthetic-",
                "username": "Aesthetic-"
            },
            "url": "https://myanimelist.net/reviews.php?id=285014"
        },
        {
            "content": "\"Those who are stupid are unaware of their own mistakes.\"\r\n-ZARC, from Yu-Gi-Oh! Arc-V\r\nSummer 2018 brought in some amazing shows like Isekai Maou, Cells At Work, Angels of Death, Overlord III, Revue Starlight, Banana Fish, SNK III, etc. However, it has had its equal share of mediocre to absolutely wasteful shows.\r\nI really don’t think I need to make a long ass essay about how overused the isekai genre is in the recent years...that’s someone else’s job, honestly.\r\nWhen people were saying Isekai Smartphone might have a second season, it's funny that this series came around not too long after. You know what? Here's this:\r\nSome anonymous dude: \"IsekaiSmartphone is the worst isekai series EVER.\"\\n\r\nThis series: \"HOLD MY GOD DAMN TEQUILA!\"\\n\\n\r\nThis series pretty much does just about EVERYTHING wrong...not just as an isekai series, but as an anime show, in general. Even Ousama Game wasn't this stupid, cause at least that trash show had \"reasonable\" enjoyment value.\\n\\n\r\n(some mild spoilers, btw)\\n\\n\r\nSTORY: 1/10\\n\r\nOkay, first off....why the actual hell do you start us off with our main guy already in the other world, and not only that, already in the middle of a battle?? Essentially we got no good siege-way for how the mc enters this Norse-inspired fantasy world called Yggdrasil. Apparently according to the LN, our dude basically took a selfie through his damn smartphone (which he later is SOMEHOW able to use in the fantasy world cause it's f***ing solar-powered), and gets zapped into this conundrum, and is somehow okay with it\\n\r\nThe world-building is practically non-existent, and any explanations for certain points and aspects are scarce. Because of that, the core storyline is dull as hell...it doesn't deserve the description of \"generic\".\\n\r\nUnlike with Isekai Maou, this story doesn't handle the harem element very well. I can't be the only one uncomfortable with how the MC and his slowly growing harem address each other as family, right? Onii-san?? Aniki?? Father?? Regardless of what deep explanation I may get regarding this, it's just revolting, like an excuse for the guy to not bang the f*** out of any of the girls. I mean, at least he does choose someone at the end, but that childhood friend don't even deserve to be the one, let's be f***ing real, here.\\n\r\nThe battles are not even enjoyable....they're awful. The so-called strategies during those clashes aren't even something worth raising your eyebrows at. I mean, the guy cheats off his damn phone, ffs!! \\n\\n\r\nANIMATION AND SOUND: 1/10\\n\r\nWell how unfortunate....not even the soundtracks and the animation were any sort of \"saving grace\". None of the soundtracks are memorable, and honestly often very offputting. Personally, I love music, but I can be very distinct with my preferences of certain soundtracks and songs despite having  a diverse taste. When a series can't even make its music score half-decent, it's literally game over in my eyes.\\n\r\nThe animation is honestly not the worst example I've seen, but it's still hella bad. Apparently the animation crew were either too lazy and/or heavily unmotivated. I'm just gonna stop there for that part.\\n\\n\r\nCHARACTERS: 1/10\\n\r\nUgh. Boring MC. Boring harem \"squad\". Boring \"childhood friend\". Boring side characters, too. Not even the god damn hot-blooded overpowered dude was good...I personally got sick of this dude's battle cries and pointless mid-battle chit-chats. The childhood friend, who got picked at the end, btw...is a previously pointless character who suddenly becomes relevant due to the aforementioned situation, which doesn't make any sense because she doesn't even spend even half as much time with the MC (even through phone calls....YES, somehow you can make phone calls between the real world and the fantasy world in this show, like WTF). So the harem our guy created became pointless, too.\\n\r\nI'm just saying, and for real...if this idiot won't have orgasm with any of our now-friendzoned Norse girls, they could've just went the yuri route with each other and the show would be easily half-decent.\\n\\n\r\nENJOYMENT: 1/10\\n\r\nI know I'm supposed to enjoy watching anime no matter what, and grade my stuff depending on how I felt about certain shows, especially in the character and enjoyment department. But with this series, watching it felt like that one household chore you absolutely despise doing, even though your mom and/or dad set a shitty ultimatum. Need I say how unenjoyable it was? Not gonna lie....half the time I was watching almost every episode, EXCEPT during the sexual advances by the girls (which were actually kinda amusing)....I'd be nearly dozing off or unconsciously reaching for my OWN smartphone to pay Tetris or send PMs. Why didn't I drop this series, you ask? Research reasons, simply put....basically information I can use in the future, should I become a writer or even be in the anime department one day...on what NOT to do when writing a story or adapting a series.\\n\\n\r\nFINAL WORD: For the sake of your damn lives, people.....\\n\r\nDON'T. F***ING. WATCH. IT.\\n\r\nIf you want actual decent or good isekai series, watch the likes of Re:Zero, Isekai Maou, No Game No Life, or Overlord instead. Even Sword Art Online, which is technically an isekai series in a way, is a masterpiece compared to THIS mess right here. As for me, while I did get helpful data (LMAO), I might be contemplating one day in the near future as to why I didn't drop it back then, and then probably break down and cry in deep regret, perhaps...LOL.\\n\\n\r\nY'all been warned, my fellow anime fans...",
            "date": "2018-09-22T15:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 289711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=289711"
        },
        {
            "content": "This show shouldn't be taken seriously. I saw many that gave this series a 1 out of pure hatred.  In my case however, I found amusement from this show.  While this show did a horrible job with its story and characters that cannot be fixed with Flex Tape, I had fun because of its poor quality.  \r\nIt was amusing to see how bad some of the actions scenes were and how pathetic some of the \"heart warming\" scenes were.  I was also pleased that they actually wrapped up the story.\r\nI give this series a 4 based on my enjoyment of theshow.  Please continue to read to see a more detailed review.\\n\\n\r\nStory:\\n\r\nThe story was bland.  It's about a guy who got sucked into a magical past where people are given titles based on names from Norse mythology.  The story shows our main character, Suoo Yuuto winning wars using his smartphone to look up war tactics to beat his foes.  The other half of the show is him being fawned by his \"sisters\" and \"daughters\" who have sworn allegiance to him and love him unconditionally. \\n\\n\r\nHowever, this anime did get a proper ending unlike other Isekai anime that just leaves you behind and Yuuto did pick a girl.\\n\\n\r\nArt:\\n\r\nDon't expect anything too much.  Colors and character designs are flat.  It is obvious that the studio didn't really give any care to this series.  Animation is minimal and usually depends on still pictures for battle scenes.  But even these still pictures are horribly drawn and laughable.\\n\\n\r\nSound:\\n\r\nI can't remember any of the OST that played in the show.  There are some cases where the volume of the music is raised and lowered based on the tension of the show.  By the way, there is no tension.  \\n\\n\r\nCharacter:\\n\r\nTo be frank, the characters are just a bunch of tropes.  Nothing that makes them too unique.  \\n\\n\r\nYuuto is the perfect selfless guy that has no defense against women.  His \"sisters\" and \"daughters\" love him because he is smart and kind.  The reason he rehects them is because he likes his childhood friend, which to be fair is something we haven't seen in a long time.\\n\\n\r\nDefining each \"sister\" or \"daughter\" is pointless.  Every single of one of them wants his dick.  They each represent a trope: the erotic sister, the cool beauty, the imouto, the tomboy, and the three lolis. Most of them have little to no purpose in the story and are just there to state how great our main protagonist is.",
            "date": "2018-09-22T14:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 289707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317017.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mottowers",
                "username": "mottowers"
            },
            "url": "https://myanimelist.net/reviews.php?id=289707"
        },
        {
            "content": "I've never seen something so disgustingly bad, and that's coming from someone that somewhat enjoyed the other isekai anime this season. For starters, I'm not a huge fan of harems or fan service, but I can look past both if the story is good and the show has some substance. Sadly this does not, it's so incredibly boring and EXTREMELY awkward. The MC just comes across as some sick disgusting pervert, making anyone he defeats submit to him and either become his \"child\" or \"sister.\" I would literally rather watch paint dry than watch another second of this crap. \r\nLet me serve as an examplefor you, don't waste your time with this crap.",
            "date": "2018-08-12T01:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 286256,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DashieXCVII",
                "username": "DashieXCVII"
            },
            "url": "https://myanimelist.net/reviews.php?id=286256"
        },
        {
            "content": "I've seen my fair share of \"bad\" Isekai anime and found varying levels of enjoyment from them despite. BUT, this Isekai anime is appalling--it takes the cake for most painful Isekai anime to watch. \r\nTo begin, this anime begins without a proper introduction and NEVER goes back to explain either. In fact, you must watch the opening song if you want to get even a hint of what occurs before episode 1. Its very confusing and the anime does nothing so far (as of episode 4) to properly explain the rules and intricacies of the world or how the protagonist got to where he is.\\n\r\nEverything that happens is just an excuse for the Protagonist to add to his harem to which he, of course, has no interest in because he cares more for some bland childhood friend girl that is not even around. \\n\r\nThere is absolutely no depth to the story or the characters. Everything is straightforward to a fault. As mentioned, everything is just about having some cute girls in an almost taboo type harem. \\n\\n\r\nThis is an anime I was ready to drop before even finishing episode 1. And I probably should have, because the absolutely poor quality remains the same throughout. I say this as someone who has enjoyed some \"terrible\" Isekai animes. Don't waste your time with this anime. \\n",
            "date": "2018-07-31T17:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 285259,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510775.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/NixKaen",
                "username": "NixKaen"
            },
            "url": "https://myanimelist.net/reviews.php?id=285259"
        },
        {
            "content": "This anime has been on my radar mostly because I kept coming back to the page to read the funny reviews about how bad it is, and I finally decided to watch it and write my own review.\r\nThis anime is bad. I think I have pretty low standards when it comes to anime, my average rating for all the anime I've logged on this website is an 8/10, but even after seeing the score for this and reading a lot of the reviews, this anime managed to limbo below my already low expectations, and then kick me in the shins for expecting more from it.\r\nAnormal plot follows the path of exposition, rising action, climax, falling action, then resolution. The episodes don't follow this at all. Just considering the first episode, the plot went from climax to exposition to falling action then to rising action. It also doesn't help that the action scenes are tepid at best, and feel very short and rushed considering how major the consequences of the battles are supposed to be.\\n\\n\r\nAll the main characters the same generic anime faces, and the characters are so flat (with the exception of their tits) that hentai characters have more depth, and at least with hentai you'd see people fuck instead of this where the mc is one of those people who are probably afraid of kissing.\\n\\n\r\nThe second episode mentions that this is taking place two years after the mc came to this world, which to me just seems like an excuse so the writers don't have to write the probably more interesting story of what happened when he first landed in this world and why the girls already by his side like him. Probably because they can't think of a reason why the girls like him.\\n\\n\r\nI don't think I've ever watched an anime where I've yelled 'what the fuck' and 'what is this shit' more times than this one.\\n\\n\r\nNow that I think about it, the four sentence synopsis on this website explains more of the backstory than the first few episodes of the anime, and if I haven't read it then I would be completely lost.\\n\\n\r\nI almost wish that this anime was worse than it is, because at least then it'd be so bad it's entertaining, like The Room, but no, this is just plain bad. Hell, if you're at least semi-amused from reading this then this review is more entertaining than the anime.\\n\\n\r\nCharacters are bland, story is okay but poorly executed, art is generic, skip this anime.",
            "date": "2018-07-29T12:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 285081,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3191247.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zemphis",
                "username": "Zemphis"
            },
            "url": "https://myanimelist.net/reviews.php?id=285081"
        },
        {
            "content": "Why does this exist? I genuinely believe that the animators and the storywriters got bored and got a monkey high on LSD to copy and paste sections of other LNs to make this travesty. \r\nAnd boy does it copy other LNs liberally. The character is a clone of the guy from 'in another world with a smartphone'. The girls are copied from High School DxD and some of the lore gets thrown about casually too. The monkey took extra pains to make sure this was explained in one episode, but only so that it could confuse the viewer even more. The opponents are clones ofantagonists from 'Campione!'. \\n\\n\r\nThe anime does not even try to follow the plot points to the end. Battles start without us knowing, and end off screen while the MC looks ahead with a constipated expression, moaning on about how he is just a cheat. The girls all 'love' him, but we see little reason why.  Really, they only serve to provide some fanservice. The MC spends a lot of time doing random things in the workshop and building his country, but we don't see the impacts of this. He mentions it once, it magically gets done and then we never hear of it again. \\n\\n\r\nThe one noteworthy plot point is in relation to his girlfriend, which is followed through to the end. Although even here, the plot holes in between are greater than the sum total of their love story. We never get to know why this girl even loves this guy apart from her being his 'childhood friend'. Brilliant. Why bother building an actual relationship?\\n\\n\r\nEven the final battle is skipped. I actually could not believe it. They skipped the final battle to show us a montage of the MC being cheered on by his people. \\n\\n\r\nThis anime is trash. The animation is painfully average; the character design is uninspired and built on stereotypes of other, more popular characters; the plot is weak and nonsensical; the music is cringe-inducing; the dialogue is childish and the entire experience feels meaningless. There is no satisfaction at having followed one person or one clan through some defining struggle or overcoming massive odds or standing for the ideals. The anime never actually tries to make the viewer feel anything other than a vapid sense of the mind blanking out. There is no tragedy, no humour, no romance, nothing at all that can make the viewer interested. The only reason I watched this through to the end is because I have a soft spot for kingdom-building anime, manga or LNs. \\n\\n\r\nBut this isn't it folks. This can legally be defined as an anime because of its origins, but as the bard said it best: To me, it is nothing more than a vacuum in the air.",
            "date": "2018-11-12T08:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 293911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2031767.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sorghaghtani",
                "username": "Sorghaghtani"
            },
            "url": "https://myanimelist.net/reviews.php?id=293911"
        },
        {
            "content": "The Master of Ragnarok & Blesser of Einherjar better known as Hyakuren no Haou to Seiyaku no Valkyria which is another version of a guy who goes to an alternative word and has use his wit in order to survive kind thing, but here the guy survived and for some obnoxious luck thrives and even become the big man in some kingdom know as the wolf clan, which btw was pretty much cliche since it coincides with another anime with a similar theme and you've guess it Isekai Maou to Shokan shoujo no Dorei Majitsu, so pretty much we have two such genres for thisseason alone, though how the characters were set and portrayed were different. Now I don't about you guys, in both scenarios they have females whom were utterly useless, here the maho shoujo was useless since we don't see her do any magical things in fact all that maho shojo does was to flirt around with the male character like a yes man,  there is a bokuko warrior who did even killed the hammer guy, we have a princess who wants to get laid but never got the chance , a boxum blacksmith who serves as added competition for the guy's harem and let's not forget the twin assassins whom were not there when they're needed. The only consolation here was for the guy to finally be with his love of his life and yes she becomes his wife in the alternate world.......Also, this anime was basically a dichotomy where at one point we see the deaths of soldiers dying and yet the hammer guy named Steinthor was only wounded by a katana wielding bokuko  Siegrune, where it would have been nice if he's dead and also seeing the guy going back to the alternate world and dragging someone else with him was basically a disappointment , since the ending would have been nice if the guy come home to his world and leaving Felicia in charge after things were already being set in peace. But it seems that original creator Takayama, Seiichi wants a garndious ending where the guy and his girl becomes royalty in an alternate world , so with nothing more to say , here are my ratings:\\n\\n\r\nStory- Mediocre 5: It has the same genre and theme as that of another anime which was aired in the same season.  \\n\\n\r\nArt-Mediocre 5:  Cu'z everything were just the usual.   \\n\\n\r\nSound- Mediocre 5: The inflections being used were to protary the character's voice were the usual.\\n\\n\r\nCharacter-Pathetic 1: Since the guy  Suou, Yuuto was the quintessential stupid guy who wouldn't go for any of his harem girls, and them girls were seemly useless to begin with, basically they were just a bunch of eye candies.\\n\\n\r\nEnjoyment-Patchetic 1: I really  hated the timing where the guy goes home in the mist of battle and the twins were nowhere to be found in order to kill that which Sigyn that would have guarantee a total victory and where the guy could go home to his world knowing that everything he left behind in the alternate world is in order, if only studio EMT² did that it would have been a good ending. \\n\\n\r\nOverall-Pathetic 1: It was just too much of a run of the mill fantasy and harem genre based anime.  BOOM!!!!! Mic drop.",
            "date": "2018-09-26T09:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 290063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=290063"
        },
        {
            "content": "I originally watched this because it has a ton of 1-star reviews, and I felt like watching something truly horrible and cringe-worthy!\r\nUnfortunately that plan was foiled, because it's not half as bad as people say, just exceptionally mediocre and not really worth anyone's time. I didn't suffer too much watching it, but it's a certainty I won't remember a thing about it a week from now either.\r\nI think it gets all those one star reviews because some people get pissed off by the fact anime studios get away with this level of uninspired mediocrity! But in reality, it's still competently made anime, and deserves asolid 5/10.\\n\\n\r\nIt doesn't deserve your attention though -  there are literally hundreds of better shows out there!\\n\\n\r\nThe Good:\\n\r\nSome of the girls don't follow the standard tropes entirely. They still aren't all that interesting, but sometimes mildly entertaining, and they're more or less likeable too. Yay.\\n\\n\r\nThe Bad:\\n\r\nThey completely failed to do anything remotely interesting with the concept of having a character go back in time and be responsible for the formation of ancient myths.\\n\\n\r\nThe Ugly:\\n\r\nThousands of nameless expendable men get slaughtered without anyone giving a shit. This show really underscores how little value our civilization ascribes to men who aren't \"alpha\".",
            "date": "2018-09-25T07:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 289952,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6024255.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/MikaelX",
                "username": "MikaelX"
            },
            "url": "https://myanimelist.net/reviews.php?id=289952"
        }
    ],
    [
        {
            "content": "This anime is extraordinary!\r\nEven when stacked up against Isekai abominations like Death March and Isekai wa Smartphone, it still somehow manages to be even worse! In fact, this might just be the worst Isekai anime that I’ve seen to date, and considering the generally poor quality of the genre, that’s really saying something. So yes, this anime (whatever the hell its name is) is definitely incredible!\r\nIncredibly bad.\r\nThis anime doesn’t even bother to start with the protagonist getting inexplicably transported to a fantasy world. When we’re introduced to him, he’s already been in another world for two years, so it’s almost like this isn’t even anIsekai anime. Gotta love dat lazy writing! Anyway, our protagonist, named Super Ultra Omnipotent Usurper, or Suou for short, is, you guessed it, a perfect being in every way! He’s the most morally just and relatable character ever, is a military genius, and, most importantly, gets all the bitches! Actually, only the latter is true, but the anime still desperately tries to give him character traits that make him more than just a chick magnet. Too bad they fail miserably. \\n\\n\r\nSuou is a conqueror, plain and simple. Not of nations, but of women. Yet what makes him stand out from his fellow Kirito clones? Well, Suou is unique in that when he claims a girl as his property, he makes her a part of his “family.” Thats right, this guy forces his women to become his little sisters and daughters, and makes them address him as “papa” and “big brother.” What a sick bastard. He also doesn’t seem to give a crap about his soldiers and doesn’t bat an eye when they’re slaughtered in combat. And the best part is that the writers still try to portray him as an “I am holier than thou” type of character. What a guy!\\n\\n\r\nThanks to the solar powered smartphone that Suou just so happens to have (Sigh…I don’t even care anymore), our hero is able to look up military tactics of great historical leaders like Alexander the Great and Sun Tzu and implement them in battles. Of course you really can’t tell what battle strategies are being used during fight scenes due to the hideous visuals that make everything look like an utter mess. There are even some scenes that are repeated several times within the same battle because the animators couldn’t be bothered to actually do their job. \\n\\n\r\nA random red haired dude in this anime wisely said “the details don’t matter.” I think the writers must have taken that sentence to heart. Nothing about this anime makes any sense. The plot thus far has gone nowhere, the characters are painfully bland and annoying, and the show isn’t fun to watch. And if you’re watching this for the sole purpose of beating your meat to sexy 2D anime waifus, don’t. It just isn’t worth it.",
            "date": "2018-07-28T12:43:00+00:00",
            "helpful_count": 189,
            "mal_id": 285004,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813391.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/XHellLyterX",
                "username": "XHellLyterX"
            },
            "url": "https://myanimelist.net/reviews.php?id=285004"
        },
        {
            "content": "I was supposed to get me one of those solar ray powered telephone calling systems that grant the access to a fantasy world filled with countless lady persons, but Amazon had sold them out when my telegraph reached their end. Damn it. \r\nSuou Yuuto is one of those lucky bastards who didn't get ninja'd by scalpers, and now he lives the perfect life as the lawfull harem-bro to these MWWM's. No, it does not stand for my wild waifu maiden, but magic-wielding warrior maiden. Basically, anyone with a female knight fetish could pay decent amounts of money for a device like that. If you happento know where I could get one, leave me a pm (asking for a friend).\\n\\n\r\nOn a less serious note, whateverrandom words Valkyria is an anime series you most likely would not/will not enjoy for the reason that it is a copy-paste of every smartphone self-insert harem. The selling point of these series has always been how bad they are, but the sole amount of worth of nothing series has pushed the standards so high that these days bad series need to be impressively bad for them to be worth of anything. Valkyria does not impress with its lack of quality, and that is its biggest flaw. \\n\\n\r\nBasically, this series is like Kingdom if it had been an excuse for generic isekai harem where the mc is the perfect Garu Stu Jesus and female characters just numbers. Speaking of excuses, every bit from the war settings and battles to backstories and slice of life moments are nothing but excuses for our mc to interact with his harem, and add more lady persons to it. Let's be honest here: For this series to ever be wort of anything at all: it should have been hentai.",
            "date": "2018-07-28T10:01:00+00:00",
            "helpful_count": 63,
            "mal_id": 284988,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=284988"
        },
        {
            "content": "The Master of Ragnarok and Blesser of Einherjar is a truly humiliating work. It’s so comically inept and earnest in the name of its intended ambitions and atrocities that it becomes endearingly pathetic for a while. I was wholly prepared to come write about how this show was the ultimate waste of time in terms of creating it, watching it, and especially reviewing it. It still is in many ways, especially when it becomes downright insufferable later on, but this deformed gem belongs in the same realm as classics such as Big Order and The Room. I mean, just look at this thing, this clueless,fugly piece of shit!\\n\\n\r\nThis show is the penultimate production shitshow! To begin with the easiest of targets, the CGI is as prevalent as it is laughable. The stills are more frequent than bits of animation, resulting in some garbage action and hentai-like sequences. The animated fight sequences aren’t much better, so it’s nigh impossible to appreciate the “action” on any level.. As if all that wasn't enough, the people at studio EMT² created this terrible Ufotable-esque art-style similar to the infamous Chaos Dragon, and they struggled heavily to keep their character models consistently drawn. Shame cuz some of the women are so hot that they deserve much better, at least until you realize what utter objects they all are. That’s when that becomes debatable.\\n\\n\r\nThe female characters in this show are borderline humiliating, especially the twin additions to the harem. While they’re at the very least varied in terms of what kind of objects they are and even much of an object they’re characterized as -unlike in Smartphone- they’re still barely effective at best and downright worthless at worst. The best things I can say about them is that they don’t blatantly fall into any archetype, and that some of their designs, namely Siegrune’s, are cool and have fun clothing. The later ones are so disastrously infuriating and  worthless that after the pink-haired girl showed up, they should have stopped this process altogether and spent more time fleshing out we had. Their leader, Yuuto, is downright hysterical; he is a total piece of shit. Outside of the bitches he collects, patronizes, and still refuses to bone, and this one girlfriend he has at home (along with the few generals and whatnot who are useful), he treats everyone under his ranks with as much contempt as the most reprehensible regime leader villains in anime history. This man will force you to become his slave child or his barely any less subservient little sister, and threaten to massacre your clan if you don’t comply. His mistresses are all either his children or little sisters, which is obviously for the most unashamedly fetishistic sexual gratitude for both him and the intended audience. We’re supposed to treat him like a normal harem protagonist cuz he still has most of their hallmarks, or a decent human being just because he regrets having been worse? Fuck outta here! That’s like saying we’re supposed to pretend any of the remaining side-characters aren’t the most onenote and worthless things ever. Even he knows how awful he is, and some of it isn’t even his fault.\\n\\n\r\nThe fact that with all this, they still try to set up moments and entire plot-lines with intrigue, attempt to have character arcs with peak “emotional moments”, and take this show’s story seriously with emotional music and close-ups of women crying in joy or despair to boot, is as rich as it is tragic. It attempts all of that in the name of selling this kind of disastrously nonsensical, badly paced, convoluted, excess, and ill-defined material as something worth getting invested in. They even have several decent fantasy music for the title cards and scenes related to the ongoing war that are often only heard once. When Overlord is just sitting there, cackling in the corner with its superior OP/ED music in the same season this bullfuckery airs, things need to start being re-evaluated. In spite of all this, this show actually tries to indirectly explain the origins of this main character becoming an Isekai protagonist with a single moment of visual storytelling in the opening before eventually elaborating on it. Mad props for the idea, even if the end result was convoluted. For that alone, this thing ain’t as bad as Smartphone, let alone worthy of being called the worst Isekai ever made. \\n\\n\r\nObviously, the quest of enduring this embarrassment is not for everyone. Most of its problems are so self evident that not only are several of them displayed by the title and cover art, but people not keen on wasting their time would be doing exactly that by watching this thing. This blend of ambition, degeneracy, laziness, and ineptitude is a beast meant for only the most skilled hate-watchers to slay. Even I barely survived half of what happened past the fifth episode, and I was having a blast early on and towards the end. For the brave few who choose to embark, and the animation buffs willing to give this a shot, grab a party. and/or alter your state of consciousness first. If you genuinely enjoy something like this, let nothing stop you other than some mind-shatteringly awful filler episodes. All others can pretend this show doesn’t exist; you’re missing nothing of value by doing so.",
            "date": "2018-09-22T11:20:00+00:00",
            "helpful_count": 59,
            "mal_id": 289684,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=289684"
        },
        {
            "content": "A popular genre of late, another \"I've been summoned to another world\" Anime begins. This one drops you into the story in progress, but here are the other things you should know about this take on the alternate world going in:\r\n- Harem. Pretty standard for this genre, and this story is no exception.\r\n- Fanservice plus sexual references. Also typical of this genre.\r\n- The protagonist's special power is knowledge via cellphone, IE using the knowledge of technology and historical battle strategies.\r\n- The setting is a slightly magical version of the Bronze Age.\r\nThe drawing is average, and in scenes with large numbers of people they take advantageof mid-level CG. The animation is also mid level. Plot-wise it may have the same general issues many similar anime have in that the protagonist may never really have to struggle, however this plot is far better constructed than \"In Another World with my Smart Phone\" or \"Death March to the Parallel World Rhapsody\". That is to say there is a clear objective the protagonist desires to reach, rather than randomly wandering and gathering females. Whether that holds out as the series progresses will remain to be seen.\\n\\n\r\nWhile I personally don't really care for aggressive fanservice or over the top harems ('pat my head big brother!'), this anime had enough going for it that if you are a fan of the genre this is one of the better recent options.",
            "date": "2018-07-28T11:43:00+00:00",
            "helpful_count": 47,
            "mal_id": 285000,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5950332.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PhoenixKola",
                "username": "PhoenixKola"
            },
            "url": "https://myanimelist.net/reviews.php?id=285000"
        },
        {
            "content": "Isekai... The term in anime that I really want to avoid due to some anime being isekai and trash as well.. But I can't help reviewing this trash of an anime because I was also one of the few who reviewed a similar anime last year.. And coincidentally that anime aired in summer season of anime as well. Now, I don't have a grudge on all isekai anime (as you may know I love Overlord and Log Horizon), but this type of Isekai where the protagonist are just so generic along with his harem is just... bad. And this anime just transcended from the badone to a worst one. \\n\\n\r\nStory:\\n\r\nThe story is simple to summarize. Guy named Yuuto got transported into a fantasy world filled with Norse mythology. Along him is his trusty sidekick named \"Smartphone\" where on the first episode, we were slammed already by him being the most important character in the world not even showing us how he did it or some sort. There we saw him winning and winning wars with other clans with his harem that is op which he collected by pokeballs, oh I mean which he collected by his \"great\" leadership or \"handsome\" face. Ever wonder how he wins wars? By searching through the internet by his smartphone! Of course there is a WiFi connection in the distant past. Very good story am I right? Along with wars we saw him getting harassed by his Pokemons by means of seducing him but at least he is loyal to his friend in the real world which he can actually talk to even tho he is on the other world already.  Master Of Ragnarok And The Blesser Of Einherjar is a great anime for those who love those silly cliche types of things on a story. But as for me, it is not. \\n\\n\r\nCharacters:\\n\r\nIf the protagonist sounds bad to you, well the others are as well, especially the girls. Looking at the MC,  throughout the episodes I can only sense that... his a good person and thats it.. Development on his traits was not at all present or should I say character development is not at all present in my eyes. We know he is a teenage high schooler but still that doesn't state what he really is or his other traits are. Is he a psychopath that will kill anyone by his own hands? Is he someone willing to sacrifice his own smartphone in exchange to another girl? Maybe he is. And throughout the series we just see him gaining more and more girls even though it is so unnecessary already. Speaking of the girls, they are your typical harem anime girls that their attention is always on the lame MC and always praising how good, caring and great of a person he is.\\n\\n\r\nArt:\\n\r\nIf you are talking about great anime, meaning the anime have a ton of eye-catching visuals either from funny scenes, jam-packed actions or the environment. Ragnarok (or shall I call it MORBOE?), however, fails to please my eyes. Instead it gave me sore eyes with amateur art styles and low budget action scenes of medieval soldiers and horses fighting and stuffs. It was like looking into a 9 year old's coloring book. Not to mention for some reason the ecchi scenes are not really turning me on. Maybe because the eyes of the characters are too much of an anime eye or maybe almost all the girls have little-girl like figures. The opening is not that pleasing for me both visually and musically as well as the ending being topped off with the girls being naked to satisfy your ecchi needs... if you like this anime.\\n\\n\r\nSound:\\n\r\nEvery anime fan have a playlists of anime openings or endings. Even include the OST's (background music) of the anime. Sadly, no music will go to my playlist from this anime. My taste of anime music doesn't fit the opening as well as the ending. Background musics are ehh.. I don't even bother anymore\\n\\n\r\nOverall thoughts and Enjoyment:\\n\r\nIn conclusion, Master Of Ragnarok and The Blesser Of Einherjar is an anime for those who love isekai trash anime like In Another World With My Smartphone. Heck this is way worse than the smartphone anime so if you like this type of stuffs, I recommend you to join Yuuto's quest on getting more Pokemon girls.\\n",
            "date": "2018-09-22T10:38:00+00:00",
            "helpful_count": 36,
            "mal_id": 289682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6377235.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Zaber_san",
                "username": "Zaber_san"
            },
            "url": "https://myanimelist.net/reviews.php?id=289682"
        },
        {
            "content": "Hayao Miyazaki once said: \"Anime was a mistake.\"\r\nAnd yet in 2018, we have 2 series that stand out much: Winter's Mahou Shoujo Site and this season's abominable, unwatchable, god-damn mess of an isekai-harem, I proudly present to you...Hyakuren no Haou to Seiyaku no Valkyria, or what I'd like to call: The Master of Ragna-\"Rock Bottom\" & \"Teenage-Loli Harems AF\" of Einherjar. And not even the Anime Pope (Mother's Basement) has the quintessential formula to save you from the endless frustration of the amount of quirks that this show has going for.\r\n\"This anime is a lot of nothing, BUT a whole lot of nothing.\" - GeoffThew, professional shitbag, signing out from my Mother's Basement.\\n\\n\r\nI thought that Isekai Smartphone from the same season last year and Winter's Death March were unimpressive, unimaginative and best of all, boring as molasses...but this shitshow made EVERY mediocre isekai-harem anime-adapted series (be it LN or manga) before this look like winning formulas in my book (and rightfully yours too).\\n\\n\r\nError No. 1: Story is mind-numbingly conceived out of some tried-and-true references that is uncanningly cringeworthy.\\n\r\nWhat to expect from the fantasy-LN source that was made in 2013, just when the Isekai genre has already been saturated enough? Make some more I guess! That was the nail in the coffin of Seiichi Takayama's absolute failure to come up with something that what is already considered a cash cow and a safety net, and his creativity really is off the charts. Not to mention that at the time before the anime adaptation, this series has 15 volumes (and counting) when the anime adaptation was announced in early March this year! And the financier backing this up? Yup, you guessed it, it's not Japan, it's China (with video platform bilibili's help)! Oh good God, why???\\n\\n\r\nYou want the story? Heck and hell, I'll just summarize here:\\n\r\n- Random guy by the name of Suuou Yuuto takes selfie, got Isekai-ed by a cursed mirror into Yggdrasil (where most isekai stories already established that long, long time ago BUT better executed) where clans have an all-out battle to see who reigns supreme...\\n\\n\r\n- Surprise, surprise! Along with him comes a god-damn solar-powered Smartphone! And thank God Isekai Smartphone's execution is heaps better than this (but still not good) since Natsuko Takahashi, the series composer for both series, came back to hem this job. And honestly, after her work on the fabulous Ore Monogatari in 2015, the majority of the remainders are just plain shovel-ware, and this is no different.\\n\\n\r\n- Deal breaker No. 1: Searching on Wikipedia for war tactics in Yggdrasil...how blatant is this? As if the clan he is responsible in only benefits on the knowledge of the technology, NOT the human! Yuuto has none of it all, he just has the technology-powered Norse mythology going for him while everyone calls him \"Father / Big Brother\" since he's the patriarch...it's a \"cheat\" he says, but I'm not buying that fact at all, and that's that is going for our dear god-awful MC.\\n\\n\r\n- Deal breaker No. 2: All the teenage and loli girls beside \"The Master of Ragna-\"Rock Bottom\"? Other than being used for battle (that's why they are called Einherjars, masters and blessers of unique abilities), they can do one more thing: Harass and caress the male MC for reasons our human minds can conceive why, but for what purpose...?\\n\\n\r\nThe story and setting are both incredibly bad to the point that I can sleep when the episode starts and wake up at the ED song! Simply, just great. Not to mention that Kousuke Kobayashi, the (not 2nd but toxic upgraded) 3rd-rate director behind last season's obnoxious short Alice to Alice, hasn't learned his lesson much, and the production staff under him already gave up trying a lot here. I know the harsh anime industry where are budget limitations, but this show really scrapes that line a whole lot.\\n\\n\r\nError No. 2: Characters (not the VAs), aside from their \"unique\" traits, are nothing short of mediocrity, the bottom of the barrel. \\n\r\nSuou Yuuto...generic as he is, he has the goody-two-shoes feel, until some people have to wake up his ideas and be firm, he did. Problem is, he cannot be straight, and always has to compromise to please everyone. Oh, come on! You can do a better job...right? And your unimpressive denseness is a legit pointing-finger major crisis!\\n\\n\r\nThe Einherjar maidens (Felicia, Siegrune, Linnea, Ingrid, the 2 loli sisters) and even his OWN sister Mitsuki...wow are they a sight to behold! Nah, just kidding, who can I kid when majority of them \"set their aims\" at Yuuto while he flusters with the little sense that he has. Not to mention that their sole purpose is to battle, and while at it, fight for \"supremacy\" to be the right-hand \"embracing\" man of Yuuto. \\n\\n\r\nYuuto's opposition (with the de-facto clans with the blonde he calls \"Bro\" and Steinphor) is hands-down the ONLY part that is decent, as they have balls to show off their power and at least be competent somewhat. I presume at least this area, the production staff tried at least a teeny-weeny effort for them to stand out, and they did, albeit for their screen-time moments.\\n\\n\r\nError No. 3: Art and animation sucks balls...HARD enough to crash and burn.\\n\r\nEMT Squared is a newcomer studio, but that doesn't mean that you have ALL authority to give them this project to handle...and it shows and reflects very badly from start to end. Action sequences are off with the wrong camera focuses and the many stills; character designs are super-off and deformed in terms of body and faces (especially one-sided faces where the designers super-cheaped-out and cut out on drawing 1 eye instead of both), not to mention the stale background art and obsolete animation quality.\\n\\n\r\nError No. 4: Forget about the music aesthetics, they are the worst in terms of representation.\\n\r\nI absolutely despise the sound choices done here, nothing here is ever noteworthy, so don't get me started...except I'm doing that now. The OST is horrible, sound effects at the level of LOLs and hilariously-unfunny bad placements.\\n\\n\r\nWe all never once thought there could be any other anime that will be scraping the bottom of the barrel, but this anime proved us wrong. Bland. boring, cliché, flat, tiresome, you name it, this anime has it all. Whatever it is, this anime is an outright waste-barrel of an excuse of time, talents and effort, and should be shunned and abstained at all costs.",
            "date": "2018-09-22T10:32:00+00:00",
            "helpful_count": 29,
            "mal_id": 289679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289679"
        },
        {
            "content": "The Master of Ragnarok & Blesser of Einherjar or as I like to call it The Master of Rock Bottom is garbage. This is what happens when a studio named Em2 copies and pastes the world most uninspired Iseaki anime (In Another World With My Smartphone). With writing, direction and production so bad it makes shows like Black Clover and Darling in the Franxx look competent. The Master of Ragnarok & Blesser of Einherjar is empty filled of nothingness that can't even respect its own target audience correctly. The show itself is horrendously written crap in the very beginning with numerous red flags popping up overthe course of it that would quickly lead to series killing problems.\\n\\n\r\nNow with that said let's begin with the broken mess.\\n\\n\r\nStory.\\n\r\nYuuto Suoh is a normal high school student who is knowledgeable about urban legends. In order to prove one of these legends, he and his childhood friend Mitsuki Shimoya visit a local shrine nearby. However, while using his smartphone to take a picture of himself next to the shrine's divine mirror, he finds himself mysteriously transported to another world called Yggdrasil.\\n\r\nThis new world he arrives in is heavily steeped in Norse mythology. He also finds that many people fight each other over land domination. Yuuto is later taken in by the so-called Wolf Clan, a group of people with weak military tactics. Using the knowledge of military tactics he gained from school and his smartphone, he gradually makes the Wolf Clan rise to prominence. In turn, he also gains the affection of a group of magic-wielding warrior maidens known as the Einherjar.\\n\r\nAm just going to say this right now the story is a complete dumpster fire.\\n\r\nRight out the gate, this show makes a horrendous first impression where the show starts off with our protagonist already in the fantasy world for two years. We the viewer barely know jack shit about protagonist time from the last 2 years minus that terrible backstory that shows us how he got transported in the word.\\n\r\nThe Master Of Rock Bottom is a horrendously written harem disguised as Iseaki anime that follows every single generic story elements that we all seen before from this genre. male protagonist gets send to the generic fantasy land by accident. A bunch of girls from all types of fetishes and tropes come up to surround the main protagonist cock forming a harem in the process. The main protagonist becomes the strongest person in a set country by dethroning every single competent faction with no issues whatsoever.\\n\r\nHonestly, if you have seen In Another World With My Smartphone as well any other bad Isekai anime then you seen The Master Of Rock Bottom because not only it took everything that was wrong about those bad Isekai anime but this show somehow manages to make they worse to a point where it actually becomes downright insufferable to watch as you constantly shoving its true intentions right down our fucking throats.\\n\r\nOverall the story in The Master of Rock Bottom is absolutely rotten garbage. \\n\r\n0.5/10\\n\\n\r\nChararters. \\n\r\nIt's honestly hard to call the chararters in The Master of Rock Bottom actual characters because every single and I mean every single character are a bunch of trophy pandering husks as they all only exist to please a certain type of audience not much beyond that.\\n\r\nOur main protagonist Yuuto is a generic and uninspired husk who barely has the capable of being an actual protagonist. His motivation is paper fin as we know jack shit about his earth life and his personality as an interesting as a potato.\\n\r\nThe female characters aka Yuuto fetish harem are somehow even worse. Every single female character in this show only has a single character trait and not much beyond that.\\n\r\nThe same thing can apply for side characters and villains.\\n\r\nOverall the characters are complete abominations.\\n\r\n1/10\\n\\n\r\nVisuals.\\n\r\nSaying that The Master Of Rock Bottom looks like garbage is a fast understatement. This is by far the absolute worst looking show I have ever experience from this decade. Black Clover, Beatless and Darling in the Franxx my have horrible production values but least tired to good every now and then this rabbit hole show doesn't even give a damm about looking good. The character designs all atrocious bad as all ugly to look at as they every single character look like they came from DeviantArt in the year 2001. Not to mention all of the female characters are oversexualized to the core meaning throughout this show you will see lolis doing sexual acts left and right.\\n\r\nThe actual animation is hot garbage. Choppy movement left and right, horrendous fight choreography, abysmal use of CGI for the horses and soldiers. Budget cuts everywhere mixed with the shameful use of stock footage.\\n\\n\r\nNow if you the show actual animation was horrendous the opening visuals are somehow even worse. It's is a normally for the anime industry to have opening visuals that look good in order to draw the viewer in but The Master of Rock Bottom can't even do that. Not only do the characters in the opening visuals constantly go off model but the way that the show was directed visually gives me an eyesore. The camerawork is almost as bad as Bubsy 3D on the PlayStation 1 and the way that the show showcased fight scenes in the opening was pure nonsense. How can a hammer red dude be able to move with the hammer like a freaking sword? I understand that training exists but at the same time but how can he be able to block fast sword attacks from that sword chick. In both real life and video games heavy weapons while despite being doing more damage to the foe has a pretty long reaction time cool time thanks to that weight of the hammer facing towards a certain leaving you wide open in the process for enemy fire while you're trying to control the weight of the set heavy weapon.\\n\r\nTo add insult to injury in episode 11 the red dude is was able to spin the heavyweight hammer like a fucking shield without getting tried. That's not how hammers work...\\n\r\nOverall like with this story and characters the visuals are a complete dumpster fire.\\n\r\n0/10\\n\\n\r\nSound.\\n\r\nJust like with most bad Isekai anime that came before it, it's generic and boring Isekai music that we all see before. The same thing applies to both the opening and ending themes which they are uninspired as hell that is filled with crappy imagery.\\n\r\nWhile the soundtrack is generic the sound effects are downright horrible as they sound they just came straight from Berserk 2016. \\n\r\nNow we get to the best part of the more like the final nail of the coffin being the voice acting for both the sub and dub.\\n\r\nThe sub version is filled with boring and shitty performances where it feels like they are reading the show's script. I honestly feel bad for the Seiyus who had to voice characters in this scrapheap of an anime. Now if you thought the sub version was bad the dub version is somehow even worse. Not only the audio quality was abysmal beyond belief but the every single voice actor in the show sound like they were they were doing a fucking hentai production.\\n\r\n2/10\\n\\n\r\nFinal Thoughts.\\n\r\nThis anime is a prime example of why I hate Isekai anime so much. It is a giant eyesore that makes Darling in the Franxx and Black Clover look like they were done by Hideaki Anno. The story, characters, voice acting, music, and the production values are absolutely horrendous beyond belief.\\n\\n\r\nIn my review of How to Not Summon a Demon Lord, I mentioned that I hated the Isekai genre as a whole and that show made hate despise the Isekai genre even more. Now after watching this rabbit hole of a show I officially lost all respect for Isekai genre as a whole to a point where I never want to touch an another modern Iseaki anime again.\\n\r\nScrew this show and screw everything that this anime stands for.\\n\r\nFinal Score 0.5/10.",
            "date": "2018-09-22T11:52:00+00:00",
            "helpful_count": 26,
            "mal_id": 289690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 0,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=289690"
        },
        {
            "content": "I'm putting about as much effort in this review as was put into the anime.\r\nPros:\r\n- OP isn't Slide Ride. \r\n- Smartphone usage is much better than in Isekai wa Smartphone to Tomo ni\r\n- Basic attempt at introducing battle tactics.\r\n- MC actually has a goal beyond just fucking around. \r\n- Ucchi OP \r\nCons:\r\n- The development of the phalanx is wrongly attributed to Alexander the Great and Oda Nobunaga (??????)\r\n- Most of the female cast are the MC's adopted sisters. Naturally, all of them want to bang him. \r\n- Awkward CG\r\n- Tactics only work because everyone else is brain dead. \r\n- \"Oni-sama\" is abused to a muchgreater degree than Mahouka. \\n\r\n- Based on Norse Mythology my ass. \\n\r\n- The katana being the most powerful sword in the world. \\n\r\n- One-dimensional characters. \\n\r\n- Stilted animation and direction. \\n\r\n- Poorly defined world. \\n\r\n- MC just happens to be the most compassionate, smart and charismatic guy around.",
            "date": "2018-08-01T13:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 285315,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760717.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/IllegalSpaceman",
                "username": "IllegalSpaceman"
            },
            "url": "https://myanimelist.net/reviews.php?id=285315"
        },
        {
            "content": "You would think the show would start off from showing how the protagonist works up his way to gain a harem. At least a mediocre harem anime. But no, they went even further, they went beyond the scope of a mediocre harem anime , they went to deepest part of the dumpster and stayed there.\r\nYou would expect it be like Date a Live! at least, but no, dude starts out with op characters. aka, LEGENDARYS, LVL 12 SYNCHRO SUMMONS, GOD DAMN ADD IN EXODIA EQUIPPED WITH THANOS GLOVE TOO BC WHY NOT, is basically how the creators made this anime. \r\nIn all. It just sucks.The main character started off way too op. \\n\r\nThe anime is even milking the smartphone thing. Only redeeming thing about the anime is the mild good waifus. Not on the level with Rem or Zero Two, but at least they got buubs and bootys.",
            "date": "2018-07-28T15:12:00+00:00",
            "helpful_count": 10,
            "mal_id": 285015,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061150.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LoliHitler",
                "username": "LoliHitler"
            },
            "url": "https://myanimelist.net/reviews.php?id=285015"
        },
        {
            "content": "Well everyone seems to hate this anime but all in all it's not that bad.\r\n It has a good protagonist that is not overpowered but actually puts effort in accomplishing things  , good enough art work and it is not based on a game fantasy world like Sword Art Online, Overlord and frankly about a million others!!\r\n I don't have anything against those, in truth I find them quite enjoyable but it is good to have something different once in a while. So to tell the truth I do not understand what everybody has against this anime. \r\n The ending feels very rushed though.",
            "date": "2018-10-10T11:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 291414,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7442625.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KathrineWhite",
                "username": "KathrineWhite"
            },
            "url": "https://myanimelist.net/reviews.php?id=291414"
        },
        {
            "content": "“I don’t think there’s a isekai worst than Sword Art Online”\r\nWriter of MORBE: Hold my beer!\u2028\r\nI’m happy to announce to everyone who thought SAO was the worst isekai ever, that The Master of Ragnarok & Blesser of Einherjar (MORBE) has claimed that title. I have full confidence in saying that The Master of Ragnarok & Blesser of Einherjar is the worst isekai of all time. If someone made a list of everything wrong with a isekai light novel translated to an anime adaption then this would tick every box, that’s how laughably bad it is. \r\nStory- (1/10):\r\n\u2028This anime is very unique in its premise. Usuallyit starts with the protagonist getting inexplicably transported to a fantasy world, but this doesn’t even bother to start with that because who wants to see that again, amirte?! Your next thoughts are probably “we’ll get a proper introduction later on”, but NOPE it  doesn’t go back to explain it either!\\n\r\nWhen we’re introduced to the protagonist, he’s already been in this world for two years, so it’s like this doesn't classify as an Isekai.\\n\\n\r\nThere’s a ton of questions we’ll likely never know the answer to, for example:\\n\r\n- How the protagonist got transported to this world \\n\r\n- What are the rules and intricacies that governs this world e.g. Why are their different clans? what they fighting for?\\n\r\nWhat’s more hilarious is the first episode attempts to cover this through exposition to explain how our protagonist got to his position of power, but it doesn’t explain shit. It just glosses over all the information and important details  \\n\\n\r\nWhat a masterful deconstruction of an isekai anime! It has to be that or lazy writing which is why the story is so shallow and generic.\\n\r\nSeriously, the plot goes nowhere. The protagonist’s goal is to get back to his time period, but not really since he’s done nothing towards this \\n\\n\r\nCharacters- (1/10):\\n\r\nOur protagonist is named Yuuto: a dense, self- insert harem protagonist who’s perfect in every way! He’s handsome, the leader of the Wolf Clan, adored by his devoted subjects, a military genius, the most morally just, and more importantly he has a harem of bitches at his beck and call! What more can you ask for in a MC?!\\n\\n\r\nHonestly, Yuuto’s incredibly bland and severely lacking in character traits that i can’t even fathom why these girls swoon over him. They try to mention Yuuto’s flaw of being overconfident in the past which is why he’s frustrated and calls the red haired musclehead general a ‘baka’ all the time, but here’s the best part- we never see it! We never see Yuuto’s first experience coming into this world so we don’t know how naive and reckless he was or how he overcame it and become the humble beam of perfection we’ve come to know. \u2028\u2028\\n\\n\r\nSo what makes Yuuto standout from your usual self-insert harem/Isekai protagonist? Well, Yuuto is unique in the stance that he claims girls as his property, and forces them to bend the knee to be part of his “family.” Yes, this sick perverted bastard makes these poor girls his sisters and daughters, and has them address him as “big brother” and “papa” to fulfill his incestial fantasies.\\n\\n\r\nWhat else makes Yuuto great? Well he has a smartphone, but not just any ordinary one- a solar powered smartphone! Now our protagonist can search the web to look up military tactics from great historical leaders on Wikipedia to implement their strategies in battles, create advanced war technology and improve his clan with future inventions/concepts e.g. schools for education. \\n\\n\r\nSeriously, I don’t rate Yuuto at all because he isn’t exactly intelligent or strong, just a ordinary teenager with a deus ex machina smartphone. There’s nothing compelling about his character. At least Yuuto acknowledges he’s cheating and completely ordinary without it.\\n\\n\r\nLet’s move on to the girls now. They are all so one dimensional, uninteresting, bland and can be described in a single sentence:\\n\\n\r\nFelicia: Yuuto’s right hand girl (i’m shocked how I remember her name). Why does she have this role? I couldn’t tell you. She isn’t exactly intelligent or strong, just diplomatic and good at organising I guess. \\n\\n\r\nThe other girls include: \\n\r\nPink haired horn clan imouto\\n\r\nAssassin Twins: one being a airhead and the other being a smartass\\n\r\nGrey haired, devoted swordsman girl  \\n\r\nSlave child girl who calls Yuuto “papa”\\n\r\nTomboy blacksmith girl  \\n\\n\r\nThat’s literally all there is to them. \\n\\n\r\nOh, let’s not forget Yuuto’s girl back home who isn’t actually his gf, but the childhood friend he loves and wants to return to. It’s such a poetic tale of how Yuuto has a harem of girls on his dick, but yet he’s still dreaming and fantasising about his unreachable girl that he’ll probably never see again xD\\n\\n\r\nAnother character is Felicia‘s brother. He’s a butthurt teen because their father picked Yuuto over him as his successor to the wolf clan, so he leaves to join another clan to seek revenge. He’s depicted as someone to rival Yuuto, but truly he stood no change against our lord and saviour! Felicia loves her “brother” Yuuto more than her real brother. Why does Felicia have such devotion to Yuuto over her real brother? No real reason. We don’t get to see how their relationship progressed and got so close.\\n\\n\r\nSeriously, can someone break Yuuto’s smartphone already? I’m tired of seeing his irrelevant 5 min conversations every episode with the girl he likes. The conversations are always meaningless shit like a summary of how Yuuto’s day went. Mitsuki is so one dimensional it hurts. She has no depth, no screentime or relevancy to the actual story, so every time they talk I lose any immersion i have in this world. We don’t even see Yuuto and the girl’s relationship before he got transported into this world, hence why it’s so shallow and underdeveloped that I can’t be invested in them whatsoever. \\n\\n\r\nAnimation- (1/10):\\n\r\nThe animation’s trash. The CGI during fight scenes doesn’t even look like fights since the characters don’t even look like they’re hitting each other. There’s a lot of terribly animated still frames too. The battlefields, soldiers uniform and battle strategies aren’t detailed enough, there’s not enough focus on the troops to make it feel like they are at war. Plus, you can’t tell what strategies are being used properly due to the animation.\\n\\n\r\nSound- (1/10):\\n\r\nI can’t even remember the osts because I was too entranced in watching this masterpiece. Seriously, the OP, osts and endings are forgettable.\\n\\n\r\nEnjoyment- (1/10):\\n\r\nI must be a masochist for pain because I hate this show with a burning passion, and regret every minute I spent watching this anime.  \\n\\n\r\nOverall- (1/10);\\n\r\nThe plot has gone nowhere thus far, the characters are painfully bland and annoying, we can’t get a semblance of plot progression without there being eechi fanservice scenes every 5 mins with girls pressing their boobs on Yuuto or literally taking off all their clothes and throwing themselves at him (I kid you not, this actually happened). I forced myself to watch this hoping for one redeemable quality, but I got nothing. The only reason I could recommend watching this is for the sole purpose of fapping to some soft incest hentai, or you’re watching to find out why it’s so bad and received negative reviews. Either way, it’s really not worth it.\\n\\n\r\nPS: Can anyone point me towards where I can watch the prequel? Because it’s as if we’re missing a season’s worth of source material on Yuuto’s life with his childhood friend, the introduction of when he was transported into this world and his rise to power as the Wolf Clan’s leader in those 2 years. This anime had a couple of cool ideas e.g. the setting, the different clans etc, but the lack of content and poor execution destroyed any semblance of potential this might have had.",
            "date": "2018-08-28T14:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 287644,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=287644"
        },
        {
            "content": "Dreadful....\r\nAbsolutely dreadful\r\nI'm not sure where to even begin...I'm someone who loves this genre...I'll go as far as to even enjoy the isekai smart phone anime even if it's to just laugh at how terrible it is. But this anime is different.\r\nFirstly we start off when the mc on the battle field. How did he get there? Idk. Why was he there? Idk. Unlike most isekais this anime starts off with the mc already in a different world. We have no idea how he got there, why he was there or why the mc is at the position that he is currently in(the anime tries toexplain it later on but does a poor job at it...)\\n\\n\r\nI'd write more about this but I'd be wasting my time. I'll just give you my advice...dont waste your time....trust me it's not worth it. The fan service is alright for the series but like there are other anime that have better fan service. You shouldnt waste your time with something like this. The anime will bore you to death plus the world build is horrible. What makes isekai anime entertaining is the fact that we can see the world in the eyes of a character who is foreign to the world. Without proper world building no matter how many lolis and \"oppai\" you put into the series it will suck...and not in a good way. I cant even cringe watch this show smh...",
            "date": "2018-07-28T15:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 285014,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141186.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Aesthetic-",
                "username": "Aesthetic-"
            },
            "url": "https://myanimelist.net/reviews.php?id=285014"
        },
        {
            "content": "\"Those who are stupid are unaware of their own mistakes.\"\r\n-ZARC, from Yu-Gi-Oh! Arc-V\r\nSummer 2018 brought in some amazing shows like Isekai Maou, Cells At Work, Angels of Death, Overlord III, Revue Starlight, Banana Fish, SNK III, etc. However, it has had its equal share of mediocre to absolutely wasteful shows.\r\nI really don’t think I need to make a long ass essay about how overused the isekai genre is in the recent years...that’s someone else’s job, honestly.\r\nWhen people were saying Isekai Smartphone might have a second season, it's funny that this series came around not too long after. You know what? Here's this:\r\nSome anonymous dude: \"IsekaiSmartphone is the worst isekai series EVER.\"\\n\r\nThis series: \"HOLD MY GOD DAMN TEQUILA!\"\\n\\n\r\nThis series pretty much does just about EVERYTHING wrong...not just as an isekai series, but as an anime show, in general. Even Ousama Game wasn't this stupid, cause at least that trash show had \"reasonable\" enjoyment value.\\n\\n\r\n(some mild spoilers, btw)\\n\\n\r\nSTORY: 1/10\\n\r\nOkay, first off....why the actual hell do you start us off with our main guy already in the other world, and not only that, already in the middle of a battle?? Essentially we got no good siege-way for how the mc enters this Norse-inspired fantasy world called Yggdrasil. Apparently according to the LN, our dude basically took a selfie through his damn smartphone (which he later is SOMEHOW able to use in the fantasy world cause it's f***ing solar-powered), and gets zapped into this conundrum, and is somehow okay with it\\n\r\nThe world-building is practically non-existent, and any explanations for certain points and aspects are scarce. Because of that, the core storyline is dull as hell...it doesn't deserve the description of \"generic\".\\n\r\nUnlike with Isekai Maou, this story doesn't handle the harem element very well. I can't be the only one uncomfortable with how the MC and his slowly growing harem address each other as family, right? Onii-san?? Aniki?? Father?? Regardless of what deep explanation I may get regarding this, it's just revolting, like an excuse for the guy to not bang the f*** out of any of the girls. I mean, at least he does choose someone at the end, but that childhood friend don't even deserve to be the one, let's be f***ing real, here.\\n\r\nThe battles are not even enjoyable....they're awful. The so-called strategies during those clashes aren't even something worth raising your eyebrows at. I mean, the guy cheats off his damn phone, ffs!! \\n\\n\r\nANIMATION AND SOUND: 1/10\\n\r\nWell how unfortunate....not even the soundtracks and the animation were any sort of \"saving grace\". None of the soundtracks are memorable, and honestly often very offputting. Personally, I love music, but I can be very distinct with my preferences of certain soundtracks and songs despite having  a diverse taste. When a series can't even make its music score half-decent, it's literally game over in my eyes.\\n\r\nThe animation is honestly not the worst example I've seen, but it's still hella bad. Apparently the animation crew were either too lazy and/or heavily unmotivated. I'm just gonna stop there for that part.\\n\\n\r\nCHARACTERS: 1/10\\n\r\nUgh. Boring MC. Boring harem \"squad\". Boring \"childhood friend\". Boring side characters, too. Not even the god damn hot-blooded overpowered dude was good...I personally got sick of this dude's battle cries and pointless mid-battle chit-chats. The childhood friend, who got picked at the end, btw...is a previously pointless character who suddenly becomes relevant due to the aforementioned situation, which doesn't make any sense because she doesn't even spend even half as much time with the MC (even through phone calls....YES, somehow you can make phone calls between the real world and the fantasy world in this show, like WTF). So the harem our guy created became pointless, too.\\n\r\nI'm just saying, and for real...if this idiot won't have orgasm with any of our now-friendzoned Norse girls, they could've just went the yuri route with each other and the show would be easily half-decent.\\n\\n\r\nENJOYMENT: 1/10\\n\r\nI know I'm supposed to enjoy watching anime no matter what, and grade my stuff depending on how I felt about certain shows, especially in the character and enjoyment department. But with this series, watching it felt like that one household chore you absolutely despise doing, even though your mom and/or dad set a shitty ultimatum. Need I say how unenjoyable it was? Not gonna lie....half the time I was watching almost every episode, EXCEPT during the sexual advances by the girls (which were actually kinda amusing)....I'd be nearly dozing off or unconsciously reaching for my OWN smartphone to pay Tetris or send PMs. Why didn't I drop this series, you ask? Research reasons, simply put....basically information I can use in the future, should I become a writer or even be in the anime department one day...on what NOT to do when writing a story or adapting a series.\\n\\n\r\nFINAL WORD: For the sake of your damn lives, people.....\\n\r\nDON'T. F***ING. WATCH. IT.\\n\r\nIf you want actual decent or good isekai series, watch the likes of Re:Zero, Isekai Maou, No Game No Life, or Overlord instead. Even Sword Art Online, which is technically an isekai series in a way, is a masterpiece compared to THIS mess right here. As for me, while I did get helpful data (LMAO), I might be contemplating one day in the near future as to why I didn't drop it back then, and then probably break down and cry in deep regret, perhaps...LOL.\\n\\n\r\nY'all been warned, my fellow anime fans...",
            "date": "2018-09-22T15:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 289711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=289711"
        },
        {
            "content": "This show shouldn't be taken seriously. I saw many that gave this series a 1 out of pure hatred.  In my case however, I found amusement from this show.  While this show did a horrible job with its story and characters that cannot be fixed with Flex Tape, I had fun because of its poor quality.  \r\nIt was amusing to see how bad some of the actions scenes were and how pathetic some of the \"heart warming\" scenes were.  I was also pleased that they actually wrapped up the story.\r\nI give this series a 4 based on my enjoyment of theshow.  Please continue to read to see a more detailed review.\\n\\n\r\nStory:\\n\r\nThe story was bland.  It's about a guy who got sucked into a magical past where people are given titles based on names from Norse mythology.  The story shows our main character, Suoo Yuuto winning wars using his smartphone to look up war tactics to beat his foes.  The other half of the show is him being fawned by his \"sisters\" and \"daughters\" who have sworn allegiance to him and love him unconditionally. \\n\\n\r\nHowever, this anime did get a proper ending unlike other Isekai anime that just leaves you behind and Yuuto did pick a girl.\\n\\n\r\nArt:\\n\r\nDon't expect anything too much.  Colors and character designs are flat.  It is obvious that the studio didn't really give any care to this series.  Animation is minimal and usually depends on still pictures for battle scenes.  But even these still pictures are horribly drawn and laughable.\\n\\n\r\nSound:\\n\r\nI can't remember any of the OST that played in the show.  There are some cases where the volume of the music is raised and lowered based on the tension of the show.  By the way, there is no tension.  \\n\\n\r\nCharacter:\\n\r\nTo be frank, the characters are just a bunch of tropes.  Nothing that makes them too unique.  \\n\\n\r\nYuuto is the perfect selfless guy that has no defense against women.  His \"sisters\" and \"daughters\" love him because he is smart and kind.  The reason he rehects them is because he likes his childhood friend, which to be fair is something we haven't seen in a long time.\\n\\n\r\nDefining each \"sister\" or \"daughter\" is pointless.  Every single of one of them wants his dick.  They each represent a trope: the erotic sister, the cool beauty, the imouto, the tomboy, and the three lolis. Most of them have little to no purpose in the story and are just there to state how great our main protagonist is.",
            "date": "2018-09-22T14:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 289707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317017.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mottowers",
                "username": "mottowers"
            },
            "url": "https://myanimelist.net/reviews.php?id=289707"
        },
        {
            "content": "I've never seen something so disgustingly bad, and that's coming from someone that somewhat enjoyed the other isekai anime this season. For starters, I'm not a huge fan of harems or fan service, but I can look past both if the story is good and the show has some substance. Sadly this does not, it's so incredibly boring and EXTREMELY awkward. The MC just comes across as some sick disgusting pervert, making anyone he defeats submit to him and either become his \"child\" or \"sister.\" I would literally rather watch paint dry than watch another second of this crap. \r\nLet me serve as an examplefor you, don't waste your time with this crap.",
            "date": "2018-08-12T01:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 286256,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DashieXCVII",
                "username": "DashieXCVII"
            },
            "url": "https://myanimelist.net/reviews.php?id=286256"
        },
        {
            "content": "I've seen my fair share of \"bad\" Isekai anime and found varying levels of enjoyment from them despite. BUT, this Isekai anime is appalling--it takes the cake for most painful Isekai anime to watch. \r\nTo begin, this anime begins without a proper introduction and NEVER goes back to explain either. In fact, you must watch the opening song if you want to get even a hint of what occurs before episode 1. Its very confusing and the anime does nothing so far (as of episode 4) to properly explain the rules and intricacies of the world or how the protagonist got to where he is.\\n\r\nEverything that happens is just an excuse for the Protagonist to add to his harem to which he, of course, has no interest in because he cares more for some bland childhood friend girl that is not even around. \\n\r\nThere is absolutely no depth to the story or the characters. Everything is straightforward to a fault. As mentioned, everything is just about having some cute girls in an almost taboo type harem. \\n\\n\r\nThis is an anime I was ready to drop before even finishing episode 1. And I probably should have, because the absolutely poor quality remains the same throughout. I say this as someone who has enjoyed some \"terrible\" Isekai animes. Don't waste your time with this anime. \\n",
            "date": "2018-07-31T17:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 285259,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510775.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/NixKaen",
                "username": "NixKaen"
            },
            "url": "https://myanimelist.net/reviews.php?id=285259"
        },
        {
            "content": "This anime has been on my radar mostly because I kept coming back to the page to read the funny reviews about how bad it is, and I finally decided to watch it and write my own review.\r\nThis anime is bad. I think I have pretty low standards when it comes to anime, my average rating for all the anime I've logged on this website is an 8/10, but even after seeing the score for this and reading a lot of the reviews, this anime managed to limbo below my already low expectations, and then kick me in the shins for expecting more from it.\r\nAnormal plot follows the path of exposition, rising action, climax, falling action, then resolution. The episodes don't follow this at all. Just considering the first episode, the plot went from climax to exposition to falling action then to rising action. It also doesn't help that the action scenes are tepid at best, and feel very short and rushed considering how major the consequences of the battles are supposed to be.\\n\\n\r\nAll the main characters the same generic anime faces, and the characters are so flat (with the exception of their tits) that hentai characters have more depth, and at least with hentai you'd see people fuck instead of this where the mc is one of those people who are probably afraid of kissing.\\n\\n\r\nThe second episode mentions that this is taking place two years after the mc came to this world, which to me just seems like an excuse so the writers don't have to write the probably more interesting story of what happened when he first landed in this world and why the girls already by his side like him. Probably because they can't think of a reason why the girls like him.\\n\\n\r\nI don't think I've ever watched an anime where I've yelled 'what the fuck' and 'what is this shit' more times than this one.\\n\\n\r\nNow that I think about it, the four sentence synopsis on this website explains more of the backstory than the first few episodes of the anime, and if I haven't read it then I would be completely lost.\\n\\n\r\nI almost wish that this anime was worse than it is, because at least then it'd be so bad it's entertaining, like The Room, but no, this is just plain bad. Hell, if you're at least semi-amused from reading this then this review is more entertaining than the anime.\\n\\n\r\nCharacters are bland, story is okay but poorly executed, art is generic, skip this anime.",
            "date": "2018-07-29T12:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 285081,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3191247.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zemphis",
                "username": "Zemphis"
            },
            "url": "https://myanimelist.net/reviews.php?id=285081"
        },
        {
            "content": "Why does this exist? I genuinely believe that the animators and the storywriters got bored and got a monkey high on LSD to copy and paste sections of other LNs to make this travesty. \r\nAnd boy does it copy other LNs liberally. The character is a clone of the guy from 'in another world with a smartphone'. The girls are copied from High School DxD and some of the lore gets thrown about casually too. The monkey took extra pains to make sure this was explained in one episode, but only so that it could confuse the viewer even more. The opponents are clones ofantagonists from 'Campione!'. \\n\\n\r\nThe anime does not even try to follow the plot points to the end. Battles start without us knowing, and end off screen while the MC looks ahead with a constipated expression, moaning on about how he is just a cheat. The girls all 'love' him, but we see little reason why.  Really, they only serve to provide some fanservice. The MC spends a lot of time doing random things in the workshop and building his country, but we don't see the impacts of this. He mentions it once, it magically gets done and then we never hear of it again. \\n\\n\r\nThe one noteworthy plot point is in relation to his girlfriend, which is followed through to the end. Although even here, the plot holes in between are greater than the sum total of their love story. We never get to know why this girl even loves this guy apart from her being his 'childhood friend'. Brilliant. Why bother building an actual relationship?\\n\\n\r\nEven the final battle is skipped. I actually could not believe it. They skipped the final battle to show us a montage of the MC being cheered on by his people. \\n\\n\r\nThis anime is trash. The animation is painfully average; the character design is uninspired and built on stereotypes of other, more popular characters; the plot is weak and nonsensical; the music is cringe-inducing; the dialogue is childish and the entire experience feels meaningless. There is no satisfaction at having followed one person or one clan through some defining struggle or overcoming massive odds or standing for the ideals. The anime never actually tries to make the viewer feel anything other than a vapid sense of the mind blanking out. There is no tragedy, no humour, no romance, nothing at all that can make the viewer interested. The only reason I watched this through to the end is because I have a soft spot for kingdom-building anime, manga or LNs. \\n\\n\r\nBut this isn't it folks. This can legally be defined as an anime because of its origins, but as the bard said it best: To me, it is nothing more than a vacuum in the air.",
            "date": "2018-11-12T08:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 293911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2031767.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sorghaghtani",
                "username": "Sorghaghtani"
            },
            "url": "https://myanimelist.net/reviews.php?id=293911"
        },
        {
            "content": "The Master of Ragnarok & Blesser of Einherjar better known as Hyakuren no Haou to Seiyaku no Valkyria which is another version of a guy who goes to an alternative word and has use his wit in order to survive kind thing, but here the guy survived and for some obnoxious luck thrives and even become the big man in some kingdom know as the wolf clan, which btw was pretty much cliche since it coincides with another anime with a similar theme and you've guess it Isekai Maou to Shokan shoujo no Dorei Majitsu, so pretty much we have two such genres for thisseason alone, though how the characters were set and portrayed were different. Now I don't about you guys, in both scenarios they have females whom were utterly useless, here the maho shoujo was useless since we don't see her do any magical things in fact all that maho shojo does was to flirt around with the male character like a yes man,  there is a bokuko warrior who did even killed the hammer guy, we have a princess who wants to get laid but never got the chance , a boxum blacksmith who serves as added competition for the guy's harem and let's not forget the twin assassins whom were not there when they're needed. The only consolation here was for the guy to finally be with his love of his life and yes she becomes his wife in the alternate world.......Also, this anime was basically a dichotomy where at one point we see the deaths of soldiers dying and yet the hammer guy named Steinthor was only wounded by a katana wielding bokuko  Siegrune, where it would have been nice if he's dead and also seeing the guy going back to the alternate world and dragging someone else with him was basically a disappointment , since the ending would have been nice if the guy come home to his world and leaving Felicia in charge after things were already being set in peace. But it seems that original creator Takayama, Seiichi wants a garndious ending where the guy and his girl becomes royalty in an alternate world , so with nothing more to say , here are my ratings:\\n\\n\r\nStory- Mediocre 5: It has the same genre and theme as that of another anime which was aired in the same season.  \\n\\n\r\nArt-Mediocre 5:  Cu'z everything were just the usual.   \\n\\n\r\nSound- Mediocre 5: The inflections being used were to protary the character's voice were the usual.\\n\\n\r\nCharacter-Pathetic 1: Since the guy  Suou, Yuuto was the quintessential stupid guy who wouldn't go for any of his harem girls, and them girls were seemly useless to begin with, basically they were just a bunch of eye candies.\\n\\n\r\nEnjoyment-Patchetic 1: I really  hated the timing where the guy goes home in the mist of battle and the twins were nowhere to be found in order to kill that which Sigyn that would have guarantee a total victory and where the guy could go home to his world knowing that everything he left behind in the alternate world is in order, if only studio EMT² did that it would have been a good ending. \\n\\n\r\nOverall-Pathetic 1: It was just too much of a run of the mill fantasy and harem genre based anime.  BOOM!!!!! Mic drop.",
            "date": "2018-09-26T09:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 290063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=290063"
        },
        {
            "content": "I originally watched this because it has a ton of 1-star reviews, and I felt like watching something truly horrible and cringe-worthy!\r\nUnfortunately that plan was foiled, because it's not half as bad as people say, just exceptionally mediocre and not really worth anyone's time. I didn't suffer too much watching it, but it's a certainty I won't remember a thing about it a week from now either.\r\nI think it gets all those one star reviews because some people get pissed off by the fact anime studios get away with this level of uninspired mediocrity! But in reality, it's still competently made anime, and deserves asolid 5/10.\\n\\n\r\nIt doesn't deserve your attention though -  there are literally hundreds of better shows out there!\\n\\n\r\nThe Good:\\n\r\nSome of the girls don't follow the standard tropes entirely. They still aren't all that interesting, but sometimes mildly entertaining, and they're more or less likeable too. Yay.\\n\\n\r\nThe Bad:\\n\r\nThey completely failed to do anything remotely interesting with the concept of having a character go back in time and be responsible for the formation of ancient myths.\\n\\n\r\nThe Ugly:\\n\r\nThousands of nameless expendable men get slaughtered without anyone giving a shit. This show really underscores how little value our civilization ascribes to men who aren't \"alpha\".",
            "date": "2018-09-25T07:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 289952,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6024255.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/MikaelX",
                "username": "MikaelX"
            },
            "url": "https://myanimelist.net/reviews.php?id=289952"
        }
    ],
    [
        {
            "content": "It scratches the Isekai itch like a gas station satisfies my hunger for pizza.  It tastes bad, but still tastes like pizza so you eat it anyways.\r\nThere's not much more to say about it, but MAL want me to write a longer review. The relationship between the MC and his love interest is the highlight of the series, but it gets the least amount of time. Throw in a healthy amount of fan service and blah strategy war scenes, and that about sums it up.\r\nThat said, I still watched the whole thing and can't say I didn't like it, but this anime is trashand so am I.",
            "date": "2018-09-22T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 289710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7206649.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/animeFreakFred",
                "username": "animeFreakFred"
            },
            "url": "https://myanimelist.net/reviews.php?id=289710"
        },
        {
            "content": "Hyakuren no Haou to Seiyaku no Valkyria had a good concept for an isekai anime but was unfortunately rushed and cheated on by budget.\r\nThe pet peeves I had in this anime were: \r\nCGI budget cuts; Grandcrest Senki had budget cuts too but they tried to hide it really well. The Budget cuts I think also caused the mediocre ending.\r\nMain character is weak asf, and does nothing besides google search strategies...\r\nThe antagonists were just flat characters.\r\nThe relationship the main character had with the girl back in Japan was a good excuse to not touch his harem (IMO more anime should do this excuse instead of makingthe main character a beta male) but their relationship was really bland and unrealistic.\\n\\n\r\nThis anime has an anime original ending, even changing the girl he ends up with.\\n\\n\\n\r\nVerdict: reboot this anime, this time with a good studio, the budget put into this show is not enough for a strategic/war anime.",
            "date": "2018-09-22T12:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 289694,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7151899.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Random_Noobsss",
                "username": "Random_Noobsss"
            },
            "url": "https://myanimelist.net/reviews.php?id=289694"
        },
        {
            "content": "Let me start off by saying of all the isekai anime I watched in my life, I’ve never been in any kind of pain until I watched this,Let me start with the MC. how do I describe him in one word? Annoying. There is something about the MC of this anime that I really hate, more than in any other isekai anime like kirito and someone else I forgot the name. \r\nThere is not much to say about story art and sound so I’ll just move on to the characters. First thing we see from the anime Is a war and it said that thecharacter had been stuck in that world for quite a while now. so what? no background of the character of some sort.How did he become the patriarch? no explanation whatsoever, Girls are shit, They’re not even good considering this is an harem anime and the antagonist fucking piss me off, first of all he is stupid. I do not know why he’s made in the first place, I feel like they could have made someone a lot better than that piece of shit.\\n\\n\r\nThere are some moments (I guess) but it still bad quality for me, The character just uses strategies from the previous general through a fucking solar powered phone that can make a fucking call to the other world and can even surf the fucking net. By that I got more confused. To summarise it, I guess one of the shows at the bad end in the isekai genre.",
            "date": "2018-08-10T04:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 286080,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7222703.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Michael0617",
                "username": "Michael0617"
            },
            "url": "https://myanimelist.net/reviews.php?id=286080"
        },
        {
            "content": "LN reader here. I'd say that the Anime was just a mess. Its one of the cases where the source is decent yet the anime just does a bad job at adapting the source material. \r\nI'm one of the few who enjoyed the ride, but was majorly disappointed at how much they cut  content and world building (which the anime desperately needed). \r\nFor a rookie director, I'd say he did a bad job at his first try. The anime is too rushed, cut out the lore, the worldbuilding, especially the much needed characterization for each of the characters. \r\n Unlike how the romance wasportrayed in the anime, The source went the harem route.\\n\\n\r\nOverall, this is just a badly adapted anime. I enjoyed it, but with how much content, world building, and lore they skipped throughout the show? I'll say it once again. The anime is just a mess.",
            "date": "2018-10-01T01:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 290591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/IzayoiArashi",
                "username": "IzayoiArashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=290591"
        },
        {
            "content": "*Review re-written upon completing the show* \r\nAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\r\nThis might be the worst thing I’ve ever seen with my two eyes and I’ve seen Boku no Pico. Never have I seen a show that has had such a profound effect on me as a person, it’s not a good effect but that’s something this show can hang its hat on. If I’m lucky, maybe the show will hang itself along with its hat. If MAL would let me, I would be going into the negatives in terms of quality. Hyakuren no Haou to Seiyaku no Valkyria is a complete and utter failure of a story. I’ve neverbeen more happy to have an ad-blocker because, without it, I would have to hunt down the studio and get the pennies that they earned in revenue back. Everyone that was involved with this show is now stained with its filth. I hope they never live to be rid of it. \\n\\n\r\nAbsolutely nothing about this show works. The characters are unfathomably stupid, the animation is that of something out a half melted flip book that’s been shoved up the ass of one of the awful CG horses the show insists on showing us at least twice and episode. The story is incomprehensible and somehow manages to go so far into nowhere that it loops back around into somewhere. And that somewhere is a depth of Hell that even Satan fears entry into. \\n\\n\r\nI beg of you, don’t watch this show. Watch literally anything else. Watch your dog eat his own shit. Watch your mother eat the dog as it eats that very shit. Watch someone ritually sacrifice themselves with a soup spoon. Just don’t watch this. Please.\\n\\n\\n\\n",
            "date": "2018-08-20T18:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 287005,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5956412.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Big-MclargeHuge",
                "username": "Big-MclargeHuge"
            },
            "url": "https://myanimelist.net/reviews.php?id=287005"
        },
        {
            "content": "I gonna start this review by saying \"I FRICKING LOVE THIS SHOW!!!!!!!\" for the same reasons that I love \"Isekai wa Smartphone to Tomo ni\" so much. The reasons being \"IT\"S PRETTY BAD\" but it's \"NOT BORING\". \r\n     In this review, I gonna focus on a good part of the show because I don't see a point of taking this show seriously anyway. If you want to know about the in-dept analysis of the bad part then just read any reviews beside this one.\r\n      I rate this anime 4.5/10 in termof quality but that number does not reflect my enjoyment of it because I do enjoy this anime a lot.\\n\\n\r\n     Here's the reasons why.\\n\\n\r\n     Hyakuren no Haou to Seiyaku no Valkyria is a generic-not so generic Isekai anime. Because most of the characters traits and settings is extremely generic but There's something interesting about it. \\n\\n\r\n     First is the main character \"Yuuto\". Who couldn't fight at all but he use his \"solar power smartphone\" to google things for his advantage via what I call a \"Holy wifi hotspot\" that sits in his throne room and his girlfriend's room(?) I guess..... \\n\r\nAnd he isn't that dense so he's not irritates me like some other harem protagonist.\\n\\n\r\n     Second is the art style. It's not what I would call good. \\n\r\nBut I do like some details in it ,like the fact that the infantry has decent looking helmets, shields ,spears equipped instead of some stupid \"costume armor\". Granted, It's not historically accurate but at least they try. The infantry even use sword as a sidearm instead of main weapon like some other show.\\n\\n\r\n     Third is the characters has a proper goal. Yuuto wants to get back to his girlfriend. The girls want him. Again, It's not much but at least it's something.\\n\r\nThe harem love him because in their point of views, he done a great favor for them and he is a brilliant mind. And he did express his feeling that he's only love his girlfriend.\\n\\n\r\n    Finally, This anime \"makes sense\" of non sense in a way. For example, Yuuto said something like \"The superpower in some people makes no goddamn sense.\" and other characters basically said \"That's how it is, deal with it fam.\" (Obviously, This is not what they said but I can't be bother to check the actual script.) \\n\r\n    And there's a scene when one of the main character use a katana cut right through a thick bronze dagger. Which seems to makes no sense but the katana's edge with hamon can be hardening up to 62+ HRC and bronze's edge can be harden up to around 44 HRC by hammering the edge. Normally you can't cut through that even with that different hardness but they establish that superpower did exist so it kinda makes sense? \\n\\n\r\n    Watching this anime is very entertaining despite it's obvious flaws. It's not as bad as \"Isekai wa Smartphone to Tomo ni\" but it's equally entertaining.\\n\\n\r\n     I highly recommend this anime but please go into it with the same mindset like when you watching \"The room (2003)\" or \"Shark Exorcist (2015)\". This is not a good anime by any means but I'm sure you'll enjoy it with the a certain mindset.\\n\r\nMaybe consider drink 6 shots of vodka before watching it (If you not a minor of course).",
            "date": "2018-08-19T09:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 286876,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874594.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/pomrapea",
                "username": "pomrapea"
            },
            "url": "https://myanimelist.net/reviews.php?id=286876"
        },
        {
            "content": "So far, this show feels mediocre in every respect. And when you compare it to the currently airing Isekai shows like the third season of Overlord and How not to Summon a Demon Lord, it can barely hold a candle to them. It doesn't feel serious enough because of the bubbly harem and their trope personalities. It doesn't feel comedic enough because the main character is boring as all heck. It is stuck in a limbo between comedy and seriousness that just feels bad. One assumes that his phone is capable of charging via solar power but it is never stated; so as far asanyone is concerned, it never runs out of battery for plot convenience. So while the show isn't utterly terrible, at the moment I am only watching it to fill a bit of time while I wait for episodes of other airing shows.",
            "date": "2018-08-05T04:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 285631,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5130485.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Quagsir",
                "username": "Quagsir"
            },
            "url": "https://myanimelist.net/reviews.php?id=285631"
        },
        {
            "content": "First things first: turn your brain off to watch this.\r\nAnd no, I don't mean in a digibro-overanalyzer way, just the critique part of the brain.\r\nYou don't need it here. You're here to watch funny shit. Here's some.\r\nThe scores above are not explanatory enough to define this anime so I will put some more here, also giving half points where necessary.\r\nPlot: 8\r\nCompleteness: 5\r\nEcchi: almost non existent\r\nConclusion: 9\r\nArt style: 7\r\nCGI: 5\r\nSound: 6\r\nCharacters: 7\r\nEnjoyment: 7.5\r\nOverall: 7.5\r\nPlot and completeness:\r\nI didn't read the manga, but I feel an episode 1 is missing.\r\nWorld building is rushed and some characters (Mizuki) are taken for granted.\r\nThe ending is a little short too, Ifeel there could've been an extra episode about the last episode's last minute.\\n\r\nApart from that, assuming the manga has those parts, the plot is complete enough.\\n\r\nThe events happening are what you expect from this type of story. Don't think too much about it.\\n\\n\r\nAs for the story itself, there's no lack of wholesomeness and the tropes are your typical isekai ones, and if you like isekais like me, you're set!\\n\\n\r\nThe ecchi!\\n\r\nDespite the anime being harem-ish, there's little to no ecchi, and literally only one scene on ep 10 could be un-cropped for a BD version. Apart from that maybe two minute of baths with towels on and not much convenient censoring. Apart from one washing scene all of it is fairly innocent and not lewd.\\n\r\nAnd all the girls' feelings are genuine and there's close to no unneeded \"lewd for the sake of it\", you can literally feel the affection over the fanservice.\\n\r\nSurprisingly refreshing considering the genre.\\n\\n\r\nAlso MC is consistently being faithful to his love interest(s) without acting clueless/dense around any of the girls more than necessary, and after that, the relationship progress is not lost. You know, that good trait, of not being a cardboard (that people hate a lot on characters like Kirito, for example). More harem anime need a MC like this one.\\n\\n\r\nConclusion:\\n\r\nNot spoiling.\\n\r\nIt's not open nor unsatisfying in any way.\\n\r\n(other than making you want an extra episode with last minute's contents that is)\\n\\n\r\nArt style and CGI:\\n\r\nThe art stile is average, but it's generally good looking and the quality remains consistent throughout the story.\\n\r\nThere's a fairly high use of CGI, especially for armies, chariots and arrows. Some is almost undistinguishable, some are a little less well done, but there's no crap one. In this regard this anime did better than a lot of \"good\" anime that instead make use of occasional low budget garbage CGI for some scenes (ex. Lancer in some scenes of the Fate HF Movie I), if not consistently using it for stuff in background (ex. Girls' Last Tour).\\n\r\nSo overall not appalling CGI, mostly decent, but used a little too often than necessary.\\n\\n\r\nSound:\\n\r\nThe music wasn't bad, but I can't remember any tune I heard during the anime after watching it.\\n\r\nSo decent but not memorable. 6/10 for me.\\n\\n\r\nCharacters:\\n\r\nNothing out of ordinary.\\n\r\nThere are stereotypes, but the characters are not flat as cardboard.\\n\r\nExcept maybe some specific ones that suffered the lack of a first episode with world building.\\n\\n\r\nEnjoyment and overall score\\n\r\nIn the end despite the plot lacking complexity, it was a good ride, and left me satisfied with the ending, and no need for a season two.\\n\\n\r\nedit: apparently the anime took an original turn (less harem) compared to the source material (more harem, different main girl), and I thank them for that...romance > harem, always.\\n\r\nIf only they didn't cut world building...I would give this a 9/10 and thank them for improving the source material, lol.",
            "date": "2019-04-10T07:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 305957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5670200.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FullyCharged",
                "username": "FullyCharged"
            },
            "url": "https://myanimelist.net/reviews.php?id=305957"
        },
        {
            "content": "the master of ragnarok.. oh man..\r\nso usually, I don't really dislike the isekai, harem category, but.. this one is a bit different..\r\nso, basically, I kind of got in touch with this anime by seeing posts on instagram, on youtube, on twitter, etc, you get the idea.\r\nand, if you are like me, anime fan that has passion for isekais and harems, you would probably search it up, and watch the entire season, right?.\r\nwell, yes, that's what happend first.. I searched it up, watched the first few episodes, but it was kind of lacking..\r\nso, first I'm going to start with the story.\r\nI was kind of lazy torewatch the series, but I looked at other reviews, so don't bash on me..\\n\r\nthe story is kind of.. meh..\\n\r\nlike, you are thrown into the midst into the battle, without any context.\\n\r\nthis may be personal prefference though.\\n\r\nI kind of like that the creators of the anime did implement some tactics used in history, upping my knowledge of history and stuff, which I haven't really seen before in other animes.\\n\r\nof course, this is personal prefference too, if you don't really like repeating history class, and want to see the harem and action, then you might not really like it.\\n\\n\\n\r\nthe art is.. arguable I guess, judging from the reviews, most people don't really like it,\\n\r\nI mean, the charecters don't look really ugly, but there are some scenes that look kind of bad.. but hey, it has some waifus, they look alright, so I guess..?\\n\\n\r\nthe sound isn't really bad, but I don't think it's outstanding or something..\\n\\n\r\nso, next up is enjoyment.\\n\r\nso, other harem animes like isekai wa smartphone and death march (yes, I know that it has some crappy reviews, hear me out)\\n\r\nwere alright, I wanted to sell all the episodes, since it had this cozy harem feeling (personal prefference perhaps, I know some people think smartphone and Death march are bad animes)\\n\r\nhowever, when I watched Hyakuren no haou, it didn't really, have this feeling, or I simply did not notice it..\\n\r\nsure, you get some really hentai edgy scenes, but for the first time, I felt really awkward watching these eps, it's not like I dislike it, but they felt really awkward..\\n\r\nnext up is the fighting and stuff.\\n\r\nyes, he is the strategist and stuff, and you see the waifus fight for him, but I don't really get the feeling he is all superior and the strategist, and no I'm not talking about the fact that he uses tactics that he looked up, no, he just doesn't come off as the mastermind.\\n\r\nmaybe the show would have been more enjoying if yuuto took a more active role on, that he also participated in some fights, but that can be personal prefference.\\n\r\nI didn't really end up enjoying the anime series, and I was relieved that I finished the season, because I'm the type of guy that when he starts something, he finishes it.\\n\r\nand, yes, It felt really relieving that the season ended, and that there was not a second season.\\n\\n\r\nsince people are kind of pointing out the flaws of this anime\\n\r\nI also want to point out that the last episode of the season was kind of lazy, like, yuuto gets sent back to his own world, and he wants to go back.\\n\r\nas the ending scene falls, we see yuuto riding trough town.\\n\r\nbut what about the panther and lightning clan? didn't they take over that fort or something? like, hello? I thought they took over the fort and stuff.\\n\\n\\n\r\noveral, I kind of felt relieved when I finished watching the season, I didn't really look out to watch the episodes, but I finished it.\\n\r\nthe charecters and stuff look alright, decent I guess.. but I didn't really end up enjoying the series.\\n\\n\r\noveral, I give this anime a 6, the charecters look ALRIGHT I guess, and the anime does give you some history lessons, but that's about it I guess.\\n\\n\\n",
            "date": "2019-03-15T16:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 303614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6846527.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Moonlight2390",
                "username": "Moonlight2390"
            },
            "url": "https://myanimelist.net/reviews.php?id=303614"
        },
        {
            "content": "This is basically another version of Isekai wa Smartphone to Tomo ni but with a plot and i find that by having a plot is somewhat makes this anime even worse than isekai.\r\nThe first thing you notice when watching this is how awful it is at introducing you into its world and lords as the most i got out of this is that a bunch of clans are at war, then we have this generic main guy, who is from another world, as the leader of this boring wolf clan wants to bring peace and that's it, oh there's also a bunch of norse mythologiestoss into it too but even that was made boring as hell which is quite an achievement. \\n\r\nI couldn't even bother myself to at least give a damn about any of the clans as they gave me nothing to care for, not their histories, relationships or even a reason to go to war as they showed nothing, it is like one day they woke up feeling like crap and decided to wage war with other clans and here's the best part, the leader of each clan (beside the wolf) is either a waifu bait waiting to be put into the harem or generic villain aholes, trust me i'm not being mean when calling them aholes, its because they actually act like aholes in the anime.\\n\r\nI tried to find at least something good about this anime seriously i really do but what really killed it for me was the characters themselves as these female characters are the most boring and generic even by cliche standard as they have zero development here beside the fact they all love the same the most generic and boring protagonist of all harem anime, hell the antagonists of this anime aren't any better either as they have zero charm, zero personality and either act like an ahole, smug like an ahole or just being an ahole.\\n\r\nNow the final nail in the coffin for this anime is how god awful the ending was. It is basically the freaking pineapple topping of this sh*t of a mess pizza",
            "date": "2019-01-10T02:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 298622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6207270.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Melody_scarlet",
                "username": "Melody_scarlet"
            },
            "url": "https://myanimelist.net/reviews.php?id=298622"
        },
        {
            "content": "The only reason I'm writing this review is to simply try and get others to understand this anime. Simply put this isn't an anime you watch seriously or with the idea that it can be a master piece. This is an anime that you can turn your brain off and enjoy without serious thinking or need to actually remember everything from the beginning.\r\nA lot of people draw comparisons to In Another World With My Smartphone, as someone who hasn't seen this I feel like I enjoyed this anime more then other people. Now yes there is some inconsistencies with the show but it was adecent show.\\n\\n\r\nI prefer Ecchi anime mostly, Harem not so much as it can really detract from the show. With that said some of the scenes are a bit off putting but all in all a lot of them were pretty funny if you don't think of them as sexy scenes and more as Ecchi. Again I would mention trying not to think to hard during this anime as you ruin things more often then not rather then just enjoying the humor of the show.\\n\\n\r\nI would say it's not a very good story as the pacing was a little weird and the way it ends is just of putting at best, due to it not having a second season. It was good to watch if you don't have anything to watch and enjoy Ecchi other then that I really can't see why you would like this anime.\\n\\n\r\nFinal thought most of the backlash this anime gets is from being bland, which in the case of the story I can kinda understand. With that in mind it's not completely terrible I personally want to see a second season due to the idea of Norse Mythology and the humor of the show. Seeing the poor reviews makes that near impossible, mostly because they don't like the type of anime be it Ecchi/Harem or Isekai.",
            "date": "2018-12-13T08:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 295711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6415559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheOldFallen",
                "username": "TheOldFallen"
            },
            "url": "https://myanimelist.net/reviews.php?id=295711"
        },
        {
            "content": "Wow I REALLY wish I had read the reviews before watching this.\r\nOKAY EVERYONE HAS TO UNDERSTAND THE FOLLOWING:\r\nThis. Is. A. Cumberground.\r\n(someone who is so useless, they just serve to take up space)\r\nStory 1/10:\r\nIt's basically a pathetic imitation of Isekai wa Smartphone to Tomo-ni.\r\nThe smartphone, the unexplainable harem, the new world... And to top it all off, it doesn't even show us the character adapting to the new world. This could be Isekai wa Smartphone to Tomo-ni 2 and nobody can correct me on this. The story seems to be missing its season one because the author just randomly decided it would be a such amarvelous idea to distinguish this anime from the rest by, \"Eureka!\", making the story BEGIN 2 years after our main character (a lovely guy btw, but ill get to that) gets teleported(?), got sucked into a black hole (?), eaten by a giant ass spider (?) or ate a spider(?), WE DON'T KNOW HOW HE GOT THERE and we NEVER will! Seriously, it's like Pac Man ate the story. It's just... There is no story. The sole reason why I didn't give the story a 1 is because...\\n\r\nOH (surprise muthafuka) I DID GIVE IT A 1.\\n\\n\r\nArt 5/10:\\n\\n\r\nI think the art is decent looking. It's not ugly but there is no variety and/or uniqueness whatsoever. All the main characters look pretty much the same and the others are covered in wrinkles. I didn't quite understand the point of having the unimportant characters be the most unique looking ones but if that suits your taste, don't let me ruin your fun\\n\\n\r\nSound 7/10:\\n\\n\r\nWas surprised by the decency of the songs, honestly the best part of the anime, that's all I can say. \\n\\n\r\nCharacter 1/10:\\n\\n\r\nNo unique people, every character was as predictable as if I was Sherlock Holmes and the girls seemed quite dumb. They didn't seem to have their own will but wait, the main character 's info is a must cuz he's just mind-blowing lame\\n\\n\r\nMain: Didn't bother to remember the name (that already says a lot but let's continue cuz he's unbelievable.) So nameless here is described as the perfect human being to ever exist, smart, handsome, savior of all mankind etc etc. really think of the perfect person ever, he's that x 10000000000. but rly, no.\\n\\n\r\nnow let's be realistic, he's trash. without his sun-powered (don't ask) smartphone to learn him battle strategies and whatever other shitty things bookworms know, he just the average dumb teen. BUT WAIT, tHeRe'S mOrE, forgot to mention has a sick freako cuz he forces women to call him ''papa'' or ''big bro'' and become part of his unending family (???), I don't even know what to say anymore.\\n\\n\r\nEnjoyment 5/10:\\n\\n\r\nNow, \"Why is the enjoyment score so high after she said all those mean things in her review?\"\\n\r\nThe reason I somewhat enjoyed the episode is that it was so pathetic, it became funny. For example, when the new girl fell in love so easily, or when the story jumped too quickly forward and it didn't make sense or when the two girls came to wake the guy and one was trying to seduce him...\\n\\n\r\nOverall 4/10:\\n\\n\r\nI would be tempted to recommend this anime to people I don't like. This is perfect to watch if you're feeling bad to remind you there are worse things then whatever you might have done.\\n\\n\r\nThanks for reading, hope you don't watch.\\n\r\n(But if you do watch, I can be your venting pal.)",
            "date": "2018-11-27T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 294842,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543039.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Vicky-chama",
                "username": "Vicky-chama"
            },
            "url": "https://myanimelist.net/reviews.php?id=294842"
        },
        {
            "content": "Overall I think this entire series is a one big fan service, boring plot? yes, boring characters ? yes, but will you enjoy it? yes, especially if you're the type who is frustrated in life and would say \"I wish I was transported to the Anime world!!!\" \r\nthe plot as I said is not that great, in fact it's dreadful..there's a lot of unanswered questions regarding the magic and who is really the most powerful??..they would introduce someone only to be stepped aside.\r\nThe Characters are one of the most useless I've ever seen, they are just there to make Yuuto great like Kirito 2.0, Yuutois a kind MC but pretty bland as well plus..WHAT'S THE POINT OF THE HAREM IF THE GUY ALREADY CHOOSES A GIRL FROM EPISODE 1!!! seriously the Harem is pointless throwing themselves into the guy that could never love them is a dumb move. not to mention the story was a mess\\n\r\nThe only Character that I like is Sigrune because she's the only one who has a bit of a story that is going on\\n\\n\r\nThe Art was okay I love it I love the designs especially Sigrune but the sounds we're forgettable..one thing i like here though is that there are some few episodes that I enjoyed, particularly regarding Effy I really like that they told us what happened to her after being rescued by Yuuto.\\n\\n\r\nbut overall I feel like this anime is mediocre but i do think you'll enjoy this, just don't expect something big",
            "date": "2018-11-16T07:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 294153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=294153"
        },
        {
            "content": "JUST SO YOU KNOW THERE WILL BE MINOR SPOILERS BUT IF I DONT SAY THEM YOU WILL THINK YOU WOULD NEED TO WATCH THIS WHEN YOU DEFINITELY SHOULDN'T.\r\nNOW IM POSITIVE THAT OTHERS HAVE SAID THIS BUT IF YOUR LIKE ME YOU DONT WANT TO READ A BOOK TO SEE IF YOU MIGHT WANT TO SEE THIS OR NOT.\r\nSo this show literally started two YEARS AFTER the MC was sent to another world and expects you to actually understand what happened. TBH if you didn't watch the OP, you would never understand exactly what happened. So you get to watch an MC get woman after womanbecome his family or he threatens to burn there villages down like he supposedly did in the past, and fall in love with him and then he only cares about a girl he liked in his world that was like 12 when he was sent away.\\n\r\nAfter 12 episodes of nonsense like him getting most of his army killed in every battle and not caring at all, it then ends with him.................\\n\\n\\n\r\nAsking the 15 year old (same age btw) to marry him bc she wants to go back to that world with him. \\n\r\nO YEA THEN IT FAST FORWARD AGAIN AND NOW HE IS A KING AND IT SEEMS THE WAR IS OVER AND HIS GIRL IS THERE WITH HIM. AND IT SEEMS HIS HAREM DOESN'T CARE AT ALLTHAT HE BROUGHT HER WITH HIM.\\n\r\nThe only thing I liked was Felicia and the only way this could have even been a 5 instead of a 3 is if it had actual nudity or if when he comes back again with Mitsuki, she sees how much his harem cares about him and decides to share.\\n\\n\r\n.                                           THE END LITERALLY!!\\n",
            "date": "2018-09-22T12:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 289695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/L-Mo-Reppin",
                "username": "L-Mo-Reppin"
            },
            "url": "https://myanimelist.net/reviews.php?id=289695"
        },
        {
            "content": "This is my first anime review, and is most likely going to be my last. I want to review this for the people who watch anime (like me) as a form of mindless entertainment rather than for intellectual stimulation.\r\nI thoroughly enjoy certain anime with very little plot elements and or character development, if you don't believe me just look at my anime list and cringe in disapproval.  But this anime is quickly becoming the least enjoyable form of entertainment that I have seen in a near decade despite my tastes.\r\nThis anime has one dimensional characters. A setting that is completely devoid of any realism,and an unholy cookie cutter MC who's as dumb as a brick. Usually I wouldn't mind any of that, but this anime takes it to a point where it's hard to enjoy. It's literally waifubait. I don't know if that's a slang word in this community, but I'm using it. This anime is strictly for people who like \"pretty anime girls\" with absolutely no redeeming factors other than their attractiveness. \\n\\n\r\nWhat am I talking about? Well, lets delve into this roller coaster of a dumpster fire. I don't want to waste to much of my time so I'm just going to point out certain points that make me face palm. Well, the entire anime makes me face palm so I'm just going to go over two major points that are pretty ridiculous to me.\\n\\n\r\n1.  The first thing that caught me off guard in episode one when the council came to a rather reasonable conclusion to NOT help the horn clan during an invasion.\\n\\n\r\nThey had just conquered the horn clan after a WAR mind you, and created an oath. Now, in the story the horn and wolf clans had a history of hostility; and it wasn't until recently when Mr. Iamaniceguy took over and was able to overthrow the horn clan winning the back and forth war. \\n\\n\r\nDuring a council meeting it was reveled that the horn clan was going to be invaded by around ten thousand troops. The council members casually talk about how even though an oath was in place it shouldn't matter if they [wolf clan] didn't help, meaning that it wasn't a big deal. \\n\\n\r\nIn any normal situation someone would observe their reactions and try to convince the council to change their minds to increase their charisma further within the wolf clan in order to prevent a Judas and Jesus situation, or something similar. However this idiot throws a tantrum and simply states that it would \"ruin\" the reputation of the wolf clan. \\n\\n\r\nNow I could write a short story or a full length novel on why his little tantrum was immature and idiotic, but I want to keep this review brief and just state that any reasonable human being would understand why the \"council\" or any of the wolf clan would be reluctant to help the horn clan and try to reason with them in order to set an example and prove himself further within the clan. There's is a myriad of other political reasons why it is idiotic to do what he did, but I think I have made my point. I also want to state that his outburst could have been used as a plot elements to have an enemy within the wolf clan to put more depth into the story. But you know, na.\\n\\n\r\n2. Having no explanation at all for the setting and completely ignoring basic storytelling rules.\\n\\n\r\nOkay, so we are eight episodes into this garbage fire and we have no idea why the MC is where he is, and or why he has a smartphone with service. Instead of treating it like a major plot element they throw it under the rug. The MC has NO urgency to return, nor does he act like he cares at all about the person he \"loves\". \\n\\n\r\nThis idiot is so one dimensional that nothing has ever fazed him besides the \"oh no! Hot girl is naked in front me\" trope, or something similar. His only concerns throughout the anime involve the waifubots with almost no personality that surround him. Think of a harem/comedy main character that you like, now strip him from any enjoyable traits and you get the MC. He's so daft and uninteresting that it's almost hard to explain. Putting it in words I would say that I wouldn't care if he died. If he was killed in the anime it wouldn't affect me at all.\\n\\n\r\nend of review 3/10. I give it a three because of the waifus. \\n\\n\r\n(God help me, while writing this review I thought of so many things that have urked me about this anime, and it's like a bottomless pit of bad. Stay away at all costs, only watch if you enjoy attractive anime girls, because that's all it has.)\\n",
            "date": "2018-08-30T00:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 287742,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7178322.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/cagekennylz",
                "username": "cagekennylz"
            },
            "url": "https://myanimelist.net/reviews.php?id=287742"
        },
        {
            "content": "Show Summary \r\nHyakuren no Haou to Seiyaku no Valkyria, is a show that tries to combine many aspect to create a rather serious environment, in a world filled with warfare, politics and next gen wincestry. Whilst it tries to cover a broad aspect it doesn't manage to exactly handle one of them correctly except perhaps the battles which is also pushing it to say that. The show tries to implement a serious tones in certain situation but always falls completely flat due to the scenarios it's used in are either don't have any logic to support them or is completely forced BS from hell. \r\nMoreThoughts\\n\r\nFirstly you're thrown into the story with a time skip and i suppose that's fine if it's further broken down in later episodes that could tie into a mystery unveiling.\\n\r\nThe pacing of the story is atrocious with character development being one of the worst i have ever seen. The instances go from 0 - 100 within an episode or two and you're left wondering what the hell is happening. The story attempts to be emotional but fails at every point due to the characters reasoning being either utterly stupid or comes off really dull.\\n\r\nThe first episode had me intrigued in what the series had to offer and it's the episode i can say was good but from there one it's one massive downhill spiral.\\n\\n\\n\r\nShould you watch it ?\\n\r\nNo unless you're masochist who enjoys the pain <3",
            "date": "2018-08-13T17:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 286417,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IntoxiRaptor",
                "username": "IntoxiRaptor"
            },
            "url": "https://myanimelist.net/reviews.php?id=286417"
        },
        {
            "content": "The isekai genre is something of a guilty pleasure of mine. When I was a kid one of my favorite books was A Connecticut Yankee in King Arthur's Court - a trope-defining book written by Mark Twain over 100 years ago which still stands as an American literary classic. It's been adapted & used as the inspiration for dozens of books, cartoons, TV shows, motion pictures, and it could even be argued that it was the precursor to the entire genre in anime today. Based on the descriptions I'd heard of this anime -I- thought this is what I was in for. I could nothave been more wrong.\\n\\n\r\nSome of the most interesting concepts of the book: bringing civilization to the \"uncivilized\" & what would happen if the technological advancements mankind has achieved throughout history had been introduced sooner - are essentially glossed over and not even REMOTELY utilized to their full effect. Instead we get kids & teenagers (who for SOME reason seem to rule every country) drug into this weird incestuous fantasy alliance/cult where all their adult citizenry seem to think this is perfectly normal.\\n\\n\r\nPut aside the fact that we have no idea how he managed to get to this world/point in time, put aside his magical mary-sue solar powered time/space negating smartphone, put aside the isekei & harem tropes, and it's STILL a horrible anime. Bad writing, 1D characters, and a gajillion different bland cultures in a gajillion bland interchangable nation states. I watched 3 or 4 episodes of this and still didn't care one whit about any of the characters. Boring & cringe-worthy are the nicest descriptors I can think of for this show.\\n\\n\r\nDo yourself a favor and don't waste your time. Or watch as much of it as you can stomach and tell me how you managed not to indulge in the fantasy of punching the writer in his junk.",
            "date": "2019-01-06T23:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 298288,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/LazerzGoPew",
                "username": "LazerzGoPew"
            },
            "url": "https://myanimelist.net/reviews.php?id=298288"
        },
        {
            "content": "An anime without a INTRODUCTION and a CLIMAX is found to fail!!\r\nI would just get to the point since there is no use in even trying to write something positive about this anime: WHAT THE FUCK WERE YOU PRODUCERS THINKING RELEASING SUCH A WASTE OF SPACE ANIME WHICH JUST BURNS OUR VALUABLE TIME!!! You wanna know whats wrong with it? Then here are the glorious details:\r\n1) The story line is shitty since it skips over too many arch's and details which is necessary for the development of the story. You want examples? here answer some questions:- How and when does Falecia and the others seeMitsuki's pics. When does Mutsuki comes to know about them? How does the Panther clans witch knows to elevate the spell cast on the Yuuto? How does he defeat stainthor and panther clan on his return? What was the reaction of the girls meeting mutsuki?.........and the shit show goes on.....\\n\r\n2) I felt the character was a homo!!!!! seriously, no kidding. True Love and devotion is one thing but having such a personality for a main character just pisses you off each moment you look at it.\\n\r\n3)Its unbearable for the watchers to make head or tails out of the story when there are no true emotions which can be felt. Frankly it felt like a lame excuse for an anime....\\n\r\n4) Even the LN cover has better portrait of the MC than he has in the anime. I mean were you guys seriously high and stoned when you created this anime? Doesn't the budget you are wasting and energy you are spending on a lost cause doesn't concern you a bit? Does the sense of profit doesn't occur to you guys?\\n\r\nThe ONLY GOOD THING was its graphics and character design for the female characters(the mc and other males look jackass) but that doesn't save the entire anime.\\n\r\nWe International viewers decide which manga and LN to buy only after watching the anime so do you seriously expect me and the others to crack our back accounts and spend the green bucks on this? Hell No....\\n\r\nTHIS ANIME WAS A MISTAKE TO EVEN BEGIN WITH!!",
            "date": "2018-10-26T03:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 292608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6798610.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ZaviourZeno",
                "username": "ZaviourZeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=292608"
        },
        {
            "content": "Well this story revovle's around my two favorite things Norse Mythology something I might aswell major in as I speak Old Norse. My immediate thought's was YES! a Main character who is a king! One of my many kinks for attention grabbing for anime. If you wan't a good review of this skip this i will be HARSH AS POSSIBLE! \r\nMy opinion's and other such thing's.\r\nStory is actually really well could've been better thought out and without spoiling it the end scream's SECOND SEASON! and I'm hooked.\r\n6.5/10 lesser for the cliche's and because it feels like In Another World With My Smartphone! Wait for myreview on that if you think this is brutal!\\n\\n\r\nArt is pretty basic as far as anime goes but it is bright and colorful so a \\n\r\n6/10\\n\\n\r\nThe Sound is pretty poor i don't think i could remember any of the theme's or opening's if you showed them to me. 3/10\\n\\n\\n\r\nCharacter's going The MC is a pushover most people who become king's are brutal and once again a harem protagonist isn't a king...Of soldier's at least. (This doesn't mean that king's can't be nice)\\n\\n\r\nAnd the other's felt like filler stuff-in's. Nuff said. 4/10\\n\\n\r\nEnjoyment? well I love combat and strategies and while I knew most of them the castle carraige walls was pretty new to me. The \"Accuracy\" of Norse Mytho's is also good. But take this with a grain of salt from me as I REALLY LOVE WAR ANIME! See literally all my review's on the other's.\\n\\n\r\n6.5/10 It Eeh.\\n\\n\r\nAnd overall I give it a 3/10 It's not going to hold up to my more favorite anime but then again this is just filler anime to me while I wait for Bleach!",
            "date": "2018-10-18T22:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 292037,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KINGOFALLHAREM",
                "username": "KINGOFALLHAREM"
            },
            "url": "https://myanimelist.net/reviews.php?id=292037"
        },
        {
            "content": "Sin entrar en muchos detalles sobre la historia en sí, el inicio es sumamente confuso ya que te hace pensar que debe haber una precuela que no viste o que estás viendo la segunda temporada así sin más... dejando de lado este detalle la historia se desarrolla muy rápido en un inicio, conforme avanza la historia mejora e incluso llega a meter tramas que podrían ser explotadas.\r\nLo mejor de este anime es sin duda la animación y el sonido, pero los personajes son demasiado cliché (aunque en lo personal a mi no me desagrada ese aspecto), si quieres pasar el rato viendo algo entretenido podríaser un anime aceptable.\\n\\n\r\nEl principal problema: el final. Podría usar un sin fin de adjetivos negativos para describirlo, pero es más sencillo calificarlo simplemente como pésimo. Acaban la historia de tajo, dejan muchas cuestiones de la trama al aire y carece de sentido alguno. Una lástima.",
            "date": "2018-10-15T08:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 291803,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7485644.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Pache-kun",
                "username": "Pache-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=291803"
        }
    ],
    [
        {
            "content": "Oh wait wow can someone just give this anime a first season? get it? ugh\r\nSo what's actually wrong with this anime? two problem.\r\n1. Feels like you're watching a second season of something without ANY background information.\r\n2. Ending is poorly done (too loose and rushed like they don't even care about this anime and let's just throw something to end it, no? hah)\r\nThe whole different universe or \"isekai\" theme started rising since the hype of NGNL and Re:zero. However, as you would've known, there's almost none that could actually pull a decent one let alone become a hype. Right now the theme \"isekai\" itself have abad reputation due to a lot of anime failing at this theme. And as you would've guess, this is one of them. The reputation is already bad enough to make us lose interest, but I wasn't expecting the anime itself to have a problem.\\n\\n\r\nFirst of all, you're thrown into a world where- wait whaaat no this story doesn't start from there it starts after that. And when I say after I mean WAY after that. And when does the anime fills us about it? Never. They never did any proper introduction. There was a brief flashback of explaining but it still doesn't fill us in completely. All we know that the mc is right now at the top of the command and with only that information we're expected to enjoy the show. Yeah we can do that right? no, just no hell no.\\n\\n\r\nThe starting itself was already bad as it is, but it gets worse. Why? Because it's rushed, the whole plot felt so light that it doesn't have any impact whatsoever, and suddenly we're over with it. Not to mention the way that they pull of the ending just proves to us how little they value this anime, at least that is what I conclude after finishing this anime.\\n\\n\r\nTo wrap it up, is this an anime that is worth to watch? My answer is definitely no. This anime will only make you hate the theme \"isekai\" more and if you're a fan of this theme like me, it would be wise to just stay away from animes that make the reputation of the theme \"isekai\" worse like this.",
            "date": "2018-10-07T07:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 291148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685939.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ka2-don",
                "username": "ka2-don"
            },
            "url": "https://myanimelist.net/reviews.php?id=291148"
        },
        {
            "content": "I really  wanted to like this anime, i really did.  I love anime with the isekai premise. But this was just appalling. To summarize this anime I would give you this. Take a story, make a 50 episode series out of it. Now cut it down to 24 episodes. Now cut out the first 12 episodes. Then air the remaining 13-24 episodes. Now you have Hyakuren no Haou.\r\nI was confused on the first episode. After the 4th i started to kinda get it. But I really wanted the back story. They keep hinting on things that happened in the past and that seemsway more interesting than what is currently happening in the story.\\n\\n\r\nIn other isekai type anime  the first episode shows the character being drawn into the world and after that shows his struggles adapting and proving himself to his new allies. This anime starts you in the middle of a battle with his allies already loving him and goes from there. Nothing really changes in the story. It is really blah. I really wanted to like this, i really did. But they tore out all the things that makes this genre awesome and left us with the scraps.",
            "date": "2018-09-24T13:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 289892,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tmask2",
                "username": "tmask2"
            },
            "url": "https://myanimelist.net/reviews.php?id=289892"
        },
        {
            "content": "Okay yahll gotta fuckin chill. \r\nListen, was this a tropefest, literally pulling tactics out of the is SAO book verbatim? No doubt. But damn why can't people like shit without having to worry about every single thing that was taken from a previous anime. Even if it is, for all intensive purposes, 99% intellectual property theft, it doesn't mean its bad in principle. \r\nI enjoyed this shit, even with all its un-originality. If you turn your mind off and just TRY and enjoy it, I think you could have a good time. I know I did. But what do I know, I'm just some internetguy. You do you, I'll do me. \\n\\n",
            "date": "2018-09-23T21:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 289852,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4745752.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/existentialist",
                "username": "existentialist"
            },
            "url": "https://myanimelist.net/reviews.php?id=289852"
        },
        {
            "content": "Even when so many hatefull rattings where done, i liked the idea and charakters and story had interesting twist with bronze age and north mytologi. Only thing the charakters lacked was some reliable background for their skills except the runnes answer. And for harem, their lacked boldnes and behaved  more child like. Also the end episode should also consider explain deeper the bond with Felicia and the fact that he brought with him Mizuki. She loved him more then a sister and she was showing it all the time and the jelousy she felt. So much was skipped that could get deeper explanation howit happen. Give last times episode 10 min shoping 7min plot and 2min whats going on its realy facepalm. So as i said, too short, too fast with story, too much skipping of the story",
            "date": "2018-09-22T23:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 289733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/shark420",
                "username": "shark420"
            },
            "url": "https://myanimelist.net/reviews.php?id=289733"
        },
        {
            "content": "This could've been a very good series given more time to develop the characters and the story more. If this was split into 2-3 seasons, probably could've made a decent anime. \r\nEven after feeling that the whole story was being rushed in the first 11 episodes, they take it one step further in the 12th episode by completely skipping conflict and advancing the MC's romance with the girl back home from a childhood friend (with hints of love) to them becoming spouses. Even though it was an obvious love, they couldn't have made this romance seem more pointless. \r\nAny questions about how the conflicts betweenthe clans ended their fights is completely disregarded when the final episode rolls around. Almost as if it never happened in the first place. \\n\\n\r\nTL;DR The romance is thrown out the window and all of the action is disregarded by the final ep (even though it was pretty disappointing to begin with). \\n\\n\r\nMaybe something to watch if you're looking to waste your time watching mediocre harems, but don't watch the final episode it takes the whole anime from an \"ok\" watch to a \"wow i really just watched the whole thing\" kinda anime.",
            "date": "2018-09-22T21:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 289726,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ExEbba",
                "username": "ExEbba"
            },
            "url": "https://myanimelist.net/reviews.php?id=289726"
        },
        {
            "content": "I can't give this show a horrible score, because I did sit through it. But I do want people to know that it somehow does not have a beginning or an end. It starts 2 years after kid goes to different world, also doesn't give much background to how said kid becomes the leader of a tribe or any of those events, just vaguely references them (there was even some horrific event that they kept talking about but they never actually said what happened, only that people died i guess?). Then the ending skips what would've been the climactic part, not even in a \"watchthe sequel/read the source material for more\" kind of way, they just skip over a huge war that endangered all of the characters.",
            "date": "2018-09-22T20:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 289723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NotSoDeadZombie",
                "username": "NotSoDeadZombie"
            },
            "url": "https://myanimelist.net/reviews.php?id=289723"
        },
        {
            "content": "I think this anime are still enjoyable for me. Yes, it's also one of the bad or worse anime isekai like IWS or Death March, but the history that try to tell are the better for me.\r\nThe characters was good. Just the MC that absolytely worst. If is harem genre, at least try to not like Infinite Stratos personality.\r\nAnd till today, im still enjoyed this anime till the last chapter. The Last chapter was the worst one indeed. I hope to make it 13 episode so on episode 12 not be jump that far. I wanna to know about the war after Yuto came backto Yggdrasil with Mitsuki, any yet, it's already finish. It's most worst episode on this anime i think.",
            "date": "2018-09-22T11:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 289687,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/umam99",
                "username": "umam99"
            },
            "url": "https://myanimelist.net/reviews.php?id=289687"
        },
        {
            "content": "You know those animes that are \"so bad it's good\" and then those ones that are \"so bad it's bad\" right? Yeah well this one is one of the \"so bad that it's funny how bad it is\" animes. I mean at least the story exists and it's not hard to follow what's going on. I can't really say much because there's not much to say about it. It's bad I guess, but it's bad in a funny kind of way? I don't know, I just think that you should ignore the reviews and watch it yourself to see what you think of it, butI mean don't go past episode 3 if you don't like it. At least Yuuto doesn't even participate in combat until episode 11, showing that he isn't Kirito levels of OP because he's not even good at sword fights. Also what's with the solar powered smartphone? Never heard of those before watching the anime. All in all, just a funny anime to watch because of how little they cared about it when making the anime",
            "date": "2018-09-15T16:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 289103,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7110694.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Psychomaniac14",
                "username": "Psychomaniac14"
            },
            "url": "https://myanimelist.net/reviews.php?id=289103"
        },
        {
            "content": "This show has basically taken the worst of the things from the isekai genre and combined them together very poorly. The characters feel very generic, even for this type of show, the action is boring, the visuals are lacking and the sound design and voice acting are not the best.\r\nThe only thing that I've found even remotely enjoyable about this show was the outro music because I couldn't wait for the episodes to end.\r\nI don't know how I made it this far without having convulsions of the amount of cringe that I've witnessed. I do feel a little bit emotionally scarred tho. \r\nDon't watch this,and if you made it to episode 3 or 4, believe me, it won't get better, it will only get worse.\\n\\n\r\nIf you want to watch something that is actually good this season, then watch Demon Lord from another world or if you are into the classics Twelve kingdoms, believe me, it's good.",
            "date": "2018-09-15T15:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 289092,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7002041.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Tgxxxxx",
                "username": "Tgxxxxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=289092"
        },
        {
            "content": "This anime is god awful shit.\r\nI have tried continuously to fully watch the first episode but I can't get past the first few minutes before I close the tab. I rather be forced to watch Boku no Pico nonstop for eternity than this shit. It may be an another world anime or whatsoever but it just starts it out mid story, no explanation to what happened, the anime starts in the middle of the fucking story. This anime is the worst shit I have ever seen where even the Emoji Movie made me stop watching it midway but at least the first few minutes didn'tmake me stop watching.",
            "date": "2018-09-11T11:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 288760,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6556477.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/RussianAnimeGod",
                "username": "RussianAnimeGod"
            },
            "url": "https://myanimelist.net/reviews.php?id=288760"
        },
        {
            "content": "It is your not so typical Isekai Anime/Manga/Novel\r\nsince most of the Isekais MC's are more on fighting than strategizing.\r\nYou could say it is bad \"SINCE\" unlike other Isekais, it didn't show how did\r\nthe MC ended up there. Second reason, the genre or/and the setting is outdated I mean, nowadays we know that this kind of mangas will either contain Mythical creatures or the almost mentioned OP metal the \"Adamantite\".\r\nThis one wouldn't have been bad \"IF ONLY\" this was released a 5-10 years ago.\r\nThe choice of using weapons in the \"Norse Mythology\" as buffs or the so-called \"runes\"(watch it so that you could know more). Isgood since it is unique but it is 2018 and the genre is outdated but if that thing isn't considered... Man. this is so good.\\n\\n\r\nOh well, its just my review and I have read the Light Novel + I haven't watched all the latest episodes. Thus, it's all up to you... ALL UP TO YOUUUUUUU (AIR SUPPLY) MAH BOI.\\n\\n\r\n8/10 is my first impression :)",
            "date": "2018-09-11T04:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 288740,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7146050.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AdminWeeb",
                "username": "AdminWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=288740"
        },
        {
            "content": "This anime has no actual plot. They just told us a summary of what happened when the main character first came to the other world. It seemed more like a second season of the show. The war between the clans was trash, in the first episode that wasn’t even close to a phalanx, there just some troops running in the battle, not even close to the real thing. \r\nThe art isn’t that bad, it’s just mediocre, but that doesn’t make the show any better. \r\nThe characters are generic. The main character like any other in a harem show that gets all the girls. \r\nIf youhaven’t understand already I didn’t enjoy a minute of this anime, it was boring seeing all the cliche scenes again and again. \\n\r\nOverall I give it an 1/10 and I don’t recommend it",
            "date": "2018-08-23T09:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 287204,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6504686.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/AnimeLoverMeow",
                "username": "AnimeLoverMeow"
            },
            "url": "https://myanimelist.net/reviews.php?id=287204"
        }
    ]
]