[
    [
        {
            "content": "Before watching this anime I thought to myself, \"This is probably one of those harems ecchi shows where a lot of girls fall for the same guy.\" Well it was almost that. \r\nInstead of a lot of girls there was only two, Ibuki Ikaruga and Ayame Ikaruga. They fall in love with Yoichi Karasuma. But unlike many harems this anime has a credible storyline. Unknowingly Ibuki has a fiance. After many years he has finally come to wed his belowed. That's basically the jist of it. Yoichi and the girls try to overcome obstacles and challenges that are thrown at them.\r\nAIC is known for creatingsome of the best animation in the anime world and they don't disappoint with Asu no Yoichi. Color, character design and background are all animated really well. One of the bright spots in this anime is \"Washizu visions\" and \"Tsubasa visions.\" These are \"visions\" the respective character has funny visions of what he or she believes will happen.\\n\\n\r\nEvery character plays a part in Asu no Yoichi. There isn't a lot of character development but interaction between each character is huge. They all have a special moment with each other. Secondary characters such as Washizu also play a big part in the anime. They all have a big part during the last few episodes.\\n\\n\r\nThere are many golden comedy moments in this anime. They all contribute to the enjoyment level of this anime. Asu no Yoichi is enjoyable and fun to watch. On the other hand it doesn't have many epic moments that will make you remember this anime. If you have the time this you should check this anime out.\\n",
            "date": "2009-04-14T19:26:00+00:00",
            "helpful_count": 86,
            "mal_id": 14160,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48866.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ManU-Alchemist",
                "username": "ManU-Alchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=14160"
        },
        {
            "content": "Asu no Yoichi is an average anime that lacks a lot to be good so don't watch it but if you want to, go ahead read what you're getting into.\r\nStory\r\nIt's a Harem/Ecchi anime so you shouldn't expect anything special from this, the story is about Yoichi an overpowered samurai (but that makes sense because he spent his whole life training to be the best samurai), a samurai that wants to expand his knowledge on other abilities that he doesn't know so his father sends him to a Dojo that specializes in the same ability (really?), he wants to see if they can teach him somethingnew, he gets a Harem of sisters where 2 of them are interested in him, the problem is that he has no social skills whatsoever so he doesn't know how to behave to the situations he or the sisters puts him into, in the way they stumble upon other people from other Dojos with different abilities and kick their butts, and that's it, the story is just average.\\n\\n\r\nArt & Sound\\n\r\nThe art is good, could have been better, but it was well animated but not smooth.\\n\r\nThe sound was good, the music and voice acting were good.\\n\\n\r\nCharacter\\n\r\nThe character development was ok, i liked only one of the sisters, Ayame, i also really liked Washizu he was hilarious with Torigaya who in every episode gets smaller and smaller (and only in the manga you will know the reason behind this apparently) every other character was just average but Yoichi was my least favorite, he was too naive.\\n\\n\r\nEnjoyment\\n\r\nI really liked a lot the comedy Washizu and Torigaya had to offer, but they appeared from time to time so it was less enyojable, Washizu was the \\n\r\nbest character (which didn't appear a lot) and i liked Ayame too, which makes them the best part of the anime, also the weak ending didn't help, it's an average anime.",
            "date": "2015-08-04T13:42:00+00:00",
            "helpful_count": 35,
            "mal_id": 195162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195162"
        },
        {
            "content": "First review I’ve done-\r\nIt doesn’t matter significantly of what others think about a particular anime. Everyone has their own taste, so in general, a review should be based purely on what you thought about it. Prior to watching Asu no Yoichi!I did a little research on it and came to the conclusion that it’s a harem anime. New to this kind of genre, I took the liberty of trying it and at the end I really enjoyed it.\r\nAsu no Yoichi! Is about a 17 year old samurai who has lived in a rural area for most of his life along with his father and someanimals to company him. One day his father asks him to move to the city as he can’t make him stronger and also for experience. He seizes this opportunity and starts living with 4 sisters to assist him with his training. Throughout the show the protagonist of the story Yoichi along with his acquaintances, embark on various tasks that need addressing.\\n\\n\r\nStoryline- 5/10\\n\r\nThe anime lacked a strong plot, it basically went like this-\\n\r\nBoy living in the mountains-moves to the city-has to survive in the city-train in the city-save some of his friends from enemies that aren’t even portrayed as strong compared to him. In between all this, there is plenty of romance as well as humor to keep you glued into watching it. \\n\r\nAsu no Yoichi doesn’t really have a strong storyline, its basically a bunch of short scenarios put together to form the first season.\\n\r\n Also it felt as if it was a little rushed towards the end but it also leaves an opening for a second season. \\n\\n\r\nart-8/10\\n\r\nThe art was done pretty well and the company who made the show are used to producing shows with good quality art.\\n\\n\r\nSound- 8/10\\n\r\nNice selection of music for each moment. Can’t really emphasize enough for this area, as you wouldn’t tend to pay much attention to it.  That said, the intro music and the end sounded all right.\\n\\n\r\nCharacter-6/10\\n\r\nThere wasn’t much character development throughout the series. However, there was at least an episode dedicated to the main characters that explored them more thoroughly and there is a bit of interaction between one another. Also Yoichi was overpowered and unlike other typical ecchi harem anime’s, this one only has roughly 3 girls that are attracted to the protagonist.\\n\\n\r\nEnjoyment-9/10\\n\r\nLoved it so much that I practically finished it within 24 hours. What I liked the most about Asu no Yoichi! Was the humor, throughout the episodes, there is plenty of it. \\n\\n\r\nOverall-7/10\\n\r\nIt’s really an anime in which you can sit back and relax too offering you some enjoyable entertainment and isn’t meant to be too serious. \\n",
            "date": "2013-06-29T20:19:00+00:00",
            "helpful_count": 25,
            "mal_id": 103061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2664185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lelelel",
                "username": "lelelel"
            },
            "url": "https://myanimelist.net/reviews.php?id=103061"
        },
        {
            "content": "Im going to start off on a bad note because i feel that this mini series lacked a plot and has a pathetic excuse for one. HOWEVER this anime wasnt particularly bad unless you actually found the plot interesting(like i did) only to be disappointed that it was just to make the synopsis look pretty.\r\nThe one thing i did enjoy the most were the characters. Each character of the ikaruga household were unique and was interesting to watch the character development of each individual in the earlier episodes. A definite reason as to why i continued to watch this anime...\r\nThe comedy wasnt all as goodas it should be considering this story had little plot and a rushed climax. The \"accidental\" breast groping incidents were just not funny after the first and second time and the material was recycled countless times making this series not as enjoyable as it should have been. Overall it was average.",
            "date": "2009-03-28T13:07:00+00:00",
            "helpful_count": 20,
            "mal_id": 13548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=13548"
        },
        {
            "content": "Asu no Yoichi, as described on this page, is about a samurai boy who was sent down the mountain by his father to live with four girls in a modern-day, Japanese city. The premise basically is another set-up for a harem anime, although three beautiful girls plus a cute younger sister is relatively small compared to traditional anime harems. \r\nThe overall story is more of a series of short scenarios, simple events in the characters' \"everyday lives\" more meant for humor than anything serious. So far, the mini-stories have been resolved quickly and simply- no truly deep or touching moments, but nevertheless somewhat vaguely heartwarming.And also, there is a lot of harem humor going on- the usual &quot;accidental&quot; groping of breasts and other awkward encounters. Maybe the story will start to get deeper later into the series; however, this sort of approach really doesn't sit well with such a short (12-ep) series. \\n\\n\r\nThe art is alright; nothing to really write home about. I like the hairstyles of Chihaya and Ayame a lot. The fight scenes are typical whoosh lines and wind that can be found in most other anime; again, it's nothing special. The &quot;Washizu vision&quot; scenes didn't catch my interest that much either. Music is usually upbeat and goes along well with the dialogue.\\n\\n\r\nAlright, what really bothered me was that the sisters all have different hair colors. I know a lot of anime does this, but how do two parents manage to produce such a wide spectrum of hair quality and color? Aside from that, the only character I really like so far is Chihaya. The others are generic; the gallant yet nosebleed-prone male protagonist, the clumsy tsundere, the talented yet violent girl, the innocent sister always needing to be saved.\\n\\n\r\nOverall the show is alright if you like something lighthearted, with classic but overused harem-style gags. The majority of the cast consists of overdone anime stereotypes, but the artwork and character design is almost decent enough to overcome some of that handicap. Even so, the story is relatively simple and shallow. I've only seen four episodes (1/3 of the series), but from the way this is going, I can only give it a 6 and pray for more screentime for Chihaya.",
            "date": "2009-01-31T20:08:00+00:00",
            "helpful_count": 20,
            "mal_id": 12003,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83358.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/agau4779",
                "username": "agau4779"
            },
            "url": "https://myanimelist.net/reviews.php?id=12003"
        },
        {
            "content": "I first read the manga and found it to be good. I looked forward to Asu no Yoichi! the anime, and after all 12 episodes, it met my expectations.\r\nAsu no Yoichi! is a comedy, harem about a teen samurai who has lived his entire life in the mountains with his father. He goes off to live in the city and stays at the Ikaruga house, ran by four sisters. With this setup, hilarity ensues, which is the main form of entertainment in Asu no Yoichi!.\r\nThe story consists of episodic events involving Yoichi, the Ikaruga sisters, and masked figures who apparently wants Yoichi dead, sending assassinafter another to finish him off. These attacks are part of the main story, which is really quite unimportant, and the writers only use it to end the anime with a satisfactory conclusion. The lov.. eer, \"crush\" circles in Asu no Yoichi! is also very funny, leading often into hilarious misunderstandings and situations.\\n\\n\r\nThe art is quite average, and I don't see much to comment about. There are \"Washizu visions\" and \"Tsubasa visions\" in the anime, where the respective characters daydream about their crush in favorable situations. Here, the artist deploys hilarious art styles in drawing people in the vision to show the character's mental attitude toward such people. It'll definitely bring about some laughter the first time around :)\\n\\n\r\nEach character has his or her part in Asu no Yoichi!, and interacted with each other to create funny scenes that were enjoyable to watch. There is little development within the characters, but as a comedy, that's not quite important. Needless to say, the characters were pretty well done.\\n\\n\r\nAsu no Yoichi! was pretty enjoyable. It doesn't have any exception aspect that makes it stand out. Overall, it's quite average, but its something that's worth your while to watch.\\n\\n",
            "date": "2009-04-04T23:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 13881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51496.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gdavge2003",
                "username": "gdavge2003"
            },
            "url": "https://myanimelist.net/reviews.php?id=13881"
        },
        {
            "content": "To start off this show trys to embody way to many genres, and comes off being all over the place allot of the time for the sheer number of fan groups it's trying to please. Harem, action, comedy, drama and romance all try to take centre stage at various points. Action and drama both come off as really half assed, but the comedy does provide allot of genuinely funny moments, and as a harem it's definitely among the more likeable shows.\r\nThe story unsurprisingly has been highly episodic, and i'm going to throw in a spoiler here, they have a hot spring episode! who'd have guessed.The relationships with the characters has slowly developed a bit, and we've had a great many villain of the week's thrown in for the action element of the show, which i can't emphasise enough, is not this shows strongest point, think team rocket in pokemon and your on roughly the right lines.\\n\\n\r\nThe art and character models are perhaps a little underwhelming for a 2009 anime but nothing to put you off enjoying the show, the sound is basically the same, i felt the opening was above average, aside from that i've barely noticed the music at all, so no strong impressions left.\\n\\n\r\nThe characters in this show are a mixed bag, firstly the two leads and main pairing Yoichi and Ikaruga are as standard as characters come, and add very little to the show, that's not to say there dislikeable characters, but you've most likely come across them many times with a slightly different appearance.\\n\\n\r\nThe supporting cast is truly this shows strong point, Chihaya, Ayame, and Ryou really add so much more to this show, they're genuinely amusing characters and add something different to the standard formula with their distinct and likeable personalities. Ayame and Ryou also add to the romance aspect both providing a rival for the opposite leads affections and both are loveable underdogs and highly entertaining in this role. This is without mentioning the other supporting cast members who all contribute something to the general shenanigans.\\n\\n\r\nIf your looking for an easy watch this is an excellent show to pick up,  it trys to be allot of things, but ultimately is allot of fun, and succeeds as a harem-esk comedy.\\n\\n\\n\\n",
            "date": "2009-03-23T12:18:00+00:00",
            "helpful_count": 10,
            "mal_id": 13406,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=13406"
        },
        {
            "content": "The protagonist of the series is Karasuma Yoichi, a boy of 17 years who lived their whole lives in the mountains with his father to improve his technique for the sword. One day, Yoichi decided to go to town after his father said it was not possible to get stronger in this condition. By stepping on the town, Yoichi meets a girl of Ikaruga dojo and is received as a guest at the dojo, along with four living sisters Ikaruga.\r\nHistory 8/10\r\nA simple story made better .. Nothing unusual, a samurai who went to town for the first time and gets into a jam right away,but shows its good side right away\\n\\n\r\nArt 8/10\\n\r\nThe art ranges where the anime goes the chapters ... the city with its buildings and malls and the mountain where he has trained well done graphics, there is weak\\n\\n\r\nSound 8/10\\n\r\nThe music for the opening and closing of the anime are well made demonstrating what is series, and music background also shows clearly what is happening without sinning in any way\\n\\n\r\nCharacter 8/10\\n\r\nWell done characters each with their own way ... the main one shows the naivete of someone who does not know the city and the Sisters of the dojo also show his feminine side and their internal disputes in 'love'\\n\\n\r\nEnjoyment 9/10\\n\r\ncomedy rose well to note anime with funny scenes and helping ECHI series and its theme itself ... do not let us down and pulls a good laugh\\n\\n\r\nOverall 7/10\\n\r\nWith graphics, sound, history and good fun in the series was level at all pleasant to watch mainly for the sisters and by way of the samurai\\n\r\nonly missed a few fights in the best level since it's an anime samurai\\n\\n\\n\\n\\n",
            "date": "2010-06-20T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 27391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330577.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vaynard2000",
                "username": "Vaynard2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=27391"
        },
        {
            "content": "Story:\r\nThe story revolves around a samurai named Yoichi Karasuma who has lived in the mountains for all his life. After learning everything his father could teach him, he was sent to a dojo in the city. Surprise surprise, the dojo is the home of 4 girls. Now how will Yoichi survive as he tries to adjust to living with 4 girls in a world he's been secluded from his entire life. \r\nEven with a full title like Samurai Harem: Asu no Yoichi, it still had the potential to be a satisfying romance despite the rampant amount of cliches. Unfortunately, it was not satisfying, but itwas indeed beyond cliche. \\n\\n\r\nWith a plot like that, it wouldn't be hard to think of it as the samurai counter-part of Full Metal Panic. Sadly, Asu no Yoichi did just not produce the same quality as FMP. Unlike FMP, it barely utilizes the fact that the protagonist has never lived in such a world. The protagonist could've had moments of not understanding how certain technology worked rather than looking like a total chuuni & pervert. Instead, the plot decided to follow the generic harem sequence:\\n\r\nMC falls -> perverted situation -> Girl hits MC (Even though he's a samurai for crying out loud) -> Both girl and MC feel bad -> They reconcile -> rinse & repeat\\n\\n\r\nThis is basically the whole show, it hardly ever diverges from that pattern. There are some cool moments of Yoichi here and there, but they're definitely not going to be making up for anything any time soon. They also try to put in some back-story and what not, but they never do it any justice because in the end, it's back to the harem sequence.\\n\\n\r\nIn short, it had a not so original plot that they could've still used for a satisfying romance, but it went full cliche and generic. \\n\\n\r\nArt:\\n\r\nThe art is the best thing about the show. It may not be absolutely stunning, but in comparison to the other aspects, it's pretty good. Not to mention the heroines are appealing which is a pretty big part of the harem genre. I'm glad the characters at least look nice.\\n\\n\r\nSound:\\n\r\nIn all honesty, I watched this show quite a long time ago, so I can't recall the OP or ED. However, if either were truly amazing, I'm sure I would've remembered it. \\n\\n\r\nCharacter:\\n\r\nThe characters are just as weak as the plot, possibly even weaker. All the characters fit into some commonly used trope. We have the protagonist, Yoichi Karasuma, a spineless samurai. He's a master of the sword, but for some reason lets girls push him around. While it is a possibility that it's in his code of honor to take the beatings, there's still a limit to how violent a girl is allowed to be. Speaking of violent females, we have the female protagonist, Ibuki Ikaruga. She's nice to look at and is a complete sweetheart to everyone. Well everyone except Yoichi. Like most harem girls, she believes in expressing her love through violence. At first it wasn't that bad, but you know her love increases and so does the eventual insufferable beatings. They really try to make you sympathize with her, but it's extremely difficult, considering she beats Yoichi for a good portion of the series. Sorry to say, but I'm not going to go in-depth with the rest of the characters. I'll just say we have another tsundere, your flirtatious heroine, a buxom elementary school student, and a delinquent who likes the main heroine and thinks he can save her from the clutches of Yoichi (This is a harem so misunderstandings are everywhere).    The main 2 characters alone should be enough to decide whether you want to watch it or not. \\n\\n\r\nOverall: \\n\r\nI can only think of a few reasons as to why, you would want to watch this.\\n\r\n1. The main heroine suits your taste in terms of appearance.\\n\r\n2. You've seen every other harem show.\\n\r\n3. You've seen every other anime.\\n\r\n4. You're a masochist.\\n\r\n5. You have absolutely no expectations and just watch anime for the fun of it.\\n\\n\r\nSeriously though, there are way better harem anime out there. Trust me, this show is only going to make you rage at it's excessive use of misunderstandings. perverted situations, and tsundere tendencies. To top it all off, the show is not romantically conclusive, so you're surely to be disappointed and angry. \\n\\n\\n",
            "date": "2014-12-11T20:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 171847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3914907.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zeroskye",
                "username": "Zeroskye"
            },
            "url": "https://myanimelist.net/reviews.php?id=171847"
        },
        {
            "content": "From the synopsis I think I know what you're expecting. Yes. It's your typical martial-arts love-comedy.\r\nI didn't have to turn on my brain while watching this. It's pretty much your average and inoffensive shounen anime served in an average and inoffensive way. Perfect after a tiring day at school or at work.\r\nOn to the review:\r\nEpisodic almost throughout the whole 12 episodes. It doesn't try to be groundbreaking nor does it try to be \"deep\". However on what it did not try, it succeeded on making the anime fun. Let's face it, there are times that everyone would simply want to sit back, turn off theirbrains, and enjoy the show. That's how this anime is.\\n\\n\r\nThe production quality is average as a whole. Character designs are formulaic shounen style with cute and sexy girls, and wimpy, pretty boy, or brute looking guys. Typical you've \"seen one, seen them all\".\\n\\n\r\nI can recommend this anime if you're looking for some shallow yet enjoyable entertainment. Most anime of the same genre can't provide those two important elements at the same time nowadays.",
            "date": "2009-03-30T01:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 13603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=13603"
        },
        {
            "content": "Asu no Yoichi! is surprisingly unwatchable. While not an absolutely terrible anime, there’s just simply nothing special about it at all. None of the characters in the show are memorable, the action is boring, the plot is predictable and even the fanservice is disappointing. I have to question the director’s decision to animate this show in the first place; after watching all twelve episodes, I had to ask myself, “So what? Why do I care about any of this?”\r\nAnd frankly, I couldn’t find an answer. I simply could not bring myself to care about any of the characters in the show. Scripting and plot aredefinitely to blame for this, as the seiyuu do a pretty good job of attempting to bring out character. Yet, how does one extract personality from a cardboard cutout? The characters are absolutely flat and act in a manner that is insultingly predictable. Yoichi, as the hero of a harem anime, is perverted and clueless; Ibuki, the master of the Dojo, is the stereotypical busty family matriarch… the list goes on and on. The creators put absolutely no thought into the motivations and aspirations of the main cast, and the result is absolute disaster.\\n\\n\r\nNot satisfied with the lack of character development in the main cast, the creators have chosen to present Asu no Yoichi! in “villian of the week” format. This leads to antagonists frequently being replaced, and causes a lack of continuity between each episode. There does exist an overarching meta-plot that drives the series, but its premise is so ludicrous and its resolution so predictable that the series could have done without it.\\n\\n\r\nIn addition, the fanservice and the comedy are both flops. Absolutely no decent fanservice occurs throughout the entire show; weak attempts at accidental boob-grabs (as is common in all harem shows) are made, but the results are rather painful to watch and seldomly amusing. Most of the humor in this show falls flat on its face; I found myself groaning in disgust more than laughing.\\n\\n\r\nAll in all, this show suffers from only one major (yet damning) problem: poor, poor writing. It’s clear that the writers did not attempt to create any sort of unique character for each member of the cast, and the show suffers accordingly. Couple a cast with as much personality as drying paint with a highly repetitive plot and uninspiring humor… and you have the disaster that is this anime.",
            "date": "2015-04-25T14:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 186445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/leep11",
                "username": "leep11"
            },
            "url": "https://myanimelist.net/reviews.php?id=186445"
        },
        {
            "content": "To tell the truth i didn't think i will enjoy this as much i did.At first i think this will be boring,and i will probably drop it at first two episodes,but i was wrong.I liked this anime a lot,don't get me wrong it wasn't perfect,but if you like funny anime to kill some time i would recommend this one.Characters are great,and funny.But if you want some great marshal arts and fights this one is not for you.You would be just fine if you would watch one episode per night to get some laughs before going to sleep.And if you like anime I would also recommendto read manga,in my opinion it is little better that anime.\\n\\n\\n",
            "date": "2018-05-05T08:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 279831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7170081.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/shy_boy",
                "username": "shy_boy"
            },
            "url": "https://myanimelist.net/reviews.php?id=279831"
        },
        {
            "content": "Asu no Yoichi, seeing the ecchi/romance tags, I went into this expecting a fine balance of a shounen, martial arts setting and some romance infused with some fan service ecchi. I'm sorry to say that near the end, it failed to fully satisfy me. \r\nStory: 6\r\nArt:8\r\nSound:6\r\nCharacter:6\r\nEnjoyment:6\r\nOverall:6\r\nStory: The story to Asu no Yoichi is mainly focused on the interactions between the characters, but also since the anime included a shounen aspect, it had the action focus as well. The balance between the two however wasn't exactly up to par in my standards. With the setting A.N.Y. gave, it could have turned out much better,but had alot of wasted potential due to the overall lack of flow the story had. A main plot line was obviously given from the shounen theme, but hardly followed, and easily discarded. This doesn't mean the story was bad, it may be that I have watched too many of similarly themed anime and have found too many that are superior to this one, but, the main problems I found with the story is the lack of overall flow from episode to episode. Meaning a main purpose that connects them. The anime went from a young 17 year old samurai trying to adapt in a completely new atmosphere, to just constant accidental breast grabs, and a sorry attempt at romance. The plot development is another problem; almost none is seen during the middle of the story which is when the cast of characters go about to do things very common in ecchi/harem anime like hot-springs and festivals, but when the story is given a main goal the development of it seems rushed and cliche. To sum up, the story in my experience could have been better, but Asu no Yoichi is a good anime to start out with. \\n\\n\r\nArt: The art was pretty good, the flow of pictures was well done, and I found barely any problems with it. The main thing I focus on would be the quality of the anime, which wasn't too bad, to the flow of the pictures. In both of these aspects, Asu no Yoichi didn't fail. \\n\r\nRegarding the fan service that Asu no Yoichi provided, at first it was included to add comedic effect, but the anime never tried anything different. The fan service was just the same stuff over and over in each episode; after the repetition of the same thing, it got really old and borderline annoying. Almost on par with the To Love Ru franchise. \\n\\n\r\nThe Sound: The sound wasn't very good in my opinion. It reminded me of Korean dramas since Asu no Yoichi and most Korean dramas only play about 5 songs, but a billion times. Regarding the OST, it was similarly repeated as the lack of originality in the fan service region. The songs themselves weren't bad, but after hearing the same action song over and over, it gets boring and loses the added effect that is to come from accompanying the scene. \\n\\n\r\nCharacters: The main character didn't necessarily seem like a typical main character. IMO Yoichi didn't really stand out from the anime, nor did he have a big affect on it. The only dramatic feature Yoichi had was his adaptation to the new society. His attitude/personality/goals never showed an ulterior goal, thus making him pretty much a static character. The other supporting characters were either infatuated with one of the three following characters. Ibuki Ikaruga, Yoichi Karasuma, and Ryou Washizu. The romance deveopment between each of the supporting characters and either of those three were poorly done and showed hardly if any progress. I'll also have to input that the overall obsessive personality Ukyou Saginomiya put off was just too much. His personality pretty much was repulsive and seemed out of pace with the rest of the story. Bringing up the fan service aspect again, the main character's \"Careless\" breast grabs followed up by a beating from his fellow female characters was just too repetitive and got old. \\n\\n\r\nEnjoyment and Overall: The main problems I had with Asu no Yoichi! were: the flow and development of the story, the OST's lack of diversity, the repetitive fan service, and some of the character's personalities. Other than these things, I think that it is just that I have seen too many anime like this and Asu no Yoichi failed to stand out. So with that, I have to say, if you have seen anime such as To Love Ru, Princess Lover!, Ichiban Ushiro no Daimou!, Rosario + Vampire, and IS: Infinite Stratos, you might want to skip out on watching this one. However if you are relatively knew to the genre, or anime in general this is a good starting plate. The overall story,characters, art and sound weren't bad or awful in any way; it's just that the anime lacked flow and originality. Giving this anime a \"Fair 6\". \\n\\n\r\nThanks for reading,\\n\r\nNebarto\\n\\n\\n",
            "date": "2013-07-22T21:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 106427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=106427"
        },
        {
            "content": "'Asu no Yoichi' is an enjoyable anime, unique in that it takes its time when it comes to character development or storyline progression and rather focuses on the main character - Yoichi Karasuma. In fact, despite the 'Ecchi' and 'romance' tags there's about as much ecchi or romance here as you'd find in 'death note'. There really are only two female characters here who are somewhat attracted to the male lead and some other male characters but frankly, nothing ever happens. Do not expect this to be one of those \"male lead chooses this girl in the end\" animes. It isn't. \r\nThat said, it wasenjoyable because of the protagonist 'Yoichi'. Ever wondered what would happen if a hardy samurai who trained in the mountains ever since his birth was suddenly pushed into your average modern city and told to live with a bunch of women, all in the hopes of becoming stronger? Well this anime attempts to simulate such scenario with hilarious results as Yoichi is a staunch Bushido adherent and the modern world is... well less pious and based on rather simple principles. Therefore our Samurai more often than not ends up beating people up for a variety of reasons and teaching them how to be more honorable, inside and outside the ring, so to speak. Good stuff. \\n\\n\r\nNow, there are numerous recurring characters throughout the series, majority of which are of course female. As I mentioned before don't expect any real romance here because frankly this anime has no direction when it comes to that. We have two guys - Yoichi and Washizu. The girls basically keep switching between those two. One episode Washizu is their savior and Yoichi gets beaten - the next they switch over. Repeat for the entire duration of the series. Whoop de do. As for the female characters themselves, nothing really worth mentioning. Tsundere, shy girl, sly girl... you know the drill. \\n\\n\r\nIt's the same witch ecchi here'. Of course it's there but it's rather sporadic and frankly apart from the obligatory beach episode (every ecchi anime has a beach episode) you don't really get to see that much. Furthermore it always boils down to Yoichi accidentally stumbling upon an invisible *enter object name here* and grabbing *enter body part name here* and getting mutilated by the girls. \\n\\n\r\nOne other thing that surprised me is that the ending was inconclusive. There is of course a climactic showdown between the samurai and the forces of evil opposing his Bushido ways but after all that work you'd think that he would get some sort of reward or reach a plot-relevant conclusion, however nothing happens. You're left with a feeling that closely resembles the feeling of getting rejected at a prom. Trust me I speak from experience, it hurts. \\n\\n\r\nThe art and sound are both top notch. The characters are well animated and you can always enjoy the samurai's ass-kicking in high quality. Likewise the opening and ending is well made and fits in with the series itself.\\n\\n\r\nAll in all, 'Asu no Yoichi' is a good anime, nothing more nothing less. Not really high on my re-watch list but it was definitively fun. If anything, watch this for the main character. He will teach you how to become a better person... after kicking your ass.",
            "date": "2013-05-04T10:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 95935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=95935"
        },
        {
            "content": "Summary: This anime was pretty good for the harem/fighting/ecchi genre. It is PG-13 so it doesn't go over the top like others and instead is more character and plot driven. The story wasn't too complex, the characters mostly fit into tropes and a lot of the comedy and plot line were pretty standard to the genre, but it did everything well enough and felt like a good addition. I specifically liked the character models even if they weren't anything special. \r\nI view this as a good preview into the universe to help the viewer decide if they like the story enough to read the manga,which I did. I also think it is good as a stand alone story, and ends without any major cliff hangers. Overall if you're looking for a new anime in the genre you might want to give this a try.\\n\\n\r\nStory: 7/10\\n\r\nThe story was pretty typical. Guy comes from the mountains and lives in a dojo with girls. There are a bunch of silly love interest plots (it was refreshing not every girl had a crush on him), there are some fights with random bad guys but mostly just silliness and trope filled comedy.\\n\\n\r\nArt: 8/10\\n\r\nThe art was done well. I really enjoyed the character models, the characters were unique and I liked the illustrations, they definitely enhanced the experience.\\n\\n\r\nSound: 7/10\\n\r\nIt was descent. Nothing memorable but it got the job done.\\n\\n\r\nCharacter: 6/10\\n\r\nThis is the weaker element of the story. Most of the characters and their development are straight down trope lines. Granted some of them get a bit of evolution but it all felt too convenient. You know that thing where bad guys learn the error of their ways in 30 seconds? Yeah that happens... a bunch. \\n\\n\r\nAs far as the tropes: Slightly pervy guy who always ends up accidentally grabbing a girl's chest, Tsundere, shy girl, loli girl, aloof not interested girl, girl who has huge breasts, girl who has small breasts and mentions it often, super tough guy who is really weak and his clingy best friend. Nailed it!\\n\\n\r\nEnjoyment: 7/10\\n\r\nI enjoyed it for what it was, a trope filled pretty standard harem/ecchi/fighting anime.\\n\\n\r\nOverall: 7/10\\n\r\nIt's good for what it is. It isn't venturing outside the box or winning any awards, but what it does it does just fine. There is enough uniqueness to the plot to make it worth watching. The characters follow tropes but also have enough unique points to make them interesting in their own way. At a minimum, it convinced me to give the manga a try, which I think was likely the entire point of this anime... so mission accomplished!\\n",
            "date": "2016-02-05T22:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 210225,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=210225"
        },
        {
            "content": "This review will be short. This anime was entertaining but ultimately left zero impact on me. I will never watch this again, never talk about it again and I think that is the show's biggest issue. It isn't that the show was bad, it wasn't... but for all the elements that the show got right, it seems to use some of them incorrectly. There is also no resolution for any of the established romances. None. Not a kiss, hug, confession, nothing... from anyone. I was expecting more all around TBH. Loved the premise, loved some of the characters but the execution of pacing and storyleft much to be desired.\\n\\n\r\nStory: 4/10 - Packed with potential, ultimately it doesn't deliver on what could have made it a must see anime. As it stands, its not bad... just very forgettable. \\n\\n\r\nART: 7/10 - Good solid animation but nothing that I would write home about. \\n\\n\r\nSound: 6/10 - I really liked the opening theme. I don't know how appropriate it was to the theme of the show but I can't complain. Very nice.\\n\\n\r\nCharacter: 7/10 - I liked the characters in this one... though the main female was totally wrong for her type. She is oddly violent for the established \"mother figure\" character. I would have pegged the blonde sister to be more violent when those awkward situations arose. I can't help being a sucker for Kagome, who is just so cute and fills the \"Shinobu\" class as I call it... the quiet, shy, sweet girl who is good with domestic stuff.\\n\\n\r\nOverall: While I liked this and don't have anything overly bad to say about it. It lacks a few elements which could have made it so much more. Virtus Signum gives this show a 6/10. Decent.",
            "date": "2014-03-26T17:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 137123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/VirtusSignum",
                "username": "VirtusSignum"
            },
            "url": "https://myanimelist.net/reviews.php?id=137123"
        },
        {
            "content": "Asu in yoichi is one of those harem cliches in which the protagonist conquers all the girls around him and does not take any of them, but it is not a bad anime, on the contrary it can be good even being cliche.\r\nThe story of the anime is simple, yoichi is like a swordsman who lives in the mountains with his father and then leaves the mountains to live with the ikaruga sisters. The story doesnt have a good villain and doesnt follow a direction, are episodes made more to relax than to induce you to think, is more focused on comedy than in historyand on showing yoichi approaching the sisters\\n\\n\r\nThe genre romance is very badly done in the anime, yoichi is a protagonist that almost never demonstrates emotions related to love, there are scenes in which the girl is totally blushing and he without reaction some looks like a doll. \\n\\n\r\nThe art is normal, it's nothing special but it's not bad either, besides the ikagura sisters are very cute, The anime doesnt have many soundtracks, and the ones it has are good, just as art is nothing special.\\n\\n\r\nThe protagonist would be a good character if it is a shonen but it isnt the case, so dont avenge. He has a strong sense of justice and has many moments of chivalry, is also strong and is a little perverted, speaking of the ikagura sisters, are very charismatic, ibuki is the one who most appears as if he were our main heroine, is extremely beautiful and violent , Also know martial arts. Another Character is ayame, which is one of my favorites, she is in love as well as all by the protagonist, she isnt violent as ibuki and suffers in an inferiority complex by the ibuki, which is always recognized, that old cliche of always being the second and The big sister the first...\\n\\n\r\nAnother character is the chihaya that along with ayame are my favorites, chihaya at first appears to be one of those who will not like the protagonist but there in the middle of the anime she falls in love with yoichi chivalry acts motivated by her sense of justice. Chihaya likes to draw manga and she lives by Ayame wave, she is beautiful and she is the one who likes to make jokes in the anime.\\n\\n\r\nAngela also has one of the villains at the beginning of the anime but later she likes the yoichi and she is very hot. Now, let's go to the girls who do not like Yoichi, first the kagome younger sister of the ikagura, she's about 10 years old, all she needed was to like the protagonist too, it would be ridiculous. The other is the one who does not like the protagonist and is his age, his name is tsubasa and she likes another guy who is from the school of yoichi, is a character that barely appears.\\n\\n\r\nIt's a good anime to pass the time, it's a simple anime with light comedy and pleasant elements, it's just to distract, it's far from a bad anime, it might even give a bigger note, but it's not my kind of anime. Not have a story and focus only on the comedy and the \"romance\" that in this part is poorly done ... I recommend to those who like animes as what they are kind of silly\\n\\n",
            "date": "2017-01-29T16:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 239457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520845.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/manoeltb21",
                "username": "manoeltb21"
            },
            "url": "https://myanimelist.net/reviews.php?id=239457"
        },
        {
            "content": "I am not interested in writting a one page review so i will try to make it a quick review.\r\nI loved this anime for just 4 episodes! But after that story will start going down like there will be soo mamy characters introduce i can't even remember  their name. Girl character in this anime is good but seeing soo many heroes make this show cringy for me to be honest.\r\nStory was decent nothing too special about it. It's not that enjoyable after 5th episode\r\nArt was good no complain about that. \r\nSound was also good. \r\nEnjoyment is not that good XD",
            "date": "2017-10-04T20:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 259729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6569148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XxPOPTARTxX",
                "username": "XxPOPTARTxX"
            },
            "url": "https://myanimelist.net/reviews.php?id=259729"
        },
        {
            "content": "Wow, this is one show that gave me a lot of thoughts.\r\nReminds me of : Gintama (wise sayings and wooden sword, imba samurai), and (forgot)\r\nFrom mangaupdates\r\nAnime Start/End Chapter\r\nStarts at Vol 1 Chap 1\r\nEnds at Vol 4 Chap 16\r\nNOTE: I finished watching the anime, but only read a few chapters of the manga. My thoughts are: The manga is much more ecchi and draggy than the anime. \r\nPros:\r\n->Great mix of martial arts, comedy, ecchi, romance, harem, friendship and tear-jerking moments\r\n->Amazing action throughout the show, great ending (10-12)\r\n->Excellent OP and ED, some bgm were very fitting, characters' voices were fitting\r\n->Doesn't have much unnecessary detail, inspiring, character castwas utilized a lot (even side characters)\\n\\n\r\nCons:\\n\r\n->Romance was quite messy, didn't have much of a conclusion\\n\r\n->Villain was super-imba, main male character too, too many sides to main characters shown\\n\r\n->Seemed like the main male character was downplayed on a lot, pity him D:\\n\r\n->Concepts raised in the beginning seemed to be removed later (School life, romance-> attacks by assasins and crises)\\n\\n\r\nStory:8\\n\r\nArt:9\\n\r\nSound:9\\n\r\nChracter:9\\n\r\nEnjoyment:9\\n\r\nOverall:8 (8.84)\\n\\n\r\nHope there will be a 2nd season :D\\n\r\n(Review to be continued)\\n",
            "date": "2010-03-12T02:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 23910,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23910"
        },
        {
            "content": "Asu no Yoichi! Or, by another name, Samurai Harem. As a boy, i'm into the harem and ecchi anime genres. And this anime, well it delivers. WARNING: Anti-Ecchi people read no further!\r\nStory\r\nAsu no Yoichi starts off with the main character, Yoichi training in the mountains with his father. The father then says that he has taught him everything and he needs to go out to train further. He then leaves the mountain to trave to the city, towards a dojo of their friends the Ikaruga Family. However he somehow ends up going into the dressing room with a girl (all the while 'accidentally?' gropping herbreasts, looks up the pantsu on another and overall, be a complete and utter pervert. This continues for the whole season, with varying amounts of complete owning of the main character by the Ikaruga family (which...btw is full of girls!?).\\n\r\nIf you're looking for a good storyline...you're probly not gonna find one here. The plot was littered around the eps, between the love triangle between the main character and Ibuki and Ayame of the Ikaruga family, and the various ways Yoichi gets crippled by Ibuki.\\n\\n\r\nArt\\n\r\nNot much to say here. Characters were drawn well and the mixing of chibi was a nice touch.\\n\\n\r\nSound\\n\r\nHmmm...not that great. OP and ED weren't anything memorable (well..at least not to me). Some songs fit the situation, some didn't.\\n\\n\r\nCharacters\\n\r\nThe character development was actually pretty good. It went into the Ikaruga families history abit and learned quite alot about the girls.\\n\r\nTheres quite a bit of characters here so imma jus cut it down\\n\r\nYoichi Karasuma - The main character of this series. A good swordsman and usually gets into perverted situations. He's freeloading at the Ikaruga family to learnt their swordstyle.\\n\r\nIbuki Ikaruga - Main heroine of this series. Head of the Ikaruga family since their parents left at an early age. Popular at school due to looks and brains blah blah blah. Your basic harem heroine pretty much.\\n\r\nAyame Ikaruga - Probably my favourite character of the series. A tsundere character, shy and very aware of her breast size. Probably the one that has gotten into the most perverted situations with Yoichi. 2nd to only Ibuki occasionally.\\n\r\nSaginomiya clan - Not saying the main villains name in case of spoilers. Basically the villain has a crush on Ibuki and Yoichi's getting in his way.\\n\\n\r\nOverall\\n\r\nIt was a enjoyable anime to watch with nice and funny scenes throughout. Recommended to watch, but don't expect a great storyline, jus lots of fanservice and laughs.",
            "date": "2011-03-04T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 34903,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442917.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shrurikan",
                "username": "Shrurikan"
            },
            "url": "https://myanimelist.net/reviews.php?id=34903"
        }
    ],
    [
        {
            "content": "Before watching this anime I thought to myself, \"This is probably one of those harems ecchi shows where a lot of girls fall for the same guy.\" Well it was almost that. \r\nInstead of a lot of girls there was only two, Ibuki Ikaruga and Ayame Ikaruga. They fall in love with Yoichi Karasuma. But unlike many harems this anime has a credible storyline. Unknowingly Ibuki has a fiance. After many years he has finally come to wed his belowed. That's basically the jist of it. Yoichi and the girls try to overcome obstacles and challenges that are thrown at them.\r\nAIC is known for creatingsome of the best animation in the anime world and they don't disappoint with Asu no Yoichi. Color, character design and background are all animated really well. One of the bright spots in this anime is \"Washizu visions\" and \"Tsubasa visions.\" These are \"visions\" the respective character has funny visions of what he or she believes will happen.\\n\\n\r\nEvery character plays a part in Asu no Yoichi. There isn't a lot of character development but interaction between each character is huge. They all have a special moment with each other. Secondary characters such as Washizu also play a big part in the anime. They all have a big part during the last few episodes.\\n\\n\r\nThere are many golden comedy moments in this anime. They all contribute to the enjoyment level of this anime. Asu no Yoichi is enjoyable and fun to watch. On the other hand it doesn't have many epic moments that will make you remember this anime. If you have the time this you should check this anime out.\\n",
            "date": "2009-04-14T19:26:00+00:00",
            "helpful_count": 86,
            "mal_id": 14160,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48866.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ManU-Alchemist",
                "username": "ManU-Alchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=14160"
        },
        {
            "content": "Asu no Yoichi is an average anime that lacks a lot to be good so don't watch it but if you want to, go ahead read what you're getting into.\r\nStory\r\nIt's a Harem/Ecchi anime so you shouldn't expect anything special from this, the story is about Yoichi an overpowered samurai (but that makes sense because he spent his whole life training to be the best samurai), a samurai that wants to expand his knowledge on other abilities that he doesn't know so his father sends him to a Dojo that specializes in the same ability (really?), he wants to see if they can teach him somethingnew, he gets a Harem of sisters where 2 of them are interested in him, the problem is that he has no social skills whatsoever so he doesn't know how to behave to the situations he or the sisters puts him into, in the way they stumble upon other people from other Dojos with different abilities and kick their butts, and that's it, the story is just average.\\n\\n\r\nArt & Sound\\n\r\nThe art is good, could have been better, but it was well animated but not smooth.\\n\r\nThe sound was good, the music and voice acting were good.\\n\\n\r\nCharacter\\n\r\nThe character development was ok, i liked only one of the sisters, Ayame, i also really liked Washizu he was hilarious with Torigaya who in every episode gets smaller and smaller (and only in the manga you will know the reason behind this apparently) every other character was just average but Yoichi was my least favorite, he was too naive.\\n\\n\r\nEnjoyment\\n\r\nI really liked a lot the comedy Washizu and Torigaya had to offer, but they appeared from time to time so it was less enyojable, Washizu was the \\n\r\nbest character (which didn't appear a lot) and i liked Ayame too, which makes them the best part of the anime, also the weak ending didn't help, it's an average anime.",
            "date": "2015-08-04T13:42:00+00:00",
            "helpful_count": 35,
            "mal_id": 195162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195162"
        },
        {
            "content": "First review I’ve done-\r\nIt doesn’t matter significantly of what others think about a particular anime. Everyone has their own taste, so in general, a review should be based purely on what you thought about it. Prior to watching Asu no Yoichi!I did a little research on it and came to the conclusion that it’s a harem anime. New to this kind of genre, I took the liberty of trying it and at the end I really enjoyed it.\r\nAsu no Yoichi! Is about a 17 year old samurai who has lived in a rural area for most of his life along with his father and someanimals to company him. One day his father asks him to move to the city as he can’t make him stronger and also for experience. He seizes this opportunity and starts living with 4 sisters to assist him with his training. Throughout the show the protagonist of the story Yoichi along with his acquaintances, embark on various tasks that need addressing.\\n\\n\r\nStoryline- 5/10\\n\r\nThe anime lacked a strong plot, it basically went like this-\\n\r\nBoy living in the mountains-moves to the city-has to survive in the city-train in the city-save some of his friends from enemies that aren’t even portrayed as strong compared to him. In between all this, there is plenty of romance as well as humor to keep you glued into watching it. \\n\r\nAsu no Yoichi doesn’t really have a strong storyline, its basically a bunch of short scenarios put together to form the first season.\\n\r\n Also it felt as if it was a little rushed towards the end but it also leaves an opening for a second season. \\n\\n\r\nart-8/10\\n\r\nThe art was done pretty well and the company who made the show are used to producing shows with good quality art.\\n\\n\r\nSound- 8/10\\n\r\nNice selection of music for each moment. Can’t really emphasize enough for this area, as you wouldn’t tend to pay much attention to it.  That said, the intro music and the end sounded all right.\\n\\n\r\nCharacter-6/10\\n\r\nThere wasn’t much character development throughout the series. However, there was at least an episode dedicated to the main characters that explored them more thoroughly and there is a bit of interaction between one another. Also Yoichi was overpowered and unlike other typical ecchi harem anime’s, this one only has roughly 3 girls that are attracted to the protagonist.\\n\\n\r\nEnjoyment-9/10\\n\r\nLoved it so much that I practically finished it within 24 hours. What I liked the most about Asu no Yoichi! Was the humor, throughout the episodes, there is plenty of it. \\n\\n\r\nOverall-7/10\\n\r\nIt’s really an anime in which you can sit back and relax too offering you some enjoyable entertainment and isn’t meant to be too serious. \\n",
            "date": "2013-06-29T20:19:00+00:00",
            "helpful_count": 25,
            "mal_id": 103061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2664185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lelelel",
                "username": "lelelel"
            },
            "url": "https://myanimelist.net/reviews.php?id=103061"
        },
        {
            "content": "Im going to start off on a bad note because i feel that this mini series lacked a plot and has a pathetic excuse for one. HOWEVER this anime wasnt particularly bad unless you actually found the plot interesting(like i did) only to be disappointed that it was just to make the synopsis look pretty.\r\nThe one thing i did enjoy the most were the characters. Each character of the ikaruga household were unique and was interesting to watch the character development of each individual in the earlier episodes. A definite reason as to why i continued to watch this anime...\r\nThe comedy wasnt all as goodas it should be considering this story had little plot and a rushed climax. The \"accidental\" breast groping incidents were just not funny after the first and second time and the material was recycled countless times making this series not as enjoyable as it should have been. Overall it was average.",
            "date": "2009-03-28T13:07:00+00:00",
            "helpful_count": 20,
            "mal_id": 13548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=13548"
        },
        {
            "content": "Asu no Yoichi, as described on this page, is about a samurai boy who was sent down the mountain by his father to live with four girls in a modern-day, Japanese city. The premise basically is another set-up for a harem anime, although three beautiful girls plus a cute younger sister is relatively small compared to traditional anime harems. \r\nThe overall story is more of a series of short scenarios, simple events in the characters' \"everyday lives\" more meant for humor than anything serious. So far, the mini-stories have been resolved quickly and simply- no truly deep or touching moments, but nevertheless somewhat vaguely heartwarming.And also, there is a lot of harem humor going on- the usual &quot;accidental&quot; groping of breasts and other awkward encounters. Maybe the story will start to get deeper later into the series; however, this sort of approach really doesn't sit well with such a short (12-ep) series. \\n\\n\r\nThe art is alright; nothing to really write home about. I like the hairstyles of Chihaya and Ayame a lot. The fight scenes are typical whoosh lines and wind that can be found in most other anime; again, it's nothing special. The &quot;Washizu vision&quot; scenes didn't catch my interest that much either. Music is usually upbeat and goes along well with the dialogue.\\n\\n\r\nAlright, what really bothered me was that the sisters all have different hair colors. I know a lot of anime does this, but how do two parents manage to produce such a wide spectrum of hair quality and color? Aside from that, the only character I really like so far is Chihaya. The others are generic; the gallant yet nosebleed-prone male protagonist, the clumsy tsundere, the talented yet violent girl, the innocent sister always needing to be saved.\\n\\n\r\nOverall the show is alright if you like something lighthearted, with classic but overused harem-style gags. The majority of the cast consists of overdone anime stereotypes, but the artwork and character design is almost decent enough to overcome some of that handicap. Even so, the story is relatively simple and shallow. I've only seen four episodes (1/3 of the series), but from the way this is going, I can only give it a 6 and pray for more screentime for Chihaya.",
            "date": "2009-01-31T20:08:00+00:00",
            "helpful_count": 20,
            "mal_id": 12003,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83358.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/agau4779",
                "username": "agau4779"
            },
            "url": "https://myanimelist.net/reviews.php?id=12003"
        },
        {
            "content": "I first read the manga and found it to be good. I looked forward to Asu no Yoichi! the anime, and after all 12 episodes, it met my expectations.\r\nAsu no Yoichi! is a comedy, harem about a teen samurai who has lived his entire life in the mountains with his father. He goes off to live in the city and stays at the Ikaruga house, ran by four sisters. With this setup, hilarity ensues, which is the main form of entertainment in Asu no Yoichi!.\r\nThe story consists of episodic events involving Yoichi, the Ikaruga sisters, and masked figures who apparently wants Yoichi dead, sending assassinafter another to finish him off. These attacks are part of the main story, which is really quite unimportant, and the writers only use it to end the anime with a satisfactory conclusion. The lov.. eer, \"crush\" circles in Asu no Yoichi! is also very funny, leading often into hilarious misunderstandings and situations.\\n\\n\r\nThe art is quite average, and I don't see much to comment about. There are \"Washizu visions\" and \"Tsubasa visions\" in the anime, where the respective characters daydream about their crush in favorable situations. Here, the artist deploys hilarious art styles in drawing people in the vision to show the character's mental attitude toward such people. It'll definitely bring about some laughter the first time around :)\\n\\n\r\nEach character has his or her part in Asu no Yoichi!, and interacted with each other to create funny scenes that were enjoyable to watch. There is little development within the characters, but as a comedy, that's not quite important. Needless to say, the characters were pretty well done.\\n\\n\r\nAsu no Yoichi! was pretty enjoyable. It doesn't have any exception aspect that makes it stand out. Overall, it's quite average, but its something that's worth your while to watch.\\n\\n",
            "date": "2009-04-04T23:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 13881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51496.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gdavge2003",
                "username": "gdavge2003"
            },
            "url": "https://myanimelist.net/reviews.php?id=13881"
        },
        {
            "content": "To start off this show trys to embody way to many genres, and comes off being all over the place allot of the time for the sheer number of fan groups it's trying to please. Harem, action, comedy, drama and romance all try to take centre stage at various points. Action and drama both come off as really half assed, but the comedy does provide allot of genuinely funny moments, and as a harem it's definitely among the more likeable shows.\r\nThe story unsurprisingly has been highly episodic, and i'm going to throw in a spoiler here, they have a hot spring episode! who'd have guessed.The relationships with the characters has slowly developed a bit, and we've had a great many villain of the week's thrown in for the action element of the show, which i can't emphasise enough, is not this shows strongest point, think team rocket in pokemon and your on roughly the right lines.\\n\\n\r\nThe art and character models are perhaps a little underwhelming for a 2009 anime but nothing to put you off enjoying the show, the sound is basically the same, i felt the opening was above average, aside from that i've barely noticed the music at all, so no strong impressions left.\\n\\n\r\nThe characters in this show are a mixed bag, firstly the two leads and main pairing Yoichi and Ikaruga are as standard as characters come, and add very little to the show, that's not to say there dislikeable characters, but you've most likely come across them many times with a slightly different appearance.\\n\\n\r\nThe supporting cast is truly this shows strong point, Chihaya, Ayame, and Ryou really add so much more to this show, they're genuinely amusing characters and add something different to the standard formula with their distinct and likeable personalities. Ayame and Ryou also add to the romance aspect both providing a rival for the opposite leads affections and both are loveable underdogs and highly entertaining in this role. This is without mentioning the other supporting cast members who all contribute something to the general shenanigans.\\n\\n\r\nIf your looking for an easy watch this is an excellent show to pick up,  it trys to be allot of things, but ultimately is allot of fun, and succeeds as a harem-esk comedy.\\n\\n\\n\\n",
            "date": "2009-03-23T12:18:00+00:00",
            "helpful_count": 10,
            "mal_id": 13406,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=13406"
        },
        {
            "content": "The protagonist of the series is Karasuma Yoichi, a boy of 17 years who lived their whole lives in the mountains with his father to improve his technique for the sword. One day, Yoichi decided to go to town after his father said it was not possible to get stronger in this condition. By stepping on the town, Yoichi meets a girl of Ikaruga dojo and is received as a guest at the dojo, along with four living sisters Ikaruga.\r\nHistory 8/10\r\nA simple story made better .. Nothing unusual, a samurai who went to town for the first time and gets into a jam right away,but shows its good side right away\\n\\n\r\nArt 8/10\\n\r\nThe art ranges where the anime goes the chapters ... the city with its buildings and malls and the mountain where he has trained well done graphics, there is weak\\n\\n\r\nSound 8/10\\n\r\nThe music for the opening and closing of the anime are well made demonstrating what is series, and music background also shows clearly what is happening without sinning in any way\\n\\n\r\nCharacter 8/10\\n\r\nWell done characters each with their own way ... the main one shows the naivete of someone who does not know the city and the Sisters of the dojo also show his feminine side and their internal disputes in 'love'\\n\\n\r\nEnjoyment 9/10\\n\r\ncomedy rose well to note anime with funny scenes and helping ECHI series and its theme itself ... do not let us down and pulls a good laugh\\n\\n\r\nOverall 7/10\\n\r\nWith graphics, sound, history and good fun in the series was level at all pleasant to watch mainly for the sisters and by way of the samurai\\n\r\nonly missed a few fights in the best level since it's an anime samurai\\n\\n\\n\\n\\n",
            "date": "2010-06-20T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 27391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330577.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vaynard2000",
                "username": "Vaynard2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=27391"
        },
        {
            "content": "Story:\r\nThe story revolves around a samurai named Yoichi Karasuma who has lived in the mountains for all his life. After learning everything his father could teach him, he was sent to a dojo in the city. Surprise surprise, the dojo is the home of 4 girls. Now how will Yoichi survive as he tries to adjust to living with 4 girls in a world he's been secluded from his entire life. \r\nEven with a full title like Samurai Harem: Asu no Yoichi, it still had the potential to be a satisfying romance despite the rampant amount of cliches. Unfortunately, it was not satisfying, but itwas indeed beyond cliche. \\n\\n\r\nWith a plot like that, it wouldn't be hard to think of it as the samurai counter-part of Full Metal Panic. Sadly, Asu no Yoichi did just not produce the same quality as FMP. Unlike FMP, it barely utilizes the fact that the protagonist has never lived in such a world. The protagonist could've had moments of not understanding how certain technology worked rather than looking like a total chuuni & pervert. Instead, the plot decided to follow the generic harem sequence:\\n\r\nMC falls -> perverted situation -> Girl hits MC (Even though he's a samurai for crying out loud) -> Both girl and MC feel bad -> They reconcile -> rinse & repeat\\n\\n\r\nThis is basically the whole show, it hardly ever diverges from that pattern. There are some cool moments of Yoichi here and there, but they're definitely not going to be making up for anything any time soon. They also try to put in some back-story and what not, but they never do it any justice because in the end, it's back to the harem sequence.\\n\\n\r\nIn short, it had a not so original plot that they could've still used for a satisfying romance, but it went full cliche and generic. \\n\\n\r\nArt:\\n\r\nThe art is the best thing about the show. It may not be absolutely stunning, but in comparison to the other aspects, it's pretty good. Not to mention the heroines are appealing which is a pretty big part of the harem genre. I'm glad the characters at least look nice.\\n\\n\r\nSound:\\n\r\nIn all honesty, I watched this show quite a long time ago, so I can't recall the OP or ED. However, if either were truly amazing, I'm sure I would've remembered it. \\n\\n\r\nCharacter:\\n\r\nThe characters are just as weak as the plot, possibly even weaker. All the characters fit into some commonly used trope. We have the protagonist, Yoichi Karasuma, a spineless samurai. He's a master of the sword, but for some reason lets girls push him around. While it is a possibility that it's in his code of honor to take the beatings, there's still a limit to how violent a girl is allowed to be. Speaking of violent females, we have the female protagonist, Ibuki Ikaruga. She's nice to look at and is a complete sweetheart to everyone. Well everyone except Yoichi. Like most harem girls, she believes in expressing her love through violence. At first it wasn't that bad, but you know her love increases and so does the eventual insufferable beatings. They really try to make you sympathize with her, but it's extremely difficult, considering she beats Yoichi for a good portion of the series. Sorry to say, but I'm not going to go in-depth with the rest of the characters. I'll just say we have another tsundere, your flirtatious heroine, a buxom elementary school student, and a delinquent who likes the main heroine and thinks he can save her from the clutches of Yoichi (This is a harem so misunderstandings are everywhere).    The main 2 characters alone should be enough to decide whether you want to watch it or not. \\n\\n\r\nOverall: \\n\r\nI can only think of a few reasons as to why, you would want to watch this.\\n\r\n1. The main heroine suits your taste in terms of appearance.\\n\r\n2. You've seen every other harem show.\\n\r\n3. You've seen every other anime.\\n\r\n4. You're a masochist.\\n\r\n5. You have absolutely no expectations and just watch anime for the fun of it.\\n\\n\r\nSeriously though, there are way better harem anime out there. Trust me, this show is only going to make you rage at it's excessive use of misunderstandings. perverted situations, and tsundere tendencies. To top it all off, the show is not romantically conclusive, so you're surely to be disappointed and angry. \\n\\n\\n",
            "date": "2014-12-11T20:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 171847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3914907.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zeroskye",
                "username": "Zeroskye"
            },
            "url": "https://myanimelist.net/reviews.php?id=171847"
        },
        {
            "content": "From the synopsis I think I know what you're expecting. Yes. It's your typical martial-arts love-comedy.\r\nI didn't have to turn on my brain while watching this. It's pretty much your average and inoffensive shounen anime served in an average and inoffensive way. Perfect after a tiring day at school or at work.\r\nOn to the review:\r\nEpisodic almost throughout the whole 12 episodes. It doesn't try to be groundbreaking nor does it try to be \"deep\". However on what it did not try, it succeeded on making the anime fun. Let's face it, there are times that everyone would simply want to sit back, turn off theirbrains, and enjoy the show. That's how this anime is.\\n\\n\r\nThe production quality is average as a whole. Character designs are formulaic shounen style with cute and sexy girls, and wimpy, pretty boy, or brute looking guys. Typical you've \"seen one, seen them all\".\\n\\n\r\nI can recommend this anime if you're looking for some shallow yet enjoyable entertainment. Most anime of the same genre can't provide those two important elements at the same time nowadays.",
            "date": "2009-03-30T01:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 13603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=13603"
        },
        {
            "content": "Asu no Yoichi! is surprisingly unwatchable. While not an absolutely terrible anime, there’s just simply nothing special about it at all. None of the characters in the show are memorable, the action is boring, the plot is predictable and even the fanservice is disappointing. I have to question the director’s decision to animate this show in the first place; after watching all twelve episodes, I had to ask myself, “So what? Why do I care about any of this?”\r\nAnd frankly, I couldn’t find an answer. I simply could not bring myself to care about any of the characters in the show. Scripting and plot aredefinitely to blame for this, as the seiyuu do a pretty good job of attempting to bring out character. Yet, how does one extract personality from a cardboard cutout? The characters are absolutely flat and act in a manner that is insultingly predictable. Yoichi, as the hero of a harem anime, is perverted and clueless; Ibuki, the master of the Dojo, is the stereotypical busty family matriarch… the list goes on and on. The creators put absolutely no thought into the motivations and aspirations of the main cast, and the result is absolute disaster.\\n\\n\r\nNot satisfied with the lack of character development in the main cast, the creators have chosen to present Asu no Yoichi! in “villian of the week” format. This leads to antagonists frequently being replaced, and causes a lack of continuity between each episode. There does exist an overarching meta-plot that drives the series, but its premise is so ludicrous and its resolution so predictable that the series could have done without it.\\n\\n\r\nIn addition, the fanservice and the comedy are both flops. Absolutely no decent fanservice occurs throughout the entire show; weak attempts at accidental boob-grabs (as is common in all harem shows) are made, but the results are rather painful to watch and seldomly amusing. Most of the humor in this show falls flat on its face; I found myself groaning in disgust more than laughing.\\n\\n\r\nAll in all, this show suffers from only one major (yet damning) problem: poor, poor writing. It’s clear that the writers did not attempt to create any sort of unique character for each member of the cast, and the show suffers accordingly. Couple a cast with as much personality as drying paint with a highly repetitive plot and uninspiring humor… and you have the disaster that is this anime.",
            "date": "2015-04-25T14:02:00+00:00",
            "helpful_count": 6,
            "mal_id": 186445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/leep11",
                "username": "leep11"
            },
            "url": "https://myanimelist.net/reviews.php?id=186445"
        },
        {
            "content": "To tell the truth i didn't think i will enjoy this as much i did.At first i think this will be boring,and i will probably drop it at first two episodes,but i was wrong.I liked this anime a lot,don't get me wrong it wasn't perfect,but if you like funny anime to kill some time i would recommend this one.Characters are great,and funny.But if you want some great marshal arts and fights this one is not for you.You would be just fine if you would watch one episode per night to get some laughs before going to sleep.And if you like anime I would also recommendto read manga,in my opinion it is little better that anime.\\n\\n\\n",
            "date": "2018-05-05T08:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 279831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7170081.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/shy_boy",
                "username": "shy_boy"
            },
            "url": "https://myanimelist.net/reviews.php?id=279831"
        },
        {
            "content": "Asu no Yoichi, seeing the ecchi/romance tags, I went into this expecting a fine balance of a shounen, martial arts setting and some romance infused with some fan service ecchi. I'm sorry to say that near the end, it failed to fully satisfy me. \r\nStory: 6\r\nArt:8\r\nSound:6\r\nCharacter:6\r\nEnjoyment:6\r\nOverall:6\r\nStory: The story to Asu no Yoichi is mainly focused on the interactions between the characters, but also since the anime included a shounen aspect, it had the action focus as well. The balance between the two however wasn't exactly up to par in my standards. With the setting A.N.Y. gave, it could have turned out much better,but had alot of wasted potential due to the overall lack of flow the story had. A main plot line was obviously given from the shounen theme, but hardly followed, and easily discarded. This doesn't mean the story was bad, it may be that I have watched too many of similarly themed anime and have found too many that are superior to this one, but, the main problems I found with the story is the lack of overall flow from episode to episode. Meaning a main purpose that connects them. The anime went from a young 17 year old samurai trying to adapt in a completely new atmosphere, to just constant accidental breast grabs, and a sorry attempt at romance. The plot development is another problem; almost none is seen during the middle of the story which is when the cast of characters go about to do things very common in ecchi/harem anime like hot-springs and festivals, but when the story is given a main goal the development of it seems rushed and cliche. To sum up, the story in my experience could have been better, but Asu no Yoichi is a good anime to start out with. \\n\\n\r\nArt: The art was pretty good, the flow of pictures was well done, and I found barely any problems with it. The main thing I focus on would be the quality of the anime, which wasn't too bad, to the flow of the pictures. In both of these aspects, Asu no Yoichi didn't fail. \\n\r\nRegarding the fan service that Asu no Yoichi provided, at first it was included to add comedic effect, but the anime never tried anything different. The fan service was just the same stuff over and over in each episode; after the repetition of the same thing, it got really old and borderline annoying. Almost on par with the To Love Ru franchise. \\n\\n\r\nThe Sound: The sound wasn't very good in my opinion. It reminded me of Korean dramas since Asu no Yoichi and most Korean dramas only play about 5 songs, but a billion times. Regarding the OST, it was similarly repeated as the lack of originality in the fan service region. The songs themselves weren't bad, but after hearing the same action song over and over, it gets boring and loses the added effect that is to come from accompanying the scene. \\n\\n\r\nCharacters: The main character didn't necessarily seem like a typical main character. IMO Yoichi didn't really stand out from the anime, nor did he have a big affect on it. The only dramatic feature Yoichi had was his adaptation to the new society. His attitude/personality/goals never showed an ulterior goal, thus making him pretty much a static character. The other supporting characters were either infatuated with one of the three following characters. Ibuki Ikaruga, Yoichi Karasuma, and Ryou Washizu. The romance deveopment between each of the supporting characters and either of those three were poorly done and showed hardly if any progress. I'll also have to input that the overall obsessive personality Ukyou Saginomiya put off was just too much. His personality pretty much was repulsive and seemed out of pace with the rest of the story. Bringing up the fan service aspect again, the main character's \"Careless\" breast grabs followed up by a beating from his fellow female characters was just too repetitive and got old. \\n\\n\r\nEnjoyment and Overall: The main problems I had with Asu no Yoichi! were: the flow and development of the story, the OST's lack of diversity, the repetitive fan service, and some of the character's personalities. Other than these things, I think that it is just that I have seen too many anime like this and Asu no Yoichi failed to stand out. So with that, I have to say, if you have seen anime such as To Love Ru, Princess Lover!, Ichiban Ushiro no Daimou!, Rosario + Vampire, and IS: Infinite Stratos, you might want to skip out on watching this one. However if you are relatively knew to the genre, or anime in general this is a good starting plate. The overall story,characters, art and sound weren't bad or awful in any way; it's just that the anime lacked flow and originality. Giving this anime a \"Fair 6\". \\n\\n\r\nThanks for reading,\\n\r\nNebarto\\n\\n\\n",
            "date": "2013-07-22T21:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 106427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=106427"
        },
        {
            "content": "'Asu no Yoichi' is an enjoyable anime, unique in that it takes its time when it comes to character development or storyline progression and rather focuses on the main character - Yoichi Karasuma. In fact, despite the 'Ecchi' and 'romance' tags there's about as much ecchi or romance here as you'd find in 'death note'. There really are only two female characters here who are somewhat attracted to the male lead and some other male characters but frankly, nothing ever happens. Do not expect this to be one of those \"male lead chooses this girl in the end\" animes. It isn't. \r\nThat said, it wasenjoyable because of the protagonist 'Yoichi'. Ever wondered what would happen if a hardy samurai who trained in the mountains ever since his birth was suddenly pushed into your average modern city and told to live with a bunch of women, all in the hopes of becoming stronger? Well this anime attempts to simulate such scenario with hilarious results as Yoichi is a staunch Bushido adherent and the modern world is... well less pious and based on rather simple principles. Therefore our Samurai more often than not ends up beating people up for a variety of reasons and teaching them how to be more honorable, inside and outside the ring, so to speak. Good stuff. \\n\\n\r\nNow, there are numerous recurring characters throughout the series, majority of which are of course female. As I mentioned before don't expect any real romance here because frankly this anime has no direction when it comes to that. We have two guys - Yoichi and Washizu. The girls basically keep switching between those two. One episode Washizu is their savior and Yoichi gets beaten - the next they switch over. Repeat for the entire duration of the series. Whoop de do. As for the female characters themselves, nothing really worth mentioning. Tsundere, shy girl, sly girl... you know the drill. \\n\\n\r\nIt's the same witch ecchi here'. Of course it's there but it's rather sporadic and frankly apart from the obligatory beach episode (every ecchi anime has a beach episode) you don't really get to see that much. Furthermore it always boils down to Yoichi accidentally stumbling upon an invisible *enter object name here* and grabbing *enter body part name here* and getting mutilated by the girls. \\n\\n\r\nOne other thing that surprised me is that the ending was inconclusive. There is of course a climactic showdown between the samurai and the forces of evil opposing his Bushido ways but after all that work you'd think that he would get some sort of reward or reach a plot-relevant conclusion, however nothing happens. You're left with a feeling that closely resembles the feeling of getting rejected at a prom. Trust me I speak from experience, it hurts. \\n\\n\r\nThe art and sound are both top notch. The characters are well animated and you can always enjoy the samurai's ass-kicking in high quality. Likewise the opening and ending is well made and fits in with the series itself.\\n\\n\r\nAll in all, 'Asu no Yoichi' is a good anime, nothing more nothing less. Not really high on my re-watch list but it was definitively fun. If anything, watch this for the main character. He will teach you how to become a better person... after kicking your ass.",
            "date": "2013-05-04T10:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 95935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=95935"
        },
        {
            "content": "Summary: This anime was pretty good for the harem/fighting/ecchi genre. It is PG-13 so it doesn't go over the top like others and instead is more character and plot driven. The story wasn't too complex, the characters mostly fit into tropes and a lot of the comedy and plot line were pretty standard to the genre, but it did everything well enough and felt like a good addition. I specifically liked the character models even if they weren't anything special. \r\nI view this as a good preview into the universe to help the viewer decide if they like the story enough to read the manga,which I did. I also think it is good as a stand alone story, and ends without any major cliff hangers. Overall if you're looking for a new anime in the genre you might want to give this a try.\\n\\n\r\nStory: 7/10\\n\r\nThe story was pretty typical. Guy comes from the mountains and lives in a dojo with girls. There are a bunch of silly love interest plots (it was refreshing not every girl had a crush on him), there are some fights with random bad guys but mostly just silliness and trope filled comedy.\\n\\n\r\nArt: 8/10\\n\r\nThe art was done well. I really enjoyed the character models, the characters were unique and I liked the illustrations, they definitely enhanced the experience.\\n\\n\r\nSound: 7/10\\n\r\nIt was descent. Nothing memorable but it got the job done.\\n\\n\r\nCharacter: 6/10\\n\r\nThis is the weaker element of the story. Most of the characters and their development are straight down trope lines. Granted some of them get a bit of evolution but it all felt too convenient. You know that thing where bad guys learn the error of their ways in 30 seconds? Yeah that happens... a bunch. \\n\\n\r\nAs far as the tropes: Slightly pervy guy who always ends up accidentally grabbing a girl's chest, Tsundere, shy girl, loli girl, aloof not interested girl, girl who has huge breasts, girl who has small breasts and mentions it often, super tough guy who is really weak and his clingy best friend. Nailed it!\\n\\n\r\nEnjoyment: 7/10\\n\r\nI enjoyed it for what it was, a trope filled pretty standard harem/ecchi/fighting anime.\\n\\n\r\nOverall: 7/10\\n\r\nIt's good for what it is. It isn't venturing outside the box or winning any awards, but what it does it does just fine. There is enough uniqueness to the plot to make it worth watching. The characters follow tropes but also have enough unique points to make them interesting in their own way. At a minimum, it convinced me to give the manga a try, which I think was likely the entire point of this anime... so mission accomplished!\\n",
            "date": "2016-02-05T22:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 210225,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=210225"
        },
        {
            "content": "This review will be short. This anime was entertaining but ultimately left zero impact on me. I will never watch this again, never talk about it again and I think that is the show's biggest issue. It isn't that the show was bad, it wasn't... but for all the elements that the show got right, it seems to use some of them incorrectly. There is also no resolution for any of the established romances. None. Not a kiss, hug, confession, nothing... from anyone. I was expecting more all around TBH. Loved the premise, loved some of the characters but the execution of pacing and storyleft much to be desired.\\n\\n\r\nStory: 4/10 - Packed with potential, ultimately it doesn't deliver on what could have made it a must see anime. As it stands, its not bad... just very forgettable. \\n\\n\r\nART: 7/10 - Good solid animation but nothing that I would write home about. \\n\\n\r\nSound: 6/10 - I really liked the opening theme. I don't know how appropriate it was to the theme of the show but I can't complain. Very nice.\\n\\n\r\nCharacter: 7/10 - I liked the characters in this one... though the main female was totally wrong for her type. She is oddly violent for the established \"mother figure\" character. I would have pegged the blonde sister to be more violent when those awkward situations arose. I can't help being a sucker for Kagome, who is just so cute and fills the \"Shinobu\" class as I call it... the quiet, shy, sweet girl who is good with domestic stuff.\\n\\n\r\nOverall: While I liked this and don't have anything overly bad to say about it. It lacks a few elements which could have made it so much more. Virtus Signum gives this show a 6/10. Decent.",
            "date": "2014-03-26T17:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 137123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/VirtusSignum",
                "username": "VirtusSignum"
            },
            "url": "https://myanimelist.net/reviews.php?id=137123"
        },
        {
            "content": "Asu in yoichi is one of those harem cliches in which the protagonist conquers all the girls around him and does not take any of them, but it is not a bad anime, on the contrary it can be good even being cliche.\r\nThe story of the anime is simple, yoichi is like a swordsman who lives in the mountains with his father and then leaves the mountains to live with the ikaruga sisters. The story doesnt have a good villain and doesnt follow a direction, are episodes made more to relax than to induce you to think, is more focused on comedy than in historyand on showing yoichi approaching the sisters\\n\\n\r\nThe genre romance is very badly done in the anime, yoichi is a protagonist that almost never demonstrates emotions related to love, there are scenes in which the girl is totally blushing and he without reaction some looks like a doll. \\n\\n\r\nThe art is normal, it's nothing special but it's not bad either, besides the ikagura sisters are very cute, The anime doesnt have many soundtracks, and the ones it has are good, just as art is nothing special.\\n\\n\r\nThe protagonist would be a good character if it is a shonen but it isnt the case, so dont avenge. He has a strong sense of justice and has many moments of chivalry, is also strong and is a little perverted, speaking of the ikagura sisters, are very charismatic, ibuki is the one who most appears as if he were our main heroine, is extremely beautiful and violent , Also know martial arts. Another Character is ayame, which is one of my favorites, she is in love as well as all by the protagonist, she isnt violent as ibuki and suffers in an inferiority complex by the ibuki, which is always recognized, that old cliche of always being the second and The big sister the first...\\n\\n\r\nAnother character is the chihaya that along with ayame are my favorites, chihaya at first appears to be one of those who will not like the protagonist but there in the middle of the anime she falls in love with yoichi chivalry acts motivated by her sense of justice. Chihaya likes to draw manga and she lives by Ayame wave, she is beautiful and she is the one who likes to make jokes in the anime.\\n\\n\r\nAngela also has one of the villains at the beginning of the anime but later she likes the yoichi and she is very hot. Now, let's go to the girls who do not like Yoichi, first the kagome younger sister of the ikagura, she's about 10 years old, all she needed was to like the protagonist too, it would be ridiculous. The other is the one who does not like the protagonist and is his age, his name is tsubasa and she likes another guy who is from the school of yoichi, is a character that barely appears.\\n\\n\r\nIt's a good anime to pass the time, it's a simple anime with light comedy and pleasant elements, it's just to distract, it's far from a bad anime, it might even give a bigger note, but it's not my kind of anime. Not have a story and focus only on the comedy and the \"romance\" that in this part is poorly done ... I recommend to those who like animes as what they are kind of silly\\n\\n",
            "date": "2017-01-29T16:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 239457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520845.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/manoeltb21",
                "username": "manoeltb21"
            },
            "url": "https://myanimelist.net/reviews.php?id=239457"
        },
        {
            "content": "I am not interested in writting a one page review so i will try to make it a quick review.\r\nI loved this anime for just 4 episodes! But after that story will start going down like there will be soo mamy characters introduce i can't even remember  their name. Girl character in this anime is good but seeing soo many heroes make this show cringy for me to be honest.\r\nStory was decent nothing too special about it. It's not that enjoyable after 5th episode\r\nArt was good no complain about that. \r\nSound was also good. \r\nEnjoyment is not that good XD",
            "date": "2017-10-04T20:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 259729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6569148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XxPOPTARTxX",
                "username": "XxPOPTARTxX"
            },
            "url": "https://myanimelist.net/reviews.php?id=259729"
        },
        {
            "content": "Wow, this is one show that gave me a lot of thoughts.\r\nReminds me of : Gintama (wise sayings and wooden sword, imba samurai), and (forgot)\r\nFrom mangaupdates\r\nAnime Start/End Chapter\r\nStarts at Vol 1 Chap 1\r\nEnds at Vol 4 Chap 16\r\nNOTE: I finished watching the anime, but only read a few chapters of the manga. My thoughts are: The manga is much more ecchi and draggy than the anime. \r\nPros:\r\n->Great mix of martial arts, comedy, ecchi, romance, harem, friendship and tear-jerking moments\r\n->Amazing action throughout the show, great ending (10-12)\r\n->Excellent OP and ED, some bgm were very fitting, characters' voices were fitting\r\n->Doesn't have much unnecessary detail, inspiring, character castwas utilized a lot (even side characters)\\n\\n\r\nCons:\\n\r\n->Romance was quite messy, didn't have much of a conclusion\\n\r\n->Villain was super-imba, main male character too, too many sides to main characters shown\\n\r\n->Seemed like the main male character was downplayed on a lot, pity him D:\\n\r\n->Concepts raised in the beginning seemed to be removed later (School life, romance-> attacks by assasins and crises)\\n\\n\r\nStory:8\\n\r\nArt:9\\n\r\nSound:9\\n\r\nChracter:9\\n\r\nEnjoyment:9\\n\r\nOverall:8 (8.84)\\n\\n\r\nHope there will be a 2nd season :D\\n\r\n(Review to be continued)\\n",
            "date": "2010-03-12T02:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 23910,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23910"
        },
        {
            "content": "Asu no Yoichi! Or, by another name, Samurai Harem. As a boy, i'm into the harem and ecchi anime genres. And this anime, well it delivers. WARNING: Anti-Ecchi people read no further!\r\nStory\r\nAsu no Yoichi starts off with the main character, Yoichi training in the mountains with his father. The father then says that he has taught him everything and he needs to go out to train further. He then leaves the mountain to trave to the city, towards a dojo of their friends the Ikaruga Family. However he somehow ends up going into the dressing room with a girl (all the while 'accidentally?' gropping herbreasts, looks up the pantsu on another and overall, be a complete and utter pervert. This continues for the whole season, with varying amounts of complete owning of the main character by the Ikaruga family (which...btw is full of girls!?).\\n\r\nIf you're looking for a good storyline...you're probly not gonna find one here. The plot was littered around the eps, between the love triangle between the main character and Ibuki and Ayame of the Ikaruga family, and the various ways Yoichi gets crippled by Ibuki.\\n\\n\r\nArt\\n\r\nNot much to say here. Characters were drawn well and the mixing of chibi was a nice touch.\\n\\n\r\nSound\\n\r\nHmmm...not that great. OP and ED weren't anything memorable (well..at least not to me). Some songs fit the situation, some didn't.\\n\\n\r\nCharacters\\n\r\nThe character development was actually pretty good. It went into the Ikaruga families history abit and learned quite alot about the girls.\\n\r\nTheres quite a bit of characters here so imma jus cut it down\\n\r\nYoichi Karasuma - The main character of this series. A good swordsman and usually gets into perverted situations. He's freeloading at the Ikaruga family to learnt their swordstyle.\\n\r\nIbuki Ikaruga - Main heroine of this series. Head of the Ikaruga family since their parents left at an early age. Popular at school due to looks and brains blah blah blah. Your basic harem heroine pretty much.\\n\r\nAyame Ikaruga - Probably my favourite character of the series. A tsundere character, shy and very aware of her breast size. Probably the one that has gotten into the most perverted situations with Yoichi. 2nd to only Ibuki occasionally.\\n\r\nSaginomiya clan - Not saying the main villains name in case of spoilers. Basically the villain has a crush on Ibuki and Yoichi's getting in his way.\\n\\n\r\nOverall\\n\r\nIt was a enjoyable anime to watch with nice and funny scenes throughout. Recommended to watch, but don't expect a great storyline, jus lots of fanservice and laughs.",
            "date": "2011-03-04T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 34903,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442917.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shrurikan",
                "username": "Shrurikan"
            },
            "url": "https://myanimelist.net/reviews.php?id=34903"
        }
    ],
    [
        {
            "content": "At first I thought OMG another Fumoffu is on the way! A swordsman who has lived his entire life secluded in the mountains (no experience in the real world) comes out and moves in with a family of girls.\r\nSadly, this series falls terribly short of my expectations. Yoichi is no Sosuke. To be fair, I'll write as if I wasn't originally comparing with the great Fumoffu.\r\nThe series focuses on a swordsman with nearly invincible skills who continues his training with the Ibuki family who own a dojo of the same sword style.\r\nThe series is pretty much a typical ecchi-type harem with a small amount ofaction. The story is loose and the main plot-line is a bit on the weak side. Overall, it's just an average watch.\\n\\n\r\nAnimation:\\n\r\nThe animation is average with current standards and coloring. Sadly, the series falls into the category of everyone wearing the same thing for the majority of the series. Yoichi's hands/head always lands in an ecchi spot, which gets really annoying after a while. Fight scenes are fairly well done but pales in comparison to other current shows such as Kurokami.\\n\\n\r\nSound:\\n\r\nThe OP and the ED are fair, but not enough to make me want the soundtrack. The BGM is fair but not really that memorable as well. VAs are fine as usual. No terribly annoying voices in this one. Overall, pretty fair sound to match a pretty fair animation.\\n\\n\r\nMusic: 3/5, VA: 4/5.\\n\\n\r\nStory:\\n\r\nYoichi's father decides that his son is now strong enough to go to the city and face new trials in life. While at first, Yoichi seems to truly lack a sense of street smarts, this is not emphasized for the majority of the series, and thus a potentially wonderful source of humor is wasted.\\n\\n\r\nEvery single episode in the middle of the series follows the same pattern: introduce some characters, add some background details about the Ibuki girls, and then have a battle where Yoichi wins with ease. Kind of similar to the old time Sailor Moon style but leaves the series feeling flat.\\n\\n\r\nThe early part of the show have brief foreshadows to the final arc which is decent in depth but likewise atrocious in execution. Having watched the first 9-10 episodes, practically anyone would be able to guess the linear progression in the final few episodes.\\n\\n\r\nSadly, the potential humor in a guy unaccustomed to modern culture is wasted on a bunch of panty shots and breast grabs.\\n\\n\r\nCharacter:\\n\r\nThe character interactions and relations in Yoichi are fairly interesting, but development is very slow and many secondary characters appear and disappear almost at random.\\n\\n\r\nYoichi himself is an innocent and brutally strong warrior who can easily take on groups of strong opponents. In fact, (other than his inability to swim) he pretty much beats all his opponents with one or two of his attacks.\\n\\n\r\nThe Ibukis like Yoichi after a while and some of them develop deeper feelings for him. However, these are overshadowed by massive amounts of fan-service and ecchi-grabs which undermines the possibility of any further development.\\n\\n\r\nValue:\\n\r\nIf you're looking for a Fumoffu, you're going to be disappointed. If you're looking for a good action show, you will be disappointed. If you're looking for a good romance, you will be ROYALLY disappointed.\\n\\n\r\nAsu no Yoichi is a fairly average show with an overemphasis on fan service. If you watch it, I recommend that you do so with low expectations. There are some humorous scenes but overall it just doesn't stand out.",
            "date": "2015-11-01T14:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 202443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202443"
        },
        {
            "content": "Think of a very successful harem AND martial arts anime. There are a handful, but Asu no Yoichi would probably in the middle, between successful and unsuccessful.\r\nStory: 6/10\r\nIf you're looking for a very serious story, then you wouldn't want to watch this anime. Not a lot happens in each episode and even as a martial arts anime, you would expect something that would make hairs on your neck stand, but you would be disappointed after you watched this.\r\nArt: 6/10\r\nDecent art, not too bad for a 2009 anime. The colors were distinguishable, knowing that the color in this scene is blue and that is red. \r\nSound:5/10\\n\\n\r\nThe OP sounded half-assed, because the singer sounded very lazy when singing. I don't know about singing that much but if it was supposed to be like that, then count me out. I never really seen the whole ED, so I won't judge on that.\\n\\n\r\nCharacter: 4/10\\n\\n\r\nLet's start with the protaganist, Karasuma Yoiichi. A very generic harem protagonist, with clichés such as, misunderstanding the fact that he fell on her on accident, yet she thinks it was on purpose. At least the protagonist wasn't a big pervert.\\n\\n\r\nIkaruga Ibuki, probably the most obvious character that would be picked by Yoiichi. Your average martial arts woman. Nothing much to say, wasn't my favorite woman character. The thing I hate most about her is the fact that she easily misunderstands situations, such as Yoiichi accidentally landing on her, magically touching her breasts.\\n\\n\r\nIkaruga Chihaya, a mangaka (comic artist) who loves manga to the bottom of her heart. Probably one of the kindest characters in this anime.\\n\\n\r\nIkaruga Kagome, a \"10\" year old \"child\" (you'll understand why I put the quotation marks at a certain episode) who has the culinary experience of an average housewife. Doesn't misunderstand people unlike a CERTAIN character. A very shy \"child\". \\n\\n\r\nLastly, one of the main 5 characters that probably pissed me off the most, Ikaruga Ayame. Your very average tsundere. Why am I pissed off at this character? Would you be pissed off if a girl likes the main character, but later on also starts to 'like' another character too? Liking 2 characters at once isn't helpful to a romance story. Fortunately, me being pissed off at her didn't stand that long.\\n\\n\r\nWashizu, Ryou, the delinquent of the story. Fortunately, he isn't much of a dick. But, he does misunderstand situations easily too. A kind delinquent, who used to be the strongest delinquent in middle school, until meeting a friend, becoming much more friendlier and gentle. Similar to the 2 characters Naoya Shirokawa and Ryūnosuke Kurosaki (members of the Moron Trio from Kaichou-wa Maid-sama!) \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nThough I disliked most of the aspects of the anime, I did half-enjoy it. It wasn't the worst anime I've seen, but it wasn't the best. Would I re-watch it? Probably no.\\n\\n\r\nOverall: 6/10\\n\\n\r\nWatch this anime if you're bored, looking for another better title than this while watching the anime (animeception????)\\n\\n",
            "date": "2015-01-21T04:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 178667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=178667"
        },
        {
            "content": "Asu no Yoichi!, this title doesn't standout much but it's definitely worth watching. This story doesn't revolve around fan service and unnecessary ecchi scenes that doesn't connect with the anime.\r\nStory:\r\nThe story so far was very good the action was top notch fist and swords is truly an amazing type of actiont to put in a story. The drama was good it wasn't a romance drama though but its some sort of an \"Unrequited love Forgotten Past\" type of drama, and to make things better the fan service shows up when it's truly needed.\r\nThe comedy here is Class A! (Think of Harima Kenji from School rumblewhen you look at Washizu then you'll truly understand) \\n\\n\r\nArt:\\n\r\nThe art was truly astounding, but to put it in terms that all fans would appreciate... THE FAN SERVICE ART REALLY IS DA*HIT! perfectly great character design.\\n\\n\r\nSound:\\n\r\nThe intro was pretty good to begin with, it fits perfectly to the \"I'll Be the best swordsman\" theme going on.\\n\\n\r\nCharacter:\\n\r\nSo far the only character that caught my attention was Ayame and Washizu really great comedy from those two. The development for the people didn't seem to go somewhere, no relationships did blossom though.\\n\\n\r\nEnjoyment and Overall\\n\r\nComedy + Fists and Swords + Drama + Fan service = your loss if you don't watch it.\\n\\n\\n",
            "date": "2009-05-15T04:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 15045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174067.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eX",
                "username": "eX"
            },
            "url": "https://myanimelist.net/reviews.php?id=15045"
        },
        {
            "content": "Asu no Yoichi a.k.a Samurai Harem is an ecchi harem martial arts comedy series that isn't great but it is kind of entertaining. I may not be a big fan of harem series but I don't mind ecchi if it's not over the top. Despite being having harem right in the title, you don't really get an actual sense of a harem forming in this series. The main character Yoichi Karasuma is in fact surrounded by girls but only two actually make an attempt at vying for his affection while the others are typically there to suffer at the hands of his \"ecchi accidents.\" DespiteYoichi being the main character, he isn't really an important person but the fact that he has Ibuki's attention gives him some worth in this series. Really Ibuki, the oldest of the Ikaruga sisters is the most important character in Asu no Yoichi as the MC's rival and the antagonist are in love with her and the development of her sisters revolve around her in some way. Eventually you begin to feel that Yoichi is really nothing but an obstacle put in place for cock-blocked related comedy and ecchi scenes.\\n\\n\\n\r\nThe most interesting character development in Asu no Yoichi will be Ayame attempting move from under her  older sister, Ibuki's shadow. Everything else is pretty much fanservice in some way shape or form with the comedy being kind of bland and the action scenes being interrupted by nosebleeds. The one thing that doesn't mean anything to the plot but it really stands out is the strange shrinking of Torigaya which is never explained and becomes even more strange in the last episode. Speaking of which, the last episode was horrible. I really wanted an answer for Torigaya's weird shrinking but oh well. In the end, there isn't really anything special or note worthy about Asu no Yoichi but I guess if you're looking for an ecchi martial arts series with a poor attempt at a construction of harem, you might want to check this series out...\\n\\n\r\nGLHF.. :)",
            "date": "2016-01-05T10:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 207813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=207813"
        },
        {
            "content": "I thought it was going to be something like Rurouni Kenshin, in the sense that the MC travels and encounters lots of opponets. But Asu no yoichi doesn't have much story, and doesn't have much martial arts either. it's more slice of life, day by day events, and that was disappointing.\r\nThe characters use the same attacks over and over again and none of them become stronger, because they're all invincible. non of the enemies is a real threat. \r\nThat the anime focuses more on the moral values and the characters vision of justice.\r\nAll of the female characters have a fixated personality and act according toit, therefore you can predict how the will act upon a certain situation, what the'll say or do. \\n\r\nIt gets repetitive arround episode 5, because nobody does anything different that you haven't watched several times already.\\n\\n\r\nEvery episode is the same cliché joke over and over again from each girl.\\n\r\nSome bad things simply \"happen\" for the sake of the characters having something to fight against, this is incoherent and senseless.\\n\\n\r\nThis anime coul'd have been a solid 8-9 if the jokes weren't the same every episode, if the characters didn't do the same things over and over again.\\n\r\nIt never grows much from the first few episodes. And it gets borring half way through.\\n\r\nI when i started it felt like a 9, but at the end it was a 6 more close to 5.\\n\\n\r\nThis is a pretty bad harem and a bad martial arts anime, that starts greatly and then goes downhill.\\n\\n\r\nNon the less, It will definitely give you some laughs. I recommend watching it because despite these errors, it's entertaining and has some moments that are funny. It's not a must watch, and it wont be on your top favourites, but If you are curious just give it a try. Everyone will  find something to enjoy.",
            "date": "2018-07-12T22:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 283856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JAMPS",
                "username": "JAMPS"
            },
            "url": "https://myanimelist.net/reviews.php?id=283856"
        },
        {
            "content": "~My very first review\r\nI'm not really a big fan of harems but when I found this I decided to try it. I would say on my personal opinion it wasn't amazing, but it wasn't bad either. For me it felt like it was lacking something. I couldn't know exactly what it was until I just reviewed the anime in my head and then it hit me! It's lacking depth to the main character. Throughout the whole anime all we basically knew about the main character was that he practiced really hard to become a very powerful samurai in his childhood and he lacked basic socialskills. That was the only thing I didn't really like but other than that it was pretty good! So I hope you find this review helpful. This anime was very good so you should try it!\\n\\n\r\n~Angel_Kingdom",
            "date": "2016-09-18T20:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 229401,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5467775.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/angel_kingdom",
                "username": "angel_kingdom"
            },
            "url": "https://myanimelist.net/reviews.php?id=229401"
        },
        {
            "content": "I loved the show until the ending came along- it felt like it wasn't made out to be a big deal, it felt more like \"yeah yeah, this happened whatever.\"\r\nI absolutely loved the characters, it almost was as if they actually came to life.\r\nThe shows story arc had some awesome moments, lots of comedy gold and special moments. The ending though, it didn't feel like we got full disclosure. It felt sort of dull and was slightly too short. \r\nAnother problem with the ending was the fight. Yoichi just obliterated Ukyuo. Honestly, it'd be like having Goku fight against a normal human being. He'd justwipe him out instantly. Not very exciting. \\n\\n\r\nMoreover, there wasn't much if any character development. It began getting slightly boring at the end.\\n\\n",
            "date": "2018-05-04T14:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 279773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Mr_Floppy_Donkey",
                "username": "Mr_Floppy_Donkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=279773"
        },
        {
            "content": "I think this anime is only the ghost of the manga. I decided to see this anime only after i read the manga and a lot of things are totally absent, like the ecchi element. In the anime the pantyshots are nowhere to be found, in the manga are everywhere. The story is poor and the events are messed up, in the manga you can see how the relationships between Yoichi and the opponents born and there are plenty of explanations. In the anime i can see only a bunch of evente thrown without a context. The only \"spoiler\" i can do is about the\"assassin\": in the anime he's just a side character that appears in only three episodes when in the manga has a deep story and a daughter.",
            "date": "2018-03-14T14:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 273815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aefestus",
                "username": "Aefestus"
            },
            "url": "https://myanimelist.net/reviews.php?id=273815"
        },
        {
            "content": "Asu no Yoichi is a harm ecchi anime, like so many out there today.  The story line wasn't that great, but it was better than some other harem ecchi anime.  The thing that takes away from the story line in this anime is that the main character is already at his strongest, and is pretty much the strongest.\r\nThere are a few funny moments, and of course the main character is a perv.  Surprisingly for how strong he is, the girls always seem to be able to beat the crap out of him in his perverted moments, although as Yoichi likes to pointout, some of them are misunderstandings.\\n\\n\r\nThe thing that makes this anime most enjoyable is that even though the main characters don't really develop much, the same cannot be said for the secondary characters.  Ayame and Washizu struggle over the episodes to be noticed and make progress in their personality.",
            "date": "2011-12-09T10:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 48831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/688029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zayber",
                "username": "zayber"
            },
            "url": "https://myanimelist.net/reviews.php?id=48831"
        },
        {
            "content": "Asu no Yoichi is an anime that embodies the harem genre in so many ways. The art and sound are done well while so much lacks in the series for the sake of just selling a few fanservice scenes.\r\nStory - 6\r\nIt starts off with a decent premise. Teen guy has lived and trained in the mountains his entire life as a samurai. He goes to the city to continue his training and stays with a family of 4 girls. While it is sort of a harem, there are only 2 real love interests and there was pretty much zero romantic development in the series. Theoverarching plot was started earlier on than in many ecchi/harem shows, even of this length, but they left any real development until very late and in the end just failed to change anything from the first episode. The ending was disappointing. Really disappointing. Many anime choose to go with an open end, but few do it this badly.\\n\\n\r\nArt - 9\\n\r\nNo complaints here. I liked most of the art. They clearly put more effort into the art than in the story. I liked most of the character designs, though some of the backgrounds were a bit bland.\\n\\n\r\nSound - 9\\n\r\nI enjoyed the voice acting and the OP and ED. I thought they all did very well. It isn't their fault some of the lines they had to read were laughably bad and most of the voices matched their characters well.\\n\\n\r\nCharacter - 6\\n\r\nThis one is tough for me. I liked most of the characters. Yoichi and the sisters are all good characters, if a bit cliched. I really dislike many harem leads, but I liked Yoichi even if he was a bit bland and Ibuki was fine, even though they developed her character much less than almost everyone else in the show. Wa-san and his friend, Tsubame and Angela, and some of the other characters were all interesting enough. But there is zero development. One girl is the clear lead from the first episode, but most of the episodes concentrate their energy on other characters. Even with that, there is little to no development in their characters either. Add in one of the more loathsome antagonists and I just can't give the characters too high a score.\\n\\n\r\nEnjoyment - 5\\n\r\nUp until the last few episodes I may have given this a 7 or higher. I enjoy romances. And I enjoy ecchi comedies. This show has its moments. Most of them were pretty early on. But eventually, one would expect there to be some development. And when there isn't any by the 7-8 episode mark, I have to start to worry about the direction of the show. They kept doing the same jokes over and over again, so after the first few episodes, it started to lose its comedic edge as well. When they started the plot movement in the last few episodes, I was glad that something was finally going to happen. But then they just reverted everything back to the way it was. Absolutely nothing came from it other than introducing the world to an asshole. No romantic development, even with the somewhat complicated web of characters. No feeling of satisfaction from a concluded plot. And no real ending. I guess the last few moments of the show are just about right. Was that perhaps the script he was blowing his nose on?\\n\\n\r\nOverall, I have to give the show a 6. The art and sound were good and the idea of the show was not too bad. A naive kid coming to the city should make for some interesting moments, and it does, but the flaws of the show are just too big to ignore. I would say it is probably worth a watch for most anime aficionados, but many will be bored with it quickly. Luckily, or unluckily, depending on how you look at it, there are only 12 episodes. Perhaps there would be more development with more episodes, but at least it wont cost you too much time if you don't enjoy it.",
            "date": "2013-10-08T00:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 116045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/albesir",
                "username": "albesir"
            },
            "url": "https://myanimelist.net/reviews.php?id=116045"
        },
        {
            "content": "Overall\t\r\nA very uninspired love polygon/harem anime, with stuff snatched from all over the place. Concepts from mainly Love Hina, FMP, School rumble and Kenshin are obvious and despite borrowing from good sources, the end result is simply not good in any way.\r\nAnimation\t\r\nStiff animation and very standard graphics. Often, this is enough if the characters are well designed, but sadly they are not. They really tried to make the characters looks unique and cool, but they just look grey and unpersonal. Except for Ayame, who looks great and would have deserved starring a better anime than this.\r\nThe fighting scenes are not really much about fighting, butrather still poses and a lot of wind blowing about.\\n\\n\r\nSound\t\\n\r\nOpening and ending themes are allright, and so is voice acting. Except for Ayame, whose voice doesn't really suit her.\\n\\n\r\nStory\t\\n\r\nAs usual in a harem, it is qiute easy to predict the outcome. Actually, the story gets a bit more complex with each episode, as new characters are introduced, which is a good thing. \\n\\n\r\nI never really got emotionally involved in the story or the characters, so I never appreciated the most of humour either. The \"Washizu views\" and the \"raven\" ninja guy were fun, though.\\n\\n\r\nCharacter\t\\n\r\nWelcome to Big brother: Anime stars. Starring\\n\r\nHimura Kenshin\\n\r\nThe lovechild of Narusegawa and Kaoru\\n\r\nHarima Kenji\\n\r\nEr... and some other people (including a couple of surfing ninjas) \\n\\n\r\n...and they ALL have giant boobies. Yes, even the ten year old.\\n\\n\r\nMost of the characters are shallow and flat (not talking about tits here) and don't evolve much. The most interesting are the bad guys and Ayame. \\n\\n\r\nYoichi is one of one of the most boring main characters I have ever seen; he can't be beaten in combat, he is always polite and the comedy potential of his unawareness of society never really takes off.",
            "date": "2015-02-06T08:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 179775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146571.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/brynolf",
                "username": "brynolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=179775"
        },
        {
            "content": "For those who like to skim:\r\nIf you enjoy the harem genre, a bit of light action and comic relief to spice things up occasionally and are running out of things to watch Asu no Yoichi is definitely fun enough to merit a viewing.\r\nFor the rest:\r\nPlot-wise Asu no Yoichi is rather simple, though not so thin as to be unsatisfying: a young samurai, Karasuma Yoichi, descends from the mountains, where he has spent his entire life training, to join a dojo in the city, which is of course maintained by 4 sisters living without parental supervision.\r\nEven without the main antagonist of the story the interplay betweencharacters as Yoichi adjusts to his new life is enough to make the series enjoyable. A mess of tangled back and forth unrequited love mean that comedy is never far away, often delivered in very well executed and hilariously drawn daydreams.\\n\\n\r\nI found the romance aspect to be a bit lacking. Many crushes and few meaningful confessions with tangible outcomes left me feeling that the characters could have developed deeper, more complex relationships than they did.\\n\\n\r\nOverall, I found Asu no Yoichi to be a rather average anime. A few good artistic ideas and what I found to be genuinely funny comedy proved to be just enough to balance the uncomplicated plot and standard characters. I enjoyed each episode, but feel that the series overall difficult to describe without using the words 'average', ' standard' or 'OK'.",
            "date": "2014-11-04T12:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 167421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4229367.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JPAI27",
                "username": "JPAI27"
            },
            "url": "https://myanimelist.net/reviews.php?id=167421"
        },
        {
            "content": "Amazing story for a simple and easy going anime, the kind of anime you want to sit back relax and finish. I found myself drawn to it after the first episode. You know very well that a strong male lead and harem always mixes nicely. \r\nI don't really have much to say about the art.... I really don't know if I like it or hate it... ..bottom line the art is pretty normal but that's only my opinion. \r\nAs for the sound I taught it was really captivating, it really brought the scenes to life. I loved it. \r\nThe characters were nice, lovable,  cute....Even had a tsundere character. And what good is a harem anime without a tsundere character. \\n",
            "date": "2017-05-06T14:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 247088,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5991555.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/namelessme",
                "username": "namelessme"
            },
            "url": "https://myanimelist.net/reviews.php?id=247088"
        },
        {
            "content": "A fairly typical 12-and-done ecchi harem anime with great art and a good concept. The plot and character development in the first half are excellent; however, the second half is plagued with an unrealistic antagonist and a rushed finale that fails to resolve the important questions.\r\nStrengths:\r\n- great animation\r\n- relatable, likable characters. You really want them ALL to be happy.\r\n- funny\r\n- overpowered MC\r\n- not the typical harem plot (NOT all girls inevitably fall for the MC)\r\nWeaknesses:\r\n- only 12 episodes; rush job finale\r\n- antagonist in the second half is ridiculous\r\n- harem plot that gets sidetracked and never really resolves\r\nThe plot was pretty good for a 12 episodeharem anime. I was impressed with the attention given to the MALE minor characters, which are usually brushed over. Some of the girls even fall for other guys besides the MC - so be warned, there may be some NTR. Overall, the concept and characters had great potential, but the show never really climaxed because the antagonist was so bad and wasted so much screen time.\\n\\n\r\nThe main character is endearingly oblivious, and satisfyingly overpowered. Like most of the characters in the show, he has a good heart and tries to help others, but often makes mistakes.  In that respect, he is very similar to the main characters from Full Metal Panic/Fumoffu and Rurouni Kenshin. The other characters are generally well done, too, especially one of the male minor characters, Washizu, who is both round and dynamic. On a somewhat related note, I suspect that one of the characters doesn't really exist, which is interesting, to say the least (take that with a grain of salt, though - it's 3:30 AM and I just binge-watched 12 episodes of an ecchi harem anime).\\n\\n\r\nOverall, it gives you everything you expect from this type of anime, and more. I recommend it if you liked at least 2 of the following: Demon King Daimou, Rakudai Kishi no Cavalry, Full Metal Panic/Fumoffu, Air Gear and Rosario+Vampire.",
            "date": "2017-02-17T01:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 240748,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mclovin007",
                "username": "mclovin007"
            },
            "url": "https://myanimelist.net/reviews.php?id=240748"
        },
        {
            "content": "So yes i might be parsing this a good bit for the rating im gonna give it but yeah lets get into it\r\nStory: so the story pretty much starts with Yoichi who has been training for 17 years now that hes learned so much he hasn't had the time too really see the city and also doesn't now anything about the outside world pre say so his father sends him down too see the Ikaruga sisters to learn but too also get to know the world rather than that other people want too take him out\r\nArt: art was very good nothing bad about it\r\nSound: sameas art it was very good\\n\\n\r\nCharacter: Yoichi is a pretty decent guy he does end up getting into situation with all the girls but hes not a perv so yeah but hes a kind and nice main character. Ibuki is a pretty nice and also clam girl she likes the main person Yoichi. Kagome is basically the little sister of the anime shes sweat and nice little girl honestly that's all too say about her. Chihaya shes basically the same as Ibuki but shes a manga artist. Ayame is different from the other girls when ever she thinks about Yoichi she tends to get flustered and what not she basically the tsundere of the anime.\\n\\n\r\nEnjoyment: now i hella enjoyed this the comedy was pure gold for me cause of the situation that Yoichi would get in with the girls also the action was actually pretty good aswell also there is no harem if anything only Ibuki and Ayame like him\\n\\n\r\nOverall: giving this a 9 i know its a little high for some people but for me its right for it cause it had everything for me freaking funny comedy and also that the action was good aswell",
            "date": "2016-11-27T22:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 234526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=234526"
        },
        {
            "content": "Hey folks, this will be a review for Asu no Yoichi. I have a fair amount of negative things to say about this anime. As someone who loves this genre its generally hard to find one that I dislike to this extent. Lets get into it.\r\nThe story is somewhat interesting and has a premise which could have been used to create an entertaining anime. A boy who lives in the mountains and trains in his family's special sword skill is sent to live in the city with people his father knew under the pretense of training further. The first couple of episodes played this outreally well. We were introduced to our main character Karasuma, Yoichi, and got to join him as he made his way through the city the first time. Needless to say he runs into trouble almost immediately and gives the false impression of more fun to come.\\n\\n\r\nAfter these first few episodes we are thrown into random encounters. The show has a slice of life feel with terrible scenario writing. Each sister has an event which makes them either come to like or respect Yoichi. However these events are terribly written, or should I say poorly written and hindered by the lackluster characters. After the sister events Yoichi and his sword style are targeted by an unknown person for unknown reasons. This remains true until the last two episodes which are so lame it was all I could do to not drop it. Unfortunately I cant go further into detail without spoilers but, it really felt like the writers felt bored wrote something then tried to patch it together into a coherent story later.\\n\\n\r\nThe art and sound were just ok. I liked the art style but it is dated. Soundtrack was very forgettable.\\n\\n\r\nThe characters were the straw that broke this harems back. As eluded our male MC is an uncultured samurai. After reading the synopsis and watching the first episode I had thought it would be similar to FMP. Unfortunately the writing kicks in here and they just turn him into one of those super unlucky characters surrounded by violent women. He constantly is getting his butt kicked by the sisters for various things that are either stupidly childish like the \"oops, I grabbed your boobs even though nothing was going on but it felt like the correct time to add in a laugh\", or various other situations that he actually wasn't responsible for.\\n\\n\r\nThe four sisters Ikaruga, Ayame, Ikaruga, Chihaya, Ikaruga, Ibuki, Ikaruga, Kagome were amazingly shallow(as was all the other characters). Ayame was the super tsundere who after being a cunt for the first couple episodes decided to cook for the sick Yoichi, who even in his sickened state managed to do impressive acrobatics and win her heart with kind words. She goes on to not do anything to progress her love for Yoichi and interrupts the action with jealousy at every turn. Chihaya is a manga artist and loves to tease Yoichi and get him into trouble. She actually had a decent enough story behind her interest in him but felt rushed. She basically only makes a few appearances and really isn't important. Ibuki the main female character is violent and falls for Yoichi because of his swordsman skills. Kagome was supposed to be the grounding stone in this family as a cute young semi mature sister. However she only plays small parts in aiding either a story event or helping a sister do something.\\n\\n\r\nThe other characters are barely worth mentioning. Throughout the show they introduce more characters but they all are basically cheesy villains that are used and tossed aside. There is a massive love tangle in this show. Almost everybody likes Ibuki and this becomes the driving factor later in the show. This introduces your typical blonde haired delinquent and your rich prince like character.\\n\\n\r\nI was so disappointed in this anime. I didn't expect it to be amazing but at least average for a harem. The beginning was a good hook and made me interested in the rest of the show. However it quickly becomes repetitive, cringy and even frustrating. The ending was pretty bad and really drags this shows score from mediocre to bad. The girls weren't that cute, main character didn't feel like he had a personality and wasn't really interesting to watch. Not really  a bad thing but I should also mention calling this show ecchi is a major overstatement. There are only two moments in the entire show which was eye catchingly sexual in but the rest was like shoulder level cleavage and the occasional ripped shirt to show an undershirt. Overall this one should be avoided, even by those of you who enjoy this genre. This isn't very well detailed because this show is so bland that even the smallest detail would probably save you a few episodes.\\n\\n\r\nTLDR: Not good, poor writing, bad characters, no echhi. Even harem enthusiasts like myself shouldn't watch.",
            "date": "2016-02-23T19:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 211560,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=211560"
        },
        {
            "content": "story 9\r\nart 8\r\nsound 10\r\ncharacter 9\r\nenjoyment 10\r\noverall 9 \r\nI personally think that this anime can suit most peoples tastes for anime theres pretty much everything in it and it comes with a good storyline.  With all the characters bringing their own unique appeal how could you possibly dislike this anime.  I am probably not the only one who found this amazingly entertaining.",
            "date": "2012-12-30T08:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 81972,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1962922.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Garvin",
                "username": "Garvin"
            },
            "url": "https://myanimelist.net/reviews.php?id=81972"
        },
        {
            "content": "Asu no Yoichi! is no typical samuri show. It has action like most samuri shows the enemies are always different and wierd. Plus the different types adds the goodness.\r\n               The fact that this show is comedy+ecchi+harem. How could you resist. The overall plot is good and like all good shows there are no cliffhangers on the last episode. Asu no Yoichi has a great shoujo feel along with a shouen touch! You'll never get bored of this show!",
            "date": "2009-11-15T11:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 20570,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kiekie895",
                "username": "kiekie895"
            },
            "url": "https://myanimelist.net/reviews.php?id=20570"
        },
        {
            "content": "I realy enjoyed watching this it was not all harem and ecchi. Yoichi Karasuma was a samurai and only two girls that fell in love for him. It was very interesting",
            "date": "2013-05-17T04:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 97463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2561915.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/symphysiz",
                "username": "symphysiz"
            },
            "url": "https://myanimelist.net/reviews.php?id=97463"
        },
        {
            "content": "Asu No Yoichi is mainly focused on Yoichi Karasuma. A samurai who was sent to the Ikaruga Dojo/The City by his father to become a stronger warrior/experience other things that he hasn't done while living in the mountains. When he arrives at the City, he starts out as a total outcast. Causing mischief (Though he means well.), wearing strangle clothing, and even saying strange things. But as the story progresses, he slowly begins to learn the city life and eventually enjoys it. He also manages to get a few girls to fall in love with him. \r\nStory : 7/10\r\nThe story is basically a romantic comedywith action. it isn't really much of a harem. The plot of the story isn't necessarily anything too extraordinary. But it does contains lots of fighting scenes and some romantic scenes.\\n\\n\r\nArt : 9/10\\n\r\nOh MAN. Another thing that caught my attention and probably a lot of other peoples' attention was the artwork of the picture on the anime's page. THE CHARACTERS LOOK AMAZING. The females are beautiful and i have to admit, Yoichi is a pretty handsome samurai.\\n\\n\r\nSound : 9/10\\n\r\nVoice acting and sound effects for the scenes were superb. \\n\\n\r\nCharacter : 7/10\\n\r\nThere isn't any major development in characters, but you will see some development as the story progresses. \\n\\n\r\nEnjoyment : 8/10\\n\r\nIt's a fun anime to watch, the funny scenes and ecchiness kept it going along with the action.\\n\\n\r\nOverall : 8/10\\n\r\nOverall Asu no Yoichi contains : A Decent story, good sound and visuals, and mild character development.\\n\r\nAnyone who is interested in watching a romantic comedy with action and a small harem should definitely check Asu no Yoichi out. \\n",
            "date": "2013-06-15T11:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 101155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2463427.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AsphyxiateMe",
                "username": "AsphyxiateMe"
            },
            "url": "https://myanimelist.net/reviews.php?id=101155"
        }
    ],
    [
        {
            "content": "The reason I really liked this anime was for the great moral aspects it puts forth. I actually started the series by reading the manga and I must confess that at first a big reason was the \"fan service\" it included (I apoligize). However, after reading/watching it for awhile I came to absolutely love it! If an anime has fighting and a good story then thats great, but I firmly believe that the most important part of a story of any kind is the values contained within. The characters are all very kind with a great sense of responsibility and spirit. However, the biggest reasonI watch/read this series is because of the main character: Kurasama Yoichi. No matter what he is diong, whether fighting, studying, or just talking to his friends, he is always amazingly kind and puts the needs and wants of others first before his own. I believe that this servant-like attitude is what's really important in a story and in life itself. His pure character is enough of a reason for me to continue reading and watching the series.",
            "date": "2011-09-25T18:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 44143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459192.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Guardian_Angel_",
                "username": "_Guardian_Angel_"
            },
            "url": "https://myanimelist.net/reviews.php?id=44143"
        },
        {
            "content": "It is nice to come across a fun and just enjoyable to watch martial arts themed comedy anime. The story line was predictable but fun. The fan service was humorous but not overdone. The characters were diverse and interesting for the most part. So if you like martial arts, shounen, harem and some good laughs you should like Asu no Yoichi!",
            "date": "2009-03-31T20:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 13659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/M_Saint",
                "username": "M_Saint"
            },
            "url": "https://myanimelist.net/reviews.php?id=13659"
        },
        {
            "content": "Overall a decent sized anime, it had elements unique to it, while most of it ranged from what we've already seen. The name is an obvious hint to what the story is about, and it can also be misleading. It does present a lot of \"love triangles\" and unlike the manga (obviously) it leaves a few plot holes. Overall gets a 7 from me. (not that I didn't like it.)\r\nThe story a 7- cause while it does resemble a lot of harem, multi-girl to one guy anime, it is entertaining. The anime could have been extended to make the ending less choppy and more- smoothlydraw out, but it does leave room for a sequel and for the pairings hinted on to either be fulfilled or played with more.\\n\r\nThe art and sound also get strong 7's- they were all colorful characters- made me think of candy actually.The fight scenes with the martial art effects was good and while not a whole lot of serious detail the series manages to pull it off. The opening and ending titles- both happy, energetic,and the since this anime had a lot of girl voices-they were all so adorable. And it will make you laugh and think that this situation really could have turned out better.\\n\r\nThe characters get a 7. But I will give credit-the fact that one of the characters was a manga artist was a nice touch. And that the series has a lot of silliness that you don't really have to look too hard to see. The characters individually are drawn out to where they aren't really shallow- but could be developed better. Certain relationships could be worked on- while the creators did make it seem like they weren't absolute. \\n\r\nOverall it's a decent (respectfully) series to just sit back and chill and watch. To get away from the main stream, laugh, and compare.",
            "date": "2013-04-06T02:01:00+00:00",
            "helpful_count": 0,
            "mal_id": 92627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Heta-rashi1",
                "username": "Heta-rashi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=92627"
        }
    ]
]