[
    [
        {
            "content": "Post apocalyptic worlds in anime are a bit of a strange area to visit as you're never quite sure what you'll find. It could be a world of amnesiacs, a princess who loves to fly, a lone warrior searching for his lost love, an outcast hunting his own kind, a boy from another world trying to stop a warmongering dictator, or something else entirely. \r\nImagine my surprise then, to find a high school.\r\nThat's right. Here at the end of the world the best that some bright spark could come up with was another high school. That said, Koukaku no Regios (Chrome Shelled Regios), does usethe setting rather well, and approaches the whole concept in a manner that is somewhat entertaining.\\n\\n\r\nOriginally, Chrome Shelled Regios began life as a series of light novels by Amagi Shusuke, with a manga adaptation by Miyu available around the same time. A second manga adaptation followed, this time by Kiyose Nodoka, then a third (by Watari), and finally a fourth, which is, unusually, a 4-koma version by Futaba Masumi. \\n\\n\r\nOh, and there's a prequel light novel series called Legend of Regios as well. \\n\\n\r\nThe story begins in the academy city of Zuellni, a domed mobile \"fortress\" that roams the post apocalyptic world, where Layfon Wolfstein Alsief is hoping to forget his turbulent past and begin a new life. Unfortunately, he quickly catches the attention of Karian Loss, the student council president, and Nina Antalk, the leader of the 17th Military Arts Platoon.  \\n\\n\r\nAt first glance Chrome Shelled Regios seems like a pretty standard fantasy styled anime, and truth be told, this is a pretty accurate impression. The plot is fairly straight forward, with little in the way of true complexity. Unfortunately, the manner in which the story is delivered has all the hallmarks of an action melodrama, and while there are some comedic elements thrown into the mix in an effort to balance things out, the overall effect is rather lopsided. \\n\\n\r\nProbably the biggest example of this is the main character's \"turbulent past\" and the reasons why he is attending Zuellni. There is a clear attempt to obtain sympathy from the audience, however the plot seems overly contrived, and rather than ensuring that this aspect of the story is part of the greater tale, it instead stands out as one of several occasions where the show has tried to elicit a reaction from the viewer.\\n\\n\r\nThe main problem with this is that the writers have adopted an approach that is more like a traditional fantasy, something which would normally be fine given that this is ultimately a light novel adaptation. It's unfortunate then, that the transposition from paper to screen doesn't quite work, however this may be because the writers literally had multiple versions of the story, so instead of creating their own version, they simply decided to pick the best bits from all the other versions and string them together.\\n\\n\r\nThe end result is a story that has its plus points, but doesn't really know what to do with them.\\n\\n\r\nWhile the story may be a bit haphazard at times, the art and animation are of a good standard throughout the series. The characters are pretty standard fare in terms of design, but they are well animated and possess their own unique features. The backgrounds are a strange mixture of the familiar and the unusual, mainly because of the incongruousness of a post apocalyptic high school. That said, the level of detail is pretty good throughout, and while there are some genuinely absurd moments, they don't reall affect the overall look of the show.\\n\\n\r\nAs far as the music goes, the show uses a variety of pieces over the course of the series, but while the choregrpahy is often good, the music sometimes doesn't mesh with the on screen action. The OP is a typical \"beats per minute\" dance track called Brave Your Truth by Daisy x Daisy. Like many other shows, Chrome Shelled Regios has two EDs, Yasashii Uso and Ai no Zuellni, both of which are by Chrome Shelled. Both are bittersweet ballads that, unfortunately, don't work all the time given the context of the episode itself.\\n\\n\r\nOn the other hand, the acting is actually pretty decent. The seiyuu are talented and play their roles fairly well, although there are some occasions where the character can seem unnaturally emotional, something which is partly due to the script itself rather than the skills of the actors.\\n\\n\r\nOne of my biggest gripes with Chrome Shelled Regios was the lack of originality when it came to character types. Granted there are only so many to go around, however the writers seemed to have followed the cut and paste format to the letter. While the plot may be interesting in parts and the story engaging to a degree, in a series like this it's ultimately the characters that make the whole thing shine. The lead roles are interesting enough, but their development can often seem overly conrtived. In addition to this, the actual characterisation is fairly basic at best, and very little time is spent on ensuring that the characters have reasonable and valid justifications for their actions.\\n\\n\r\nAgain, this may be due to the writers attempting to incorporate all of the versions of the story into one narrative, but whatever the reason may be, the upshot is that this show really could have been so much more than it is. That's not to say that I didn't enjoy it, as Chrome Shelled Regios is entertaining in its own way. The problem is that the ideas and concepts behind the show could have been planned and executed better. The post apocalyptic high school, for example, is a novel idea, but instead of trying for more originality, the creators have gone in the other direction. \\n\\n\r\nIn simpler terms there are many thing in Chrome Shelled Regios that have been done before, and often done better. The series relies too much on stereotypes and plot devices, and too little on innovation, creativity and ingenuity. The sad part about all of this is that while the show is entertaining enough to be enjoyable to a degree, many of the elements that make up the series have only really been applied to maintain the viewer's interest (and hopefully sell some Chrome Shelled Regios goodies). This is the reason why the comedy doesn't mesh well with the rest of the plot, and the lack of cohesion at the most basic level is ultimately the reason for the poor characterisation as well.\\n\\n\r\nIt's unfortunate that, once again, a series with a great deal of potential has been let down by its creators. One can only hope that the future will bring improvements, and that more companies will stop making shows that are nothing more than glorified advertisements for related merchandise.\\n\\n\r\nAfter all, who knows what I'll find on my next foray into a post apocalyptic world ...\\n\\n\\n",
            "date": "2010-09-03T21:48:00+00:00",
            "helpful_count": 206,
            "mal_id": 30215,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=30215"
        },
        {
            "content": "*Disclaimer* This is my first anime review, so if I have done anything wrong please feel free to send me a message telling me. Also, even though my username is Sharnid, I have tried to write this article without taking sides or with bias. Lastly, please rate this anime review on how informative it was (helpful or not helpful) rather than your opinion about the anime. Thank you. \r\nStory/Plot – 6.7\r\nThe Overall plot is about Layfon Alseif, a person who has potential for being in Military Arts, but is reluctant because of his past. However, he still becomes part of the military academy, and findshimself in the 17th platoon fighting in Platoon matches, or against filth monsters and slowly revealing his past as he fights along. \\n\\n\r\nYes this deserves a low score of 6.7, why you ask? First of all Regios can get VERY VERY confusing. (almost as confusing as Lost) This is a show that demands you to either pay attention to almost everything they are showing you, or go back and rewatch a couple episodes. Even then, you still won’t understand some of the parts of the story, which suggests that this show is going to receive another season such as a prequel, but as of now, I have heard no news about it. Secondly, I have noticed the storyline follows a particular pattern, Fight Filth Monsters->Reveal a little bit of Layfon’s Past->Fight in Platoon Matches->Reveal a little more of Layfon’s Past->Fight someone Layfon knew before (Haia, Gorneo-> Reveal his past some more->Then, Bam, Fanservice episode. Then maybe, they would add an episode to show that Felli, Nina, Leerin, or Meishen likes Layfon.  However, the show does make up for it with the twists in the plot, and still the story does proceed, although it may be slow. The show gets docked a few points though especially at the end where they absolutely rush the whole thing. Even rewatches of the last episode and of previous episodes will not explain everything in the end and viewers may feel unsatisfied, almost like watching the second season finale of Lost. \\n\\n\r\nCharacters – 7.4 (this will be done with overviews with characters that have high to medium importance)\\n\r\nThe biggest flaw with the characters is that they never actually change their personalities or anything throughout the whole show. \\n\\n\r\nLayfon: is always reluctant to fight, and wants to do something else than fighting, but doesn’t , Layfon also doesn’t notice that Felli, Leerin, Nina, or Meishen likes him, and does not notice this for the whole season. However, he does have a hidden past, which means he is different from the other characters and kind of makes the viewers want to know his past. I have also noticed that layfon had 2 personalities, 1 where he was super nice, and then a more serious one. He is basically could be in a platoon by himself and still win matches.\\n\\n\r\nFelli: also wants to do something else besides being in the military academy, but doesn’t. However, Felli is one of the most likeable characters, and she herself adds a lot of comedy to the show, her kicks are more deadly than one by Chuck Norris or Bruce Lee (and also very funny), and when they draw Felli in an angry state, it is quite enjoyable. Felli also does change her personality a little to show that she likes Layfon. \\n\r\nFelli uses Psychokinesis to support the 17th platoon, which is basically large radius of sight and the ability to transfer speech and information to other members. If you need an example, think maphacks in RTS games basically, probably a very advanced form of them.\\n\\n\r\nNina: always wants to become stronger, but no matter what she does, she doesn’t really get much better, although she trains a lot of the time. She also gets mad at Layfon a lot, but she always forgives him later on anyways. She is also the leader of the 17th Platoon, but for a leader, she really isn't particularly strong and takes a backseat to Layfon. Truely speaking, she basically tried to go the warrior class and put all her stat points in INT and doesn't have a restat.\\n\\n\r\nSharnid: Carefree attitude, and like Layfon had a sort of mysterious hidden past. Although Sharnid acts carefree about almost everything, things are revealed about his past, and he actually takes it very seriously. However, many things are still not explained about him, such as his origin, and that can be good or bad, depending if there will be another season. He is currently the sniper for the 17th platoon, and if you need a reference, think of Kurz Weber from Full Metal Panic, except maybe 10 times cooler in my opinion. Sharnid is the sniper for the 17th Platoon and is also a playboy. :P\\n\\n\r\nSound/Music -8.7 \\n\r\nI mean I really can’t find big enough flaws for the music or the sound. During some extreme fight scenes, such as the one where Layfon fights with Haia to save Felli, the background music is amazing, and deserves high marks. The ending songs for the show are also very good in my opinion and they do change the ending song after the halfway point in the anime. Also if you listen carefully, each time they have different voice actors sing the ending theme song which is nice. For example, Felli sings a duet with Sharnid, along with other combinations.  However, I just don’t like the beginning theme song, and they don’t change the song after the halfway point, which leaves me to skip the beginning theme song. They also repeat a generic BGM sometimes when layfon is fighting, and that becomes annoying after a couple episodes, and docks the anime some points.\\n\\n\r\nAnimation-7.6\\n\r\nThere is really nothing special about the animation, except the fight scenes and the fan service scenes. However, when they draw Felli at times, and even Sharnid (when he is sprayed with water by Nina at the pool) it is quite comical, and brings up the score. Other times however, the animation is a bit off, if you can remember the time where Layfon is on the train alone with Meishen, and where we get a close up on Meishen's face, her nose just seems to be drawn weird in my opinion. \\n\\n\r\nEnjoyment- 8.2\\n\r\nThis anime was actually very enjoyable in my opinion, the mix between action, comedy, and fanservice kept me watching the anime to the end, and many of the characters are quite enjoyable to watch, particularly Felli. The fan service scenes also help with putting the anime in a more relaxed have fun state, instead of action and fighting all the time. Also this anime had better comedy scenes that some of the anime I have seen that were only about comedy.\\n\\n\r\nOverall – 7.72 (6.7+7.4+8.7+7.6+8.2=38.6/5=7.72) \\n\r\nOnly 7.72 on an anime I based my username off of? how come? Although I truly enjoyed this show especially the action and a little bit of the more relaxed episodes, the ending to the season really severely docked this show some points. After reading all the released manga that have been translated, I have noticed that they explain a lot more with the manga than with the anime, which means if you truly want to know everything you have to read the manga also. That shouldn’t be the case. They need to pace this anime a lot better than they did, have bigger changes with the characters, besides Felli, and explain the story more. I mean they had 24 episodes, which is a considerable amount of time to make the story work out.\\n\\n\r\nSome people also tell me, don’t worry there is definitely a second season! But how can you be so sure? They haven’t announced it or anything which suggests they are just leaving the anime as is. Hopefully, they do release another season, and explain all the holes in the story, which will definitely lead to a better score in the next season.\\n\\n\r\nIn the end, If you are looking for an anime that has good fighting scenes, relaxed scenes with the 4 girls that like Layfon (fanservice), and some comedy, then you should definitely take a look at Chrome Shelled Regios or atleast just try a few episodes. This show offers a nice balance of  action/seriousness to comedy/fanservice, so many viewers might like this particular anime.\\n",
            "date": "2009-08-11T19:33:00+00:00",
            "helpful_count": 98,
            "mal_id": 17683,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sharnid",
                "username": "Sharnid"
            },
            "url": "https://myanimelist.net/reviews.php?id=17683"
        },
        {
            "content": "Chrome Shelled Regios is one of those animes that I watched without real interest. The art is good, animation is fluid, this point is ok.\r\nThe main thing I disliked about it, was that it was too centered around the main character. Layfon is strong, Layfon appears when others are in danger, Layfon beats everyone. Close to every women character are blushing when seeing him, even if there is no romance. Even the cold one ends up being all over the hero. The other characters feel like they were added just to have some kind of background but there's no real work on them.\r\nDuring 24 episodesthe story isn't fantastic, nothing that surprises us suddenly, well they played the safe card. In the end, many questions are unanswered. It seems that no second season will be released so they will stay as it is. Sad because a lot of ideas were present. For example, all those Heaven's Blade Wielders, we get to see them in the two or three last episodes, some of them for just a sec, disapointing. \\n\\n\r\nTo sum up, the anime is classic, I didn't really enjoy it but still, it was watchable enough so I went till the end to see if it gets better. Don't expect incredible storyline, just a common anime in the overall sea of animes.",
            "date": "2013-08-08T04:31:00+00:00",
            "helpful_count": 86,
            "mal_id": 108785,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1568683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nadium",
                "username": "Nadium"
            },
            "url": "https://myanimelist.net/reviews.php?id=108785"
        },
        {
            "content": "**As of Episode 11** \r\nRegios is a show i really didn't pay any attention to until finally 2 weeks ago, and i'm glad i gave it a chance. The anime producer, ZECXS, hasn't done some good animes (Last one being Rental Magica), but i think this one can really blossom into something good.\r\nStory - 7.9/10 (C+)\r\nFilth monsters? lol. But seriously, it's not as boring as it sounds. How about \"cleaning\" these filthy monsters with magical swords and wizardly staffs? Now that's more interesting. The story centers on Layfon (Or as Felli calls him Fon-Fon), a young kid who has hidden potential while looking like justthe opposite. Klutzy and Humorous, Layfon manages to join the 17th Squad (16th?) under Nina Antalk, a spirited and focused young girl who works her hardest to achieve success. The plot so far is okay, but i'm docking points for coining the term \"Filth\" monsters and a really lackluster beginning.\\n\\n\r\nAnimation - 7.6/10 (C)\\n\r\nThe animation is mostly bland and standard, except when it comes to flashbacks and fight scenes and fanservice scenes. Can anyone say, Felli Meido?\\n\\n\r\nSound/Music - 10/10 (A+)\\n\r\nI got hooked on the OP song, Brave Your Truth (lol engrish) just from hearing 5 seconds of it. That never happens for me. The same applies to the ending as well, \"Yasashii Uso\". Both fit PERFECTLY for Regios, One starting the show with a techno rock beat, and ending it with a gentle, soothing slow ballad. Each episode has a different ending version, and i'm most fond of Felli's version and Nina's version the most. The voice actors, while not ultra popular (See: Aya Hirano, Mamoru Miyano), have as much talent (even more, in some cases) as the populars. Episode 4 and Episode 5 treated us to some english, i dunno what's up with those 3 people in that car, but the english is so lol.\\n\\n\r\nCharacters - 9/10 (A)\\n\r\nLayfon is NOT the typical idiotic shounen lead character. He's likable from the very beginning, along with Nina and Felli. The rest of the cast i don't really pay attention to, but don't worry it's all good. Layfon's past is now catching up to him, and each episode he goes from \"Typical Anime Shounen lead\" to \"Really Interesting and Evil\"\\n\\n\r\nEnjoyment - 10/10 (A+)\\n\r\nWatch Kokaku no Regios! Really, it's got a bit of everything: Fanservice, Ugly monsters, RPG-ish characters and excellent theme songs. What else would you want?\\n\\n\r\nOverall - 9/10\\n\r\n-------------------------\\n\r\n~~The Good: OP/ED, Characters (Except the Engrish People (See episodes 3-5), Shante), Excellent BGM\\n\r\n~~The Bad: A bit fast at first, slightly annoying fanservice\\n\\n\r\n~~Strong Points: BGM and OP/ED, Characters\\n\r\n~~Weak Points: Animation",
            "date": "2009-03-02T23:48:00+00:00",
            "helpful_count": 44,
            "mal_id": 12886,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=12886"
        },
        {
            "content": "Edit: Now that I've finally figured out how to edit reviews, let me go ahead and revamp my take on Regios even if it has been a while.\r\nStory 7: The story is a pretty common one in parts I think. Boy has extraordinary power, boy doesn't want to use that power, boys tries to run away from that power, and then discovers that with great power comes great responsibility so he has to suck it up and use it. Not that it's a bad story, it's just a pretty common one.\r\nArt 7: I can't find any major flaws with the artwork. The background and charactersall look good and the battle scenes flow nicely. It's not my favorite style of artwork, but it was well done for the style they used.\\n\\n\r\nSound 9: I quite like the tracks for this series so far. The background tracks all portray the mood of the scene accurately and the OP and ED are enjoyable. The OP is probably my favorite this season that I've heard yet.  The ED certainly grew on me and I appreciated how the different characters each had a version. It really gave some more character to the show..\\n\\n\r\nCharacter 7: I really enjoyed the characters in this series. While they didn't really seem to change or grow I was rather attached to them regardless. I never could bring myself to like Felli very much sadly, despite her comic and moe appeal. Nina was a lost cause, but the fact that she continued to try impressed me personally and all the other characters were interesting in their own ways.\\n\\n\r\nEnjoyment 8: It's a fun watch. Good action, good characters, and what's a fairly enjoyable premise even if it's a little confusing at times.\\n\\n\r\nOverall 7: If you're looking for a new action series to watch I'd entirely recommend this show. Granted I typically don't watch Shounen that much but doesn't that say something about the flexibility of this show if it's able to convert a Shoujo fan like myself? Go into this with an open mind and you might find yourself surprised by the outcome.",
            "date": "2009-01-20T22:18:00+00:00",
            "helpful_count": 25,
            "mal_id": 11733,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126885.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Illuminary",
                "username": "Illuminary"
            },
            "url": "https://myanimelist.net/reviews.php?id=11733"
        },
        {
            "content": "Overall ~ 7\r\nThis show could have been really good , but suffered from severe pacing problems and one dimensional characters. The overall action in the show wasn't very good because Layfon never showed his true abilities so you never felt that feeling of excitement in a battle. The comedy was pretty good and mostly revolved around Feli kicking Layfon. I wish they had straightened out the pacing problems and made the filth monsters or people stronger so Layfon would show what he could really do. \r\nStory ~ 6\r\nThe story for Chrome Shelled Regios is nothing out of the ordinary. People live in traveling domes andfight filth monsters, you have a summary. There are some major problems with how everything unfolds in the pacing department. (No spoilers don't worry). The beginning of the story was done pretty well and the middle is fun to watch, but in the end it's disapointment after disapointment. They get you excited about something that is about to happen for a couple of episodes, then something happens causing the exciting event to suck or not even happen. Then in the ending arc, Chrome Shelled Regios suffers from major pacing problems.\\n\\n\r\nThe last arc was handled awfully. They speed through important information and then take forever to accomplish something. The last episode should have be done in two or three episodes, but is crammed into one leaving a lot of \"What? How/ why did that happen moments.\" and a dissatisfying episode. And a lot of information just isn;t relevent to the plot at all. But maybe a second season will fix that.  \\n\\n\r\nThere were some positives though. The inter platoon matches were fun to watch and Feli kicking Layfon was funny. \\n\\n\r\nArt ~ 7\\n\\n\r\nThe scenery was done pretty good and the CG'ing wasn't bad (not great, but average). The overall art gets better as the series goes on especially the filth monsters. This is just my preference, but I didn't like the character designs. Mostly how they put solid lines for the edge of shadows on the characters faces and I didn't really like the type of eyes they used. Just my opinion though, you might like it. \\n\\n\r\nSound ~ 8\\n\\n\r\nThe openings and endings were good and the background music was very good. All the characters' voices matched too, no complaints there. I didn't give this a 9 or a 10 because it lacked something that made me go \"wow\". \\n\\n\r\nCharacters ~ 6\\n\\n\r\nThe characters in Chrome Shelled Regios were ok. At the end of the series, I looked back on how the characters changed, and I realized........ that they didn't. Layfon still won't show his true abilities and tries to protect everyone on his own, Nina was still trying to stop depending on Layfon, but can't and Feli still likes Layfon, but kicks him after everything.\\n\\n\r\nI thought the characters were one dimensional and predictable. And they didn't develop at all throughout the series. But, Feli kicking Layfon and Layfon protecting everyone does keep you interested for the whole series. \\n\\n\r\nRecommended?\\n\\n\r\nI would recommend you give this show a try to see if you like it, and if you have any doughts, don't expect it to get any better. I mostly pointed out the negitive parts of the series  but don't worry, there was some good stuff to keep you watching.",
            "date": "2009-06-21T22:00:00+00:00",
            "helpful_count": 20,
            "mal_id": 15975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133289.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meh_93",
                "username": "Meh_93"
            },
            "url": "https://myanimelist.net/reviews.php?id=15975"
        },
        {
            "content": "*Important before reading*\r\n- This review is completely subjective.\r\n- No summary is included in this review.\r\n- Don't worry about spoilers.\r\n- Feel free to leave a feedback/thank note on profile!\r\nEver since i saw the first couple of episodes i was expecting quite a lot out of this show. It seemed like it had everything it needed to become a top-notch show. Interesting alternate universe, diversity in characters, spectacular action, romance and comedy. However, when i had completed the show and looked back at these expectations it was kind of dissapointing. \r\nFirst of all the universe. what could have become an epic battlefield became a rather weak setting.history and other facts come rushing at you, but never really worked out. More than once you'll find yourself wondering 'what the f*** just happened' after witnessing some of the events.\\n\r\nThen the characters, for me the greatest dissapointment of all. They all seem quite the interesting bunch in the beginning but the problem is that at the end of the series, they're just the same. Of course there were some changes in relationship betweens the characters but none of them actually grew. Character development should always be worked out in depth and this is certainly not the case in CSR.\\n\r\nThe action is indeed spectacular but it remains the same during the entire show. There aren't any new aspects of combat that show up. The first fight and the last fight in the show are practically the same though the main character has been through a lot.\\n\r\nThe same with the romance aspect. Again some great potential to create an epic love story but instead an epic fail. Some red cheeks and home made bento's for lunch is as far they go.(figure of speech)\\n\r\nThe comedy then finally, was good. This was the only aspect that didn't dissapoint me. Don't misunderstand, the comic scenes are kept at a minimum here but that's what i'd expect from an action based show. The scenes have good timing and are really charming and funny.\\n\\n\r\nThe Artwork and ost are quite good but rather basic, nothing exceptional or unique about it,no special contribution to the show\\n\\n\r\nConclusion: This show had some amazing potential but leaves you behind with an empty feeling after finishing the last episode. Normally with this kind of ending i would be longing to a sequel, but in this case it's just a feeling of dissatisfaction. To finish i just want to say that this review is a bit too negative, but i can't help it. Guess it's because of the high expectations i had. I still recommend the show since it can be really enjoyable at times but just don't have your hopes up.",
            "date": "2009-07-13T13:32:00+00:00",
            "helpful_count": 18,
            "mal_id": 16733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/204211.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheAceOfPortgaz",
                "username": "TheAceOfPortgaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=16733"
        },
        {
            "content": "Story:   Chromed Shelled Regios is basically an anime version of the movie Stormship Troopers. That is, if Stormship Troopers was done as a bad visual novel complete with giant bug(?) things. The story is predictable with no plot that feels worth continuing to watch the show for. They rely heavily on flashes of an unclear past (or future?) action scene as well as sudden \"plot twists\" to hold your interest. It didn't work.\r\nArt and Sound:   Both the art and sound are reminiscent of a visual novel to the point where all the characters pose, still screen style, as they talk. Meanwhile,annoying and obviously synthesized music sets the mood. I'm sure they meant for the sound to mesh with the anime, but instead it was 22 minutes of fail that only managed to bring down an already mediocre show. The art itself was like a cross between a high budget yaoi (see Gakuen Heaven) and any low to mid budget fighter anime (see History's Strongest Disciple Kenichi). Not a pleasant combination, but very shiny.\\n\\n\r\nCharacter:   Same thing as with the story. All the characters had been done, and been done better, in something else that was more worth while. They had the archetypes down though, even right up to the related back story characters. By the end of the first episode you already know the &quot;plot twists&quot; for two of the main characters back stories, including the main main character. And here I always thought that a mysterious main character was supposed to be a selling point.\\n\\n\r\nEnjoyment:   Yeah... In case you haven't guessed by now, I really wasn't enjoying this show. I forced myself through it in the hope that it would improve, but it didn't. Frankly, I was bored all the way through. Nothing in that anime made my wasted time worth it.\\n\\n\r\nOverall:   All in all it was a bad show. It was bad enough that I felt I had to write a review to warn others. The story and characters were overly predictable archetypes, the art was mediocre at best, and the dreadful sound dragged the level of the anime (and my enjoyment) even lower. My advise is to not watch it.",
            "date": "2009-01-12T21:06:00+00:00",
            "helpful_count": 17,
            "mal_id": 11410,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78068.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AngelND",
                "username": "AngelND"
            },
            "url": "https://myanimelist.net/reviews.php?id=11410"
        },
        {
            "content": "Update: I've seen 6/24 of this anime so I'm doing a major editing on this review.\r\nStory (8): \r\n   A world where animals have been exposed to extreme pollution causing them to  mutate into monsters(A.K.A Filth Monsters). They now roam the planet indiscriminately killing everything in sight for food. Humans have been forced to adapt by  living in mobile cities called \"Regios.\" Though the Regios provides an environment capable of sustaining human life, they are prime targets for \"Filth Monsters\" because of the large food density... this food can also be called the human population.\r\nArt (7): \r\n   I know littleabout animation studios or specifics about each individual series' production but Koukaku no Regios so far has shown me the most cliche of animations. Skirts are absurdly short, no panty shots so far (sorry guys). Facial expressions are depicted well but the general design of each character is extremely similar i.e. same head shape or same eye shape or same body shape. (7)\\n\\n\r\nSound (6): \\n\r\n   The opening has a nice song but the animation is rather...dull (6). The ending also has a nice song but as in all endings, animation just has to give off a sense of finality which this one accomplishes. (8)\\n\r\n   This series has one of my pet peeves...BAD ACTION MUSIC! The music played during an action scene is some stupid ramped DOWN techno sequence...but other than that everything is average not above average (5)\\n\\n\r\nCharacter (6): \\n\r\n   Layfon Alseif (spelling disputed) is the main character. He is from a Regios named Grenden and is a former member of the &quot;Heavenly Blades&quot; (basically the Royal Guard). Layfon wants to begin a different lifestyle though and moves to the Regios, Czerni to study. Things don't go as expected. (8)\\n\r\n   Nina Antalk, co-protagonist, definitely has some depth to her which is shown in Episode 3. She is also from a different Regios and came from a rich family, but due to an event, she decides to join the Military Department which is frowned upon by her family who essentially disowned her. She strives constantly to be the best she can be and is deeply jealous of Layfon who overshadows her completely in terms of battle skill.(8)\\n\r\n   Other characters are barely worth mentioning. Their bonds are not described very well, friends can become friends through some of the stupidest methods that aren't even shown. Many are very dipsy doozy and aren't described very well. (5)\\n\\n\r\nEnjoyment (7): Overall, if you're looking for an anime targeting the main stream. You'll like this one alot but other than great suspense and so many interweaving complications that it brings the audience into confusion or delight.\\n\\n\r\nOverall (7): Give it a try, it seems decent enough so far but that might change radically as this is just the beginning of the anime",
            "date": "2009-01-21T21:45:00+00:00",
            "helpful_count": 14,
            "mal_id": 11751,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/76973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChinesePanda",
                "username": "ChinesePanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=11751"
        },
        {
            "content": "It was inevitable for me to get a little excited to start this series. The hostile post-apocalyptic scenario, the presentation of the premise, its aesthetics and the mystery surrounding it generated expectations just during the first 10 minutes of episode one, expectations that wouldn't be (by far) reached by Chrome Shelled Regios during the rest of the show, as the development of the real plot was quickly replaced for non-contributory, mostly-boring side stories with a coarse harem inbetween.\r\nThe turn-off caused by that was comparable to that of our simpleton Layfon who is more accompanied by an insipid crew of females than by revelations about theworld he lives in and serious battles, thanks to him being disproportionately powerful because of the simple fact he's the main character. So you better don't only forget about watching plot progress, but also about watching the protagonists (or anyone else) growing nor making something destacable with the advancement of the chapters. At least the artwork is proper.\\n\\n\r\nThe bases of the series are very contundent and the first episodes are really compelling, but the immature and meaningless way in which the rest of the story is dealt makes you think 'meh, this is just one more anime', and even among the average there're better things to watch. 4/10.",
            "date": "2015-05-28T20:11:00+00:00",
            "helpful_count": 12,
            "mal_id": 189059,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4500180.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Doltra",
                "username": "Doltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=189059"
        },
        {
            "content": "Why is it that those who seek power will go any length to become strong, and why is it that those who have power never want to use it?\r\nThis is an anime I would love to compliment on how it started, instead of just using those boring character introductions and beginnings that take forever to start right from episode 1 and 2 it just jumped in the show, which I absolutely loved. As you can see, this is a very fast paced anime that doesn’t waste time.\r\nThis is a post apocalyptic anime (in short the end of the world type of anime) and for themost part follows the 17th platoon on the journey they embark. \\n\\n\r\nTo be frank, the characters in this anime are very very unoriginal. It is almost like what you see in most anime, you have Mr. Hero, you have a bunch of girls who tend to fall in love with Mr. Hero saving them and then you always have that one character who is tsundere. I am not saying this is a bad thing, but for this type of anime, which is following the journey these characters go on, character development and unique characters is something that helps tremendously. There is really only one character, obviously the main main character “Layfon Wolfstein Alseif”, who you cant really make original. Aside from him, I personally would have changed the characters to be a bit more unique. \\n\\n\r\nAs to this show, it does have some very fun and energetic fighting scenes, and as usual has tons and tons of scenes of Mr. Hero saving someone and then the person he saves falls in love with him. What I personally enjoyed about this show though is the use of “power” in it. This is a very straightforward show puts people on 2 different levels, are they strong or are they weak. Due to this split, which is good in some ways could also be very hurtful. When there is such a black and white anime like this it tends to lack character development because the weak are never able to be on par with the strong, thus the split is harmful. What is good about doing this, is it makes other characters strive to reach up to those levels by any means possible and this is a way to bring some development into the characters. If you do not understand what I am saying, to summarize, this show lacked character development, but it was not a total and utter fail because of the use of “power”.\\n\\n\r\nAlways the easiest and hardest question to answer, did you enjoy this anime. Due to the fact that I just watched Densetsu no Yuusha no Densetsu (The legend of the legendary hero) which is practically identical to this, and this was the type of show I was in the mood for I did enjoy it. By far my favorite parts were the fighting scenes and also the character Layfon. Layfon was what made this show interesting because of his nature of being unique and people being an outcast, trying to fit in with society. Just as a little side note, throughout this anime you will see clips of a story that is all in English, this is the most confusing part of the anime so don’t be turned off by this. What I personally want to do is look more into what the meaning of that side story is because I found it very complicated and it did leave some questions unanswered for me. Aside from that, that side story was one of the most unique things I have seen in an anime, even if I didn’t understand it completely, I found that it was able to bring some more life to this anime.\\n\\n\r\nJust to quickly touch on the songs (and art) the only one that I want to talk about is the ending song (like the end end song). This song as usual was very powerful, due to the fact I was expecting a song like this because of how related it is to some other animes, I still find it pleasing that animes are able to bring the type of sadness emotion to you that the anime is at the end. This is something that I love because it always brings like warmth to my heart, but I also despise because I feel like this type of anime could continue on but never will. For the art section, there really isn’t anything for me to write, it was just your typical art nothing out of the ordinary and nothing that stood out as being bad, I have no reason to praise or citizen this.\\n\\n\r\nWhy do you seek to become strong and gain power? Is it for your own personal use, or do you wish to help people in this world?\\n\\n\r\nThat concludes my review.  If you have any questions or comments please just send me a pm or write on my wall, I will try my best to answer to the best of my power! I will accept any type of feedback on to how to better improve my reviews, but please be constructive as well! Please also check my other reviews. Also if you want me to do a review on a certain show (whether I watched it yet or not) I will try to prioritize. Also check out my blog post (http://myanimelist.net/blog.php?eid=723679), to help me with future reviews!\\n\\n\\n",
            "date": "2013-02-11T23:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 86597,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1183467.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/toyhammered",
                "username": "toyhammered"
            },
            "url": "https://myanimelist.net/reviews.php?id=86597"
        },
        {
            "content": "Chrome Shelled Regios? Sounds like a poorly translated menu item at the local Chinese seafood takeout. Yeah, I get it. Chrome shells. In the future we live in dome cities. Like Ergo Proxy, Wolf's Rain, and a billion other anime.\r\nBut there's a twist (isn't there always). Resources are limited, there are monsters everywhere (Filth Monsters, apparently), and the soft-shelled cities engage in battles with each other for rights to mine Selenium which keeps them going. Which almost makes sense except that they are powered by Fairies or something like that and the competitions are held by essentially schoolkids fighting each other with these things called\"Dites\" which are referenced in the OP along the lines of \"so we may go somewhere weeeeth the Dite.\" \\n\\n\r\nIf I'm losing you the summary of what it's about:\\n\\n\r\nThere's a city called Grendan. It has really badass Dite wielders. So badass, they're almost Gods. The rest of the cities don't (not sure why). One of these guys, Leifon, gets exiled and becomes a schoolboy in Zuellni because he wants to run away from his past and that's where the premise starts. A really badass guy pretending to be a student because he has a dark past.\\n\\n\r\nSo you have to throw in the usual cliched characters, overeager Tomboyish squad leader who takes him in, loli sister of pervy student council leader, the playboy sniper,  three random girls (like you've always seen).\\n\\n\r\nWhat saves this anime, is that it seems to actually focus on a backstory of Leifon, his interactions with those in Zuellni, his rather fatalistic views on life, without cocking up most of it. You watch it with the hope it's going somewhere and there actually seems to be stuff going on (i.e. the fairies, the filth monsters, Lefon's betrayal).\\n\\n\r\nIt's average, but at least it's trying.\\n\\n\r\nOf course it also hasn't really gone anywhere and it keeps introducing characters the show seems compelled that i MUST know, but there is little exposition to explain why...",
            "date": "2009-04-15T07:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 14180,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14180"
        },
        {
            "content": "With an intriguing plot, a great cast of characters easy to love,a main character with the coolest hair style imaginable, a harem with an action packed plot with a touch of funny, Chrome Shelled Regios was able to deliver a great watch and a wanting for more. I highly recommend this one to any fan that enjoys there action driven animes, without compromising other key components. what are you wanting for, go watch it!  \r\nPS, the girl that i always want the main character to end with always losses...",
            "date": "2010-01-28T16:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 22763,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288192.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeXDieNastYx",
                "username": "AnimeXDieNastYx"
            },
            "url": "https://myanimelist.net/reviews.php?id=22763"
        },
        {
            "content": "i would say this anime is somewhat like \"Blue Gender\"(an old anime)\r\nchrome shelled regios is set in a post-apocalyptic world, where people live in giant dome cities that are powered by \"electric fairies\" because the world became too poluted to live in and there are giant man-eating creatures[filth monsters/limbeekoon] outside of the domes. the cities are classified differently depending on their military power: academy, lance shelled[one of the most powerfull in the world]...and so forth...\r\nits abt a guy that gave up his past of fighting in the military[one of the strongest] but it caught up with him.his name is layfon azelfe and he probably isthe most powerful character and has alot of girls falling for him....\\n\\n\r\nto me the characters are great and funny\\n\\n\r\nwell thats all im gonna say...u watch it and see for yourself\\n\\n\r\nmy fav...i wanna c more....i hope i get to c more",
            "date": "2009-07-19T17:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 16957,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/konvic_14",
                "username": "konvic_14"
            },
            "url": "https://myanimelist.net/reviews.php?id=16957"
        },
        {
            "content": "Okay My first Impression on this anime Chrome Shelled Regios. Was accidental yet a good accident why you may ask? I started wacthing this anime on episode 13. Alreday hooked to the story though,really,really entertaining. Other than the fact that Netflix had me going wrong parts.\r\nDON'T GET CONFUSED AS SUCH NAMES AS \"the Fallen ones\" it's just a better way of saying the spirit of the city has gone mad.Don't let it get to your head.\r\nAlso I love this anime because it made me think and kind of put the subject in my shoes What would I have done?\r\nGlad I saw episode 13 thoughor else I would of not understood episode 1.Which episode 1 I really love it wasn't confusing to me, than what other people said about the first episode\"really confusing\" not to me that is.\\n\\n\r\nAnyways the Story 9/10 \\n\r\nMany reasons why,after seeing that ending you just ask for more and more.\\n\r\n2. I want to see what happens next,I mean the story Is perfect why did it had to end like that?\\n\\n\r\nArt 10/10\\n\r\nReally well done charactersthat show emotion,BLINK for once (yay).\\n\r\nThe art never got old just to tell you.\\n\\n\r\nSound 10/10\\n\r\nGreat sound effects on the explotions,battle scences and bullets.\\n\r\nThe music was great I mostly loved the ending songs though.\\n\\n\r\nCharacters 10/10 \\n\r\nThe characters many you can relate to like Layfon,what will you do to survive?Many characters are loveable here.I should mention the dubbed verion to CSR is really good like Todd Haberkorn is awesome as layfon really fits his voice and actionsto this anime.Then there's Monica Rial who plays Felli really great voice acting too well met for her role in CSR.\\n\\n\r\nEnjoyment 10/10\\n\r\nMany reasons why I enjoye ChromeShelled Regios is the battles ,the fight scenes. Why? because in this anime they actually showed fight moves not like other anime that talk for half the time and then fight. CSR really aced the enjoyment meter for me ,there was always a fight or a brawl or a mini cat fight.\\n\\n\r\nDislikes : They showed the 12 Heaven Blades in action all late about it.\\n\\n\r\nMy overall score is a 10 for the non-stop battles and good music,voice actors (dub),the art the enjoyment doesn't fail so I highly recommend Chrome Shelled Regios to your list.",
            "date": "2011-08-17T09:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 41657,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RosyXkid",
                "username": "RosyXkid"
            },
            "url": "https://myanimelist.net/reviews.php?id=41657"
        },
        {
            "content": "Okay so this will be my first formal review for an anime in this website and it is because of how disappointed I am after watching it.\r\nStory 4/10\r\n- I thought that the plot was pretty interesting as it was set in a post apocalyptic world with monsters known as contaminoids and that the you protect your moving fortress, battle with other fortresses for resources and also platoons competing against each other within the fortresses but then it starts get confusing for me, especially those scenes with really really bad English voiced scenes that was shown as a TV show in some scenes but in otherepisodes just appeared as if it was related but all the way till the end it had no relation at all except the fact the the female character \"Saya\" has the same name and character design of a girl name Saya which you will find out as you watch the anime, overall I was pretty confused with this anime, frustrated with too many unsolved mysteries and such.\\n\\n\r\nArt 6/10\\n\r\n- I know this anime is from 2009 but I believe there are some other animes during 2009 that looks much better, but the art here isn't all that bad in my opinion. I only felt that the fighting scenes, weapons, armor and some characters did not look good at all but Felli is definitely my favorite.\\n\\n\r\nSound 7/10\\n\r\n-Since I don't totally understand Japanese, the songs to me weren't so additive in this one but since I do also listen to J music, there are some OSTs that I like here specially the ones with out anyone singing and I disliked the Engrish used in some music as it sounded really bad.\\n\\n\r\nCharacter 6/19\\n\r\n-The characters weren't great but not so bad either, like I said my favorite was Felli, I actually enjoyed the comedy scenes and found the Chibi scenes cute, the president has a usual design of a long haired glasses type of guy and the anime did show a good amount of development with each other and I also did get to know their backgrounds and even some side characters such as the trio police, reporter and cook but I think there is too much of Layfon in almost everything, I like how he is the bad ass op character but It didn't give me that feeling at all and sometimes his problems confuses me and gets me frustrated, not enough of the heavens blades as well! They only showed some of them for a sec in only few episodes.\\n\\n\r\nEnjoyment 4/10\\n\r\n- The anime confused me in the beginning, I almost stopped but after watching a bit more I thought it could be interesting and would get better as I continued, through out the anime I was cussing here and there out of frustration become of some scenes and also because I don't know why there is that English TV show and the really bad English, why does it have to be English?! but it was still watchable at least.\\n\\n\r\nOverall 5/10\\n\\n\r\n- I don't know but to me the anime wasn't satisfying at all, I thought it seemed pretty mediocre and am pretty disappointed with this show, I surfed the net and read different reviews and discussions and many people thought that this show is really mediocre and I agree but for the good side the comedy scenes were pretty funny and Felli should have been the most op character as she can just kick anyone and break their bones.\\n\\n\\n",
            "date": "2016-01-14T12:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 208513,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/896377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DreiiKun",
                "username": "DreiiKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=208513"
        },
        {
            "content": "I'm really torn when writing this review. I feel like this anime could be absolutely amazing, because it is, and yet it isn't. For starters it needs to have about 50 more episodes. I feel like the creators intended a very long series and had to wrap everything up very quickly.\r\nStory 6/10\r\nThe story is pretty interesting and has a lot of potential, however there were just too many plot lines brought up and left hanging. There are concepts that are simply short-lived and there are incidents that happen on the basis that it will be explained later...but they never get around to it. The wholeidea of this badass kid trying to fit in like a normal person and not being able to because he's so badass is just great. But there are about fifty other things going on that tend to take away from the \"main plot\". Like I said before, if the series had more episodes and could be spread out a little more, than I don't think this would be a problem. The setting of a dying world with moving cities run by electronic fairies is pretty neat, but there again is a whole story (especially the Haikizoku) that is never really clearly explained or resolved. You've also got the 11/12 Heaven's Blade receivers that are never really introduced, the whole story going on with the queen and Leerin, the whole story with Leerin and Layfon, the inter-platoon relations, Layfon's past, Nina's past, Layfon's many relationships with many young women, Nina and Dick and Saya, the Psyharden, oh and the ongoing search for Selenium which again is kind of a fuzzy topic. Plus, you never really get an explanation for the black and white, semi-TV show/might be another world story with absolutely awful English that interrupts the show every episode.\\n\\n\\n\\n\r\nAnimation 8/10\\n\\n\r\nThe animation is pretty sweet. The fight scenes with kei and dites are really fun to watch and I really enjoyed the animation for using kei by itself to increase speed, throw up a shield etc... There were a few scenes with simple face panning and then simply sword to sword meeting that dropped the rating of this category overall, but I did really enjoy most of the fight scenes.\\n\\n\\n\\n\r\nSound 7/10\\n\\n\r\nI don't usually pay much attention to sound quality and such, it's only when a track annoys me that I tend to rate this category differently.\\n\\n\\n\\n\r\nCharacters 9/10\\n\\n\r\nI rated this category pretty high but for a just reason, most of the characters are just great. Layfon alone could run the show for me. He's goofy and awkward and turns into a ridiculous fighting machine. However, you never can really gauge the power level of Filth Monsters from Layfon. One minute he's cutting through hundreds of them and the other minute he's taking days to defeat one. I realize there are different stages and such, but I also feel like maybe that classification got thrown out towards the end when they are trying to wrap everything up. But that aside, Layfon was a pretty legit main character and it made me sad to see how awesome he could be (in the last episode) and know that I wouldn't get to see anymore. Nina was kind of a downer to me, but she never really annoyed me or anything. Her fighting style is pretty cool and her whole story with the fairies and such could have been a neat side plot. Felli was another favorite. Her powers and attitude towards Layfon made her a very likeable character. The other platoon members and students were also, for the most part, pretty interesting. You only get a few episodes with the big guns from Grendan, which was upsetting because some of them looked pretty friggin sweet.\\n\\n\\n\\n\r\nOverall 8/10\\n\\n\r\nA little above average is the perfect way to describe the series as a whole unfortunately. Like I said before, so much potential! Don't get me wrong, it's definitely worth watching but just don't expect any closure of any form. I'm hoping that the series will get picked back up again someday and someone can help it reclaim its full potential.\\n\\n\r\nAnother time, another review... :)\\n",
            "date": "2014-08-01T03:37:00+00:00",
            "helpful_count": 8,
            "mal_id": 154695,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=154695"
        },
        {
            "content": "Here is how the situation went...\r\nFriend: you like God eater right?\r\nMe: Yeah, the anime alone got me to buy it on PS4.\r\nFriend: The you'll really like this, they're really similar.\r\nOh my, why must others lie.  So I watched till four episodes in and dropped this series, but why so unfair you may be thinking?  See I have a three episode rule where I'll give anything three episodes to win me over, but this show.  First I'll say the art style is great, very clear cut and the show has decent sound I'll give it that.  But the story and characters arejust so boring.  This show just couldn't hold my interest and I'm one of those people who'll stay up till stupid o'clock watch any old trash on youtube.  \\n\\n\r\nEnd of the day  if you like anime with cool looking fights then go for it but I would expect much character wise from this one.",
            "date": "2018-02-22T17:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 272210,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4712842.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JasonRed",
                "username": "JasonRed"
            },
            "url": "https://myanimelist.net/reviews.php?id=272210"
        },
        {
            "content": "Alright so I am just gonna keep this short, sweet, and to the point\r\nStory: 6/10\r\n- the storyline had potential, but in the end, there were too many unanswered questions. In addition to that, it is quite easy to get confused at times because some things were not well explained.\r\nArt: 6/10\r\n- this anime was aired in 2009, you can't really expect it to have amazing animation. I say it was sub-par. \r\nSound: 7/10\r\n- sound was alright, average at best. I really did enjoy the theme song though. \r\nCharacter: 7/10\r\n- I found that the anime did present some characters that you could really feel for and connectwith. However, the anime introduced too many characters that were irrelevant to the story. \\n\\n\r\nEnjoyment: 7/10\\n\r\n- even with a lot of evident flaws, i still enjoyed it. Unlike some anime, i become disinterested pretty easy, but that was not the case with this anime. It got me hooked enough to finish it.\\n\\n\r\nOverall: 7/10\\n\r\n- good anime with average story line and characters. I would recommend giving this anime a shot.\\n",
            "date": "2017-01-19T21:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 238662,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778465.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/phuynh1997",
                "username": "phuynh1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=238662"
        },
        {
            "content": "Set in a future where the air is toxic (or modern day china), where giant bugs known as contaminoids roam, cities walk the desert.\r\nThese cities are known as regios.\r\nOur hero came to a new city for a fresh start after being banished from his old city.\r\nWhile looking for an ordinary life he is quickly swept up into a military academy.\r\nThis anime may come off as a bit harem. However, this is justifiable as the main character actually has skills (few other harem characters do). His skill is that he could outswordfight Ichigo from bleach- he is that good.\r\nThe only problem is that it was abit short. The last episode was kind of a letdown for the sole reason it felt like they could have spread it into 6 more episodes. The final ten minutes felt crushed together with no breathing room.\\n\\n\r\nSomething really cool about this anime is a few scenes that appear to have nothing to do with the plot. The screen is tinged and it plays out like a hard-boiled action flick but there is a twist to these scenes and what they actually have to do with the story.\\n\\n\r\nI gave this an 8 because it was thoroughly enjoyable, especially the fight scenes which normally in anime I hate because they sound like dirty movies.\\n\\n",
            "date": "2013-03-28T13:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 91307,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2356071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kissen49",
                "username": "Kissen49"
            },
            "url": "https://myanimelist.net/reviews.php?id=91307"
        }
    ],
    [
        {
            "content": "Post apocalyptic worlds in anime are a bit of a strange area to visit as you're never quite sure what you'll find. It could be a world of amnesiacs, a princess who loves to fly, a lone warrior searching for his lost love, an outcast hunting his own kind, a boy from another world trying to stop a warmongering dictator, or something else entirely. \r\nImagine my surprise then, to find a high school.\r\nThat's right. Here at the end of the world the best that some bright spark could come up with was another high school. That said, Koukaku no Regios (Chrome Shelled Regios), does usethe setting rather well, and approaches the whole concept in a manner that is somewhat entertaining.\\n\\n\r\nOriginally, Chrome Shelled Regios began life as a series of light novels by Amagi Shusuke, with a manga adaptation by Miyu available around the same time. A second manga adaptation followed, this time by Kiyose Nodoka, then a third (by Watari), and finally a fourth, which is, unusually, a 4-koma version by Futaba Masumi. \\n\\n\r\nOh, and there's a prequel light novel series called Legend of Regios as well. \\n\\n\r\nThe story begins in the academy city of Zuellni, a domed mobile \"fortress\" that roams the post apocalyptic world, where Layfon Wolfstein Alsief is hoping to forget his turbulent past and begin a new life. Unfortunately, he quickly catches the attention of Karian Loss, the student council president, and Nina Antalk, the leader of the 17th Military Arts Platoon.  \\n\\n\r\nAt first glance Chrome Shelled Regios seems like a pretty standard fantasy styled anime, and truth be told, this is a pretty accurate impression. The plot is fairly straight forward, with little in the way of true complexity. Unfortunately, the manner in which the story is delivered has all the hallmarks of an action melodrama, and while there are some comedic elements thrown into the mix in an effort to balance things out, the overall effect is rather lopsided. \\n\\n\r\nProbably the biggest example of this is the main character's \"turbulent past\" and the reasons why he is attending Zuellni. There is a clear attempt to obtain sympathy from the audience, however the plot seems overly contrived, and rather than ensuring that this aspect of the story is part of the greater tale, it instead stands out as one of several occasions where the show has tried to elicit a reaction from the viewer.\\n\\n\r\nThe main problem with this is that the writers have adopted an approach that is more like a traditional fantasy, something which would normally be fine given that this is ultimately a light novel adaptation. It's unfortunate then, that the transposition from paper to screen doesn't quite work, however this may be because the writers literally had multiple versions of the story, so instead of creating their own version, they simply decided to pick the best bits from all the other versions and string them together.\\n\\n\r\nThe end result is a story that has its plus points, but doesn't really know what to do with them.\\n\\n\r\nWhile the story may be a bit haphazard at times, the art and animation are of a good standard throughout the series. The characters are pretty standard fare in terms of design, but they are well animated and possess their own unique features. The backgrounds are a strange mixture of the familiar and the unusual, mainly because of the incongruousness of a post apocalyptic high school. That said, the level of detail is pretty good throughout, and while there are some genuinely absurd moments, they don't reall affect the overall look of the show.\\n\\n\r\nAs far as the music goes, the show uses a variety of pieces over the course of the series, but while the choregrpahy is often good, the music sometimes doesn't mesh with the on screen action. The OP is a typical \"beats per minute\" dance track called Brave Your Truth by Daisy x Daisy. Like many other shows, Chrome Shelled Regios has two EDs, Yasashii Uso and Ai no Zuellni, both of which are by Chrome Shelled. Both are bittersweet ballads that, unfortunately, don't work all the time given the context of the episode itself.\\n\\n\r\nOn the other hand, the acting is actually pretty decent. The seiyuu are talented and play their roles fairly well, although there are some occasions where the character can seem unnaturally emotional, something which is partly due to the script itself rather than the skills of the actors.\\n\\n\r\nOne of my biggest gripes with Chrome Shelled Regios was the lack of originality when it came to character types. Granted there are only so many to go around, however the writers seemed to have followed the cut and paste format to the letter. While the plot may be interesting in parts and the story engaging to a degree, in a series like this it's ultimately the characters that make the whole thing shine. The lead roles are interesting enough, but their development can often seem overly conrtived. In addition to this, the actual characterisation is fairly basic at best, and very little time is spent on ensuring that the characters have reasonable and valid justifications for their actions.\\n\\n\r\nAgain, this may be due to the writers attempting to incorporate all of the versions of the story into one narrative, but whatever the reason may be, the upshot is that this show really could have been so much more than it is. That's not to say that I didn't enjoy it, as Chrome Shelled Regios is entertaining in its own way. The problem is that the ideas and concepts behind the show could have been planned and executed better. The post apocalyptic high school, for example, is a novel idea, but instead of trying for more originality, the creators have gone in the other direction. \\n\\n\r\nIn simpler terms there are many thing in Chrome Shelled Regios that have been done before, and often done better. The series relies too much on stereotypes and plot devices, and too little on innovation, creativity and ingenuity. The sad part about all of this is that while the show is entertaining enough to be enjoyable to a degree, many of the elements that make up the series have only really been applied to maintain the viewer's interest (and hopefully sell some Chrome Shelled Regios goodies). This is the reason why the comedy doesn't mesh well with the rest of the plot, and the lack of cohesion at the most basic level is ultimately the reason for the poor characterisation as well.\\n\\n\r\nIt's unfortunate that, once again, a series with a great deal of potential has been let down by its creators. One can only hope that the future will bring improvements, and that more companies will stop making shows that are nothing more than glorified advertisements for related merchandise.\\n\\n\r\nAfter all, who knows what I'll find on my next foray into a post apocalyptic world ...\\n\\n\\n",
            "date": "2010-09-03T21:48:00+00:00",
            "helpful_count": 206,
            "mal_id": 30215,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=30215"
        },
        {
            "content": "*Disclaimer* This is my first anime review, so if I have done anything wrong please feel free to send me a message telling me. Also, even though my username is Sharnid, I have tried to write this article without taking sides or with bias. Lastly, please rate this anime review on how informative it was (helpful or not helpful) rather than your opinion about the anime. Thank you. \r\nStory/Plot – 6.7\r\nThe Overall plot is about Layfon Alseif, a person who has potential for being in Military Arts, but is reluctant because of his past. However, he still becomes part of the military academy, and findshimself in the 17th platoon fighting in Platoon matches, or against filth monsters and slowly revealing his past as he fights along. \\n\\n\r\nYes this deserves a low score of 6.7, why you ask? First of all Regios can get VERY VERY confusing. (almost as confusing as Lost) This is a show that demands you to either pay attention to almost everything they are showing you, or go back and rewatch a couple episodes. Even then, you still won’t understand some of the parts of the story, which suggests that this show is going to receive another season such as a prequel, but as of now, I have heard no news about it. Secondly, I have noticed the storyline follows a particular pattern, Fight Filth Monsters->Reveal a little bit of Layfon’s Past->Fight in Platoon Matches->Reveal a little more of Layfon’s Past->Fight someone Layfon knew before (Haia, Gorneo-> Reveal his past some more->Then, Bam, Fanservice episode. Then maybe, they would add an episode to show that Felli, Nina, Leerin, or Meishen likes Layfon.  However, the show does make up for it with the twists in the plot, and still the story does proceed, although it may be slow. The show gets docked a few points though especially at the end where they absolutely rush the whole thing. Even rewatches of the last episode and of previous episodes will not explain everything in the end and viewers may feel unsatisfied, almost like watching the second season finale of Lost. \\n\\n\r\nCharacters – 7.4 (this will be done with overviews with characters that have high to medium importance)\\n\r\nThe biggest flaw with the characters is that they never actually change their personalities or anything throughout the whole show. \\n\\n\r\nLayfon: is always reluctant to fight, and wants to do something else than fighting, but doesn’t , Layfon also doesn’t notice that Felli, Leerin, Nina, or Meishen likes him, and does not notice this for the whole season. However, he does have a hidden past, which means he is different from the other characters and kind of makes the viewers want to know his past. I have also noticed that layfon had 2 personalities, 1 where he was super nice, and then a more serious one. He is basically could be in a platoon by himself and still win matches.\\n\\n\r\nFelli: also wants to do something else besides being in the military academy, but doesn’t. However, Felli is one of the most likeable characters, and she herself adds a lot of comedy to the show, her kicks are more deadly than one by Chuck Norris or Bruce Lee (and also very funny), and when they draw Felli in an angry state, it is quite enjoyable. Felli also does change her personality a little to show that she likes Layfon. \\n\r\nFelli uses Psychokinesis to support the 17th platoon, which is basically large radius of sight and the ability to transfer speech and information to other members. If you need an example, think maphacks in RTS games basically, probably a very advanced form of them.\\n\\n\r\nNina: always wants to become stronger, but no matter what she does, she doesn’t really get much better, although she trains a lot of the time. She also gets mad at Layfon a lot, but she always forgives him later on anyways. She is also the leader of the 17th Platoon, but for a leader, she really isn't particularly strong and takes a backseat to Layfon. Truely speaking, she basically tried to go the warrior class and put all her stat points in INT and doesn't have a restat.\\n\\n\r\nSharnid: Carefree attitude, and like Layfon had a sort of mysterious hidden past. Although Sharnid acts carefree about almost everything, things are revealed about his past, and he actually takes it very seriously. However, many things are still not explained about him, such as his origin, and that can be good or bad, depending if there will be another season. He is currently the sniper for the 17th platoon, and if you need a reference, think of Kurz Weber from Full Metal Panic, except maybe 10 times cooler in my opinion. Sharnid is the sniper for the 17th Platoon and is also a playboy. :P\\n\\n\r\nSound/Music -8.7 \\n\r\nI mean I really can’t find big enough flaws for the music or the sound. During some extreme fight scenes, such as the one where Layfon fights with Haia to save Felli, the background music is amazing, and deserves high marks. The ending songs for the show are also very good in my opinion and they do change the ending song after the halfway point in the anime. Also if you listen carefully, each time they have different voice actors sing the ending theme song which is nice. For example, Felli sings a duet with Sharnid, along with other combinations.  However, I just don’t like the beginning theme song, and they don’t change the song after the halfway point, which leaves me to skip the beginning theme song. They also repeat a generic BGM sometimes when layfon is fighting, and that becomes annoying after a couple episodes, and docks the anime some points.\\n\\n\r\nAnimation-7.6\\n\r\nThere is really nothing special about the animation, except the fight scenes and the fan service scenes. However, when they draw Felli at times, and even Sharnid (when he is sprayed with water by Nina at the pool) it is quite comical, and brings up the score. Other times however, the animation is a bit off, if you can remember the time where Layfon is on the train alone with Meishen, and where we get a close up on Meishen's face, her nose just seems to be drawn weird in my opinion. \\n\\n\r\nEnjoyment- 8.2\\n\r\nThis anime was actually very enjoyable in my opinion, the mix between action, comedy, and fanservice kept me watching the anime to the end, and many of the characters are quite enjoyable to watch, particularly Felli. The fan service scenes also help with putting the anime in a more relaxed have fun state, instead of action and fighting all the time. Also this anime had better comedy scenes that some of the anime I have seen that were only about comedy.\\n\\n\r\nOverall – 7.72 (6.7+7.4+8.7+7.6+8.2=38.6/5=7.72) \\n\r\nOnly 7.72 on an anime I based my username off of? how come? Although I truly enjoyed this show especially the action and a little bit of the more relaxed episodes, the ending to the season really severely docked this show some points. After reading all the released manga that have been translated, I have noticed that they explain a lot more with the manga than with the anime, which means if you truly want to know everything you have to read the manga also. That shouldn’t be the case. They need to pace this anime a lot better than they did, have bigger changes with the characters, besides Felli, and explain the story more. I mean they had 24 episodes, which is a considerable amount of time to make the story work out.\\n\\n\r\nSome people also tell me, don’t worry there is definitely a second season! But how can you be so sure? They haven’t announced it or anything which suggests they are just leaving the anime as is. Hopefully, they do release another season, and explain all the holes in the story, which will definitely lead to a better score in the next season.\\n\\n\r\nIn the end, If you are looking for an anime that has good fighting scenes, relaxed scenes with the 4 girls that like Layfon (fanservice), and some comedy, then you should definitely take a look at Chrome Shelled Regios or atleast just try a few episodes. This show offers a nice balance of  action/seriousness to comedy/fanservice, so many viewers might like this particular anime.\\n",
            "date": "2009-08-11T19:33:00+00:00",
            "helpful_count": 98,
            "mal_id": 17683,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sharnid",
                "username": "Sharnid"
            },
            "url": "https://myanimelist.net/reviews.php?id=17683"
        },
        {
            "content": "Chrome Shelled Regios is one of those animes that I watched without real interest. The art is good, animation is fluid, this point is ok.\r\nThe main thing I disliked about it, was that it was too centered around the main character. Layfon is strong, Layfon appears when others are in danger, Layfon beats everyone. Close to every women character are blushing when seeing him, even if there is no romance. Even the cold one ends up being all over the hero. The other characters feel like they were added just to have some kind of background but there's no real work on them.\r\nDuring 24 episodesthe story isn't fantastic, nothing that surprises us suddenly, well they played the safe card. In the end, many questions are unanswered. It seems that no second season will be released so they will stay as it is. Sad because a lot of ideas were present. For example, all those Heaven's Blade Wielders, we get to see them in the two or three last episodes, some of them for just a sec, disapointing. \\n\\n\r\nTo sum up, the anime is classic, I didn't really enjoy it but still, it was watchable enough so I went till the end to see if it gets better. Don't expect incredible storyline, just a common anime in the overall sea of animes.",
            "date": "2013-08-08T04:31:00+00:00",
            "helpful_count": 86,
            "mal_id": 108785,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1568683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nadium",
                "username": "Nadium"
            },
            "url": "https://myanimelist.net/reviews.php?id=108785"
        },
        {
            "content": "**As of Episode 11** \r\nRegios is a show i really didn't pay any attention to until finally 2 weeks ago, and i'm glad i gave it a chance. The anime producer, ZECXS, hasn't done some good animes (Last one being Rental Magica), but i think this one can really blossom into something good.\r\nStory - 7.9/10 (C+)\r\nFilth monsters? lol. But seriously, it's not as boring as it sounds. How about \"cleaning\" these filthy monsters with magical swords and wizardly staffs? Now that's more interesting. The story centers on Layfon (Or as Felli calls him Fon-Fon), a young kid who has hidden potential while looking like justthe opposite. Klutzy and Humorous, Layfon manages to join the 17th Squad (16th?) under Nina Antalk, a spirited and focused young girl who works her hardest to achieve success. The plot so far is okay, but i'm docking points for coining the term \"Filth\" monsters and a really lackluster beginning.\\n\\n\r\nAnimation - 7.6/10 (C)\\n\r\nThe animation is mostly bland and standard, except when it comes to flashbacks and fight scenes and fanservice scenes. Can anyone say, Felli Meido?\\n\\n\r\nSound/Music - 10/10 (A+)\\n\r\nI got hooked on the OP song, Brave Your Truth (lol engrish) just from hearing 5 seconds of it. That never happens for me. The same applies to the ending as well, \"Yasashii Uso\". Both fit PERFECTLY for Regios, One starting the show with a techno rock beat, and ending it with a gentle, soothing slow ballad. Each episode has a different ending version, and i'm most fond of Felli's version and Nina's version the most. The voice actors, while not ultra popular (See: Aya Hirano, Mamoru Miyano), have as much talent (even more, in some cases) as the populars. Episode 4 and Episode 5 treated us to some english, i dunno what's up with those 3 people in that car, but the english is so lol.\\n\\n\r\nCharacters - 9/10 (A)\\n\r\nLayfon is NOT the typical idiotic shounen lead character. He's likable from the very beginning, along with Nina and Felli. The rest of the cast i don't really pay attention to, but don't worry it's all good. Layfon's past is now catching up to him, and each episode he goes from \"Typical Anime Shounen lead\" to \"Really Interesting and Evil\"\\n\\n\r\nEnjoyment - 10/10 (A+)\\n\r\nWatch Kokaku no Regios! Really, it's got a bit of everything: Fanservice, Ugly monsters, RPG-ish characters and excellent theme songs. What else would you want?\\n\\n\r\nOverall - 9/10\\n\r\n-------------------------\\n\r\n~~The Good: OP/ED, Characters (Except the Engrish People (See episodes 3-5), Shante), Excellent BGM\\n\r\n~~The Bad: A bit fast at first, slightly annoying fanservice\\n\\n\r\n~~Strong Points: BGM and OP/ED, Characters\\n\r\n~~Weak Points: Animation",
            "date": "2009-03-02T23:48:00+00:00",
            "helpful_count": 44,
            "mal_id": 12886,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=12886"
        },
        {
            "content": "Edit: Now that I've finally figured out how to edit reviews, let me go ahead and revamp my take on Regios even if it has been a while.\r\nStory 7: The story is a pretty common one in parts I think. Boy has extraordinary power, boy doesn't want to use that power, boys tries to run away from that power, and then discovers that with great power comes great responsibility so he has to suck it up and use it. Not that it's a bad story, it's just a pretty common one.\r\nArt 7: I can't find any major flaws with the artwork. The background and charactersall look good and the battle scenes flow nicely. It's not my favorite style of artwork, but it was well done for the style they used.\\n\\n\r\nSound 9: I quite like the tracks for this series so far. The background tracks all portray the mood of the scene accurately and the OP and ED are enjoyable. The OP is probably my favorite this season that I've heard yet.  The ED certainly grew on me and I appreciated how the different characters each had a version. It really gave some more character to the show..\\n\\n\r\nCharacter 7: I really enjoyed the characters in this series. While they didn't really seem to change or grow I was rather attached to them regardless. I never could bring myself to like Felli very much sadly, despite her comic and moe appeal. Nina was a lost cause, but the fact that she continued to try impressed me personally and all the other characters were interesting in their own ways.\\n\\n\r\nEnjoyment 8: It's a fun watch. Good action, good characters, and what's a fairly enjoyable premise even if it's a little confusing at times.\\n\\n\r\nOverall 7: If you're looking for a new action series to watch I'd entirely recommend this show. Granted I typically don't watch Shounen that much but doesn't that say something about the flexibility of this show if it's able to convert a Shoujo fan like myself? Go into this with an open mind and you might find yourself surprised by the outcome.",
            "date": "2009-01-20T22:18:00+00:00",
            "helpful_count": 25,
            "mal_id": 11733,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126885.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Illuminary",
                "username": "Illuminary"
            },
            "url": "https://myanimelist.net/reviews.php?id=11733"
        },
        {
            "content": "Overall ~ 7\r\nThis show could have been really good , but suffered from severe pacing problems and one dimensional characters. The overall action in the show wasn't very good because Layfon never showed his true abilities so you never felt that feeling of excitement in a battle. The comedy was pretty good and mostly revolved around Feli kicking Layfon. I wish they had straightened out the pacing problems and made the filth monsters or people stronger so Layfon would show what he could really do. \r\nStory ~ 6\r\nThe story for Chrome Shelled Regios is nothing out of the ordinary. People live in traveling domes andfight filth monsters, you have a summary. There are some major problems with how everything unfolds in the pacing department. (No spoilers don't worry). The beginning of the story was done pretty well and the middle is fun to watch, but in the end it's disapointment after disapointment. They get you excited about something that is about to happen for a couple of episodes, then something happens causing the exciting event to suck or not even happen. Then in the ending arc, Chrome Shelled Regios suffers from major pacing problems.\\n\\n\r\nThe last arc was handled awfully. They speed through important information and then take forever to accomplish something. The last episode should have be done in two or three episodes, but is crammed into one leaving a lot of \"What? How/ why did that happen moments.\" and a dissatisfying episode. And a lot of information just isn;t relevent to the plot at all. But maybe a second season will fix that.  \\n\\n\r\nThere were some positives though. The inter platoon matches were fun to watch and Feli kicking Layfon was funny. \\n\\n\r\nArt ~ 7\\n\\n\r\nThe scenery was done pretty good and the CG'ing wasn't bad (not great, but average). The overall art gets better as the series goes on especially the filth monsters. This is just my preference, but I didn't like the character designs. Mostly how they put solid lines for the edge of shadows on the characters faces and I didn't really like the type of eyes they used. Just my opinion though, you might like it. \\n\\n\r\nSound ~ 8\\n\\n\r\nThe openings and endings were good and the background music was very good. All the characters' voices matched too, no complaints there. I didn't give this a 9 or a 10 because it lacked something that made me go \"wow\". \\n\\n\r\nCharacters ~ 6\\n\\n\r\nThe characters in Chrome Shelled Regios were ok. At the end of the series, I looked back on how the characters changed, and I realized........ that they didn't. Layfon still won't show his true abilities and tries to protect everyone on his own, Nina was still trying to stop depending on Layfon, but can't and Feli still likes Layfon, but kicks him after everything.\\n\\n\r\nI thought the characters were one dimensional and predictable. And they didn't develop at all throughout the series. But, Feli kicking Layfon and Layfon protecting everyone does keep you interested for the whole series. \\n\\n\r\nRecommended?\\n\\n\r\nI would recommend you give this show a try to see if you like it, and if you have any doughts, don't expect it to get any better. I mostly pointed out the negitive parts of the series  but don't worry, there was some good stuff to keep you watching.",
            "date": "2009-06-21T22:00:00+00:00",
            "helpful_count": 20,
            "mal_id": 15975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133289.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meh_93",
                "username": "Meh_93"
            },
            "url": "https://myanimelist.net/reviews.php?id=15975"
        },
        {
            "content": "*Important before reading*\r\n- This review is completely subjective.\r\n- No summary is included in this review.\r\n- Don't worry about spoilers.\r\n- Feel free to leave a feedback/thank note on profile!\r\nEver since i saw the first couple of episodes i was expecting quite a lot out of this show. It seemed like it had everything it needed to become a top-notch show. Interesting alternate universe, diversity in characters, spectacular action, romance and comedy. However, when i had completed the show and looked back at these expectations it was kind of dissapointing. \r\nFirst of all the universe. what could have become an epic battlefield became a rather weak setting.history and other facts come rushing at you, but never really worked out. More than once you'll find yourself wondering 'what the f*** just happened' after witnessing some of the events.\\n\r\nThen the characters, for me the greatest dissapointment of all. They all seem quite the interesting bunch in the beginning but the problem is that at the end of the series, they're just the same. Of course there were some changes in relationship betweens the characters but none of them actually grew. Character development should always be worked out in depth and this is certainly not the case in CSR.\\n\r\nThe action is indeed spectacular but it remains the same during the entire show. There aren't any new aspects of combat that show up. The first fight and the last fight in the show are practically the same though the main character has been through a lot.\\n\r\nThe same with the romance aspect. Again some great potential to create an epic love story but instead an epic fail. Some red cheeks and home made bento's for lunch is as far they go.(figure of speech)\\n\r\nThe comedy then finally, was good. This was the only aspect that didn't dissapoint me. Don't misunderstand, the comic scenes are kept at a minimum here but that's what i'd expect from an action based show. The scenes have good timing and are really charming and funny.\\n\\n\r\nThe Artwork and ost are quite good but rather basic, nothing exceptional or unique about it,no special contribution to the show\\n\\n\r\nConclusion: This show had some amazing potential but leaves you behind with an empty feeling after finishing the last episode. Normally with this kind of ending i would be longing to a sequel, but in this case it's just a feeling of dissatisfaction. To finish i just want to say that this review is a bit too negative, but i can't help it. Guess it's because of the high expectations i had. I still recommend the show since it can be really enjoyable at times but just don't have your hopes up.",
            "date": "2009-07-13T13:32:00+00:00",
            "helpful_count": 18,
            "mal_id": 16733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/204211.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheAceOfPortgaz",
                "username": "TheAceOfPortgaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=16733"
        },
        {
            "content": "Story:   Chromed Shelled Regios is basically an anime version of the movie Stormship Troopers. That is, if Stormship Troopers was done as a bad visual novel complete with giant bug(?) things. The story is predictable with no plot that feels worth continuing to watch the show for. They rely heavily on flashes of an unclear past (or future?) action scene as well as sudden \"plot twists\" to hold your interest. It didn't work.\r\nArt and Sound:   Both the art and sound are reminiscent of a visual novel to the point where all the characters pose, still screen style, as they talk. Meanwhile,annoying and obviously synthesized music sets the mood. I'm sure they meant for the sound to mesh with the anime, but instead it was 22 minutes of fail that only managed to bring down an already mediocre show. The art itself was like a cross between a high budget yaoi (see Gakuen Heaven) and any low to mid budget fighter anime (see History's Strongest Disciple Kenichi). Not a pleasant combination, but very shiny.\\n\\n\r\nCharacter:   Same thing as with the story. All the characters had been done, and been done better, in something else that was more worth while. They had the archetypes down though, even right up to the related back story characters. By the end of the first episode you already know the &quot;plot twists&quot; for two of the main characters back stories, including the main main character. And here I always thought that a mysterious main character was supposed to be a selling point.\\n\\n\r\nEnjoyment:   Yeah... In case you haven't guessed by now, I really wasn't enjoying this show. I forced myself through it in the hope that it would improve, but it didn't. Frankly, I was bored all the way through. Nothing in that anime made my wasted time worth it.\\n\\n\r\nOverall:   All in all it was a bad show. It was bad enough that I felt I had to write a review to warn others. The story and characters were overly predictable archetypes, the art was mediocre at best, and the dreadful sound dragged the level of the anime (and my enjoyment) even lower. My advise is to not watch it.",
            "date": "2009-01-12T21:06:00+00:00",
            "helpful_count": 17,
            "mal_id": 11410,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78068.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AngelND",
                "username": "AngelND"
            },
            "url": "https://myanimelist.net/reviews.php?id=11410"
        },
        {
            "content": "Update: I've seen 6/24 of this anime so I'm doing a major editing on this review.\r\nStory (8): \r\n   A world where animals have been exposed to extreme pollution causing them to  mutate into monsters(A.K.A Filth Monsters). They now roam the planet indiscriminately killing everything in sight for food. Humans have been forced to adapt by  living in mobile cities called \"Regios.\" Though the Regios provides an environment capable of sustaining human life, they are prime targets for \"Filth Monsters\" because of the large food density... this food can also be called the human population.\r\nArt (7): \r\n   I know littleabout animation studios or specifics about each individual series' production but Koukaku no Regios so far has shown me the most cliche of animations. Skirts are absurdly short, no panty shots so far (sorry guys). Facial expressions are depicted well but the general design of each character is extremely similar i.e. same head shape or same eye shape or same body shape. (7)\\n\\n\r\nSound (6): \\n\r\n   The opening has a nice song but the animation is rather...dull (6). The ending also has a nice song but as in all endings, animation just has to give off a sense of finality which this one accomplishes. (8)\\n\r\n   This series has one of my pet peeves...BAD ACTION MUSIC! The music played during an action scene is some stupid ramped DOWN techno sequence...but other than that everything is average not above average (5)\\n\\n\r\nCharacter (6): \\n\r\n   Layfon Alseif (spelling disputed) is the main character. He is from a Regios named Grenden and is a former member of the &quot;Heavenly Blades&quot; (basically the Royal Guard). Layfon wants to begin a different lifestyle though and moves to the Regios, Czerni to study. Things don't go as expected. (8)\\n\r\n   Nina Antalk, co-protagonist, definitely has some depth to her which is shown in Episode 3. She is also from a different Regios and came from a rich family, but due to an event, she decides to join the Military Department which is frowned upon by her family who essentially disowned her. She strives constantly to be the best she can be and is deeply jealous of Layfon who overshadows her completely in terms of battle skill.(8)\\n\r\n   Other characters are barely worth mentioning. Their bonds are not described very well, friends can become friends through some of the stupidest methods that aren't even shown. Many are very dipsy doozy and aren't described very well. (5)\\n\\n\r\nEnjoyment (7): Overall, if you're looking for an anime targeting the main stream. You'll like this one alot but other than great suspense and so many interweaving complications that it brings the audience into confusion or delight.\\n\\n\r\nOverall (7): Give it a try, it seems decent enough so far but that might change radically as this is just the beginning of the anime",
            "date": "2009-01-21T21:45:00+00:00",
            "helpful_count": 14,
            "mal_id": 11751,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/76973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChinesePanda",
                "username": "ChinesePanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=11751"
        },
        {
            "content": "It was inevitable for me to get a little excited to start this series. The hostile post-apocalyptic scenario, the presentation of the premise, its aesthetics and the mystery surrounding it generated expectations just during the first 10 minutes of episode one, expectations that wouldn't be (by far) reached by Chrome Shelled Regios during the rest of the show, as the development of the real plot was quickly replaced for non-contributory, mostly-boring side stories with a coarse harem inbetween.\r\nThe turn-off caused by that was comparable to that of our simpleton Layfon who is more accompanied by an insipid crew of females than by revelations about theworld he lives in and serious battles, thanks to him being disproportionately powerful because of the simple fact he's the main character. So you better don't only forget about watching plot progress, but also about watching the protagonists (or anyone else) growing nor making something destacable with the advancement of the chapters. At least the artwork is proper.\\n\\n\r\nThe bases of the series are very contundent and the first episodes are really compelling, but the immature and meaningless way in which the rest of the story is dealt makes you think 'meh, this is just one more anime', and even among the average there're better things to watch. 4/10.",
            "date": "2015-05-28T20:11:00+00:00",
            "helpful_count": 12,
            "mal_id": 189059,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4500180.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Doltra",
                "username": "Doltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=189059"
        },
        {
            "content": "Why is it that those who seek power will go any length to become strong, and why is it that those who have power never want to use it?\r\nThis is an anime I would love to compliment on how it started, instead of just using those boring character introductions and beginnings that take forever to start right from episode 1 and 2 it just jumped in the show, which I absolutely loved. As you can see, this is a very fast paced anime that doesn’t waste time.\r\nThis is a post apocalyptic anime (in short the end of the world type of anime) and for themost part follows the 17th platoon on the journey they embark. \\n\\n\r\nTo be frank, the characters in this anime are very very unoriginal. It is almost like what you see in most anime, you have Mr. Hero, you have a bunch of girls who tend to fall in love with Mr. Hero saving them and then you always have that one character who is tsundere. I am not saying this is a bad thing, but for this type of anime, which is following the journey these characters go on, character development and unique characters is something that helps tremendously. There is really only one character, obviously the main main character “Layfon Wolfstein Alseif”, who you cant really make original. Aside from him, I personally would have changed the characters to be a bit more unique. \\n\\n\r\nAs to this show, it does have some very fun and energetic fighting scenes, and as usual has tons and tons of scenes of Mr. Hero saving someone and then the person he saves falls in love with him. What I personally enjoyed about this show though is the use of “power” in it. This is a very straightforward show puts people on 2 different levels, are they strong or are they weak. Due to this split, which is good in some ways could also be very hurtful. When there is such a black and white anime like this it tends to lack character development because the weak are never able to be on par with the strong, thus the split is harmful. What is good about doing this, is it makes other characters strive to reach up to those levels by any means possible and this is a way to bring some development into the characters. If you do not understand what I am saying, to summarize, this show lacked character development, but it was not a total and utter fail because of the use of “power”.\\n\\n\r\nAlways the easiest and hardest question to answer, did you enjoy this anime. Due to the fact that I just watched Densetsu no Yuusha no Densetsu (The legend of the legendary hero) which is practically identical to this, and this was the type of show I was in the mood for I did enjoy it. By far my favorite parts were the fighting scenes and also the character Layfon. Layfon was what made this show interesting because of his nature of being unique and people being an outcast, trying to fit in with society. Just as a little side note, throughout this anime you will see clips of a story that is all in English, this is the most confusing part of the anime so don’t be turned off by this. What I personally want to do is look more into what the meaning of that side story is because I found it very complicated and it did leave some questions unanswered for me. Aside from that, that side story was one of the most unique things I have seen in an anime, even if I didn’t understand it completely, I found that it was able to bring some more life to this anime.\\n\\n\r\nJust to quickly touch on the songs (and art) the only one that I want to talk about is the ending song (like the end end song). This song as usual was very powerful, due to the fact I was expecting a song like this because of how related it is to some other animes, I still find it pleasing that animes are able to bring the type of sadness emotion to you that the anime is at the end. This is something that I love because it always brings like warmth to my heart, but I also despise because I feel like this type of anime could continue on but never will. For the art section, there really isn’t anything for me to write, it was just your typical art nothing out of the ordinary and nothing that stood out as being bad, I have no reason to praise or citizen this.\\n\\n\r\nWhy do you seek to become strong and gain power? Is it for your own personal use, or do you wish to help people in this world?\\n\\n\r\nThat concludes my review.  If you have any questions or comments please just send me a pm or write on my wall, I will try my best to answer to the best of my power! I will accept any type of feedback on to how to better improve my reviews, but please be constructive as well! Please also check my other reviews. Also if you want me to do a review on a certain show (whether I watched it yet or not) I will try to prioritize. Also check out my blog post (http://myanimelist.net/blog.php?eid=723679), to help me with future reviews!\\n\\n\\n",
            "date": "2013-02-11T23:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 86597,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1183467.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/toyhammered",
                "username": "toyhammered"
            },
            "url": "https://myanimelist.net/reviews.php?id=86597"
        },
        {
            "content": "Chrome Shelled Regios? Sounds like a poorly translated menu item at the local Chinese seafood takeout. Yeah, I get it. Chrome shells. In the future we live in dome cities. Like Ergo Proxy, Wolf's Rain, and a billion other anime.\r\nBut there's a twist (isn't there always). Resources are limited, there are monsters everywhere (Filth Monsters, apparently), and the soft-shelled cities engage in battles with each other for rights to mine Selenium which keeps them going. Which almost makes sense except that they are powered by Fairies or something like that and the competitions are held by essentially schoolkids fighting each other with these things called\"Dites\" which are referenced in the OP along the lines of \"so we may go somewhere weeeeth the Dite.\" \\n\\n\r\nIf I'm losing you the summary of what it's about:\\n\\n\r\nThere's a city called Grendan. It has really badass Dite wielders. So badass, they're almost Gods. The rest of the cities don't (not sure why). One of these guys, Leifon, gets exiled and becomes a schoolboy in Zuellni because he wants to run away from his past and that's where the premise starts. A really badass guy pretending to be a student because he has a dark past.\\n\\n\r\nSo you have to throw in the usual cliched characters, overeager Tomboyish squad leader who takes him in, loli sister of pervy student council leader, the playboy sniper,  three random girls (like you've always seen).\\n\\n\r\nWhat saves this anime, is that it seems to actually focus on a backstory of Leifon, his interactions with those in Zuellni, his rather fatalistic views on life, without cocking up most of it. You watch it with the hope it's going somewhere and there actually seems to be stuff going on (i.e. the fairies, the filth monsters, Lefon's betrayal).\\n\\n\r\nIt's average, but at least it's trying.\\n\\n\r\nOf course it also hasn't really gone anywhere and it keeps introducing characters the show seems compelled that i MUST know, but there is little exposition to explain why...",
            "date": "2009-04-15T07:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 14180,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14180"
        },
        {
            "content": "With an intriguing plot, a great cast of characters easy to love,a main character with the coolest hair style imaginable, a harem with an action packed plot with a touch of funny, Chrome Shelled Regios was able to deliver a great watch and a wanting for more. I highly recommend this one to any fan that enjoys there action driven animes, without compromising other key components. what are you wanting for, go watch it!  \r\nPS, the girl that i always want the main character to end with always losses...",
            "date": "2010-01-28T16:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 22763,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288192.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeXDieNastYx",
                "username": "AnimeXDieNastYx"
            },
            "url": "https://myanimelist.net/reviews.php?id=22763"
        },
        {
            "content": "i would say this anime is somewhat like \"Blue Gender\"(an old anime)\r\nchrome shelled regios is set in a post-apocalyptic world, where people live in giant dome cities that are powered by \"electric fairies\" because the world became too poluted to live in and there are giant man-eating creatures[filth monsters/limbeekoon] outside of the domes. the cities are classified differently depending on their military power: academy, lance shelled[one of the most powerfull in the world]...and so forth...\r\nits abt a guy that gave up his past of fighting in the military[one of the strongest] but it caught up with him.his name is layfon azelfe and he probably isthe most powerful character and has alot of girls falling for him....\\n\\n\r\nto me the characters are great and funny\\n\\n\r\nwell thats all im gonna say...u watch it and see for yourself\\n\\n\r\nmy fav...i wanna c more....i hope i get to c more",
            "date": "2009-07-19T17:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 16957,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/konvic_14",
                "username": "konvic_14"
            },
            "url": "https://myanimelist.net/reviews.php?id=16957"
        },
        {
            "content": "Okay My first Impression on this anime Chrome Shelled Regios. Was accidental yet a good accident why you may ask? I started wacthing this anime on episode 13. Alreday hooked to the story though,really,really entertaining. Other than the fact that Netflix had me going wrong parts.\r\nDON'T GET CONFUSED AS SUCH NAMES AS \"the Fallen ones\" it's just a better way of saying the spirit of the city has gone mad.Don't let it get to your head.\r\nAlso I love this anime because it made me think and kind of put the subject in my shoes What would I have done?\r\nGlad I saw episode 13 thoughor else I would of not understood episode 1.Which episode 1 I really love it wasn't confusing to me, than what other people said about the first episode\"really confusing\" not to me that is.\\n\\n\r\nAnyways the Story 9/10 \\n\r\nMany reasons why,after seeing that ending you just ask for more and more.\\n\r\n2. I want to see what happens next,I mean the story Is perfect why did it had to end like that?\\n\\n\r\nArt 10/10\\n\r\nReally well done charactersthat show emotion,BLINK for once (yay).\\n\r\nThe art never got old just to tell you.\\n\\n\r\nSound 10/10\\n\r\nGreat sound effects on the explotions,battle scences and bullets.\\n\r\nThe music was great I mostly loved the ending songs though.\\n\\n\r\nCharacters 10/10 \\n\r\nThe characters many you can relate to like Layfon,what will you do to survive?Many characters are loveable here.I should mention the dubbed verion to CSR is really good like Todd Haberkorn is awesome as layfon really fits his voice and actionsto this anime.Then there's Monica Rial who plays Felli really great voice acting too well met for her role in CSR.\\n\\n\r\nEnjoyment 10/10\\n\r\nMany reasons why I enjoye ChromeShelled Regios is the battles ,the fight scenes. Why? because in this anime they actually showed fight moves not like other anime that talk for half the time and then fight. CSR really aced the enjoyment meter for me ,there was always a fight or a brawl or a mini cat fight.\\n\\n\r\nDislikes : They showed the 12 Heaven Blades in action all late about it.\\n\\n\r\nMy overall score is a 10 for the non-stop battles and good music,voice actors (dub),the art the enjoyment doesn't fail so I highly recommend Chrome Shelled Regios to your list.",
            "date": "2011-08-17T09:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 41657,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RosyXkid",
                "username": "RosyXkid"
            },
            "url": "https://myanimelist.net/reviews.php?id=41657"
        },
        {
            "content": "Okay so this will be my first formal review for an anime in this website and it is because of how disappointed I am after watching it.\r\nStory 4/10\r\n- I thought that the plot was pretty interesting as it was set in a post apocalyptic world with monsters known as contaminoids and that the you protect your moving fortress, battle with other fortresses for resources and also platoons competing against each other within the fortresses but then it starts get confusing for me, especially those scenes with really really bad English voiced scenes that was shown as a TV show in some scenes but in otherepisodes just appeared as if it was related but all the way till the end it had no relation at all except the fact the the female character \"Saya\" has the same name and character design of a girl name Saya which you will find out as you watch the anime, overall I was pretty confused with this anime, frustrated with too many unsolved mysteries and such.\\n\\n\r\nArt 6/10\\n\r\n- I know this anime is from 2009 but I believe there are some other animes during 2009 that looks much better, but the art here isn't all that bad in my opinion. I only felt that the fighting scenes, weapons, armor and some characters did not look good at all but Felli is definitely my favorite.\\n\\n\r\nSound 7/10\\n\r\n-Since I don't totally understand Japanese, the songs to me weren't so additive in this one but since I do also listen to J music, there are some OSTs that I like here specially the ones with out anyone singing and I disliked the Engrish used in some music as it sounded really bad.\\n\\n\r\nCharacter 6/19\\n\r\n-The characters weren't great but not so bad either, like I said my favorite was Felli, I actually enjoyed the comedy scenes and found the Chibi scenes cute, the president has a usual design of a long haired glasses type of guy and the anime did show a good amount of development with each other and I also did get to know their backgrounds and even some side characters such as the trio police, reporter and cook but I think there is too much of Layfon in almost everything, I like how he is the bad ass op character but It didn't give me that feeling at all and sometimes his problems confuses me and gets me frustrated, not enough of the heavens blades as well! They only showed some of them for a sec in only few episodes.\\n\\n\r\nEnjoyment 4/10\\n\r\n- The anime confused me in the beginning, I almost stopped but after watching a bit more I thought it could be interesting and would get better as I continued, through out the anime I was cussing here and there out of frustration become of some scenes and also because I don't know why there is that English TV show and the really bad English, why does it have to be English?! but it was still watchable at least.\\n\\n\r\nOverall 5/10\\n\\n\r\n- I don't know but to me the anime wasn't satisfying at all, I thought it seemed pretty mediocre and am pretty disappointed with this show, I surfed the net and read different reviews and discussions and many people thought that this show is really mediocre and I agree but for the good side the comedy scenes were pretty funny and Felli should have been the most op character as she can just kick anyone and break their bones.\\n\\n\\n",
            "date": "2016-01-14T12:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 208513,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/896377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DreiiKun",
                "username": "DreiiKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=208513"
        },
        {
            "content": "I'm really torn when writing this review. I feel like this anime could be absolutely amazing, because it is, and yet it isn't. For starters it needs to have about 50 more episodes. I feel like the creators intended a very long series and had to wrap everything up very quickly.\r\nStory 6/10\r\nThe story is pretty interesting and has a lot of potential, however there were just too many plot lines brought up and left hanging. There are concepts that are simply short-lived and there are incidents that happen on the basis that it will be explained later...but they never get around to it. The wholeidea of this badass kid trying to fit in like a normal person and not being able to because he's so badass is just great. But there are about fifty other things going on that tend to take away from the \"main plot\". Like I said before, if the series had more episodes and could be spread out a little more, than I don't think this would be a problem. The setting of a dying world with moving cities run by electronic fairies is pretty neat, but there again is a whole story (especially the Haikizoku) that is never really clearly explained or resolved. You've also got the 11/12 Heaven's Blade receivers that are never really introduced, the whole story going on with the queen and Leerin, the whole story with Leerin and Layfon, the inter-platoon relations, Layfon's past, Nina's past, Layfon's many relationships with many young women, Nina and Dick and Saya, the Psyharden, oh and the ongoing search for Selenium which again is kind of a fuzzy topic. Plus, you never really get an explanation for the black and white, semi-TV show/might be another world story with absolutely awful English that interrupts the show every episode.\\n\\n\\n\\n\r\nAnimation 8/10\\n\\n\r\nThe animation is pretty sweet. The fight scenes with kei and dites are really fun to watch and I really enjoyed the animation for using kei by itself to increase speed, throw up a shield etc... There were a few scenes with simple face panning and then simply sword to sword meeting that dropped the rating of this category overall, but I did really enjoy most of the fight scenes.\\n\\n\\n\\n\r\nSound 7/10\\n\\n\r\nI don't usually pay much attention to sound quality and such, it's only when a track annoys me that I tend to rate this category differently.\\n\\n\\n\\n\r\nCharacters 9/10\\n\\n\r\nI rated this category pretty high but for a just reason, most of the characters are just great. Layfon alone could run the show for me. He's goofy and awkward and turns into a ridiculous fighting machine. However, you never can really gauge the power level of Filth Monsters from Layfon. One minute he's cutting through hundreds of them and the other minute he's taking days to defeat one. I realize there are different stages and such, but I also feel like maybe that classification got thrown out towards the end when they are trying to wrap everything up. But that aside, Layfon was a pretty legit main character and it made me sad to see how awesome he could be (in the last episode) and know that I wouldn't get to see anymore. Nina was kind of a downer to me, but she never really annoyed me or anything. Her fighting style is pretty cool and her whole story with the fairies and such could have been a neat side plot. Felli was another favorite. Her powers and attitude towards Layfon made her a very likeable character. The other platoon members and students were also, for the most part, pretty interesting. You only get a few episodes with the big guns from Grendan, which was upsetting because some of them looked pretty friggin sweet.\\n\\n\\n\\n\r\nOverall 8/10\\n\\n\r\nA little above average is the perfect way to describe the series as a whole unfortunately. Like I said before, so much potential! Don't get me wrong, it's definitely worth watching but just don't expect any closure of any form. I'm hoping that the series will get picked back up again someday and someone can help it reclaim its full potential.\\n\\n\r\nAnother time, another review... :)\\n",
            "date": "2014-08-01T03:37:00+00:00",
            "helpful_count": 8,
            "mal_id": 154695,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=154695"
        },
        {
            "content": "Here is how the situation went...\r\nFriend: you like God eater right?\r\nMe: Yeah, the anime alone got me to buy it on PS4.\r\nFriend: The you'll really like this, they're really similar.\r\nOh my, why must others lie.  So I watched till four episodes in and dropped this series, but why so unfair you may be thinking?  See I have a three episode rule where I'll give anything three episodes to win me over, but this show.  First I'll say the art style is great, very clear cut and the show has decent sound I'll give it that.  But the story and characters arejust so boring.  This show just couldn't hold my interest and I'm one of those people who'll stay up till stupid o'clock watch any old trash on youtube.  \\n\\n\r\nEnd of the day  if you like anime with cool looking fights then go for it but I would expect much character wise from this one.",
            "date": "2018-02-22T17:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 272210,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4712842.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JasonRed",
                "username": "JasonRed"
            },
            "url": "https://myanimelist.net/reviews.php?id=272210"
        },
        {
            "content": "Alright so I am just gonna keep this short, sweet, and to the point\r\nStory: 6/10\r\n- the storyline had potential, but in the end, there were too many unanswered questions. In addition to that, it is quite easy to get confused at times because some things were not well explained.\r\nArt: 6/10\r\n- this anime was aired in 2009, you can't really expect it to have amazing animation. I say it was sub-par. \r\nSound: 7/10\r\n- sound was alright, average at best. I really did enjoy the theme song though. \r\nCharacter: 7/10\r\n- I found that the anime did present some characters that you could really feel for and connectwith. However, the anime introduced too many characters that were irrelevant to the story. \\n\\n\r\nEnjoyment: 7/10\\n\r\n- even with a lot of evident flaws, i still enjoyed it. Unlike some anime, i become disinterested pretty easy, but that was not the case with this anime. It got me hooked enough to finish it.\\n\\n\r\nOverall: 7/10\\n\r\n- good anime with average story line and characters. I would recommend giving this anime a shot.\\n",
            "date": "2017-01-19T21:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 238662,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778465.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/phuynh1997",
                "username": "phuynh1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=238662"
        },
        {
            "content": "Set in a future where the air is toxic (or modern day china), where giant bugs known as contaminoids roam, cities walk the desert.\r\nThese cities are known as regios.\r\nOur hero came to a new city for a fresh start after being banished from his old city.\r\nWhile looking for an ordinary life he is quickly swept up into a military academy.\r\nThis anime may come off as a bit harem. However, this is justifiable as the main character actually has skills (few other harem characters do). His skill is that he could outswordfight Ichigo from bleach- he is that good.\r\nThe only problem is that it was abit short. The last episode was kind of a letdown for the sole reason it felt like they could have spread it into 6 more episodes. The final ten minutes felt crushed together with no breathing room.\\n\\n\r\nSomething really cool about this anime is a few scenes that appear to have nothing to do with the plot. The screen is tinged and it plays out like a hard-boiled action flick but there is a twist to these scenes and what they actually have to do with the story.\\n\\n\r\nI gave this an 8 because it was thoroughly enjoyable, especially the fight scenes which normally in anime I hate because they sound like dirty movies.\\n\\n",
            "date": "2013-03-28T13:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 91307,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2356071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kissen49",
                "username": "Kissen49"
            },
            "url": "https://myanimelist.net/reviews.php?id=91307"
        }
    ],
    [
        {
            "content": "In a search for a good action anime, Chrome Shelled Regios (CSR in remaining review) popped up out of nowhere. The synopsis gave out a solid indication about the series so I decided to go for it. I’m somewhat glad to have encountered CSR this early in my anime viewing experience because I was able to appreciate it more despite all of its flaws.\r\nSTORY: 6\r\nThere’s only one thing you truly need to know about the story: it has no direction and it’s confusing on occasions. By “it has no direction” I mean that it’s basically a “monster of the week” with the addition of abunch of flashbacks, some harem thrown in and somewhat hilarious twists. The story follows Layfon, mysterious young man who arrived in a city called Zuellin to do … something. However, by the odd turn of events, he’s enrolled in the Military Arts and forced to take part in, what can only be called, foolish inner-platoon matches. However, we soon realize that Layfon is not your ordinary teenager. \\n\\n\r\nI’ll be honest here – the story is weak. Even though it does try to do something about it, it almost always fails. It pulls things right out of nowhere (especially in the later episodes), giving all the new terms, confusing the viewer and all sorts of things just like those. The only real way to understand what the writer wanted to say completely is to shut down everything in your brain and focus it entirely on the CSR or to re-watch the show couple of times. I probably missed it, but they never really explained what “Kei” is and it left me guessing that it’s some sort of inner power or something. It’s rather redundant to go through twenty four episodes and still wonder what the hell is this and what the hell is that. \\n\\n\r\nART: 7\\n\\n\r\nThere are a lot of stiff moments. And when I say a lot, I mean A LOT. Character designs are somewhat odd but the world itself is quite interesting. The fights are animated quite nicely (especially those towards the end) and backgrounds can be beautiful at times. Still, as I said, there are A LOT of immovable scenes where the speech just goes on and on and on without much animation. The monster designs are rather imaginative and colorful and they wary quite much which is always a nice thing. All in all, nothing amazing but definitely above average.\\n\\n\r\nSOUND: 8\\n\\n\r\nThere are only a few complaints I have about the sound of CSR; first and foremost, background music is mismatched a lot of times and good songs are rarely thrown in. Second, some of the character voices are quite annoying and it can go over the board at times. Still, if I forget that, there’s really nothing bad I can say about the sound. Soundtrack throughout the battles is fast, adrenaline-pumping, loud and it gets you going. It fits the scenery quite well and, in the last episode, it comes to bloom to its utmost strength. Quite amazing, I must admit.\\n\\n\r\nCHARACTERS: 7\\n\\n\r\nThere are a bunch of characters in CSR and that is bad. As the matter of fact, only three or four of them get developed properly. Harely Sutton, who’s supposedly a main character (well, he IS in every episode) gets zero, absolutely zero development. All we know is that he’s a Nina’s childhood friend and that he likes to make swords. Well, great. Main focus goes to Layfon, of course, and he’s a solid character. Idiotic, but solid nonetheless. Obviously OP in every matter but his story is quite intriguing even though many might argue with his choices or his ideals. \\n\r\nFelli is probably the most-likeable character out of the cast. She’s your  not-so-typical loli character with tsunadrish attitude  and is a great comedic relief at times. She can be annoying, don’t get me wrong, but she’s still likeable. \\n\r\nNina is … bad character – at least for me. She’s one of those “I want power for this for that blah” and her development lacks quite a bit. She trains and trains, but she never goes anywhere. She’s as weak as she was in the first episodes. She’s self-involved, pretty much unrequited most of the time but she also has her moments.\\n\r\nNow, the only reason I gave 7 to this department is my beloved Synola-san. She’s not there a lot, but when she is, she always brings something – whatever that something may be. Talking about her might bring out a few spoilers so I will avoid doing that.\\n\\n\r\nENJOYMENT: 6\\n\\n\r\nThere are a lot of things that go wrong with CSR. The ending is way too rushed, the point of the story is none-existent, all that “revelation” during the end makes absolutely no sense (Chosen for what? By whom? Eh?), characters are average at best and on and on. Still, it’s not that bad. CSR has its moments and due to those moments I give it 6. Especially battle between two students of the same school; up until one suddenly became OP, it was quite enjoyable. \\n\\n\r\nOVERALL: 7\\n\\n\r\nNothing great, but still solid viewing. It kept me on my seats for most of the time but the ending was flat out bad. Twists made no sense, revelations as well and all in all the show lacked certain impact *cough*death*cough* to get anywhere else (no, seriously, I haven’t seen a single person die on the screen even though there were indications for that which is kind of illogical since you’re fighting giant beasts for crying out loud). \\n\\n\\n",
            "date": "2013-05-06T12:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 96215,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=96215"
        },
        {
            "content": "When I watched this anime I kept getting reminded of Kaze no Stigma. I personally enjoyed Kaze no Stigma, but I know not all people share my sentiments. \r\nI felt that both KnS and CSR were both good but not amazing, I would give them both 8's across the board in all categories.\r\nSome other reasons why I was reminded of KnS\r\n     -Very overpowered MC\r\n     -Producer died, leaving the show somewhat incomplete\r\nI've heard some way that the anime adaptation of CSR felt complete at the end, but I felt like there could have been more. My friend whoread the manga said that the anime does not encompass the entire manga. I would have liked to see more, but I don't think there is any hope for this anime to be continued, so if you finish the show wanting more, then you have to switch to the manga. \\n\\n\r\nStory 8/10\\n\\n\r\nThe story follows Layfan, the MC, and his new group of friends who are a team of fighters, who do sorts of combat competitions, but this is not the main focus of the story. The story takes place in a post apocolyptic environment where people live in cities encapsulated in moving domes (think Ergo Proxy if you have seen that). It is unsafe to go outside the domes because the atmostphere is unsafe and there are violent creatures called insectisoids that are very dangerous. \\n\\n\r\nArt 8/10\\n\\n\r\nPretty good, the combat animation is exciting.\\n\\n\r\nSound 8/10\\n\\n\r\nI liked the opening, and the sountrack is also decent.\\n\\n\r\nCharacters 8/10\\n\\n\r\nI liked all the characters, but I will only really talk about the main character. Layfan is really OP, but unlike lots of OP characters, he does not wish to use his fighting capabilities, he was to become a scholar of sorts. He is coerced into fighting again although fighting is what he ran away from in the first place. Layfan starts out pretty much already developed. We see how he progressed as a person through various flashbacks throughout the show.\\n\\n\r\nEnjoyment 8/10\\n\\n\r\nI found the action sequences exciting, the interactions between the characters interesting. I wouldn't really say that it had slow parts.\\n\\n\r\nOverall 8/10\\n\\n\r\nI would recommend watching this!\\n",
            "date": "2015-07-05T14:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 192428,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/showandAG",
                "username": "showandAG"
            },
            "url": "https://myanimelist.net/reviews.php?id=192428"
        },
        {
            "content": "An average show from the beginning to the end.\r\nWhether it's the story, the characters or the soundtrack Chrome Shelled Regios wasn't able to surprise in no moment at all.\r\nThe story is quite simple and it could have actually surprised if it was well managed. \r\nIn a future where the world is destroyed, humans live in dome-looking cities that move around the wasted Earth's surface. The only beings that can survive outside the cities are Filth monsters which quite often attack the cities, making it necessary a military force formed mostly by students. The most powerful city, Grendan is where the main character, Layfon Alseif isfrom. After being involved in a troublesome situation Layfon moves to Zuellni where he expects to start a new life and forget about his past. He meets the Student Council President Karian, who forces him to join the 17th Military Arts Platoon, leaded by Nina Antalk and thus his adventures begin.\\n\\n\r\nHowever, the excessive focus on unimportant things made the anime lose track real soon. The Heaven Blades were just for decoration, the \"engrish\" side story made barely no sense at all and the way the things were \"explained\" all in a rush in the last few episodes was far from being satisfactory.\\n\\n\r\nThe art is decent, at most. The character design annoyed me and the sceneries had nothing special to it. The action scens are quite lame, too. The soundtrack was the best part on the anime, even though it was miles away from being remarkable and it sometimes felt out place.\\n\\n\r\nThe characters is where this series could have saved itself but it ended up being its doom. Besides from Layfon, Sharnid and Nina the other characters had barely no development at all and all acted like perfect cliches. They just kept popping here and there for no particular reason.\\n\\n\r\nOverall there's no reason I can see to recommend this anime to someone, it's just not worth the time.",
            "date": "2011-01-09T07:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 33590,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18037.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Adanadhel",
                "username": "Adanadhel"
            },
            "url": "https://myanimelist.net/reviews.php?id=33590"
        },
        {
            "content": "CRS is a bit strange. It starts as post-apocalyptic military anime,then it becomes a high school one,then a harem,then again military.Throw in some romance,battles,plotholes that remeble ligth devouring singularities and you have an idea of how things work.\r\nThe story really is all over the place. It is filled with various sub plots that never come to a conclusion and many,many attempts to explain how things work in its universe that never come to fruition. Seiriously, whats the deal with moving cities?How everything became what like that?Why there is a mini-anime within the anime?I guess we'll never know.\r\nThe characters are lost in the plot desert.The onlyintersting one is Layfon,the main character who presents a development and the most interesting scenes in the anime(the figthing scenes).The others are from mediocre to annoying,especially the fiiler characters,whose only job is to adore Layfon.\\n\\n\r\nThe animation is truly confusing.The battle scenes are very well made,while the majority of other are dull and poor.The scenery though is quite beautiful,which shows that the studio could draw,but it was too bored to do so.The best part is the mini-anime,which shows the story of an Alucard-look alike and Shaya,the ainigmatic girl with the best weapon in town.The animation is exceptional and i would rather watch this than CRS.\\n\\n\r\nOverall,CRS shows potentails that never meet,is poorly made,with unclear story that you are not sure where it si going(if going at all).Try it only if you are wiiling to do some digging to find out more,or simply you want a super power shonen if you have everything else.",
            "date": "2013-05-10T03:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 96607,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2454389.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/njjn",
                "username": "njjn"
            },
            "url": "https://myanimelist.net/reviews.php?id=96607"
        },
        {
            "content": "Before I review this I just want to state that this is my opinion and you may agree or disagree at your own will.\r\nReview:\r\nChrome Shelled Regios was described to me as a diamond in the rough and that I should give it a shot. Let's start with the intro. The intro in my opinion fit the anime but the song itself wasn't that good. The animation was well done for the anime. Next is the characters. The MC confused me throughout the anime. I just couldn't get a feel for him. Was he supposed to be the cold, dark kinda character (for example Shiba Tatsuya)or was he supposed to be the OP but light hearted character (for example Kirito). Never the less he was a very bland character who was so over powered that every fight wasn't worth watching because you know he is going to win. That being said the MC being as overpowered as he was made the side characters worthless. Every side character either got in his way or got the MC hurt because they were good for nothing. The story was really interesting but everything else just killed it for me. All in all I would say that Chrome Shelled Regios wasn't a Diamond in the rough but more like a needle in the haystack because once you spend you're time on it and find it you're like yep that was pretty pointless.",
            "date": "2015-12-24T01:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 206641,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983432.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aisuokami",
                "username": "Aisuokami"
            },
            "url": "https://myanimelist.net/reviews.php?id=206641"
        },
        {
            "content": "Chrome Shelled Regios is a very confusing anime, considering that they tried to rush and cram everything they could from the story line of the manga into twenty four episodes. Theres alot of things that were left out in the anime that leave you very confused. But don't let that turn you away from it! If your looking for endless battles, disgusting monsters, sprinkles of romance, and post-apocolypse type animes this is definately one to look into. I for one couldn't help but go through the anime in only three days time. \r\nThe reason I loved this anime was because of how beautiful the animation,effects, sound, and character development was. Overall I give this anime:\\n\\n\r\nStory: 7 Good\\n\r\nArt: 10 Outstanding\\n\r\nSound: 9 Great\\n\r\nCharacter: 8 Very Good\\n\r\nEnjoyment: 9 Great\\n\r\nOverall: 9 Great",
            "date": "2010-01-09T14:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 22234,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/113472.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChibiYaoiOtaku27",
                "username": "ChibiYaoiOtaku27"
            },
            "url": "https://myanimelist.net/reviews.php?id=22234"
        },
        {
            "content": "Chrome Shelled Regios is one of those animes where it isn't rated low because of what was bad about it, its rated low because of what wasn't good about it. In nearly all categories Chrome Shelled Regios is what I would call a mediocre anime.\r\nQuick Pros and Cons\r\nPros:\r\nDecent back story to main character\r\nThe setting and idea of the story was pretty cool even if it wasn't executed very well. \r\nIt was good enough that I actually finished it and didn't completely drop it lol.\r\nCons:\r\nThe action in the anime is scarce and what it is seen its okay at best.\r\nThe characters are either unlikeable or feelas though they have no personality to them what so ever. \\n\r\nThe animation is meh (best way I can describe it)\\n\r\nThe last battle of the anime is the simply put a disappointment. \\n\r\nThere were so many opportunities to capitalize that could have made for good scenes that just didn't happen.\\n\r\nWeird English talking parts that make no sense at all to the story. \\n\\n\r\nNow on the actual review. \\n\r\nChrome Shelled Regios follows Layfon, a high school age student who has just arrived at a new Regios to start his new life. The setting of the anime is pretty interesting, it is a post apocalyptic world where all of the outside world is polluted to the point of being uninhabitable and the surviving people live in moving cities called Regios'.  Layfon used to be a Heavens blade, one of the 12 strongest warriors in the entire world, but he is kicked out and decides to start anew. \\n\\n\r\nNow this is where things start to go wrong for Chrome Shelled Regios. Firstly the story is extremely disjointed, you don't even know the main plot of the story until half way through the anime, and after that it's still bad. There are parts in the story that COULD HAVE been good but were just executed horribly, like when Nina, Layfon's platoon leader finds out Layfon is a former Heavens blade, her reaction is so plain I'm almost positive a brick could've showed more emotion then her. Then possibly the worst part of the entire anime, is that throughout the show there are clips of what seems like a different show but when you're watching it you're not really sure but the people are talking English but you understand them even less because it's like some computer 100000mph type talking that has absolutely nothing to do with the show. Hard to understand I know but that literally takes up like 5 minutes of every episode and then at the end they try to tie it all together to make sense but It's just done horribly. You have to watch the show to understand, but I wouldn't recommend it. The final fight is also a joke, not going to spoil anything but its literally a One hit K.O. final fight, yes, can't get anymore lame then that. \\n\\n\r\nThis is one of those shows where I would watch it if there was literally nothing left to do and nothing else to possible watch but I wouldn't recommend to anyone, just pass up on this one.\\n",
            "date": "2013-04-09T15:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 93199,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2347993.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Caprisun",
                "username": "Caprisun"
            },
            "url": "https://myanimelist.net/reviews.php?id=93199"
        },
        {
            "content": "This is a great show. Chrome Shelled Regios is a fantastic show that surprised me with its semi-originality. The show is pretty unique in that it attempts some things that many anime's shy away from.",
            "date": "2011-04-22T21:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 36345,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jh1902",
                "username": "jh1902"
            },
            "url": "https://myanimelist.net/reviews.php?id=36345"
        },
        {
            "content": "Chrome Shelled Regios - It has a strong start, gets slower in the middle and ends with a almost half decent ending that kinda lets you agree with it but get kinda pissed.\r\nThe story itself has an extremely strong start which would either attract, or push the viewer away. If your one of those people that watch for the action, or story. This is a good watch for you. Overall the decency of it and actuall play through would be satisfactory for anyone. The only problem for this anime is that the ending itself left alot of loose ties that needed to be fixed. Thisanime has a great underlieing story and truth to it.\\n\\n\r\nA total must see for anyone regardless of age. It has the critical elements of any great anime; Action, Love, Comedy and of course that thing everyone loves - the journey of a good looking, smart anime guy with a realistic outlook.",
            "date": "2009-11-22T17:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 20758,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261502.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Whoicanbe",
                "username": "Whoicanbe"
            },
            "url": "https://myanimelist.net/reviews.php?id=20758"
        },
        {
            "content": "Okay, first off the anime isnt finish yet so i cant really rate the story fully yet :P.\r\nStory:\r\nWell, its not the most original story in the world. Super powerful guy did something wrong in his past. Trys to go to school and be normal but doesnt end up that way, gets dragged into the military part of the school. the story deffintly isnt the strongest part of this show :P\r\nArt:\r\nThe art is great, the character's are all drawn very well, the backgrounds are kinda plain at times but, the characters, weapons,etc are done great so you dont really care that much about the backgrounds.(And alsoyou cant really have great background art when there are ltos of deserts).\\n\r\nalso the fighting is drawn really well.\\n\\n\r\nSound:\\n\r\nare pretty good. nothign outstanding here, you here the DITE's(weapons) clash together and whatever, you kinda feel like you here the same sounds over again at times tho.\\n\\n\r\nCharacters:\\n\r\nIs where i think the anime is best at you really get into the characters and i have yet to find someone i dont like, they are all very interesting and most have some good story to them :)\\n\\n\r\nEnjoyment:\\n\r\nIts really fun to watch the fights see all the diffrent DITE's and it has a good amount of blood in it(for a 13+ anime).\\n\r\nbut i wish there was a little bit more fighting(my personal opinion)\\n\\n\r\nOverall:\\n\r\nGreat show. nothing else to really say about it. its not the most original but it still feels fresh at the same time. watch the first 3 episodes if you dont like it by then just drop it.",
            "date": "2009-05-07T17:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 14867,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/79139.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fufuzilla",
                "username": "Fufuzilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=14867"
        },
        {
            "content": "An Amazing Harrem MC OP anime. It was one of my favorites to watch. And it has been the one i have rewetted 4 times now. Yes, it is that good. \r\nIts set in a post apocalyptic world where legendary sword users fight to protect the innocent. its a great anime to enter you into the world of Harrem MC OP anime. \r\nThe pros: Storyline is good. I wish they had continued with the series after one season, but it didn't get the response Japan was hoping for (I'm guessing). The character development was also good. You wanted to see what would happen next!\r\nCons: Someparts of the storyline were hard to understand first time around. Unless you watch the anime 2-3 times, you won't understand some of the references. Don't get me wrong, i liked it a lot. It was just confusing at times. \\n\\n\r\nOverall i rate this a 10. My reviews probably don't make sense to anime enthusiasts, but these are for the other people. Like me.\\n\\n\r\n-JNutter3006",
            "date": "2016-01-14T21:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 208543,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875813.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JNutt22",
                "username": "JNutt22"
            },
            "url": "https://myanimelist.net/reviews.php?id=208543"
        },
        {
            "content": "I dare to call this anime a hidden op and also its an anime which could have been so much more sadly the anime creator died(suicide) so this is what i have to review. \r\nChrome shell regios isnt your typical post apocalyptic anime. This anime takes super powers to another awesome level yet it doesnt make it feel overly filled with things. Why, i already said it felt unfinished so why in gods name am i giving it an 8. \r\nThe story has is good and well made. Its mostly centered around one of many havens that humans had to evacuate to after earth gotso polluted that you couldnt walk outside unless you wore special gear. It has it focus on the character that deserves it meaning the character and it gives everyhing to make him feel as powered up as he should. Its not like he has 5 minuts of fame in one sec and gets shitty througout the rest of it. No the main character is someone you can actually feel from start to finish feels good. 2 things that ticks me of with the anime though which i blame the creator of the anime death is that there is alot to explain  and there is alot more that could have been shown but unfortunately it didnt. How they use their abilties is for me unique for many types of anime eventhoguh it feels like some magic thing from other anime you instantly knows that this is something different. This focus on the inner pure strenght that people builds up as they go, \\n\\n\r\nThe opening and endings are beatuful and great in its own way if you dont watch the anime atleast watch the openings and endings. \\n\\n\r\nIm the kind of guy that loves a strong main character of course the thing about him being liked by some girls can be a reacuring thing in some anime. This doesnt stretch it as far as other anime have been. The supporting characters also have their own problems but they also their own ways to make you like them. Again we never really get to know the whole picture which is why i will say what i see. \\n\\n\r\nIts one of those anime that i think has a place among the cult anime if there ever are ones. Anime that never get finished but could have ended great or anime that simple had a great consept but never was able to show it. Yet i loved it because of how fun and easy it was to watch.\\n\\n\r\nSo overall i feel this is an anime you should watch if you want to watch something that gives of a cult feeling and gives of a feeling of having a great beginning though the missing pieces might break this anime for some which is why i will say it might not be for everyone but for me its great and has a special place as one of those anime that i cant forget. 8/10",
            "date": "2016-10-12T13:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 231675,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=231675"
        },
        {
            "content": "I honestly really enjoyed it. \r\nIt's not a new setting at all - a post-apocalyptic world, some sort of walled cities to keep people safe, monsters outside. If that is your thing, you definitely should give it a try. (Reminds me a lot of God Eater)\r\nIt does not rely much on a deep story. The characters aren't developing much, instead they mostly are already well-written from the beginning. It relies more on revealing the past of the characters, explaining why the are like they are, and getting to know eachother, rather than having a huge development throughout the series.\r\nIt's action based, some romance (one-way though,since the main character doesn't realize anything at all) and often also pretty funny.",
            "date": "2018-04-12T03:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 277839,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7157568.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Leyren",
                "username": "Leyren"
            },
            "url": "https://myanimelist.net/reviews.php?id=277839"
        },
        {
            "content": "Where to start? Hmm. Let's go from good to bad.\r\nAction is fairly decent. It's got a mix of sword fighting and energy attacks against humans in controlled competition and monsters in a desperate bid for survival. Fighting revolves around skill and use of \"kei\" which is their energy/mana. The protagonist is quite OP compared to most of the characters because he can copy anyone's techniques. He also is a very accomplished fighter who traveled to a relatively peaceful city, further widening the ability gap. Overall, fairly enjoyable.\r\nArt and Sound are nothing special. The music is alright. It won't be on any playlists but could havebeen a lot worse. The show went for a rising action plug theme to be reused whenever needed. Jesus. I thought the animation was older than that. It's only from 2009 and doesn't remotely hold up to recent works. It's not very appealing and the characters feel boring to look at. This probably says more about budget woes than Zexcs's talent. \\n\\n\r\nStory has a decent premise. Why things are like they are is never explained. This includes city origins, kei, monsters, along with strange characters and events scattered through the show. The plot is simple and revolves around saving the city from danger. Don't look for a grand reveal or destined purpose because they don't exist. \\n\\n\r\nCharacters are crap. Layfon is one of the more disappointing MC's I've ever seen. As a viewer, I don't care what happens to him. His past is not interesting and his actions are uninspiring. Supporting characters are equally terrible. Each has exactly one character trait and nothing else. These are the stubborn leader, the lazy upperclassman, and the withdrawn prodigy. Another complaint is that the MC gains a quasi-harem. The girls don't compete or actively vie for his heart, but somehow manage to annoy me.\\n\\n\r\ntl;dr \\n\r\nI recommend this to action enthusiasts who like to watch OP characters. Anime newcomers might find it enjoyable and critical reviewers should stay away.\\n\\n\r\np.s. There is a book series. If anything it is more disappointing.",
            "date": "2016-08-21T23:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 227309,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5443773.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ToonShiba",
                "username": "ToonShiba"
            },
            "url": "https://myanimelist.net/reviews.php?id=227309"
        },
        {
            "content": "Ive watched 12-24 episodes and so far it looks awesome most animes Ive seen along similar plots end up boring because of lack of character development but so far this one is great the art style being similar to Code Geas.  The main character with a secret past and lots of action. there's not much of a way to explain this anime  id say watch it at least until episode 3",
            "date": "2009-04-06T08:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 13914,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65521.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/toaster501",
                "username": "toaster501"
            },
            "url": "https://myanimelist.net/reviews.php?id=13914"
        },
        {
            "content": "All in all a good series. Good plot, nice charecter developement.though it couldve been a little longer. 24 episodes just wasnt enough fro me... but i digress. still a good seriesand i highly reccomend it to any anime fan. What more to say?",
            "date": "2009-07-01T19:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 16332,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201488.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Narudude2",
                "username": "Narudude2"
            },
            "url": "https://myanimelist.net/reviews.php?id=16332"
        },
        {
            "content": "I really hope there is a second season because this anime was really good, I liked the most the interaction among characters and the hero representation of Layfon, he had made mistakes but he still is/ was a hero.\r\nThe other characters I like a lot too, but we definitely need to see and learn more about them. Second season is a must!!!",
            "date": "2009-06-21T12:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 15956,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kantaranas",
                "username": "kantaranas"
            },
            "url": "https://myanimelist.net/reviews.php?id=15956"
        },
        {
            "content": "loved it.\r\ntelekinesis's, heaven's blade user's, platoon's trained in combat fighting of giant insect beasts & a great storyline to boot, need i say more..",
            "date": "2012-03-26T08:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 56959,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/schtoop",
                "username": "schtoop"
            },
            "url": "https://myanimelist.net/reviews.php?id=56959"
        },
        {
            "content": "Chrome shelled regios is a scifi, action and romance anime. Its pretty good though they never finished the story due to the writer dying to heart disease. I liked the action and its ideas. It would've been a good anime",
            "date": "2012-09-23T22:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 73131,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1534345.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LovelySilver",
                "username": "LovelySilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=73131"
        },
        {
            "content": "*First Review* You've been warned!! XD\r\nThis anime was very enjoyable. If you like a slice of comedy, action, and I guess another clueless protagonist that don't know a girl is into him, then you will probably enjoy this anime! The action scenes were quit enjoyable and well played off because as the story progresses, it reveals a bit of the strength that the main character Layfon hides, leading the audience(you) to either in awe, like dang did that just happen or wow really that was predictable but really its just all up to your taste, but for me it was like yep that was prettybadass lol. Although it does seem cliche that the main character uses his power to save his friends, you just got to accept it!! lol I mean c'mon who wouldn't try to do there best to save someone!! Overall I give this anime an 8.5, it was very enjoyable, but not to the extent to its full potential. The characters are likable such as Felli Loss one of Layfons team-mate, she is probably why the show has its comedic acts, but yea I feel like other characters such as the heavensword weilders or w/e they're called could've been improved in the plot.",
            "date": "2013-05-25T21:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 98433,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2576697.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/asdfghjkllkjhgfd",
                "username": "asdfghjkllkjhgfd"
            },
            "url": "https://myanimelist.net/reviews.php?id=98433"
        }
    ],
    [
        {
            "content": "Honestly i really, really wanted to love this anime, and ill give that there were moments of greatness in Chrome Shelled Regios, sadly most of the anime was average at best.\r\nStory: 6- The story was pretty much nothing more than your standard shonen plot, nothing very original here.\r\nArt: 5- The art is probably the worst part of the anime, at some parts it was pretty decent, however often it was pretty Mediocre and also the character designs weren't very nice to look at.\r\nSound: 8- BY FAR the best part was the Sound, both the japenese and english dubs were flawless and the opening and endingsongs were amazing.\\n\r\nCharacters:7- Most of the characters weren't anything noteworthy, i enjoyed their interactions together but they were fairly generic characters.\\n\r\nEnjoyment : 5- I was never extremely bored watching this, however i doubt ill ever watch this again.\\n\r\nOverall: 6- Chrome Shelled Regios is plain and simply OK, nothing terrible, but its not very good eithier.",
            "date": "2013-08-09T14:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 108971,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2698755.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SakurasouBusters",
                "username": "SakurasouBusters"
            },
            "url": "https://myanimelist.net/reviews.php?id=108971"
        },
        {
            "content": "I find this anime decent to kill time got a reasonable storyline with some fighting scenes i would give it a 7/10. btw holy molly 7.77 rating as its 2/27/11 atm lol so pro.",
            "date": "2011-02-27T19:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 34798,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/351144.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Heavenforge",
                "username": "Heavenforge"
            },
            "url": "https://myanimelist.net/reviews.php?id=34798"
        },
        {
            "content": "\"Chrome Shelled Regios\" is not a how-to guide to surviving the apocalypse. It's set in an apocalypse sure, but that isn't the point to this anime. If you look at it that way, you'll just end up wasting your life watching this. This is a story of people who are called to duty, due to their skills, but they want to make something more of their lives. A story of defiance, and of sacrifice, it just happens to be set in a post-apocalyptic world.\r\nStory: 8/10\r\nWonderfully played story. As I said earlier it of defying ones so called destiny, but it's also about serving the greatergood at ones own expense. These two paradoxical themes intertwine themselves within the cast bringing complications to the story that were really enjoyable. There is also an undertone of a love story that spreads itself out wide, and while it does affect the cast, the writers don't allow it to take over and become the primary theme, like the pitfall of so many other anime. Beautifully done story.\\n\r\nMy only concern in regards to the story is it often times was all too predictable. It never claimed to be a mystery, but a few more plot twists couldn't hurt.\\n\\n\r\nArt: 10/10\\n\r\nGreat affects, dazzling color, and wonderful symmetry. The cast is drawn exquisitely, no one feature is too overbearing, and all main characters and primary supports are in no way generic. The contaminoids, who are supposed to be torn and twisted, look torn and twisted, rather than a dog with an exceptionally large wart. The action sequences are great to watch, the frame count must be on par with DBZ. Visual candy is all there.\\n\\n\r\nSound: 10/10\\n\r\nThe sound is only 10/10 for the English dubbed version. Don't watch the original, the pitiful excuse for English in \"The Legend of Regios\" will make you want to vomit. That said, the dub is great. Felli's voice actress, who actually has a rather sweet voice, pulls off the depressed Felli beautifully and brings a human element to her character the show was aiming for anyway. The opening and ending themes are fun to watch and listen to, well choreographed opening, really fun to watch. The soundtrack is what is most impressive, varying from high tempo action scenes, to slow paced dramatic moments, the sound is all its own, nothing generic here.\\n\\n\r\nCharacter: 10/10\\n\r\nWell developed characters, the protagonists have nice crisp story lines that reveal themselves in time and the secondary characters are developed quite well as well. Mystery hangs over many characters, but it is well played and all that the viewer needs to know, they know. Also the past of the protagonists isn't just slammed in your face all at once. As the story progresses, the characters past is revealed bit by bit, which is impressive and uncharacteristic for an anime of a single season.\\n\\n\r\nEnjoyment: 10/10\\n\r\nTruly a fun show to watch, the action will keep your eyes glued to the screen, and the comedy will keep you laughing.\\n\\n\r\nOverall the show feels a lot like Final Fantasy VII, minus the Sephiroth and black dude with a gun. That may be because Layfon is just a brunette Cloud. But seriously, watch the dubbed version, though it may be hard to find.",
            "date": "2012-01-15T13:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 51863,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1082525.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ziggyopolous",
                "username": "ziggyopolous"
            },
            "url": "https://myanimelist.net/reviews.php?id=51863"
        },
        {
            "content": "I'm gonna start off off topic. I was watchin x-men last night and a continued subplot is how Rogue and Gambit can resolve their intimacy issues, because she can't touch no one. Why that nigga gambit did'nt just weara fuckin condom baffles me. Now thats out the way ill talk Chrome Shelled Regios. This was the first show where I wasn't put totally off by the fan service. Keep in mind I hate fan service, even though im the type of guythat never hesitates to glance at a girl's breast if shes not paying attention. I watch porn at work and force coworkers to watchporn I put on my iPod. That being said, bein the dirt bag that I am I don't like the idea of the writers and directors bein in on it with me. Its corny when they take time to draw a cartoon up skirt. What type of shit is that? but this show did it the right way. I can't quite put my finger on it but I think it was because the fan service was gratuitous, but was at appropriate times. For example there will be really tense moments and then they'll just show some nice knockers to diffuse the tension. Well thats it beside that I thought it was a sub-par show with  predictable stereotypical characters. Really its like a 5 overall minus some fan service and descent visuals.",
            "date": "2011-03-07T13:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 34948,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/250722.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gang_Orca",
                "username": "Gang_Orca"
            },
            "url": "https://myanimelist.net/reviews.php?id=34948"
        },
        {
            "content": "This anime series was recommended to me some time back by ours truly @Xoiea. After reading the description I pushed some of his other recommendations ahead of this series but like I have said here before descriptions often downplay the plot and anime as a whole as is the case with Chrome Shelled Regios.\r\nThis series is about a hero with past inner conflicts fighting for what he believes in a world now overrun with a ruthless alien race. As his past catches up with his new life how will his newly acquired comrades react and how will he deal with the pressures as he journeysforward.\\n\\n\r\nEven my above description though a little more mysterious and open ended than what is posted on MAL and especially on Netflix I still would have to say even it pales in comparison with the overall Anime.\\n\\n\r\nI praise the work of the artists on CSR in not only portraying advanced yet historic feeling cities, but even the depth of the barren landscapes, and the clean edges of the lighting effects. The characters also were greatly animated And portrayed in the script and by the voice actor each giving their very own emotion and background which is not always common in a 24 episode series with a plot such as this one.\\n\\n\r\nThe plot and script are action heavy but hey, this is an action anime with romance as a second. Though you begin to feel the sparks between characters and a harem of sorts begins to form you are quickly pulled back into the story of the Heros fight within himself and with the aliens. The plot has depth which involves intermingling stories from differentiating perspectives, a long line of characters including supernatural beings, and even a multitude of cities all with their own character and politics inside and out.\\n\\n\r\nMy only gripe with this series is that the last 3 episodes felt very rushed. I appreciate all the work the story writers went through to develop relationships between the characters which adds an emotional connection to the plot however I feel this could of been fixed by trimming 1-2 episodes worth of material from the front half of the anime and there by better allow the plot to unfold in more appropriate and better drawn out time at the end to cleanly finish the series.\\n\\n\r\nThis series I give and 8/10 and highly recommend it to those interested in action heavy anime with a mild wisp of romantic developments between the characters. Though i did thoroughly enjoy this series it will not break my top ten because in my mind it is a few episodes or even a season short of adequately fulfilling all sets needed on this complex of a plot to become a masterpiece.\\n\\n\r\nPOSTED BY: @GameJok3r\\n\r\nhttp://animejok3r.tumblr.com/post/10118547702/chrome-shelled-regios",
            "date": "2011-09-13T11:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 43271,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43271"
        },
        {
            "content": "When you think about it; it's kinda uplifting for the spirit. Civilizations traveling in moving cities; defending them from grotesque monstrosities and such. And the existence of spiritual entities that keep these cities running.\r\nAnd then there are the characters. Whilst the lot of them come off as serious and bad-ass, this show is STILL MADE BY THE JAPANESE. So the loli must reign over all whilst the guys (in the spotlight) must fail at life.\r\n(Get used to it. My personal opinions about this theme is never going away.)\r\nWe also get treated with that \"Show Within A Show\" theme: the \"Legend of Regios\" where the Japanesecast speak Englese. It's \"what happened in the past,\" it's \"a show the main characters are watching.\" Is Saya related to Achellia? Can Aileen write Saya 16 bars? (Dat last one'za joke.)\\n\\n\r\nAt the same time, it's kinda sad. The people behind the show focused on making characters that are cool, memorable, and non-pansy-ass. Unfortunately; the art of \"counter-programming\" will be a lost one under the tirade of otaku-pandering.",
            "date": "2011-11-22T00:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 47853,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=47853"
        },
        {
            "content": "Chrome shelled regios is a decent anime though there are areas that could be improved. It begins with a high school male character named Layfon who is apparently attending a new school. He as a dark past as an orphan who struggled in his early years and did things he regrets in order to get by. He has a past in military art buts is planning to attend school studying 'general studies'  in a regios separate from the one he grew up in but is basically forced into the military division by  the obstinate school president and reluctantly joins a platoon where theanime takes off from. The highlight of this anime is that it is fast paced but rarely confusing or undeveloped and there is a good amount of battles and  conflict for the action enjoying viewer. The is also some comedy mixed in as well to add to the appeal. The setting is in a post apocalyptic timed period where regios are ultimately mobile cities cotrolled by a spirit that steers and powers it but life in the regios is not very different from modern society for the most part so it is easy to relate to in many areas. The draw backs are that  Layfon is the main character and he is also the main source of everything. He is the only one who can fight, is the clueless guy every girl loves, and is almost kind of depressing because he goes about everything alone. Also, the setting isnt very creative for that time period. Overall, Chrome shelled regios is anime you will either really like or really dislike, but if you think that you will be of the people who really liked it then i reccomend it for sure.",
            "date": "2014-06-11T20:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 146703,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3715147.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/chidoristream506",
                "username": "chidoristream506"
            },
            "url": "https://myanimelist.net/reviews.php?id=146703"
        },
        {
            "content": "first I have to say it is a good anime if you did not read the manga first.\r\nThe manga is way better, however on online sites it was cancelled. \r\nThis anime trows everything that was good about the manga away and created its own story and is uncomfortable to watch if you read it. Also the flow of the anime, why layton for example chose in ep 5 to fight was completely  erased which made the flow akward.\r\nSo I am really disappointed and I was hoping that I could get more out of the anime because the manga was discontinued after chapter 12.",
            "date": "2014-08-10T13:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 156079,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/660495.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/noekkie",
                "username": "noekkie"
            },
            "url": "https://myanimelist.net/reviews.php?id=156079"
        },
        {
            "content": "Chrome Shelled Regios is like a good summer blockbuster movie.  Not much thinking required and if you don't expect too much you will really enjoy it.  Does it have plot holes and some unexplained things? Sure but nothing that will really deter you from enjoying the ride all the way up to the ending.  I really enjoyed its simplicity and comedic elements.",
            "date": "2012-06-03T03:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 62533,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1092965.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RavenSage",
                "username": "RavenSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=62533"
        },
        {
            "content": "I decided to watch this on a random day and yeah, a short review. \r\nStory: 7/10. \r\nThe story did not interest me nor I really understood it until I watched it. It wasn't catchy but then I still follow through. This type of story seems to be done before. But then there are some parts that they could really improved on, its that 'they couldve done so much more' . Such as, strengthing platoon 17 and their teamwork would be good. Or something else. Because this whole 24 episide seems to be like the beginning of a longer anime, basucally an arc of one though. Especiallythe last episode seemed like it there was going to be more.  And the harem, plus a lil ecchi included. I wasn't really fond of it but then it doesn't take away the story.. \\n\\n\r\nArt: 7/10. \\n\r\nThe art wasn't too bad. The thing that stood out to me the most were the eyes.. like the black ring around the eyes and all... there were moments when they fought ans some scenes were smooth and liked that. \\n\\n\r\nSound: 9/10.\\n\r\nOne of the best in the anime. When the fight scene comes on, or any cool scene, the music makes everything much more exciting. I like the ending songs. \\n\\n\r\nCharacter: 6/10. \\n\r\nWe were introduced to our characters and yet no development. We have a mystery of layfons past and once we get to know more bout it, its like 'ohhhhs, that's it'? We have felli, who obviously likes layfon, and well we know she tries ti find her path, but then theres no development about it or her charcter, or her powers.. especially with captain in platoon 17. They couldve made her stronger . Basically, everyone should have more development, bout their past and it makes them move on becoming stonger. And btw, I wouldve liked to see more of Dick. \\n\\n\r\nEnjoyment:7/10. \\n\r\nWell surprisingly,  I wssnt so bored with this anime. And each episode seemed to kove on the right pace because each episode went on pretty fast. The music also added in the excitement.  I kind of forward the romantic parts and to the action scenes instead. \\n\\n\r\nOverall: 7/10\\n\\n\\n\\n",
            "date": "2014-01-15T16:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 128921,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3220845.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kosourbites",
                "username": "Kosourbites"
            },
            "url": "https://myanimelist.net/reviews.php?id=128921"
        },
        {
            "content": "The story in this anime was great. The plot flowed well and the story didnt jump around in my opinion even if in the end it was rushed. However I think the rush surved a pupose here. After all with all the action and everything that happened in the end it only makes me want to watch more and I am hoping now for a second season. \r\nCharacters in this story is like in a lot of animes. The main character is a strong male that saves everyone however there are things that set it apart from thoughs anime. One thing being that unlike themain stream anime with a lot of dumber and thick main characters, Layfon(Protagonists name) is actually smart when it comes to something. Though he is still rather dence when it comes to girls but hey whats a main character without that?\\n\\n\r\nI was surprised at one of the main females Felli. Her character is something that while seen before, (An seemingly emotionless young girl) was set apart by what she is going through and honestly a whole new anime could be made just based on her personality.\\n\\n\r\nThe art was great and I have to say that the fights were some of the best I have seen. Even when streaming online they still showed clear with must tell you something right? I had some little problems every once in a while but nothing that would bring the score lower then what it is.\\n\\n\r\nPersonally I didnt really like the soundtrack. It was ok but then nothing set it apart from any other anime in my opinion. it was simply average with for my makes no differnce because the onlt time I even bothered to listen to the soundtrack was so I could write this part of the review. After all with so many other better things to think about when it comes to this anime why would I pay much attention to the sound. \\n\\n\r\nWhen the sound begins to go into the vioce choice for each character nothing could go wrong. The people choosen were perfect for there roles and there couldnt be anything better. The other sound that took place during the fighting were goood too.\\n\\n\r\nMy enjoyment and overall are together because they mean the samething to me after all my enjoyment comes from what I think about the anime overall right? And overall this nime has everything that it needs to go at it with the rest of them, action, adventure, a great plot, awesome fighting seens, and even a little romance on the side. What more could you want",
            "date": "2012-02-19T10:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 54181,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155883.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/firefull12",
                "username": "firefull12"
            },
            "url": "https://myanimelist.net/reviews.php?id=54181"
        },
        {
            "content": "The pilot - here the first episode - is probably one of the worst anime pilot I've ever seen. Everything in it advertise everything the wrong way : the sound/music is uselessly loud, inelegant, and cheap. Graphisms are, at best, unbalanced. But the worst come with the clichés (one every 5 sec) that will make you struggle to go past this first episode. And there's the funny part : while a pilot episode is usually done in a way that should trigger your curiosity to watch the show, here it is so BAD that everything that comes after it seems a little better ! Ihave no idea how they manage to do that.\\n\r\nBut the key words here are ... 'seems' a little better. \\n\r\nUnfortunately, this anime want to go in every possible directions, totally unable to carry its own weight and unable to focus on a single main plot that would have (maybe ?) save it from the train wreck, as it ends painfully in a wall.\\n\r\nSo here's a 5 score rank (I'm feeling merciful) with some little praise for some actions scenes but honestly, I'm not entirely sure it deserves even that. An anime easily forgotten, which in a way is a good thing.",
            "date": "2018-01-28T12:48:00+00:00",
            "helpful_count": 0,
            "mal_id": 269928,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477056.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mushimk",
                "username": "mushimk"
            },
            "url": "https://myanimelist.net/reviews.php?id=269928"
        }
    ]
]