[
    [
        {
            "content": "From the depths of fanservicy guilty pleasure of hell makes the return of High School DxD Hero. It’s been nearly 3 years since the last time this anime aired on TV and to be honest, it needed a break after the disastrous third season. High School DxD Born left a bad taste in my mouth after seeing how far the franchise has fallen. Is Hero a chance for the show to redeem itself?\r\nThe fourth season covers the volume 9 and 10 from the light novels. This didn’t come as a surprise as the franchise has a tendency to build more into the story with establishedconcepts. To say the least, the franchise isn’t afraid of taking the risk to show off its fan service. Straight from the first episodes, we see the characters return with Issei still being a perverted self-proclaimed “Harem King”. It doesn’t take long for the plot to kick off after they visit Kyoto where a new story puts him in conflict with supernatural entities yet again. \\n\\n\r\nFollowing a formulaic construction of the plot, the first half of the show adapts the 9th volume. We meet a fox girl named Kunou and after a misunderstanding, she pleads for Issei and the others to save her mother. The premise of this arc is incredibly straightforward after Issei realizes the responsibility they need to carry to get the job done. However, the arc is perhaps a bit too predictable and lacks the High School DxD-esque quality as the first two seasons. In other words, I must admit that a few of the first few episodes are too forced. The drama is too serious and didn’t make me care about Kunou as much as I had hoped for. On the other hand, there are still remnants of fun value we can see this season. The fan service returns thanks to the naïve personalities of characters like Xenovia and Irina. Even though Rias and the main cast aren’t there, Issei still gets a face of boobs, ass, and skinship. I say this with honesty that High School DxD is one of the few anime that works creatively well with the fanservice. Without it, the show would lose its identity. Luckily, the show does manage to find its way to bring that out again.\\n\\n\r\nCovering the 10th volume, this fourth season manages to find itself well on the path of its roots again. By the time you’ve reached over the half the series, the familiar mood will return almost like yesterday.  It also does a clever job at building up the inevitable battles as Ria’s Team goes up against Sairaorg Bael’s peerage. Remember, this franchise began with a concept known a “Rating Games” that has been a central element in the storytelling. This time, the stakes are more about pride to see which team is better. For Issei himself, there’s also some emotional stakes that he didn’t even realize himself. The fact that after three seasons, he’s still dense as a black hole should come as no surprise to viewers. In one particular episode, Rias directly confronts him about her feelings and we get a half-assed response from the guy. This may rub viewers in the wrong way as the relationship between Issei and Rias has been a central focus in the franchise. \\n\\n\r\nThe Rating Game itself also featured some comedic moments with the press conference buildup and the actual execution. There’s also some exploitation about the rules of the game to get viewers familiarized again. The actual battles felt more or less like a cheesy mix of underwhelming fighting. In fact, I would say most of them are insignificant that even includes Issei’s in the first rounds. The show only has 12 episodes so it limited itself from achieving full potential. To me, that’s a backstabber to fans of the franchise who wants to get the most from the action. Honestly, I think High School DxD’s action elements has always been one of its weaknesses and from season 4, that didn’t change much either. In some of the final few episodes, business picks up more as Issei confronts Sairaorg himself as we see how dangerous his rival really is.\\n\\n\r\nOne of the biggest changes of High School DxD Hero is the art style. The first three seasons were adapted by studio TNK that fans are familiar with. However, Passione takes the step this time to animate the project. They are perhaps best known for their work on Rokka no Yuuska and more recently, Citrus. I’m not going to lie, it’s going to take some time to get comfortable with it. The character models looks less detailed and cartoonier especially for the main girls. Don’t get me wrong though. Characters like Rias and Akeno still looks busty like the previous seasons. Even new characters like Yasaka gives the impression of a sexy older type. However, it will take time to get used to the new art style as there’s less details on the fan service. It’s still there especially if you watch the uncensored version with the boobs and ass being thrown at your face. The action still feels the same as the previous seasons though so don’t expect anything that will blow you out the water. Character designs in terms of plot direction improved slightly with an improved transformation of Issei. Similarly, character voice mannerism somewhat evolves this season that’s more noticeable in Rias and Issei. She is able to display her personality at best when together with Issei especially during some of their more emotional scenes. The theme songs still feature a mix of action and fanservice theatrics I’m sure fans are familiar with. \\n\\n\r\nWell it’s been nearly three years since I’ve reviewed High School DxD. After the break, I think this show manages to step up slightly up to the plate. However, it’s not a big improvement over the third season and more like a step down compared to the first two. The plot is both easy to predict but hard to recall memorable moments from especially in its first episodes. It tests the viewers’ patience for its main character cast especially with Issei’s role. I also have to say honestly that Issei deserved a personal beating from the way he responded to Rias in that one particular episode. Otherwise, I think the fourth season is still worth the watch especially if you’re a diehard fan of the franchise. High School DxD always felt like it’s about having fun with itself. In this season, there’s still moments that manages to find its way towards that.",
            "date": "2018-07-03T08:06:00+00:00",
            "helpful_count": 67,
            "mal_id": 282868,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282868"
        },
        {
            "content": "BOOOSTOOOOOOOOO!!!!!!!!!!!Another HSDXD Sequel has ended and shit doesn't  licensor funaimation ever get tired of putting up another sequel of this shitty thing, when this 4th sequel has taken 4 steps backward? Now, ok , this sequel has a different studio and it's under studio Passione, it may have a new character designer but the thing about this sequel was instead of moving forward with Issei's relationship with Rias, it rather took a couple of steps backward. Also the relationship of the guy's harem has taken a new twist were the harem itself no longer competes for the guys affection.The only that hasn't change wasthe guy's \"OPPAI\" rant, that was rather annoying that there isn't an episode where you won't hear the word \"OPPAI\", and what's worst was it even desecrated  a children's song ,now it has added child porn in it also the addition of new harem member in Ravel. The story may have been different but then again, it wa still the usual when we have Issei being this \"OPPAI\" Dragon is at first up against Cao cao and  his posses and the later Sairaog who is  just picking a fight and as usual it's up to Rias' pooses to deal with them just like in season 1, which I have to say the season 3's story plot was much better than this sequel . On the fanservices, nothing has change there is the usual panty service , boob service , swimsuit service and the usual onsen service, so frankly this sequel was still the same shit but different illustration so here were my ratings:\\n\\n\r\nStory- Poor 3: Basically the story plot was almost like that of one part from season 1 to one part of season 3, where this sequel has become bad to worse.\\n\\n\r\nArt-Good 7: I rated it for the sake of them you know who, out there whom were having a field day of seeing the kind of fan services that is the mainstay of this anime/manga. \\n\\n\r\nSound- Very Good 8: That was for the opening theme where it really does fit one element of this story plot \"SWITCH ON, SWIIITCH OOOOON!\"\\n\\n\r\nCharacter- Pathetic 1: Since Issei's relationship with Rias has taken a couple of steps backwards and he's no longer this harem king wanna be despite of those girls throwing themselves on him in their birthday suits. \\n\\n\r\nEnjoyment-Dreadful 2: I feel like that I wanna go there in Japan look for the people who made this sequel and give them a BOOOSTOOOOO amount of whooping in their asses.  \\n\\n\r\nOverall-Pathetic 1: Well by the looks of it another sequel is in the making when we see Azazel having a secret, that he doesn't tell Rias and her lackeys. So shit, shit and shit. \\n\\n\r\nOPPAI!  \\n\\n",
            "date": "2018-07-03T12:19:00+00:00",
            "helpful_count": 51,
            "mal_id": 282885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=282885"
        },
        {
            "content": "hey readers \r\nhere's my review of anime adaptation of wonderful light novel series i try to keep my review very straightforward and short covering only reason why you should give this show a try and why this season is much better than previous season's which is ruining the adaptation by only focusing on fan service and other mainstream shits rather than story\r\nstory:(9/10)\r\ndxd 4th season is adaptation of 9th volume of dxd LN Pandemonium at the School Trip \r\nIt has a nice plot and great characters that will attract you with their unique personalities its a wonderful story with wide no of different characters, setups andlocation combining large no. of mythical figures and legends such as angel demons gods of different mythology and legends dragon youkai etc and concept like apocalypse infinity dream creation etc in an awesome way .. its universe is probably you can say most vibrant and large as compare to any anime\\n\r\nThe ecchi scenes are hilarious. Some people say that the ecchi is exaggerated especially the idea of Issei being a pervert but as you watch the anime you will find that he is a great boy and usually tries his best to control his desires with girls (but he fails numerous times).Note that there are many animes that have more sexual scenes than it with a very weak plot ,so this anime does his job really very well\\n\\n\r\ncharacters:(9/10)\\n\r\nYou are familiar's with most of the characters as it is fourth season there are lot more romantic development lot's of new character's are introduced and there is lot of focus on issei's relationship with rias. As for Issei he goes from being an overly-perverted MC to a perverse, respected, beloved, mature and powerful MC who gives his all to protect his comrades and truly cares about all of them deepening his relationship with every one and forming new allies and also about ANTAGONIST introduced especially in this volume is diverse as the protagonists and several of them are antagonists you just love to hate them\\n\\n\r\nabout Issei's harem (∞/whats so ever...XD)\\n\r\nIse's harem is handled in such a wonderful way.every one is dynamic and got there own speciallity There's no crazy tsundere beatings or normal harem antics, just friendly competition amongst the girls for their spot in the harem. All the girls are just perfect. Every single one of them is so unique and they all play a huge role of importance in the series.\\n\\n\r\nanimation(7/10) and art(8/10) or youtube trailer..:P\\n\r\nwell its kind of decent animation i would not say its great like those of kyoto animtion or ufotable but its better than before as it shows light novel content perfectly so put it simply you get what you expected\\n\\n\r\nenjoyment:(8/10)\\n\r\nIt's hilarious, it's unpredictable, it's extremely intense, all the characters are fantastic, the ecchi and romance are wonderful \\n\r\nyou will enjoy all the characters especially ANTAGONIST as they are not just mindless freaks and got complex characteristics action is intense along with awesome fan service..:D\\n\\n\r\noverall(why you should watch it)(8/10)\\n\r\nHighschool DxD is in no way your ordinary ecchi series plot is brilliant with intense characters and astounding plot preserving story along with super power and harem echhi stuff which is quite rare. its really a good and refreshing show \\n\\n\r\nOverall Grade:\t8\\n\r\nStory\t9\\n\r\nAnimation\t7\\n\r\nSound\t8\\n\r\nCharacter\t9\\n\r\nEnjoyment\t8",
            "date": "2018-05-10T06:48:00+00:00",
            "helpful_count": 48,
            "mal_id": 280200,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6436371.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ta07",
                "username": "ta07"
            },
            "url": "https://myanimelist.net/reviews.php?id=280200"
        },
        {
            "content": "Boobies\r\nSweet, now I got your attention. \r\nAll right, if you are into High School DxD, you’re gonna like this. If you are not, then why are you still here? If you haven’t seen it, then go watch the other seasons first, otherwise you’re going to be clueless. \r\nIn fact, for those who have mostly forgotten, I’ll give a 4-sentence summary of what previously happened(Then I'll immediately get into the review.):\r\nIssei has the Sacred Gear of Red Dragon Emperor DDraig. He has become a demon of the Gremory Household, most of which consists of girls who are attracted to him. Already he’s gone up against numerousvillains, having his powers developed to the point of many different abilities, including control of a mecha suit. (Juggernaut being the unstable but powerful version, as can be seen in the recent special “Taiikukan-ura no Holy”.) \\n\\n\r\n(Characters)\\n\r\nTo be honest, I’m not surprised the girls are into Issei. He’s got a heart of gold, is loyal, brave and goofy. And a bumbling pervert. Which is fitting for a series this fond of boobs. (Also makes for a funny character flaw.) All of the girls have felt empowered by him at some point in previous seasons, and personally, I kinda like him too. Although, I have to admit that their attraction to him sometimes gets turned up to near-absurd levels you only see in ecchi harems. Whether that’s a bad thing or not depends on you and how you interpret the Rule of Sexy (“It doesn’t really have to make sense as long as it is sexy.”). \\n\\n\r\nSince most of the character development has been done in previous seasons, they don’t really get much in Hero. They are still the same however, as they should. Issei is still lewd but nice, Asia is still cutesy, Akeno is still teasing, Koneko is still kuudere and Rias is still Rias. As for the minor characters, there are only a few who are getting considerable screentime. One of them being Rossweisse, since she’s relatively new here. Then there are the antagonists, one of them stemming from the clusterfuck that is the Khaos Brigade and who is underdeveloped. The other one is Sairaorg Bael, who is pretty cool, being someone without powers becoming strong by training and who feels the need to prove himself because of this, and whose character is pulled off well enough. Anytime when the characters do get fleshed out a little it can make for endearing moments, which is probably one of the reasons people like the series. \\n\\n\r\n(Animation)\\n\r\nNow, the biggest concern that I have heard from those who are into DxD, is that the animation has changed. Particularly the character designs, which have been simplified. Since apparently BorN wasn’t quite the success, the series has gone from TNK to relatively new studio Passione, who then used an artstyle of their own. Some people may have found the design change difficult to accept. \\n\\n\r\nHowever, simplifying the design has somewhat worked in the shows favour. By doing this, it has become easier to animate, and it gives the characters a softer look. (Being a fanservice show, having them look softer… might definitely work in favour of the show. The women are also quite voluptuous.) On top of that, it manages to blend in nicely with the general atmosphere and style of the show. \\n\\n\r\nOn the other side, it doesn't have great animation per se. While it does look fine overall, with bright colours and decent fights, occasionally there are small issues like characters without shadows, awkward walking animation or facial expressions or something that just doesn’t look that smooth. It can be distracting, but it doesn’t necessarily have a large effect on the overall quality, since most of the parts that need to look good, look good. So yeah, mostly some fights and fanservice. \\n\\n\r\n(Story)\\n\r\nQuick summary: “Issei and some of the characters go on a Kyoto school trip, and there are a bunch of fox-youkai over there. Something is going on with that.”\\n\\n\r\nTwo episodes in, and I began to see that it was fast-paced as heck. There can be little time to breath in between scenes, and sometimes I would forget what just happened. However, the story isn’t that complex, so it’s not too hard to follow. As usual with DxD, the story isn’t anything impressive, but still just engaging enough to keep you watching and when combined with the characters, it actually makes you care. \\n\\n\r\n(Sound)\\n\r\nOk, so DxD still has a soundtrack that fits with its style. This being the nice beats and bittersweet melodies. When this music gets played under a scene, it tends to fit the tone and not be overshadowing anything, while being turned up a notch when the moment calls for it. The OP and ED songs are nothing special really, although the ED has some memorable visuals. Not to say that these are bad, since they are pleasant to listen to. As for the voice acting, the people are just doing their job and are doing it well. \\n\\n\r\n(Enjoyment/Overall)\\n\r\nThe series manages to do what sold it in the first place. For most of us, this would not only be the sexy fanservice, but also at least two or three likeable characters and an even more likeable protagonist, a story that manages to be engaging, and just overall decent animation and soundtrack. High School DxD is kinda silly, but knows what it is and has a lot of charm. This season itself is not necessarily better than previous seasons, but not much worse either. For most of the time, while it had some small issues, it was entertaining. And finally, that is what counts the most. \\n",
            "date": "2018-07-03T07:12:00+00:00",
            "helpful_count": 35,
            "mal_id": 282864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6527508.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/maartens31",
                "username": "maartens31"
            },
            "url": "https://myanimelist.net/reviews.php?id=282864"
        },
        {
            "content": "As you all know just by the cover alone this is full of so much \"fan service\" it could write a book has every style of character from the provocative to the shy and every type between. As a story goes it has one that plays out in often times extremely comedic fashion enough to make me laugh with its wit and sometimes satistic manner. Yes it's full of lots of Opai of all sizes but mostly more on the curvatishios the animation and character design are well done and fit their character types some with more underlying hidden aspects then what is outrightly perceived.\r\nTheback story is well put together with enough depth to give the world a semblance of life in an occult fashion. While the anime leads itself to a fixed track often seen in hermes it borrows from others such as a hero growing in power giving it a bit of play where there are love triangles it becomes more of a romance between two with supporting characters who try to show their best to win out. Attitudes change characters evolve and we gain a good sense of progress.\\n\\n\\n\r\nOverall I love the show it's a great show for anyone who loves ecchi with a bit more depth then just fighting for the sake of making your opponents cloths fall off yet your skin never more then dirty (unless you are a male character then you contain enough blood to fill a swimming pool) a standard theme in any fighting ecchi.\\n\r\nIf you have the time it's a great binge watch and fully uncensored only makes it more funny at times then odd attempts like smoke, hair that magically covers everything",
            "date": "2018-07-04T03:30:00+00:00",
            "helpful_count": 32,
            "mal_id": 282949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5950332.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PhoenixKola",
                "username": "PhoenixKola"
            },
            "url": "https://myanimelist.net/reviews.php?id=282949"
        },
        {
            "content": "So, this will be my very first review for the very first anime series that I watched. And I'm telling you, it is full of fan service from the very beginning. And it is one of the main reason why many people love it or I might just judging people, who knows. The plot is simple to understand, similar to those anime that I remember watching as a child like One Piece and Dragon Ball, all aiming to be the most powerful person on the universe well except for One Piece of course. The only thing that is different is how the plot presented. Unlikethose anime I mentioned earlier, this one is full of melons, litterally, full of melons. And because of that, you might just end up watching it for the fan service and not for the plot.\\n\\n\r\nThe Art is not the same as the previous season due to the fact this 4th season was created by a different studio and using different art style. And that was most fans noticed and argue about.\\n\\n\r\nThe Sound is pretty much heard by the majority. Those squick and sound of those melons when they been affected by gravity is so satisfying...\\n\\n\r\nThe Characters don't need development as for this moment considering this is a 4th season of this anime series. I'm talking about Issei and his harem. The only thing that needs development was the plot and for those new people who suddenly show up as this anime progress...\\n\\n\r\nAnd considering the things that I just point out, you might be thinking that I gave this anime a good score because of its numerous fan service and you are half wrong and half right on that statement. But it is not just about the fan service, it is also about those funny moments that this anime gives. You know, every time you finish watching each episode, you have a smile on your face because you enjoy  watching it.\\n\\n\r\nAnd considering you reach this far, just a small piece of advice, while reading reviews like this, kindly take it with a pinch of salt. You know, to not cause any trouble or what so ever. And for those new on the series, congratulation reaching this far, what I meant is, watching this far. Well, I guess, I should thanks the fa- I mean the plot for it, right??",
            "date": "2018-05-08T07:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 280061,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919918.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZakkuRa",
                "username": "ZakkuRa"
            },
            "url": "https://myanimelist.net/reviews.php?id=280061"
        },
        {
            "content": "What's with the high rating here? This series has clearly fallen from its predecessors. \r\nIssei still happens to be that \"rash\" MC which I've come to be annoyed by. If anything happens to his friends no matter how trivial, especially matters of the sexual-related sort, sends him off into a flying rage. Because, this happens to be his two states - \"Oppai\" or a \" crazy-angry\" nutter. Moreover, whenever he's bombarded with these \"oppai\" the other female characters undress and jump after him. These scenes used to be funny - not anymore. The charm and the reason I enjoy the ecchi genre is because ofthe rarity and sex appeal, however, situations like these happen so frequently its irritating. Some of their internal problems happen to be extremely stupid and dragged on(MINOR SPOILERS FROM S2/S3)- like the one where Rias wants Issei to call her by her first name, this has been going on since around season 2. Get with it! But the most irritating thing here is the cringe, the stupid expression on Issei's face when he sees a women's breast or when the characters get some armour or something of the sort - proof that the animators are focusing on making it cool rather than focusing on the overall picture because apparently to the marketing department the audience happens to be a bunch of high-libido 11-13 year old who like to see something cool and want to see a screen full of boobs, right?\\n\\n\r\nI'd rather give it 5 out of 10 but Akeno and Koneko happen to be my favourites so I'll give it a 6. This is just for S4 but seeing the series overall, and harem being one of my favourite genres, I've seen way, way better harem animes that this one. \\n\r\n(Sorry for the spelling errors, if any; my keyboards going through a bit of a problem because of which I've written this several times already, and it has gotten a bid tedious so I stopped focusing on spellings.)",
            "date": "2018-06-27T12:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 282371,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7225735.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Bezzle",
                "username": "Bezzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=282371"
        },
        {
            "content": "Highschool DxD's 4th Season ended with a promo for the next season? Well! Only time will tell that possibility!\r\nNow... for my review.\r\nArt: 9/10\r\nMost of the fans really liked the previous art where the TNK is the one who made that! I also liked that art style of TNK but there is some flaws of it. Like the animation for the fights in the previous seasons, Some of those fight scenes were like a GIF or something like those old anime fight scenes. The thing that I like in TNK's were the character design, They are absolutely stunning!\r\nNow for the Passione, since they are the onewho are doing this fourth season, I know there are some of you who has a struggle getting used to the art style but try looking at the bright side of it.\\n\\n\r\nI will tell you the some good sides of this change:\\n\r\nCharacter Design: They're using the current character design of the Light Novel. They are really cute for me! Getting used to it will take some time but I assure you they have the reason for this change.\\n\\n\r\nAnimation: The animation for this season is top notch compared to the previous ones, Just compare the fight scenes of this one to the previous one, Look how amazing the animation of this season! Also the Ecchi scenes are so fluid this time! Stiffness of the Previous is now gone.\\n\r\nOld is \"Gold\" but evolution will not take place without \"Change\".\\n\\n\r\nCharacter: 8/10\\n\r\nI know the focus of this series is Issei but did you notice that some of the characters in the shadow in the previous seasons is now on the spotlight! The relationships of this season will shock you and also a stepping stone for our harem king?! Maybe? That's for you to find out!\\n\\n\r\nSound: 10/10\\n\r\nI have simple reason for this. The sound and OST were the same of the Previous Seasons with some new ones but to hear the classics again is priceless! Also, The Opening were catchy and I fell in love in the Ending Song.\\n\\n\r\nStory: 9/10\\n\r\nI love how they pour some of their budget just to retcon the abomination of Season 3, Really... You will never see an Animation Studio like that everyday, An Animation Studio that will make an EFFORT to make other studio's mistake straight again. So... I would like to rate Passione's EFFORT 10/10!\\n\\n\r\nNow, They are following the Vol. 9&10 of the LN but some of the abomination of S3 is making an effect this season so some things will also a little bit confusing for those anime-only. That's why I rate the story 9/10.\\n\\n\r\nEnjoyment: 9/10\\n\r\nThe humor of this anime will be the same for me even though they changed the studio, nothing beats the humor it gives for me! It maybe sounded a little bit biased on my side but that's how I felt while watching this season. so I'm being honest here. :)\\n\\n\r\nOverall: 9/10\\n\r\nI've watched countless Action/Ecchi/Harem/Romance animes out there but this one is one of the best for me! The girls of this series were just perfect, Hyoudou Issei is like a dense type MC of a Harem series but he has reasons for it, Unlike those other MCs that are so dense af out of nowhere. High School DxD is the type of an Ecchi/Harem series that has both \"Plot\" and Plot.\\n\\n\r\nThat's my review for this season! If you are planning to watch this series then go for it! I highly recommended this anime!\\n\\n\r\nI CLAIM IT! SEE YOU AGAIN IN THE NEXT SEASON OPPAI DRAGON!!!",
            "date": "2018-07-04T05:46:00+00:00",
            "helpful_count": 8,
            "mal_id": 282956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7153966.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/INFERNAL_FURY",
                "username": "INFERNAL_FURY"
            },
            "url": "https://myanimelist.net/reviews.php?id=282956"
        },
        {
            "content": "Look, I know this is now being done by a different studio or whatever, but I loved this anime. And now it seems more like it was a cheesy fanfic someone wrote using Issei and the girls but not the original enemies we know and love-hate. Oh, and don't get me started on the HUGE focus on the \"grabbin' Dragon\" song and dance throughout. It was honestly pathetic. \r\nI admit, they pulled off some quite good fanservice and cuck scenes, and the fox was cute, but overall there was none of the surprisingly compelling story of the original 3 seasons.\r\nThey also only used half ofthe girls.",
            "date": "2018-08-11T09:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 286191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7330901.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kodokuna_Gemu",
                "username": "Kodokuna_Gemu"
            },
            "url": "https://myanimelist.net/reviews.php?id=286191"
        },
        {
            "content": "High School DxD Hero completely retcon's BoRN's ending for a different direction and thus continues the crazy fanservicey mythological adventures of Hyodou Issei.\r\nSince this is LA's first review on MAL on the High School DxD series, LA might as well give LA's opinions on the series before tackling this installment of High School DxD. The first season was a good stepping stone to the series, applying all the world building as well as Hyodou's weaknesses to set us off, though the fanservice vs. tension did get in the way but nonetheless the first season was getting used to balancing it. \"New\" was dove in deepto it's supporting characters, from Yuuto to Akeno as well as expanding the world building of the underworld and heaven in the process. BoRN was expanding even further on the the fact that legends and myths are REAL in High School DxD's world thus they become allies and villains set out to do their plans just with some rocky character development here and there especially from Hyoudou himself and now in Hero well...\\n\\n\r\nOhh and LA is Team Akeno by the way anyways carrying on...\\n\\n\r\nBecause of the retcon Hero immediately did, LA DID welcome it as LA was indifferent to BoRN's ending as it DID come out of nowhere but was melodramatic as all hell in the process, Hero's beginning fixed that to say the least.\\n\\n\r\nSo from that Hero leads into the \"Kyoto arc\" as well as the \"Rating Game with Sairaorg Bael\". The Kyoto arc leads into the previous villain in a previous season of Cao Cao voiced by Kosuke Toriumi, the leader of the Khaos Brigade as well as new characters Kunou voiced by Sora Tokui a kitsune youkai trying to find her mother which the Occult Club (Second Years anyways) finds while on their field trip to Kyoto. To say the least the Kyoto arc feels similar to BoRN's structuring of plot, where a large threat arrives and where Hyodou and the gang needs to stop them from enacting their plans in the process, LA was fine with the Kyoto arc and was it was presented as well as the character development and improvement to the Second Years' power dynamic (plus the addition of screentime to Roseeweisse  to sub in for Akeno..well LA anyways), plus the villain of this arc IS such a huge threat that links in as to why they are in Kyoto as well as their plans that involved Kunou's mother and linking all this together was great, that and a mystery of a mass groping incident which has links to Hyodou's growing power. ALL in all, Kyoto arc was decent and reflecting the previous season's callbacks and structuring.\\n\\n\r\nIf Kyoto arc was reflecting BoRN's great points, then the Rating Game with Sairaorg was a better version of the first season's Rating Game. See this arc was focusing on three things, Hyodou and Rias' relationship and development to Sairaorg as a character. Hyodou and Ria's relationship by all means was ALOT of people's problems which was encased by Hyodou's denseness to Rias' advances especially in BoRN but Hyoudou is such a harem seeker and wants to help anyone as possible (harem or not) that this kind of mindset gives a gaping hole on Rias which Rias's outburst was warranted, she was more or less feeling left out because she was \"President\" in Hyoudou's eyes. To that, LA knows what most of you will say that \"Hyoudou is and ALWAYS dense, he doesn't change\", actually Hero and by extension from the start of the second season, though he has the perverseness to him, Hyoudou did grow through all his fights he encountered and learned from that to being the best fighter and protector to the Rias family in the process...he DID grow and move on but with the lingering guilt and fear he still has on the first season which Hyoudou by the end of this season...he moves on and finally he finally takes the hint and thus Hyodou FINALLY does and say to Rias after four seasons! The main focus however does go to Sairaorg and he's quite different from the many \"blanket evil characters\" Hyodou has meet and his backstory and his goals are VERY similar to Hyoudou himself. Sairaorg by all means has alot of similarities to Hyodou, being a powerful character but is currently unrecognized by the underworld and Sairaorg wanting to gain his notoriety and his family pride back and will do anything for his family (mainly to do with his comatosed mother and wanting to revive her), his not a black or white villain but more like he's the friendly rival to Hyodou and someone Hydou wants to strive to be and maybe even beat which is what the climax for Hero leads up to for this arc. \\n\\n\r\nDdraig this season does gets development in the form of Hyodou's powers growing exponentially by the means of Hyoudou speaking to the predecessors of the Red Dragon Emperor and this only improves in the world building front but more on Hyodou's increasing power and sometimes his beliefs conflicting with his predecessors and seriously considering all the powerful rivals and villains Hero gives us, you KNOW Hyodou grows crazy strong this season to keep up with them. Yes because of this, Hyodou is the only one to stop many of the threats in Hero by the end of all this, but Hero did at least manage to make use of it's cast and make screentime for them in terms of battles at least as powercrept Hyodou is. Hyoudou also gets titled as the Boob Dragon and even has his own children kid shows in the underworld due to his notoriety in the underworld and considering High School DxD's nature of fanservice in even some of the most tense moments, yes even this becomes a plot point, tonal dissonance sure, but it's within the nature of High School DxD to do this...at least for us to breathe in a ways when the batshit crazy battles that does happen.\\n\\n\r\nOn speaking of the Boob Dragon, well Hero doesn't screw around with it's fanservice, though if your watching it censored...then....your missing out on some of the fanservicey moments what with Hydou's continuously expanding harem trying their luck with Hyodou in the process. Watch Hero uncensored if possible as Hero is unbashed about it's fanservice but it's to the fourth season...seriously FOURTH, it's to be expected.\\n\\n\r\nWith that, well the animation studio had another change, from TNK to Passione and well ALOT of people didn't like the new polished and sleeker character designs but LA was fine with it because at the very least the animation was consistent even it's more batshit crazy battles. Passione did a very good job all things considered, from the newer character designs, great battle animation and decent backgrounding reflecting the previous seasons. \\n\\n\r\nVoice acting, well LA's bias to Shizuka Ito as Akeno but her screentime was VERY small to say the least. but with the original voice cats back again as well as some new ones like Sora Tokui as Kunou and Asuka Nishi as Ravel Phoenix, but LA would most probably give MVP to Yoko Hikasa as Rias this season not by sheer screentime but Rias went through ALOT of stuff this season even during the Kyoto arc and that Yoko Hikasa just really did a great job once again reprising her role as Rias and giving us great range. Overall with the huge cast of characters new and old, the voice cast of High School DxD was expectedly great.\\n\\n\r\nHero seemed to have learned from it's previous season's mistakes while at the same time greatly improving on it's strengths in the process, from Hyodou and Rias' relationship, giving us high stakes and new settings while keeping the nature of High School DxD in the process and finally giving us something of a satisfying ending in which it can definitely lead to something more in another season if possible but if not, still allowing Hero to be a great installment to the series. In terms of seasons, LA did find Hero to be better than New, but it's on par or maybe even surpassing BoRN because Hero just hit all the sweet spots in terms of characters and plot in which BoRN couldn't hold out by the end but still did good on it's characters. \\n\\n\r\nALOT of people watch High School DxD for the \"plot\", but High School DxD Hero clearly shows it can be much more than that.",
            "date": "2018-07-04T17:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 283006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=283006"
        },
        {
            "content": "First off, I am a light novel reader, and I love how we get a great adaption, but this season could of been better and my closing notes will detail why.\r\nStory 6\\10\r\nBefore I get crucified, I find volumes 9-10 which this series was covering the most boring while reading. I was also getting used to all the changes because of a new studio so it was hard to be engrossed as well. Since season 3 was not fully cannon and missed a ton of important parts, they had to skip a lot so some things were skipped in order to keep cannon which confused everyanime only watcher I talked to, and it was annoying for me too. Examples also being the rating game Sitri VS Gremory.\\n\r\nSound 8\\10 not including old tracks 4\\10\\n\r\nThe OST of high school dxd is great, but this season added hardly any new tracks and the weakest op and ed. I give dxd 8\\10 overall on sound but judging season 4 tracks alone its bad.\\n\r\nCharacter 9\\10\\n\r\nNot really much to say here but the faithfulness to the light novel helped the characters which we all love but some like xenovia just seemed utterly off but thats just one thing. If you are here at 4 season you know the characters are great.\\n\r\nArt and animation 3\\10\\n\r\nMan on man did the art style start a flame war, I saw it divide the fandom. I think the new art style is okay and if it was just the art I had a problem with, I would give this a higher score but we will get to the animation in a second.\\n\r\nThey switched up character designs, my waifu akeno looks derpy and the full changes they have done to characters turned me off the most as it did with others but some look fine with the new art style like asia, rosweisse and others and some like Akeno and Rias look worse. The old animation by TNK looks more mature and the fanservice in the last seasons made it look as if all the characters chest looked different and different body types, now the boobs look almost the same.\\n\r\nThe animation is bad, if it was good I would give this a 7\\10 and say I am just not a fan of the new art style and leave it but its bad. The facial expressions are done horribly, lots of standstill images, choppy at times, action looks like something from ten years ago and fight scenes were choreographed better in the past. Character designs as well as them using a 3d painted background while exploring kyoto in episode 3 or 4 which looked awful. Animation was bad and with getting used to the utterly 180 art style changed that took away from the show. Part of me wants to give this a 2 almost.\\n\r\nEnjoyment 5\\10\\n\r\nHonestly, this season did not have me looking forward to the next episode at all unlike the other seasons of dxd, the art style changed took time to get used to and I still do not like it since many people were drawn to the gorgeous art style of TNK and we get this boring plain art style thats not fun to look at all. The facial expressions I noticed right away like others and once you noticed it, you can't ignore it. If you do not know what I am talking about count your blessings because you will notice it next time you see it or rewatch it. Rating game was not as fun as others as well as this was the most boring parts of the LN for me. I will say that dxd is one of my favorite animes of all time, but I really can't care too much for the anime at the moment so I may stick to just reading it. With the flame wars and backlash on this season however I don't think we might get a season 5.\\n\r\nOverall 6\\10\\n\r\nI wish this season was better, I really do. I even prefer the non cannon season 3. The art style divided the fandom and I would even go as far to call the fandom more toxic than its ever been. The reason we have a new studio is because TNK was not following the LN properly so the series got handed over to passione, the studio that really should not have it out of all studio's I could think of.",
            "date": "2018-06-23T00:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 281973,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249550.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ninjaguy2511",
                "username": "ninjaguy2511"
            },
            "url": "https://myanimelist.net/reviews.php?id=281973"
        },
        {
            "content": "If you liked the \"key\" parts of the last 3 seasons,\r\n     -Boobs\r\n     -panties\r\n     -peeping\r\n     -boobs\r\n     -music\r\n     - p l o t\r\nThen you will most likely enjoy this season tooo\r\n     The art is fantastic, as well as the music, and it follows up on the last 3 seasons stories, and just watching the MC (Issei) grow stronger and overcome his problems feels nice. Im also mad the he gets all the women and i cant get even one.if you can overcome the temptation to just stare at [certain] places, this series is truly enjoyable, and its full of comedy. in case youre a perv who really likes bobs and vagene, this anime is ok for you ig this is getting awkward. But yeah, all in all its a trullly enjoyable anime\\n\\n\r\nedit: this is ridiculous. this kid can kill god by calling out boobs\\n\r\nedit 2: he touches them and becomes invincible",
            "date": "2018-06-20T15:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 281688,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6880775.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Squiddzy",
                "username": "Squiddzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=281688"
        },
        {
            "content": "Sorry i might copied someone's review but i also feel the same that this anime does not have that much of a harem genre anymore it is more of a fanservice and romance anime now with demons and supernatural stuff and boobs \r\nStory = 8/10\r\nStory is 8/10 because the anime is more of a Romance anime now, it isn't like before but i am not saying that its bad but i think if you have the genre Harem you should focus on it more because the development between male and female characters is more on one girl which is Rias which the Mc Issei likes\r\nArt=9/10\r\nArtis 9/10 because the appearance is different from the other seasons especially the girls because some of the girls changed not by attitude but by \\n\r\nappearance so i rate it 9/10\\n\\n\r\nSound=9/10\\n\r\nSorry  i really do not pay attention that much to the sound of the anime but what  i think is the voices of the characters change \\n\\n\r\nCharacter=9/10\\n\r\nthe only thing i think i can say is that it is good and a lot has changed except for issei\\n\\n\r\nEnjoyment=8/10\\n\r\n4th season of the famed Harem and Ecchi is good and i am not saying it is bad but like i said earlier it does have that much of Harem anymore which i need because i am in a Harem and Ecchi club in myanimelist so Harem and Ecchi is important to me but it does not have that much of enjoyment anymore\\n\\n\r\nOverall=8\\n\\n\\n\r\nP:S this is my second review so please bear with me if its bad\\n\r\nalso some parts of the other main girl Mc's change too especially there faces\\n\r\none think thou asia did not grow oopai and kaneko also \\n\\n\r\nalso ep5 fighting scene is very good",
            "date": "2018-05-17T21:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 280826,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178860.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FTOPICD",
                "username": "FTOPICD"
            },
            "url": "https://myanimelist.net/reviews.php?id=280826"
        },
        {
            "content": "Beautiful, Brilliant, Epic and Emotional! Season 4 is outstanding and before watching this I didn't have big expectations but how foolish I was to think like that...\r\nStudio Passione despite changing the art style managed to give this show some substance, created a fitting emotional atmosphere  for exposing the character's bonds, a better presentation for the characters and managed to give more screen time to one of the most badass characters Azazel. Another reason to check this season out beside Azazazel is Sairaoug and goddam he is one of the manliest characters from this show! Why? Because like others who rely on sacred gears andother stuff this man fights using his bare fists and his overwhelming fighting aura..A man with honor ,a man of his word who respects his opponents  giving everything he has during a fight!\\n\\n\r\nIssei and Rias's bond in this season goes beyond master servant and they finally managed to get to a starting point in their new relationship....And what I like and always will love from this anime are the girls who aren't like those stupid stereotypes who say \"Die\" or \"Baka\" after the main character sees them naked or half naked in contrary the girls are the ones who almost jump on Issei(Lucky bastard...) with their beautiful shaped breasts who will make any man jealous.....\\n\\n\r\nAs for the characters's traits no worry this season keeps up the good tradition and you will see your beloved Xenovia keeping up the good work in making babies with the red emperor, Koneko healing Issei wounds , Akeno sucking the poison from his body and etc...\\n\r\nThe story is not something overwhelming or outstanding it's the typical power-up main character who fights the other power-up characters but in this season their are some moments who give a good reason  Why and for Who Issei is fighting . Is enjoyable so what do you want more? Plus the beautiful girls will put a smile on your face after a bad day....\\n\\n\\n\r\nThere are some emotional moments in this show that  gave me a nice surprise, some fights were predictable but damn  enjoyable I won't deny that. The \"Emperor Boob\" stuff was kinda out of place sometimes but I am glad it didn't ruined the heartwarming moments and the emotional atmosphere created around the characters. I think what I liked the most from this season is how this show managed to go into Issei's mind during his fight with Sairaoug depicting his thoughts, emotions and reasons for why is he standing there.\\n\\n\\n\r\nGive it a try and don't listen to those rumours about the art style being bad in contrary for me the new  art style  made characters like Xenovia, Irina, Asia and Koneko look better than their previous designs....This show is damn enjoyable and the fanservice is done well and this is coming from someone who doesn't watches this kind of shows but appreciates what this season has accomplished so far!\\n",
            "date": "2018-07-04T10:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 282970,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282970"
        },
        {
            "content": "I watched High School DxD Hero expecting to get the same kind of funny perverted comedy and sexy characters from the previous 3 seasons but I was sadly disappointed, this is a review from someone who owns Seasons 1-3 on Limited Edition from Funimation and really enjoyed this show. \r\nIt turns out that for Season 4 (Hero) the creator of High School DxD changed the studio that worked on the anime from Studio TNK (the one that did seasons 1-3) to a new studio named Passione because studio TNK changed the ending of Season 3 without the creators permission which led to the creator switchingto a new studio for season 4.\\n\\n\r\nThe change is studio is very apparent in the art style, animation quality, and scenes for the new anime, and it honestly doesnt feel like im watching the same anime that I grew to love over the previous 3 seasons. Some of the differences from the previous 3 seasons are\\n\\n\r\n1) The characters look different for example they have a little bump around their triangle shaped chins in some scenes that makes the chin look crooked, the shadowing on the characters faces looks different too, the scene where Rias was naked in bed in the end of episode 1 next to Issei her leg looked huge from the side view. \\n\\n\r\n2) In some scenes the detail on the characters is so bad that it looks like a little kid drew them.\\n\\n\r\n3) Issei is made to act more like a cartoon character in season 4 by puffing out smoke from his nose when he gets aroused, getting more nose bleeds, and making goofy perverted faces when hes aroused which makes him seem like a much less of a heroic character with epic dragon armor and more of a goofy pervert who got into a very lucky harem position.\\n\\n\r\n4) They keep introducing new villains in each episode and then talking about \"past fights\" they had with Issei but their completely new characters that were not shown in seasons 1-3, they should introduce the characters properly instead of trying to cut corners and reference fights that never happened in the previous seasons of the anime or at least werent shown in the anime version of the show (without reading the light novels or manga). \\n\\n\r\n5) The intro and outro videos arent as epic or sexy as in seasons 1-3, they seem more generic. \\n\\n\r\nHonestly it feels like im watching a completely different anime instead of the High School DxD I grew to love over Seasons 1-3, I own the Limited Edition Funimation releases for the previous 3 seasons but im not sure if I will buy Season 4 or not, I wish they would have kept the same studio that made the previous 3 seasons. It feels like when you follow a show for a long time and grow to love the characters then the next season comes and you find out that the Director changed some of the actors who you grew to love for people that look similar to them in the hopes that the viewer wouldnt notice the difference in actors and keep watching the series, well High School DxD the fans have noticed and we're not happy.",
            "date": "2018-07-07T21:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 283338,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/401498.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Reinier",
                "username": "Reinier"
            },
            "url": "https://myanimelist.net/reviews.php?id=283338"
        },
        {
            "content": "High School DxD is one of those anime series that remains consistent throughout each new season. What I get out of the anime is good characters, comedy,titties,red dragon machine battles,and more titties.\r\nHonestly I just watched the High School DxD series just for the comedy,characters,and titties. I don’t find the lore of the Dragons and the battles to be interesting at all. I just fast forwarded most of the fights in 2x speed. If the anime wasn’t funny and/or I didn’t like the characters I would have dropped it immediately within the first few episodes like Tu Love Ru….titties aren’t enough for me to commit hoursof watching. \\n\\n\r\nI love all the characters in this anime, Issei is so funny, the way he talks about tits and girls is bursting with passion. My favorite girl out of all of the girls is Asia Argento, I feel she is under rated. I feel most guys just like Rias or Akeno and I like their personality too but I like my girls skinny petite and not big and busty.",
            "date": "2018-05-21T20:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 281127,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461807.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AkiraAmon",
                "username": "AkiraAmon"
            },
            "url": "https://myanimelist.net/reviews.php?id=281127"
        },
        {
            "content": "While the story is terrible compared to the three earlier seasons, it is still a barrel of laughs. Not because it has good or clever jokes, but just the sheer amount of stupidity. \r\nIt brings back memories from the first season, which I absolutely loved. It was just excellent. It was so stupid, but it didn't matter, the show made you laugh either way. \r\nThis season manages to catch this feeling very well. Albeit at the cost of emotional moments. While the emotional moments are often ruined, it feels kinda nice to just take a step back, and watch it just to have fun.\r\nThough thistactic of drawing in the viewers is likely to backfire because many of us (myself included) no longer watch the show for the stupidity, but for the story. \\n\\n\r\nWhile I definitely do miss the amazing storyline and emotional moments, it is incredibly nice to just settle back to something similar to the first season. \\n\\n\r\nThough I say this is similar to the first season, it does lack a lot of key points the first season had. Jokes in this fourth season have dropped in quality, the story has fallen completely apart, and the art style is appalling compared to the three previous seasons.\\n\\n\r\nEven though it lacks these key points, it is undoubtedly still fun to watch, and I'd recommend it to anyone into comedy/harem anime\\n\\n\r\nI also wanna say that (supposedly) both the art and story is written and drawn in a manner that is closer to the light novel. I can't confirm this though since I haven't read the light novels nor do I think I will,\\n\\n\r\nBtw let's not talk about Taiikukan-ura no Holy. The remake of the last four episodes of the third season.\\n\\n\r\nI refuse to call it canon.\\n\r\nI simply refuse.",
            "date": "2018-05-15T12:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 280638,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mr_Floppy_Donkey",
                "username": "Mr_Floppy_Donkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=280638"
        },
        {
            "content": "Well this is a genuine surprise. I was so thoroughly disappointed by Born that I almost didn't even bother with Hero, and the new art style/character redesigns brought me right to the edge of abandoning ship five minutes into the first episode. But I endured, and I haven't been so glad of anything since I realized I can take concubines in CK2.\r\nThis art style suits the concept of DxD way better than the old one, although it took getting used to. Rounding of faces and the drastic increase in boob sizes are obvious changes right out of the gate, but improvements in movement frames, characterexpressions, and increase in color contrast make it a much richer experience. Switching studios really allowed this series to turn 360 degrees and walk away from the total shitshow that was Born.\\n\\n\r\nBesides mammoth expansion of honkers, Issei's growth as the Titdragon melds well with better jokes and more interesting characters, as well as taking the narrative away from a \"big bad evil\" and refocusing on a tighter problem to solve. A friendly rating game was the perfect solution to the lame \"Chaos Brigade,\" because not only was that a totally stupid antagonist it was also boring af to watch. \"Oh my god dude look it's Loki I wonder if he's going to be a tricky trickster wow look at that he did a tricky thing ha ha I'm so fooled by the trick there\" versus \"a friendly fight with a guy who can punch holes in reality by sheer willpower and is a legitimate bro.\"\\n\\n\r\nThis is a full-spectrum anime with true depth of character. I am so pleased with the reversal from S3 and I absolutely cannot wait until S5. Do recommend without reservation.",
            "date": "2019-03-06T06:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 302998,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=302998"
        },
        {
            "content": "I loved this season new art style but got use to it I'll miss the old style but anyways in opinion this is my 2nd favorite season good story and the sound on this was good as well it's clear my enjoyment on this season was a 10 man the last episode made me so emotional but i was mainly happy it looks like Rias's and Issei's relationship's began to progress near the end of this season and if you saw what was after the credits it's very likely a 5th season is coming if your a big fan like me your hyped as well.",
            "date": "2019-04-06T02:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 305594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XanderHowell11",
                "username": "XanderHowell11"
            },
            "url": "https://myanimelist.net/reviews.php?id=305594"
        },
        {
            "content": "I watched all the High School DxD's in 3 days, and I have to say that when I finished season 3 i was like \" Hot damn now that was some fucking awesome story line, character development, hype, and action that I have seen\" I hadnt felt that way since I saw Gohan go SSJ2 when i was 11. But this shit. Season 4, legit 180 turn in the completely wrong dimension. Here are some reasons why.\r\nReason 1: THE ACTUAL GOOD CHARACTERS ARE GONE FOR LIKE 4 EPISODES\r\n- Rias and Akeno are my favorite, but I am forced to endure 4 episodes in a rowwith their fucking bath cameos, know I like them and all but I prefer watching their interactions with Issei and I am sick af of watching them fucking complain that he is gone. \\n\\n\r\nReason 2: Issei... I dont know when the fuck you are ever going to learn from your fucking mistakes. Like, jesus how many more fucking times we gotta do the same shit. Some guy kicks ur ass, you ask for boobs and then u get powerful. I understand that thats the whole premise of the show. But for fucks sake this is their fourth season if we are throwing the whole fucking plot out the window at least have some character development.\\n\\n\r\nReason 3: I was drained by the time I was on the tenth episode, I was already pissed with the whole \"oh why doesnt he call me Rias thing.\" like bitch just fucking ask him. I know that in the finale she said \"Oh I didnt have the courage\"... like hello, you pressed ur fucking naked ass body against him the first fucking time you met him yet you cant have the fucking courage to legit just ask him to call you by your frucking name. Like hello what kind of fucking monstrosity does that entail. \\n\\n\r\nIn conclusion, prepare to see the biggest fucking ball drop in terms of disappointment when you watch this season. Like if it werent for the confession at the end and the nice epsiode 1 that we had, I wouldve flat out given this shit a goddamn 3 like it was that fucking horrible. Whoever took High School DxD needs to get a boost right to the goddamn nuts cause they just fucking cucked the rest of us into the next goddamn dimension.",
            "date": "2019-02-26T19:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 302540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7835797.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Daiymo1",
                "username": "Daiymo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=302540"
        }
    ],
    [
        {
            "content": "From the depths of fanservicy guilty pleasure of hell makes the return of High School DxD Hero. It’s been nearly 3 years since the last time this anime aired on TV and to be honest, it needed a break after the disastrous third season. High School DxD Born left a bad taste in my mouth after seeing how far the franchise has fallen. Is Hero a chance for the show to redeem itself?\r\nThe fourth season covers the volume 9 and 10 from the light novels. This didn’t come as a surprise as the franchise has a tendency to build more into the story with establishedconcepts. To say the least, the franchise isn’t afraid of taking the risk to show off its fan service. Straight from the first episodes, we see the characters return with Issei still being a perverted self-proclaimed “Harem King”. It doesn’t take long for the plot to kick off after they visit Kyoto where a new story puts him in conflict with supernatural entities yet again. \\n\\n\r\nFollowing a formulaic construction of the plot, the first half of the show adapts the 9th volume. We meet a fox girl named Kunou and after a misunderstanding, she pleads for Issei and the others to save her mother. The premise of this arc is incredibly straightforward after Issei realizes the responsibility they need to carry to get the job done. However, the arc is perhaps a bit too predictable and lacks the High School DxD-esque quality as the first two seasons. In other words, I must admit that a few of the first few episodes are too forced. The drama is too serious and didn’t make me care about Kunou as much as I had hoped for. On the other hand, there are still remnants of fun value we can see this season. The fan service returns thanks to the naïve personalities of characters like Xenovia and Irina. Even though Rias and the main cast aren’t there, Issei still gets a face of boobs, ass, and skinship. I say this with honesty that High School DxD is one of the few anime that works creatively well with the fanservice. Without it, the show would lose its identity. Luckily, the show does manage to find its way to bring that out again.\\n\\n\r\nCovering the 10th volume, this fourth season manages to find itself well on the path of its roots again. By the time you’ve reached over the half the series, the familiar mood will return almost like yesterday.  It also does a clever job at building up the inevitable battles as Ria’s Team goes up against Sairaorg Bael’s peerage. Remember, this franchise began with a concept known a “Rating Games” that has been a central element in the storytelling. This time, the stakes are more about pride to see which team is better. For Issei himself, there’s also some emotional stakes that he didn’t even realize himself. The fact that after three seasons, he’s still dense as a black hole should come as no surprise to viewers. In one particular episode, Rias directly confronts him about her feelings and we get a half-assed response from the guy. This may rub viewers in the wrong way as the relationship between Issei and Rias has been a central focus in the franchise. \\n\\n\r\nThe Rating Game itself also featured some comedic moments with the press conference buildup and the actual execution. There’s also some exploitation about the rules of the game to get viewers familiarized again. The actual battles felt more or less like a cheesy mix of underwhelming fighting. In fact, I would say most of them are insignificant that even includes Issei’s in the first rounds. The show only has 12 episodes so it limited itself from achieving full potential. To me, that’s a backstabber to fans of the franchise who wants to get the most from the action. Honestly, I think High School DxD’s action elements has always been one of its weaknesses and from season 4, that didn’t change much either. In some of the final few episodes, business picks up more as Issei confronts Sairaorg himself as we see how dangerous his rival really is.\\n\\n\r\nOne of the biggest changes of High School DxD Hero is the art style. The first three seasons were adapted by studio TNK that fans are familiar with. However, Passione takes the step this time to animate the project. They are perhaps best known for their work on Rokka no Yuuska and more recently, Citrus. I’m not going to lie, it’s going to take some time to get comfortable with it. The character models looks less detailed and cartoonier especially for the main girls. Don’t get me wrong though. Characters like Rias and Akeno still looks busty like the previous seasons. Even new characters like Yasaka gives the impression of a sexy older type. However, it will take time to get used to the new art style as there’s less details on the fan service. It’s still there especially if you watch the uncensored version with the boobs and ass being thrown at your face. The action still feels the same as the previous seasons though so don’t expect anything that will blow you out the water. Character designs in terms of plot direction improved slightly with an improved transformation of Issei. Similarly, character voice mannerism somewhat evolves this season that’s more noticeable in Rias and Issei. She is able to display her personality at best when together with Issei especially during some of their more emotional scenes. The theme songs still feature a mix of action and fanservice theatrics I’m sure fans are familiar with. \\n\\n\r\nWell it’s been nearly three years since I’ve reviewed High School DxD. After the break, I think this show manages to step up slightly up to the plate. However, it’s not a big improvement over the third season and more like a step down compared to the first two. The plot is both easy to predict but hard to recall memorable moments from especially in its first episodes. It tests the viewers’ patience for its main character cast especially with Issei’s role. I also have to say honestly that Issei deserved a personal beating from the way he responded to Rias in that one particular episode. Otherwise, I think the fourth season is still worth the watch especially if you’re a diehard fan of the franchise. High School DxD always felt like it’s about having fun with itself. In this season, there’s still moments that manages to find its way towards that.",
            "date": "2018-07-03T08:06:00+00:00",
            "helpful_count": 67,
            "mal_id": 282868,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282868"
        },
        {
            "content": "BOOOSTOOOOOOOOO!!!!!!!!!!!Another HSDXD Sequel has ended and shit doesn't  licensor funaimation ever get tired of putting up another sequel of this shitty thing, when this 4th sequel has taken 4 steps backward? Now, ok , this sequel has a different studio and it's under studio Passione, it may have a new character designer but the thing about this sequel was instead of moving forward with Issei's relationship with Rias, it rather took a couple of steps backward. Also the relationship of the guy's harem has taken a new twist were the harem itself no longer competes for the guys affection.The only that hasn't change wasthe guy's \"OPPAI\" rant, that was rather annoying that there isn't an episode where you won't hear the word \"OPPAI\", and what's worst was it even desecrated  a children's song ,now it has added child porn in it also the addition of new harem member in Ravel. The story may have been different but then again, it wa still the usual when we have Issei being this \"OPPAI\" Dragon is at first up against Cao cao and  his posses and the later Sairaog who is  just picking a fight and as usual it's up to Rias' pooses to deal with them just like in season 1, which I have to say the season 3's story plot was much better than this sequel . On the fanservices, nothing has change there is the usual panty service , boob service , swimsuit service and the usual onsen service, so frankly this sequel was still the same shit but different illustration so here were my ratings:\\n\\n\r\nStory- Poor 3: Basically the story plot was almost like that of one part from season 1 to one part of season 3, where this sequel has become bad to worse.\\n\\n\r\nArt-Good 7: I rated it for the sake of them you know who, out there whom were having a field day of seeing the kind of fan services that is the mainstay of this anime/manga. \\n\\n\r\nSound- Very Good 8: That was for the opening theme where it really does fit one element of this story plot \"SWITCH ON, SWIIITCH OOOOON!\"\\n\\n\r\nCharacter- Pathetic 1: Since Issei's relationship with Rias has taken a couple of steps backwards and he's no longer this harem king wanna be despite of those girls throwing themselves on him in their birthday suits. \\n\\n\r\nEnjoyment-Dreadful 2: I feel like that I wanna go there in Japan look for the people who made this sequel and give them a BOOOSTOOOOO amount of whooping in their asses.  \\n\\n\r\nOverall-Pathetic 1: Well by the looks of it another sequel is in the making when we see Azazel having a secret, that he doesn't tell Rias and her lackeys. So shit, shit and shit. \\n\\n\r\nOPPAI!  \\n\\n",
            "date": "2018-07-03T12:19:00+00:00",
            "helpful_count": 51,
            "mal_id": 282885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7283186.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JiangHaoyi1979",
                "username": "JiangHaoyi1979"
            },
            "url": "https://myanimelist.net/reviews.php?id=282885"
        },
        {
            "content": "hey readers \r\nhere's my review of anime adaptation of wonderful light novel series i try to keep my review very straightforward and short covering only reason why you should give this show a try and why this season is much better than previous season's which is ruining the adaptation by only focusing on fan service and other mainstream shits rather than story\r\nstory:(9/10)\r\ndxd 4th season is adaptation of 9th volume of dxd LN Pandemonium at the School Trip \r\nIt has a nice plot and great characters that will attract you with their unique personalities its a wonderful story with wide no of different characters, setups andlocation combining large no. of mythical figures and legends such as angel demons gods of different mythology and legends dragon youkai etc and concept like apocalypse infinity dream creation etc in an awesome way .. its universe is probably you can say most vibrant and large as compare to any anime\\n\r\nThe ecchi scenes are hilarious. Some people say that the ecchi is exaggerated especially the idea of Issei being a pervert but as you watch the anime you will find that he is a great boy and usually tries his best to control his desires with girls (but he fails numerous times).Note that there are many animes that have more sexual scenes than it with a very weak plot ,so this anime does his job really very well\\n\\n\r\ncharacters:(9/10)\\n\r\nYou are familiar's with most of the characters as it is fourth season there are lot more romantic development lot's of new character's are introduced and there is lot of focus on issei's relationship with rias. As for Issei he goes from being an overly-perverted MC to a perverse, respected, beloved, mature and powerful MC who gives his all to protect his comrades and truly cares about all of them deepening his relationship with every one and forming new allies and also about ANTAGONIST introduced especially in this volume is diverse as the protagonists and several of them are antagonists you just love to hate them\\n\\n\r\nabout Issei's harem (∞/whats so ever...XD)\\n\r\nIse's harem is handled in such a wonderful way.every one is dynamic and got there own speciallity There's no crazy tsundere beatings or normal harem antics, just friendly competition amongst the girls for their spot in the harem. All the girls are just perfect. Every single one of them is so unique and they all play a huge role of importance in the series.\\n\\n\r\nanimation(7/10) and art(8/10) or youtube trailer..:P\\n\r\nwell its kind of decent animation i would not say its great like those of kyoto animtion or ufotable but its better than before as it shows light novel content perfectly so put it simply you get what you expected\\n\\n\r\nenjoyment:(8/10)\\n\r\nIt's hilarious, it's unpredictable, it's extremely intense, all the characters are fantastic, the ecchi and romance are wonderful \\n\r\nyou will enjoy all the characters especially ANTAGONIST as they are not just mindless freaks and got complex characteristics action is intense along with awesome fan service..:D\\n\\n\r\noverall(why you should watch it)(8/10)\\n\r\nHighschool DxD is in no way your ordinary ecchi series plot is brilliant with intense characters and astounding plot preserving story along with super power and harem echhi stuff which is quite rare. its really a good and refreshing show \\n\\n\r\nOverall Grade:\t8\\n\r\nStory\t9\\n\r\nAnimation\t7\\n\r\nSound\t8\\n\r\nCharacter\t9\\n\r\nEnjoyment\t8",
            "date": "2018-05-10T06:48:00+00:00",
            "helpful_count": 48,
            "mal_id": 280200,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6436371.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ta07",
                "username": "ta07"
            },
            "url": "https://myanimelist.net/reviews.php?id=280200"
        },
        {
            "content": "Boobies\r\nSweet, now I got your attention. \r\nAll right, if you are into High School DxD, you’re gonna like this. If you are not, then why are you still here? If you haven’t seen it, then go watch the other seasons first, otherwise you’re going to be clueless. \r\nIn fact, for those who have mostly forgotten, I’ll give a 4-sentence summary of what previously happened(Then I'll immediately get into the review.):\r\nIssei has the Sacred Gear of Red Dragon Emperor DDraig. He has become a demon of the Gremory Household, most of which consists of girls who are attracted to him. Already he’s gone up against numerousvillains, having his powers developed to the point of many different abilities, including control of a mecha suit. (Juggernaut being the unstable but powerful version, as can be seen in the recent special “Taiikukan-ura no Holy”.) \\n\\n\r\n(Characters)\\n\r\nTo be honest, I’m not surprised the girls are into Issei. He’s got a heart of gold, is loyal, brave and goofy. And a bumbling pervert. Which is fitting for a series this fond of boobs. (Also makes for a funny character flaw.) All of the girls have felt empowered by him at some point in previous seasons, and personally, I kinda like him too. Although, I have to admit that their attraction to him sometimes gets turned up to near-absurd levels you only see in ecchi harems. Whether that’s a bad thing or not depends on you and how you interpret the Rule of Sexy (“It doesn’t really have to make sense as long as it is sexy.”). \\n\\n\r\nSince most of the character development has been done in previous seasons, they don’t really get much in Hero. They are still the same however, as they should. Issei is still lewd but nice, Asia is still cutesy, Akeno is still teasing, Koneko is still kuudere and Rias is still Rias. As for the minor characters, there are only a few who are getting considerable screentime. One of them being Rossweisse, since she’s relatively new here. Then there are the antagonists, one of them stemming from the clusterfuck that is the Khaos Brigade and who is underdeveloped. The other one is Sairaorg Bael, who is pretty cool, being someone without powers becoming strong by training and who feels the need to prove himself because of this, and whose character is pulled off well enough. Anytime when the characters do get fleshed out a little it can make for endearing moments, which is probably one of the reasons people like the series. \\n\\n\r\n(Animation)\\n\r\nNow, the biggest concern that I have heard from those who are into DxD, is that the animation has changed. Particularly the character designs, which have been simplified. Since apparently BorN wasn’t quite the success, the series has gone from TNK to relatively new studio Passione, who then used an artstyle of their own. Some people may have found the design change difficult to accept. \\n\\n\r\nHowever, simplifying the design has somewhat worked in the shows favour. By doing this, it has become easier to animate, and it gives the characters a softer look. (Being a fanservice show, having them look softer… might definitely work in favour of the show. The women are also quite voluptuous.) On top of that, it manages to blend in nicely with the general atmosphere and style of the show. \\n\\n\r\nOn the other side, it doesn't have great animation per se. While it does look fine overall, with bright colours and decent fights, occasionally there are small issues like characters without shadows, awkward walking animation or facial expressions or something that just doesn’t look that smooth. It can be distracting, but it doesn’t necessarily have a large effect on the overall quality, since most of the parts that need to look good, look good. So yeah, mostly some fights and fanservice. \\n\\n\r\n(Story)\\n\r\nQuick summary: “Issei and some of the characters go on a Kyoto school trip, and there are a bunch of fox-youkai over there. Something is going on with that.”\\n\\n\r\nTwo episodes in, and I began to see that it was fast-paced as heck. There can be little time to breath in between scenes, and sometimes I would forget what just happened. However, the story isn’t that complex, so it’s not too hard to follow. As usual with DxD, the story isn’t anything impressive, but still just engaging enough to keep you watching and when combined with the characters, it actually makes you care. \\n\\n\r\n(Sound)\\n\r\nOk, so DxD still has a soundtrack that fits with its style. This being the nice beats and bittersweet melodies. When this music gets played under a scene, it tends to fit the tone and not be overshadowing anything, while being turned up a notch when the moment calls for it. The OP and ED songs are nothing special really, although the ED has some memorable visuals. Not to say that these are bad, since they are pleasant to listen to. As for the voice acting, the people are just doing their job and are doing it well. \\n\\n\r\n(Enjoyment/Overall)\\n\r\nThe series manages to do what sold it in the first place. For most of us, this would not only be the sexy fanservice, but also at least two or three likeable characters and an even more likeable protagonist, a story that manages to be engaging, and just overall decent animation and soundtrack. High School DxD is kinda silly, but knows what it is and has a lot of charm. This season itself is not necessarily better than previous seasons, but not much worse either. For most of the time, while it had some small issues, it was entertaining. And finally, that is what counts the most. \\n",
            "date": "2018-07-03T07:12:00+00:00",
            "helpful_count": 35,
            "mal_id": 282864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6527508.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/maartens31",
                "username": "maartens31"
            },
            "url": "https://myanimelist.net/reviews.php?id=282864"
        },
        {
            "content": "As you all know just by the cover alone this is full of so much \"fan service\" it could write a book has every style of character from the provocative to the shy and every type between. As a story goes it has one that plays out in often times extremely comedic fashion enough to make me laugh with its wit and sometimes satistic manner. Yes it's full of lots of Opai of all sizes but mostly more on the curvatishios the animation and character design are well done and fit their character types some with more underlying hidden aspects then what is outrightly perceived.\r\nTheback story is well put together with enough depth to give the world a semblance of life in an occult fashion. While the anime leads itself to a fixed track often seen in hermes it borrows from others such as a hero growing in power giving it a bit of play where there are love triangles it becomes more of a romance between two with supporting characters who try to show their best to win out. Attitudes change characters evolve and we gain a good sense of progress.\\n\\n\\n\r\nOverall I love the show it's a great show for anyone who loves ecchi with a bit more depth then just fighting for the sake of making your opponents cloths fall off yet your skin never more then dirty (unless you are a male character then you contain enough blood to fill a swimming pool) a standard theme in any fighting ecchi.\\n\r\nIf you have the time it's a great binge watch and fully uncensored only makes it more funny at times then odd attempts like smoke, hair that magically covers everything",
            "date": "2018-07-04T03:30:00+00:00",
            "helpful_count": 32,
            "mal_id": 282949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5950332.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PhoenixKola",
                "username": "PhoenixKola"
            },
            "url": "https://myanimelist.net/reviews.php?id=282949"
        },
        {
            "content": "So, this will be my very first review for the very first anime series that I watched. And I'm telling you, it is full of fan service from the very beginning. And it is one of the main reason why many people love it or I might just judging people, who knows. The plot is simple to understand, similar to those anime that I remember watching as a child like One Piece and Dragon Ball, all aiming to be the most powerful person on the universe well except for One Piece of course. The only thing that is different is how the plot presented. Unlikethose anime I mentioned earlier, this one is full of melons, litterally, full of melons. And because of that, you might just end up watching it for the fan service and not for the plot.\\n\\n\r\nThe Art is not the same as the previous season due to the fact this 4th season was created by a different studio and using different art style. And that was most fans noticed and argue about.\\n\\n\r\nThe Sound is pretty much heard by the majority. Those squick and sound of those melons when they been affected by gravity is so satisfying...\\n\\n\r\nThe Characters don't need development as for this moment considering this is a 4th season of this anime series. I'm talking about Issei and his harem. The only thing that needs development was the plot and for those new people who suddenly show up as this anime progress...\\n\\n\r\nAnd considering the things that I just point out, you might be thinking that I gave this anime a good score because of its numerous fan service and you are half wrong and half right on that statement. But it is not just about the fan service, it is also about those funny moments that this anime gives. You know, every time you finish watching each episode, you have a smile on your face because you enjoy  watching it.\\n\\n\r\nAnd considering you reach this far, just a small piece of advice, while reading reviews like this, kindly take it with a pinch of salt. You know, to not cause any trouble or what so ever. And for those new on the series, congratulation reaching this far, what I meant is, watching this far. Well, I guess, I should thanks the fa- I mean the plot for it, right??",
            "date": "2018-05-08T07:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 280061,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919918.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZakkuRa",
                "username": "ZakkuRa"
            },
            "url": "https://myanimelist.net/reviews.php?id=280061"
        },
        {
            "content": "What's with the high rating here? This series has clearly fallen from its predecessors. \r\nIssei still happens to be that \"rash\" MC which I've come to be annoyed by. If anything happens to his friends no matter how trivial, especially matters of the sexual-related sort, sends him off into a flying rage. Because, this happens to be his two states - \"Oppai\" or a \" crazy-angry\" nutter. Moreover, whenever he's bombarded with these \"oppai\" the other female characters undress and jump after him. These scenes used to be funny - not anymore. The charm and the reason I enjoy the ecchi genre is because ofthe rarity and sex appeal, however, situations like these happen so frequently its irritating. Some of their internal problems happen to be extremely stupid and dragged on(MINOR SPOILERS FROM S2/S3)- like the one where Rias wants Issei to call her by her first name, this has been going on since around season 2. Get with it! But the most irritating thing here is the cringe, the stupid expression on Issei's face when he sees a women's breast or when the characters get some armour or something of the sort - proof that the animators are focusing on making it cool rather than focusing on the overall picture because apparently to the marketing department the audience happens to be a bunch of high-libido 11-13 year old who like to see something cool and want to see a screen full of boobs, right?\\n\\n\r\nI'd rather give it 5 out of 10 but Akeno and Koneko happen to be my favourites so I'll give it a 6. This is just for S4 but seeing the series overall, and harem being one of my favourite genres, I've seen way, way better harem animes that this one. \\n\r\n(Sorry for the spelling errors, if any; my keyboards going through a bit of a problem because of which I've written this several times already, and it has gotten a bid tedious so I stopped focusing on spellings.)",
            "date": "2018-06-27T12:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 282371,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7225735.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Bezzle",
                "username": "Bezzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=282371"
        },
        {
            "content": "Highschool DxD's 4th Season ended with a promo for the next season? Well! Only time will tell that possibility!\r\nNow... for my review.\r\nArt: 9/10\r\nMost of the fans really liked the previous art where the TNK is the one who made that! I also liked that art style of TNK but there is some flaws of it. Like the animation for the fights in the previous seasons, Some of those fight scenes were like a GIF or something like those old anime fight scenes. The thing that I like in TNK's were the character design, They are absolutely stunning!\r\nNow for the Passione, since they are the onewho are doing this fourth season, I know there are some of you who has a struggle getting used to the art style but try looking at the bright side of it.\\n\\n\r\nI will tell you the some good sides of this change:\\n\r\nCharacter Design: They're using the current character design of the Light Novel. They are really cute for me! Getting used to it will take some time but I assure you they have the reason for this change.\\n\\n\r\nAnimation: The animation for this season is top notch compared to the previous ones, Just compare the fight scenes of this one to the previous one, Look how amazing the animation of this season! Also the Ecchi scenes are so fluid this time! Stiffness of the Previous is now gone.\\n\r\nOld is \"Gold\" but evolution will not take place without \"Change\".\\n\\n\r\nCharacter: 8/10\\n\r\nI know the focus of this series is Issei but did you notice that some of the characters in the shadow in the previous seasons is now on the spotlight! The relationships of this season will shock you and also a stepping stone for our harem king?! Maybe? That's for you to find out!\\n\\n\r\nSound: 10/10\\n\r\nI have simple reason for this. The sound and OST were the same of the Previous Seasons with some new ones but to hear the classics again is priceless! Also, The Opening were catchy and I fell in love in the Ending Song.\\n\\n\r\nStory: 9/10\\n\r\nI love how they pour some of their budget just to retcon the abomination of Season 3, Really... You will never see an Animation Studio like that everyday, An Animation Studio that will make an EFFORT to make other studio's mistake straight again. So... I would like to rate Passione's EFFORT 10/10!\\n\\n\r\nNow, They are following the Vol. 9&10 of the LN but some of the abomination of S3 is making an effect this season so some things will also a little bit confusing for those anime-only. That's why I rate the story 9/10.\\n\\n\r\nEnjoyment: 9/10\\n\r\nThe humor of this anime will be the same for me even though they changed the studio, nothing beats the humor it gives for me! It maybe sounded a little bit biased on my side but that's how I felt while watching this season. so I'm being honest here. :)\\n\\n\r\nOverall: 9/10\\n\r\nI've watched countless Action/Ecchi/Harem/Romance animes out there but this one is one of the best for me! The girls of this series were just perfect, Hyoudou Issei is like a dense type MC of a Harem series but he has reasons for it, Unlike those other MCs that are so dense af out of nowhere. High School DxD is the type of an Ecchi/Harem series that has both \"Plot\" and Plot.\\n\\n\r\nThat's my review for this season! If you are planning to watch this series then go for it! I highly recommended this anime!\\n\\n\r\nI CLAIM IT! SEE YOU AGAIN IN THE NEXT SEASON OPPAI DRAGON!!!",
            "date": "2018-07-04T05:46:00+00:00",
            "helpful_count": 8,
            "mal_id": 282956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7153966.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/INFERNAL_FURY",
                "username": "INFERNAL_FURY"
            },
            "url": "https://myanimelist.net/reviews.php?id=282956"
        },
        {
            "content": "Look, I know this is now being done by a different studio or whatever, but I loved this anime. And now it seems more like it was a cheesy fanfic someone wrote using Issei and the girls but not the original enemies we know and love-hate. Oh, and don't get me started on the HUGE focus on the \"grabbin' Dragon\" song and dance throughout. It was honestly pathetic. \r\nI admit, they pulled off some quite good fanservice and cuck scenes, and the fox was cute, but overall there was none of the surprisingly compelling story of the original 3 seasons.\r\nThey also only used half ofthe girls.",
            "date": "2018-08-11T09:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 286191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7330901.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kodokuna_Gemu",
                "username": "Kodokuna_Gemu"
            },
            "url": "https://myanimelist.net/reviews.php?id=286191"
        },
        {
            "content": "High School DxD Hero completely retcon's BoRN's ending for a different direction and thus continues the crazy fanservicey mythological adventures of Hyodou Issei.\r\nSince this is LA's first review on MAL on the High School DxD series, LA might as well give LA's opinions on the series before tackling this installment of High School DxD. The first season was a good stepping stone to the series, applying all the world building as well as Hyodou's weaknesses to set us off, though the fanservice vs. tension did get in the way but nonetheless the first season was getting used to balancing it. \"New\" was dove in deepto it's supporting characters, from Yuuto to Akeno as well as expanding the world building of the underworld and heaven in the process. BoRN was expanding even further on the the fact that legends and myths are REAL in High School DxD's world thus they become allies and villains set out to do their plans just with some rocky character development here and there especially from Hyoudou himself and now in Hero well...\\n\\n\r\nOhh and LA is Team Akeno by the way anyways carrying on...\\n\\n\r\nBecause of the retcon Hero immediately did, LA DID welcome it as LA was indifferent to BoRN's ending as it DID come out of nowhere but was melodramatic as all hell in the process, Hero's beginning fixed that to say the least.\\n\\n\r\nSo from that Hero leads into the \"Kyoto arc\" as well as the \"Rating Game with Sairaorg Bael\". The Kyoto arc leads into the previous villain in a previous season of Cao Cao voiced by Kosuke Toriumi, the leader of the Khaos Brigade as well as new characters Kunou voiced by Sora Tokui a kitsune youkai trying to find her mother which the Occult Club (Second Years anyways) finds while on their field trip to Kyoto. To say the least the Kyoto arc feels similar to BoRN's structuring of plot, where a large threat arrives and where Hyodou and the gang needs to stop them from enacting their plans in the process, LA was fine with the Kyoto arc and was it was presented as well as the character development and improvement to the Second Years' power dynamic (plus the addition of screentime to Roseeweisse  to sub in for Akeno..well LA anyways), plus the villain of this arc IS such a huge threat that links in as to why they are in Kyoto as well as their plans that involved Kunou's mother and linking all this together was great, that and a mystery of a mass groping incident which has links to Hyodou's growing power. ALL in all, Kyoto arc was decent and reflecting the previous season's callbacks and structuring.\\n\\n\r\nIf Kyoto arc was reflecting BoRN's great points, then the Rating Game with Sairaorg was a better version of the first season's Rating Game. See this arc was focusing on three things, Hyodou and Rias' relationship and development to Sairaorg as a character. Hyodou and Ria's relationship by all means was ALOT of people's problems which was encased by Hyodou's denseness to Rias' advances especially in BoRN but Hyoudou is such a harem seeker and wants to help anyone as possible (harem or not) that this kind of mindset gives a gaping hole on Rias which Rias's outburst was warranted, she was more or less feeling left out because she was \"President\" in Hyoudou's eyes. To that, LA knows what most of you will say that \"Hyoudou is and ALWAYS dense, he doesn't change\", actually Hero and by extension from the start of the second season, though he has the perverseness to him, Hyoudou did grow through all his fights he encountered and learned from that to being the best fighter and protector to the Rias family in the process...he DID grow and move on but with the lingering guilt and fear he still has on the first season which Hyoudou by the end of this season...he moves on and finally he finally takes the hint and thus Hyodou FINALLY does and say to Rias after four seasons! The main focus however does go to Sairaorg and he's quite different from the many \"blanket evil characters\" Hyodou has meet and his backstory and his goals are VERY similar to Hyoudou himself. Sairaorg by all means has alot of similarities to Hyodou, being a powerful character but is currently unrecognized by the underworld and Sairaorg wanting to gain his notoriety and his family pride back and will do anything for his family (mainly to do with his comatosed mother and wanting to revive her), his not a black or white villain but more like he's the friendly rival to Hyodou and someone Hydou wants to strive to be and maybe even beat which is what the climax for Hero leads up to for this arc. \\n\\n\r\nDdraig this season does gets development in the form of Hyodou's powers growing exponentially by the means of Hyoudou speaking to the predecessors of the Red Dragon Emperor and this only improves in the world building front but more on Hyodou's increasing power and sometimes his beliefs conflicting with his predecessors and seriously considering all the powerful rivals and villains Hero gives us, you KNOW Hyodou grows crazy strong this season to keep up with them. Yes because of this, Hyodou is the only one to stop many of the threats in Hero by the end of all this, but Hero did at least manage to make use of it's cast and make screentime for them in terms of battles at least as powercrept Hyodou is. Hyoudou also gets titled as the Boob Dragon and even has his own children kid shows in the underworld due to his notoriety in the underworld and considering High School DxD's nature of fanservice in even some of the most tense moments, yes even this becomes a plot point, tonal dissonance sure, but it's within the nature of High School DxD to do this...at least for us to breathe in a ways when the batshit crazy battles that does happen.\\n\\n\r\nOn speaking of the Boob Dragon, well Hero doesn't screw around with it's fanservice, though if your watching it censored...then....your missing out on some of the fanservicey moments what with Hydou's continuously expanding harem trying their luck with Hyodou in the process. Watch Hero uncensored if possible as Hero is unbashed about it's fanservice but it's to the fourth season...seriously FOURTH, it's to be expected.\\n\\n\r\nWith that, well the animation studio had another change, from TNK to Passione and well ALOT of people didn't like the new polished and sleeker character designs but LA was fine with it because at the very least the animation was consistent even it's more batshit crazy battles. Passione did a very good job all things considered, from the newer character designs, great battle animation and decent backgrounding reflecting the previous seasons. \\n\\n\r\nVoice acting, well LA's bias to Shizuka Ito as Akeno but her screentime was VERY small to say the least. but with the original voice cats back again as well as some new ones like Sora Tokui as Kunou and Asuka Nishi as Ravel Phoenix, but LA would most probably give MVP to Yoko Hikasa as Rias this season not by sheer screentime but Rias went through ALOT of stuff this season even during the Kyoto arc and that Yoko Hikasa just really did a great job once again reprising her role as Rias and giving us great range. Overall with the huge cast of characters new and old, the voice cast of High School DxD was expectedly great.\\n\\n\r\nHero seemed to have learned from it's previous season's mistakes while at the same time greatly improving on it's strengths in the process, from Hyodou and Rias' relationship, giving us high stakes and new settings while keeping the nature of High School DxD in the process and finally giving us something of a satisfying ending in which it can definitely lead to something more in another season if possible but if not, still allowing Hero to be a great installment to the series. In terms of seasons, LA did find Hero to be better than New, but it's on par or maybe even surpassing BoRN because Hero just hit all the sweet spots in terms of characters and plot in which BoRN couldn't hold out by the end but still did good on it's characters. \\n\\n\r\nALOT of people watch High School DxD for the \"plot\", but High School DxD Hero clearly shows it can be much more than that.",
            "date": "2018-07-04T17:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 283006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=283006"
        },
        {
            "content": "First off, I am a light novel reader, and I love how we get a great adaption, but this season could of been better and my closing notes will detail why.\r\nStory 6\\10\r\nBefore I get crucified, I find volumes 9-10 which this series was covering the most boring while reading. I was also getting used to all the changes because of a new studio so it was hard to be engrossed as well. Since season 3 was not fully cannon and missed a ton of important parts, they had to skip a lot so some things were skipped in order to keep cannon which confused everyanime only watcher I talked to, and it was annoying for me too. Examples also being the rating game Sitri VS Gremory.\\n\r\nSound 8\\10 not including old tracks 4\\10\\n\r\nThe OST of high school dxd is great, but this season added hardly any new tracks and the weakest op and ed. I give dxd 8\\10 overall on sound but judging season 4 tracks alone its bad.\\n\r\nCharacter 9\\10\\n\r\nNot really much to say here but the faithfulness to the light novel helped the characters which we all love but some like xenovia just seemed utterly off but thats just one thing. If you are here at 4 season you know the characters are great.\\n\r\nArt and animation 3\\10\\n\r\nMan on man did the art style start a flame war, I saw it divide the fandom. I think the new art style is okay and if it was just the art I had a problem with, I would give this a higher score but we will get to the animation in a second.\\n\r\nThey switched up character designs, my waifu akeno looks derpy and the full changes they have done to characters turned me off the most as it did with others but some look fine with the new art style like asia, rosweisse and others and some like Akeno and Rias look worse. The old animation by TNK looks more mature and the fanservice in the last seasons made it look as if all the characters chest looked different and different body types, now the boobs look almost the same.\\n\r\nThe animation is bad, if it was good I would give this a 7\\10 and say I am just not a fan of the new art style and leave it but its bad. The facial expressions are done horribly, lots of standstill images, choppy at times, action looks like something from ten years ago and fight scenes were choreographed better in the past. Character designs as well as them using a 3d painted background while exploring kyoto in episode 3 or 4 which looked awful. Animation was bad and with getting used to the utterly 180 art style changed that took away from the show. Part of me wants to give this a 2 almost.\\n\r\nEnjoyment 5\\10\\n\r\nHonestly, this season did not have me looking forward to the next episode at all unlike the other seasons of dxd, the art style changed took time to get used to and I still do not like it since many people were drawn to the gorgeous art style of TNK and we get this boring plain art style thats not fun to look at all. The facial expressions I noticed right away like others and once you noticed it, you can't ignore it. If you do not know what I am talking about count your blessings because you will notice it next time you see it or rewatch it. Rating game was not as fun as others as well as this was the most boring parts of the LN for me. I will say that dxd is one of my favorite animes of all time, but I really can't care too much for the anime at the moment so I may stick to just reading it. With the flame wars and backlash on this season however I don't think we might get a season 5.\\n\r\nOverall 6\\10\\n\r\nI wish this season was better, I really do. I even prefer the non cannon season 3. The art style divided the fandom and I would even go as far to call the fandom more toxic than its ever been. The reason we have a new studio is because TNK was not following the LN properly so the series got handed over to passione, the studio that really should not have it out of all studio's I could think of.",
            "date": "2018-06-23T00:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 281973,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249550.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ninjaguy2511",
                "username": "ninjaguy2511"
            },
            "url": "https://myanimelist.net/reviews.php?id=281973"
        },
        {
            "content": "If you liked the \"key\" parts of the last 3 seasons,\r\n     -Boobs\r\n     -panties\r\n     -peeping\r\n     -boobs\r\n     -music\r\n     - p l o t\r\nThen you will most likely enjoy this season tooo\r\n     The art is fantastic, as well as the music, and it follows up on the last 3 seasons stories, and just watching the MC (Issei) grow stronger and overcome his problems feels nice. Im also mad the he gets all the women and i cant get even one.if you can overcome the temptation to just stare at [certain] places, this series is truly enjoyable, and its full of comedy. in case youre a perv who really likes bobs and vagene, this anime is ok for you ig this is getting awkward. But yeah, all in all its a trullly enjoyable anime\\n\\n\r\nedit: this is ridiculous. this kid can kill god by calling out boobs\\n\r\nedit 2: he touches them and becomes invincible",
            "date": "2018-06-20T15:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 281688,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6880775.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Squiddzy",
                "username": "Squiddzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=281688"
        },
        {
            "content": "Sorry i might copied someone's review but i also feel the same that this anime does not have that much of a harem genre anymore it is more of a fanservice and romance anime now with demons and supernatural stuff and boobs \r\nStory = 8/10\r\nStory is 8/10 because the anime is more of a Romance anime now, it isn't like before but i am not saying that its bad but i think if you have the genre Harem you should focus on it more because the development between male and female characters is more on one girl which is Rias which the Mc Issei likes\r\nArt=9/10\r\nArtis 9/10 because the appearance is different from the other seasons especially the girls because some of the girls changed not by attitude but by \\n\r\nappearance so i rate it 9/10\\n\\n\r\nSound=9/10\\n\r\nSorry  i really do not pay attention that much to the sound of the anime but what  i think is the voices of the characters change \\n\\n\r\nCharacter=9/10\\n\r\nthe only thing i think i can say is that it is good and a lot has changed except for issei\\n\\n\r\nEnjoyment=8/10\\n\r\n4th season of the famed Harem and Ecchi is good and i am not saying it is bad but like i said earlier it does have that much of Harem anymore which i need because i am in a Harem and Ecchi club in myanimelist so Harem and Ecchi is important to me but it does not have that much of enjoyment anymore\\n\\n\r\nOverall=8\\n\\n\\n\r\nP:S this is my second review so please bear with me if its bad\\n\r\nalso some parts of the other main girl Mc's change too especially there faces\\n\r\none think thou asia did not grow oopai and kaneko also \\n\\n\r\nalso ep5 fighting scene is very good",
            "date": "2018-05-17T21:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 280826,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178860.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FTOPICD",
                "username": "FTOPICD"
            },
            "url": "https://myanimelist.net/reviews.php?id=280826"
        },
        {
            "content": "Beautiful, Brilliant, Epic and Emotional! Season 4 is outstanding and before watching this I didn't have big expectations but how foolish I was to think like that...\r\nStudio Passione despite changing the art style managed to give this show some substance, created a fitting emotional atmosphere  for exposing the character's bonds, a better presentation for the characters and managed to give more screen time to one of the most badass characters Azazel. Another reason to check this season out beside Azazazel is Sairaoug and goddam he is one of the manliest characters from this show! Why? Because like others who rely on sacred gears andother stuff this man fights using his bare fists and his overwhelming fighting aura..A man with honor ,a man of his word who respects his opponents  giving everything he has during a fight!\\n\\n\r\nIssei and Rias's bond in this season goes beyond master servant and they finally managed to get to a starting point in their new relationship....And what I like and always will love from this anime are the girls who aren't like those stupid stereotypes who say \"Die\" or \"Baka\" after the main character sees them naked or half naked in contrary the girls are the ones who almost jump on Issei(Lucky bastard...) with their beautiful shaped breasts who will make any man jealous.....\\n\\n\r\nAs for the characters's traits no worry this season keeps up the good tradition and you will see your beloved Xenovia keeping up the good work in making babies with the red emperor, Koneko healing Issei wounds , Akeno sucking the poison from his body and etc...\\n\r\nThe story is not something overwhelming or outstanding it's the typical power-up main character who fights the other power-up characters but in this season their are some moments who give a good reason  Why and for Who Issei is fighting . Is enjoyable so what do you want more? Plus the beautiful girls will put a smile on your face after a bad day....\\n\\n\\n\r\nThere are some emotional moments in this show that  gave me a nice surprise, some fights were predictable but damn  enjoyable I won't deny that. The \"Emperor Boob\" stuff was kinda out of place sometimes but I am glad it didn't ruined the heartwarming moments and the emotional atmosphere created around the characters. I think what I liked the most from this season is how this show managed to go into Issei's mind during his fight with Sairaoug depicting his thoughts, emotions and reasons for why is he standing there.\\n\\n\\n\r\nGive it a try and don't listen to those rumours about the art style being bad in contrary for me the new  art style  made characters like Xenovia, Irina, Asia and Koneko look better than their previous designs....This show is damn enjoyable and the fanservice is done well and this is coming from someone who doesn't watches this kind of shows but appreciates what this season has accomplished so far!\\n",
            "date": "2018-07-04T10:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 282970,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282970"
        },
        {
            "content": "I watched High School DxD Hero expecting to get the same kind of funny perverted comedy and sexy characters from the previous 3 seasons but I was sadly disappointed, this is a review from someone who owns Seasons 1-3 on Limited Edition from Funimation and really enjoyed this show. \r\nIt turns out that for Season 4 (Hero) the creator of High School DxD changed the studio that worked on the anime from Studio TNK (the one that did seasons 1-3) to a new studio named Passione because studio TNK changed the ending of Season 3 without the creators permission which led to the creator switchingto a new studio for season 4.\\n\\n\r\nThe change is studio is very apparent in the art style, animation quality, and scenes for the new anime, and it honestly doesnt feel like im watching the same anime that I grew to love over the previous 3 seasons. Some of the differences from the previous 3 seasons are\\n\\n\r\n1) The characters look different for example they have a little bump around their triangle shaped chins in some scenes that makes the chin look crooked, the shadowing on the characters faces looks different too, the scene where Rias was naked in bed in the end of episode 1 next to Issei her leg looked huge from the side view. \\n\\n\r\n2) In some scenes the detail on the characters is so bad that it looks like a little kid drew them.\\n\\n\r\n3) Issei is made to act more like a cartoon character in season 4 by puffing out smoke from his nose when he gets aroused, getting more nose bleeds, and making goofy perverted faces when hes aroused which makes him seem like a much less of a heroic character with epic dragon armor and more of a goofy pervert who got into a very lucky harem position.\\n\\n\r\n4) They keep introducing new villains in each episode and then talking about \"past fights\" they had with Issei but their completely new characters that were not shown in seasons 1-3, they should introduce the characters properly instead of trying to cut corners and reference fights that never happened in the previous seasons of the anime or at least werent shown in the anime version of the show (without reading the light novels or manga). \\n\\n\r\n5) The intro and outro videos arent as epic or sexy as in seasons 1-3, they seem more generic. \\n\\n\r\nHonestly it feels like im watching a completely different anime instead of the High School DxD I grew to love over Seasons 1-3, I own the Limited Edition Funimation releases for the previous 3 seasons but im not sure if I will buy Season 4 or not, I wish they would have kept the same studio that made the previous 3 seasons. It feels like when you follow a show for a long time and grow to love the characters then the next season comes and you find out that the Director changed some of the actors who you grew to love for people that look similar to them in the hopes that the viewer wouldnt notice the difference in actors and keep watching the series, well High School DxD the fans have noticed and we're not happy.",
            "date": "2018-07-07T21:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 283338,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/401498.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Reinier",
                "username": "Reinier"
            },
            "url": "https://myanimelist.net/reviews.php?id=283338"
        },
        {
            "content": "High School DxD is one of those anime series that remains consistent throughout each new season. What I get out of the anime is good characters, comedy,titties,red dragon machine battles,and more titties.\r\nHonestly I just watched the High School DxD series just for the comedy,characters,and titties. I don’t find the lore of the Dragons and the battles to be interesting at all. I just fast forwarded most of the fights in 2x speed. If the anime wasn’t funny and/or I didn’t like the characters I would have dropped it immediately within the first few episodes like Tu Love Ru….titties aren’t enough for me to commit hoursof watching. \\n\\n\r\nI love all the characters in this anime, Issei is so funny, the way he talks about tits and girls is bursting with passion. My favorite girl out of all of the girls is Asia Argento, I feel she is under rated. I feel most guys just like Rias or Akeno and I like their personality too but I like my girls skinny petite and not big and busty.",
            "date": "2018-05-21T20:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 281127,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461807.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AkiraAmon",
                "username": "AkiraAmon"
            },
            "url": "https://myanimelist.net/reviews.php?id=281127"
        },
        {
            "content": "While the story is terrible compared to the three earlier seasons, it is still a barrel of laughs. Not because it has good or clever jokes, but just the sheer amount of stupidity. \r\nIt brings back memories from the first season, which I absolutely loved. It was just excellent. It was so stupid, but it didn't matter, the show made you laugh either way. \r\nThis season manages to catch this feeling very well. Albeit at the cost of emotional moments. While the emotional moments are often ruined, it feels kinda nice to just take a step back, and watch it just to have fun.\r\nThough thistactic of drawing in the viewers is likely to backfire because many of us (myself included) no longer watch the show for the stupidity, but for the story. \\n\\n\r\nWhile I definitely do miss the amazing storyline and emotional moments, it is incredibly nice to just settle back to something similar to the first season. \\n\\n\r\nThough I say this is similar to the first season, it does lack a lot of key points the first season had. Jokes in this fourth season have dropped in quality, the story has fallen completely apart, and the art style is appalling compared to the three previous seasons.\\n\\n\r\nEven though it lacks these key points, it is undoubtedly still fun to watch, and I'd recommend it to anyone into comedy/harem anime\\n\\n\r\nI also wanna say that (supposedly) both the art and story is written and drawn in a manner that is closer to the light novel. I can't confirm this though since I haven't read the light novels nor do I think I will,\\n\\n\r\nBtw let's not talk about Taiikukan-ura no Holy. The remake of the last four episodes of the third season.\\n\\n\r\nI refuse to call it canon.\\n\r\nI simply refuse.",
            "date": "2018-05-15T12:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 280638,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mr_Floppy_Donkey",
                "username": "Mr_Floppy_Donkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=280638"
        },
        {
            "content": "Well this is a genuine surprise. I was so thoroughly disappointed by Born that I almost didn't even bother with Hero, and the new art style/character redesigns brought me right to the edge of abandoning ship five minutes into the first episode. But I endured, and I haven't been so glad of anything since I realized I can take concubines in CK2.\r\nThis art style suits the concept of DxD way better than the old one, although it took getting used to. Rounding of faces and the drastic increase in boob sizes are obvious changes right out of the gate, but improvements in movement frames, characterexpressions, and increase in color contrast make it a much richer experience. Switching studios really allowed this series to turn 360 degrees and walk away from the total shitshow that was Born.\\n\\n\r\nBesides mammoth expansion of honkers, Issei's growth as the Titdragon melds well with better jokes and more interesting characters, as well as taking the narrative away from a \"big bad evil\" and refocusing on a tighter problem to solve. A friendly rating game was the perfect solution to the lame \"Chaos Brigade,\" because not only was that a totally stupid antagonist it was also boring af to watch. \"Oh my god dude look it's Loki I wonder if he's going to be a tricky trickster wow look at that he did a tricky thing ha ha I'm so fooled by the trick there\" versus \"a friendly fight with a guy who can punch holes in reality by sheer willpower and is a legitimate bro.\"\\n\\n\r\nThis is a full-spectrum anime with true depth of character. I am so pleased with the reversal from S3 and I absolutely cannot wait until S5. Do recommend without reservation.",
            "date": "2019-03-06T06:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 302998,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=302998"
        },
        {
            "content": "I loved this season new art style but got use to it I'll miss the old style but anyways in opinion this is my 2nd favorite season good story and the sound on this was good as well it's clear my enjoyment on this season was a 10 man the last episode made me so emotional but i was mainly happy it looks like Rias's and Issei's relationship's began to progress near the end of this season and if you saw what was after the credits it's very likely a 5th season is coming if your a big fan like me your hyped as well.",
            "date": "2019-04-06T02:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 305594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XanderHowell11",
                "username": "XanderHowell11"
            },
            "url": "https://myanimelist.net/reviews.php?id=305594"
        },
        {
            "content": "I watched all the High School DxD's in 3 days, and I have to say that when I finished season 3 i was like \" Hot damn now that was some fucking awesome story line, character development, hype, and action that I have seen\" I hadnt felt that way since I saw Gohan go SSJ2 when i was 11. But this shit. Season 4, legit 180 turn in the completely wrong dimension. Here are some reasons why.\r\nReason 1: THE ACTUAL GOOD CHARACTERS ARE GONE FOR LIKE 4 EPISODES\r\n- Rias and Akeno are my favorite, but I am forced to endure 4 episodes in a rowwith their fucking bath cameos, know I like them and all but I prefer watching their interactions with Issei and I am sick af of watching them fucking complain that he is gone. \\n\\n\r\nReason 2: Issei... I dont know when the fuck you are ever going to learn from your fucking mistakes. Like, jesus how many more fucking times we gotta do the same shit. Some guy kicks ur ass, you ask for boobs and then u get powerful. I understand that thats the whole premise of the show. But for fucks sake this is their fourth season if we are throwing the whole fucking plot out the window at least have some character development.\\n\\n\r\nReason 3: I was drained by the time I was on the tenth episode, I was already pissed with the whole \"oh why doesnt he call me Rias thing.\" like bitch just fucking ask him. I know that in the finale she said \"Oh I didnt have the courage\"... like hello, you pressed ur fucking naked ass body against him the first fucking time you met him yet you cant have the fucking courage to legit just ask him to call you by your frucking name. Like hello what kind of fucking monstrosity does that entail. \\n\\n\r\nIn conclusion, prepare to see the biggest fucking ball drop in terms of disappointment when you watch this season. Like if it werent for the confession at the end and the nice epsiode 1 that we had, I wouldve flat out given this shit a goddamn 3 like it was that fucking horrible. Whoever took High School DxD needs to get a boost right to the goddamn nuts cause they just fucking cucked the rest of us into the next goddamn dimension.",
            "date": "2019-02-26T19:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 302540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7835797.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Daiymo1",
                "username": "Daiymo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=302540"
        }
    ],
    [
        {
            "content": "It was a enjoyable anime. I love how it ends in the end ( no spoilers).  \r\nI have watched every seasons of DxD. \r\nI find the character nice and beautiful, but the one I love the most is Riaz.\r\nShe had been nice too Issei and all the members of the council. I loveeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee her. For real. I feel a little bad about the underratement of DxD. Please reconsider about the rate, but yeah. I hope this review helped you guys, because this anime ment so much for me. It was like filling my bad days with light and joy. All of it came fromDxD.\\n\r\nI HATE HAREM, but this one was just too good. I want you guys to reply about DxD. Please and have a good anime month!!!!",
            "date": "2019-01-15T03:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 299086,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7589619.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DarkandDark2004",
                "username": "DarkandDark2004"
            },
            "url": "https://myanimelist.net/reviews.php?id=299086"
        },
        {
            "content": "\"I watch it for the plot.\", the common excuse given by dxd fans which actually holds true for the first 2.5 seasons. Yet hero seems adamant about falling short of expectations set by its predecessors.\r\n*I AM NOW GONNA TALK ABOUT HOW SHITTY THE BREAST DESIGN IN THIS SEASON IS*\r\nAs i watched through this season of Dxd, it is obvious that the new director/art director is probably a virgin that have not seen boobs in real life. Note this has nothing to do with the new art style despite my preference for the older style. This is extremely noticeable when you compare Akeno from Bornto Hero; for some reason, the team decided that her breast wasnt big enough and have to bring it to the point of those in hentai. The breast and physics animation is comparable to that of Shinmai Maou no Testament. If you have no qualms with how breast are shaped there, you'll have no issue with this season. \\n\r\n*I AM DONE TALKING ABOUT BREAST DESIGNS*\\n\r\nArt style has taken a new change which made me thought that the studio would be able to play this into their advantage and have more fluid animation/ jiggle scenes. I was wrong. Despite the soft designs and character marking, animation is comparable to that of season 1's choppy cuts. This new art style is a waste on this studio and its directors.\\n\\n\r\nStory wise, dxd has been going downhill since season 3 whereby there have been wasted opportunity to create exciting conflicts between the protagonist and adversaries. For this season, there are 2 main arcs, Hero factions in kyoto and the Bael family arc. Both arc are extremely detached from one another whereby consequences from one seems to play little effect to everything outside the dxd universe. There will be several instances where you may question the rational behind the character's actions (ie issei firing a beam at Cao cao for the sake of \"landing a hit\") and be given no resolution. The main attraction of the action aspect of dxd was its \"chess\" game and how underdogs/weaker forces are able to turn the tide. This season follows the same generic yelling motion as end of \"born\" by having Issei asspull a win because they're the good guys. Issei has also grown more powerful that his allies including kiba which downplays all interesting strategy that season 1 had.  \\n\r\nIssei has grown to be the protagonists that i really dislike in anime. The sort that always talks about perverted stuff but when put into the situation, rejects it for reasons(???). The character is shallow at best apart from his harem situation.\\n\\n\r\nPerhaps dxd's lackluster-ed story in this season is the fault of its source material but with how things are turning out for this season, whatever comes next is probably not going to be worth looking out for.",
            "date": "2018-08-10T12:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 286121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Wuzzer",
                "username": "Wuzzer"
            },
            "url": "https://myanimelist.net/reviews.php?id=286121"
        },
        {
            "content": "TLDR : Hero is worth a watch, 1000x better than the last 3 seasons, which i did not enjoy much. art is an upgrade in my eyes, but does remove some aspects of the anime, but nothing major. Nice looking 12 episode anime for action, lewd ecchi lovers!!\r\nSeeing the fourth season of High School DxD Hero, I saw its modern new artstyle, which caught my eye, making me watch all of the three previous seasons of it. Forcing myself to watch the first three seasons was excruciatingly painful. The first two seasons were painfully annoying to watch and bear, as there was so much netorare,sexual undertones, outright underlying rape and dark scenes. Combine that with useless MC issei, you get a show where you see a useless kid get carried and watch him suffer and the girls around him to suffer in the darkest ways possible. Over the first two seasons, he barely progresses and gets any more powerful to do anything worth watching. He is actually useless whenever a real problem arises. It was painful to watch and I kept skipping every 5 seconds because it was too painful to see the characters I want to succeed and be useful, be absolutely useless. \\n\\n\r\nHowever, Born and Hero (3rd and 4th season) changed this. First, in Hero, issei ACTUALLY does something. He ACTUALLY is powerful enough to beat up the bad guys, win over the girls and keep them and not be completely useless. There are times when he is so dense and dumb it is painful, but every anime has this, and can be looked over, PLUS, it is not as major as it was before. He makes up for it. \\n\\n\r\nThe show actually became... ENTERTAINING. Before, I would say the first seasons were barely entertaining, only in the Final 12th episode where issei can finally beat the shit out of the bad guy. The ecchi is good, and well placed on the most part. Before, in the first few episodes, the ecchi was terribly placed. Ex: Asia is dying and we are expecting a tear jerking scene, only to see her fucking boob hanging out for no good reason. It just has boobs in every scene for the sake of having boobs. It's not good ecchi, cause it just removes all the effectiveness of the plot. However, in hero, there is less random ecchi in fights, UNLESS iseei is going to power up by touching boobs or using this DRESS BREAK ability, where the ecchi is actually contributing to the plot and adding humor, not making boobs hanging out at terrible times just to have boobs in the scene. \\n\\n\r\nArt... now this can be contriversal. Many people liked the first 3 seasons art, claiming it to be \"mature\" and \"more detailed\". I honestly think that in 2018, that artstyle would be outdated. There is hardly any anime today that looks that way anymore, it looks... \"old\". Personally, I don't really mind, but I can say that I am definitly a fan of the new art. Looks more easy on the eyes, the girls are more cute, but definitly less \"mature\". The ecchi and lewd scenes are still nice and boobs are still there and well drawn ;). \\n\\n\r\nThe animation... is well typical, nothing amazing but gets the job done, looks nice for action anime.\\n\\n\r\nplot/characters... well this is contriversal. Honestly, if you are watching high school dxd, it prolly isnt for the plot but for the ecchiness. Nonetheless, Issei actually progresses as a character and so do the others. There is romantic relationship development in this season between issei and rias, which is nice, but only in the last episode sadly. but honestly, issei is the only annoying character out of them all, but not as annoying as last 3 seasons. He is bearable now. \\n\\n\r\nThere is actually a plot somehow. Honestly, if you don't look too deep into, as this is an ecchi anime, it is kind of cool and mostly just there for drama and fighting and action scenes. Kind of like naruto or one piece or shounen plots, just there to make fighting scenes and action and adding more girls to the never ending harem. \\n\\n\\n\r\nty for reading :D\\n",
            "date": "2018-08-08T18:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 285964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6229831.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wollyy",
                "username": "wollyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=285964"
        },
        {
            "content": "The surprisingly highly regarded guilty pleasure show, (the fans can confirm) makes another return after a long time break, this time with a new studio.\r\nThe past seasons were mostly fine with the second season being of great status, this season had a huge potential from what we've seen from the clatter of events in the third season, but hey, if this sounds familiar, think about what season three was to season two. It didn't greatly deliver on its predecessor's promises but it was okay. And then comes High School DxD Hero promising with something even greater than the last one, will it deliver? I questionmyself at the beginning, I knew I had to watch it sooner or later, but the pay off was as oblivious as one's vision on a moonless night.\\n\\n\r\n- Story (7.2/10):\\n\r\nMuch like the other seasons, fanservice is a massive chunk of nonsense, pills amoung pills stacking up on top of each other, but on some rare occasions, a faint aroma of a spicy plot can be felt.\\n\r\nUnlike the other seasons, High School DxD New was a magnificent one story wise that set up a pretty high standards for its successors to surpass, but that has got to yet happen, but with the work of the miracle worker, the Boob Dragon (I know it's weird for newcomers), anything is possible, they just don't have to underestimate what good character development can produce.\\n\r\nFollowing the events shortly after the previous season, but unfortunately not covering a really good arc that has appeared on the source material, a rating game between the Gremory and Stiri households, there we get to see Saji going all out revealing on his new abilities, and oh boy those were some exciting ones. That aside, they really should have included it on this season, but all we got were some references that left most of the anime-only-fans confused.\\n\r\nThis season consists of two main story arcs, the first half of the season covers the main cast (mostly, excluding a few) going to a trip to Kyoto where they get involved in some crazy mess that has them fight against a monstrous organization that claims to have enough power to destroy the gods. They have to rescue a kidnapped fox with nine tails (sounds familiar enough? trust me, there is more of this). It wasn't really all that exciting, but we get to at least see Issei figuring out how his powers work, and improving on them.\\n\r\nFor me at least, it all was around the second half of the shown. that was the closest it can get to reach the second season's hype for it was probably the most entertaining rating game on display. Where the Gremory team gets to fight one of the Bael family, Sairaorg, a yet interesting character with a lot to him than we thought at first. I can at least say that this season had a storytelling compared to that of the third season, which I think was good.\\n\\n\r\n- Art (7.8/10):\\n\r\nAs I've mentioned before, a new studio is handling High School DxD for now, that's Passione if you're interested. And with new teams and workflow comes new animation techniques and quality.\\n\r\nFor me, I was so used to the old studio's way of doing thing that I genuinely had trouble recognizing some of the characters, most of them look a lot different, be it the color contrasts change or generally the design, but it's not something that concerning, a couple of episodes should be enough to get you used to it. Aside from the art style being like a damn stranger, the animation was a huge step up. It works very well with the new art style, everything looks more fluid and impactful.\\n\r\nSomething I really disliked here was that apparently, every single girl in the cast had an increase in her cup size, and it was disturbing, I wasn't prepared for a busty Asia. Somethings just have to stay the way they are.\\n\r\nBody proportions aside, some faces really looked very unnatural and unattractive, like my dude, Kiba, like, where did it go wrong fam? he was a freaking handsome pill of paths and now he can barely hold a natural facial expression.\\n\\n\r\n- Sound (7.8/10):\\n\r\nFor the most part, both the opening and the end theme songs are likable, even from the first exposure. Differently better than the second season's second opening, that shit can never be recovered.\\n\r\nThe voice acting is just at its best, I can't imagine what process they go through to have Issei say some ridiculous stuff while maintaining a serious tone of voice. the shouting and everything was epic and emotional, I'm just glad they didn't have a different team do the voice acting, that would have been a demonic disaster.\\n\r\nSomething that really puts me in the most for some Juggly effects are the excellent soundtracks, no matter what you change, please don't replace those. They have stuck in with the show from the beginning till this late on, they even left a landmark on my memory, the show wouldn't be the same without them.\\n\\n\r\n- Character (8.0/10):\\n\r\nFinally, some actually good characters to look at too. Along with some other characters that we previewed in the last season, Sairaorg proved to have a lot of depth to him, his motive and backstories, everything makes you root for the guy. And for you Rock Lee lovers, this is a character that you will treasure.\\n\r\nFor once, Issei and Rias had some focus on their relationship and treats. Seriously, Issei is completely a different person, one that can control his emotions and realize his mistakes very quickly. And Rias isn't just another character that's just there for either comic relief, of extreme fanservice. She even managed to be the necessary switch for Issei's power at this point. and the two finally made up a solid relationship by the end of the show. Issei and some others have never been so close to being high ranking devils, it's all for the fifth season to answer.\\n\\n\r\n- Enjoyment (8.3/10):\\n\r\nWe all know what sort of guilty pleasure enjoyment we get from this. And as a Sage once said, “there are two kinds of actions in this show”, if you don't get what that quote says, then you're only inches from going to heaven.\\n\r\nI love fanservice as much as the next guy, but it can get annoying, out of place, and just look bad and cringy. And there is a lot of cringy in this season, some might say, it's the first time High School DxD has been this cringy. But that doesn't obscure the good parts.\\n\r\nStorywise, the hype was real, especially on the second half, you could barely contain yourself from watching those oddly satisfying punches and finishers.\\n\\n\r\n- Overall (7.8/10):\\n\r\nAgain, if you already caught up with the first three seasons, don't pass on this one. You might not like the new animation, but the story and fanservice are at least still true to itself. And seriously, if you don't care enough about the characters, there are new ones that are just as good if not better. But if you're just fed up with the franchise, I trust that the trilogy can hold up as a great guilty pleasure show on its own.",
            "date": "2018-07-21T05:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 284445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5898843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eoussama",
                "username": "Eoussama"
            },
            "url": "https://myanimelist.net/reviews.php?id=284445"
        },
        {
            "content": "High School DXD as a series could be best described as \"mediocrity done right\". \r\n**((PLOT))**: The plot of this show is whatever. You can see nearly every development that happens from a mile away if you're familiar with shounen anime tropes. One part of the show in particular, however, did keep me in suspense until the end. Obviously, I won't discuss it here since this is a review; go watch the show if you're gonna!\r\nART: Surprisingly enough, I'm not about to rant about the change in art style. The show only looks noticeably weird if you binge watch the previous 3 seasons before starting thisone. I AM going to complain about the lazy-ass animation. Half of the show looks like a PowerPoint presentation showing trash-tier waifus smiling while looking at the character who is speaking. This is not to mention the robotic movements of every character that sync up with one another. Bottom line is: at least the boob physics looked nice.\\n\\n\r\nSOUND: I don't care about the OP and ED's in most cases, but- Nah, I still don't care. The voice acting was as mediocre as the rest of the show. Nothing more to say really.\\n\\n\r\nCHARACTER: I loved a lot of the robots in this show. Contradicting as that statement may seem, It's true. I detest the church trio, but I actually did enjoy the rest. Akeno didn't get much screen time however. I vote #JusticeForAkeno. All jokes aside though, the only reason category got above a 5 was because of the character development between two specific characters whom I will not list.\\n\\n\r\nENJOYMENT: Yeah, I liked HSDXD4, what about it nerd. Jiggly tiddies never did me any harm and I'll continue watching the series if it actually manages to get a 5th season. \\n\\n\r\nOVERALL: 7/10 just like every other season for me. It's a surprisingly-well-done anime about touching breasts; A hard feat to achieve if you ask me.",
            "date": "2018-07-16T18:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 284135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6343223.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NaMYAYA",
                "username": "NaMYAYA"
            },
            "url": "https://myanimelist.net/reviews.php?id=284135"
        },
        {
            "content": "Hello,\r\nI want to start by saying I was coming into this 4th season with sense of this will suck, but to my surprise it wasn't as bad of a transition as I thought it would be.\r\nKnowing that there was a studio switch it kinda turned me off but it wasn't all bad. I've heard a lot of people complaining about this anime due to the story not moving forward enough. I would disagree this new studio has to pick up and try and make it their own on a 4th season which can be a lot to ask for.\r\nIt did take a few steps backon some of the plot but also turned it back and explained why they took the steps back and made it a bit more serious instead of childish. I do hope for the next season they can do something to make people feel its better but I don't believe they can.\\n\\n\r\nTo me a lot of the hate for this anime is that people look too much into fan service or try to make it the next serious main stream anime, but this genre of anime isn't meant for everyone. \\n\\n\r\nHope this helps. :D",
            "date": "2018-07-12T18:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 283843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6415559.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheOldFallen",
                "username": "TheOldFallen"
            },
            "url": "https://myanimelist.net/reviews.php?id=283843"
        },
        {
            "content": "I will cut to the chase, this is the fourth season of Highschool DxD and at this point, if you don't know what HDXD is about then what've you been doing for the past 3 seasons. It has been about 3 years since the last season and with that came a new studio moving from TNK to Passione. This was due to the last arc of s3 (when Loki pretends to be Issei and eventually makes Issei fight Rias, you know the part that felt really irrelevant and seemed like filler) well the author didn't like that and decided to change studios (or at leastthat's how I understand it). This means a completely new art style. Honestly, I'm not really a fan of it, if it had been Passione this whole time (s1-4) I might not have disliked the art style so much as I'd be used to it but oh well, I have heard this art style is much closer to the light novel/visual novel.\\n\\n\r\nStory: \\n\r\nIn terms of the art being much closer to the novel the same goes for the actual story. The story is a lot closer to the novel and in this anime adaptation they include 2 different mini arc's. The first arc is a school trip to Kyoto and the second arc is a rating game between Rias Gremory and her cousin Sairaorg Bael, I won't say what happens in either because I'm trying to keep spoilers to a minimum. Unfortunately, this season involves too much plot and not enough 'plot' but more on that later.\\n\\n\r\nSound:\\n\r\nThe same soundtrack as all other seasons excluding the new opening and ending in which I must say the op is a cracking good song\\n\\n\r\nCharacters:\\n\r\nI'll start off by saying Akeno is best girl and in this season i wouldn't be surprised if she had 10 lines total. They have now included Ravel Phoenix as a student at the school so she is included a bit more, however, she is supposed to be partnered (i cant think of a better word) with Koneko which I feel was mainly for the comedic value (which was minimal at best). In the Kyoto arc it is based around Issei's relationship with Asia, Xenovia, Irina and a girl they meet in Kyoto called Kunou who is the main focus of the arc. After returning from Kyoto it is mainly based on Issei and Rias's relationship.\\n\\n\r\nSummary:\\n\r\nIf you came here for comedy, you will not find it here, this season is much more serious about itself and focuses more on plot then 'plot'. Unfortunately, Highschool DxD is known for its over the top inclusion of 'plot' and to try and change what it is best known for now, I'm not sure is the greatest of ideas. If you are a fan of any female that isn't Rias, you will be disappointed, the only character development is Rias and Issei. Issei has the IQ of a pencil, he has no idea of any female characters feelings towards him (classic harem main character) however, like a pencil he doesn't have the mental capacity to do anything himself but if somebody helps him he is pretty useful. One thing I must give props for are the fights especially the fight in the final 2 episodes. All in all, it seems like Passione are taking this a lot more seriously then it should be, the main character gets powered up by poking and seeing boobs. \\n\\n\r\nTLDR: Not funny, not unfunny. Too much plot, not enough 'plot'. Too much Rias, not enough of every other female character. Passione is taking a series made for memes and turning it into something serious. If it ain't broke, don't fix it. If the series works, don't go changing it.\\n\\n\\n",
            "date": "2018-07-06T06:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 283117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5243970.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pokeruls",
                "username": "pokeruls"
            },
            "url": "https://myanimelist.net/reviews.php?id=283117"
        },
        {
            "content": "SIgh.... so another season of High School DxD is over... and man i am feeling ambivalent about this season. So much good, but also so much bad at the same time... welp... lets jump into it... Also, this is coming strictly from an anime only standpoint, i have not read any of the LNs. \r\nSTORY:7\r\nWell what can I say... Its good but its not great. The story is much more different from the last three seasons, and honestly its not what I would like to see. So, at this point, theres almost two reviews of the story. One one hand, as a standalone plot, itsgood. Its really not bad. It has moving parts, a coherent storyline, a resolution, a epic fight, and some interesting mechanics. But... as a standalone plot, its not great. It was somewhat boring, predictable. It lacked any sort of plot twists, and it was too short to serve as a good plot. To me, this story felt more like a prequel than anything, a set up for a future story. \\n\r\nNow, the second review of the story is in relation to the previous seasons. And in relation to those seasons, It falls short by quite a bit. What made the previous seasons so great was the epic ratio and balance between storyline and ecchi. And this season, season 4, is just not as good at balancing that ratio. There was almost no ecchi, none of the trademark ecchi that was present in the previous seasons. As much as story purists will hate this, the ecchi was what made the last three seasons enjoyable, and those last three seasons knew it. This season however, does not. There was a definite focus on the story and the plot, which alone is not a bad thing, but it is distinctly not HSDXD. The atmosphere was different, it lacks the flair of the previous seasons. The fanservice. The comedy. The ecchi \\n\r\nSo Overall, a bit lackluster. Its a good story, but its not great, and its not very Highschool DxD. \\n\\n\r\nArt:6\\n\r\nAlot of people were ambivalent about this. And I am too. I still am. But again, this section is also, two reviews. Firstly, as a standalone season, the art is mediocre at best. Sure its good, but its not as good as it could be. Its not HD, not sharp, not crisp. The animation is off, slower, not as fluid, and too.... bland. It lacks detail, lacks passion. The Character designs are also still off, not as good as the original that we all know and love. \\n\r\nSecondly, in relation to the previous seasons, the art falls very short. The previous seasons had art and animation that was almost second to none. The accuracy and sharpness were top notch. The images were clear. The animations were also great. The attention to detail, especially background was much better than this season. \\n\r\nSo overall, not good. And not as good as the last three seasons. \\n\\n\r\nSound: 8\\n\r\nIf theres one thing that did plateau its the sound. The soundtracks in the anime are just about the same as the ones from before. There is certainly a nostalgia factor, and the sound is good, but its just good, sadly. Its not amazingly better. VAs were same so no comment there. And the OP/ED were good, pleasing to hear, so again, no comment either\\n\\n\r\nCharacter: 7\\n\r\nAgain, much ambivalence. The characters were not that good. Overall not much character development. The new characters that were introduced were cool, but were not integral at all to the storyline, and all just fell into typecast characters. Nothing original, nothing innovative. As for the main characters themselves, again no character development. I guess Issei got some, but then it was so rushed it still felt half-assed. So good, but not great. \\n\\n\r\nEnjoyment: 8\\n\r\nIts only this high because of the nostalgia factor. It is the newest and latest season of Highschool dxd. And although my review so far has been quite scathing, I still did enjoy this season a bit. But purely as the next installment of the Highschool DxD franchise. \\n\\n\r\nOverall: 7\\n\r\nThis entire anime could be summed up as \"Good, but not Great\". And it really is that. I wish i could have given it better marks. Hell I wanted to give it better marks as an ecchi enthusiast. But damn was i disappointed. I hurts me to say this, but this anime is distinctly NOT Highschool DxD. It has no notable comedy, no appreciation for the ecchi, and the art was just lackluster. Mathematically, as usual, Id say its like a 2 for story, and a 2 for enjoyment, plus 3 for it just being a HSDXD season 4? unfortunately disappointed and not impressed. \\n\\n\r\nPeace\\n",
            "date": "2018-07-05T22:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 283092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6108946.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_ecchiman_",
                "username": "_ecchiman_"
            },
            "url": "https://myanimelist.net/reviews.php?id=283092"
        },
        {
            "content": "I don’t really do reviews but I’m gonna start with this so why not. Short and sweet \r\nSo this season I found unsatisfactory with the ending of dxd hero. Not rewording at all. I found they over hyped the final fight. \r\nThe art style I didn’t mind but I do prefer the old one. But still not to bad it’s somthing I recon will grow on u as u watch the season. Art 8.3\r\nI really liked the plot and character progression and this season didn’t disappoint with that. it adapts the LN pretty well. Even though I thought it felt a little rushed. Plot 9.0\r\nNotesto know After watching the previous season u will find this season focused more on the romance between Issei and rias even tho it was a slight cringe.\\n\\n\r\nthis season really over did the secret gear so I didn’t really like that sorry to say \\n\\n\\n\r\nBut I will still love the show and hope for a season 5 and sorry if I brought the show down but from the other season it didn’t stand up to them. overall I still recommend this show it still has lots of strong points so thanks for reading \\n",
            "date": "2018-07-04T08:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 282961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4950435.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 5,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_Grandmaster",
                "username": "The_Grandmaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=282961"
        },
        {
            "content": "So I know I ranked the anime the way I saw it and especially compared to the other seasons previous to this one.  First of all I want to go on record that if the anime art had been the same throughout the scoring would have been very different. But as we had 3 seasons and some OVA's that I consider way better in art form thus this season ranks very mediocre for me.  \r\nHere are a few Examples of before and after pick \r\nThere is a scene where we pan across all the members of the occult club and honestly if youlook at the faces everyone has the same eyes nose and mouth.. That said I did love the story line and found that it had it's same type of flow as in the first few seasons. The characters though lost a lot of appeal to me as they all seem to be the same facial expression wise.\\n\\n\r\nNew  season\\n\\n\r\n[img]https://mei.animebytes.tv/f7d9f48354cb0607ed9192a26796d867aa4d1ec0e6d02f41022636b21536afc7.png[/img]\\n\\n\r\n[img]https://mei.animebytes.tv/015cef75b5ebca665a06a4393d0091add309178fe84de2322c8e1a028d4816ca.png[/img]\\n\\n\r\n I stand tall and say we all appreciate that we have a season 4 I would go as far as to say we are thrilled to have it.  But could the new studio have not followed the art style that was already there with maybe a few tweaks here and there. Someone commented as well that if the art style had been like this since the start that no one would be complaining; and I say that is a very true statement but it's not. To switch the  style so dramatically for the 4th season is a turn off for a lot of people even if this is more representative of the LN. I have not read the LN so the anime is my reference point; at that the first 3 seasons are my reference point, so this is a shock to my eyes. Could the new studio not just have done Ep zero in the old art style and recant what the LN intended?\\n\\n\r\n[img]https://mei.animebytes.tv/eee0c9c5d5d50da5924cee10a04006e734299583de4991f6880b5a3aa5483786.png[/img]\\n\\n\r\n[img]https://mei.animebytes.tv/ff787c94d896cb827a17e06deb4296667ae3e719816f3a163bf54a6143bebd52.png[/img]\\n\\n\\n\r\nOMG this is not getting any better.   The before pick\\n\\n\r\n[align=center][img]https://mei.animebytes.tv/7b712cfaeabb36fb8cd1638a4b1184e91fe5db27c3075a190542d4d66e2cbbb7.png[/img]\\n\\n\r\nLeviatan Desu \\n\\n\r\n[img]https://mei.animebytes.tv/f6f071581f89ad9c2b27a52c206c16ce41f598be85161fbc5c53b29289130ac2.png[/img][/align]\\n\\n\r\nThe after pic \\n\\n\r\n[align=center][img]https://mei.animebytes.tv/0d92149202c2dbcb40b4559ddc73e68eace8c052003fa44ed1462a86b1140cf6.png[/img]\\n\\n\r\n[img]https://mei.animebytes.tv/e676038668c4534ec4eb1604236040504106f3629cf6bae916b33d8a9dee0a91.png[/img][/align]\\n\\n\r\nThose are some major character changes. Granted I know we have a new studio but Holy Cow Batman.\\n\r\nThe voice acting was spot on and as many have said the story follows the LN to a \"T\" . I have not read it so I will take other peoples word on that. There was so much change in the art style that we lost a lot of the characters essence I believe in this season. \\n\\n\r\nI know I sound like a broken record by now but honestly the series was a  disappointment to me.  I would tell the people that run the show to go and search out yet another new studio that have very similar artist to the first few seasons and give them a whirl. The studio just does not cut it. \\n",
            "date": "2018-07-02T18:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 282827,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1278115.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tiamat26",
                "username": "Tiamat26"
            },
            "url": "https://myanimelist.net/reviews.php?id=282827"
        },
        {
            "content": "The final season before i hit the books of this very erotic series\r\nThe whole season was a complete blast to watch if you're a long time fan of this but if you haven't try watching the other season or even better yet try reading the light novel books\r\n3rd season gave me a massive sneak peak to Issei's massive power BOOST and his relationship with Rias Gremory\r\nStory :\r\nThe story continued right after the Juggernaut Drive incident with The Occult Research Club with Issei recovering from his drained life force and his trauma with Raynare\r\nThe story is very consistent in its placement but it felt too fastwith its pacing and at times very abrupt \\n\r\nArt : \\n\r\nThe animation was pretty good, especially for Studio Passione because it was their first/second major project following after Citrus, I thought at first  it would flop because of the animation because it was overly simplistic and reminded me of *cough* some 18+ alternative to animes *cough* but the animation was hype and the characters' facial reactions were really expressive\\n\r\nSound :\\n\r\nIt felt great to hear new and old tracks of this series like the first time we saw Rias in the 1st season and etc. \\n\r\nCharacter :\\n\r\nCharacter development skyrocketed by a huge margin, Issei recovers from his Trauma and was able to tell his feelings to Rias and his Harem, and Rias herself was able to accept Issei as her equal and lover\\n\\n\r\nRecommendation :\\n\r\nIt is a must watch because characters and plot definitely got deeper and not only that OPPAI .\\n\r\nIt is the final season of this anime series because the Light Novel of High School DxD is done\\n",
            "date": "2019-04-02T08:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 305265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5690087.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EmeraldV",
                "username": "EmeraldV"
            },
            "url": "https://myanimelist.net/reviews.php?id=305265"
        },
        {
            "content": "I’m a great fan of the DxD series, and the first 3 seasons are amazing: full of passion and love. The best of this genre, and much better than the similar themed “Dakara Boku wa, H ga Dekinai”. But this fourth season is a disaster. The budget was visibly cut down, and the production was shifted from the Studio TNK to the guys of Studio Passione, and as a result the animation and art style was changed and the quality also dropped considerably. Something else was lost in the animations and art style, and that is the more mature and dark eroticism of the femalefigures of the previous seasons. The story was rendered faithfully, but this one was also the weakest part of the manga, and that did not help.\\n\r\nI consider this fourth season not worth watching. This anime is a classic and I loved it, but sadly for me it ended with the third season.",
            "date": "2019-03-30T14:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 304936,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6849574.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FreemenMuaddib",
                "username": "FreemenMuaddib"
            },
            "url": "https://myanimelist.net/reviews.php?id=304936"
        },
        {
            "content": "So where to start.....\r\nIf you are this far into the high school dxd series that's awesome because it's an amazing show! I will say that the change in character texture and art is a little bamboozling but in time you get used to it. This serious took a turn into the following manga so which then brings in the ultimate fan service which is to bad and is quite comical how they bring it in but the fact that they kind of changed what happened in the season before hero made me a little upset it doesnt change it all to much but it wasjust enough for me to say WTF are you serious. The way they brought the characters up and developed them was pretty spot on not gonna lie. I feel as if this season though was kind of thrown together in a way of terms. Certain events happen that they dont talk about much towards the end which kind of threw me off but it was still enjoyable to watch dont get me wrong. Just wish they would of focused more onto the bigger matter at hand instead of saying oh this is important and then jumping into something else acting like that event I mentioned earlier didnt happen. They ended this season off with a massive hit though! So watching all the way to the end wont disappoint! \\n\\n\r\nWhat am I getting at here you might be asking?\\n\\n\r\nWell what I'm saying is minus the slight change in story line from season 3 to make up for the change in season 4 it's a pretty good season to watch by yourself of course hahah unless you and whoever you are watching it with is comfortable seeing this together but anyways!!! Its chalk full of action and fan service which makes it pretty damn good to see in full",
            "date": "2019-03-07T11:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 303067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1136035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HOTDfan4life",
                "username": "HOTDfan4life"
            },
            "url": "https://myanimelist.net/reviews.php?id=303067"
        },
        {
            "content": "Ok first of all, I did enjoy the prequels of this serie. And was thinking that this serie would be great as the last of them. Well by suprise it wasn't really that perfect. \r\nStory 6: Well...its was a good story. Only there wasn't really a structure. For example they fight against a boss. Then a weird boss is coming up. He doesnt die. and then there is a tournament (sorry for my english btw). Its was for me a little bit confussing. And it took me some time to realize it.\r\nArt 6: They changed the art style. The prequels were different then this one.Is it bothering me? A little bit. Akeno and Xenovia has changed alot. For me in a bad way. But Akeno and Rias changed in a good way. The other artwork was just fine. Only characters changed alot.\\n\\n\r\nSound 8: Great ending and opening. Not much to say.\\n\\n\r\nCharacter 7: Instead of the artwork. I did enjoy every character. Some more then others. And i'm really glad that Kiba got a more serious role in this serie. But still the harem king is the greatest character. (What do i wrong in my life?)\\n\\n\r\nEnjoyment 7: I did watch in some days because of work etc. But I did enjoy the serie. Not the greatest but good enough.\\n\\n\r\nOverall 7: The 7 is for me more the change the producers has made. Its bothers me that some of the perfect chars for me. Xenovia for example has changed in a bad way qua art. But i'm happy that some shadow characters has come more in this serie. Do you need to watch it? Well if you watched the series or prequels. Then you will maby agree with me. But some people are accepted and enjoys the new art style. Its fun to watch and well....Boobie dragon fan boy is here (^_^)",
            "date": "2019-02-05T12:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 300967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6169890.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rascaz",
                "username": "Rascaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=300967"
        },
        {
            "content": "Highschool DxD is probably the best anime ever made. Despite peoples need to hate on anything ecchi on mal, this show continues to prove them wrong. How you ask? Because the main protagonist gains his superpowers from boobies. Need I say more? Probably one of the only shows I ever cried during a fight. The art style is refreshing while not tainting the classic look of highschool dxd. Issei is probably the best protagonist of any anime ever, unlike other spineless harem protagonists like Deku who freezes up the second he sees titties, Issei is forward and upfront with all women about his affinity forall things oppai. All in all, I give high school DxD Hero, a 5/5. A true masterpiece.",
            "date": "2019-01-29T21:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 300365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6434620.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HikuMatsune",
                "username": "HikuMatsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=300365"
        },
        {
            "content": "High School DxD Hero /Season 4 covers vol 9 and 10 of the Light novel many fans/ readers of the series would have been waiting for them to be adapted for years i was one of them, sorry this is my first review \r\nafter the very disliked previous season (Season 3)  a among the LN community due to the vast changes such as anime original and ruined character development  but ill get to that in a bit. it took us by surprise that  a 4th one was announced especially in October 2017 after the backlash among Japanese fans ,even though the announcementwas sweet tune in are ears it still divided many fans of series due to the Change of Art Style , (come on lets be real here guys/gals it was obvious / made sense that the studio would have changed).well you could probably put two and two together to know the response to that went down.\\n\\n\r\nnow i will get into the previous  mentioned changes , season 3 basically changed the order of events from the source material , by cutting 2 vols in half and changing the how they are portrayed , i.e loki fight and completely scrapping  a rating game between rias and sona instead they fight loki, the other changes also include cut character development between Konkeo and Akeno and anime oringal content such as the curse and the last 3 episodes of the season , yes that includes the beach part of last episode of that season, and many others now ill get back to season 4,\\n\\n\r\nfirst off you must know that Episode 1/0 is a retcon of the juggernaut drive scene from season 3, and portrays how it went in the vol 6 respectably, why you may ask , it so that the series can go back on track to following the LN as intended by removing the curse and the last 3 episodes.\\n\\n\r\neven though season 3 changed a lot its still advised to take note of character development surrounding Koneko and Akneo even though alot was cut, as well as one of the scenes in the last episode when Rias recruits Rose into the peerage,\\n\\n\r\nPart 1 of season 4 focus on the original gang and sets up a trip to kyoto for the 2nd years  and introduces new characters along the way as well as new antagonists mainly the Hero Faction which is a branch of the khaos brigade, and a fox girl called kunou and her mom who is the leader of the Kyoto Youkai, wont go much into season you can watch how they are relevant for yourself, keep in mind Vol 9 is part of a 4 volume arc and the hero faction get more spotlight in vol 11 which would be Season 5 if or when it happens.\\n\\n\r\nPart 2 is essentially preparing for a rating game, which season 3 also neglects with more information and how important it is to the underworld, meanwhile as the gang prepare for the RG they are also planning the cultural festival as school as well and the 2nd half starts to dig deeper into issei and rias relationship which by the end you will be surprised.\\n\\n\\n\r\noverall i loved the season and i look forward to vol 11 and 12 to be adapted as they should be even more action packed,\\n\\n\\n\r\nP.S keep note that konkeos forwardness is due warming up to issei as we see in season 3 like i said to take note of even if season 3 cant be really relied on and her scene with issei at school is to heal his life span from the after effects of juggernaut drive which season 3 also neglected to portray properly as issei had 100 years left of his life span and her treatment was to build up that lifespan gradually. also take note Juggernaut drive is a curse \\n\\n\r\nalso take note the retcon changes season 4 as if season 3 actually followed the LN and mentions events and other details that where never adapted in season 3 , for more questions feel free to ask.\\n\\n",
            "date": "2018-10-19T05:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 292054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6847980.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mattinator95",
                "username": "Mattinator95"
            },
            "url": "https://myanimelist.net/reviews.php?id=292054"
        },
        {
            "content": "to start with this is my first review and sorry for my bad British writing.\r\nStory: I waited for a long time to watch 4th season of this anime beacause I loved this anime but the new study failed so hard to keep it good like the old study that after seeing that Issei had a fricking oppai song ( that made me feel so much cringe and it was my  top 1 of feeling cringes list), I thought okay I will give a chance and watch more maybye it will be still good but after seeing that he has alot of fricking fansand he named himself oppai dragon that I died of cringe,rated this anime with 1 point and left this anime, but a couple days later I again started to watch this season and gave another chance yet after a couple episodes he started to having even fricking president summoning power to touch her boobs and summon all of the fricking perverted energy that was op but made me again feel so much cringe so I gave this story 2/10 points.\\n\\n\r\nArt: I prefere more of the older art than a new art beacause all of the characters looked sooo fricking good but now Rias is looking like she was a zombie or smth like that and had a fever of -30C, and collors were more better than now but it is still kinda good so I give 5/10 points.\\n\\n\r\nSounds: Sounds hasn't changed at all and I prefered alot, and all of those sounds are made on point so I give 9/10 points.\\n\\n\r\nCharacters:  all of the characters I liked alot more the older ones than the new ones beacause Issei is now so  fricking lame, Koneko that punched alot Issei was more funnier than now, Rias was so badass. But there is also Akeno and Asia they  haven't chnged so I give 3/10 points .\\n\\n\r\nEnjoyment: There was so much cringe that I didn't at all enjoyed even the slightest, characters from interesting and good started to be lame and at a point where I wanted to just stop watching and hang myself so I rated it 2/10 points.\\n\\n\r\nOverall: 4/10 points\\n",
            "date": "2018-10-12T05:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 291559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384119.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/XxXParanojaXxX",
                "username": "XxXParanojaXxX"
            },
            "url": "https://myanimelist.net/reviews.php?id=291559"
        },
        {
            "content": "its actually funny how similar this show is to Monday Night Raw. I don't want to shit on it but they give me no other choice. \r\nLets start off with the story, the first arc of this season is absolutely fucking horrendous. it took me almost two weeks just to go through six episodes, this is something that had never happened to me before. The first arc was bland, forgettable, offered little to no character development and, was so damn boring. Basically our crew goes to Tokyo and, they get involved with a nine tailed fox clan and, the usual set up goes down, heroesget mistaken for kidnappers, heroes join the clan and, all is good, all come together to fight the real enemy and, so on. the only thing that was remotely entertaining from this arc were a few comedy scenes, the final battle and, Azazel who is without question the most charismatic character on the show which obviously means he has little screen time. \\n\\n\r\nThe second arc on the other hand was pretty good, it was a complete rehash of the second arc of season one but, still it was decent. The difference was that instead on hate being the story of the rating game this time it was respect. The introduce a character named Siaraorg who had cameos in previous seasons but, now is given his own arc. This guy was easily the best character on the season, he had, an interesting backstory, development, and, he was relatable. \\n\\n\r\nthe character design was something that stuck out like a sore thumb or a bad tattoo. First off it looks like all the characters were light washed they all seemed pale instead vibrant. Also, the eyes, now I barely passed Biology in Junior High but, I'm pretty sure the eye is composed of three circles the pupil, iris and, cornea but, for some bizarre reason the animators decided to add a fourth circle and, I don't know why. The location designs were pretty good and, the action sequences  were fluid and, well paced. The opening and, ending sequences were absolutely forgettable.\\n\\n\r\nFor a forth season in a row the biggest issue of High School DxD are its characters. I understand that , this is a harem and, shouldn't be taken too seriously as its main purpose is for horny dudes to jack off but, to quote JDfromNY206 who is the best wrestling podcast on youtube \"If you're one of these people who doesn't find an issue with the product then you are not a proper functioning human being\". I'll give them this, the ending season four is legitimately the first time I bought Issei as a main character since the end of season two, they attempted to add some depth to him but, again overshadowed by the fan service. Kiba who has succumbed to Finn valor syndrome, Gasper had an interesting backstory, thrown to the side, all the female characters (Rias, Akeno, Asia, Xenovia and,Irina) all have become glorified fan service characters graving sex literally, its like they've been stripped of all their personality traits except sexual desire. \\n\\n\r\nAlso, there was this running subplot where Rias feels that Issei has forgotten about her and, this was a pretty interesting subplot but, to little to late. This is the story they should have done in season three. Was it a good moment that brought out emotion from me no, could it have been yes.\\n\\n\r\nLike I stated I'm in previous review I am completely over the fan service on the show. Thats all I'm gonna say because I hate sounding like a broken record.\\n\\n\r\nIn the end, looking back on the show I absolutely hated the first half and, enjoyed the second. The only aspect of the show I would consider rewatching are the final three episodes. I do not recommend watching High School DxD Hero unless you have the highest patience on the planet.I honestly do not care if a fifth season is coming out and, if it is I'm going to hold off on it for a long time. Overall season four was average at best, I enjoyed certain aspects and, hated others.\\n\\n",
            "date": "2018-10-05T20:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 290999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6666889.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/saeid_2k",
                "username": "saeid_2k"
            },
            "url": "https://myanimelist.net/reviews.php?id=290999"
        },
        {
            "content": "I like HSDXD but this season has changed the artistic style. The first three seasons were adapted by the TNK studio and I prefer their style so much, the characters had so many more expressions on their faces, moreover the eyes are very different, although it is pleasant, personally I do not arrive to support it, it's a pity the story and even the tone of the voices can not go up that point.\r\nFinally the story is good but on this point also the old seasons was above.\r\nNot to spit on the work of the studio Passione, the faces are missed. However I think thatSairaorg or Issei's Balance Breaker are both successful and their animations and fights (overall) are really good work.",
            "date": "2018-08-15T07:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 286543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CrazyMaul",
                "username": "CrazyMaul"
            },
            "url": "https://myanimelist.net/reviews.php?id=286543"
        },
        {
            "content": "In terms of guilty pleasures, High School DxD has always been at the top of my chart. Harem + Uncesored Oppais + Oppai dragon + A good story = THE BIGGEST N U T. But hold on a second, High School DXD’s studio changed???? NANI???? HOW WILL I ENJOY MY UNCENSORED OPPAIS NOW HUH? HOW WILL I ENJOY PRESIDENT RIAS’ MENACING BUT SEXY FACE? Those are the questions that are maybe running through your head right now. Don’t worry my friend, follow along and I will explain to you why this season is worth your time.\r\nAnimation and art: 7/10\r\n   OHOH wouldyou look at that! I started out with the most important part didn’t I. Ima answer the main question right away. Are there still a good ammount of boobs? Hell yeah my friend. It’s there and It is glorious. Boom. Done. I’m kidding, now to actually talk about the animation and art, It took me about 2-3 episodes to get used to it but honestly It is alot better than I expected. Most of the characters in my opinion looks better considering how they made them look alot more moe. I’m actually kinda glad that it’s a change of pace as the third season was getting quite boring. Now why is my score a 7/10? Well you see, Rias is not meant to look moe. Not at all. It really made me feel like the true Rias is gone. BUT as the season progresses you will get use to it and then you’ll see a cuter and more loving Rias. So don’t let that discourage you from seeing it\\n\\n\r\nStory *SPOILER WARNING* : 7/10 \\n\r\n   The story kinda splits into 2 arcs: The first one is where Issei and some of the team members go to Kyoto for a class trip. Ofcourse sh*t does go down when they are there but Issei does gain new powers. Specifically, he is able to transform his dragon suit to match different evil pieces. Nothing special. On the second arc, which is where Rias’ and Issei’s relationship actually start developing, They participate in a Rating game against the Sairaorg guy (you know the guy that really wanted to fight Issei and was kinda nice in the third season.) Issei does win but in the process had the courage to confess to Rias (which was FANTASTIC). He also almost gets laid but he called Rias, president so she got mad and just left him naked in the sauna 0.0. The final episode is what we’ve all been waiting for and that is Issei proposing to Rias one on one. The ammount of emotions flowing through me in that scene was too much to write down, so I hope you see it for yourself TvT. I’m so happy TvT. \\n\\n\r\nMusic and sound: 7/10\\n\r\n   Considering how a different studio handled the anime, the music and sound were on point. It definetly still had a High School DxD vibe to it. Though If I’m not mistaken They did reduce the extra noises for the boob bouncing. Otherwise everything same same\\n\\n\r\nOtherthoughts: \\n\r\n   Though I feel like this season was great and I enjoyed it alot more than season 2 and 3, I feel like it might be the last High School DxD season we’ll get or we won’t get another one until years later. The season ended on a good note so maybe continuing it isn’t really necessary to the studio. I’m not really sure. Its just what I’m guessing. We haven’t heard any about a new season either.\\n\\n\r\nConclusion:\\n\r\n   Overall If you like High School DxD like me, I high recommend watching it, Don’t let the animation discourage you, I personally did complain about it in the beginning but found it to be as entertaining if not more. Well I wish who ever reads this the best of luck, and Have a wonderful and amazing day/night.",
            "date": "2018-08-12T00:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 286251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saikaiswaifu",
                "username": "Saikaiswaifu"
            },
            "url": "https://myanimelist.net/reviews.php?id=286251"
        }
    ],
    [
        {
            "content": "High School DxD Hero is a fair sequal to the previous works in the High School DxD series. It's often comedic, with relevant jokes and well witted writing. The comedy aspect (Besides being the closest thing to hentai in mainstream anime) is its silver lining. Especially since the story seemingly goes no where. My other main peeve with the High School DxD series is that every season he seems to gain some immense power and get even stronger, and make it seem like he has peaked, then in the next season he peaks again.\r\nEither way, if you are looking for a good, comedy / Haremwith very well done battle scenes, High School DxD proves its worth again.",
            "date": "2018-07-24T01:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 284646,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7053381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/IncognitoRon",
                "username": "IncognitoRon"
            },
            "url": "https://myanimelist.net/reviews.php?id=284646"
        },
        {
            "content": "*****May Contain Spoilers******\r\nOppai Dragon!\r\nHere we go, another season of Highschool DXD based on the light novel with the same name.  This time around the season was created by Passione studios, which also produced the popular series Citrus earlier this year. I happen to have found both shows enjoyable. I look forward to future installments by this series.\r\nStory:\r\nHighschool DXD is a echihi, romance, harem, action, comedy and ecchi anime (Yes, I put that twice on purpose) fallowing the life of your typical average guy Hyoudou, Issei. Who in previous seasons started high school at  Kuoh Academy. He very quickly gets hit on and startsdating a fellow freshmen who happens to kill him once the date is over because she is fact a fallen angle. Issei is what in this world is known as a \"sacred gear\" user and she killed him to try and gain back the favor of god. Issei is then reincarnated by Rias Gremory a devil from the famous house of Gremory (you can find that this is an actual devil name in biblical text). He also happens to have the sacred gear that happens to house the famous red Welsh dragon Ddraig's spirit. This basically allows him to boost up power and wear a super awesome dragon armor set that is really badass.\\n\\n\r\nIn this world religion, weather considered mythological or not is real and has been hiding itself among normal humans. Issei and his group are basically reincarnated devils and serve there master who unlike the ones we find in the story has a good heart and doesn't really want to hurt humans. They live mostly normal lives except when factions and armies that seeks to destroy any type of demon, devils, or monsters, shows up and threatens everyone. In which case they fight to defend themselves and those they care about.\\n\\n\r\n(This series is super long and surprisingly complicated so I'm going to narrow it down to this season now)\\n\\n\r\nIn this new season Issie and the gang head to Kyoto on a field trip. They are of course excited to be going on this trip together and take a break from the rating games and the constant attacks from the Chaos Brigade. This trip is filled with a lot of funny scenes (Especially when Issie's perverted nature gets loose and causes innocent victims to commit acts of basically sexual harassment). Which is quickly brought to an end after the yokai or Kyoto attack because their leader a kitsune has been kidnapped by the Chaos Brigade. Once misunderstandings are correct the group agrees to help save the entrapped spirit fox once her location has been found. SURPRISE! They were attached first and they finally meet Coa Coa, head of the brigade and wielder of the holy spear that pierced christ. The group works together to save the captured yokai from being used to open a portal to summon Big Red (Big ass dragon god).\\n\\n\r\nOnce the cult narrowly defeat the brigade (though not for good) the second half of the season revolves around the next rating game against Bael, Sairaorg, Rias's cousin. This leads to the more action side of the story. Along with more romance and drama as they finally dig deeper into Rias and Issei's relationship. The season ends with Issei obtaining a brand new power and him finally admitting he loves Rias.\\n\\n\r\nMy annalists of the season is that although everything in the anime went the exactly the same as the light novel. They kind of ruined it by either slowing or speeding up the pace of the story. The first half with Kyoto was very pushed forward considering so much was suppose to go on plot wise and story wise. The studio decided to instead pour more into the ecchi and comedy. Then they change it up during the second half twice. First spending a great amount of time with Issie and his problems with commitment since his first babe shanked his ass. Then they speed through some of what was the best fights in the whole series in the light novel int he rating game against Sairaorg. I know they were dealt this hand by the previous studio on where they decided to leave off but they really should have either extended the season to 24-25 episode or made the two half's two separate seasons. \\n\\n\r\nCharacters:\\n\\n\r\nUnfortunately the same thing I stated about the pace of the story can be said about the characters and their development. They were smart to add in the subtle scenes that would down the line be vital to future relationships such as the Rossweisse and Phenex, Ravel scenes but then they down played extremely important characters plot developments such as Azazel. I had no issues with the rest of the cast because they were portrayed perfectly but you can't just up the comedy and nudity like the plot is not important cause I've read this shit and it IS important.\\n\\n\r\nAnimation and Sound:\\n\\n\r\nI read a lot of complaints regarding the new studio taking a much lighter approach tot he animation. I however, disagree. The light novels art is exactly in this style and it makes it much better for the type of unique pitch that DXD tries to portray. The character do look younger, hello? They are high school students? Ta fuck you expect you fucking pedo pervs? I mean come on that was just stupid, most people were crying because they couldn't jack off to Rias without feeling like a pedophile. While she technically is a teenager in high school (though she is a devil).\\n\\n\r\nI was also happily surprised to learn that Passione isn't half bad at fight scenes. Especially the highly anticipated fight against Beal and Coa Coa. I can still tell that they are not 100% use to it but they seem to be working towards better action in the future. I think if they continue to pick up the series the fighting scenes will continue to improve.\\n\\n\r\nSWITCH ON, is really good opening. I found it catchy in a way and it really fit the tone of the season. The song also has a meaning to the season. This is when everyone starts to realize that whenever Issue touches Ria's breast that he gets a power up. Hence the name \"switch on\" Rias being the \"Switch Princess\".\\n\\n\r\nConclusion:\\n\\n\r\nI've enjoyed this anime since it first came out for many different reason. The main one is that the writer had the balls to take all forms of religion and make an actually decent story out of it. Then instead of making it super serious which would have probably ruined the entire thing he added in the ecchi and nudity to the elements of his story. It's funny, you can really get to like the character and the story while appreciating the world that they live in. I often sometimes wonder similar to the world we live in religious wise. That all religions are real not just one. I would recommend this show for anyone who has an open mind and likes a bit of pervy nature on the side. My only real complain.....I hate the fucking censoring SET THE BOOBS FREE!!!!!!\\n\\n\r\nRanking: 8",
            "date": "2018-07-13T13:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 283898,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3103691.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yorudan",
                "username": "Yorudan"
            },
            "url": "https://myanimelist.net/reviews.php?id=283898"
        },
        {
            "content": "If you like High School DXD taking steps back of what it had going before then you will like this, but the art in the design department with villains, or rivals look boring. The art looks very stiff-y too, and the art isn't great as other seasons. If you haven't read the light novels you will be left confused when it starts. Season 3 apparently didn't follow up well and had non canon mixed in. I had trouble caring for certain characters that were introduced, and the girls of Gremory feel unimportant to the story. The story focuses on Issei, and Rias so if youwant the Gremory girls to get some spotlight in development it doesn't happen in this season as often. Asia gets the most development out of the Gremory girls. I didn't find enjoyment to the story because I was confused, and didn't understand certain details. I only had some enjoyment due to nostalgia for the Gremory girls, and Issei. The sound is serviceable nothing special though.",
            "date": "2018-07-09T23:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 283598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6086516.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KaoJin",
                "username": "KaoJin"
            },
            "url": "https://myanimelist.net/reviews.php?id=283598"
        },
        {
            "content": "Disappointing\r\nThe whole show just seemed cheesier somehow than its previous seasons. I'm trying to think of the correct way to explain it and the best I came up with is this: \r\nIf the original series was written in a style that would appeal to teenagers/young adults, and then they added all the nudity and sexual references to it to make it adult. The style of this one seems like it was written for the 8-12yo market, so even with the added sexual references etc, the characters, story and whole premise come across as juvenile.\r\nArtwork:\r\nMost of the characters are similar enough looking to the previous seasons,with a few notable exceptions like Kiba. Overall, it wasn't as annoying as I thought it would be. \\n\r\nWhat did annoy me though, was that all the girls have got even larger breasts in this season (Ridiculously proportioned breasts is one of my pet hates with anime)\\n\\n\r\nStory Line:\\n\r\nThe show starts several months after season 3 finished and its like the writers just expect us to know what happened during those missing months. They never properly explain any of it, even when it has direct impact on the current story. The few flashbacks tend to leave you confused and asking more questions than it answered.\\n\r\nThe relationship between Rias and Issei is disjointed and doesn't track from what we have seen previously.\\n\r\nThe fight scenes were okay and there were some funny moments like we expect from DxD, but I didn't enjoy these as much as previous seasons (probably because of all the changes). \\n\\n\r\nOverall: \\n\r\nA definite down grade as far as I'm concerned, but its still DxD and therefore still worth watching.",
            "date": "2018-06-21T06:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 281744,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5125927.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jezza_G",
                "username": "Jezza_G"
            },
            "url": "https://myanimelist.net/reviews.php?id=281744"
        },
        {
            "content": "So we have finally reached the halfway point of Season 4 of High School DxD, putting an end to the first of two arcs, and so far, I gotta say, I'm actually fairly impressed.\r\nHigh School DxD has long been what you might call a \"guilty pleasure\" of mine, despite its obvious flaws and shortcomings. The easygoing Issei and his harem of anime tiddies just has a certain... charm about it that I can't really seem to find anywhere else. After the horrible 3rd season, studio Passione has taken on the job of \"fixing\" the DxD storyline, by adding an alternative (true to the light novels)ending to Season 3, effectively rendering the last 3 episodes of TNKs version obsolete. This was, in my opinion, the best thing they could have done, seeing as the ending of Season 3 left very little to work with for future adaptions.\\n\\n\r\nNow, Season 4 is not without its flaws. The art style is... weird. At first I absolutely hated it, but now, after 6 episodes, it's really starting to grow on me. The characters look more \"childish\" for sure, but that kinda fits the setting a little bit better, at least in my opinion. It is, however, definitely something you'll just have to get used to if you are planning on watching the new season.\\n\\n\r\nThe story so far really isn't anything to write home about either. Issei and his friends go on a school trip to Kyoto, where they run into trouble. That's pretty much the gist of it. There is some other stuff happening \"behind the scenes\" too, if you will, but I won't really go into that seeing as that would be spoiler territory, and chances are some of you might not have seen all of the recent episodes.\\n\\n\r\nThe ecchi part is still very much alive and kicking, with every episode featuring at least one \"sexy\" scene. After all, High School DxD would not be High School DxD without the ecchi, and I'm happy to report that Passione seems to understand this. And on top of this, the new season also fleshes out the relationship between Issei and Rias even more than before, so if you are a Issei x Rias fan you are going to be very satisfied with the way their relationship is handled here.\\n\\n\r\nThe music of DxD has always been one of its strong-points, and the new season does not disappoint on that front either. The OP is catchy and enjoyable, and the ending song gets the job done too. I really don't have anything else to say about it, the music is alright, nothing special but alright, and that's pretty much it.\\n\\n\r\nOverall, I'd say I was positively surprised by the new season of High School DxD. The story, albeit predictable, is interesting enough to keep your attention, and Issei and the gang has lost none of their charm, and are still enjoyable to watch. And at the end of the day, isn't that exactly what we've come to expect from DxD? Some light-hearted humor, ecchi scenes and well-animated fights?",
            "date": "2018-05-24T03:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 281285,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5515025.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Weebston",
                "username": "Weebston"
            },
            "url": "https://myanimelist.net/reviews.php?id=281285"
        }
    ]
]