[
    [
        {
            "content": "I have to say that after watching the first episode I did not know what to expect, but against all odds it was amazing.\r\nSTORY 10; the story continues after season one and it just keeps on developping. It is not rushed and everything fits just right to conclude the story. \r\nART 8; the art was well done, at first I had to adjust to the style, as it is a bit \"ruff\". Afterwards I think the couldn't have done a better job fitting this art with the story and the characters. \r\nSOUND 8; battles, sad , touching and happy moments where accompanied with great musicthrought out this series. It's just, personally, great music if it keeps stuck in my mind and this time it did so. I do have to say that the music fits perfectly and thanks to that I shed some tears alright...\\n\r\nCHARACTER 10; I loved the characters from the beginning. Ushio and Tora go so well together and thanks to this continuation of season 1 they got more dept. You see some unexpected reactions from the characters, but what I apprciated the most was  that everyone fullfilled their roll excactly right in my eyes.\\n\r\nENJOYMENT 9; i enjoyed it very much, There where moments I cried, I laughed so hard I would start to cry, I even got chocked sometimes of something unexpected. I certainly wasn't bored while watching this and the first season.\\n\\n\r\nOVERALL 9; i loved the character development the most and the story allong with it. I really enjoyed all episodes which where all epic on their own and amazing together You certwainly need to watch this show as a conclusion to season 1. And just for the epicness.",
            "date": "2016-08-08T13:10:00+00:00",
            "helpful_count": 25,
            "mal_id": 226249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3571913.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Synkue_Amulate",
                "username": "Synkue_Amulate"
            },
            "url": "https://myanimelist.net/reviews.php?id=226249"
        },
        {
            "content": "BIG SPOILERS\r\nSo I decided I'd write my review for this show on this entry rather than the first season entry.\r\nUshio and Tora is a fun show that tries to evoke that 90's goofy edginess and fun that many shows had back in the day. While it largely succeeds, there are few arcs that go on too long and parts that are a little bit boring. There were one too many monster of the week episodes, and the HAMMR arc and Kirio arc had some cool moments, but there were a lot of dull episodes.\r\nMy biggest problem with this show is Ushio himself. Tora is agreat character that we see grow over the course of the series and who we finally get a huge backstory on, and his character arc concludes beautifully. Many of the side characters also grow over the series and even get their arcs neatly resolved. Ushio, however, is the definition of a one-note protagonist. He's perseverant just because, can one-shot most of the villains just because, and every character in the show seemingly praises him for all the blessings in the world. I knew going in that I was going to be watching a hot blooded 90s emulation and didn't expect the deepest characters, but I feel that Ushio could have been made just a tad more complex. It's based on a 90s shonen, however- characters being badass just because is par for the course.\\n\\n\r\nWhat about the good? The soundtrack is great, the animation looks straight out of the 90s, and the last 4th of the series is top-shelf stuff. The main villain, Hakumen no Mono, is literally the embodiment of fear and evil. The incarnations it takes and it's sheer power is on Lovecraftian levels, and I loved that.\\n\\n\r\nI'm also a big fan of yokai and Japanese mythology, and I thought that the way they wove a lot of references to classic yokai was awesome. \\n\\n\r\nDefinitely worth a watch if you've been on a depressing anime kick and want something that makes you feel like you're watching Toonami in the late 90s.",
            "date": "2016-08-14T21:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 226765,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seekr12",
                "username": "seekr12"
            },
            "url": "https://myanimelist.net/reviews.php?id=226765"
        },
        {
            "content": "After finishing first season I was a bit unsure whether I want to watch season 2. I was hesitating and yet I've decided to watch it. My hesitation was for nothing. Now I'm wondering why the heck I was unsure. \r\nStory begins with a good pace leading right to the final battle. There are no more side arcs dealing Ushio with youkais\\humans. \r\nThe whole story of Ushio to Tora is quite simple. There were some points in the story which were sort of surprising. However, speaking in general, from the very begining to the end it's just one shounen trope after another. Definetely not HxHlevel. If I were to describe it in few words, I'd say \"evil stuff vs good stuff\". Also some techiques of storytelling are pretty outdated. \\n\r\nWell, there's quite good reason for that. The source had been finished airing before I was born...\\n\r\nStill, the story remains beautiful. If feels Japanese.\\n\\n\r\nArt is something to make me \"oh\". It's great. Oldschool style. I just loved it. Battles are admirably animated here. To the point I had to screenshot almost every frame of battles. I'm not exaggerating here. The style of art is perfectly fitting the story. \\n\\n\r\nSound's good. They've done decent job here. Nothing to complain about. Actually, some OST-s made my spine chilling. Especially, reaching the final episode. I'd even listen to them separately.\\n\r\nOP-s deserve special attention. They were that type of OP-s which you never skip. I'd recommend to check it out even if you're not gonna watch the series. \\n\\n\r\nCharacters... The only annoying one is Ushio. He's a dumbass with \"a true heart\" who goes screaming when it's appropriate and when it's not. Well, relax, he's not only one main hero, how you could already know. I liked Tora more than any other character in the show. I'm sure once you've known his backstory you'll come to like him as much as I do. \\n\r\nSide characters are not that remarkable save few ones(I mean Hyou, Hagare eg. ). There's a lot of girls surrounding Ushio. I like Asako the most. You know, there's something charming in girls of such old stories.\\n\\n\r\nI've enjoyed the series more than I initially thought. But keep in mind there're lot of overused shounen tropes here. You should expect to comprehend the series based, well... on feelings. \\n\r\n I'd recommend you Ushio To Tora, if you are searching for some heart-warming and epic oldschool thing.",
            "date": "2017-02-07T01:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 240082,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4915440.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Leegf",
                "username": "Leegf"
            },
            "url": "https://myanimelist.net/reviews.php?id=240082"
        },
        {
            "content": "English:\r\nThis review will talk about the 2 seasons of the anime, so you can achieve a more global opinion on what I found along the 39 chapters.\r\nWell ... this anime presents a somewhat coherent story (by that I mean the argument is fiction but is \"credible\") and well made, a story filled with many emotions and difficult situations for all characters who engage in this story, and that is something to highlight; the fact that the story does not focus only on a protagonist and an antagonist but also involves many characters who will much contribute to the story, on the other hand we havethe animation with its own characteristics and originality, it gives the feeling of being just watching a sleeve being animated in real time, although not the best animation I've seen or see, is acceptable, the characters in this story are incredible and each has a long and sad story behind (well not all XD ). The first season is loaded with lots of action, comedy very well made that would make anyone laugh that was not a schizoid, drama, etc. Besides having a great opening ... something negative in season 1 is that it has some chapters of fillings, but still are not bored and left to see. Then we have the number Season 2, where give us an incredible twist from the beginning in every way.\\n\r\nhave epic fights from the beginning and characters evolve in many ways, as advances allow us to know many things that were unknown and that are central to the story, among many other things but you have to see and feel for yourself, certainly animation makers have managed to deliver a long history in just 2 seasons and has been very well. Clarifying that season 2 is the best because with it the story ends, but we would expect less? I doubt it ... so if you see a good anime intereza of those that make you remember the old escula, this is the one. I have no doubt that it is a work that would recommend eyes closed! : D\\n\\n\r\nGreetings and hugs to those interested this opinion.\\n\\n\\n\\n\r\nEspañol:\\n\\n\r\nEn esta review hablare sobre las 2 temporadas de este anime, así podrán tener una opinión mas global sobre lo que me pareció a lo largo de los 39 capítulos. \\n\r\nBien... este anime nos presenta una historia algo coherente (con esto me refiero a que el argumento es ficción pero es \"creíble\") y bien hecha, una historia llena de muchas emociones y situaciones difíciles para todos los personajes que se involucran en dicha historia, y eso es algo para resaltar; el hecho de que la historia no se centre solo en un protagonista y un antagonista sino que también involucre a muchos personajes secundarios que le aportan mucho a la historia, por otro lado tenemos la animación con sus propias características y originalidad, da la sensación de estar justamente viendo un manga siendo animado en tiempo real, aunque no es la mejor animación que he visto o verè, es aceptable, los personajes de esta historia son increíbles y cada uno de ellos tiene una larga y triste historia detrás, (bueno no todos XD). La primera temporada esta cargada con mucha acción, comedia muy bien hecha que haría reír a cualquiera que no fuese un esquizoide, drama, etc. Ademas que tiene un opening fenomenal... algo negativo de la temporada 1 es que tiene algunos capítulos de rellenos, pero aun así no son aburridos y se dejan ver. Luego tenemos la temporada numero 2, donde desde el comienzo nos dan un giro increíble en todos los sentidos.\\n\r\ntenemos peleas épicas desde el inicio y los personajes evolucionan de muchas maneras, a medida que se avanza nos permiten saber muchas cosas que se desconocían y que son fundamentales para la historia, entre otra muchas cosas mas que tienes que ver y sentir por ti mismo, sin duda los encargados de la animación han sabido entregar una larga historia en tan solo 2 temporadas y les ha quedado muy bien. Aclarando que la temporada 2 es la mejor ya que con ella se termina la historia, ¿Pero esperaríamos menos? lo dudo... asi que si les interesa ver un buen anime de esos que te hacen recordar la vieja escuela, este es el indicado. No tengo la menor duda que es una obra que recomendaría con los ojos cerrados! :D\\n\\n\r\nSaludos y abrazos a quien le interese esta opinión.",
            "date": "2016-09-25T16:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 230212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5718881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phrogress",
                "username": "phrogress"
            },
            "url": "https://myanimelist.net/reviews.php?id=230212"
        },
        {
            "content": "The problem with writing a review for this anime is that I do not expect the quality difference from one season to another to be SO big. By God, that was really good. The involvement of Ushio and Tora as main characters, their past histories, all perfectly arranged. I was so wrapped up to the point of shedding tears in some episodes.  IS THAT GOOD. I could not believe that i was watching the same anime that make me said \"Just for entertainment\".  Please YOU give this anime a chance. You will possibly appreciate. \r\nThe few problems consists of everything being very rushed(A lot of manga chapters for a few episodes). But it does not spoil the experience of watching it.\\n\\n\r\nAmazing animation for studio MAPPA. It give the manga justice.\\n\r\nAnd the OP'S and ENDS are really catchy.\\n\\n\r\nOverall---- 9.\\n\r\nIt's definitely worthy it.",
            "date": "2017-06-02T22:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 249163,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4542787.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Oldlike",
                "username": "Oldlike"
            },
            "url": "https://myanimelist.net/reviews.php?id=249163"
        },
        {
            "content": "I am totally in love with this series. Overall very likable characters with great character building. The story might not be the most original you've ever seen, but it still has it's own unique twists and turns. I had good laughs and sorrow filled cries through out the whole series and second season was an amazing finish that left me relieved and heartbroken at the same time. \r\nTo me it was something special. It might not be for everyone, but personally I enjoyed the humor, the sadness, the tight bonds developing through the story and I felt fulfilled. My questions were answered and there wereno holes leaving me dissatisfied in the end. I loved this series and feel almost empty that my journey with Ushio and Tora is over.",
            "date": "2017-06-27T03:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 251194,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpectrumCandy",
                "username": "SpectrumCandy"
            },
            "url": "https://myanimelist.net/reviews.php?id=251194"
        }
    ],
    [
        {
            "content": "I have to say that after watching the first episode I did not know what to expect, but against all odds it was amazing.\r\nSTORY 10; the story continues after season one and it just keeps on developping. It is not rushed and everything fits just right to conclude the story. \r\nART 8; the art was well done, at first I had to adjust to the style, as it is a bit \"ruff\". Afterwards I think the couldn't have done a better job fitting this art with the story and the characters. \r\nSOUND 8; battles, sad , touching and happy moments where accompanied with great musicthrought out this series. It's just, personally, great music if it keeps stuck in my mind and this time it did so. I do have to say that the music fits perfectly and thanks to that I shed some tears alright...\\n\r\nCHARACTER 10; I loved the characters from the beginning. Ushio and Tora go so well together and thanks to this continuation of season 1 they got more dept. You see some unexpected reactions from the characters, but what I apprciated the most was  that everyone fullfilled their roll excactly right in my eyes.\\n\r\nENJOYMENT 9; i enjoyed it very much, There where moments I cried, I laughed so hard I would start to cry, I even got chocked sometimes of something unexpected. I certainly wasn't bored while watching this and the first season.\\n\\n\r\nOVERALL 9; i loved the character development the most and the story allong with it. I really enjoyed all episodes which where all epic on their own and amazing together You certwainly need to watch this show as a conclusion to season 1. And just for the epicness.",
            "date": "2016-08-08T13:10:00+00:00",
            "helpful_count": 25,
            "mal_id": 226249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3571913.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Synkue_Amulate",
                "username": "Synkue_Amulate"
            },
            "url": "https://myanimelist.net/reviews.php?id=226249"
        },
        {
            "content": "BIG SPOILERS\r\nSo I decided I'd write my review for this show on this entry rather than the first season entry.\r\nUshio and Tora is a fun show that tries to evoke that 90's goofy edginess and fun that many shows had back in the day. While it largely succeeds, there are few arcs that go on too long and parts that are a little bit boring. There were one too many monster of the week episodes, and the HAMMR arc and Kirio arc had some cool moments, but there were a lot of dull episodes.\r\nMy biggest problem with this show is Ushio himself. Tora is agreat character that we see grow over the course of the series and who we finally get a huge backstory on, and his character arc concludes beautifully. Many of the side characters also grow over the series and even get their arcs neatly resolved. Ushio, however, is the definition of a one-note protagonist. He's perseverant just because, can one-shot most of the villains just because, and every character in the show seemingly praises him for all the blessings in the world. I knew going in that I was going to be watching a hot blooded 90s emulation and didn't expect the deepest characters, but I feel that Ushio could have been made just a tad more complex. It's based on a 90s shonen, however- characters being badass just because is par for the course.\\n\\n\r\nWhat about the good? The soundtrack is great, the animation looks straight out of the 90s, and the last 4th of the series is top-shelf stuff. The main villain, Hakumen no Mono, is literally the embodiment of fear and evil. The incarnations it takes and it's sheer power is on Lovecraftian levels, and I loved that.\\n\\n\r\nI'm also a big fan of yokai and Japanese mythology, and I thought that the way they wove a lot of references to classic yokai was awesome. \\n\\n\r\nDefinitely worth a watch if you've been on a depressing anime kick and want something that makes you feel like you're watching Toonami in the late 90s.",
            "date": "2016-08-14T21:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 226765,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seekr12",
                "username": "seekr12"
            },
            "url": "https://myanimelist.net/reviews.php?id=226765"
        },
        {
            "content": "After finishing first season I was a bit unsure whether I want to watch season 2. I was hesitating and yet I've decided to watch it. My hesitation was for nothing. Now I'm wondering why the heck I was unsure. \r\nStory begins with a good pace leading right to the final battle. There are no more side arcs dealing Ushio with youkais\\humans. \r\nThe whole story of Ushio to Tora is quite simple. There were some points in the story which were sort of surprising. However, speaking in general, from the very begining to the end it's just one shounen trope after another. Definetely not HxHlevel. If I were to describe it in few words, I'd say \"evil stuff vs good stuff\". Also some techiques of storytelling are pretty outdated. \\n\r\nWell, there's quite good reason for that. The source had been finished airing before I was born...\\n\r\nStill, the story remains beautiful. If feels Japanese.\\n\\n\r\nArt is something to make me \"oh\". It's great. Oldschool style. I just loved it. Battles are admirably animated here. To the point I had to screenshot almost every frame of battles. I'm not exaggerating here. The style of art is perfectly fitting the story. \\n\\n\r\nSound's good. They've done decent job here. Nothing to complain about. Actually, some OST-s made my spine chilling. Especially, reaching the final episode. I'd even listen to them separately.\\n\r\nOP-s deserve special attention. They were that type of OP-s which you never skip. I'd recommend to check it out even if you're not gonna watch the series. \\n\\n\r\nCharacters... The only annoying one is Ushio. He's a dumbass with \"a true heart\" who goes screaming when it's appropriate and when it's not. Well, relax, he's not only one main hero, how you could already know. I liked Tora more than any other character in the show. I'm sure once you've known his backstory you'll come to like him as much as I do. \\n\r\nSide characters are not that remarkable save few ones(I mean Hyou, Hagare eg. ). There's a lot of girls surrounding Ushio. I like Asako the most. You know, there's something charming in girls of such old stories.\\n\\n\r\nI've enjoyed the series more than I initially thought. But keep in mind there're lot of overused shounen tropes here. You should expect to comprehend the series based, well... on feelings. \\n\r\n I'd recommend you Ushio To Tora, if you are searching for some heart-warming and epic oldschool thing.",
            "date": "2017-02-07T01:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 240082,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4915440.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Leegf",
                "username": "Leegf"
            },
            "url": "https://myanimelist.net/reviews.php?id=240082"
        },
        {
            "content": "English:\r\nThis review will talk about the 2 seasons of the anime, so you can achieve a more global opinion on what I found along the 39 chapters.\r\nWell ... this anime presents a somewhat coherent story (by that I mean the argument is fiction but is \"credible\") and well made, a story filled with many emotions and difficult situations for all characters who engage in this story, and that is something to highlight; the fact that the story does not focus only on a protagonist and an antagonist but also involves many characters who will much contribute to the story, on the other hand we havethe animation with its own characteristics and originality, it gives the feeling of being just watching a sleeve being animated in real time, although not the best animation I've seen or see, is acceptable, the characters in this story are incredible and each has a long and sad story behind (well not all XD ). The first season is loaded with lots of action, comedy very well made that would make anyone laugh that was not a schizoid, drama, etc. Besides having a great opening ... something negative in season 1 is that it has some chapters of fillings, but still are not bored and left to see. Then we have the number Season 2, where give us an incredible twist from the beginning in every way.\\n\r\nhave epic fights from the beginning and characters evolve in many ways, as advances allow us to know many things that were unknown and that are central to the story, among many other things but you have to see and feel for yourself, certainly animation makers have managed to deliver a long history in just 2 seasons and has been very well. Clarifying that season 2 is the best because with it the story ends, but we would expect less? I doubt it ... so if you see a good anime intereza of those that make you remember the old escula, this is the one. I have no doubt that it is a work that would recommend eyes closed! : D\\n\\n\r\nGreetings and hugs to those interested this opinion.\\n\\n\\n\\n\r\nEspañol:\\n\\n\r\nEn esta review hablare sobre las 2 temporadas de este anime, así podrán tener una opinión mas global sobre lo que me pareció a lo largo de los 39 capítulos. \\n\r\nBien... este anime nos presenta una historia algo coherente (con esto me refiero a que el argumento es ficción pero es \"creíble\") y bien hecha, una historia llena de muchas emociones y situaciones difíciles para todos los personajes que se involucran en dicha historia, y eso es algo para resaltar; el hecho de que la historia no se centre solo en un protagonista y un antagonista sino que también involucre a muchos personajes secundarios que le aportan mucho a la historia, por otro lado tenemos la animación con sus propias características y originalidad, da la sensación de estar justamente viendo un manga siendo animado en tiempo real, aunque no es la mejor animación que he visto o verè, es aceptable, los personajes de esta historia son increíbles y cada uno de ellos tiene una larga y triste historia detrás, (bueno no todos XD). La primera temporada esta cargada con mucha acción, comedia muy bien hecha que haría reír a cualquiera que no fuese un esquizoide, drama, etc. Ademas que tiene un opening fenomenal... algo negativo de la temporada 1 es que tiene algunos capítulos de rellenos, pero aun así no son aburridos y se dejan ver. Luego tenemos la temporada numero 2, donde desde el comienzo nos dan un giro increíble en todos los sentidos.\\n\r\ntenemos peleas épicas desde el inicio y los personajes evolucionan de muchas maneras, a medida que se avanza nos permiten saber muchas cosas que se desconocían y que son fundamentales para la historia, entre otra muchas cosas mas que tienes que ver y sentir por ti mismo, sin duda los encargados de la animación han sabido entregar una larga historia en tan solo 2 temporadas y les ha quedado muy bien. Aclarando que la temporada 2 es la mejor ya que con ella se termina la historia, ¿Pero esperaríamos menos? lo dudo... asi que si les interesa ver un buen anime de esos que te hacen recordar la vieja escuela, este es el indicado. No tengo la menor duda que es una obra que recomendaría con los ojos cerrados! :D\\n\\n\r\nSaludos y abrazos a quien le interese esta opinión.",
            "date": "2016-09-25T16:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 230212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5718881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phrogress",
                "username": "phrogress"
            },
            "url": "https://myanimelist.net/reviews.php?id=230212"
        },
        {
            "content": "The problem with writing a review for this anime is that I do not expect the quality difference from one season to another to be SO big. By God, that was really good. The involvement of Ushio and Tora as main characters, their past histories, all perfectly arranged. I was so wrapped up to the point of shedding tears in some episodes.  IS THAT GOOD. I could not believe that i was watching the same anime that make me said \"Just for entertainment\".  Please YOU give this anime a chance. You will possibly appreciate. \r\nThe few problems consists of everything being very rushed(A lot of manga chapters for a few episodes). But it does not spoil the experience of watching it.\\n\\n\r\nAmazing animation for studio MAPPA. It give the manga justice.\\n\r\nAnd the OP'S and ENDS are really catchy.\\n\\n\r\nOverall---- 9.\\n\r\nIt's definitely worthy it.",
            "date": "2017-06-02T22:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 249163,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4542787.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Oldlike",
                "username": "Oldlike"
            },
            "url": "https://myanimelist.net/reviews.php?id=249163"
        },
        {
            "content": "I am totally in love with this series. Overall very likable characters with great character building. The story might not be the most original you've ever seen, but it still has it's own unique twists and turns. I had good laughs and sorrow filled cries through out the whole series and second season was an amazing finish that left me relieved and heartbroken at the same time. \r\nTo me it was something special. It might not be for everyone, but personally I enjoyed the humor, the sadness, the tight bonds developing through the story and I felt fulfilled. My questions were answered and there wereno holes leaving me dissatisfied in the end. I loved this series and feel almost empty that my journey with Ushio and Tora is over.",
            "date": "2017-06-27T03:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 251194,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpectrumCandy",
                "username": "SpectrumCandy"
            },
            "url": "https://myanimelist.net/reviews.php?id=251194"
        }
    ]
]