[
    [
        {
            "content": "Genericism is a very interesting thing. Shows we label “generic” are almost always inferior, so it is only natural to wonder why every season, without fail, there is an overabundance of them. One of the most common symptoms of genericism is that you can easily predict more things than should be predicted simply by taking a glance at the synopsis or poster. You might take one look at Taboo Tattoo’s poster and promptly dismiss it as generic, but I’m here to tell you that it is not. It may seem like it, it may start of like it, but no, I assure you, it isn’t;nay, it is much, much worse than anything you’ve ever dismissed before as “generic”. If you would be oh so kind to indulge me, let me explain to you to the glorious calamity that is Taboo Tattoo.\\n\\n\r\nTaboo Tattoo is the asinine abomination of a show produced when a poorly written, generic sub-par show tries to make fun of itself; it’s like if Sword Art Online tried to be Konosuba. It tries to be self-aware and become a parody of other shounen action anime but relies way too heavily on the tropes and clichés it is trying to subvert—it just feels like it doesn’t know what it wants to be. Now once you top it off with over excessive incessant fan service and wish fulfillment and drastic changes of tone and atmosphere multiple times in an episode, you get the worst show this season. The worst part is, unfortunately, that this show is not bad enough to be considered good. \\n\\n\r\nThe show’s beginning is as generic as it can get, seemingly nothing different from anything else you’ve seen before. It’s got your starter pack of shounen action anime tropes\\n\\n\r\nBegins with unexplained fight scene ✓\\n\r\nBeta-male randomly given mysterious power ✓\\n\r\nSaid power is the strongest one ✓\\n\r\nMC is the “perfect match, almost like a god-sent” for that said power ✓\\n\r\nChildhood friend (with obvious crush on MC) MC must protect ✓\\n\r\nEvil organization after MC’s power ✓\\n\r\nKiller lolis ✓\\n\r\nFan-service (massive bouncing boobs, panty shots, low angle shots) ✓\\n\r\nYuri action ✓\\n\r\nTentacle groping ✓\\n\\n\r\nBut from this bland and overdone setup the show manages to transcend itself above the descriptor of “generic” and enter a new realm of inferiority that is rarely ever reached in the medium. There are an innumerous amount of things that make this show difficult to consider “good” let alone “mediocre”, I’m not even sure where to begin.\\n\\n\r\nThe plot progression is unreasonable with oddly placed fight scenes and illogical character motivations. The events that happen are so bland and simple that it’s paradoxically difficult to suspend my belief. The main character, Seigi, really just gets his Taboo Tattoo power after saving Dr. Wiseman (yes, that’s really his name) from getting beaten up by a couple of thugs. How and why was he getting beaten up? Good question, never answered. Why does Seigi defend this man and potentially risk his life? Good question, thinly answered. \\n\\n\r\nThe show then proceeds to nonchalantly introduce a country that doesn’t exist in real life, and not once does it ever expand on it in a more meticulous fashion, because who really cares about world building? The Tattoo power is explained using convoluted logic that boils down to “it’s magic” that is so unimaginative in nature that the show would actually have been better off leaving it unexplained. New abilities of that Tattoo power are suddenly introduced with little explanation and things just escalate into ludicrousy of epic proportions. \\n\\n\r\nThe wish fulfillment aspect of this show cannot be emphasized enough; everything that happens is some sort of wish fulfillment or the other. Without spoiling anything, there is literally a scene where Touko, or how I like to call her, BigBoobs-chan, goes to meet Seigi, or MC-kun. MC-kun is passed out in his Grandfather’s dojo and BigBoobs-chan sits next to and watches over him. Suddenly, out of nowhere, a pale red blush overtakes BigBoobs-chan’s face as she promptly muses to herself “it is a woman’s shame to ignore a man offering himself!” and proceeds to lean over MC-kun, confining him between both her legs and arms. What BigBoobs-chan (who is a middle schooler, mind you) was trying to accomplish, I can’t for the life of me figure it out. Anyway, naturally, MC-kun wakes up at this time and says “BigBoobs-chan?” another blush, this time maroon red, invades BigBoobs-chan’s face and she, in embarrassment, stops leaning over MC-kun and sits down. But where does she sit down? Of course, it has to be on MC-kun’s groin! Because who really cares anymore? This is just one of the scenes I have mentioned, there are even more titillating and salacious scenes throughout the show as well (token tentacle groping scene included), so if you’re into this kinda thing I’ll just tell you to go for it. \\n\\n\r\nThis unrestrained wish fulfillment naturally leads to an overabundance of fan-service. Now, of course, as present in almost every single anime, there is fan-service. The only reason I am discussing it is because of how abundant it is. Literally, there will be at least a couple dozen fan-service scenes per episode. Yeah, you read that right, per episode. The worst part? It is never limited to solely basic fanservice stuff like panty/butt/cleavage shots of likes, no, it is more like straight up girl on girl action. Of course, there is a difference between “fanservice” and expressing a character’s “sexuality” but nobody behaves like our Yuri-loving princess antagonist, Aryabhata. She will straight up grope her loli companions out of nowhere, randomly getting prepared to sleep with them numerous times throughout the show. Again, if you’re into this kinda thing, I’ll just tell you to go for it.\\n\\n\r\nIt is nearly impossible to review the characters because they barely qualify to be called so.\\n\\n\r\nSeigi is just a distressingly bland “I want to be a hero of justice” archetype with zero personality outside that; in short, he is a self-insert. The only development he receives is contrived and at the cost of reducing other characters to plot devices.\\n\\n\r\nTouko is the “I want to be with my childhood friend no matter what!” archetype, and outside of her big boobs, she is nothing but the waifu for the self-insert. \\n\\n\r\nBluesy Fluesy—I kid you not, that is really her name—is just a trained and skilled soldier trapped in a middle schooler’s body, because this show wouldn’t be complete without an underage female who’s prepubescent panties we will never see enough of. \\n\\n\r\nBlood Blackstone (or BB), the only decently written character in the show (not saying much). Compared to the rest of the cast he’s more complex than a labyrinth and more deep than than BigBoobs-chan’s cleavage. His character backstory is engrossing enough to keep you invested as well (one of the better episodes of the show). \\n\\n\r\nOne of the antagonists, Aryabhatta, is a prideful princess who’s also a lesbian and sexually promiscuous, as she readily and regularly gropes her loli companions in good fun. \\n\\n\r\nI suppose I should also mention how this show degrades their female characters, not that many viewers really care, but I feel obligated to mention it.\\n\\n\r\nHm? What’s that? “What about the other characters?” Nah, these are the only “characters” that are involved in this show. One thing I can compliment the show for is that it isn’t afraid to do stuff other action shounens wouldn’t normally do, like killing of major characters and severely injuring others. Even this is done in a forced way (killing characters in stupid ways) but I have to give credit where credit is due; the removal of certain characters certainly made things a little bit more interesting.\\n\\n\r\nThis show is also very ostentatious. Taboo Tattoo tries to explore ideas concerning “justice” and how it is perceived differently depending on position of the person; this leads to the show suddenly humanizing comically evil villains in a very heavy handed approach. The show is never subtle with its themes, moments are contrived in an obtuse manner just to culminate in a preach given by a character on the “delicacy of justice” and how “I won’t stop others from their own justice”. And again, as I mentioned, the show also tries to be satirical and often pokes fun at regular storytelling tropes—so how can it try and have resonant themes about justice? The two just don’t click together. \\n\\n\r\nLiteral forced drama, never seen emotional catharsis from characters in a show more contrived than this. Characters that are seemingly unrelated suddenly reveal to be in strong platonic or romantic relationships with one another and expel more cringe inducing lines of dialogue like “you never change” out of nowhere. The jarring tonal shifts in the show are consistently present in here as well, as one moment will be some serious (yet boring) exposition scene and suddenly the music accompaniment changes to slow, sad piano music as one of the characters suddenly talks about how much he/she missed the character. \\n\\n\r\nDrama and problems that arise in the beginning episodes (and are resolved) suddenly come out of nowhere during conversations because the writer doesn’t know how to form real dialogue between characters. “Is it okay if we stay together?” is said multiple times throughout the show, for no reason other than to contrive some unnecessary and predictable drama between characters that achieves nothing. There are no character dynamics whatsoever, every conversation bounces between either exposition or some unfunny joke.\\n\\n\r\nThe animation is unremarkable, the character designs are generic and bland, the colour palette is unnecessarily monotonous, the fight choreography is annoyingly inconsistent, yadda yadda yadda. It has its moments with insane CG cinematography where the camera pans around in all sorts of degrees, but those are few and far between. \\n\\n\r\nEnjoyment: 4/10\\n\\n\r\nIf you liked the abundance of action scenes, the Tattoo as a superpower, and the whole concept of good vs evil organizations clashing, then I’d point you to Bungou Stray Dogs. It’s far from exceptional by all means but does everything Taboo Tattoo tries to do a bit better, which unfortunately isn’t saying much but overall Bungou Stray Dogs is the better version. If you enjoyed the moments when the show pathetically tried to be satirical, then I’d point you to One Punch Man (but let’s be honest, who hasn’t seen this already).\\n\\n\r\nOverall: 2/10\\n\\n\r\nTaboo Tattoo is very impressive in its own right. It is honestly difficult to write a show that can pierce this untapped sphere of atrocity, not even inexperienced and first time authors can write shows this bad. It feels like the writer of Taboo Tattoo was intentionally trying to create a story that was B-level, schlock entertainment, but like I said in the beginning of the review, this show is just not that bad enough to be considered good. Maybe if it didn’t take itself so seriously, or it was more consistent with its self-awareness and poking fun at action anime tropes, then it would have been a great satirical parody of the shounen genre; but no, unfortunately Taboo Tattoo is just the perfectly well-rounded package of trash.\\n\\n\r\nI hope this review was informative and helpful.",
            "date": "2016-09-20T14:31:00+00:00",
            "helpful_count": 148,
            "mal_id": 229646,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352541.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Adi",
                "username": "Adi"
            },
            "url": "https://myanimelist.net/reviews.php?id=229646"
        },
        {
            "content": "Taboo tattoo is a kind of show that I have high expectation once,it went well in the beginning.However,things started to go in a wrong direction and finally become a train wreck.\r\nStory(3/10)(35%)\r\nThe beginning of Taboo Tattoo is very easy to follow,it started with a rich introduction about the story and also the characters,which is a solid start.\r\nThe actions are also impressive too,characters using different skills to fight against enemies.I have no complaint about the actions.Its exciting and fun to watch.\r\nHowever,things started to turn worse in the later episode.The pace of the story is kinda fast and rough.It feels like the story is rich and full ofelements but at the same time,there's too much to talk about.Therefore,the anime decide to use fast pace and weird transitions in order to do so.However,this may affect the story process and you may miss some of the important information.\\n\\n\r\nAlso,because the later episode is mainly fights.Fanservice and comedy elements are misplaced,therefore,the story is lacking of depths and the overall feeling is weird.They had to get away from that and replace them with much more useful content instead of fanservice and comedy.\\n\\n\r\nThe worst part of taboo tattoo is the plot is starting to off its original rails,which is totally unacceptable.In later episodes,after characters died,they put back stories about them,main characters are being abandoned afterwards,which the plot seems to be going to nowhere.It seems like Taboo Tattoo just give up in halfway.such a shame.\\n\\n\r\nAs expected,the ending ends up in a rush...\\n\\n\r\nAnimation art (8/10) (10%)\\n\\n\r\nThis anime pays a lot of efforts on battles,you can see that characters use different items (e.g:smoking bombs) during battles with diversified skills and techniques.\\n\\n\r\nCharacters also have different decisions because of their personalities and weaknesses during the battle.Therefore,the whole screen of the animation is rich and realistic.\\n\\n\r\nIf the quality of the graphics is better,such as:using more colourful visuals,it would be more splendid.\\n\\n\r\nSound (7/10) (10%) (including music)\\n\\n\r\nThis anime also pay a lot of efforts on sound effects during the battle,which contains characters conversions with a lot of details (hitting the wall,injures)\\n\\n\r\nThe op seems to fit the theme of the story too.Its filled up rocky-style music.However,if they able to add some more background soundtracks and sound effects inside,it'll be better.\\n\\n\r\nCharacters (2/10) (25%)\\n\\n\r\nAs I have mentioned,the story has a rich story introduction and the story is well bonded with the characters.\\n\\n\r\nUnfortunately,this is the only best thing for characters development.\\n\\n\r\nCharacters is lacking of depths because the whole anime is mainly fighting in the later episode,I hardly feel any kind of emotions when characters are having struggles or tragic events.Maybe because of lacking of back stories,which shows this anime fails to deliver any emotional moments to the audience and affects the overall enjoyment and the characters development.Touko,for example,is just a bunch of fanservice and a mental support girl to Seigi but none of her backstories are told.\\n\\n\r\nOther problem is the character design,the naming of characters is weird.the MC is called Justice or Seigi (Seigi means Justice in Japanese) and the other one is Bluesy Izzy,maybe they want to let us easy to remember the characters name.However,it's still unacceptable because they are too simple.\\n\\n\r\nEnjoyment(3/10)(20%)\\n\\n\r\nIf you are an action anime fan,this anime Taboo Tattoo should suitable for you because it has a lots of actions.\\n\\n\r\nOtherwise,I wouldn't recommend Taboo Tattoo because plot is going insane afterwards and it's disappointing.\\n\\n\r\nI'm feeling bad for the solid start....Taboo Tattoo really once give me a great impression to me,but sadly it turns it to a train wreck at the end.Its painful to rate this anime with low score honestly...\\n\\n\r\nOverall (3.65/10)(F)(Dreadful)\\n",
            "date": "2016-09-24T05:25:00+00:00",
            "helpful_count": 57,
            "mal_id": 229991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569911.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swordarc",
                "username": "Swordarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=229991"
        },
        {
            "content": "Lelouch's dad once said, \"Notto disu shitto agen.\" Well, that's exactly what i was thinking while watching Taboo Tattoo.\r\nJustice! Heroism! Friendship! And middle schoolers!? In a battle to save the world, our middle school justice-loving protagonist conveniently receives the most powerful tattoo. This Tattoo has the power to create black holes and, of course, Seigi uses it for justice and protecting his loved ones... But what actually happens in this story when you put a naive middle schooler and his powerless childhood friend in the middle of a war to save the world...? Well, my friend, people die.\r\nAh yes, Taboo Tatoo: an anime where themain protagonists are cliché, enemies are crazy in addition to being cliché, and cliché female characters bombard you with a huge amount of fanservice. Take those elements, add in a dash of \"mediocre plot\", a pint \"stupid protagonists\", sprinkle on the \"plot conveniences, and then put it in the oven for 12 episodes. VOILA! Oven baked and ready for viewers.\\n\\n\r\nStory: 6/10\\n\r\nWalking down a street at night you see an old man being harassed. Normally you have several options and would probably choose to either call the police or keep walking, but not if you're our 15 year old cliché martial artist justice-loving protagonist. That's right, you've gotta \"save the old guy\". Unfortunately, this is where our protagonist goes wrong. That old fart then forces a super rare \"Tatoo\" upon him that grants him the power to make black holes, and we all know that Tattoos can't be removed easily. \\n\\n\r\nNow it's time to talk about Bluesy Fluesy... Firstly, who the hell named her that? I'm thinking that some douchebag was probably just shitting down on the toilet thinking \"Meh, she's American... Whatever, ima just call her fcking Bluesy Fluesy.\" Anyways, the main character gets his ass kicked by her and becomes wrapped up in a secret world-wide battle to collect the Tattoos from those who misuse them. (Pretty Mediocre of a Premise) The battles often cause people to lose limbs, so I guess you could say it's relatively graphic.\\n\\n\r\nThe comedy made me laugh occasionally throughout the anime, that's definitely a plus.\\n\\n\r\nThe pacing was... okay... we get a rather slow start that gives you a shounen feeling, but then... SHIT SUDDENLY HITS THE FAN and there's a time leap. From a busty super-sexual royalty girl villain to a loli schrodinger's-cat-like character, this show has it (fanservice) all. Overall, I felt the story itself wasn't really that interesting there's only a few ways these type of stories can go. Train, power up, overcome, maybe fail once or twice, win or lose in the end. There's nothing special here, but the battles were good and there were interesting character relationships. \\n\\n\r\nOverall, I think it's a good enough story that killed my boredom. 7/10\\n\\n\r\nCharacters: 4/10\\n\r\nBesides the main character, and massive amounts of cliché archetypes, the characters were actually pretty good... I absolutely loved when the enemy characters got screen time (Arya and BB were the best chars in this series), but you most likely won't be getting any new favorite characters from this anime unless you're a new watcher. Arya, the main villain girl, was the most interesting character in the show with a decent amount of depth behind her character, with reasons that were actually pretty logical. Really didn't enjoy \"naive-middle-school-hero\" Justice or \"this-useless-dumbfuck-wants-to-be-by-him-even-during-life-threatening-danger\" childhood friend. Cliché protagonists. Everywhere. 4/10. But--- The villains were an interesting 7/10, so it averages as a 6/10 in my books.\\n\\n\r\nArt: 8/10 \\n\r\nThe art was actually pretty good. I genuinely enjoyed watching the fight scenes because of the art.\\n\\n\r\nFanservice. There's a lot of fanservice. Arya even randomly gropes boobs and engages in lesbian sex. There are also a ton of low-angle shots where you can get a nice view of some Bluesy ass. \\n\\n\r\nAlthough there's no nudity. Some people argue that it takes away from the anime, others are straight males (jk) but i don't think it really interfered that much. Well-drawn scenes, okay animation, and great special effects so it's good enough to give an 8\\n\\n\r\nSound: 6/10\\n\r\nAs a musician, I'm always listening to an anime's background music. Honestly, I only slightly remember the piano piece and liked the main theme, the rest weren't unique or noticeable. The fighting sounds and music definitely enhanced the exciting moods that they were trying to convey. The sound was okay...\\n\\n\r\nEnjoyment: 7/10\\n\r\nAlthough I disliked most of the protagonists, thought the entire series was cliche, and not much happened that I didn't expect, I actually did enjoy watching this series. As an action and supernatural anime fan, my expectations were met while watching it. Fanservice was a plus for me, but it may be a minus for you. It helped kill some time for me :).\\n\\n\r\nOverall: I give it a 6 overall. It's a decent recent anime that's good enough to kill some time, but has annoying characters everywhere and takes itself way too seriously. Some of the characters were so stupid that it felt like their deaths felt kind of comedic in nature.\\n\\n\r\nBut in all seriousness, I wouldn't want to watch disu shitto agen... \\n\\n\r\nI'd probably watch a season two if it came out though~\\n\\n\r\n(if you agree or enjoyed reading, let me know by clicking helpful or commenting on my page~ thanks~)",
            "date": "2016-09-19T22:16:00+00:00",
            "helpful_count": 33,
            "mal_id": 229566,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1244257.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/3xTripple",
                "username": "3xTripple"
            },
            "url": "https://myanimelist.net/reviews.php?id=229566"
        },
        {
            "content": "With a riveting cast including:\r\nA teenager named Justice\r\nA childhood friend with big tits\r\nA middle aged lady who still looks 14\r\nAn otaku assigned to care for the middle aged lady who looks like a teen\r\nBig tough guys claiming to be american soldiers\r\nA guy obssessed with snakes and dicks\r\nA girl who thinks shes a samurai\r\nA loli with yuri tendencies\r\nA holier-than-thou silver haired princess\r\nA guy in a black coat with a brooding and gruff attitude\r\nThis show is just as original as they come.\r\nOverall the story suffers from its usual tropes, and its one redeeming episode was so far in and disguised by so much garbage that it doesn'tshine so much as flicker and die like a candle in a collapsing cave. \\n\\n\r\nThe show itself cant decide wether it wants to be a comedy, or a serious show and proceeds to do neither well\\n\\n\r\nA good concept followed by a sputtering failure\\n\\n\\n",
            "date": "2016-09-14T08:35:00+00:00",
            "helpful_count": 24,
            "mal_id": 229028,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/495847.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/VanillaGumi",
                "username": "VanillaGumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=229028"
        },
        {
            "content": "While watching anime, have you ever caught yourself saying \"oh, this cliché again, I've seen that in so many other shows already''. Well, try gathering as many of them as you can think right now, the worst ones, and put them into an anime. Add lots of violence, sexual content and throw bad jokes in the most awkward way possible. There, you've got Taboo Tattoo! \r\nSo, what is Taboo Tattoo about? Its story follows a middle-school boy who, after saving a mysterious stranger, he receives a tattoo, that is actually a powerful weapon, and then he gets involved in a war between two sides. Like,haven't we already seen this plenty of times? Reusing a certain theme isn't necessarily a bad thing. If you handle it correctly, that is. \\n\r\nIn the case of Taboo Tattoo, though, everything has gone wrong. The pacing through the episodes can be rushed and awkward, there are times that you can't even tell what is going on and too many clichés are just thrown into the story, like it is something natural and positive to have no imagination and originality at all.\\n\r\nAnd how does the show want to compensate for its poor writing? With childish, predictable jokes and ridiculous fan-service. The way they are thrown in here is just completely wrong and it's just done that for the viewer to avert his eyes from the badly written story and dialogue.\\n\r\nThe transition between the serious scenes and the scenes with jokes and fan-service is done very abruptly, too, and they ruin the little tension the serious scenes could have caused.\\n\r\nThe only thing that the anime really focused on, is the action and almost the whole show is filled with it but, even those scenes weren't as exciting as more episodes passed. In the beginning of the anime, you would think that there is an actual plot and that all the elements of the story would be properly explained. There are times when it kind of tries to do these things but, the rushed pace and explanations of the anime only achieve to make things more complicated and you just end up watching some fighting with not much meaning behind it.\\n\\n\r\nThe characters are as dull and insignificant as the story and they all lack depth.\\n\r\nYou have your already strong teenage protagonist, Akatsuka Justice, who wants to protect the weak and has a strong sense of justice, as his name says. He is the guy who accidentally receives the most special of all the superpowers, and has a little bit of a dramatic past, that makes him want to become stronger.\\n\r\nThere is also the childhood friend, Ichinose Touko, with the big, bouncy chest that secretly has a crush on the main character.\\n\r\nFinally, the one character that might be a little more interesting, is Bluesy Fluesy, but she also falls a victim to the poor writing. She is the cool and strong female protagonist.\\n\r\nThe development they are supposed to receive is only based on the deaths of characters you couldn't even bring yourself to care about. That can be a way to develop a character but, what is the point of it when you can't relate to his/her feelings?\\n\r\nThe amount of unimportant and forgettable side characters is quite big, too. \\n\\n\r\nThe art and animation are better than the other aspects of the show, with greatly choreographed action scenes, although the animation can become a little dull sometimes. Most of the effort regarding the animation, is put in the action scenes while, the rest of the scenes don't look as good as those ones. \\n\r\nThe angles from which we watch the show are quite interesting but, they can be weird sometimes. The art style and backgrounds are decent and the colors that are used can create a darker atmosphere but, there are times you would wish for a little more colorful visuals. Just like the transition between the serious scenes and the funny ones is done abruptly, the same goes for the art style and the colors, too. The characters are drawn in chibi form and the colors are vivid in the funny scenes. The rest of the art goes to the fan-service and the ridiculously large chests.\\n\\n\r\nThe OP and the ED of the show are a bit generic but, pretty nice. The OP, \"Belief\" by May'n, fits the action theme of the anime and its visuals are filled with action and almost the whole cast. The ED, \"EGOISTIC EMOTION\" by the Voice Actresses of Bluesy Fluesy (Mikako Komatsu) & Touko Ichinose (Chika Anzai), is more relaxing to reduce the tension, and just shows pictures of the female characters. \\n\r\nThe background music is mostly used well, although it mainly consists of some rather bland beats. The sound effects are fair but, they can be too loud sometimes (so many explosions!) and the voice acting sounds fine.\\n\\n\r\nCan you get enjoyment from an anime with such poor writing, overused story and uninteresting characters? If you like action anime a lot and you don't mind what I mentioned before then you should be fine and enjoy the nicely animated action scenes. Personally, I expected at least a little more from this anime and got extremely dissapointed.\\n\\n\r\nTo conclude, Taboo Tattoo is the epitome of cliché, in the worst way possible, with both poorly written story and characters, while desperately trying to appeal to the viewer with bad jokes and unnecessary fan-service. I wouldn't recommend Taboo Tattoo to anyone who wants to, actually, watch a good show.",
            "date": "2016-10-07T07:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 231249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=231249"
        },
        {
            "content": "(This review may contain spoiler and/or name drops of other forms of media)\r\nBack in Spring of 2016, the disaster that was My Hero Academia plagued the anime industry and almost ensured certain death of the said industry. However, Taboo Tattoo was there to save it and it did so amazingly!\r\nStory - 9/10:\r\nBasically, the story follows Justice \"Seigi\" Akatsuka, the main protagonist of this anime, on adventures to protect people and serve as justice. Sounds like a generic battle shonen anime, right? If you actually watch Taboo Tattoo, it can actually get much darker, such as making perseverance backfire by resulting in the death of thechildhood friend Touko Ichinose (truly one of the saddest death in anime as a whole), changing Seigi's character from generic battle shonen justice lead to being a dark vengeance seeker. Therefore, what I loved about Taboo Tattoo is that it actively insulted the \"persevrance-always-wins\" card and added actually intense fights. Granted a point was cut due to some scenes having excessive fanservice, but overall the comedic moments made me laugh hard (adding salt to My Hero Academia's wound, again!). Overall, action was great, comedy was fantastic overall, and the dark and lighthearted moments mashed together really well.\\n\\n\r\nArt - 10/10:\\n\r\nMassive props to Taboo tattoo for being one of the first anime for implementing single-shot 3D camera rotations during action scenes and making the fights as extremely intense as possible. Add in the fact that there is blood and gore during fights and they are almost realistic-looking (I am no sadist but blood and gore in anime make anime fights much more interesting in my opinion) and you have a masterclass in art and animation depot.\\n\\n\r\nSound - 9/10:\\n\r\nThe OP sounded quite bad, I will have to concede there. However, the ED sounded rather nice. As for the in-anime soundtrack, it was done really well and fit both the dark, horrifying moments and the lighthearted comedic ones, giving me the excitement and laughs respectively. Oh my god, there has never been a soundtrack so well made that I just want to re-listen to this anime's soundtrack in full.\\n\\n\r\nCharacter - 10/10:\\n\r\nWhat Taboo Tattoo does is take generic characters from battle shonens and develop them into their own unique personalities. For example, Seigi changed completely after Touko's death, from generic justice shonen lead to dark revenge badass. Another example is how Bluesy \"Izzy\" Fluesy opened up to Seigi more as they tried to fight for their own lives from predators (as in those that were targeting them). Heck I'll even give Aryabhata, the main villain of this anime, credit for showing a lighthearted side of hers while at the same time, being a power-hungry villain. That I can give a lot of credit for taking a rather generic villain and adding a new polar opposite personality. However, the biggest credit has to be given to none other than Brad \"BB\" Blackstone. Brad is actually one of 10 favorite characters in the entire anime industry, alongside Kiritsugu Emiya of Fate/zero and Tatsuya Shiba of The Irregular At Magic High School. What makes him so special and so amazing as a character is how he is a badass that has been given tons of character development, despite his small screen time throughout the anime, by adding a rather soft side to him as he had feeling for Izzy. Therefore, anything lower than a perfect 10 in the character depot would be an insult to this anime.\\n\\n\r\nEnjoyment - 10/10:\\n\r\nThere is no other way to put my description of my enjoyment than this phrase: \"awesome action, comedy, and feels!\"\\n\\n\r\nOverall - 9.6/10:\\n\r\nDespite some excessive fanservice, this is a must watch for those who enjoy action, comedy, or both. This is also a must watch for those who want to see anime with some degree of feels to it (as in feeling sad for a character's death). And to think this was made by the same studio who made the awful Toradora!, this has to be a huge jump in anime quality. So yeah, I highly recommend this masterpiece! \\n",
            "date": "2017-10-10T18:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 260442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5779468.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tatsuya500",
                "username": "Tatsuya500"
            },
            "url": "https://myanimelist.net/reviews.php?id=260442"
        },
        {
            "content": "TL;DR at the end\r\n~Contains Spoilers~\r\nThe reviews for this show are far to generous. Even this one, is far to generous, and I haven't even wrote it yet. If you enjoy cliche shows, then that's fine. But it doesn't change the FACT that this anime takes itself way to seriously and becomes one of the hardest things to watch in anime history. \r\n________________________________________\r\nSTORY: 1/10\r\nThough I will admit the timeskip episode stirred a slight bit of emotion inside me, a fraction of my fiber that harbors a forbidden love for this type of anime.... the rest of it had me throwing up inside my mouth. There isa lot of character death in the series, which I can't understand why was a remotely good idea, seeing as I cared about two or so of the characters anyway. To make matters worse, for some reason, at least half of the episodes have some sort of sexual scene for LITERALLY NO REASON RELATING TO THE PLOT. IT MAKES NO SENSE. I haven't even gotten into the main plot yet. You know what, I don't have to: It's bad. Really bad. That's all you need to know.\\n\r\n________________________________________\\n\r\nART: 4/10\\n\\n\r\nWhile Taboo Tattoo is left with some very satisfying fight scenes and magnificent shading and tone left by the animators, some of the scenes are just disgusting. I don't know how many times we've had to tell Japan that CGI DOESN'T WORK, and yet they've kept it up all these years... Though a minor problem, as these events are few, it's still extremely aggravating to watch. Though, like I said earlier, the art is good, the dark colors sometimes make it hard to see what's going on, which wouldn't be as much of a problem if the movements of characters weren't so choppy at times. \\n\r\n________________________________________\\n\r\nSOUND: 4/10\\n\\n\r\nThe opening theme, wile cliche'd, is still good. The ending as well. It doesn't matter though, I was too busy crying manly tears for all the poor headphone users out there who forgot to minimize their volume before the episode. I don't know who thought it would be a good idea to use ear rape as an explosion sound effect, but if the motive was to drown out the OST and voice acting completely, then, well, it worked\\n\r\n________________________________________\\n\r\nCHARACTER: 1/10\\n\\n\r\nThe only characters I remotely liked were the comedy relief characters. The rest were abominations of cliches and I'm glad most of them end up perishing in the end. That's all I can say without completely blowing up in a rage fit about how atrocious these characters are.\\n\r\n________________________________________\\n\r\nTL;DR: 3/10\\n\\n\r\n+Decent fight scenes\\n\r\n+Decent color\\n\r\n+Decent OP/ED\\n\r\n+Decent comedy relief characters\\n\r\n-Everything else\\n\\n\r\nTaboo Tattoo is... no. I have no words. If you've ever seen an anime before, and if you don't adore cliches, then I can't recommend this to you.",
            "date": "2016-09-19T19:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 229556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4971552.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/thelectricow",
                "username": "thelectricow"
            },
            "url": "https://myanimelist.net/reviews.php?id=229556"
        },
        {
            "content": "This anime is underrated and many seem to characterize it as generic. Many things about this anime make it distinct from your typical 12 episode 'gotta save the world' story including: \r\n- involvement of superpowers (i.e. America)\r\n- ambitions of the antagonist that go beyond world domination\r\n- deaths of major characters unexpectedly \r\n- a questioning of morality, justice, etc. \r\n- good action scenes (w/ guns too)\r\nThe anime also resembles Cold War conditions. The antagonist's pursuit of utopia via ruthless violence in addition to their annoying demeanor makes the audience root for the protagonist (and the U.S.A.). \r\nI just wish the antagonist would read the Declaration ofIndependence, The Federalist Papers, The U.S. Constitution, the Hebrew Bible, the Dhammapada, as well as the writings of philosophers like Locke, Aristotle, and Kant. Maybe they could reconsider trying to formulate a new world from feelings without any understanding of consciousness. \\n",
            "date": "2018-08-05T01:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 285622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4912450.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/sbrawkcad",
                "username": "sbrawkcad"
            },
            "url": "https://myanimelist.net/reviews.php?id=285622"
        },
        {
            "content": "I'm not an in-depth reviewer but I felt the need to tell you not to watch this. \r\nSomeone told me that a big reason the show can be a bit jarring is because it's influenced by something called \"wuxia\" (google it). However, the main issue is with the plot. I can overlook the bad comedic timing, bad CG, bad explosions, but someone did not storyboard this show. The plot jumps around so much and is incredibly inconsistent I'm usually left just as confused as I was after the previous episode. Yet I came back every week to see if, just maybe, I'd finally understand something.I'm still waiting.\\n\\n\r\nAnother big issue is the plot armor. I don't think I've ever seen plot armor this thick before and it really shines in the final episode.\\n\\n\r\nOne of the few good things I can say about this show is that it is very self-aware. Often times it makes some decent jokes and pokes fun at itself or the anime medium as a whole but about half of the jokes suffer from what I mentioned before, poor comedic timing. You've just come off a very traumatic scene where everyone's super serious and fighting and then jumping straight into some fart joke level comedy or an ecchi scene that occasionally shows up that completely throws off the whole pace of the show.\\n\\n\r\nI've been told most of this can be attributed to this wuxia style, and if so I am not a fan. So be warned non-nippon fans, YMMV with this one unless you're a fan of martial arts/sorcery, and even then you might still have a hard time with the bad plot and inconsistent pacing.\\n\\n\r\nSome of the stuff in the final episode is so bad it's comedic so there's another small plus?\\n\\n\\n\\n\r\nFINAL EPISODE SPOILERS BELOW BECAUSE IT'S SO BAD\\n\r\n(If this isn't ok let me know and I'll remove the spoiler)\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\n\"Hey watcher, you know those super awesome powers the characters all have. Well, MC-kun can't beat asshole antagonist girl with his own power cause she's OP as hell. So instead we're just going to make them turn into the \"mechs\" we've been teasing the whole series (that were never even physical and seemed more like mascots for the power) and have them fight so he actually stands a chance. Then he has this deep revelation about how awesome he is and then hands asshole girl her ass. Then everyone cheers and MC-kun has a deep philosophical conversation with himself over the body of his maybe dead sensei-chan\".\\n\\n\r\nLeaving me asking \"what did I just watch\", and then they kind of hint at s2 or something?",
            "date": "2016-09-21T21:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 229778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3592461.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Bebop",
                "username": "Bebop"
            },
            "url": "https://myanimelist.net/reviews.php?id=229778"
        },
        {
            "content": "Gosh, where do I start...\r\nRight. Taboo Tattoo is like finding a good book with a good summary printed on it, only when you flip it and start to read it, you realize it's horrible. I imagined the creation of this anime started out with a guy who had some sort of checklist.\r\n\"How to make a good shounen anime. You need:\r\n- Child protagonist ( )\r\n- The Chosen One ( )\r\n- School setting ( )\r\n- Comedy ( )\r\n- Female fanservice ( )\r\n- Romance ( )\r\n- Token Loli ( )\r\n- Good backstory for side characters ( )\r\n- Big boobs ( )\r\n- Badass characters ( )\r\n- OP antagonists ()\\n\r\n- \"Nakama\" power ( )\\n\r\n- Gore/Death ( )\\n\r\n- Swear words ( )\\n\r\n- Yuri ( )\\n\r\n- Torture, for MC's growth ( )\"\\n\\n\r\nAnd the guy makes sure it's all there. Sure, they are all there, but the pacing of the story is awful. Some episodes aren't entirely linked to the previous, and the anime's pacing can go from serious to comedic in less than a second, destroying the mood. Half of the time I wasn't sure what I was watching. The first four episodes looked decent, and then it started going downhill. It feels like the anime wanted to please many audiences than what it was originally capable of at that point that it became a joke itself. Maybe that was the whole point? In that case the seriousness of the anime didn't justify itself. The so-called \"tattoo\" that granted people powers suddenly turned the anime into a magical one, where almost everyone is capable of using it. The story is so thinly threaded despite it was to \"defeat antagonist\". Then they added some pointless gore and death, crossing their fingers that it would make the whole thing better. It did not.\\n\\n\r\nWhen your side character has more story than your main character, this is where it goes wrong. I relate more to a certain side character that appears for only 3 episodes than the MC who did probably nothing but tried to kill himself (and failed because plot armor) for 12. Sure, side characters need love and backstory too, but I literally know nothing apart of MC's unjustified strong sense of justice, extreme recklessness, and that he's the main character. Though, he finally picks up and became slightly better at episode 9, but he's still a mystery to me. Is he even the main character, I wonder? Some side characters have proven to be more interesting than an empty shell of \"Justice\" he is.\\n\\n\r\nNothing much to say about art and sound. They're at least better than what it's trying to convey. The art is pretty good, I must praise it. However, despite how much I can praise it, it will not change how much a mess this anime is.\\n\\n\r\nI was hoping it to at least achieve the bare minimum of average, as a shounen anime that has a decent start. It turned out to be a lot worse than what I was expecting. Just finished it earlier, and towards the end I was dragging myself with the episodes. The ending of the anime was probably a nightmare. That whole thing was hinting for a season 2? Jesus, if that ended up getting a season 2 it would've been a miracle. It was even worse than Charlotte that I hated, because this was so hard to watch, and that it actually gave me hope before it trampled all over it. This whole thing is a mess. Sugar and spice, mix in together, and you'll get this thing called \"Taboo Tattoo\" - a mess that doesn't know how to fix its own mess, and ended up becoming a bigger pile of a mess.",
            "date": "2016-12-07T07:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 235031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2617657.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Norayuki",
                "username": "Norayuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=235031"
        },
        {
            "content": "Basically\r\nThe starting episodes from 1 to 5 was really good. But then the ending episodes just sucked pure and utter ass. The opening and ending songs are really awesome, since I discovered this anime through osu.\r\nThe anime started off with a strong beginning, strong buildup in episode 1, so it got you into the anime.\r\nBut then, from each episode to the next, you're absolutely lost, you have no idea what happened because they don't start from the scene from the previous episode but from a scene which is 3 days after that scene. The timeskip from episode 10 to episode 11 of 1 year wasstupid.\\n\r\nThe anime was rushed, the story wasn't allowed to develop since it didn't have the episodes needed to develop, it was too rushed. If developed properly, this anime would have been a great enjoyment to watch.\\n\r\nI also hated the fact that put in jokes within serious scenes, what is the point of that?\\n\r\nThe ending episodes and their CGI animation, absolutely horrible.\\n\r\nA great start finishing with a terrible ending.\\n",
            "date": "2016-11-19T13:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 234025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4004001.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ingigo",
                "username": "Ingigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=234025"
        },
        {
            "content": "Summary-  Teenager Seigi saves a homeless man from thugs, only to be given a special tattoo which bestows on him special powers. This leads Seigi to meet Izzy a lieutenant of the U.S army who's in charge of collecting people with tattoos. This pulls Seigi in the middle of a conflict between the U.S and the Kingdom as both are collecting these tattoos for their own countries\r\nStory- they're is so much wrong with this anime's story that it's hard time find anything right. the pacing is way too fast that it goes from one thing the the next with no real sense of direction.it's so filled with cliche and fan-service that when it tries to take it's self seriously it just end up being silly and boring. why bother with anything in the whole story when we can be busy groping breasts and showing panty shots. the changes of tone are so drastic that it seems it's not sure what it wants to actually be\\n\r\nthe show also tries to make fun of said tropes as well as add some referential humor, only for that to add nothing to the story as a whole.\\n\r\nthe powers don't even make sense they are just some magical tattoos that happened to be their. How are they unique? they aren't they are there to serve the plot when needed from being simple enhancements to giant monsters just cause. not only that but it seems that our MC has the best of all these tattoos.\\n\r\n1/10\\n\\n\r\nCharacters- all the characters lack any sort of depth. the most notable characters are the two from the summary Izzy and Seigi and even than are both 2-dimensional characters. they just do and react to things as the plot goes along and stay like that till the very end. \\n\r\nthe rest are just one dimensional characters including the antagonist. theirs  Touko the insert Childhood friend , and Tom some weeb subordinate under Izzy. the antagonist  Aryabhatta is a prideful princess who’s also a lesbian and sexually promiscuous, and is trying to obtain power just cuz.\\n\r\n1/10\\n\\n\r\nSoundtrack- everything was just meh. from the voice acting and the soundtrack. opening was ok, but everything else was forgettable\\n\r\n4/10\\n\\n\r\nAnimation- it was average to below average. everything looked so bleak and empty. the characters were mostly average with the exception of Izzy because she's a adult trapped in a kid's body thing going on. the fight scenes were like the one's you would see from ufotable, but way worse.\\n\r\n4/10\\n\\n\r\nEnjoyment- not much there may have been moments, but they're too few to remember. .5/12 episoedes \\n\\n\r\nconclusion- Shit story, shit characters, below average animation, meh soundtrack and voice acting.\\n\r\n2/10\\n\r\nfinal statement- it seems their might actually be a season two of this.......fuck\\n",
            "date": "2016-10-07T13:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 231267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=231267"
        },
        {
            "content": "This anime had so much potential but fell very fall from my liking after the first 5 episodes. It's just so confusing to watch, they don't explain jack in taboo taboo. on almost every episode i had to go back to the previous episode bc i was confused on what was going on , but even after going back i couldn't figure what was going on. It moves to fast, and doesn't elaborate very well. If they went back and re did it like full-metal alchemist i would be happier with the result. I still don't know what is going on",
            "date": "2016-09-23T11:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 229907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/b14ker",
                "username": "b14ker"
            },
            "url": "https://myanimelist.net/reviews.php?id=229907"
        },
        {
            "content": "Pretty average anime to be honest. It started of interesting, with main character being just a normal guy who is minding his own business until he gets a tattoo which gives him a unique ability called void maker.\r\nNear the end of the anime it is kinda boring, what makes it worse is when you reach the final episode you see the main villain is defeated then on last few minutes she is shown as alive... It brings the thought into your mind, \"what the fuck was all that for then?\"\r\nOverall just \"meh\" type of anime, not bad but not good either.",
            "date": "2016-09-22T18:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 229850,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702014.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EstelarVitalize",
                "username": "EstelarVitalize"
            },
            "url": "https://myanimelist.net/reviews.php?id=229850"
        },
        {
            "content": "Have you ever seen an anime where you saw such great things coming from it's premise but left coming out of the anime like it nearly utterly betrayed you by the end of it?...well LA just didn't say that statement for no reason -sigh-, let's get this over with.\r\nOn the outset Taboo Tattoo reminded LA of the To aru Majustu no Index premise, with humans with superpowers (Espers and Tattoo users) of some kind and are at war with each other (Indexes multiple faction battles etc. and Aryabhata Region vs. USA) and LA really liked it because of it and really wanting to know moreabout the Tattoo's and how they function really intrigued LA.\\n\\n\r\nThe last bastion of good Taboo Tattoo had was it's animation done by JC Staff and really from the good looking character designs to the awesome battles were done to polish and shine throughout the anime and LA really didn't see much of animation errors. The animation and it's early episodes (like to Episode 4 or 5 or so) is some of the only good things about Taboo Tattoo.....the problems with Taboo Tattoo...well *ahem* this is gonna be sit...\\n\\n\r\nLet's start with the characters, the characters in the early episodes were cliches to say the least, from the main protagonist Seigi \"Justice\" Akatsuka voiced by Makoto Furukawa, who is the headstrong, naive and reckless hero, Bluesy Fluesy (no really, it's her name) voiced by Mikako Komatsu the maniac pixie girl who introduces Seigi to the world of Tattoo's along with her bubbling otaku assistant Tom Shredfield voiced by Tomokazu Sugita and Seigi's love interest Touko Ichinose voiced by Chika Anzai, but what utterly cripples the character section in Taboo Tattoo is their utter mismanagement to the characters and LA can easily say that Taboo Tattoo's plot is also mismanaged due to this. For the most part  Taboo Tattoo really tries to give backstories and development and majorly fails in that district, why?, well as much as they try to give character development and backstory to the characters that matter, the majority of the characters motivations are either too confusing or too generic, the main villain of this anime Aryabhata voiced by Akari Kito's motivation is essentially world domination because of her abusive father's corruption, but her \"world domination\" scheme just doesn't make sense or even needed in that sense, as for our heroes they are even worse as  Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world. By the halfway point they start really getting into this and really it forcibly makes our naive headstrong Seigi into \"hero material\" over a cheap death. On the villain side, the deaths were more or less one note with their \"tattoo power\" = personality, but ultimately it leads to LA saying...\"is that it?...\", the only exception to the minor villain mook list is Iltutmish voiced by Shiori Izawa (for a little while) and Kar Shekar voiced by Hitome Nabatame with her backstory to Brad \"BB\" Blackstone voiced by Toshiyuki Morikawa. On speaking of which, the most mixed character development given to was BB as he becomes Seigi's mentor to be hero material, well why?, LA won't spoil but add these hints together and you'll get it; \"utter mismanagement to the characters\", \"Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world\" and \"MENTOR\", as for Touko (yeah forgot about her), she gets one of the WORST plot twists and \"development\" in the series case in point  \"Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world\". The characters good or evil have terrible mismanaged characters and developments to them and most of the minor characters are nothing but \"heavy mooks\" to \"red shirts\" and by the end of this anime the closest character LA ever came to like was Bluesy Fluesy by default.\\n\\n\r\nOk, characters are mismanaged to all hell, the plot isn't much better...\\n\\n\r\nThe plot is infected with tonal dissonance to generic shounen fair to one of the worst points to the anime....it's rushed to no end. The tonal dissonance didn't start round the latter half of the anime, just bringing up comedic and rather sexual moments completely out of nowhere to make the \"comedic moments\" something of \"development\" to the fair few minor characters, Aryabhata also gets this as we were meant to taken her a HUGE threat but gives us misplaced fanservice just to be \"edgy\" what with her molesting Iltutmish to Aryabhata being the shameless fanservice girl of the series in a different kind of way and it doesn't help make her threatening or a force to be taken lightly, sure her battles ALLOW her to be actually threatening but the awkward fanservice with Aryabhata becomes as tonal dissonance and she's the biggest cause of this. The generic shounen fair mostly comes from the entire good vs. evil with the good being USA and their Tattoo users vs. Aryabhata Tattoo users, it also adds in Aryabhata  again as her entire \"world domination\" schtick is prevalent to this flaw as well, ohh the heroes also gets this too ESPECIALLY Seigi. Finally Taboo Tattoo's rushed pacing is the nail that ruined the series for LA and how so, what with rushed character development throughout the board, from Seigi's rushed personality from naive hero to \"actual hero\", BB's rushed backstory and how he adds into the plot in which his investment becomes nil by the end of it, Aryabhata's rushed backstory although her backstory is detailed for the most part, it's just that her generic and rather confusing \"evil just to be evil\" through world domination scheme is mixed for LA but in execution it failed anyways for LA to get invested in it. \\n\\n\r\nTaboo Tattoo's voice cast was partially ok, though LA thought Akari Kito who voiced Aryabhata was having some semblance of fun in voicing a villain, Seigi's voice actor Makoto Furukawa was ok, with the shouting in battles to his \"speeches\" he has was ok. LA thought that by the final episodes that it even felt that most of the main voice cast just didn't care anymore and just wanted to get it over and done with, most prevalent being Mikako Komatsu and Toshiyuki Morikawa and Tomokazu Sugita. LA's favorite voice actor would go to Mikako Komatsu by default though.\\n\\n\r\nThe ending, for all the backstory on both sides (Aryabhata and Seigi to be precise) really didn't help things and all the beliefs and decisions that lead it down to this final battle devolved into nothing but \"good vs. evil\" scthick with good beliefs with a literal \"justice\" beast and evil beliefs of Aryabhata beast making it a rather boring sit to watch, sure the battle was awesome, but with the devolvement of the battle it lead it down to...it was boring and a rather big copout by the end of it all. The final scenes hints at a second season and really if it was greenlit for a second season, LA is really gonna say this to the first season of Taboo Tattoo, if it got a second season, then the first season SHOULD have been managed better than this and spread the plot in a more detail way, instead it's this cluttered mismanaged mess of an anime, a second season would either dampen and reinforce what LA thought of this series or have a small bright spot for it being better, but considering what LA said about Taboo Tattoo as of now, LA wouldn't like it and would mostly be afflicted with sequelitis.\\n\\n\r\nTaboo Tattoo if there were two words LA could say about is that it's such \"wasted potential\", where it had a good premise albeit generic shounen but was shot down and ruined by the end of it with mismanaged characters and their developments, battles LA didn't care about and motivations on Seigi and Aryabhata were either too forcible to confusing why they were doing this \"just because justice or world domination\" and really not even JC Staff's polished and shiny character designs and battles couldn't help LA be distracted by the blatant character and plot flaws and dumb highly polished battles and LA being a JC Staff fanboy just wasn't enough to pull through into being good. Taboo Tattoo, LA WANTED to like you but like LA said at the start of this anime review, you betrayed LA's expectations and slowly but surely became LA's worst anime of Summer 2016...\\n\\n",
            "date": "2016-09-19T18:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 229550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=229550"
        },
        {
            "content": "Like I said in my previews reviews, I only become aware of anime because of the voice actors that participate in them. Because of the impressive English cast, I decided to watch the English dub. First, I read some of the reviews to give myself an idea of what I was about to watch. Listening to other people's opinions is good, but you shouldn't let them dictate what you feel about a TV show. So, here is what I think...\r\nSpoiler alert!\r\nStory: America is participating in an arms race with the Serinistan Kingdom, involving mysterious weapons called tattoos. The protagonist is a Japanese boy called JusticeAkatsuki (I kid you not, that's really his name), aka Seigi, who finds himself bonded to a tattoo, which just so happens to be one of the most powerful out there. An American soldier, Bluesy Fluesy (that's really her name) is forced to protect him against Queen Aryabhata, who thinks Seigi is the only one who can stop her plans for world domination. That is one of the most generic premises you might have read. Even so, it can be good as long as the show has a clear direction and strong writing. Unfortunately, the show doesn't have any of those. What a tattoo is and what can it do is never clearly explained. Instead of having clearly defined powers, the tattoos are just convenient excuses for the characters to do weird stuff, such as moving at superspeed, opening black holes or throwing spikes out of their bodies. You want a cool superpower? Then make sure to get the right tattoo! Also, there is no real depth to the story. Most of the storylines are just excuses for fight scenes and the ones that do try come off as lacking, such as BB and Arya's backstories. The comedy/seriousness balance is all over the place. Some of the serious moments, or at least the moments that should, in theory, be taken seriously fail to register because of some inappropiate scene or one-liner. Constant mood swings like these break the show's narrative structure. Finally, there is no real sense of world building and we have no clue as to how the world is affected by the tattoo fights. Apparently, only the protagonists and their actions matter, even when we are told that their actions will have international consequences. The story has no ambition or depth and is hardly enjoyable (3/10).\\n\\n\r\nCharacter: Another complaint against the show is its poor character writing. Seigi is one of the most generic protagonists I've ever watched. There is no real depth to his personality and most of the time, he fails to be an agent of volition. Things happen to Seigi, not because of Seigi. Also, his partner Izzy is not all that special either. I fail to sympathize with either of them because for the most part, they don't evolve as characters. In my opinion, the best character of the show is BB, who should have been the real hero of the story. His focal episodes are the only times the show was genuinely enjoyable. The villainess Arya is only a halfway decent character. She could have been a great villain, if it weren't for the fact that she, like most of the other characters, falls victim to the show's awful comedic timing. Touko, Seigi's childhood friend, exists solely for two reasons: fanservice and dying to give the hero some poorly done moments of vulnerability. No point getting sad about that. All the characters are one-note and forgettable so I won't bother mentioning them. (3/10)\\n\\n\r\nArt: The show at least deserves praise for decent character designs, but the animation itself is mediocre. The fight choreography is inconsistent, the fanservice moments are annoying and distracting and there are images of some weird giant monsters that supposedly represent the tattoo's real power. There are some cool shots every now and then but that's the nicest thing I can say about the art quality. (5/10)\\n\\n\r\nSound: You gotta feel sorry for the voice actors, who give it their all despite the utter garbage they are given to work with. When a character is bad, I normally try to not hold it against the actor voicing them. They are just people doing their jobs and collecting paychecks, after all. The sound effects are also great, making the uneven fight scenes almost enjoyable. (8/10)\\n\\n\r\nOverall: Aside from its terrible character writing and poorly explained superpowers, the show suffers from a serious identity crisis: it doesn't know if it wants to be a satire or be taken seriously. If it wants to be a satire, it misses that mark badly; and if it wants to be taken seriously, then it fails as well because of its poor development. I was only able to enjoy the show by laughing at its massive stupidity, and I don't that was point. Ultimately this is a show that, while not having a lot of potential, at least could have been a pleasant watch; but instead became a massive bore and I struggled to get through to the end. It wasn't worth my time and it's not worth yours. (3/10)",
            "date": "2018-05-05T11:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 279841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HeroVladimir93",
                "username": "HeroVladimir93"
            },
            "url": "https://myanimelist.net/reviews.php?id=279841"
        },
        {
            "content": "If i was 12 and not very bright, i'd probably think this show is super awesome.  It's another one of these series that spends every moment of its existence trying to be cool, without caring if anything makes sense or if any character is acting rationally.  Silly mechanics are constantly introduced at the drop of a hat and never really explained.  Just another Guilty Crown style train wreck of a plot that surely only appeals to children.  It also tries to do comic relief, but manages to fail spectacularly because it's just too fast.  You'll go from dead serious toa 1 second joke and then back to dead serious.  Very clumsy.\\n\\n\r\nThe characters are generic and generally unlikable.  Bluesy's design is pretty good but that's about the only strong point.  The music sucks too.  \\n\\n\r\nWe have to mention the \"artistic style\" of this shit.  For some reason there is an absurd amount of color bleed applied 24/7 which makes it look like the characters are being hammered by a 1000 watt spotlight.  In nighttime scenes, you will have white shirt that look like LED bulbs.  If it's supposed to be artistic, it is horrendously executed and violent to the eyes. \\n\\n\r\nFor the positive points, there was one nicely choreographed and animated fight scene in EP1 with interesting camera angles.  That's about it.\\n\\n\r\nI tried watching it ironically and enjoyed it a bit, but it wasn't enough to finish the series.  Reserved for elementary schoolers!",
            "date": "2017-03-15T16:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 242664,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/summitsama",
                "username": "summitsama"
            },
            "url": "https://myanimelist.net/reviews.php?id=242664"
        },
        {
            "content": "I wasted 12 episodes worth of my life based on the best fight scene I've ever seen (to date) in the first episode. It has boring plot that is executed in the worst possible way without any beneficial character development.\r\nThe visuals, initial character intro and seemingly interesting plotline might pull you in but don't be fooled. It's one of those anime that you watch going down the drain as it continues, hoping that it delivers on its initial promise only to end up extremely disappointed.\r\nIt is not necessarily a bad anime, more like extremely boring. At some point, you realise that anything going on ispretty much inconsequential and the outcome is very clear. It starts off spectacularly only to spiral downward after the first few episodes. By the end, I literally asked myself WTF did I just watch. It left me without any feeling of enjoyment or even relief that it had come to an end. \\n\\n\r\nIt's basically a poorly done clone of \"Charlotte\"which I loved and recommend.\\n\\n\r\nArt style, camera work and sound are all good though. I highly recommend you watch the first couple of episodes though, especially the fight scene in episode 1.\\n\\n",
            "date": "2017-10-28T16:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 261949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6638317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/robkamofficial",
                "username": "robkamofficial"
            },
            "url": "https://myanimelist.net/reviews.php?id=261949"
        },
        {
            "content": "Overall this show wasn't bad. The characters were unique and fun to follow. That was what I thought until the last few episodes. The pacing became horrible and the time skip ruined a lot of character development. The pacing felt really rushed, like they only planned half of the show all the way through. The show was trying to be too many things at once. There was romance, humor, action, revenge, and all this other stuff. But none of it was really fleshed out throughout the story. The characters had a lot of potential (Izzy), but was ruined by bad writing. I was hoping formore when I started this series. When I finished was was left in a pool of disappointment.",
            "date": "2016-09-24T10:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 230031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5661490.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/jamieofgallifrey",
                "username": "jamieofgallifrey"
            },
            "url": "https://myanimelist.net/reviews.php?id=230031"
        },
        {
            "content": "Taboo Tattoo\r\nArt/Characters: The art style is really solid. There is a little bit of similarity between some of the characters, but they were so minute and so easily distinguishable that if I had just seen the previous character, I would be able to distinguish between the two of them. However I felt that if I had fallen behind that I would struggle to figure out the placement of some characters. The light and the colors that are a theme throughout the show are really nice to look at and even though things get crazy and the lines get blurred. The characters themselves are really interestingwhen it comes to their backstories. The main, Seigi, is your average student and has a lot of the same stereotypes that come along with that. However, the inclusion of his martial art training gives him more depth than you average student. Touko is Seigi’s best friend, whom he cares deeply about, and her ability to tackle things head on even in times of fear is really admirable.\\n\\n\r\nMusic/Sound: The music of Taboo Tattoo is subpar really. While there is a lot of great action-pushing music, the majority of it is pretty generic and easily predictable. It does a good job of giving the mood some energy, but other than that it is pretty bland. The opener song is something to write home about because I really enjoyed watching and listening to the animation each week. It was something that I could look forward too, and while that might be something that is a little distracting on the whole picture of the show, it was still great. When it came to the sound of the show, there could have and should have been a lot more. The use of the tattoos should have had some actual sound, rather than just a generic sound that could be expected. But what would have made it better is a powerfully empty sound that would be able to accompany the Void Maker, because that is exactly what it does; makes things powerfully empty.\\n\\n\r\nStory: Seigi is a middle school student that happens to be trained in martial arts, and has a passion for protecting the people that are deemed as weak. He comes across a homeless man getting mugged one day and after saving him, the old man puts a tattoo on his palm. The tattoo seems like nothing, but it turns out to be a secret weapon in an arms race between America and the Serinistan Kingdom. He tries to use his martial arts to defeat someone attacking him to take the tattoo back, and when things look bleakest he needs to figure out to trigger his new weapon. The story continues to follow Seigi and his friend Touko with the help of Izzy and Tom, to defeat the enemies that they come across.\\n\\n\r\nPersonal Reflection: While there is not a true ending to this show, it provides enough closer to really put the rest of the show into perspective. I really didn’t know if I wanted to watch this at first, but after seeing the art a bit more, I really liked the fluidity and the colors to a point where I would be watching the show just to look at something pretty and cute in front of me. However, the story really drew me in after just an episode or two. I found myself really relating with Seigi on his morals of protection and I really wanted to see him succeed. Even though there was no true ending, there was a lot of set up to at the very end of the final episode that would suggest a second season. The question remains; is that worth watching based on the first season? For me, I say no. I really had to test the waters on this one and it turned out alright. While the story is good in some aspects, the sound drops the quality. I do have to say this has some of the best art of any show of this current “Summer 2016” season, and that is something that I will not forget. A second season might be a fun concept because of all of the set up, but it feels a little too much of the same, and not enough variety which would have made this show 10x better. Taboo Tattoo is not the best series I’ve ever seen, but if you are into action packed/super power type shows, then give this a go!\\n\\n\r\nOverall Score: 7.2/10\\n",
            "date": "2016-09-20T21:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 229688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=229688"
        }
    ],
    [
        {
            "content": "Genericism is a very interesting thing. Shows we label “generic” are almost always inferior, so it is only natural to wonder why every season, without fail, there is an overabundance of them. One of the most common symptoms of genericism is that you can easily predict more things than should be predicted simply by taking a glance at the synopsis or poster. You might take one look at Taboo Tattoo’s poster and promptly dismiss it as generic, but I’m here to tell you that it is not. It may seem like it, it may start of like it, but no, I assure you, it isn’t;nay, it is much, much worse than anything you’ve ever dismissed before as “generic”. If you would be oh so kind to indulge me, let me explain to you to the glorious calamity that is Taboo Tattoo.\\n\\n\r\nTaboo Tattoo is the asinine abomination of a show produced when a poorly written, generic sub-par show tries to make fun of itself; it’s like if Sword Art Online tried to be Konosuba. It tries to be self-aware and become a parody of other shounen action anime but relies way too heavily on the tropes and clichés it is trying to subvert—it just feels like it doesn’t know what it wants to be. Now once you top it off with over excessive incessant fan service and wish fulfillment and drastic changes of tone and atmosphere multiple times in an episode, you get the worst show this season. The worst part is, unfortunately, that this show is not bad enough to be considered good. \\n\\n\r\nThe show’s beginning is as generic as it can get, seemingly nothing different from anything else you’ve seen before. It’s got your starter pack of shounen action anime tropes\\n\\n\r\nBegins with unexplained fight scene ✓\\n\r\nBeta-male randomly given mysterious power ✓\\n\r\nSaid power is the strongest one ✓\\n\r\nMC is the “perfect match, almost like a god-sent” for that said power ✓\\n\r\nChildhood friend (with obvious crush on MC) MC must protect ✓\\n\r\nEvil organization after MC’s power ✓\\n\r\nKiller lolis ✓\\n\r\nFan-service (massive bouncing boobs, panty shots, low angle shots) ✓\\n\r\nYuri action ✓\\n\r\nTentacle groping ✓\\n\\n\r\nBut from this bland and overdone setup the show manages to transcend itself above the descriptor of “generic” and enter a new realm of inferiority that is rarely ever reached in the medium. There are an innumerous amount of things that make this show difficult to consider “good” let alone “mediocre”, I’m not even sure where to begin.\\n\\n\r\nThe plot progression is unreasonable with oddly placed fight scenes and illogical character motivations. The events that happen are so bland and simple that it’s paradoxically difficult to suspend my belief. The main character, Seigi, really just gets his Taboo Tattoo power after saving Dr. Wiseman (yes, that’s really his name) from getting beaten up by a couple of thugs. How and why was he getting beaten up? Good question, never answered. Why does Seigi defend this man and potentially risk his life? Good question, thinly answered. \\n\\n\r\nThe show then proceeds to nonchalantly introduce a country that doesn’t exist in real life, and not once does it ever expand on it in a more meticulous fashion, because who really cares about world building? The Tattoo power is explained using convoluted logic that boils down to “it’s magic” that is so unimaginative in nature that the show would actually have been better off leaving it unexplained. New abilities of that Tattoo power are suddenly introduced with little explanation and things just escalate into ludicrousy of epic proportions. \\n\\n\r\nThe wish fulfillment aspect of this show cannot be emphasized enough; everything that happens is some sort of wish fulfillment or the other. Without spoiling anything, there is literally a scene where Touko, or how I like to call her, BigBoobs-chan, goes to meet Seigi, or MC-kun. MC-kun is passed out in his Grandfather’s dojo and BigBoobs-chan sits next to and watches over him. Suddenly, out of nowhere, a pale red blush overtakes BigBoobs-chan’s face as she promptly muses to herself “it is a woman’s shame to ignore a man offering himself!” and proceeds to lean over MC-kun, confining him between both her legs and arms. What BigBoobs-chan (who is a middle schooler, mind you) was trying to accomplish, I can’t for the life of me figure it out. Anyway, naturally, MC-kun wakes up at this time and says “BigBoobs-chan?” another blush, this time maroon red, invades BigBoobs-chan’s face and she, in embarrassment, stops leaning over MC-kun and sits down. But where does she sit down? Of course, it has to be on MC-kun’s groin! Because who really cares anymore? This is just one of the scenes I have mentioned, there are even more titillating and salacious scenes throughout the show as well (token tentacle groping scene included), so if you’re into this kinda thing I’ll just tell you to go for it. \\n\\n\r\nThis unrestrained wish fulfillment naturally leads to an overabundance of fan-service. Now, of course, as present in almost every single anime, there is fan-service. The only reason I am discussing it is because of how abundant it is. Literally, there will be at least a couple dozen fan-service scenes per episode. Yeah, you read that right, per episode. The worst part? It is never limited to solely basic fanservice stuff like panty/butt/cleavage shots of likes, no, it is more like straight up girl on girl action. Of course, there is a difference between “fanservice” and expressing a character’s “sexuality” but nobody behaves like our Yuri-loving princess antagonist, Aryabhata. She will straight up grope her loli companions out of nowhere, randomly getting prepared to sleep with them numerous times throughout the show. Again, if you’re into this kinda thing, I’ll just tell you to go for it.\\n\\n\r\nIt is nearly impossible to review the characters because they barely qualify to be called so.\\n\\n\r\nSeigi is just a distressingly bland “I want to be a hero of justice” archetype with zero personality outside that; in short, he is a self-insert. The only development he receives is contrived and at the cost of reducing other characters to plot devices.\\n\\n\r\nTouko is the “I want to be with my childhood friend no matter what!” archetype, and outside of her big boobs, she is nothing but the waifu for the self-insert. \\n\\n\r\nBluesy Fluesy—I kid you not, that is really her name—is just a trained and skilled soldier trapped in a middle schooler’s body, because this show wouldn’t be complete without an underage female who’s prepubescent panties we will never see enough of. \\n\\n\r\nBlood Blackstone (or BB), the only decently written character in the show (not saying much). Compared to the rest of the cast he’s more complex than a labyrinth and more deep than than BigBoobs-chan’s cleavage. His character backstory is engrossing enough to keep you invested as well (one of the better episodes of the show). \\n\\n\r\nOne of the antagonists, Aryabhatta, is a prideful princess who’s also a lesbian and sexually promiscuous, as she readily and regularly gropes her loli companions in good fun. \\n\\n\r\nI suppose I should also mention how this show degrades their female characters, not that many viewers really care, but I feel obligated to mention it.\\n\\n\r\nHm? What’s that? “What about the other characters?” Nah, these are the only “characters” that are involved in this show. One thing I can compliment the show for is that it isn’t afraid to do stuff other action shounens wouldn’t normally do, like killing of major characters and severely injuring others. Even this is done in a forced way (killing characters in stupid ways) but I have to give credit where credit is due; the removal of certain characters certainly made things a little bit more interesting.\\n\\n\r\nThis show is also very ostentatious. Taboo Tattoo tries to explore ideas concerning “justice” and how it is perceived differently depending on position of the person; this leads to the show suddenly humanizing comically evil villains in a very heavy handed approach. The show is never subtle with its themes, moments are contrived in an obtuse manner just to culminate in a preach given by a character on the “delicacy of justice” and how “I won’t stop others from their own justice”. And again, as I mentioned, the show also tries to be satirical and often pokes fun at regular storytelling tropes—so how can it try and have resonant themes about justice? The two just don’t click together. \\n\\n\r\nLiteral forced drama, never seen emotional catharsis from characters in a show more contrived than this. Characters that are seemingly unrelated suddenly reveal to be in strong platonic or romantic relationships with one another and expel more cringe inducing lines of dialogue like “you never change” out of nowhere. The jarring tonal shifts in the show are consistently present in here as well, as one moment will be some serious (yet boring) exposition scene and suddenly the music accompaniment changes to slow, sad piano music as one of the characters suddenly talks about how much he/she missed the character. \\n\\n\r\nDrama and problems that arise in the beginning episodes (and are resolved) suddenly come out of nowhere during conversations because the writer doesn’t know how to form real dialogue between characters. “Is it okay if we stay together?” is said multiple times throughout the show, for no reason other than to contrive some unnecessary and predictable drama between characters that achieves nothing. There are no character dynamics whatsoever, every conversation bounces between either exposition or some unfunny joke.\\n\\n\r\nThe animation is unremarkable, the character designs are generic and bland, the colour palette is unnecessarily monotonous, the fight choreography is annoyingly inconsistent, yadda yadda yadda. It has its moments with insane CG cinematography where the camera pans around in all sorts of degrees, but those are few and far between. \\n\\n\r\nEnjoyment: 4/10\\n\\n\r\nIf you liked the abundance of action scenes, the Tattoo as a superpower, and the whole concept of good vs evil organizations clashing, then I’d point you to Bungou Stray Dogs. It’s far from exceptional by all means but does everything Taboo Tattoo tries to do a bit better, which unfortunately isn’t saying much but overall Bungou Stray Dogs is the better version. If you enjoyed the moments when the show pathetically tried to be satirical, then I’d point you to One Punch Man (but let’s be honest, who hasn’t seen this already).\\n\\n\r\nOverall: 2/10\\n\\n\r\nTaboo Tattoo is very impressive in its own right. It is honestly difficult to write a show that can pierce this untapped sphere of atrocity, not even inexperienced and first time authors can write shows this bad. It feels like the writer of Taboo Tattoo was intentionally trying to create a story that was B-level, schlock entertainment, but like I said in the beginning of the review, this show is just not that bad enough to be considered good. Maybe if it didn’t take itself so seriously, or it was more consistent with its self-awareness and poking fun at action anime tropes, then it would have been a great satirical parody of the shounen genre; but no, unfortunately Taboo Tattoo is just the perfectly well-rounded package of trash.\\n\\n\r\nI hope this review was informative and helpful.",
            "date": "2016-09-20T14:31:00+00:00",
            "helpful_count": 148,
            "mal_id": 229646,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352541.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Adi",
                "username": "Adi"
            },
            "url": "https://myanimelist.net/reviews.php?id=229646"
        },
        {
            "content": "Taboo tattoo is a kind of show that I have high expectation once,it went well in the beginning.However,things started to go in a wrong direction and finally become a train wreck.\r\nStory(3/10)(35%)\r\nThe beginning of Taboo Tattoo is very easy to follow,it started with a rich introduction about the story and also the characters,which is a solid start.\r\nThe actions are also impressive too,characters using different skills to fight against enemies.I have no complaint about the actions.Its exciting and fun to watch.\r\nHowever,things started to turn worse in the later episode.The pace of the story is kinda fast and rough.It feels like the story is rich and full ofelements but at the same time,there's too much to talk about.Therefore,the anime decide to use fast pace and weird transitions in order to do so.However,this may affect the story process and you may miss some of the important information.\\n\\n\r\nAlso,because the later episode is mainly fights.Fanservice and comedy elements are misplaced,therefore,the story is lacking of depths and the overall feeling is weird.They had to get away from that and replace them with much more useful content instead of fanservice and comedy.\\n\\n\r\nThe worst part of taboo tattoo is the plot is starting to off its original rails,which is totally unacceptable.In later episodes,after characters died,they put back stories about them,main characters are being abandoned afterwards,which the plot seems to be going to nowhere.It seems like Taboo Tattoo just give up in halfway.such a shame.\\n\\n\r\nAs expected,the ending ends up in a rush...\\n\\n\r\nAnimation art (8/10) (10%)\\n\\n\r\nThis anime pays a lot of efforts on battles,you can see that characters use different items (e.g:smoking bombs) during battles with diversified skills and techniques.\\n\\n\r\nCharacters also have different decisions because of their personalities and weaknesses during the battle.Therefore,the whole screen of the animation is rich and realistic.\\n\\n\r\nIf the quality of the graphics is better,such as:using more colourful visuals,it would be more splendid.\\n\\n\r\nSound (7/10) (10%) (including music)\\n\\n\r\nThis anime also pay a lot of efforts on sound effects during the battle,which contains characters conversions with a lot of details (hitting the wall,injures)\\n\\n\r\nThe op seems to fit the theme of the story too.Its filled up rocky-style music.However,if they able to add some more background soundtracks and sound effects inside,it'll be better.\\n\\n\r\nCharacters (2/10) (25%)\\n\\n\r\nAs I have mentioned,the story has a rich story introduction and the story is well bonded with the characters.\\n\\n\r\nUnfortunately,this is the only best thing for characters development.\\n\\n\r\nCharacters is lacking of depths because the whole anime is mainly fighting in the later episode,I hardly feel any kind of emotions when characters are having struggles or tragic events.Maybe because of lacking of back stories,which shows this anime fails to deliver any emotional moments to the audience and affects the overall enjoyment and the characters development.Touko,for example,is just a bunch of fanservice and a mental support girl to Seigi but none of her backstories are told.\\n\\n\r\nOther problem is the character design,the naming of characters is weird.the MC is called Justice or Seigi (Seigi means Justice in Japanese) and the other one is Bluesy Izzy,maybe they want to let us easy to remember the characters name.However,it's still unacceptable because they are too simple.\\n\\n\r\nEnjoyment(3/10)(20%)\\n\\n\r\nIf you are an action anime fan,this anime Taboo Tattoo should suitable for you because it has a lots of actions.\\n\\n\r\nOtherwise,I wouldn't recommend Taboo Tattoo because plot is going insane afterwards and it's disappointing.\\n\\n\r\nI'm feeling bad for the solid start....Taboo Tattoo really once give me a great impression to me,but sadly it turns it to a train wreck at the end.Its painful to rate this anime with low score honestly...\\n\\n\r\nOverall (3.65/10)(F)(Dreadful)\\n",
            "date": "2016-09-24T05:25:00+00:00",
            "helpful_count": 57,
            "mal_id": 229991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569911.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swordarc",
                "username": "Swordarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=229991"
        },
        {
            "content": "Lelouch's dad once said, \"Notto disu shitto agen.\" Well, that's exactly what i was thinking while watching Taboo Tattoo.\r\nJustice! Heroism! Friendship! And middle schoolers!? In a battle to save the world, our middle school justice-loving protagonist conveniently receives the most powerful tattoo. This Tattoo has the power to create black holes and, of course, Seigi uses it for justice and protecting his loved ones... But what actually happens in this story when you put a naive middle schooler and his powerless childhood friend in the middle of a war to save the world...? Well, my friend, people die.\r\nAh yes, Taboo Tatoo: an anime where themain protagonists are cliché, enemies are crazy in addition to being cliché, and cliché female characters bombard you with a huge amount of fanservice. Take those elements, add in a dash of \"mediocre plot\", a pint \"stupid protagonists\", sprinkle on the \"plot conveniences, and then put it in the oven for 12 episodes. VOILA! Oven baked and ready for viewers.\\n\\n\r\nStory: 6/10\\n\r\nWalking down a street at night you see an old man being harassed. Normally you have several options and would probably choose to either call the police or keep walking, but not if you're our 15 year old cliché martial artist justice-loving protagonist. That's right, you've gotta \"save the old guy\". Unfortunately, this is where our protagonist goes wrong. That old fart then forces a super rare \"Tatoo\" upon him that grants him the power to make black holes, and we all know that Tattoos can't be removed easily. \\n\\n\r\nNow it's time to talk about Bluesy Fluesy... Firstly, who the hell named her that? I'm thinking that some douchebag was probably just shitting down on the toilet thinking \"Meh, she's American... Whatever, ima just call her fcking Bluesy Fluesy.\" Anyways, the main character gets his ass kicked by her and becomes wrapped up in a secret world-wide battle to collect the Tattoos from those who misuse them. (Pretty Mediocre of a Premise) The battles often cause people to lose limbs, so I guess you could say it's relatively graphic.\\n\\n\r\nThe comedy made me laugh occasionally throughout the anime, that's definitely a plus.\\n\\n\r\nThe pacing was... okay... we get a rather slow start that gives you a shounen feeling, but then... SHIT SUDDENLY HITS THE FAN and there's a time leap. From a busty super-sexual royalty girl villain to a loli schrodinger's-cat-like character, this show has it (fanservice) all. Overall, I felt the story itself wasn't really that interesting there's only a few ways these type of stories can go. Train, power up, overcome, maybe fail once or twice, win or lose in the end. There's nothing special here, but the battles were good and there were interesting character relationships. \\n\\n\r\nOverall, I think it's a good enough story that killed my boredom. 7/10\\n\\n\r\nCharacters: 4/10\\n\r\nBesides the main character, and massive amounts of cliché archetypes, the characters were actually pretty good... I absolutely loved when the enemy characters got screen time (Arya and BB were the best chars in this series), but you most likely won't be getting any new favorite characters from this anime unless you're a new watcher. Arya, the main villain girl, was the most interesting character in the show with a decent amount of depth behind her character, with reasons that were actually pretty logical. Really didn't enjoy \"naive-middle-school-hero\" Justice or \"this-useless-dumbfuck-wants-to-be-by-him-even-during-life-threatening-danger\" childhood friend. Cliché protagonists. Everywhere. 4/10. But--- The villains were an interesting 7/10, so it averages as a 6/10 in my books.\\n\\n\r\nArt: 8/10 \\n\r\nThe art was actually pretty good. I genuinely enjoyed watching the fight scenes because of the art.\\n\\n\r\nFanservice. There's a lot of fanservice. Arya even randomly gropes boobs and engages in lesbian sex. There are also a ton of low-angle shots where you can get a nice view of some Bluesy ass. \\n\\n\r\nAlthough there's no nudity. Some people argue that it takes away from the anime, others are straight males (jk) but i don't think it really interfered that much. Well-drawn scenes, okay animation, and great special effects so it's good enough to give an 8\\n\\n\r\nSound: 6/10\\n\r\nAs a musician, I'm always listening to an anime's background music. Honestly, I only slightly remember the piano piece and liked the main theme, the rest weren't unique or noticeable. The fighting sounds and music definitely enhanced the exciting moods that they were trying to convey. The sound was okay...\\n\\n\r\nEnjoyment: 7/10\\n\r\nAlthough I disliked most of the protagonists, thought the entire series was cliche, and not much happened that I didn't expect, I actually did enjoy watching this series. As an action and supernatural anime fan, my expectations were met while watching it. Fanservice was a plus for me, but it may be a minus for you. It helped kill some time for me :).\\n\\n\r\nOverall: I give it a 6 overall. It's a decent recent anime that's good enough to kill some time, but has annoying characters everywhere and takes itself way too seriously. Some of the characters were so stupid that it felt like their deaths felt kind of comedic in nature.\\n\\n\r\nBut in all seriousness, I wouldn't want to watch disu shitto agen... \\n\\n\r\nI'd probably watch a season two if it came out though~\\n\\n\r\n(if you agree or enjoyed reading, let me know by clicking helpful or commenting on my page~ thanks~)",
            "date": "2016-09-19T22:16:00+00:00",
            "helpful_count": 33,
            "mal_id": 229566,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1244257.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/3xTripple",
                "username": "3xTripple"
            },
            "url": "https://myanimelist.net/reviews.php?id=229566"
        },
        {
            "content": "With a riveting cast including:\r\nA teenager named Justice\r\nA childhood friend with big tits\r\nA middle aged lady who still looks 14\r\nAn otaku assigned to care for the middle aged lady who looks like a teen\r\nBig tough guys claiming to be american soldiers\r\nA guy obssessed with snakes and dicks\r\nA girl who thinks shes a samurai\r\nA loli with yuri tendencies\r\nA holier-than-thou silver haired princess\r\nA guy in a black coat with a brooding and gruff attitude\r\nThis show is just as original as they come.\r\nOverall the story suffers from its usual tropes, and its one redeeming episode was so far in and disguised by so much garbage that it doesn'tshine so much as flicker and die like a candle in a collapsing cave. \\n\\n\r\nThe show itself cant decide wether it wants to be a comedy, or a serious show and proceeds to do neither well\\n\\n\r\nA good concept followed by a sputtering failure\\n\\n\\n",
            "date": "2016-09-14T08:35:00+00:00",
            "helpful_count": 24,
            "mal_id": 229028,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/495847.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/VanillaGumi",
                "username": "VanillaGumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=229028"
        },
        {
            "content": "While watching anime, have you ever caught yourself saying \"oh, this cliché again, I've seen that in so many other shows already''. Well, try gathering as many of them as you can think right now, the worst ones, and put them into an anime. Add lots of violence, sexual content and throw bad jokes in the most awkward way possible. There, you've got Taboo Tattoo! \r\nSo, what is Taboo Tattoo about? Its story follows a middle-school boy who, after saving a mysterious stranger, he receives a tattoo, that is actually a powerful weapon, and then he gets involved in a war between two sides. Like,haven't we already seen this plenty of times? Reusing a certain theme isn't necessarily a bad thing. If you handle it correctly, that is. \\n\r\nIn the case of Taboo Tattoo, though, everything has gone wrong. The pacing through the episodes can be rushed and awkward, there are times that you can't even tell what is going on and too many clichés are just thrown into the story, like it is something natural and positive to have no imagination and originality at all.\\n\r\nAnd how does the show want to compensate for its poor writing? With childish, predictable jokes and ridiculous fan-service. The way they are thrown in here is just completely wrong and it's just done that for the viewer to avert his eyes from the badly written story and dialogue.\\n\r\nThe transition between the serious scenes and the scenes with jokes and fan-service is done very abruptly, too, and they ruin the little tension the serious scenes could have caused.\\n\r\nThe only thing that the anime really focused on, is the action and almost the whole show is filled with it but, even those scenes weren't as exciting as more episodes passed. In the beginning of the anime, you would think that there is an actual plot and that all the elements of the story would be properly explained. There are times when it kind of tries to do these things but, the rushed pace and explanations of the anime only achieve to make things more complicated and you just end up watching some fighting with not much meaning behind it.\\n\\n\r\nThe characters are as dull and insignificant as the story and they all lack depth.\\n\r\nYou have your already strong teenage protagonist, Akatsuka Justice, who wants to protect the weak and has a strong sense of justice, as his name says. He is the guy who accidentally receives the most special of all the superpowers, and has a little bit of a dramatic past, that makes him want to become stronger.\\n\r\nThere is also the childhood friend, Ichinose Touko, with the big, bouncy chest that secretly has a crush on the main character.\\n\r\nFinally, the one character that might be a little more interesting, is Bluesy Fluesy, but she also falls a victim to the poor writing. She is the cool and strong female protagonist.\\n\r\nThe development they are supposed to receive is only based on the deaths of characters you couldn't even bring yourself to care about. That can be a way to develop a character but, what is the point of it when you can't relate to his/her feelings?\\n\r\nThe amount of unimportant and forgettable side characters is quite big, too. \\n\\n\r\nThe art and animation are better than the other aspects of the show, with greatly choreographed action scenes, although the animation can become a little dull sometimes. Most of the effort regarding the animation, is put in the action scenes while, the rest of the scenes don't look as good as those ones. \\n\r\nThe angles from which we watch the show are quite interesting but, they can be weird sometimes. The art style and backgrounds are decent and the colors that are used can create a darker atmosphere but, there are times you would wish for a little more colorful visuals. Just like the transition between the serious scenes and the funny ones is done abruptly, the same goes for the art style and the colors, too. The characters are drawn in chibi form and the colors are vivid in the funny scenes. The rest of the art goes to the fan-service and the ridiculously large chests.\\n\\n\r\nThe OP and the ED of the show are a bit generic but, pretty nice. The OP, \"Belief\" by May'n, fits the action theme of the anime and its visuals are filled with action and almost the whole cast. The ED, \"EGOISTIC EMOTION\" by the Voice Actresses of Bluesy Fluesy (Mikako Komatsu) & Touko Ichinose (Chika Anzai), is more relaxing to reduce the tension, and just shows pictures of the female characters. \\n\r\nThe background music is mostly used well, although it mainly consists of some rather bland beats. The sound effects are fair but, they can be too loud sometimes (so many explosions!) and the voice acting sounds fine.\\n\\n\r\nCan you get enjoyment from an anime with such poor writing, overused story and uninteresting characters? If you like action anime a lot and you don't mind what I mentioned before then you should be fine and enjoy the nicely animated action scenes. Personally, I expected at least a little more from this anime and got extremely dissapointed.\\n\\n\r\nTo conclude, Taboo Tattoo is the epitome of cliché, in the worst way possible, with both poorly written story and characters, while desperately trying to appeal to the viewer with bad jokes and unnecessary fan-service. I wouldn't recommend Taboo Tattoo to anyone who wants to, actually, watch a good show.",
            "date": "2016-10-07T07:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 231249,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5083261.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Melody",
                "username": "Melody"
            },
            "url": "https://myanimelist.net/reviews.php?id=231249"
        },
        {
            "content": "(This review may contain spoiler and/or name drops of other forms of media)\r\nBack in Spring of 2016, the disaster that was My Hero Academia plagued the anime industry and almost ensured certain death of the said industry. However, Taboo Tattoo was there to save it and it did so amazingly!\r\nStory - 9/10:\r\nBasically, the story follows Justice \"Seigi\" Akatsuka, the main protagonist of this anime, on adventures to protect people and serve as justice. Sounds like a generic battle shonen anime, right? If you actually watch Taboo Tattoo, it can actually get much darker, such as making perseverance backfire by resulting in the death of thechildhood friend Touko Ichinose (truly one of the saddest death in anime as a whole), changing Seigi's character from generic battle shonen justice lead to being a dark vengeance seeker. Therefore, what I loved about Taboo Tattoo is that it actively insulted the \"persevrance-always-wins\" card and added actually intense fights. Granted a point was cut due to some scenes having excessive fanservice, but overall the comedic moments made me laugh hard (adding salt to My Hero Academia's wound, again!). Overall, action was great, comedy was fantastic overall, and the dark and lighthearted moments mashed together really well.\\n\\n\r\nArt - 10/10:\\n\r\nMassive props to Taboo tattoo for being one of the first anime for implementing single-shot 3D camera rotations during action scenes and making the fights as extremely intense as possible. Add in the fact that there is blood and gore during fights and they are almost realistic-looking (I am no sadist but blood and gore in anime make anime fights much more interesting in my opinion) and you have a masterclass in art and animation depot.\\n\\n\r\nSound - 9/10:\\n\r\nThe OP sounded quite bad, I will have to concede there. However, the ED sounded rather nice. As for the in-anime soundtrack, it was done really well and fit both the dark, horrifying moments and the lighthearted comedic ones, giving me the excitement and laughs respectively. Oh my god, there has never been a soundtrack so well made that I just want to re-listen to this anime's soundtrack in full.\\n\\n\r\nCharacter - 10/10:\\n\r\nWhat Taboo Tattoo does is take generic characters from battle shonens and develop them into their own unique personalities. For example, Seigi changed completely after Touko's death, from generic justice shonen lead to dark revenge badass. Another example is how Bluesy \"Izzy\" Fluesy opened up to Seigi more as they tried to fight for their own lives from predators (as in those that were targeting them). Heck I'll even give Aryabhata, the main villain of this anime, credit for showing a lighthearted side of hers while at the same time, being a power-hungry villain. That I can give a lot of credit for taking a rather generic villain and adding a new polar opposite personality. However, the biggest credit has to be given to none other than Brad \"BB\" Blackstone. Brad is actually one of 10 favorite characters in the entire anime industry, alongside Kiritsugu Emiya of Fate/zero and Tatsuya Shiba of The Irregular At Magic High School. What makes him so special and so amazing as a character is how he is a badass that has been given tons of character development, despite his small screen time throughout the anime, by adding a rather soft side to him as he had feeling for Izzy. Therefore, anything lower than a perfect 10 in the character depot would be an insult to this anime.\\n\\n\r\nEnjoyment - 10/10:\\n\r\nThere is no other way to put my description of my enjoyment than this phrase: \"awesome action, comedy, and feels!\"\\n\\n\r\nOverall - 9.6/10:\\n\r\nDespite some excessive fanservice, this is a must watch for those who enjoy action, comedy, or both. This is also a must watch for those who want to see anime with some degree of feels to it (as in feeling sad for a character's death). And to think this was made by the same studio who made the awful Toradora!, this has to be a huge jump in anime quality. So yeah, I highly recommend this masterpiece! \\n",
            "date": "2017-10-10T18:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 260442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5779468.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tatsuya500",
                "username": "Tatsuya500"
            },
            "url": "https://myanimelist.net/reviews.php?id=260442"
        },
        {
            "content": "TL;DR at the end\r\n~Contains Spoilers~\r\nThe reviews for this show are far to generous. Even this one, is far to generous, and I haven't even wrote it yet. If you enjoy cliche shows, then that's fine. But it doesn't change the FACT that this anime takes itself way to seriously and becomes one of the hardest things to watch in anime history. \r\n________________________________________\r\nSTORY: 1/10\r\nThough I will admit the timeskip episode stirred a slight bit of emotion inside me, a fraction of my fiber that harbors a forbidden love for this type of anime.... the rest of it had me throwing up inside my mouth. There isa lot of character death in the series, which I can't understand why was a remotely good idea, seeing as I cared about two or so of the characters anyway. To make matters worse, for some reason, at least half of the episodes have some sort of sexual scene for LITERALLY NO REASON RELATING TO THE PLOT. IT MAKES NO SENSE. I haven't even gotten into the main plot yet. You know what, I don't have to: It's bad. Really bad. That's all you need to know.\\n\r\n________________________________________\\n\r\nART: 4/10\\n\\n\r\nWhile Taboo Tattoo is left with some very satisfying fight scenes and magnificent shading and tone left by the animators, some of the scenes are just disgusting. I don't know how many times we've had to tell Japan that CGI DOESN'T WORK, and yet they've kept it up all these years... Though a minor problem, as these events are few, it's still extremely aggravating to watch. Though, like I said earlier, the art is good, the dark colors sometimes make it hard to see what's going on, which wouldn't be as much of a problem if the movements of characters weren't so choppy at times. \\n\r\n________________________________________\\n\r\nSOUND: 4/10\\n\\n\r\nThe opening theme, wile cliche'd, is still good. The ending as well. It doesn't matter though, I was too busy crying manly tears for all the poor headphone users out there who forgot to minimize their volume before the episode. I don't know who thought it would be a good idea to use ear rape as an explosion sound effect, but if the motive was to drown out the OST and voice acting completely, then, well, it worked\\n\r\n________________________________________\\n\r\nCHARACTER: 1/10\\n\\n\r\nThe only characters I remotely liked were the comedy relief characters. The rest were abominations of cliches and I'm glad most of them end up perishing in the end. That's all I can say without completely blowing up in a rage fit about how atrocious these characters are.\\n\r\n________________________________________\\n\r\nTL;DR: 3/10\\n\\n\r\n+Decent fight scenes\\n\r\n+Decent color\\n\r\n+Decent OP/ED\\n\r\n+Decent comedy relief characters\\n\r\n-Everything else\\n\\n\r\nTaboo Tattoo is... no. I have no words. If you've ever seen an anime before, and if you don't adore cliches, then I can't recommend this to you.",
            "date": "2016-09-19T19:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 229556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4971552.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/thelectricow",
                "username": "thelectricow"
            },
            "url": "https://myanimelist.net/reviews.php?id=229556"
        },
        {
            "content": "This anime is underrated and many seem to characterize it as generic. Many things about this anime make it distinct from your typical 12 episode 'gotta save the world' story including: \r\n- involvement of superpowers (i.e. America)\r\n- ambitions of the antagonist that go beyond world domination\r\n- deaths of major characters unexpectedly \r\n- a questioning of morality, justice, etc. \r\n- good action scenes (w/ guns too)\r\nThe anime also resembles Cold War conditions. The antagonist's pursuit of utopia via ruthless violence in addition to their annoying demeanor makes the audience root for the protagonist (and the U.S.A.). \r\nI just wish the antagonist would read the Declaration ofIndependence, The Federalist Papers, The U.S. Constitution, the Hebrew Bible, the Dhammapada, as well as the writings of philosophers like Locke, Aristotle, and Kant. Maybe they could reconsider trying to formulate a new world from feelings without any understanding of consciousness. \\n",
            "date": "2018-08-05T01:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 285622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4912450.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/sbrawkcad",
                "username": "sbrawkcad"
            },
            "url": "https://myanimelist.net/reviews.php?id=285622"
        },
        {
            "content": "I'm not an in-depth reviewer but I felt the need to tell you not to watch this. \r\nSomeone told me that a big reason the show can be a bit jarring is because it's influenced by something called \"wuxia\" (google it). However, the main issue is with the plot. I can overlook the bad comedic timing, bad CG, bad explosions, but someone did not storyboard this show. The plot jumps around so much and is incredibly inconsistent I'm usually left just as confused as I was after the previous episode. Yet I came back every week to see if, just maybe, I'd finally understand something.I'm still waiting.\\n\\n\r\nAnother big issue is the plot armor. I don't think I've ever seen plot armor this thick before and it really shines in the final episode.\\n\\n\r\nOne of the few good things I can say about this show is that it is very self-aware. Often times it makes some decent jokes and pokes fun at itself or the anime medium as a whole but about half of the jokes suffer from what I mentioned before, poor comedic timing. You've just come off a very traumatic scene where everyone's super serious and fighting and then jumping straight into some fart joke level comedy or an ecchi scene that occasionally shows up that completely throws off the whole pace of the show.\\n\\n\r\nI've been told most of this can be attributed to this wuxia style, and if so I am not a fan. So be warned non-nippon fans, YMMV with this one unless you're a fan of martial arts/sorcery, and even then you might still have a hard time with the bad plot and inconsistent pacing.\\n\\n\r\nSome of the stuff in the final episode is so bad it's comedic so there's another small plus?\\n\\n\\n\\n\r\nFINAL EPISODE SPOILERS BELOW BECAUSE IT'S SO BAD\\n\r\n(If this isn't ok let me know and I'll remove the spoiler)\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\n\"Hey watcher, you know those super awesome powers the characters all have. Well, MC-kun can't beat asshole antagonist girl with his own power cause she's OP as hell. So instead we're just going to make them turn into the \"mechs\" we've been teasing the whole series (that were never even physical and seemed more like mascots for the power) and have them fight so he actually stands a chance. Then he has this deep revelation about how awesome he is and then hands asshole girl her ass. Then everyone cheers and MC-kun has a deep philosophical conversation with himself over the body of his maybe dead sensei-chan\".\\n\\n\r\nLeaving me asking \"what did I just watch\", and then they kind of hint at s2 or something?",
            "date": "2016-09-21T21:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 229778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3592461.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Bebop",
                "username": "Bebop"
            },
            "url": "https://myanimelist.net/reviews.php?id=229778"
        },
        {
            "content": "Gosh, where do I start...\r\nRight. Taboo Tattoo is like finding a good book with a good summary printed on it, only when you flip it and start to read it, you realize it's horrible. I imagined the creation of this anime started out with a guy who had some sort of checklist.\r\n\"How to make a good shounen anime. You need:\r\n- Child protagonist ( )\r\n- The Chosen One ( )\r\n- School setting ( )\r\n- Comedy ( )\r\n- Female fanservice ( )\r\n- Romance ( )\r\n- Token Loli ( )\r\n- Good backstory for side characters ( )\r\n- Big boobs ( )\r\n- Badass characters ( )\r\n- OP antagonists ()\\n\r\n- \"Nakama\" power ( )\\n\r\n- Gore/Death ( )\\n\r\n- Swear words ( )\\n\r\n- Yuri ( )\\n\r\n- Torture, for MC's growth ( )\"\\n\\n\r\nAnd the guy makes sure it's all there. Sure, they are all there, but the pacing of the story is awful. Some episodes aren't entirely linked to the previous, and the anime's pacing can go from serious to comedic in less than a second, destroying the mood. Half of the time I wasn't sure what I was watching. The first four episodes looked decent, and then it started going downhill. It feels like the anime wanted to please many audiences than what it was originally capable of at that point that it became a joke itself. Maybe that was the whole point? In that case the seriousness of the anime didn't justify itself. The so-called \"tattoo\" that granted people powers suddenly turned the anime into a magical one, where almost everyone is capable of using it. The story is so thinly threaded despite it was to \"defeat antagonist\". Then they added some pointless gore and death, crossing their fingers that it would make the whole thing better. It did not.\\n\\n\r\nWhen your side character has more story than your main character, this is where it goes wrong. I relate more to a certain side character that appears for only 3 episodes than the MC who did probably nothing but tried to kill himself (and failed because plot armor) for 12. Sure, side characters need love and backstory too, but I literally know nothing apart of MC's unjustified strong sense of justice, extreme recklessness, and that he's the main character. Though, he finally picks up and became slightly better at episode 9, but he's still a mystery to me. Is he even the main character, I wonder? Some side characters have proven to be more interesting than an empty shell of \"Justice\" he is.\\n\\n\r\nNothing much to say about art and sound. They're at least better than what it's trying to convey. The art is pretty good, I must praise it. However, despite how much I can praise it, it will not change how much a mess this anime is.\\n\\n\r\nI was hoping it to at least achieve the bare minimum of average, as a shounen anime that has a decent start. It turned out to be a lot worse than what I was expecting. Just finished it earlier, and towards the end I was dragging myself with the episodes. The ending of the anime was probably a nightmare. That whole thing was hinting for a season 2? Jesus, if that ended up getting a season 2 it would've been a miracle. It was even worse than Charlotte that I hated, because this was so hard to watch, and that it actually gave me hope before it trampled all over it. This whole thing is a mess. Sugar and spice, mix in together, and you'll get this thing called \"Taboo Tattoo\" - a mess that doesn't know how to fix its own mess, and ended up becoming a bigger pile of a mess.",
            "date": "2016-12-07T07:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 235031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2617657.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Norayuki",
                "username": "Norayuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=235031"
        },
        {
            "content": "Basically\r\nThe starting episodes from 1 to 5 was really good. But then the ending episodes just sucked pure and utter ass. The opening and ending songs are really awesome, since I discovered this anime through osu.\r\nThe anime started off with a strong beginning, strong buildup in episode 1, so it got you into the anime.\r\nBut then, from each episode to the next, you're absolutely lost, you have no idea what happened because they don't start from the scene from the previous episode but from a scene which is 3 days after that scene. The timeskip from episode 10 to episode 11 of 1 year wasstupid.\\n\r\nThe anime was rushed, the story wasn't allowed to develop since it didn't have the episodes needed to develop, it was too rushed. If developed properly, this anime would have been a great enjoyment to watch.\\n\r\nI also hated the fact that put in jokes within serious scenes, what is the point of that?\\n\r\nThe ending episodes and their CGI animation, absolutely horrible.\\n\r\nA great start finishing with a terrible ending.\\n",
            "date": "2016-11-19T13:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 234025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4004001.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ingigo",
                "username": "Ingigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=234025"
        },
        {
            "content": "Summary-  Teenager Seigi saves a homeless man from thugs, only to be given a special tattoo which bestows on him special powers. This leads Seigi to meet Izzy a lieutenant of the U.S army who's in charge of collecting people with tattoos. This pulls Seigi in the middle of a conflict between the U.S and the Kingdom as both are collecting these tattoos for their own countries\r\nStory- they're is so much wrong with this anime's story that it's hard time find anything right. the pacing is way too fast that it goes from one thing the the next with no real sense of direction.it's so filled with cliche and fan-service that when it tries to take it's self seriously it just end up being silly and boring. why bother with anything in the whole story when we can be busy groping breasts and showing panty shots. the changes of tone are so drastic that it seems it's not sure what it wants to actually be\\n\r\nthe show also tries to make fun of said tropes as well as add some referential humor, only for that to add nothing to the story as a whole.\\n\r\nthe powers don't even make sense they are just some magical tattoos that happened to be their. How are they unique? they aren't they are there to serve the plot when needed from being simple enhancements to giant monsters just cause. not only that but it seems that our MC has the best of all these tattoos.\\n\r\n1/10\\n\\n\r\nCharacters- all the characters lack any sort of depth. the most notable characters are the two from the summary Izzy and Seigi and even than are both 2-dimensional characters. they just do and react to things as the plot goes along and stay like that till the very end. \\n\r\nthe rest are just one dimensional characters including the antagonist. theirs  Touko the insert Childhood friend , and Tom some weeb subordinate under Izzy. the antagonist  Aryabhatta is a prideful princess who’s also a lesbian and sexually promiscuous, and is trying to obtain power just cuz.\\n\r\n1/10\\n\\n\r\nSoundtrack- everything was just meh. from the voice acting and the soundtrack. opening was ok, but everything else was forgettable\\n\r\n4/10\\n\\n\r\nAnimation- it was average to below average. everything looked so bleak and empty. the characters were mostly average with the exception of Izzy because she's a adult trapped in a kid's body thing going on. the fight scenes were like the one's you would see from ufotable, but way worse.\\n\r\n4/10\\n\\n\r\nEnjoyment- not much there may have been moments, but they're too few to remember. .5/12 episoedes \\n\\n\r\nconclusion- Shit story, shit characters, below average animation, meh soundtrack and voice acting.\\n\r\n2/10\\n\r\nfinal statement- it seems their might actually be a season two of this.......fuck\\n",
            "date": "2016-10-07T13:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 231267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=231267"
        },
        {
            "content": "This anime had so much potential but fell very fall from my liking after the first 5 episodes. It's just so confusing to watch, they don't explain jack in taboo taboo. on almost every episode i had to go back to the previous episode bc i was confused on what was going on , but even after going back i couldn't figure what was going on. It moves to fast, and doesn't elaborate very well. If they went back and re did it like full-metal alchemist i would be happier with the result. I still don't know what is going on",
            "date": "2016-09-23T11:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 229907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/b14ker",
                "username": "b14ker"
            },
            "url": "https://myanimelist.net/reviews.php?id=229907"
        },
        {
            "content": "Pretty average anime to be honest. It started of interesting, with main character being just a normal guy who is minding his own business until he gets a tattoo which gives him a unique ability called void maker.\r\nNear the end of the anime it is kinda boring, what makes it worse is when you reach the final episode you see the main villain is defeated then on last few minutes she is shown as alive... It brings the thought into your mind, \"what the fuck was all that for then?\"\r\nOverall just \"meh\" type of anime, not bad but not good either.",
            "date": "2016-09-22T18:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 229850,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702014.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EstelarVitalize",
                "username": "EstelarVitalize"
            },
            "url": "https://myanimelist.net/reviews.php?id=229850"
        },
        {
            "content": "Have you ever seen an anime where you saw such great things coming from it's premise but left coming out of the anime like it nearly utterly betrayed you by the end of it?...well LA just didn't say that statement for no reason -sigh-, let's get this over with.\r\nOn the outset Taboo Tattoo reminded LA of the To aru Majustu no Index premise, with humans with superpowers (Espers and Tattoo users) of some kind and are at war with each other (Indexes multiple faction battles etc. and Aryabhata Region vs. USA) and LA really liked it because of it and really wanting to know moreabout the Tattoo's and how they function really intrigued LA.\\n\\n\r\nThe last bastion of good Taboo Tattoo had was it's animation done by JC Staff and really from the good looking character designs to the awesome battles were done to polish and shine throughout the anime and LA really didn't see much of animation errors. The animation and it's early episodes (like to Episode 4 or 5 or so) is some of the only good things about Taboo Tattoo.....the problems with Taboo Tattoo...well *ahem* this is gonna be sit...\\n\\n\r\nLet's start with the characters, the characters in the early episodes were cliches to say the least, from the main protagonist Seigi \"Justice\" Akatsuka voiced by Makoto Furukawa, who is the headstrong, naive and reckless hero, Bluesy Fluesy (no really, it's her name) voiced by Mikako Komatsu the maniac pixie girl who introduces Seigi to the world of Tattoo's along with her bubbling otaku assistant Tom Shredfield voiced by Tomokazu Sugita and Seigi's love interest Touko Ichinose voiced by Chika Anzai, but what utterly cripples the character section in Taboo Tattoo is their utter mismanagement to the characters and LA can easily say that Taboo Tattoo's plot is also mismanaged due to this. For the most part  Taboo Tattoo really tries to give backstories and development and majorly fails in that district, why?, well as much as they try to give character development and backstory to the characters that matter, the majority of the characters motivations are either too confusing or too generic, the main villain of this anime Aryabhata voiced by Akari Kito's motivation is essentially world domination because of her abusive father's corruption, but her \"world domination\" scheme just doesn't make sense or even needed in that sense, as for our heroes they are even worse as  Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world. By the halfway point they start really getting into this and really it forcibly makes our naive headstrong Seigi into \"hero material\" over a cheap death. On the villain side, the deaths were more or less one note with their \"tattoo power\" = personality, but ultimately it leads to LA saying...\"is that it?...\", the only exception to the minor villain mook list is Iltutmish voiced by Shiori Izawa (for a little while) and Kar Shekar voiced by Hitome Nabatame with her backstory to Brad \"BB\" Blackstone voiced by Toshiyuki Morikawa. On speaking of which, the most mixed character development given to was BB as he becomes Seigi's mentor to be hero material, well why?, LA won't spoil but add these hints together and you'll get it; \"utter mismanagement to the characters\", \"Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world\" and \"MENTOR\", as for Touko (yeah forgot about her), she gets one of the WORST plot twists and \"development\" in the series case in point  \"Taboo Tattoo likes to kill off main to minor characters (good or evil) without a care in the world\". The characters good or evil have terrible mismanaged characters and developments to them and most of the minor characters are nothing but \"heavy mooks\" to \"red shirts\" and by the end of this anime the closest character LA ever came to like was Bluesy Fluesy by default.\\n\\n\r\nOk, characters are mismanaged to all hell, the plot isn't much better...\\n\\n\r\nThe plot is infected with tonal dissonance to generic shounen fair to one of the worst points to the anime....it's rushed to no end. The tonal dissonance didn't start round the latter half of the anime, just bringing up comedic and rather sexual moments completely out of nowhere to make the \"comedic moments\" something of \"development\" to the fair few minor characters, Aryabhata also gets this as we were meant to taken her a HUGE threat but gives us misplaced fanservice just to be \"edgy\" what with her molesting Iltutmish to Aryabhata being the shameless fanservice girl of the series in a different kind of way and it doesn't help make her threatening or a force to be taken lightly, sure her battles ALLOW her to be actually threatening but the awkward fanservice with Aryabhata becomes as tonal dissonance and she's the biggest cause of this. The generic shounen fair mostly comes from the entire good vs. evil with the good being USA and their Tattoo users vs. Aryabhata Tattoo users, it also adds in Aryabhata  again as her entire \"world domination\" schtick is prevalent to this flaw as well, ohh the heroes also gets this too ESPECIALLY Seigi. Finally Taboo Tattoo's rushed pacing is the nail that ruined the series for LA and how so, what with rushed character development throughout the board, from Seigi's rushed personality from naive hero to \"actual hero\", BB's rushed backstory and how he adds into the plot in which his investment becomes nil by the end of it, Aryabhata's rushed backstory although her backstory is detailed for the most part, it's just that her generic and rather confusing \"evil just to be evil\" through world domination scheme is mixed for LA but in execution it failed anyways for LA to get invested in it. \\n\\n\r\nTaboo Tattoo's voice cast was partially ok, though LA thought Akari Kito who voiced Aryabhata was having some semblance of fun in voicing a villain, Seigi's voice actor Makoto Furukawa was ok, with the shouting in battles to his \"speeches\" he has was ok. LA thought that by the final episodes that it even felt that most of the main voice cast just didn't care anymore and just wanted to get it over and done with, most prevalent being Mikako Komatsu and Toshiyuki Morikawa and Tomokazu Sugita. LA's favorite voice actor would go to Mikako Komatsu by default though.\\n\\n\r\nThe ending, for all the backstory on both sides (Aryabhata and Seigi to be precise) really didn't help things and all the beliefs and decisions that lead it down to this final battle devolved into nothing but \"good vs. evil\" scthick with good beliefs with a literal \"justice\" beast and evil beliefs of Aryabhata beast making it a rather boring sit to watch, sure the battle was awesome, but with the devolvement of the battle it lead it down to...it was boring and a rather big copout by the end of it all. The final scenes hints at a second season and really if it was greenlit for a second season, LA is really gonna say this to the first season of Taboo Tattoo, if it got a second season, then the first season SHOULD have been managed better than this and spread the plot in a more detail way, instead it's this cluttered mismanaged mess of an anime, a second season would either dampen and reinforce what LA thought of this series or have a small bright spot for it being better, but considering what LA said about Taboo Tattoo as of now, LA wouldn't like it and would mostly be afflicted with sequelitis.\\n\\n\r\nTaboo Tattoo if there were two words LA could say about is that it's such \"wasted potential\", where it had a good premise albeit generic shounen but was shot down and ruined by the end of it with mismanaged characters and their developments, battles LA didn't care about and motivations on Seigi and Aryabhata were either too forcible to confusing why they were doing this \"just because justice or world domination\" and really not even JC Staff's polished and shiny character designs and battles couldn't help LA be distracted by the blatant character and plot flaws and dumb highly polished battles and LA being a JC Staff fanboy just wasn't enough to pull through into being good. Taboo Tattoo, LA WANTED to like you but like LA said at the start of this anime review, you betrayed LA's expectations and slowly but surely became LA's worst anime of Summer 2016...\\n\\n",
            "date": "2016-09-19T18:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 229550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=229550"
        },
        {
            "content": "Like I said in my previews reviews, I only become aware of anime because of the voice actors that participate in them. Because of the impressive English cast, I decided to watch the English dub. First, I read some of the reviews to give myself an idea of what I was about to watch. Listening to other people's opinions is good, but you shouldn't let them dictate what you feel about a TV show. So, here is what I think...\r\nSpoiler alert!\r\nStory: America is participating in an arms race with the Serinistan Kingdom, involving mysterious weapons called tattoos. The protagonist is a Japanese boy called JusticeAkatsuki (I kid you not, that's really his name), aka Seigi, who finds himself bonded to a tattoo, which just so happens to be one of the most powerful out there. An American soldier, Bluesy Fluesy (that's really her name) is forced to protect him against Queen Aryabhata, who thinks Seigi is the only one who can stop her plans for world domination. That is one of the most generic premises you might have read. Even so, it can be good as long as the show has a clear direction and strong writing. Unfortunately, the show doesn't have any of those. What a tattoo is and what can it do is never clearly explained. Instead of having clearly defined powers, the tattoos are just convenient excuses for the characters to do weird stuff, such as moving at superspeed, opening black holes or throwing spikes out of their bodies. You want a cool superpower? Then make sure to get the right tattoo! Also, there is no real depth to the story. Most of the storylines are just excuses for fight scenes and the ones that do try come off as lacking, such as BB and Arya's backstories. The comedy/seriousness balance is all over the place. Some of the serious moments, or at least the moments that should, in theory, be taken seriously fail to register because of some inappropiate scene or one-liner. Constant mood swings like these break the show's narrative structure. Finally, there is no real sense of world building and we have no clue as to how the world is affected by the tattoo fights. Apparently, only the protagonists and their actions matter, even when we are told that their actions will have international consequences. The story has no ambition or depth and is hardly enjoyable (3/10).\\n\\n\r\nCharacter: Another complaint against the show is its poor character writing. Seigi is one of the most generic protagonists I've ever watched. There is no real depth to his personality and most of the time, he fails to be an agent of volition. Things happen to Seigi, not because of Seigi. Also, his partner Izzy is not all that special either. I fail to sympathize with either of them because for the most part, they don't evolve as characters. In my opinion, the best character of the show is BB, who should have been the real hero of the story. His focal episodes are the only times the show was genuinely enjoyable. The villainess Arya is only a halfway decent character. She could have been a great villain, if it weren't for the fact that she, like most of the other characters, falls victim to the show's awful comedic timing. Touko, Seigi's childhood friend, exists solely for two reasons: fanservice and dying to give the hero some poorly done moments of vulnerability. No point getting sad about that. All the characters are one-note and forgettable so I won't bother mentioning them. (3/10)\\n\\n\r\nArt: The show at least deserves praise for decent character designs, but the animation itself is mediocre. The fight choreography is inconsistent, the fanservice moments are annoying and distracting and there are images of some weird giant monsters that supposedly represent the tattoo's real power. There are some cool shots every now and then but that's the nicest thing I can say about the art quality. (5/10)\\n\\n\r\nSound: You gotta feel sorry for the voice actors, who give it their all despite the utter garbage they are given to work with. When a character is bad, I normally try to not hold it against the actor voicing them. They are just people doing their jobs and collecting paychecks, after all. The sound effects are also great, making the uneven fight scenes almost enjoyable. (8/10)\\n\\n\r\nOverall: Aside from its terrible character writing and poorly explained superpowers, the show suffers from a serious identity crisis: it doesn't know if it wants to be a satire or be taken seriously. If it wants to be a satire, it misses that mark badly; and if it wants to be taken seriously, then it fails as well because of its poor development. I was only able to enjoy the show by laughing at its massive stupidity, and I don't that was point. Ultimately this is a show that, while not having a lot of potential, at least could have been a pleasant watch; but instead became a massive bore and I struggled to get through to the end. It wasn't worth my time and it's not worth yours. (3/10)",
            "date": "2018-05-05T11:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 279841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HeroVladimir93",
                "username": "HeroVladimir93"
            },
            "url": "https://myanimelist.net/reviews.php?id=279841"
        },
        {
            "content": "If i was 12 and not very bright, i'd probably think this show is super awesome.  It's another one of these series that spends every moment of its existence trying to be cool, without caring if anything makes sense or if any character is acting rationally.  Silly mechanics are constantly introduced at the drop of a hat and never really explained.  Just another Guilty Crown style train wreck of a plot that surely only appeals to children.  It also tries to do comic relief, but manages to fail spectacularly because it's just too fast.  You'll go from dead serious toa 1 second joke and then back to dead serious.  Very clumsy.\\n\\n\r\nThe characters are generic and generally unlikable.  Bluesy's design is pretty good but that's about the only strong point.  The music sucks too.  \\n\\n\r\nWe have to mention the \"artistic style\" of this shit.  For some reason there is an absurd amount of color bleed applied 24/7 which makes it look like the characters are being hammered by a 1000 watt spotlight.  In nighttime scenes, you will have white shirt that look like LED bulbs.  If it's supposed to be artistic, it is horrendously executed and violent to the eyes. \\n\\n\r\nFor the positive points, there was one nicely choreographed and animated fight scene in EP1 with interesting camera angles.  That's about it.\\n\\n\r\nI tried watching it ironically and enjoyed it a bit, but it wasn't enough to finish the series.  Reserved for elementary schoolers!",
            "date": "2017-03-15T16:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 242664,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/summitsama",
                "username": "summitsama"
            },
            "url": "https://myanimelist.net/reviews.php?id=242664"
        },
        {
            "content": "I wasted 12 episodes worth of my life based on the best fight scene I've ever seen (to date) in the first episode. It has boring plot that is executed in the worst possible way without any beneficial character development.\r\nThe visuals, initial character intro and seemingly interesting plotline might pull you in but don't be fooled. It's one of those anime that you watch going down the drain as it continues, hoping that it delivers on its initial promise only to end up extremely disappointed.\r\nIt is not necessarily a bad anime, more like extremely boring. At some point, you realise that anything going on ispretty much inconsequential and the outcome is very clear. It starts off spectacularly only to spiral downward after the first few episodes. By the end, I literally asked myself WTF did I just watch. It left me without any feeling of enjoyment or even relief that it had come to an end. \\n\\n\r\nIt's basically a poorly done clone of \"Charlotte\"which I loved and recommend.\\n\\n\r\nArt style, camera work and sound are all good though. I highly recommend you watch the first couple of episodes though, especially the fight scene in episode 1.\\n\\n",
            "date": "2017-10-28T16:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 261949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6638317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/robkamofficial",
                "username": "robkamofficial"
            },
            "url": "https://myanimelist.net/reviews.php?id=261949"
        },
        {
            "content": "Overall this show wasn't bad. The characters were unique and fun to follow. That was what I thought until the last few episodes. The pacing became horrible and the time skip ruined a lot of character development. The pacing felt really rushed, like they only planned half of the show all the way through. The show was trying to be too many things at once. There was romance, humor, action, revenge, and all this other stuff. But none of it was really fleshed out throughout the story. The characters had a lot of potential (Izzy), but was ruined by bad writing. I was hoping formore when I started this series. When I finished was was left in a pool of disappointment.",
            "date": "2016-09-24T10:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 230031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5661490.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/jamieofgallifrey",
                "username": "jamieofgallifrey"
            },
            "url": "https://myanimelist.net/reviews.php?id=230031"
        },
        {
            "content": "Taboo Tattoo\r\nArt/Characters: The art style is really solid. There is a little bit of similarity between some of the characters, but they were so minute and so easily distinguishable that if I had just seen the previous character, I would be able to distinguish between the two of them. However I felt that if I had fallen behind that I would struggle to figure out the placement of some characters. The light and the colors that are a theme throughout the show are really nice to look at and even though things get crazy and the lines get blurred. The characters themselves are really interestingwhen it comes to their backstories. The main, Seigi, is your average student and has a lot of the same stereotypes that come along with that. However, the inclusion of his martial art training gives him more depth than you average student. Touko is Seigi’s best friend, whom he cares deeply about, and her ability to tackle things head on even in times of fear is really admirable.\\n\\n\r\nMusic/Sound: The music of Taboo Tattoo is subpar really. While there is a lot of great action-pushing music, the majority of it is pretty generic and easily predictable. It does a good job of giving the mood some energy, but other than that it is pretty bland. The opener song is something to write home about because I really enjoyed watching and listening to the animation each week. It was something that I could look forward too, and while that might be something that is a little distracting on the whole picture of the show, it was still great. When it came to the sound of the show, there could have and should have been a lot more. The use of the tattoos should have had some actual sound, rather than just a generic sound that could be expected. But what would have made it better is a powerfully empty sound that would be able to accompany the Void Maker, because that is exactly what it does; makes things powerfully empty.\\n\\n\r\nStory: Seigi is a middle school student that happens to be trained in martial arts, and has a passion for protecting the people that are deemed as weak. He comes across a homeless man getting mugged one day and after saving him, the old man puts a tattoo on his palm. The tattoo seems like nothing, but it turns out to be a secret weapon in an arms race between America and the Serinistan Kingdom. He tries to use his martial arts to defeat someone attacking him to take the tattoo back, and when things look bleakest he needs to figure out to trigger his new weapon. The story continues to follow Seigi and his friend Touko with the help of Izzy and Tom, to defeat the enemies that they come across.\\n\\n\r\nPersonal Reflection: While there is not a true ending to this show, it provides enough closer to really put the rest of the show into perspective. I really didn’t know if I wanted to watch this at first, but after seeing the art a bit more, I really liked the fluidity and the colors to a point where I would be watching the show just to look at something pretty and cute in front of me. However, the story really drew me in after just an episode or two. I found myself really relating with Seigi on his morals of protection and I really wanted to see him succeed. Even though there was no true ending, there was a lot of set up to at the very end of the final episode that would suggest a second season. The question remains; is that worth watching based on the first season? For me, I say no. I really had to test the waters on this one and it turned out alright. While the story is good in some aspects, the sound drops the quality. I do have to say this has some of the best art of any show of this current “Summer 2016” season, and that is something that I will not forget. A second season might be a fun concept because of all of the set up, but it feels a little too much of the same, and not enough variety which would have made this show 10x better. Taboo Tattoo is not the best series I’ve ever seen, but if you are into action packed/super power type shows, then give this a go!\\n\\n\r\nOverall Score: 7.2/10\\n",
            "date": "2016-09-20T21:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 229688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=229688"
        }
    ],
    [
        {
            "content": "Want an anime about 'Murica? You got it! This show is all about americans going to Japan to gather tattoos. As dumb as that sounds, it's actually the whole idea of the series.\r\nNow, you might think this series is an action-packed series with spectacular graphics and compelling story line. Yes, it has spectacular graphics. Yes, it's action-packed. But if there's one thing this series doesn't have, it's a good story. The series focused so much on action that plot-building hardly occur in the show. And when they do, they shorten the fighting scenes and add fillers. In terms of plot sequences, this anime didn't doa good job.\\n\\n\r\nTo make up for that, however, it had characters that stood out more than it should. The side characters in the series were quirky and strong despite not having much to do with the advancement of the story. I also liked how they didn't discriminate/look down on female characters. Both sexes had equal roles in the story.\\n\\n\r\nTo be honest, I didn't enjoy it that much. Sure, there were scenes that really blew my mind. But along the way, I was just watching it and asking, \"What the heck is going on right now?\". If you're into anime filled with action, then I recommend this title. But really, it's just an anime about tattoos containing powers and stuff.",
            "date": "2016-09-20T03:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 229586,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=229586"
        },
        {
            "content": "Akatsuka, a middle school boy who magically received a tattoo from some person he randomly saved on the streets. (Was shown on episode 1)\r\nThis Anime was really interesting and was really different from all the other anime I've watched over the past couple of years. But, the problem is, is that it was way too rushed. 12 Episodes was surely not enough. If they where to extend it and explain the story in details and not rush it, it would've received a 10x better rating. \r\nRegarding the \"Comedy\" in this anime, it was pretty pointless, since they implement it in the worst situations ever. Theyhad the characters joke around when in combat and in a fight with their enemies. Which I find it to be mediocre.  \\n\\n\r\nReally sad to see an anime with a great idea and interesting story put to waste like this. This is pathetic. It had a great potential. \\n\\n\r\nThat's all, Arigato.\\n\\n",
            "date": "2018-08-01T14:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 285318,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6337831.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NoorMatic",
                "username": "NoorMatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=285318"
        },
        {
            "content": "This anime is awful! I can't believe that people were paid money to make something like that or that the story even got greenlit. So why am I so annoyed by this anime?\r\nThe thing is that the story is incredibly mainstream. People have powers and others want to take over the world. What is garbage about that is that the powers come from stones that dissapear on contact with the body and generate a tattoo on the person. BUT if you want to use the power you also have to ducking have a special object in your hand that can range from blood to crayons(BLOODYCRAYONS?!?!). AND the powers aren't even consistent. Some people can shoot black holes and others can teleport. Like how are those magic stones so different from each other?\\n\\n\r\nEverything here is just plain stupid and even the anime stops caring about holding stuff in your hand by later episodes. The only good point that I could bring up is that at points it has interesting camera angles, that is pretty much it. Also OH GOD the fanservice, it has characters groping eachother in the most random occasions. Why would you think that it is neccessary. \\n\\n\r\nThe characters themselves are blander than your floormat. I think the writers even knew that so they gave everybody some quirks, like eating a rock in a certain scene or licking some milk like a cat but that doesn't count as mother effin character developement, you can't just add quirks and expect that to be the character. I mean, my lawnmower has more character by default than those people in the anime.\\n\\n\r\nI am sorry about so many pointless words in the review but just thinking about Taboo Tattoo gets my knickers in a twist.\\n\\n\r\nYou can check out anime reviews on my channel on YouTube at MudanTV. Any feedback is greatly appreciated. <3",
            "date": "2016-10-08T11:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 231347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3313409.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MudanTV",
                "username": "MudanTV"
            },
            "url": "https://myanimelist.net/reviews.php?id=231347"
        },
        {
            "content": "i rarely write a review, but i write it for guide if you cannot decide watch it or not.\r\nif you a fans of martial art, it may suitable for you, because so many martial art showed every episode and you never bored watch that part. but i must warn you if you looking for a good show because so many thing doesn't support the art itself.\r\ni can say the story is a fatality, unstable pace and some part doesn't connect with the other part may the main reason to drop it and there so many unnecessary fanservice which disturb the enjoyment of the show. \r\nforthe character, rest than Izzy is a bad development, because i can't get the charm of main character and so many twin character, it make me confused.\\n\\n\r\nfor me enjoyment depend to story and character development, so it became a mediocre show. i would put 6/10.\\n\\n\r\nthe conclusion don't watch it unless you just looking for martial art and has low expectation from the show.",
            "date": "2016-09-26T04:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 230267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4658071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lemonade_salt",
                "username": "Lemonade_salt"
            },
            "url": "https://myanimelist.net/reviews.php?id=230267"
        },
        {
            "content": "This is a perfect example of how trying to fit a 25+ chapter story into 12 episodes can lead to catastrophic results.\r\nThe premise behind this series is quite good, but it never reaches its potential due to wanting to do too much in too little time. I'll illustrate with some examples:\r\n- Fight scenes: these have the potential to be amazing, that is, if fights had enough time to flesh out. Four fights happening simultaneously in the same location? Too bad, we have to close this shiz in one episode, so let's just show two blows, loser gets dismembered, winner says some snarky remark about theirclear superiority, and quickly transition to the next fight happening, we have 20 minutes ffs.\\n\\n\r\n- Character development: you'll have no clue of what some characters are talking about half the time, due to background information about said characters only existing in the minds of the series' creators, they don't have the time to explain it in the series proper. There's a particular secondary character who appears in like... three episodes. He gets like 2 minutes total screen time, says approximately 6/7 lines, and for how powerful he's supposed to be, you don't even get to know his name.\\n\\n\r\nOther problems about this series include the main protagonist feeling like a total wimp who has no idea of what he's doing half the time and only stares in awe while his opponent pummels the shit out of him.\\n\\n\r\nThere's also a problem with fight development: most other series give you a general idea of what a character can or can't do in combat, be it by showing their training or having a roughly cohesive thematical identity, so you can expect some attacks and be hyped for their potential to be untapped, and so on. Yet here, because of the same reason I've been repeating all along, it's all very sudden and you can't get hyped by anything.\\n\\n\r\nI have the impression the studio had planned a longer series and had to change plans in the middle of actually making it, because the action and characters in the first few chapters are way more fleshed out and overall interesting. It's kind of like the infamous Gantz's final chapter, where they suddenly throw everything out the window because they learned they wouldn't be continuing the story along with the manga and they wanted to give it some closure.\\n\\n\r\nThe few redeeming qualities of this series are good looking art, a pretty good OST and sound effects (I'm a sucker for the WOOOOP of the Void Maker), and a huge amount of fanservice which doesn't feel too out of place. I'd totally watch a 26 episode version of this series, and I'd probably rate it higher than this.",
            "date": "2016-09-24T17:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 230084,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5618276.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kichen",
                "username": "Kichen"
            },
            "url": "https://myanimelist.net/reviews.php?id=230084"
        },
        {
            "content": "Never before have I watched through a series on a weekly basis and loathed the day when a new episode came out. That all changed when I decided to continue watching “Taboo Tattoo”. What started off as a generic, but passible, story quickly turned into a barrage of nonsense and a jumbled mess.\r\nLike I just said, the story is nothing out of the ordinary. Boy gains these unknown powers and is thrown into this battle against others with the same powers. The first three episodes weren’t all that bad, but things changed drastically when the next few episodes came around. I can’t describe it anyother way than “things just happen”. I say that from episode four onwards in when the show starts to go off the rails even when it was already a train wreck. By the time all that happens, I lost all hope for the series (of what little hope I had for it, in the first place). The other thing that jarring is the general tone of the series. It will go from serious, in the over-the-top kind of sense, from cringe-worthy ecchi moments that come out of nowhere. Nothing makes any sense at all, and I know why this is, but I will explain that later.\\n\\n\r\nThe only thing worse than having a bad story is having bad characters. Boy, were these characters horrendous. There was not a single person from this show that had a single redeeming quality to them. It’s even hard to say that they had any type of personality. As a minor spoiler, there are people who die, but when they do, I get no emotion out of it. The ironically funny thing about these characters are the stupid names chosen for them. Just to name a few we have: Blood, Wiseman, Iltutmish, Aryabhata, and one of our main characters Bluesy Fruesy. There is even a character named Colonel Sanders. Just what the hell is this show trying to be?\\n\\n\r\nThere’s also no use in finding anything great animation wise. The overall aesthetics is appalling and ugly with most of its color palate being either black, grey, or brown. The character designs are hideous-looking, but that goes the same with the designs of the original manga, so it’s neither an improvement nor a downgrade. What’s worse is this is an action series, so there’s lots of movement involved. You can only guess that this is done horribly, like everything else. Even if the story turned out to be decent enough, it still wouldn’t save the show from its visual eyesore. That alone was painful to watch each week.\\n\\n\r\nNow, I would like to explain why the series turned out the way it is. It was all in the production choices. The first three episodes covered volume one of the manga, which is the standard way of adapting the material. Episode four, however, covered a majority of volume two with the next two episodes covered close two or more volumes each. This is the first time I’ve noticed something like this (probably because I actually did research). The manga has seven years of content, a rare thing for it to now receive an anime. Normally, a source would only have one to two years of content before getting an adaptation. My only conclusion is the production team wanted to fit in as much story as they could within twelve episodes, which results in this sloppily-paced mess. Had it not been for that, it would have been more than likely an okay show.\\n\\n\r\nThere isn’t a whole lot to say about “Taboo Tattoo” other than it’s something that nobody needs to see. It’s one of those shows where I feel has nothing good about it, but still manages to have an audience that genially enjoys it. I don’t mean any disrespect to those who do, but it’s hard to deny how bad it is. The story, the writing, the characters, the animation, and the production as a whole. All of it is just bad. I’m not sure if I’d recommend the manga because it’s not any better. Perhaps no matter what happened in the end, an anime adaptation was doomed from the start.",
            "date": "2016-09-20T05:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 229599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=229599"
        },
        {
            "content": "Let's start with: This is the kind of series that will tempt you with a good concept and then will disappoint you with a lame development. And if you manage to watch it to the end, you will keep thinking: \"Why didn't I throw it after the third episode?\"\r\nNow, as I say the concept is good. A story based in these mysterious tattoos that give super powers to the ones that get them is quite attractive and the battle scene are good enough to get you curious.\r\nHowever, with the introduction of \"the villians\", the main characters began to seem extremely weak. Since that moment, youwill keep watching them being defeat by so overwhelming antagonist, that it's hard not to pity them, while you also hate them by how they keep their childish stubbornness till the very end.\\n\\n\r\nThe incapability of maturing of the characters is so marked that even the cliche dialogs lost their weight by the subsequent events.\\n\\n\r\nAlso, I'll point that this is one of the best examples of how the fanservice should not be added indiscriminately; since, instead of giving it a little spice touch, it ends being just tastless and even vulgar.\\n\\n\r\nOverall, this is a poor series. It has lame characters, a structureless development (it was as if there was an idea for the start, an idea for the end, but one knew what to do in the middle), a mundane fanservice, a barely good art, and an incomplete end.\\n\\n\r\nBut if I have to rescue something... The Opening, maybe everything in this anime is a waste of time; however, the opening is really catchy and deserve to be listened... Though it would be better to do it at Youtube without wasting energy in an anime that doesn't deserve it.\\n\\n",
            "date": "2016-09-19T20:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 229559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75045.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/NoHeart",
                "username": "NoHeart"
            },
            "url": "https://myanimelist.net/reviews.php?id=229559"
        },
        {
            "content": "Ok this anime is getting a lot of hate but I feel like it is because everyone was expecting something different. Tabboo Tattoo is a cliche anime anyone can tell that. Everyone should have known that by the first episode. People who say it is cliche... THAT IS WHAT IT IS SUPPOSED TO BE, so if you say that it was a horrible anime at the last episode then you wasted a huge chunk of your life. If you are into action then this is the anime for you. I personally loved it and thought it was great.  The animation was top notch andI loved the action. Although I must admit the character development was not good but that is not what the anime is about. It's about action so DO NOT watch it if you need character depth and if you are watching this anime right now and hate it please do not watch it to the end just to comment \"I hate this anime\". Stop watching if you hate it, keep watching if you like it, simple as that. And to people who are saying this is a bad anime I understand why but that's just because you hate this kind of genre and you should not have been watching it in the first place. So people who are thinking about it, watch the first couple of episodes, if you hate is stop!",
            "date": "2016-09-19T16:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 229529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5708965.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jinsanity101",
                "username": "Jinsanity101"
            },
            "url": "https://myanimelist.net/reviews.php?id=229529"
        },
        {
            "content": "Wow where do i even start for this...execution? Story? The awful animation in the later episodes? Or how about the direction of this train wreck and where it went wrong...\r\nStory = poo emoji (5)\r\nNormally when i watch a series that's trash I almost never take it serious. Basically like J.C. Staff(studio behind this series) who never took this series seriously from the very beginning. It becomes evident when the direction of the series' story sorta fell apart with the introduction of the princess and her lackeys.\r\nArt ...How? (4)\r\n...How? how do you go from one of the most visually appealing series of the season to theworst? I understand having budgeting issues and a quality drop. That normally happens but this was just awful. When you get slashed in the face and permanently lose your eye sight, I want to see gashes on where your eyes used to be. I don't want to see this fucker with his eyes closed as if he gotten something in them -_-\\n\r\n*sigh* Blood stains...So i'm thinking these guys are magical when I don't see blood on their clothes after they heal...I mean it's the simple little things dude...J.C. really went lazy with this simple shit...\\n\\n\r\nSound(7)\\n\r\nIn the midst of mediocrity, there is a glimpse of decency within the music. Other than sound effects taking a break every so often...The music was well used and OP and ED songs were pleasant to here...I feel so bad for May'n's song \"Belief\" being used for such a train wreck series...this OP was amazing and I loved it. The OST served its purpose for the specific points and \"key moments\" for the series \\n\\n\r\nCharacter just...no (2)\\n\r\nSeigi's character just screams plot convenience...\\n\r\nSeigi who \"conveniently\" knows martial arts \"conveniently\" saves a man who gives him a power known as a tattoo which inevitably throws him into this entire situation...\\n\r\nEveryone else however falls into the category of incomplete for me. Little to no character depth just about all of them. Just a bunch of cardboard cutouts, this even applies to Touko (Seigi's childhood friend) who's only known for her feelings toward Seigi. But of course they also needed to drag her into all of this:\\n\r\nReader: Why?\\n\r\nMe: Idk ask the mangaka >_>  \\n\r\nMangaka: *shrugs*\\n\r\nMe: ...gtfo -_-\\n\\n\r\nAnyway, You'll see how everything goes for her if you decide to watch this.\\n\\n\r\nEnjoyment(5)\\n\r\nIf anything i found subtle enjoyment from the stupidity of the ending episodes...If shounen has their share of powerup bullshit, so does seinen and yes this is listed as a seinen well at least the manga is -_-.\\n\\n\r\nOverall(5) \\n\r\nReally I anticipated this series, and it had tons of potential but just decided it wanted  to be trash, nothing we can do really. But hey if you're still inclined to check it out, by all means knock yourself out",
            "date": "2016-09-19T15:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 229526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4783602.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Anime4Rays",
                "username": "Anime4Rays"
            },
            "url": "https://myanimelist.net/reviews.php?id=229526"
        },
        {
            "content": "\"THIS REVIEW CONTAINS SPOILERS\"\r\nWell im not good at writing long reviews so ill just sum it all up\r\nFirst lets go with the story, the story is waaay too fast paced it was all good and then it all crumbled up, i realliy liked the plot to be honest you know the tattoos that can give you powers its all good but its just something.\r\nNext to the Action its good all good i really liked it, specially the martial arts those are sick that is one of the things that got me hooked up and also the Animation is good but some scenes with cgi kindaruins it for me, Sound all good specially when its BB's time to shine and the OP i really love it.\\n\r\nNext the Comedy, the comedy is great sometimes unseen or doesn't like fit in but overall good.\\n\r\nEnjoyment - The action is really good (as i said earlier) you need to give this a try, its a first impression thingy that its good at the start but atleast give it a try\\n",
            "date": "2018-04-17T21:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 278357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6214126.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stormgrid",
                "username": "Stormgrid"
            },
            "url": "https://myanimelist.net/reviews.php?id=278357"
        },
        {
            "content": "Ever wanted to see a middle school boy take on a perverted princess bent on taking over the world by using military weapons? Now is your chance to see exactly what kind of chaos follows.\r\nSeigi, a middle school martial artist is gifted with a strange tattoo that begins to change his life. He suddenly develops super natural strength, healing, and an ability to eat up all molecular matter. He is then whisked away from middle school and into a branch of the American military called the Tattoo Retrieval Unit. The military is at war with a fictional Kingdom ruled by lewd Princess Aryahbata who wantsto claim all tattoo weapons for herself.\\n\\n\r\nThe genre is a mesh of action, comedy, supernatural, and mecha/military types. The plot for this series remained extremely jumpy, full of holes, and unnecessary attempts at comedic one liners. Seigi goes from training to being thrown into full battle scenes where he almost always nearly dies and has to be saved by someone. America’s military is constantly being beaten by the Kingdom, and the Princess’s random crudeness and fondness for her underage soldiers makes her more of a joke than a serious villain. I had a hard time staying focused on this anime because it jumped around so much itself from scenes to characters to unimportant deaths of soldiers on both sides of the war. The overall plot could have been much more thoroughly developed.  \\n\r\n4/10\\n\\n\r\nThe artwork and animation of this anime are some of the most redeeming features about it. The action scenes animation coupled with the j-pop music worked out much better than I would have normally expected. The gore scenes are honestly very well done and always kept me engaged. Some of the best scenes of this series are of someone dying.\\n\r\n5/10\\n\\n\r\nEveryone who’s watched Taboo Tattoo and liked it agree that the set of characters is one of this show’s strongest points. The main character is not all that interesting at first, although eventually he becomes quite the badass, but the rest of the cast are worth watching. We have the sexy and badass girl who works for the US military, the main character’s well-endowed childhood friend who is super cute and has a crush on him, the middle aged otaku agent who triggers most of the jokes, a very lewd and sadist bad guy obsessed with sex and penises, a dozen buffed American soldiers, the badass guy who men want to be like and women want to be with and an absolutely charming yuri queen who’s just as evil, pervert and wicked as delightful. Yes, Taboo Tattoo certainly has a lot of characters for a 12-episode show and that undermines character development a little bit. But still, these characters make the show cool, sexy and funny, and that’s pretty much all there is to Taboo Tattoo. Sometimes a bunch of stereotypes put together can really work, at least sometimes.\\n\r\n5/10\\n\\n\r\nOverall, the show’s not entirely bad and it does manage to be entertaining, which is probably the most important thing to judge. As long as you don’t expect a powerful and compelling story, you’ll find the fun you’re looking for on Taboo Tattoo. This show is what happens when you just throw superpowers, jokes, an improvised story and boobs into the mix; the result won’t be good but it’ll get the job done.\\n\r\nOverall: 4/10",
            "date": "2018-03-01T12:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 272747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6798983.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Keita2014",
                "username": "Keita2014"
            },
            "url": "https://myanimelist.net/reviews.php?id=272747"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\n“What is it? What is it? Show us!”\r\nOur class clamored. Mr. E, the best fifth-grade teacher this side of elementary school, was loved by everyone. Students and teachers alike. Clean-cut hair, green polos, khakis. Alongside his beaming smile, he always looked professional and cool.\r\nAnd he also hid a secret on his left bicep.\r\n“Maybe once you guys and girls graduate and go on to sixth grade. Until then, no deal!”\r\nWe always wondered what kind of tattoo he had. Something personal about himself? Something naughty? Something he accidentally got? Throughout all of fifth grade, from the classtrips to the assemblies held in the main hall of the school, we tried sneaking peeks to see what it could possibly be. But to no avail.\\n\\n\r\nThankfully, Mr. E kept his promise. The mystery he professionally and cooly hid for the whole year was made known to us during one of our last days as his students. It was Dopey from Snow White and the Seven Dwarves. He was walking down a sidewalk, a lamppost in the background and a careless expression fitting his face, wearing his usual green robe and purple hat.\\n\\n\r\nI speak of Dopey and tattoos today for one reason only: Taboo Tattoo. For this show is as fun as Dopey – and perhaps intentionally half as smart.\\n\\n\r\nSTORY\\n\\n\r\nTaboo Tattoo starts on the streets of an inconspicuous city. Seigi, a high-school teenage boy, saves a local homeless man from danger, and, in return, the man uses a strange crystal stone on Seigi’s hand that imprints a bizarre-looking tattoo. When this piques the interest of a foreign beauty, Seigi finds himself thrown into the midst of an international terror plot.\\n\\n\r\nSounds cool, right? For the first three or four episodes, the anime is cool. Some hard-hitting, one-on-one martial arts. Crazy abilities like voiding space and possessing people. Attempts at establishing cute characters and even some themes on justice that, while most certainly not groundbreaking, at least put its mind in the right place.\\n\\n\r\nBut perhaps its best trait is its comedy. When Izzy turns into a cat when drinking coffee with milk or when Tom’s intestines fall out (all censored), the anime manages to strike that hilarious tone despite the blood and the action that surround them. In fact, that contrast is partly what makes it so funny to begin with.\\n\\n\r\nWith episode five, though, the anime goes bonkers.\\n\\n\r\nTaboo Tattoo always had the serious-but-not-really approach, but episode five pushes its comedic roots to the limit and then some. By choice, the anime throws out both continuity and reason, creating a smorgasbord of events.\\n\\n\r\nMinor happenings, like gobs of blood disappearing or Seigi randomly getting advice from Tom on how to beat Iltutmish (by closing his eyes), are already odd. But the show takes it further. That one-eyed cat mauls Seigi out of nowhere. Tom pointing out the cliché setting (cute childhood friend next door, beautiful transfer student living nearby, chosen one, parents away from home). BB, a brand-new character introduced at the end of the episode, asking Seigi if he wants a piece of gum.\\n\\n\r\nYet the best moment from the episode follows Touko and Arya’s “intense” table-top match.\\n\\n\r\nThe princess won, so, per the stakes, she was permitted to fondle Touko’s massive boobs as much as she wanted while Arya spoke with Seigi. However, all throughout their talk, which is completely serious with topics spanning wars and fighting, Touko’s moans escape. The scene becomes entirely goofy since it cares more about Touko’s background pleasure than it does the plot itself.\\n\\n\r\nThis sign is the first major one that argues the anime is purposefully presenting itself in a negative light. Which is weird because, honestly, what show would go out of its way to make itself look bad?\\n\\n\r\nBut it gets even better (or perhaps worse, depending on where one stands at this point).\\n\\n\r\nThe next two episodes feature the gang chasing after the princess and her squad to a remote island. There, the silly attempts at American cursing, the lead colonel not caring all that much that he had his pupils sliced shut, and Touko literally wearing a shirt that has the word “flag” on it (a flag she set with her watermelons and that she triggered with her death) bolster the argument that, yes, the anime revels in its absurdity.\\n\\n\r\nAll the while, the anime is basically nonsensical. Characters prattle on about justice and power in long-winded monologues. The contrived plot involving ruins, consumption, and power. The ridiculous developments like Iltutmish becoming a giant lion-tiger beast and Seigi getting nailed to a stone slate in some makeshift crucifixion. Touko even being there in the first place.\\n\\n\r\nTaboo Tattoo doesn’t stop. Episode nine is entirely dedicated to BB’s “defection” to the kingdom, showing what he did to get the information he found on tattoos. However, it’s hastily put together. Inane subplots on secret clones, an odd focus on the king’s gay lover, and the ultra-convenient getaway train continue the show’s dive into narrative death.\\n\\n\r\nAt this point, Seigi is worthless and BB is dead. Naturally, then, the anime time skips a whole year. Seigi, Izzy, and a few others hide away to improve and prepare for the final fight – all while the bad guys lazed about without doing much.\\n\\n\r\nThey show as such in the video they send which, per usual, calls into question Taboo Tattoo’s purposeful negative presentation. For, when one of the newest side characters triggers multiple flags for his death in the coming final mission (that his girlfriend and the background red-flag bearers corroborate), it solidifies its intentional ineptitude.\\n\\n\r\nThe final few episodes, though, contain more head-scratchers and more unfathomable decisions than the rest of the episodes combined. The whole genetic-ascension deal with the princess. The random pill-taking that poisoned Seigi (but not actually). Him and Izzy floating in midair. The nuclear bomb that doesn’t go off. The souls of Izzy and BB linking when Seigi swallowed up Izzy just to give the two a final moment together.\\n\\n\r\nTo give Taboo Tattoo its due, it has two “worthy” writing moments.\\n\\n\r\nThe first is Arya’s kiss with Seigi. It acts as a connection between her and him so that he could become the giant mutant. It’s at least a callback to that earlier comedic bit in the show, meaning it’s not totally out of nowhere like most everything else the show tries to sell.\\n\\n\r\nThe second is the whole personal revenge versus selflessness angle. Seigi losing sight of his justice mindset, causing him to become something he wasn’t and not letting him accomplish what he wanted to, demonstrates the anime had its thoughts in the right place.\\n\\n\r\nNot to say that these moments are handled with grace let alone execution. Because they’re not. Regardless, they are overshadowed by the repetitive Lisa-kidnapped subplot, the forgetting of important characters like Iltutmish and Touko, and the unbelievable need for Seigi to declare that he will protect Arya despite all that she’s done.\\n\\n\r\nSo, is Taboo Tattoo intentional in its silliness? Probably. But is it also horribly written, ignoring any sense of cohesion, logic, or basic plot development?\\n\\n\r\nYes. Without a doubt.\\n\\n\r\nANIMATION\\n\\n\r\nTaboo Tattoo had some quality animation near the start of its run.\\n\\n\r\nMore specifically, Seigi’s duel against Izzy is only as cool as it is because the choreography and, indeed, the animation kept up throughout it. A flurry of kicks, punches, and throws, ending with a downward knife strike. Pretty rad.\\n\\n\r\nThe anime manages to keep up for a while. Not to the same extent as in the first episode, but Seigi’s brawl with a possessed Touko and the later escapades in the freighter area are not devoid of animation.\\n\\n\r\nAnd, to its credit, the character designs can be nice. Izzy’s silver hair and pink bow, Arya’s twin tails and smug face, and BB’s all-black outfit are some combination of cool, sexy, and cute. Not all of the designs are praiseworthy; Seigi’s is too plain and Touko just has her chest. But at least they remain consistent without any noticeable dips.\\n\\n\r\nBeyond the first few episodes and the character designs, though, the anime goes downhill into a grave of its own making.\\n\\n\r\nScenes like Touko’s death where it’s a series of frozen cuts or the show’s increased reliance on “fast” backgrounds start to make many of the moments and fights less interesting since movement is masked (or sometimes not even present). So, what gets depicted isn’t what’s actually happening.\\n\\n\r\nTo try to compensate for the lack of animation, Taboo Tattoo incorporates many sweeping shots with the camera. Rather than the characters moving, the camera does, following up-close, far away, or all around. It would be nice if it was fluid, but, since it’s all so janky, the scenes are cobbled together as these near-still frames.\\n\\n\r\nThe art itself also doesn’t do it any favors. Many of them suffer from not-enough-noise syndrome. I.e., everything that’s shown feels conveniently away or scarce on life. A side alley, a row of houses, and a remote island are so bland and so boring to look at that it makes the fight’s location irrelevant.\\n\\n\r\nNot to mention, the coloring and artistry is just not present. Everything is some shade of brown, orange, dark green, or grey. Sure, it places the show in a dreary mood which, admittedly, fits the overall tone of Taboo Tattoo. But when it all starts to blend together as this same-y mess, it becomes less than appealing.\\n\\n\r\nIncreased CG usage also reduces the visual appeal of the show. Rigid bodies and undetailed objects are the norm, and even the explosions start to rely on the CG effects. Their stark contrast with the already low-quality hand-drawn material makes it that much harder to watch.\\n\\n\r\nThe combination of all three in the final fight, though, is deplorable. A couple of shiny, mutant monsters fight in hand-to-hand combat with complete disregard for visual accuracy or even a sense of control. Frames are repeated, entities “move” on-screen, and the whole inner-thoughts moments dominated by purely black or purely white backgrounds end it on as low of a note as possible.\\n\\n\r\nThough perhaps its biggest error is one that it (coincidentally enough) makes intentionally. The opening track features a woman whose right eye is stitched shut. BB, during his flashback episode and as he does in the OP, squares off against her. However, the anime chooses to reuse some of the exact same frames for her art and animation. The only difference being the lighting.\\n\\n\r\nVery few anime would include some of their OP visuals shot-for-shot, and fewer still only do so to avoid animating a particular segment. Taboo Tattoo falls into this latter camp – and it perfectly sums up its incompetence.\\n\\n\r\nCHARACTERS\\n\\n\r\nIt’s no stretch to say that Seigi of Taboo Tattoo may be one of the worst characters ever written.\\n\\n\r\nHe’s what’s known as a do-nothing character. He may have dialogue, and he may take part in the various festivities, but he does nothing worthwhile. Either for himself or for the events at large.\\n\\n\r\nHis name being “Seigi”, which translates to “justice” in English, should already indicate how lame his character is (even if it is arguably the anime making yet another intentionally bad joke). He refuses to kill anyone, believing that such justice is not right. Plus, he has one memory of his dad, about reaching out his hand as a metaphor for reaching out for what’s in front of him.\\n\\n\r\nFor some reason, he almost never understands what’s going on, asking the same types of questions: “What are you saying?” “What are you talking about?” It’s meant as him being unable to comprehend everyone else’s ideas of justice and righteousness, but, when he spouts almost nothing but these questions, it makes him into an intolerable person.\\n\\n\r\nWhen it comes to the fights, he barely contributes. Izzy and the others of Taboo Tattoo explicitly tell him that using his void tattoo is, in fact, taboo, so he rarely does. That leaves him and his martial arts which almost never help him. He loses his first duel against Izzy, Touko steps in during his fight with Iltutmish, and, even after all his training with BB, he doesn’t do anything on the faraway island to the point that Touko gets killed.\\n\\n\r\nThis outcome causes Seigi to do even more nothing, forcing him into a deep depression and a sense of worthlessness (which he arguably already had). Cue a one-year time skip that doesn’t show how he came to improve his skills, and, when asked how, he responds that he just “knows” what to do. Yikes.\\n\\n\r\nYet that doesn’t help him in the final fights. Against Kar, he gets beat constantly until BB’s spiritual presence causes Kar to hesitate. And, when he squares off against Arya for the first official time, she destroys him because, apparently, his conviction for revenge is too selfish (as opposed to her “saving” of humanity which is just a backwards way of saying that she wants everyone to die).\\n\\n\r\nHowever, the kicker is their second official fight. Right as she is about to lose and Seigi is about to deliver the final blow, she screams, “Don’t think you’ve beaten me!”, and she escapes. In other words, right up until the end of the season, Seigi does nothing, solidifying his do-nothing status for all eternity and his spot in the hall of shame as one of the worst characters of all-time.\\n\\n\r\nThe rest of the cast are almost not worth talking about, but, for completeness sake, they will be.\\n\\n\r\nIzzy started out as someone of intrigue. She could hold her own, and she had an interest in Seigi’s tattoo. So, when she recruits him, it’s done both as an act of protection on her part as well as a means to understand more about him and what he was capable of.\\n\\n\r\nTaboo Tattoo gives her a high cute status very early on with her catlike drinking of coffee. And, once the anime learns that her young looks are the price she paid for wielding her tattoo, she becomes the explainer of sorts. How tattoos are used, what people do with them, where they came from, and so on.\\n\\n\r\nShe has close friendships with Tom and Lisa, indicating that she isn’t just some hardened warrior but a person who cares deeply about those around her. Which is especially evident when she does what she can to save Lisa from the clutches of the enemy (twice).\\n\\n\r\nAs such, and early on, Izzy is not much more than a passable side character (despite her main character status). For the anime largely ignores her: no improving of her relationship with Seigi, no personal conflicts she must overcome. She has her comedic moments and her action moments, but, as a character, she is super average. Perhaps slightly less.\\n\\n\r\nCome the halfway mark, Taboo Tattoo tries to make her more relevant. BB’s previous relationship with her and the loss of her left arm provided some interesting outlets for the anime to explore. But all that’s given about her connection to BB is one aside under a bridge and single, measly flashback where she twirls his hair. As for her arm, she gets a biotic one to replace it, and, beyond Seigi catching her before she fell to the ground, it does not play a significant part in the events thereafter.\\n\\n\r\nIzzy is arguably the best character the anime offers – which isn’t saying much at all. Thus, looking at the rest of the cast is a chore in futility.\\n\\n\r\nBB acts as Seigi’s role model, but he has nothing else known about him besides his cool-guy status.\\n\\n\r\nIltutmish was once a street urchin taken in by Arya, but her opposite personality whenever Arya was around is her only memorable quality.\\n\\n\r\nTouko exists to potentially lose as the childhood friend (since it could have gone either way given Seigi’s acceptance of her and Izzy’s own romance with BB), provides some sexual relief (given how much focus her breasts receive), and introduces a pointless forehead-tattoo conflict (which gets resolved immediately upon her death).\\n\\n\r\nKar had romantic feelings for BB that were technically her downfall, yet their foundation is just a couple of small exchanges he had with her during his brief stint in the Kingdom.\\n\\n\r\nWiseman is an evil scientist, the homeless man that originally gave Seigi his tattoo. He researches them and double-crosses the main gang. That’s it.\\n\\n\r\nThe weirdest character, though, is Ajita. He’s the man who wears a wide-brimmed hat and a monocle. In the OP’s visuals, he has a monster sprout from his eyeball, yet despite this and his meager introduction during BB’s past-depiction episode, he only shows up right at the end. He turns into a giant bee, distracts the helicopters for a bit, then blows up into a purple gobstopper.\\n\\n\r\nUnfortunately for the cast, they do not come off as intentionally poor in the same way that the story does. They’re just poor. Meaning, they’re wholly problematic without any of the fun.\\n\\n\r\nSOUND\\n\\n\r\nTaboo Tattoo’s music and sound are by no means stellar. Most likely not even passable. But, besides the comedy, it’s better than almost everything else the anime has on offer.\\n\\n\r\nThe opening track does not try for anything fancy, but it has its merits. The drum beat and piano work well both together and individually, and the vocalist keeps up with the pace as well as belts out her notes when needed. The sound dropping in the middle of the track and the somber tone despite the swiftness also work in its favor. Again, not an amazing track but not an abhorrent one either.\\n\\n\r\nThe ending track is filled with piano, guitar, and drums. Harmonized signing accompanies the composition, and another somber tone dominates the air. It’s a forgettable piece through and through. Same goes for the original soundtrack with its little slice-of-life tune with a bunch of xylophones and its mysterious techno jam.\\n\\n\r\nAs for the voice acting, it’s acceptable. Shiori Izawa as Iltutmish takes the top spot with both her quieted and energetic voices for the young girl. The rest, though, do not provide anything special.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis show has a crazy amount of writing problems in the second half that severely hamper anything it tries to do. The protagonists have next to no strengths, and the villains are laughable. What little plot it crafts brings a lot of action without substance.\\n\\n\r\nDespite these large problems, I was entertained. More so than I maybe should have been. Each time I thought the anime could not get more ridiculous with its developments, it managed to one-up itself on a per-episode basis.\\n\\n\r\nThat’s not to say the anime’s actual cute or comedic moments were not so. Because they were. Tom backwards spider-crawling up the side of a house and Touko straddling Seigi had me laughing quite hard. Episode five deserves another shout-out. It was absolutely hilarious and easily the highlight of the whole season.\\n\\n\r\nPlus, the yuri. The sweet, beloved yuri. Arya may be a horribly written villain, but I can get behind all her lewd female-only antics all day, every day.\\n\\n\r\nI can’t say that about the entire anime. Because it’s still way too riddled with issues for me to see as anything but problematic. But I would be lying if I said I didn’t have a lot of fun throughout this wacky experience.\\n\\n\r\nTaboo Tattoo starts off in a rough spot and only gets rougher the further along it proceeds. From the weak story to the even weaker characters, from the wonky animation to the bland musical choices. It’s like a regrettable tattoo: fun in the moment, but, in hindsight, a completely wrong set of decisions.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the asinine writing destroys the narrative into smithereens, but, arguably, it does so intentionally\\n\\n\r\nAnimation: Terrible, bad artistic direction, below average actual animation, poor visual choices, and okay character designs\\n\\n\r\nCharacters: Terrible, Seigi is unbelievably and abysmally written, and the others are just as poorly handled, given no attention, or both\\n\\n\r\nSound: Bad, okay OP, bad ED, bad OST, and okay VA performances\\n\\n\r\nEnjoyment: Good, comedy, yuri, and the wackiness of it all made for a surprisingly entertaining time\\n\\n\r\nFinal Score: 2/10",
            "date": "2018-02-18T16:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 271884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=271884"
        },
        {
            "content": "This anime had all the potential to be great. The trailer was eye-catching. The first episode was interesting to the point that it can really intrigue a person about the possible backstory. The problem were both the backstory and the \"backstory\". \r\nThe anime put too much \"backstory\"and the actual backstory wasn't coherent. \r\nSure, it's common for anime to use ecchi as a way to attract a lot of audience but also like most of them, they killed the story in doing so. There are some anime out there with a decent balance of ecchi but still keep the story together. Heck, I've watched/read hentai thathad plot twists and a very good story that actually took my attention more than what the hentai was actually for. One even nearly made me cry(I'm not kidding).\\n\\n\r\nThe overall plot is glued together with rice and hopes and dreams. They didn't spend time on transitioning from major event to major event. Even if major plot parts overlapping isn't that new in writing, they couldn't transition from one to the other without the story falling apart and rebuilding a new one almost every episode or every few episodes.\\n\\n\r\nThe biggest problem with anime though is much, much worse than the two previously mentioned. It's the fact that the anime does not know how to switch gears from funny to serious. This is something I personally consider a mortal sin. An act one must never do so in writing unless it was meant to be that way because if it was, the plot would and should converge simply into the comedy genre. But if you we're writing a serious plot line and tried to write punchlines in between without proper timing it just kills the mood for the plot progression.\\n\\n\r\n<Criticism with spoilers ahead>\\n\r\nThe biggest examples in the anime are when the twin-tailed girl would meet the protagonists. It mostly would devolve into comedy, chibi art, funny voice mode then remember \"Oh right we have a plot to follow\". No offense to people who have it but it's like listening to a person with Alzheimer's.\\n\\n\r\n<Final Notes>\\n\r\nThis particular anime is very lucky as it is presented with two great choices with a good story waiting to be edited into either choice. It had the choice to go full-on comedy with action as a side genre to support the comedic bits as well as the ecchi bits they added like what NouCome did or it could've gone action genre with comedy as side bits TRANSITIONED PROPERLY like <insert generic action-themed anime here like SAO or DanMachi no i don't hate these it's just a generic theme and a good example>.",
            "date": "2017-07-03T04:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 251825,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5612154.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheAlphaPanda",
                "username": "TheAlphaPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=251825"
        },
        {
            "content": "The idea of this anime was good, but with a poor execution. It had no sense much of chapters, linking random things.\r\nThe study in charge of produce the series is: J.C.Staff, producer of others great series as Shokugeki no Soma, Toradora, Shakugan no Shana, Ikkitousen, Zero no Tsukaima or Slayers, so I'm very sad because I had hopes with another great production of this studio.\r\nPick up typicial ideas of any anime in his genre: rampant action, a school with teenagers, and supernatural powers to defeat an almighty enemy.\r\nAlthought the battles are very exciting with a good moments of action, all of them are cut bythe same pattern, so you lose the emotion to the half of the series.\\n\\n\r\nI don't understand how having made series so wonderful as Slayers and then produces this. Yes, ok...is entertaining cause you see much action and you enjoy with the powers and martial arts. But please, just take a little rest of this type of content always in each anime.\\n\\n\r\nMy best point is for the opening, an amazing deployment of voice by part of the singer May Nakabashi, better met as \"May'n\". Is really really exciting since start until the end, a masterpiece of music.\\n\\n\r\nIn general, this series is good to entertain-self some days, but nothing extraordinary knowing the study that there are behind.",
            "date": "2017-03-05T23:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 241977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6088216.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tazzmaniac",
                "username": "tazzmaniac"
            },
            "url": "https://myanimelist.net/reviews.php?id=241977"
        },
        {
            "content": "So, again, writing the review again and making it shorter this time so I don't waste too much time.\r\nThis series is pretty harmless when it comes to a story standpoint. You have a male lead and a female lead who will obviously get together or at least end up being extremely close. It's generic and while it was airing people were saying it was really good. As time has gone on it people have seen it as pretty bad to decent with an overall rating of 6 here on MAL, though you could probably already see that.\r\nWhat really made me drop the series was thefact that during various scenes it was obvious that they just edited in 3D CGI over the 2D CGI and it's honestly extremely jarring to see 3D blood spewing out of a 2D character making it look like an abridged series. Now whereas people like Purpleeyeswtf does this, he does it on purpose for a more random comedic effect when it's very obvious that this anime doesn't use it for the same reason.\\n\\n\r\nThat and the already really bad characterisation of the main characters mixed with everything else being mediocre and the series having a decently racist undertone towards America brought the series down from my original writing of 4 to 2.",
            "date": "2017-03-04T11:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 241848,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3016257.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/moonkingdomify",
                "username": "moonkingdomify"
            },
            "url": "https://myanimelist.net/reviews.php?id=241848"
        },
        {
            "content": "I am getting so sick of seeing people review anime they disliked. if you rate this anime a 1-5 you are lying to yourself and I hate you for failing to see the good in this show, and convincing people not to watch this show.\r\nthis anime has some of the best animated battles of all time. It's filled with humor which is not just gag humor. while the story has many plot holes or may accelerate rapidly overall this is a well made anime.\r\nif you enjoy cool super powers, want to see death on a game of thrones level, and are  looking for somecutting edge animation THIS IS FOR YOU.\\n\r\nART: 10/10 \\n\r\nSTORY: 7/10 \\n\r\nSOUND:7/10\\n\r\nCHARACHTER; 7/10 (there are many characters with unique personalities) \\n\r\nENJOYMENT:8/10 (there where many times I caught myself going \"NOOOO, I cant believe that just happened\", or just laughing out loud:)\\n\r\nOverall: 8/10. \\n\r\nit may not end up in your top 10 but if you are looking for a battle anime to binge watch this one is worth your time.\\n\r\nspecial thank you to OTAKU TRICKS on youtube who recommended this in a top 10 video.\\n",
            "date": "2017-02-10T10:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 240303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5931069.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ntnyfranky",
                "username": "ntnyfranky"
            },
            "url": "https://myanimelist.net/reviews.php?id=240303"
        },
        {
            "content": "Taboo Tattoo is one of those shows that starts with promise and then gets devastated by a poorly fitted pacing. The first few episodes set up a fun, if not hugely original, superpowers-and-conspiracy premise with more than enough material for 12 episodes, but gradually, and then faster and faster, it starts complicating things and rushing the exposition, frequently showing you things you have no hope of understanding and then slipping in the explanation for them later in a single line of dialogue or a flashback. If a good show sets you up with mysteries and anticipation, this one gives you FOMO - cause if youblink you're going to miss it.\\n\\n\r\nBy the end of one cour, the power levels have inflated 100-fold, every situation is fate-of-the-world-hangs-in-the-balance ungrounded in substance, and the running time is oversaturated with fight sequences. Characters enter, are seen doing things, and subsequently die with too little time for character development or understanding of their contributions to register. The cast is quite large and while it does manage to set up character relationships, they are tenuous. At times it feels like a PV of something that was more properly developed, with a lot of stuff happening set to music or voiceover.\\n\\n\r\nAnd it's too bad. There is a lot of good material here that doesn't add up. The fights are well-made and can usually be followed pretty well. The detail of the animation only gets a little bit impacted towards the end, and there are a lot of cool character moments to be found. Some of the soundtrack, along with the setting's shadowy conspiracy and top-secret research, gave me a \"Deus Ex\" vibe. And it has a sprinkling of fanservice, which could have been done pretty well but like everything else is incredibly rushed, often being inserted directly into the middle of one of those high-stakes fight scenes.",
            "date": "2016-09-22T04:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 229793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=229793"
        },
        {
            "content": "I’m torn about this one. In the beginning, I understood that Taboo Tattoo was going to be cliched and predictable. But the were all the right cliches so I thought it would be a fun guilty pleasure. A bit of graphic violence, some fan service with a hint of comedy. and it was for the first eight episodes. But in the last four suddenly this incomprehensible story develops and Seiji’s one note character shifts from hero of justice fighting for what's right to...well, I’m not going to spoil it here. I’ll just say his character develops in a way that I thought was inconsistent withhis character (is it just me or does that sound redundant?). On the other hand, it’s nice to see characters having to change and grow with the situation they’re in. The art, character design and sound are good, so technically it’s a hit. But the story drowns in itself towards the end. Like it’s 24 episodes of material only greenlit for 12. So they completed the first eight episodes, skipped the next eight and compressed the rest into the last four. I hate to review anime by comparison but I’m reminded of Big Order (both were fanservice heavy and granted people powers with little explanation in order for them to battle one another), an anime I like FAR less than Taboo Tattoo, so it has to rate higher than that.  But was Taboo Tattoo really any good? If someone were to ask me should they watch it, I’d reply, “Only if you don’t have anything better to watch.” But is that fair? It’s not like it was promising anything more than it delivered. So I guess, it is what it is; average at it’s peak.",
            "date": "2016-09-20T14:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 229644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=229644"
        },
        {
            "content": "Taboo Tattoo was a pain for the eyes because of two main reasons: \r\n1 - The main character is nothing more and nothing less than a \"tool\". He is a mere device that aids people accomplish their tasks. Saying that he was used or manipulated would be too much of a praise. \r\n2 - I honestly don't know what they wanted to do with the story, but I know they seriously failed. Not only it progresses too fast, but the conclusions have no meaning and are barely satisfying.\r\nThis was labeled seinen, but it is more like a failed shounen. I have to praise the authorfor getting this pile of shit turned into an anime, honestly. The reason why they even considered making it into an anime is beyond me. \\n\\n\r\nFor anyone who wants to watch this anime, trust me, don't. This isn't worth wasting your time.",
            "date": "2018-06-21T16:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 281790,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5117902.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ittou_Shura_",
                "username": "Ittou_Shura_"
            },
            "url": "https://myanimelist.net/reviews.php?id=281790"
        },
        {
            "content": "Basically the only good things about this anime is the voice acting/sound/animation.\r\nLike most reviews in here have said, the story is too rushed, i'm sure it's more fleshed out in the manga but it's still mediocre at best, it tries to tackle overused tropes and puts an original take on it however that doesn't work well, the execution is just poor, killing off characters for shock value is simply pathetic at least in the anime, the relationships between characters are very superficial 12 episodes weren't enough to expand on that, every episode you lose track of what happened in the last until the very fewlast episodes, only those seem connected.\\n\r\nbullshit power ups the protagonist recieves against the already superior final villain. Overall a trainwreck.",
            "date": "2017-08-20T06:17:00+00:00",
            "helpful_count": 0,
            "mal_id": 255866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4874999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Rai_jin",
                "username": "Rai_jin"
            },
            "url": "https://myanimelist.net/reviews.php?id=255866"
        }
    ]
]