[
    [
        {
            "content": "I don't know if I have any other score but 8 to judge everything in this anime. It's a good anime, but not outstanding either. \r\nIt's a continuation of Hamatora and it picked up things right away after that disturbing ending in season 1. Less comedies and humorous cases, more main plot. Now Art - our friendly, sweet police officer becomes antagonist and ready to kill Nice - our main protagonist anytime. It sounds so cliche, but also entertaining and evokes our curiosity. Although, sometimes I can't help but laugh at Art's action, wanting to kill but running away when he definitely has chance tokill Nice. To me, the characters are easily overshadowed by the conflict, and I could care less about Honey's background or Birthday's background. \\n\\n\r\nThe theme is still revolve around \"Equality\", but now is in the opposite way of season 1. Instead of making people that inferior go higher, we make the superior go down. The plot still has many mysteries, as \"Why does Nice not suppose to exist?\" and \"Why is Art doing this?\", there is also a question leftover from season 1 \"What did Moral tell Art?\". The name of this season means \"Reply\" so sooner or later, we can get the answers for everything. Episode 9 already answers some, like Hajime's past and the causes for the side effects of Minimum Holders in Cafe Nowhere. There are also interesting plot twists regard Nice and untouched characters as Master and Koneko. It build a bridge to connect season 1 and 2 perfectly, I would say. Also, more deaths and painful moments that somehow makes it so hard to watch.\\n\\n\r\nSeason 2 is probably darker, but we also have episode like 8 to soften the mood. And there are still case serve as parodies and sarcasms to anime (Like Hikaru's case - a sarcasm to Harem Anime) that fun to watch. \\n\\n\r\nThe characters, though they are somehow plain and uninteresting, they have flaws and easy for the viewers to connect them with themselves. Like Murasaki, who that has power but still feels inferior to Nice and even Art - who has no power at all, and his jealousy comes to an extent that he hits and shoot Art out of control, just to release his anger. These people are not perfect and have two sides.\\n\\n\r\nThe music is nice, but nothing is really special. The OST is kind of plain, the Opening is tuny, the Ending is melancholy. The animation is better than season 1, though it lost the unique in coloring and effect of season 1. The only thing I can hate about the animation are those annoying changing scenes every 5 minutes. \\n\\n\r\nSo, this is the show that has seriousness and stupidness at the same time. If you want to try something new, try this.\\n\\n",
            "date": "2014-08-31T18:57:00+00:00",
            "helpful_count": 54,
            "mal_id": 158683,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320833.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/glaceon_cute",
                "username": "glaceon_cute"
            },
            "url": "https://myanimelist.net/reviews.php?id=158683"
        },
        {
            "content": "[EDIT AS OF 9/23/14: So it finished.  I liked the last episode.  The final 3 episodes that aired after I reviewed were pretty decent compared to the rest of the show.  That being said, they don't make up for a lot of what happened before them.  The score is now 4/10.\r\n[EDIT AS OF 9/15/14: So episode 11 just happened.  Episode 11 (and 9) are great examples of how good the series COULD be.  Why all episodes aren't the qualities of these two, I couldn't tell you.  But if Re:_ Hamatora concludes with the same strength as episode 11,and maybe intelligently, I may review my review-- I have to say, Re:_ Hamatora surprised me with that episode.  Does it make up for everything else I pointed out up until now?  Absolutely not.] \\n\\n\r\nI didn't see any reviews of Re:_ Hamatora that best fit how I take the series, so here's my go at it.  If you disagree with anything I say, please tell me.  I would love to have my opinion changed about Re:_ Hamatora, though I haven't the slightest idea how it will be done.  (Note: I'll try to keep the discussion to only the second cour.) (Also note that while this show isn't finished, I've seen enough to get a sense of the show.  Especially after the first season.)\\n\\n\r\nRe:_ Hamatora is the second season (well, 2nd part of a split-cour) of Hamatora, a story that appears similar to Darker than Black at first.  I had high hopes for the show- the art was interesting, the music was pretty good, and the premise was interesting, to say the least.  Sadly, it fell flat.  In my opinion, here's why:\\n\\n\r\n[ART: 5]\\n\\n\r\nThe first season had some really cool art early on.  Every time I watched the opening I sort of felt like I was on an acid trip.  Despite Hamatora's colorful approach, the art isn't really all that great, but at the same time, it's not terrible.  Pretty much the definition of mediocre.  Inconsistencies here and there are understandable (we're obviously not watching the BD or anything) but the art style itself isn't all that interesting.    \\n\\n\r\n[SOUND: 7]\\n\\n\r\nPretty much the only thing I like about both seasons.  Re:_ Hamatora has a pretty awesome OP, not to mention a fairly catchy ED.  Asides from that, the music throughout is played quite well.  I never felt bombarded by music playing during each and every moment.  And I liked the music to boot.\\n\\n\r\n[CHARACTER: 3]\\n\\n\r\nFinally, trouble's a' brewin.  Re:_ Hamatora really falls flat on its characters.  All of our characters are fairly one-dimensional, a problem in both seasons.  Nice is the M.C. who will win no matter what.  Murasaki is the friendly rival who always is trying to get better.  Art would carry the show if he didn't annoy me so much.  He gets pretty badass, but Art's actions don't exactly have motivation now (and just leave us asking \"WHY?!\"), but from what the show has given us so far I doubt it will be a very good reason.  The addition of Honey felt sort of forced (1st season), but hey, why not?\\n\\n\r\nHajime is standable as the show's best character.  Sure, you have your trope of the small, hungry girl, but the show doesn't shove that down your throat too much.  Her backstory is cool and somewhat intriguing.  If every episode was the great quality I saw in her backstory episode this season, this would be a VERYYYY different review.\\n\\n\r\n[STORY: 3]\\n\\n\r\nA show REALLY has to annoy me to get any worse than this.  Re:_ Hamatora has a lot of problems with its storytelling.  Let's get an especially glaring issue that only appeared this season: THE GOD DAMNED TRANSITIONS.  I swear that they were only put in because all the episodes weren't long enough.  \\n\\n\r\nAnother glaring problem: why did we get filler [EDIT: by filler, I don't mean non-canon, I mean not contributing to the overall plot.  I use it for them interchangeably, however wrong I am (sorry).] episodes?  They don't add to the enjoyment at all, and what's even worse, this is a 24 EPISODE SERIES.\\n\\n\r\nNow, on to the actual story.  The first season quickly proved that, excuse the cliché, \"we weren't going anywhere fast.\"  I hoped that Re:_ Hamatora would maybe attempt to break this pattern, but unfortunately, it didn't.  From the last episode of the first cour to now, you could probably fit all that happened RELATING TO THE ACTUAL PLOT in 4 episodes.  Sure, I'm pulling that number out of my ass, but it's probably not all that wrong.  As of right now, 9 episodes have aired.  Not a lot has happened.  These last 3 episodes are either going to leave us unsatisfied or we're going to get 3 episodes that try to tell us more than an Evangelion fan on speed contrasting the original series versus the rebuild.\\n\\n\r\nYet another problem here (see a pattern?) is that the show takes it self way too seriously.  I've had to pause an episode from time to time to take a breather from all the pseudo-philosophical bullshit it was spouting one moment, then be subjected to more mindless filler.\\n\\n\r\n[ENJOYMENT: 4]\\n\\n\r\nMaybe I'm slightly masochistic but I slightly liked watching this trainwreck of a show.  I like watching bad anime-- it makes me appreciate the good ones more. \\n\\n\r\n[OVERALL: 3]\\n\\n\r\nRe:_ Hamatora really fell flat, which wasn't all that surprising after the first season.  I would not recommend this show to anyone in search of something good-- but maybe to someone who wants to watch something with a good premise fall flat.",
            "date": "2014-09-10T17:13:00+00:00",
            "helpful_count": 52,
            "mal_id": 159841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686559.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/fullmetalgeass",
                "username": "fullmetalgeass"
            },
            "url": "https://myanimelist.net/reviews.php?id=159841"
        },
        {
            "content": "The sequel of Hamatora The Animation completely exceed my expectation, the series is truly different from its prequel and different in terms of good.\r\nOne of the massive different that created in Re:␣Hamatora is the story orientation, Re:␣Hamatora have clearer story orientation than its prequel. The main plot of the story is visible,  the story evolves nicely and keeps focusing to the main plot itself. It maybe not the best that exist, but the plot manage to balance the story. One more thing that we should notice that the sequel appeals more to the mystery instead the comedy. So the main attraction has changed tothe mystery. While the positive is lying in the ground, the negative is playing in the back scenes. Re:_Hamatora have some plot holes here and there which are too bad.\\n\\n\r\nLike modern anime these days, the animation is decent. The animation of Re:_Hamatora is less colorful than its prequel and has the darker feeling than it's prequel. But the good news is no need to suffer that series of contrast anymore!\\n\\n\r\nWhat can I say about the sound? It's quite decent, the seiyuu is doing a fairly good job. I should say that the Opening song \"Sen no Tsubasa\" is successfully beating my heart with its beat... while the ending is ordinary.\\n\\n\r\nWhile the story has a magnificent job to save the anime, the character is a bit flat. There are many unused supporting characters in Re:_Hamatora, there is minimum development between these characters. Our main antagonist motive is very weak while others are fine.\\n\\n\r\nIt was enjoyable, not the most enjoyable anime but can fill you with excitement and its jocularity.\\n\\n\r\nIn the end, Re:_Hamatora quite succeeds in saving its prequel from the apocalypse, if you want to watch an anime with Super Power filled with mysteries that lies hidden within the stories, then it's for you.\\n",
            "date": "2014-12-25T04:44:00+00:00",
            "helpful_count": 41,
            "mal_id": 174211,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=174211"
        },
        {
            "content": "The first season ended with a huge cliff hanger, now this seasons completes the previous story. And it was a good, unlike the previous season where the main characters are just doing random job requests, in this season you can relate more to the characters themselves as we get to see their backgrounds and know more about their past and who they really are, also you can finally notice a little bit of a romantic feeling between Nice and Hajime which I am eternally grateful! \r\nNow for the story, the great thing is the events became more polished and the story began to sidestep randomnessand converge into one main goal. However the thing lacking here is a bit of spice and uniqueness in the villain's characters, I found most of them rather dull and clichéd, but they still delivered the whole job well. Now what also changed this season is the atmosphere, the pace increases a lot, things get more serious, the characters go through tight situations, etc.. Still the show is able to keep the comedy going and maintain a pleasant and enjoyable mood as usual.\\n\\n\r\nThe art: the graphics are still good, just the colors became less bright, like the character's eyes and hair colors have changed a bit, it isn't that much obvious though. The animation gets better but is still considered average for a 2014 anime.  \\n\\n\r\nI still consider this an average anime, if you're expecting it to be a master piece, then don't get your hopes up, just an enjoyable show that doesn't take it self too seriously nor too lightly, I honestly loved watching every episode.  \\n",
            "date": "2014-09-20T15:45:00+00:00",
            "helpful_count": 24,
            "mal_id": 161235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3876035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Larinel",
                "username": "Larinel"
            },
            "url": "https://myanimelist.net/reviews.php?id=161235"
        },
        {
            "content": "I dont normally write reviews but I thought it'd be good to review this since i saw many people rating it less than 8 which is quite surprising for me since i enjoyed this very much.\r\nStory - 8\r\nThe story was outstanding but the idea of people having powers and so is used quite a lot. however the use of this idea was amazing. It keeps you always at the edge of your seat and i haven't been into an anime for a long time. normally when a sad scene happens i wouldnt react as much as this anime made me. This might be not onlybecause of the story but also because of the characters.\\n\\n\r\nCharacter - 9\\n\r\nI got pretty attached to the characters really fast and they were all quite lovable. however it didnt explain why some characters were there until the end of the anime which made me always ask questions to myself about the characters and didn't give them much care, which annoyed me, but not a lot.\\n\\n\r\nArt - 10\\n\r\nThe art was really awesome. It was very colorful unlike any other anime, which you'd see in the comments while watching it. I liked their use of colors and the i didn't really find any flaw in the art. everything was drawn really well.\\n\\n\r\nEnjoyment - 10\\n\r\nThis anime, as i said before, was very exciting. It was never boring to watch and it was really funny. \\n\\n\r\nSound - 9\\n\r\nI think the soundtrack for this anime was one of my favourite things about it. The OP and ED were catchy n i lovedd them. however sometimes but only rarely theres music added to a scene which kind of doesnt match the scene. this only happened in episodes which didnt have action scenes and stuff so yeah it was not a big problem at all.\\n\\n\r\nOverall - 9\\n\r\nThere are many better anime  than this but this was awesome to watch. finished both seasons in less than two days. this made me laugh a lot and i kind of finished both seasons this fast only because of that. or else if it was all dark n sad i wouldnt have completed it that fast because i needed a break from dark anime n stuff cuz i watched this after the 26th episode of death note. anyways this is an anime id recommend for times like i mentioned even though its not one of the best anime out there.\\n\r\none VERY annoying thing which anyone who watched this would notice, are the transitions between the scenes which they added this season. I dont see any use for them tbh but they werent that bad so its fine\\n\\n\r\nI hope this was helpful :) \\n\\n",
            "date": "2016-04-01T01:57:00+00:00",
            "helpful_count": 21,
            "mal_id": 215011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiroiwayagi",
                "username": "Shiroiwayagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=215011"
        },
        {
            "content": "After watching the second season of Hamatora (or Re:_Hamatora), I would say it made some steps to improve from it's predecessor, but it also made some steps back.\r\nNow, TL;DR for those who are too lazy to read:\r\nPros:\r\n+ Story is more tighter than the first season\r\n+ Character backstories are revealed in this season\r\n+ Good OP,ED\r\n+ Funny characters and situations\r\nCons:\r\n- Still horribly cliché (predictable)\r\n- Less colorful animation than the first season\r\n- Most of the casts are uninteresting characters\r\nIn-depth review (*MINOR SPOILERS*):\r\nStory: 7\r\nThe story is about the detective agency Hamatora, which consists of people with Minimums, a kind of power that activates when a certain condition is achieved. Like the last season, the theme of this anime is still equality, which deals with problems between the Minimum Holders (people with Minimums) and the normal Humans.\\n\\n\r\nUnlike the last season, the plot in this season is more tight, which is a good thing, instead of the last season's random detective work. Like the last season, the anime is still horribly cliché, but it still has funny situations that makes the anime enjoyable.\\n\\n\r\nArt & Animation : 7\\n\r\nThe art is pretty standard in 2014. Characters are well detailed and enviroment is good. the shading is improved from the first season, fight scenes are well-made, but the colorful animation when people uses their minimums in the first season is gone, making it a lot less fun than the the first season.\\n\\n\r\nThere is also that annoying animation when ever they changes the scene which reduces a lot of tension in certain situations.\\n\\n\r\nSound: 7\\n\r\nVoice acting is brilliant. Kamiya Hiroshi's performance as Art is as good as always. Other character voices are well portrayed. OP is awesome and catchy and the ED is pretty emotional. BGM music is pretty generic though.\\n\\n\r\nCharacters: 7\\n\r\nCharacters in Hamatora is a bit uninteresting. But some of them are good and is really relatable. Murasaki is person with very strong powers but is still jealous with Nice. Art is doing everything to fufill his brother's wish. \\n\\n\r\nEnjoyment: 7\\n\r\nIt was a pretty good watch. Funny and enjoyable though I predicted exactly what would happen.\\n\\n\r\nOverall: 7\\n\r\nIn conclusion, Re:_Hamatora is good, but not great. if you liked the first season, you will like this. If you're the type who wants a lot of action, then you better find another anime. \\n\\n\\n\\n\\n",
            "date": "2014-11-08T04:58:00+00:00",
            "helpful_count": 12,
            "mal_id": 167857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spiwar",
                "username": "spiwar"
            },
            "url": "https://myanimelist.net/reviews.php?id=167857"
        },
        {
            "content": "Well, now that we are at the end, I have to say that I loved the previous season of this franchise, but I hate this season of it.\r\nThis season was a lot more flash than substance, and had really odd pacing. Even after they explained some things at the end, I still do not accept it. My disbelief was not suspended, it was, rather, enhanced, with each segment of the story. \r\nOn the other hand, perhaps it sort of reflects the times. Perhaps attention is drained by flashy graphics and incoherent garbage is dumped into our psyche, where it coheres into a wellspring of instability,contributing to the widespread nature of depression and poor choices. \\n\\n\r\nThat sort of \"well, sure, a lot of people were harmed because of me but it is okay once I have a few friends, life goes on (for me) and who cares about what I did before, those people were not main characters\" attitude is a bit like how we watch the news about how people are prevented from getting an education and then prevent ourselves from getting an education because we wasted all our mental energy watching the news, then worrying about it... but then feel it is okay because we have friends.\\n\\n\r\nBeing a serial killer and mass murderer really should never be okay, even in a fantasy setting. There should be at least one person who wants to make the world better, but none of the characters consistently do this. Perhaps we should forgive and forget everything, if we are sure that there has been true change, but there is no evidence that there was such character growth, at all.\\n\\n\r\nEven soldiers and police officers can often have difficulty coming to term with taking lives, which is appropriate. It should be a hard thing to do, even if the enemy deserves it. So to have a story where they really seem not to care about all the casualties, well, I hope that humanity doesn't really think human life is cheap and disposable.\\n\\n\r\nI hope that we care about the innocent people who don't even know what is going on, through no fault of their own, and would gladly help to change things for the better, if given the opportunity.\\n\\n\r\nSo, this is one anime that triggered my indignation, and has no redeeming values for me. Even more so because the first series was a lot better, and a lot more hopeful. I keep trying to come up with some excuse for them to do this, but I think they had enough time and budget that it was not a simple pacing error -- the message really seems to be that, if you are with the right crowd, then it doesn't matter how evil you are, how much harm you cause -- you will be fine, and everyone will love you anyhow.\\n\\n\r\nSo, for me, worse story ever. \\n\\n",
            "date": "2014-09-28T20:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 162811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=162811"
        },
        {
            "content": "As a continuation to the Hamatora, this has turned out to be a very good anime!\r\nI shall make a short Review summarizing the key/main parts of this Anime.\r\nStory [ 9 ]\r\nThough the anime is pretty short, 12 episodes to say the least. . .It has had it's ups and downs when it comes to the Story. Throughout this anime the characters have been more developed in a way of such that you can pretty much distinguish the characteristics between all of them. The Story has continued from 'Hamatora', and starts off right after Morale dies. Goes on from there with Art becoming the new Antagonistand making such efforts to try and Kill Nice. However! - It goes from there with Art's new intentions to try obtain an even bigger goal. . .\\n\\n\r\nArt [ 10 ]\\n\\n\r\nI loved all of this anime, especially when it comes to the graphics (art). So...I think that the graphics in this are very well done, you can see every bit of definition of the character..like all of it's features. I'm not very good at my vocab but i've seen many Anime's. Those other anime's don't compare to this, the transitions between each scene is very good, I've seen nothing like it and you'd think it'd be pretty obvious.\\n\\n\r\nSound [ 8 ]\\n\\n\r\nI didn't really hear much of any sound tracks aside from the Opening and Endings. . . Not really much of any battle-music, but it recieved an 8 Because i think that this anime does deserve it for the music it already has.\\n\\n\r\nCharacter [ 10 ]\\n\\n\r\nVery good Character development between each of the characters. You see much more of their background through flashbacks of when they were probably little toddlers back at their training academy when they were trying to practice / discover their minimums. \\n\r\nI give this a 10 because of that, and also how each of their characteristics are defined throughout this anime, You can see how well they act with their minimums when trying to solve a case, and you can also see how well they act just living in the breeze - without fighting.\\n\\n\r\nEnjoyment [ 10 ] \\n\\n\r\nI loved this anime so much and was very dissapointed when it was only a 12 episode long anime. I enjoyed it to the fullest. It has this sort of vibe that you'd get from watching those upper class anime's like Hunter x Hunter or One piece or Naruto. I hope they come out with a 3rd season, the comedy, action scenes, Epic characters, this anime is just a -has-to-watch- anime!\\n\\n\r\nOverall [ 10 ]\\n\\n\r\nYeah, I gave it a 10, and i'm very honest about it as well. This anime, even though it's pretty short . . . has alot of special things about it that would make it worthy of recieving a 10/10 Overall!\\n\\n\r\nI was tempted to give it a 9/10 but that was only because i solely was sad that it was only going to be a 12 episode anime. However, throughout this anime whilst the characters grew each episode...i just kept wanting to see more and that's why i gave it a 10/10. From the Story - to - Overall, definitely deserves it in my opinion.",
            "date": "2014-09-22T20:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 161665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103311.jpg",
                "scores": {
                    "animation": 0,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/B3astpwn",
                "username": "B3astpwn"
            },
            "url": "https://myanimelist.net/reviews.php?id=161665"
        },
        {
            "content": "This is the only anime that disturbs me everytime on while showering until season II came out. Well, seeing that the season I leaves us in a cliffhanger where Nice was shot by Art for unknown reason, who was supposed to be dead.\r\nOkay, first of all, I love Art. No, more than that, on the whole fiction world, he has the biggest respect I could ever give to a character. Even though knowing that he never utilized his minimum before, he still graduated at Facultas academy, which is really amazing considering the pressure put by his environment.\r\nEnough of that.\r\nThis anime, as a whole, always gotmy feeling dynamically. They always got me. Specially when someone's supposed to be dead but turns out that he's still alive. Sometimes it's hard to believe that it's still logical, but because of the attachment on the character, you just can't help but to feel relieve.\\n\r\nThere are light episodes and tragic episodes and they balance each other perfectly, which adds to the factors that makes this anime an amazing story.\\n\r\nThe one I like the most about this is that while making you creepily cry, is that after that, they'll sure to make you laugh. I found myself in a mess after watching the last episode.\\n\r\nThere are also moral lessons and somewhat just a nonsense that also makes sense that you can gain here.\\n\r\nWell, at most, this is undoubtedly worth and enjoyable to watch.",
            "date": "2014-09-23T14:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 161781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4119011.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MariyaEru",
                "username": "MariyaEru"
            },
            "url": "https://myanimelist.net/reviews.php?id=161781"
        },
        {
            "content": "Re:Hamatora is the sequel of Hamatora The Animation. The story continues from where it left off previously and deals with the consequences of the Yokohama incident, as well as the issues in society now that the Minimum holders are revealed. This season is the complete opposite of its prequel.\r\nThe mood has significantly changed. It is darker and the seriousness is a constant during most of the episodes. Interactions between characters are more mature and the overall theme has rather grim tones. Even the colors lack saturation and the heavier complex shadows additionally boost the expressiveness - in a way leading the viewer to the expectationthat a tragedy is about to unfold.\\n\\n\r\nOnly traces of the mess from the first season are notable. There is almost no randomness, no identity crisis and especially no extreme lack of originality in the production. The story progresses forward naturally and slowly, but diligently, answers most of the questions that were left a mystery at end of Hamatora The Animation. \\n\\n\r\nInner dialogue of the characters and psychological struggle take the spotlight in Re:Hamatora at the expense of philosophical messages addressed to the viewers. But even though the dominating emotions are negative, some comedy is still present at the right times and it is actually quite smoothly incorporated. A pleasant surprise is the overall good balance between delivered emotions in this season. Especially enjoyable is the slight hint of romance.\\n\\n\r\nOf course, overusing some visual gimmicks might displease the audience, but the used amount is negligible in comparison to the \"tricks\" from the first season. Besides Re:Hamatora gets better with each episode. Not soundwise - the soundtrack is okay and again fits well. Not the animation too, although it has undoubtedly evolved. Most notable is that the directing approach has changed and the tension that builds up is brilliantly resolved in the final episode. \\n\\n\r\nIn the end Re:Hamatora is a superior product compared to its predecessor. The show has found its identity, trimmed the unnecessary elements and focused on what it wants to deliver to the viewers. It is very likely that for most people it will be satisfying to watch.\\n\\n\\n\\n",
            "date": "2014-09-25T17:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 162187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487359.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FoxSpiritShrine",
                "username": "FoxSpiritShrine"
            },
            "url": "https://myanimelist.net/reviews.php?id=162187"
        },
        {
            "content": "This being the second season for Hamatora I was hoping it would be tied up nicely, you know all those niggling little questions you have and hatred you feel for characters you just know would be rectified if only you knew WHY!? why did they do that? As well as the all ungodly cliffhanger they left us with in the last season, thank goodness this was around to clear things up.\r\nWell, this season did not disappoint with answers, of course, you wish they'd all happen faster than they did but hey I suppose they had to make the season a decent length. \r\nThe story hassomewhat of a slower if not slightly pace than the first stopping for the comedic episode, which doesn't fail to make me laugh. There's more backstory to be added and you finally get why the bad guy is bad! Isn't that what you stuck around for? \\n\r\nBlood pumping edgy moments that keep you on the edge of your seat as you hope to not loose a member of this beloved team, Hamatora wouldn't be the same without Nice, Hajime or even Birthday, right? Watch this series to see the \"final destination\" (as it were) for our \"heroes\"  will the end me as sweet as honey or a beastly tragedy I think it's worth your time to find out! \\n\\n\r\n(P.s. sorry for the puns it was too good an opportunity to leave out)\\n\\n\r\nI hope you enjoy the show, check out season 1. Hamatora The Animation, if none of this is making any sense to you at all. :)",
            "date": "2016-11-12T12:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 233651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987746.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LazyLeafeon",
                "username": "LazyLeafeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=233651"
        },
        {
            "content": "Review for both Hamatora and Re:Hamatora.\r\nNote that I'll use [] to put something that could be an spoiler, though I won't reveal major plot parts.\r\nThis was, actually, my favourite show from its year... for the wrong reasons.\r\nI'm not even kidding.\r\n███STORY ███\r\nTo make it short, the story is full of good ideas, but the execution is awful. Everytime Hamatora manages to do something right, making you hope that the show will become good, it screw up EVERYTHING the next episode. An example of this are those episodes where a character dies. Is pretty obvious that the director has no idea about how to handle drama, because:\r\n1-Hisdrama is stupid.\\n\r\n2-Does a good drama and then fills the screen with jokes, so the sadness that you're supposed to feel disappears.\\n\r\nI swear I was really mad after that episode where X character dies. I was truly heartbroken, and then, the next episode they gave me a BEACH FILLER. WHY? The characters didn't even discuss that X died. They just went to beach. Mr. Director, are you sure you know what are you doing? I guess no since you didn't do this once, but twice.\\n\r\nTalking further about this death topic, every death is terribly handled. It tries hard to be something shocking, but it barely is because no character actually dies when killed. And when someone finally manages to die, the death is so forced that you end complaining about how unnecessary that was.\\n\\n\r\nRelating other problems, this show tries too hard to develop its characters, but fails at the matter. Uses flashback totally out of places, introducing cliches situation to force you to sympathize the characters but... it doesn't work. It's not like the characters are annoying (they're not likable either), but everytime they tried to show me the story of a character I felt like something was missing.\\n\\n\r\nNow, let's talk about the cringeworthy writting. God, I really had a good time with it. \\n\r\nI know that friendship is something, but seriously. If my best friend is constantly trying to kill me, then he stop being my best friend at the second. Like really, Nice has the worst friends in the story of Earth. \\n\r\nAnd characters constantly contradict themselves with what they want. Let's see an example:\\n\r\n[Character Z wants to kill character X. Character Y knows it, and KNOWING it notices that he actually hates X and sympathizes with Z, so he wants to join him now.\\n\r\nY: Dude, I feel you. Let me join your cause.\\n\r\nZ: Great! I'm going to kill X.\\n\r\nY: What? You can't kill X. I quit this shit!\\n\r\nThen Y beats the shit out of Z because the latter wants to kill X. The end.\\n\r\n(After this, Y hating X was never mentioned again. In fact, they endend as close friends).]\\n\r\nAnd how can we forget that time when A went to drink tea with B, KNOWING that B killed his best friend? Obviously, everything had a bad end.\\n\r\nAnd let's not talk about plot devices and Deus Ex Machina. They're everywhere.\\n\\n\r\nBut let me say something positive about the story. The equality stuff was really insteresting and fun to watch. Too bad it wasn't handled correctly, because a few episodes were pretty good by they own. Is sad to see such potential wasted.\\n\\n\r\n███CHARACTERS ███\\n\\n\r\nNice: our main character. He's actually the most powerful Minimun Holder out there and beat the shit out of every villain with no effort. Has no relevants imperfections, and to be honest, he's a bordeline Gary Stu. At the end of season 1, the urge to punch him in the face was so strong that I was actually happy with that ending. Seriously, his speech about how people without minimuns shouldn't envy the one with powers almost made me vomit. Of course you wouldn't know nothing about envy because you're almost perfect, you piece of shit. \\n\r\nLuckily, he stops being a bordeline Gary Stu in Season 2 and becomes more likable. But his amount of plot armor is really annoying.\\n\\n\r\nArt: actually a character you can sympathize with. Contrary to Nice, his Minimun skills were totally shit, so everything he gained so far was thanks to his efforts. Even so, he still feels bad for no having a minimun, which is pretty relatable. The fact that he was a normal human doing useful stuff in a world filled with superpowers made him likable. He was even husbando tier.\\n\r\nThen Season 2 happened...\\n\r\nArt started as a good anti-villain, clearly avoiding unnecessary killing and the sort, following the pattern of a nice dude that must do something bad for a hidden good reason. Sadly, Seiji Kishi liked the character so much that thought that EVERYTHING in the show has to be related to him. Seriously, he stole all the screen for himself in an annoying way. Everytime something relevant happened Art appeared, did something cool and then disappeared, because that's what badass characters do. When he became a Jesus rip-off (like seriously, I'm not even kidding) I knew that the character already went to shit. \\n\r\nIn the end, he became the bordeline Gary Stu of season 2, competing with Nice for who has the biggest plot armor. \\n\\n\r\nMoral: he was the main villain in S1, so he deserves a spotlight in this review. I'll make it short: HE'S SHIT. Cheesy as hell and looks like a fusion between Makishima (Psycho Pass) and Ukyo (Amnesia). He's the most generic villain I've seen in a chinese cartoon, and has an obsession with Nice, probably because he masturbates thinking of him every night. Nothing else to say, Hamatora is better without him.\\n\\n\r\nEvery other character is irrelevant. Too one dimensional to even care.\\n\\n\r\n███ART (Insert pun related to the character here)███\\n\\n\r\nIt's bad in Season 1, full of quality and that filter is atrocious. Animation is decent at its best.\\n\\n\r\nSeason 2 is a little better, but not remarkable.\\n\\n\r\nMusic is not remarkable either, but the OPs and ED are good. The ost of the episodes is not very memorable, though. I'm unable to recall any song.\\n\\n\r\n███ENJOYMENT ███\\n\\n\r\nWhere this shines. This show made laugh, rage, cringe and many other emotions that I'm expecting to have while watching a chinese cartoon. I was truly eagerly waiting every Tuesday for another episode. Yeah, everything happening in the screen was a mess, but an enjoyable mess. I gladly watch this again a second (or third time).\\n\r\nThe best trainwreck of its year.\\n\\n\r\n███OVERALL ███\\n\\n\r\nOnly watch this if you like to turn off your brain to enjoy a show of the \"so bad it's good\" type. \\n",
            "date": "2016-05-05T19:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 217956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4892133.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Cishet",
                "username": "Cishet"
            },
            "url": "https://myanimelist.net/reviews.php?id=217956"
        },
        {
            "content": "It is like someone mixed Charlotte, Shinrei Tantei Yakumo and Angel Beats!\r\nMost important point is we understand that Seiji Kishi indicates himself with success in his animes. Strong characters, strong story. A couple episodes were boring but at last you take a deep breathe and say \"well that went well... no, more then well, that was perfect ending.\" I stopped and think some of episodes about dropping but when even though some of them are boring if you continue and finish the anime you meet with a masterpiece.",
            "date": "2015-08-14T12:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 196161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4528229.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shirogakita",
                "username": "shirogakita"
            },
            "url": "https://myanimelist.net/reviews.php?id=196161"
        },
        {
            "content": "Re:_ Hamatora is a sequel to Hamatora, and it's even better than the first season. I have to be honest that the first season left such a huge cliffhanger, and Season 2 will answer all those questions you have in mind. This anime deserves more love, it's underrated. This definitely goes to one of my top 5 animes. Why?\r\nStory: [9]\r\nThe creators know how to connect to you and your emotions. This is one of Hamatora's greatest points. It isn't rushed, nor is it too slow.\r\nAlthough, during the last three episodes, things felt a little bit rushed.  They could've slowed things down a bit. Thelast few episodes felt like they were trying to fit in all the events. They could've done better.\\n\\n\r\nOn the other hand, this anime is a rollercoaster ride. As I've said earlier, the creators know how to hit you with emotions. Other episodes will make you laugh, others will make you despise characters, while other episodes will make you stressed and fill your mind with thoughts. It knows how to balance things, it's unique in its own way.\\n\\n\\n\r\nArt: [10]\\n\r\nThe anime itself is really colorful and full of life, and at the same time really dark and sad. As I've said, Hamatora knows how to balance, and one of the things they know how to balance is the Art Style. They know when it's necessary to create a dark atmosphere/feel or when it's not.\\n\\n\\n\r\nSound: [8]\\n\r\nI honestly loved the opening and ending songs. Aside from that, I think they could've used better and more remarkable background music in some scenes.\\n\\n\\n\r\nCharacter: [10]\\n\r\nAgain, one of Hamatora's strongest points: Character Development. I love how they showed everyone's backstory. You get to know each character more.\\n\\n\\n\r\nEnjoyment: [9]\\n\r\nIt's something I would always look forward to watch.\\n\r\nHowever, what made the Enjoyment Rate a 9/10 is the transition scene. The transition scene on Season 2 was bad. Perhaps a different sound would be better, or a different background. I'm not a fan of the transition scene.\\n\\n\\n\r\nOverall: [10]\\n\r\nSo overall? still a 10! Names, felt weird at first. You'll get really unusual names, or odd. \\n\\n\r\nThe ending's really good. I've never felt this kind of satisfaction.\\n\r\nThis series made me feel so many emotions, and that's what I love about it! I love how they paid attention to the details in the ending. Flaws here and there, but overall, this anime is still worth a try.\\n\\n",
            "date": "2016-08-10T00:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 226372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5602639.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/obtain",
                "username": "obtain"
            },
            "url": "https://myanimelist.net/reviews.php?id=226372"
        },
        {
            "content": "Well, let's start w/ the story first, so I can give my opinion clearer after explain the situation of the series. It's quite different yet still related w/ Hamatora The Animation Series. Re:_Hamatora focuses on different problems and main characters. Let's say it's about Hajime-chan background, also the 1st time she met Nice-kun. This background connects w/ Art and his goal to maintain what's left back there. Along the story progresses, there is Saikyou involved for more, and Freemum.\r\n    The story itself sounds a bit more complicated, nevertheless that's what makes the series intriguing. This concept is so solid, and way betterthe graphics here. The viewers will not just feel the up and down from battle scenes of Minimum Holders superiority. Also, the feelings wrapped within story. What annoys me sometimes are, many different situations and places in a story, so few sections cut off often. If I may compare, the cut off Re:_Hamatora is more pleasant than Hamatora The Animation, but still...err~well they did their best.\\n\\n\r\n    Music for both opening and ending song are good. While the rhythmic of opening song is keen, the ending song is slower and mellow. The opening song titled Sen no Tsubasa is a collaboration between Livetune adding Takuro Sugawara. For the ending theme, performed by Ayami, Brand New World.\\n\\n\r\n    Characters are developing their improvement for the storyline and makes it complicated passionately. The cases and antagonist characters stormily the city for revolutionary age is wrapped nicely. We know deeper even about the side characters personality.\\n\\n\\n\r\nPersonally, I give this series 7 rate.\\n\r\nPros:\\n\r\nThe involvement of characters and storyline\\n\\n\r\nCons:\\n\r\nFocuses only to few characters\\n\r\nThe cut-off sections are odd\\n\\n\r\n*) Freemum is somewhat community contains of Minimum Holders gathers by the speech of Art w/ his hidden motive, and being use by Ishigami Shun'ichi who stands as the one, propose the idea of Yokohama being an area to provide freedom for Minimum Holders, then forced government to accept his demands.\\n\r\n*) Minimum Holders are humans w/ superiority biologically gifted. They are minorities who always be excommunicated by society. Their abilities are varies from such body regained, strength, speed, even supranatural matters.",
            "date": "2016-07-23T23:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 224810,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224810"
        },
        {
            "content": "I'm super happy that the second season was successful instead of it being a total dud compared to other second seasons I've watched. Right away I can say the animation definitely matured since the first season. The colors are a little more dull, giving the show a more ominous atmosphere, which played perfectly with the plot. \r\nThe plot was amazing. I loved how we got some more of Art, Nice, and Hajime's backstory. Even though I hated it, Art was a great villain. His motives were legit and understandable, unlike villains I have watched in the past. I really don't want to spoil the ending, so I'mjust going to say that it was FAR better than the first season's ending. THIS was the ending I was waiting for and I am so happy that the show ended the way that it did. \\n\\n\r\nAs for the music, I specifically liked the theme song. It always got me riled up for the episode because it was so upbeat and catchy. I always found myself dancing in my chair or slightly bobbing my head to the beat. That's when you know a theme song is good. \\n\\n\r\nOverall, this short series has really touched me and I'm very happy to have watched it and come to love the characters.",
            "date": "2017-02-19T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 240960,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240960"
        },
        {
            "content": "Story: Average\r\nHonestly, I was kind of disappointed about the plot armor's strength. AKA I didn't enjoy the fact that Art had survived. Twice. By some sort of miracle (especially the ending). \r\nThough the story uses plot armor, it's not as predictable as you would think neither is it too simple. What I think is a good characteristic of the Hamatora seasons are that they go at a pace which doesn't make much sense due to lack of information and explanation. Though it does sound bad, it pulls you in as you want answers to your questions like why Art wanted Nice dead (seen in ep.12of first season)\\n\\n\r\nArt: Good\\n\r\nMaybe it's due to budget or just lazy animators, I personally think that the still animations are derpy to the point that you would laugh at.\\n\r\nCharacter designs are unique in a sense that it fits their character. It is, however, upsetting to see the lack in variety of clothes. Though I would like to highlight Art in this season. In the first season, his design was showing that he's of a formal character. But with a simple switch without much change to the color scheme, it maintained the formal vibes but adding the sketchiness of it all.\\n\\n\r\nCharacter: Lovin' em \\n\r\nI absolutely respect animes that can hold many characters while showing a special personality for each of them. If you described a character briefly, you would still be able to narrow down to a specific character. \\n\r\nI like the small character development in Nice. He is portrayed as a empathetic person when it comes to jobs but relatively cold when it comes to the relationships of others. Because of how unique the characters are, there was no exact need for development. \\n\\n\r\nEnjoyment: One of my favorites without a doubt\\n\r\nI get easily impressed with stories that are told in such ways that doesn't really need character development and also doesn't need a really complicated climax to keep things entertaining. \\n\\n\r\nOverall: 8\\n\r\nFirst, I wouldn't recommend this to someone who had just started out anime. Second, I respect the style that this anime uses as it is quite hard to achieve.",
            "date": "2019-02-26T07:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 302501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7398099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zxnith",
                "username": "Zxnith"
            },
            "url": "https://myanimelist.net/reviews.php?id=302501"
        },
        {
            "content": "What do you get when you have good characters, a basic but interesting concept, pretty good art style, yet poor and cruddy writing? You have Re: Hamatora.\r\nRe: Hamatora is best compared to drinking a lukewarm cup of tea. It's not very pleasant, yet you still drink it. Though, with every few sips, you’ll find yourself pulling out a long grey hair from between your teeth, you look up to see the old sweaty man who made your tea, only to realise that this is, in fact, his hair. Yet you carry on drinking... and god knows why!\r\nThat is Re: Hamatora in a nutshell!!\r\nArt 5/10: \r\nTheart style and direction in Re: hamatora, well the whole franchise isn't anything too special. It's nice, bright and colourful but when it needed to it would dim down the mood and do a good job at laying out a nice and dark setting.\\n\\n\r\nThe general style of it is pretty unique, yet the character designs themselves are rather... \"anime generic\". Nothing really diverse about them at all. \\n\\n\r\nThis would have probably had a higher score, nothing more than a six, but it lost points mainly because of the transition scenes. Between each scene, they decided to place in this little one-second clip, where they show a brick-wall. Yep, quite literally, a brick wall. To be honest, you might as well stare at a brick wall in real life and find more enjoyment from that.\\n\\n\r\nAlong with it being boring it can also kill off the mood in some parts. At times this could have been something that works to their advantage, going from a dark scene to a happy go lucky one, but they didn't take that into consideration and placed these moments in as much as they could.\\n\\n\r\nProbably trying to fill up time in the anime seeing as nothing else can fill up that void. Why give us a few moments with characters when we can look at a brick wall.\\n\\n\r\nMusic 4/10: \\n\r\nThe opening song is probably the best thing you will see from this anime. So props to them on that! \\n\\n\r\nThe soundtrack in the show is pretty good though in some parts the music felt a bit too much and could have done with a more subtle tune.\\n\\n\r\nOverall the soundtrack in the show felt rather basic, with that in mind it should have come out with rounded five out of ten. Though it lost points because of, yet again, the god-awful transition scenes. During these scenes where the lovely brick wall is presented to us, it is accompanied by this annoying... screeching track.\\n\\n\r\nThey could have played us some nice music, perhaps bach cello suite 1. Nooooo... They clearly wanted to annoy us during these parts and placed the... screech. So they lost points for that. \\n\\n\r\nCharacter 4/10: Where do I begin with the cast. The characters are rather basic and mediocre. Yet for me, the biggest downfall was the lack of character development and the off-placed reactions they had.\\n\\n\r\nDuring moments in the show, something 'dramatic' would happen. After something like this, you'd expect a reaction from the characters involved. Yet their reactions tend to be... off or nonexistent in some cases. It will have you sitting there going. \"the heck is wrong with you? Why aren't you mad? Why are you okay with this?\" for the most part.\\n\\n\r\nAlong with that comes the lack of character development. Once again, in certain moments, they could have had some really good character development. There were perfect chances to create some real tension between the cast, yet they decided to not bother with this at all and pretend nothing had ever happened.\\n\\n\r\nThen was the random character backstory we had, this was something that should have happened during season one, but they deiced to try and tie it in someone in this season. It felt out of place and unneeded like they had nothing better to show us.\\n\\n\r\n~CoughCough~brickwall~Cough~\\n\\n\r\nThe only interesting character for me would have to be Art, a good guy gone bad. Yet half way through he just became plain annoying and I lost all interest in him.\\n\\n\r\nEnjoyment 4/10: I would have enjoyed the show, but the lack of development, the unnatural reactions and the god damn transition scenes have made me knock a lot of points off.\\n\\n\r\nIf this show had a different director, or writers or just anyone it would have probably come out a lot better than it has.\\n\\n\r\nAt best this will be an enjoyable series for someone that is new to anime, if you're not, it may be a waste of time. It's just another generic shounen yet it lacks heavily in a lot of areas.\\n\\n\r\nOverall 4/10: I kind of feel like I have wasted my time on this series, thankfully it is over now. I think I will pretend it never really happened and I might stare off at a brick wall for a while.",
            "date": "2015-12-29T05:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 207194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29674.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Rojo",
                "username": "Rojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=207194"
        },
        {
            "content": "This sequel saved the show!\r\nIn this 2nd season not really much different from the previous season but more good.\r\nSupporting characters gets much screentime in this sequel. \r\nCharacters development also got improvement.\r\nThere is 1 epidode full of comedy and running gags gave us relaxation after many fights and complicating cases.\r\nArt and music as usual, cool.\r\nComplication, one by one solved by the characters.\r\nI probably miss this show and wonder watch another sequel (if any).\r\nFor those who like or love shonen anime and or supernatural genre and lots of suspense, I suggest you to watch this show\r\nReally satisfied about this show after watch the sequel",
            "date": "2018-02-17T00:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 271701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5646570.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/m_alhafidz",
                "username": "m_alhafidz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271701"
        },
        {
            "content": "I must confess, I didn't finish this anime until very recently, even though I did start it around two years? (Around the same time I finished the first season).\r\nThe reason is, the transitions between scenes became very annoying and not enjoyable as much as the first season, however as I gave a second chance, I found out it was rare the number of episodes that had such transitions.\r\nThis story revolves a lot more around mystery and suspense, which was pretty enjoyable after the light approach of the first season. Also, the fact that it had an actual plot instead of being random jobs/cases per episode,were also a nice change, and made a lot more sense. I liked the way some characters were worked around, and their development.\\n\\n\r\nThe art style is simply beautiful, reminding me of Fate UBW and Fate Zero's style which is absolutely breathtaking. The animation is incredibly well made, even the fight scenes, instead of using CGI as some animes which make the fights look weird and not smooth at all - fortunately this is not the case for Re: Hamatora.\\n\\n\r\nEven though I did like the story and art, and the soundtrack wasn't bad either, I can't give higher in characters and enjoyment. Despite that a lot of characters are well developed, I wish they could have developed the stories of other characters, further, rather than only focus in Hajime, Nice and Art. Sure they are the most important characters of the story, however it would be nice to have others in the spotlight. Some traits of Nice's and Hajime's development didn't please me either, nor how they made Nice look completely hopeless on surviving (house chores and such) without Murasaki, basically putting Murasaki as a \"wife-character\" on several episodes instead of making use of his maturity, wisdom and Minimum. Sure he had his spotlight, but on the end they turned it a bit in comedy.\\n\r\nEnjoyment, can't go higher than 7, for what I mentioned (the transitions) as it made me put this on hold for several months. Not only that, the fact the story took so long to come to a conclusion (mainly the \"bad guys\" winning almost everything in every episode) would sometimes make me a bit bored, and as such I can't give much to the enjoyment.\\n\\n\r\nHowever, overall it was an anime that I enjoyed, and transitions aside, I liked it far better than the first season.",
            "date": "2017-05-11T14:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 247473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4948191.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AshySidra",
                "username": "AshySidra"
            },
            "url": "https://myanimelist.net/reviews.php?id=247473"
        }
    ],
    [
        {
            "content": "I don't know if I have any other score but 8 to judge everything in this anime. It's a good anime, but not outstanding either. \r\nIt's a continuation of Hamatora and it picked up things right away after that disturbing ending in season 1. Less comedies and humorous cases, more main plot. Now Art - our friendly, sweet police officer becomes antagonist and ready to kill Nice - our main protagonist anytime. It sounds so cliche, but also entertaining and evokes our curiosity. Although, sometimes I can't help but laugh at Art's action, wanting to kill but running away when he definitely has chance tokill Nice. To me, the characters are easily overshadowed by the conflict, and I could care less about Honey's background or Birthday's background. \\n\\n\r\nThe theme is still revolve around \"Equality\", but now is in the opposite way of season 1. Instead of making people that inferior go higher, we make the superior go down. The plot still has many mysteries, as \"Why does Nice not suppose to exist?\" and \"Why is Art doing this?\", there is also a question leftover from season 1 \"What did Moral tell Art?\". The name of this season means \"Reply\" so sooner or later, we can get the answers for everything. Episode 9 already answers some, like Hajime's past and the causes for the side effects of Minimum Holders in Cafe Nowhere. There are also interesting plot twists regard Nice and untouched characters as Master and Koneko. It build a bridge to connect season 1 and 2 perfectly, I would say. Also, more deaths and painful moments that somehow makes it so hard to watch.\\n\\n\r\nSeason 2 is probably darker, but we also have episode like 8 to soften the mood. And there are still case serve as parodies and sarcasms to anime (Like Hikaru's case - a sarcasm to Harem Anime) that fun to watch. \\n\\n\r\nThe characters, though they are somehow plain and uninteresting, they have flaws and easy for the viewers to connect them with themselves. Like Murasaki, who that has power but still feels inferior to Nice and even Art - who has no power at all, and his jealousy comes to an extent that he hits and shoot Art out of control, just to release his anger. These people are not perfect and have two sides.\\n\\n\r\nThe music is nice, but nothing is really special. The OST is kind of plain, the Opening is tuny, the Ending is melancholy. The animation is better than season 1, though it lost the unique in coloring and effect of season 1. The only thing I can hate about the animation are those annoying changing scenes every 5 minutes. \\n\\n\r\nSo, this is the show that has seriousness and stupidness at the same time. If you want to try something new, try this.\\n\\n",
            "date": "2014-08-31T18:57:00+00:00",
            "helpful_count": 54,
            "mal_id": 158683,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320833.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/glaceon_cute",
                "username": "glaceon_cute"
            },
            "url": "https://myanimelist.net/reviews.php?id=158683"
        },
        {
            "content": "[EDIT AS OF 9/23/14: So it finished.  I liked the last episode.  The final 3 episodes that aired after I reviewed were pretty decent compared to the rest of the show.  That being said, they don't make up for a lot of what happened before them.  The score is now 4/10.\r\n[EDIT AS OF 9/15/14: So episode 11 just happened.  Episode 11 (and 9) are great examples of how good the series COULD be.  Why all episodes aren't the qualities of these two, I couldn't tell you.  But if Re:_ Hamatora concludes with the same strength as episode 11,and maybe intelligently, I may review my review-- I have to say, Re:_ Hamatora surprised me with that episode.  Does it make up for everything else I pointed out up until now?  Absolutely not.] \\n\\n\r\nI didn't see any reviews of Re:_ Hamatora that best fit how I take the series, so here's my go at it.  If you disagree with anything I say, please tell me.  I would love to have my opinion changed about Re:_ Hamatora, though I haven't the slightest idea how it will be done.  (Note: I'll try to keep the discussion to only the second cour.) (Also note that while this show isn't finished, I've seen enough to get a sense of the show.  Especially after the first season.)\\n\\n\r\nRe:_ Hamatora is the second season (well, 2nd part of a split-cour) of Hamatora, a story that appears similar to Darker than Black at first.  I had high hopes for the show- the art was interesting, the music was pretty good, and the premise was interesting, to say the least.  Sadly, it fell flat.  In my opinion, here's why:\\n\\n\r\n[ART: 5]\\n\\n\r\nThe first season had some really cool art early on.  Every time I watched the opening I sort of felt like I was on an acid trip.  Despite Hamatora's colorful approach, the art isn't really all that great, but at the same time, it's not terrible.  Pretty much the definition of mediocre.  Inconsistencies here and there are understandable (we're obviously not watching the BD or anything) but the art style itself isn't all that interesting.    \\n\\n\r\n[SOUND: 7]\\n\\n\r\nPretty much the only thing I like about both seasons.  Re:_ Hamatora has a pretty awesome OP, not to mention a fairly catchy ED.  Asides from that, the music throughout is played quite well.  I never felt bombarded by music playing during each and every moment.  And I liked the music to boot.\\n\\n\r\n[CHARACTER: 3]\\n\\n\r\nFinally, trouble's a' brewin.  Re:_ Hamatora really falls flat on its characters.  All of our characters are fairly one-dimensional, a problem in both seasons.  Nice is the M.C. who will win no matter what.  Murasaki is the friendly rival who always is trying to get better.  Art would carry the show if he didn't annoy me so much.  He gets pretty badass, but Art's actions don't exactly have motivation now (and just leave us asking \"WHY?!\"), but from what the show has given us so far I doubt it will be a very good reason.  The addition of Honey felt sort of forced (1st season), but hey, why not?\\n\\n\r\nHajime is standable as the show's best character.  Sure, you have your trope of the small, hungry girl, but the show doesn't shove that down your throat too much.  Her backstory is cool and somewhat intriguing.  If every episode was the great quality I saw in her backstory episode this season, this would be a VERYYYY different review.\\n\\n\r\n[STORY: 3]\\n\\n\r\nA show REALLY has to annoy me to get any worse than this.  Re:_ Hamatora has a lot of problems with its storytelling.  Let's get an especially glaring issue that only appeared this season: THE GOD DAMNED TRANSITIONS.  I swear that they were only put in because all the episodes weren't long enough.  \\n\\n\r\nAnother glaring problem: why did we get filler [EDIT: by filler, I don't mean non-canon, I mean not contributing to the overall plot.  I use it for them interchangeably, however wrong I am (sorry).] episodes?  They don't add to the enjoyment at all, and what's even worse, this is a 24 EPISODE SERIES.\\n\\n\r\nNow, on to the actual story.  The first season quickly proved that, excuse the cliché, \"we weren't going anywhere fast.\"  I hoped that Re:_ Hamatora would maybe attempt to break this pattern, but unfortunately, it didn't.  From the last episode of the first cour to now, you could probably fit all that happened RELATING TO THE ACTUAL PLOT in 4 episodes.  Sure, I'm pulling that number out of my ass, but it's probably not all that wrong.  As of right now, 9 episodes have aired.  Not a lot has happened.  These last 3 episodes are either going to leave us unsatisfied or we're going to get 3 episodes that try to tell us more than an Evangelion fan on speed contrasting the original series versus the rebuild.\\n\\n\r\nYet another problem here (see a pattern?) is that the show takes it self way too seriously.  I've had to pause an episode from time to time to take a breather from all the pseudo-philosophical bullshit it was spouting one moment, then be subjected to more mindless filler.\\n\\n\r\n[ENJOYMENT: 4]\\n\\n\r\nMaybe I'm slightly masochistic but I slightly liked watching this trainwreck of a show.  I like watching bad anime-- it makes me appreciate the good ones more. \\n\\n\r\n[OVERALL: 3]\\n\\n\r\nRe:_ Hamatora really fell flat, which wasn't all that surprising after the first season.  I would not recommend this show to anyone in search of something good-- but maybe to someone who wants to watch something with a good premise fall flat.",
            "date": "2014-09-10T17:13:00+00:00",
            "helpful_count": 52,
            "mal_id": 159841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686559.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/fullmetalgeass",
                "username": "fullmetalgeass"
            },
            "url": "https://myanimelist.net/reviews.php?id=159841"
        },
        {
            "content": "The sequel of Hamatora The Animation completely exceed my expectation, the series is truly different from its prequel and different in terms of good.\r\nOne of the massive different that created in Re:␣Hamatora is the story orientation, Re:␣Hamatora have clearer story orientation than its prequel. The main plot of the story is visible,  the story evolves nicely and keeps focusing to the main plot itself. It maybe not the best that exist, but the plot manage to balance the story. One more thing that we should notice that the sequel appeals more to the mystery instead the comedy. So the main attraction has changed tothe mystery. While the positive is lying in the ground, the negative is playing in the back scenes. Re:_Hamatora have some plot holes here and there which are too bad.\\n\\n\r\nLike modern anime these days, the animation is decent. The animation of Re:_Hamatora is less colorful than its prequel and has the darker feeling than it's prequel. But the good news is no need to suffer that series of contrast anymore!\\n\\n\r\nWhat can I say about the sound? It's quite decent, the seiyuu is doing a fairly good job. I should say that the Opening song \"Sen no Tsubasa\" is successfully beating my heart with its beat... while the ending is ordinary.\\n\\n\r\nWhile the story has a magnificent job to save the anime, the character is a bit flat. There are many unused supporting characters in Re:_Hamatora, there is minimum development between these characters. Our main antagonist motive is very weak while others are fine.\\n\\n\r\nIt was enjoyable, not the most enjoyable anime but can fill you with excitement and its jocularity.\\n\\n\r\nIn the end, Re:_Hamatora quite succeeds in saving its prequel from the apocalypse, if you want to watch an anime with Super Power filled with mysteries that lies hidden within the stories, then it's for you.\\n",
            "date": "2014-12-25T04:44:00+00:00",
            "helpful_count": 41,
            "mal_id": 174211,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=174211"
        },
        {
            "content": "The first season ended with a huge cliff hanger, now this seasons completes the previous story. And it was a good, unlike the previous season where the main characters are just doing random job requests, in this season you can relate more to the characters themselves as we get to see their backgrounds and know more about their past and who they really are, also you can finally notice a little bit of a romantic feeling between Nice and Hajime which I am eternally grateful! \r\nNow for the story, the great thing is the events became more polished and the story began to sidestep randomnessand converge into one main goal. However the thing lacking here is a bit of spice and uniqueness in the villain's characters, I found most of them rather dull and clichéd, but they still delivered the whole job well. Now what also changed this season is the atmosphere, the pace increases a lot, things get more serious, the characters go through tight situations, etc.. Still the show is able to keep the comedy going and maintain a pleasant and enjoyable mood as usual.\\n\\n\r\nThe art: the graphics are still good, just the colors became less bright, like the character's eyes and hair colors have changed a bit, it isn't that much obvious though. The animation gets better but is still considered average for a 2014 anime.  \\n\\n\r\nI still consider this an average anime, if you're expecting it to be a master piece, then don't get your hopes up, just an enjoyable show that doesn't take it self too seriously nor too lightly, I honestly loved watching every episode.  \\n",
            "date": "2014-09-20T15:45:00+00:00",
            "helpful_count": 24,
            "mal_id": 161235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3876035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Larinel",
                "username": "Larinel"
            },
            "url": "https://myanimelist.net/reviews.php?id=161235"
        },
        {
            "content": "I dont normally write reviews but I thought it'd be good to review this since i saw many people rating it less than 8 which is quite surprising for me since i enjoyed this very much.\r\nStory - 8\r\nThe story was outstanding but the idea of people having powers and so is used quite a lot. however the use of this idea was amazing. It keeps you always at the edge of your seat and i haven't been into an anime for a long time. normally when a sad scene happens i wouldnt react as much as this anime made me. This might be not onlybecause of the story but also because of the characters.\\n\\n\r\nCharacter - 9\\n\r\nI got pretty attached to the characters really fast and they were all quite lovable. however it didnt explain why some characters were there until the end of the anime which made me always ask questions to myself about the characters and didn't give them much care, which annoyed me, but not a lot.\\n\\n\r\nArt - 10\\n\r\nThe art was really awesome. It was very colorful unlike any other anime, which you'd see in the comments while watching it. I liked their use of colors and the i didn't really find any flaw in the art. everything was drawn really well.\\n\\n\r\nEnjoyment - 10\\n\r\nThis anime, as i said before, was very exciting. It was never boring to watch and it was really funny. \\n\\n\r\nSound - 9\\n\r\nI think the soundtrack for this anime was one of my favourite things about it. The OP and ED were catchy n i lovedd them. however sometimes but only rarely theres music added to a scene which kind of doesnt match the scene. this only happened in episodes which didnt have action scenes and stuff so yeah it was not a big problem at all.\\n\\n\r\nOverall - 9\\n\r\nThere are many better anime  than this but this was awesome to watch. finished both seasons in less than two days. this made me laugh a lot and i kind of finished both seasons this fast only because of that. or else if it was all dark n sad i wouldnt have completed it that fast because i needed a break from dark anime n stuff cuz i watched this after the 26th episode of death note. anyways this is an anime id recommend for times like i mentioned even though its not one of the best anime out there.\\n\r\none VERY annoying thing which anyone who watched this would notice, are the transitions between the scenes which they added this season. I dont see any use for them tbh but they werent that bad so its fine\\n\\n\r\nI hope this was helpful :) \\n\\n",
            "date": "2016-04-01T01:57:00+00:00",
            "helpful_count": 21,
            "mal_id": 215011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiroiwayagi",
                "username": "Shiroiwayagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=215011"
        },
        {
            "content": "After watching the second season of Hamatora (or Re:_Hamatora), I would say it made some steps to improve from it's predecessor, but it also made some steps back.\r\nNow, TL;DR for those who are too lazy to read:\r\nPros:\r\n+ Story is more tighter than the first season\r\n+ Character backstories are revealed in this season\r\n+ Good OP,ED\r\n+ Funny characters and situations\r\nCons:\r\n- Still horribly cliché (predictable)\r\n- Less colorful animation than the first season\r\n- Most of the casts are uninteresting characters\r\nIn-depth review (*MINOR SPOILERS*):\r\nStory: 7\r\nThe story is about the detective agency Hamatora, which consists of people with Minimums, a kind of power that activates when a certain condition is achieved. Like the last season, the theme of this anime is still equality, which deals with problems between the Minimum Holders (people with Minimums) and the normal Humans.\\n\\n\r\nUnlike the last season, the plot in this season is more tight, which is a good thing, instead of the last season's random detective work. Like the last season, the anime is still horribly cliché, but it still has funny situations that makes the anime enjoyable.\\n\\n\r\nArt & Animation : 7\\n\r\nThe art is pretty standard in 2014. Characters are well detailed and enviroment is good. the shading is improved from the first season, fight scenes are well-made, but the colorful animation when people uses their minimums in the first season is gone, making it a lot less fun than the the first season.\\n\\n\r\nThere is also that annoying animation when ever they changes the scene which reduces a lot of tension in certain situations.\\n\\n\r\nSound: 7\\n\r\nVoice acting is brilliant. Kamiya Hiroshi's performance as Art is as good as always. Other character voices are well portrayed. OP is awesome and catchy and the ED is pretty emotional. BGM music is pretty generic though.\\n\\n\r\nCharacters: 7\\n\r\nCharacters in Hamatora is a bit uninteresting. But some of them are good and is really relatable. Murasaki is person with very strong powers but is still jealous with Nice. Art is doing everything to fufill his brother's wish. \\n\\n\r\nEnjoyment: 7\\n\r\nIt was a pretty good watch. Funny and enjoyable though I predicted exactly what would happen.\\n\\n\r\nOverall: 7\\n\r\nIn conclusion, Re:_Hamatora is good, but not great. if you liked the first season, you will like this. If you're the type who wants a lot of action, then you better find another anime. \\n\\n\\n\\n\\n",
            "date": "2014-11-08T04:58:00+00:00",
            "helpful_count": 12,
            "mal_id": 167857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spiwar",
                "username": "spiwar"
            },
            "url": "https://myanimelist.net/reviews.php?id=167857"
        },
        {
            "content": "Well, now that we are at the end, I have to say that I loved the previous season of this franchise, but I hate this season of it.\r\nThis season was a lot more flash than substance, and had really odd pacing. Even after they explained some things at the end, I still do not accept it. My disbelief was not suspended, it was, rather, enhanced, with each segment of the story. \r\nOn the other hand, perhaps it sort of reflects the times. Perhaps attention is drained by flashy graphics and incoherent garbage is dumped into our psyche, where it coheres into a wellspring of instability,contributing to the widespread nature of depression and poor choices. \\n\\n\r\nThat sort of \"well, sure, a lot of people were harmed because of me but it is okay once I have a few friends, life goes on (for me) and who cares about what I did before, those people were not main characters\" attitude is a bit like how we watch the news about how people are prevented from getting an education and then prevent ourselves from getting an education because we wasted all our mental energy watching the news, then worrying about it... but then feel it is okay because we have friends.\\n\\n\r\nBeing a serial killer and mass murderer really should never be okay, even in a fantasy setting. There should be at least one person who wants to make the world better, but none of the characters consistently do this. Perhaps we should forgive and forget everything, if we are sure that there has been true change, but there is no evidence that there was such character growth, at all.\\n\\n\r\nEven soldiers and police officers can often have difficulty coming to term with taking lives, which is appropriate. It should be a hard thing to do, even if the enemy deserves it. So to have a story where they really seem not to care about all the casualties, well, I hope that humanity doesn't really think human life is cheap and disposable.\\n\\n\r\nI hope that we care about the innocent people who don't even know what is going on, through no fault of their own, and would gladly help to change things for the better, if given the opportunity.\\n\\n\r\nSo, this is one anime that triggered my indignation, and has no redeeming values for me. Even more so because the first series was a lot better, and a lot more hopeful. I keep trying to come up with some excuse for them to do this, but I think they had enough time and budget that it was not a simple pacing error -- the message really seems to be that, if you are with the right crowd, then it doesn't matter how evil you are, how much harm you cause -- you will be fine, and everyone will love you anyhow.\\n\\n\r\nSo, for me, worse story ever. \\n\\n",
            "date": "2014-09-28T20:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 162811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=162811"
        },
        {
            "content": "As a continuation to the Hamatora, this has turned out to be a very good anime!\r\nI shall make a short Review summarizing the key/main parts of this Anime.\r\nStory [ 9 ]\r\nThough the anime is pretty short, 12 episodes to say the least. . .It has had it's ups and downs when it comes to the Story. Throughout this anime the characters have been more developed in a way of such that you can pretty much distinguish the characteristics between all of them. The Story has continued from 'Hamatora', and starts off right after Morale dies. Goes on from there with Art becoming the new Antagonistand making such efforts to try and Kill Nice. However! - It goes from there with Art's new intentions to try obtain an even bigger goal. . .\\n\\n\r\nArt [ 10 ]\\n\\n\r\nI loved all of this anime, especially when it comes to the graphics (art). So...I think that the graphics in this are very well done, you can see every bit of definition of the character..like all of it's features. I'm not very good at my vocab but i've seen many Anime's. Those other anime's don't compare to this, the transitions between each scene is very good, I've seen nothing like it and you'd think it'd be pretty obvious.\\n\\n\r\nSound [ 8 ]\\n\\n\r\nI didn't really hear much of any sound tracks aside from the Opening and Endings. . . Not really much of any battle-music, but it recieved an 8 Because i think that this anime does deserve it for the music it already has.\\n\\n\r\nCharacter [ 10 ]\\n\\n\r\nVery good Character development between each of the characters. You see much more of their background through flashbacks of when they were probably little toddlers back at their training academy when they were trying to practice / discover their minimums. \\n\r\nI give this a 10 because of that, and also how each of their characteristics are defined throughout this anime, You can see how well they act with their minimums when trying to solve a case, and you can also see how well they act just living in the breeze - without fighting.\\n\\n\r\nEnjoyment [ 10 ] \\n\\n\r\nI loved this anime so much and was very dissapointed when it was only a 12 episode long anime. I enjoyed it to the fullest. It has this sort of vibe that you'd get from watching those upper class anime's like Hunter x Hunter or One piece or Naruto. I hope they come out with a 3rd season, the comedy, action scenes, Epic characters, this anime is just a -has-to-watch- anime!\\n\\n\r\nOverall [ 10 ]\\n\\n\r\nYeah, I gave it a 10, and i'm very honest about it as well. This anime, even though it's pretty short . . . has alot of special things about it that would make it worthy of recieving a 10/10 Overall!\\n\\n\r\nI was tempted to give it a 9/10 but that was only because i solely was sad that it was only going to be a 12 episode anime. However, throughout this anime whilst the characters grew each episode...i just kept wanting to see more and that's why i gave it a 10/10. From the Story - to - Overall, definitely deserves it in my opinion.",
            "date": "2014-09-22T20:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 161665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103311.jpg",
                "scores": {
                    "animation": 0,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/B3astpwn",
                "username": "B3astpwn"
            },
            "url": "https://myanimelist.net/reviews.php?id=161665"
        },
        {
            "content": "This is the only anime that disturbs me everytime on while showering until season II came out. Well, seeing that the season I leaves us in a cliffhanger where Nice was shot by Art for unknown reason, who was supposed to be dead.\r\nOkay, first of all, I love Art. No, more than that, on the whole fiction world, he has the biggest respect I could ever give to a character. Even though knowing that he never utilized his minimum before, he still graduated at Facultas academy, which is really amazing considering the pressure put by his environment.\r\nEnough of that.\r\nThis anime, as a whole, always gotmy feeling dynamically. They always got me. Specially when someone's supposed to be dead but turns out that he's still alive. Sometimes it's hard to believe that it's still logical, but because of the attachment on the character, you just can't help but to feel relieve.\\n\r\nThere are light episodes and tragic episodes and they balance each other perfectly, which adds to the factors that makes this anime an amazing story.\\n\r\nThe one I like the most about this is that while making you creepily cry, is that after that, they'll sure to make you laugh. I found myself in a mess after watching the last episode.\\n\r\nThere are also moral lessons and somewhat just a nonsense that also makes sense that you can gain here.\\n\r\nWell, at most, this is undoubtedly worth and enjoyable to watch.",
            "date": "2014-09-23T14:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 161781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4119011.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MariyaEru",
                "username": "MariyaEru"
            },
            "url": "https://myanimelist.net/reviews.php?id=161781"
        },
        {
            "content": "Re:Hamatora is the sequel of Hamatora The Animation. The story continues from where it left off previously and deals with the consequences of the Yokohama incident, as well as the issues in society now that the Minimum holders are revealed. This season is the complete opposite of its prequel.\r\nThe mood has significantly changed. It is darker and the seriousness is a constant during most of the episodes. Interactions between characters are more mature and the overall theme has rather grim tones. Even the colors lack saturation and the heavier complex shadows additionally boost the expressiveness - in a way leading the viewer to the expectationthat a tragedy is about to unfold.\\n\\n\r\nOnly traces of the mess from the first season are notable. There is almost no randomness, no identity crisis and especially no extreme lack of originality in the production. The story progresses forward naturally and slowly, but diligently, answers most of the questions that were left a mystery at end of Hamatora The Animation. \\n\\n\r\nInner dialogue of the characters and psychological struggle take the spotlight in Re:Hamatora at the expense of philosophical messages addressed to the viewers. But even though the dominating emotions are negative, some comedy is still present at the right times and it is actually quite smoothly incorporated. A pleasant surprise is the overall good balance between delivered emotions in this season. Especially enjoyable is the slight hint of romance.\\n\\n\r\nOf course, overusing some visual gimmicks might displease the audience, but the used amount is negligible in comparison to the \"tricks\" from the first season. Besides Re:Hamatora gets better with each episode. Not soundwise - the soundtrack is okay and again fits well. Not the animation too, although it has undoubtedly evolved. Most notable is that the directing approach has changed and the tension that builds up is brilliantly resolved in the final episode. \\n\\n\r\nIn the end Re:Hamatora is a superior product compared to its predecessor. The show has found its identity, trimmed the unnecessary elements and focused on what it wants to deliver to the viewers. It is very likely that for most people it will be satisfying to watch.\\n\\n\\n\\n",
            "date": "2014-09-25T17:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 162187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487359.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FoxSpiritShrine",
                "username": "FoxSpiritShrine"
            },
            "url": "https://myanimelist.net/reviews.php?id=162187"
        },
        {
            "content": "This being the second season for Hamatora I was hoping it would be tied up nicely, you know all those niggling little questions you have and hatred you feel for characters you just know would be rectified if only you knew WHY!? why did they do that? As well as the all ungodly cliffhanger they left us with in the last season, thank goodness this was around to clear things up.\r\nWell, this season did not disappoint with answers, of course, you wish they'd all happen faster than they did but hey I suppose they had to make the season a decent length. \r\nThe story hassomewhat of a slower if not slightly pace than the first stopping for the comedic episode, which doesn't fail to make me laugh. There's more backstory to be added and you finally get why the bad guy is bad! Isn't that what you stuck around for? \\n\r\nBlood pumping edgy moments that keep you on the edge of your seat as you hope to not loose a member of this beloved team, Hamatora wouldn't be the same without Nice, Hajime or even Birthday, right? Watch this series to see the \"final destination\" (as it were) for our \"heroes\"  will the end me as sweet as honey or a beastly tragedy I think it's worth your time to find out! \\n\\n\r\n(P.s. sorry for the puns it was too good an opportunity to leave out)\\n\\n\r\nI hope you enjoy the show, check out season 1. Hamatora The Animation, if none of this is making any sense to you at all. :)",
            "date": "2016-11-12T12:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 233651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987746.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LazyLeafeon",
                "username": "LazyLeafeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=233651"
        },
        {
            "content": "Review for both Hamatora and Re:Hamatora.\r\nNote that I'll use [] to put something that could be an spoiler, though I won't reveal major plot parts.\r\nThis was, actually, my favourite show from its year... for the wrong reasons.\r\nI'm not even kidding.\r\n███STORY ███\r\nTo make it short, the story is full of good ideas, but the execution is awful. Everytime Hamatora manages to do something right, making you hope that the show will become good, it screw up EVERYTHING the next episode. An example of this are those episodes where a character dies. Is pretty obvious that the director has no idea about how to handle drama, because:\r\n1-Hisdrama is stupid.\\n\r\n2-Does a good drama and then fills the screen with jokes, so the sadness that you're supposed to feel disappears.\\n\r\nI swear I was really mad after that episode where X character dies. I was truly heartbroken, and then, the next episode they gave me a BEACH FILLER. WHY? The characters didn't even discuss that X died. They just went to beach. Mr. Director, are you sure you know what are you doing? I guess no since you didn't do this once, but twice.\\n\r\nTalking further about this death topic, every death is terribly handled. It tries hard to be something shocking, but it barely is because no character actually dies when killed. And when someone finally manages to die, the death is so forced that you end complaining about how unnecessary that was.\\n\\n\r\nRelating other problems, this show tries too hard to develop its characters, but fails at the matter. Uses flashback totally out of places, introducing cliches situation to force you to sympathize the characters but... it doesn't work. It's not like the characters are annoying (they're not likable either), but everytime they tried to show me the story of a character I felt like something was missing.\\n\\n\r\nNow, let's talk about the cringeworthy writting. God, I really had a good time with it. \\n\r\nI know that friendship is something, but seriously. If my best friend is constantly trying to kill me, then he stop being my best friend at the second. Like really, Nice has the worst friends in the story of Earth. \\n\r\nAnd characters constantly contradict themselves with what they want. Let's see an example:\\n\r\n[Character Z wants to kill character X. Character Y knows it, and KNOWING it notices that he actually hates X and sympathizes with Z, so he wants to join him now.\\n\r\nY: Dude, I feel you. Let me join your cause.\\n\r\nZ: Great! I'm going to kill X.\\n\r\nY: What? You can't kill X. I quit this shit!\\n\r\nThen Y beats the shit out of Z because the latter wants to kill X. The end.\\n\r\n(After this, Y hating X was never mentioned again. In fact, they endend as close friends).]\\n\r\nAnd how can we forget that time when A went to drink tea with B, KNOWING that B killed his best friend? Obviously, everything had a bad end.\\n\r\nAnd let's not talk about plot devices and Deus Ex Machina. They're everywhere.\\n\\n\r\nBut let me say something positive about the story. The equality stuff was really insteresting and fun to watch. Too bad it wasn't handled correctly, because a few episodes were pretty good by they own. Is sad to see such potential wasted.\\n\\n\r\n███CHARACTERS ███\\n\\n\r\nNice: our main character. He's actually the most powerful Minimun Holder out there and beat the shit out of every villain with no effort. Has no relevants imperfections, and to be honest, he's a bordeline Gary Stu. At the end of season 1, the urge to punch him in the face was so strong that I was actually happy with that ending. Seriously, his speech about how people without minimuns shouldn't envy the one with powers almost made me vomit. Of course you wouldn't know nothing about envy because you're almost perfect, you piece of shit. \\n\r\nLuckily, he stops being a bordeline Gary Stu in Season 2 and becomes more likable. But his amount of plot armor is really annoying.\\n\\n\r\nArt: actually a character you can sympathize with. Contrary to Nice, his Minimun skills were totally shit, so everything he gained so far was thanks to his efforts. Even so, he still feels bad for no having a minimun, which is pretty relatable. The fact that he was a normal human doing useful stuff in a world filled with superpowers made him likable. He was even husbando tier.\\n\r\nThen Season 2 happened...\\n\r\nArt started as a good anti-villain, clearly avoiding unnecessary killing and the sort, following the pattern of a nice dude that must do something bad for a hidden good reason. Sadly, Seiji Kishi liked the character so much that thought that EVERYTHING in the show has to be related to him. Seriously, he stole all the screen for himself in an annoying way. Everytime something relevant happened Art appeared, did something cool and then disappeared, because that's what badass characters do. When he became a Jesus rip-off (like seriously, I'm not even kidding) I knew that the character already went to shit. \\n\r\nIn the end, he became the bordeline Gary Stu of season 2, competing with Nice for who has the biggest plot armor. \\n\\n\r\nMoral: he was the main villain in S1, so he deserves a spotlight in this review. I'll make it short: HE'S SHIT. Cheesy as hell and looks like a fusion between Makishima (Psycho Pass) and Ukyo (Amnesia). He's the most generic villain I've seen in a chinese cartoon, and has an obsession with Nice, probably because he masturbates thinking of him every night. Nothing else to say, Hamatora is better without him.\\n\\n\r\nEvery other character is irrelevant. Too one dimensional to even care.\\n\\n\r\n███ART (Insert pun related to the character here)███\\n\\n\r\nIt's bad in Season 1, full of quality and that filter is atrocious. Animation is decent at its best.\\n\\n\r\nSeason 2 is a little better, but not remarkable.\\n\\n\r\nMusic is not remarkable either, but the OPs and ED are good. The ost of the episodes is not very memorable, though. I'm unable to recall any song.\\n\\n\r\n███ENJOYMENT ███\\n\\n\r\nWhere this shines. This show made laugh, rage, cringe and many other emotions that I'm expecting to have while watching a chinese cartoon. I was truly eagerly waiting every Tuesday for another episode. Yeah, everything happening in the screen was a mess, but an enjoyable mess. I gladly watch this again a second (or third time).\\n\r\nThe best trainwreck of its year.\\n\\n\r\n███OVERALL ███\\n\\n\r\nOnly watch this if you like to turn off your brain to enjoy a show of the \"so bad it's good\" type. \\n",
            "date": "2016-05-05T19:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 217956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4892133.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Cishet",
                "username": "Cishet"
            },
            "url": "https://myanimelist.net/reviews.php?id=217956"
        },
        {
            "content": "It is like someone mixed Charlotte, Shinrei Tantei Yakumo and Angel Beats!\r\nMost important point is we understand that Seiji Kishi indicates himself with success in his animes. Strong characters, strong story. A couple episodes were boring but at last you take a deep breathe and say \"well that went well... no, more then well, that was perfect ending.\" I stopped and think some of episodes about dropping but when even though some of them are boring if you continue and finish the anime you meet with a masterpiece.",
            "date": "2015-08-14T12:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 196161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4528229.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shirogakita",
                "username": "shirogakita"
            },
            "url": "https://myanimelist.net/reviews.php?id=196161"
        },
        {
            "content": "Re:_ Hamatora is a sequel to Hamatora, and it's even better than the first season. I have to be honest that the first season left such a huge cliffhanger, and Season 2 will answer all those questions you have in mind. This anime deserves more love, it's underrated. This definitely goes to one of my top 5 animes. Why?\r\nStory: [9]\r\nThe creators know how to connect to you and your emotions. This is one of Hamatora's greatest points. It isn't rushed, nor is it too slow.\r\nAlthough, during the last three episodes, things felt a little bit rushed.  They could've slowed things down a bit. Thelast few episodes felt like they were trying to fit in all the events. They could've done better.\\n\\n\r\nOn the other hand, this anime is a rollercoaster ride. As I've said earlier, the creators know how to hit you with emotions. Other episodes will make you laugh, others will make you despise characters, while other episodes will make you stressed and fill your mind with thoughts. It knows how to balance things, it's unique in its own way.\\n\\n\\n\r\nArt: [10]\\n\r\nThe anime itself is really colorful and full of life, and at the same time really dark and sad. As I've said, Hamatora knows how to balance, and one of the things they know how to balance is the Art Style. They know when it's necessary to create a dark atmosphere/feel or when it's not.\\n\\n\\n\r\nSound: [8]\\n\r\nI honestly loved the opening and ending songs. Aside from that, I think they could've used better and more remarkable background music in some scenes.\\n\\n\\n\r\nCharacter: [10]\\n\r\nAgain, one of Hamatora's strongest points: Character Development. I love how they showed everyone's backstory. You get to know each character more.\\n\\n\\n\r\nEnjoyment: [9]\\n\r\nIt's something I would always look forward to watch.\\n\r\nHowever, what made the Enjoyment Rate a 9/10 is the transition scene. The transition scene on Season 2 was bad. Perhaps a different sound would be better, or a different background. I'm not a fan of the transition scene.\\n\\n\\n\r\nOverall: [10]\\n\r\nSo overall? still a 10! Names, felt weird at first. You'll get really unusual names, or odd. \\n\\n\r\nThe ending's really good. I've never felt this kind of satisfaction.\\n\r\nThis series made me feel so many emotions, and that's what I love about it! I love how they paid attention to the details in the ending. Flaws here and there, but overall, this anime is still worth a try.\\n\\n",
            "date": "2016-08-10T00:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 226372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5602639.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/obtain",
                "username": "obtain"
            },
            "url": "https://myanimelist.net/reviews.php?id=226372"
        },
        {
            "content": "Well, let's start w/ the story first, so I can give my opinion clearer after explain the situation of the series. It's quite different yet still related w/ Hamatora The Animation Series. Re:_Hamatora focuses on different problems and main characters. Let's say it's about Hajime-chan background, also the 1st time she met Nice-kun. This background connects w/ Art and his goal to maintain what's left back there. Along the story progresses, there is Saikyou involved for more, and Freemum.\r\n    The story itself sounds a bit more complicated, nevertheless that's what makes the series intriguing. This concept is so solid, and way betterthe graphics here. The viewers will not just feel the up and down from battle scenes of Minimum Holders superiority. Also, the feelings wrapped within story. What annoys me sometimes are, many different situations and places in a story, so few sections cut off often. If I may compare, the cut off Re:_Hamatora is more pleasant than Hamatora The Animation, but still...err~well they did their best.\\n\\n\r\n    Music for both opening and ending song are good. While the rhythmic of opening song is keen, the ending song is slower and mellow. The opening song titled Sen no Tsubasa is a collaboration between Livetune adding Takuro Sugawara. For the ending theme, performed by Ayami, Brand New World.\\n\\n\r\n    Characters are developing their improvement for the storyline and makes it complicated passionately. The cases and antagonist characters stormily the city for revolutionary age is wrapped nicely. We know deeper even about the side characters personality.\\n\\n\\n\r\nPersonally, I give this series 7 rate.\\n\r\nPros:\\n\r\nThe involvement of characters and storyline\\n\\n\r\nCons:\\n\r\nFocuses only to few characters\\n\r\nThe cut-off sections are odd\\n\\n\r\n*) Freemum is somewhat community contains of Minimum Holders gathers by the speech of Art w/ his hidden motive, and being use by Ishigami Shun'ichi who stands as the one, propose the idea of Yokohama being an area to provide freedom for Minimum Holders, then forced government to accept his demands.\\n\r\n*) Minimum Holders are humans w/ superiority biologically gifted. They are minorities who always be excommunicated by society. Their abilities are varies from such body regained, strength, speed, even supranatural matters.",
            "date": "2016-07-23T23:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 224810,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224810"
        },
        {
            "content": "I'm super happy that the second season was successful instead of it being a total dud compared to other second seasons I've watched. Right away I can say the animation definitely matured since the first season. The colors are a little more dull, giving the show a more ominous atmosphere, which played perfectly with the plot. \r\nThe plot was amazing. I loved how we got some more of Art, Nice, and Hajime's backstory. Even though I hated it, Art was a great villain. His motives were legit and understandable, unlike villains I have watched in the past. I really don't want to spoil the ending, so I'mjust going to say that it was FAR better than the first season's ending. THIS was the ending I was waiting for and I am so happy that the show ended the way that it did. \\n\\n\r\nAs for the music, I specifically liked the theme song. It always got me riled up for the episode because it was so upbeat and catchy. I always found myself dancing in my chair or slightly bobbing my head to the beat. That's when you know a theme song is good. \\n\\n\r\nOverall, this short series has really touched me and I'm very happy to have watched it and come to love the characters.",
            "date": "2017-02-19T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 240960,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240960"
        },
        {
            "content": "Story: Average\r\nHonestly, I was kind of disappointed about the plot armor's strength. AKA I didn't enjoy the fact that Art had survived. Twice. By some sort of miracle (especially the ending). \r\nThough the story uses plot armor, it's not as predictable as you would think neither is it too simple. What I think is a good characteristic of the Hamatora seasons are that they go at a pace which doesn't make much sense due to lack of information and explanation. Though it does sound bad, it pulls you in as you want answers to your questions like why Art wanted Nice dead (seen in ep.12of first season)\\n\\n\r\nArt: Good\\n\r\nMaybe it's due to budget or just lazy animators, I personally think that the still animations are derpy to the point that you would laugh at.\\n\r\nCharacter designs are unique in a sense that it fits their character. It is, however, upsetting to see the lack in variety of clothes. Though I would like to highlight Art in this season. In the first season, his design was showing that he's of a formal character. But with a simple switch without much change to the color scheme, it maintained the formal vibes but adding the sketchiness of it all.\\n\\n\r\nCharacter: Lovin' em \\n\r\nI absolutely respect animes that can hold many characters while showing a special personality for each of them. If you described a character briefly, you would still be able to narrow down to a specific character. \\n\r\nI like the small character development in Nice. He is portrayed as a empathetic person when it comes to jobs but relatively cold when it comes to the relationships of others. Because of how unique the characters are, there was no exact need for development. \\n\\n\r\nEnjoyment: One of my favorites without a doubt\\n\r\nI get easily impressed with stories that are told in such ways that doesn't really need character development and also doesn't need a really complicated climax to keep things entertaining. \\n\\n\r\nOverall: 8\\n\r\nFirst, I wouldn't recommend this to someone who had just started out anime. Second, I respect the style that this anime uses as it is quite hard to achieve.",
            "date": "2019-02-26T07:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 302501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7398099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zxnith",
                "username": "Zxnith"
            },
            "url": "https://myanimelist.net/reviews.php?id=302501"
        },
        {
            "content": "What do you get when you have good characters, a basic but interesting concept, pretty good art style, yet poor and cruddy writing? You have Re: Hamatora.\r\nRe: Hamatora is best compared to drinking a lukewarm cup of tea. It's not very pleasant, yet you still drink it. Though, with every few sips, you’ll find yourself pulling out a long grey hair from between your teeth, you look up to see the old sweaty man who made your tea, only to realise that this is, in fact, his hair. Yet you carry on drinking... and god knows why!\r\nThat is Re: Hamatora in a nutshell!!\r\nArt 5/10: \r\nTheart style and direction in Re: hamatora, well the whole franchise isn't anything too special. It's nice, bright and colourful but when it needed to it would dim down the mood and do a good job at laying out a nice and dark setting.\\n\\n\r\nThe general style of it is pretty unique, yet the character designs themselves are rather... \"anime generic\". Nothing really diverse about them at all. \\n\\n\r\nThis would have probably had a higher score, nothing more than a six, but it lost points mainly because of the transition scenes. Between each scene, they decided to place in this little one-second clip, where they show a brick-wall. Yep, quite literally, a brick wall. To be honest, you might as well stare at a brick wall in real life and find more enjoyment from that.\\n\\n\r\nAlong with it being boring it can also kill off the mood in some parts. At times this could have been something that works to their advantage, going from a dark scene to a happy go lucky one, but they didn't take that into consideration and placed these moments in as much as they could.\\n\\n\r\nProbably trying to fill up time in the anime seeing as nothing else can fill up that void. Why give us a few moments with characters when we can look at a brick wall.\\n\\n\r\nMusic 4/10: \\n\r\nThe opening song is probably the best thing you will see from this anime. So props to them on that! \\n\\n\r\nThe soundtrack in the show is pretty good though in some parts the music felt a bit too much and could have done with a more subtle tune.\\n\\n\r\nOverall the soundtrack in the show felt rather basic, with that in mind it should have come out with rounded five out of ten. Though it lost points because of, yet again, the god-awful transition scenes. During these scenes where the lovely brick wall is presented to us, it is accompanied by this annoying... screeching track.\\n\\n\r\nThey could have played us some nice music, perhaps bach cello suite 1. Nooooo... They clearly wanted to annoy us during these parts and placed the... screech. So they lost points for that. \\n\\n\r\nCharacter 4/10: Where do I begin with the cast. The characters are rather basic and mediocre. Yet for me, the biggest downfall was the lack of character development and the off-placed reactions they had.\\n\\n\r\nDuring moments in the show, something 'dramatic' would happen. After something like this, you'd expect a reaction from the characters involved. Yet their reactions tend to be... off or nonexistent in some cases. It will have you sitting there going. \"the heck is wrong with you? Why aren't you mad? Why are you okay with this?\" for the most part.\\n\\n\r\nAlong with that comes the lack of character development. Once again, in certain moments, they could have had some really good character development. There were perfect chances to create some real tension between the cast, yet they decided to not bother with this at all and pretend nothing had ever happened.\\n\\n\r\nThen was the random character backstory we had, this was something that should have happened during season one, but they deiced to try and tie it in someone in this season. It felt out of place and unneeded like they had nothing better to show us.\\n\\n\r\n~CoughCough~brickwall~Cough~\\n\\n\r\nThe only interesting character for me would have to be Art, a good guy gone bad. Yet half way through he just became plain annoying and I lost all interest in him.\\n\\n\r\nEnjoyment 4/10: I would have enjoyed the show, but the lack of development, the unnatural reactions and the god damn transition scenes have made me knock a lot of points off.\\n\\n\r\nIf this show had a different director, or writers or just anyone it would have probably come out a lot better than it has.\\n\\n\r\nAt best this will be an enjoyable series for someone that is new to anime, if you're not, it may be a waste of time. It's just another generic shounen yet it lacks heavily in a lot of areas.\\n\\n\r\nOverall 4/10: I kind of feel like I have wasted my time on this series, thankfully it is over now. I think I will pretend it never really happened and I might stare off at a brick wall for a while.",
            "date": "2015-12-29T05:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 207194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29674.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Rojo",
                "username": "Rojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=207194"
        },
        {
            "content": "This sequel saved the show!\r\nIn this 2nd season not really much different from the previous season but more good.\r\nSupporting characters gets much screentime in this sequel. \r\nCharacters development also got improvement.\r\nThere is 1 epidode full of comedy and running gags gave us relaxation after many fights and complicating cases.\r\nArt and music as usual, cool.\r\nComplication, one by one solved by the characters.\r\nI probably miss this show and wonder watch another sequel (if any).\r\nFor those who like or love shonen anime and or supernatural genre and lots of suspense, I suggest you to watch this show\r\nReally satisfied about this show after watch the sequel",
            "date": "2018-02-17T00:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 271701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5646570.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/m_alhafidz",
                "username": "m_alhafidz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271701"
        },
        {
            "content": "I must confess, I didn't finish this anime until very recently, even though I did start it around two years? (Around the same time I finished the first season).\r\nThe reason is, the transitions between scenes became very annoying and not enjoyable as much as the first season, however as I gave a second chance, I found out it was rare the number of episodes that had such transitions.\r\nThis story revolves a lot more around mystery and suspense, which was pretty enjoyable after the light approach of the first season. Also, the fact that it had an actual plot instead of being random jobs/cases per episode,were also a nice change, and made a lot more sense. I liked the way some characters were worked around, and their development.\\n\\n\r\nThe art style is simply beautiful, reminding me of Fate UBW and Fate Zero's style which is absolutely breathtaking. The animation is incredibly well made, even the fight scenes, instead of using CGI as some animes which make the fights look weird and not smooth at all - fortunately this is not the case for Re: Hamatora.\\n\\n\r\nEven though I did like the story and art, and the soundtrack wasn't bad either, I can't give higher in characters and enjoyment. Despite that a lot of characters are well developed, I wish they could have developed the stories of other characters, further, rather than only focus in Hajime, Nice and Art. Sure they are the most important characters of the story, however it would be nice to have others in the spotlight. Some traits of Nice's and Hajime's development didn't please me either, nor how they made Nice look completely hopeless on surviving (house chores and such) without Murasaki, basically putting Murasaki as a \"wife-character\" on several episodes instead of making use of his maturity, wisdom and Minimum. Sure he had his spotlight, but on the end they turned it a bit in comedy.\\n\r\nEnjoyment, can't go higher than 7, for what I mentioned (the transitions) as it made me put this on hold for several months. Not only that, the fact the story took so long to come to a conclusion (mainly the \"bad guys\" winning almost everything in every episode) would sometimes make me a bit bored, and as such I can't give much to the enjoyment.\\n\\n\r\nHowever, overall it was an anime that I enjoyed, and transitions aside, I liked it far better than the first season.",
            "date": "2017-05-11T14:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 247473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4948191.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AshySidra",
                "username": "AshySidra"
            },
            "url": "https://myanimelist.net/reviews.php?id=247473"
        }
    ],
    [
        {
            "content": "How do I talk about Re:_Hamatora with out talking about the first Hamatora.... \r\nI actually enjoyed the original Hamatora enough that I wanted to watch this follow up. That said all the second season accomplishes is ruining everything set up by the first season and creating a confusing mess of a hot garbage story. \r\nIn order for my review to make any sense you need to at least watch the first season, so everything I talk about could technically be considered spoilers. \r\nRemember the first season where people Minimum users are getting literally MURDERED so that their brains can be stolen in order to stealand extract their special abilities to give to NON-Minimum Holders? Remember how the villain of the first season literally DIES cause his body can't handle having the extra implanted Minimum abilities? Well throw all those rules out the window cause they don't apply in the second season. \\n\\n\r\nRemember how a brain was needed to create the essence serum needed to give to other users? Well Art just uses a handy dandy gun and extracts a Minimum Holders ability with the good ol'needle suck.  No need to kill the Minimum Holder and take their brain. Also unlike Moral, apparently Art can have as many Minimum abilities in his body at once with no side effects. \\n\\n\r\nRemember that in the first anime shows that Moral is weakened and unstable because he has two Minimums present in his body during that show down. Must be great to be Art I suppose. \\n\\n\r\nThat glaring issue aside, there's a bunch of other story issues. Like the motives of Art who went so out of line rogue with power that I'm left scratching my head based on his original stance. Then there are other issues too like the fact that some minimum users start losing their powers before Hajime unleashes her Minimum (which actually weakens and erases others Minimums). Which again makes no sense... and ultimately.... \\n\\n\r\nSPOILERS!\\n\\n\r\nIt turns out that Nice has Art's brothers  (his name is Skill by the way) heart, which also contains his Minimum (doesn't make sense cause brains were apparently the source of minimums.... remember the whole Moral killing and extracting his victims brains) which activates and creates Minimum Holders. \\n\\n\r\nSo it creates a conundrum to the shows conclusion.... Hajime's power erases Minimums... so wouldn't that mean that Skill's Minimum inside of Nice would've been erased too?! Apparently not though, cause it activates and well gives everyone their abilities back. Dues Ex Machina everyone! We get a happy ending. Although maybe ending in a way that everyone has no abilities would've been better?! I dunno. \\n\\n\r\nThe story for this series took a huge dive and I'm sorry to spoil it, but aside from some pretty scenes and occasionally decent humor, the show just took a terrible story telling twist that can't even keep it's facts straight from the first series. \\n\\n\r\nThis is with out even talking about all the issues with the organization all the Minimum Holders come from and how it relates to the government, and why they are ever let out at all to live normal lives. I dunno huge glaring issues with the world lore thanks to season 2. \\n\\n\r\nIf you don't care about story and consistency though, then maybe this series will be entertaining for you.",
            "date": "2018-03-20T23:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 274424,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1790941.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheMaverickk",
                "username": "TheMaverickk"
            },
            "url": "https://myanimelist.net/reviews.php?id=274424"
        }
    ]
]