[
    [
        {
            "content": "My God, as if they couldn't do worse than the first season of this tripe. \r\nI can't see how anyone in their right mind would think that this is a good anime. Firstly, the story is so ridiculously melodramatic, convenient and just plain old unbelievable. \r\nIn fact, so much of it is redundant. Ooh, to spice things up a bit, rather than just having all the passive gay guys get victimised, let them get victimised by relatives of and friends of and co-workers of their lovers! Everyone loves infidelity!\r\nJust it makes no sense, since we all know they won't cheat since they're SUCH GOOD GUYS.So then, what was the point of even including that in the plot?! \\n\\n\r\nThe art is still dirt poor as always. Ugliest gay guys I ever saw, I thought gay dudes were supposed to be fabulous? These weren't. And the sound is still lame. The theme songs are awful. \\n\\n\r\nCharacters, ha! Only a bunch of immature, horny bastards who cannot understand the concept of love but understand the concept of butt secks very well. They don't grow, change, develop. In fact, they spend so much time wallowing in angst and self-pity and jealously that it's a wonder that they're not all thirteen years old. \\n\\n\r\nThen again, only thirteen year olds would watch this.",
            "date": "2009-03-24T05:10:00+00:00",
            "helpful_count": 143,
            "mal_id": 13427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=13427"
        },
        {
            "content": "The second season or half as some may put it, was outstanding. This portion of Junjou Romantica entailed more drama, more harsh realities and sense of compassion and love within each of the stories. The main focus set eyes on Usagi and Misaki which, let's be real, is the best OTP going. Their growing relationship became more obvious and open with each other. We finally get to see a less embarrassed side to Misaki (Manly?)  which lifted a worry off my shoulders, as I thought this season would end the same as it began - shy, awkward Misaki. His development was quite impressive, likewatching your own child grow up and fly out of the nest. I noticed placement of the other characters in different scenes which sort of made me go \"Ohh look there's the other guy! Cool!\". \\n\\n\r\nThe sub stories were touched lightly - more so for Myagi and Shinobu (2 episodes I think?). Hiroki and Nowaki had some serious issues, but their stories were the ones I found myself nearly in tears for, it really warms the heart. I am surprised how much climax and resolve they managed to squeeze in without over crowding the episodes and straying too much from the Main MC's story. \\n\\n\r\nAs mentioned earlier, there is a lot more drama involved in this section than there was in the first. We jumped from rom-com to rom-rama which was what I never knew I wanted and I was surprised and satisfied all the same. The romance never dies, which I was even more happy for and they played a little on family, giving a realistic feel towards the harsh judgement of BL.\\n\\n\r\nSome of the ecchi scenes looked a little forced but when conflict was always resolved there was a line i think Misaki said (?) that went something like \"If I didn't want it, I could have just left and never came back\" which solved every issue I had right there. Heres hoping for Season 3 this Spring!!!\\n",
            "date": "2015-04-30T07:05:00+00:00",
            "helpful_count": 17,
            "mal_id": 186823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Utsusemi1",
                "username": "Utsusemi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=186823"
        },
        {
            "content": "******this is a spoiler free******\r\nIS THIS EVEN PG 13 =_= \r\n3S and 3M \r\nToo many Usagi X Misaki :( \r\nThis is my 1st time rewatching this series\r\nStory: 7/10 \r\nIts split into 3 different couples . But they are somehow being linked to each other (relationship) . Well in season 1 they juz started like : \" Hey! There's NO WAY im gonna love a guy\" but in season 2 they eventually accept each other . In season 2 the plot is being carried on . Like the couples having arguments then get back again . Well this is normal is \"romance\" anime duh XD .There's nothing much for me say as i might spoil the anime . \\n\\n\r\nArt: 6/10 \\n\r\nV SHAPED FACE . Did they all went for plastic surgery? LOL . The legs are way TOO slim even for a guy haha then the body is big . And the hairstyle are kind of weird . The eyes are too big for guys in Misaki's case . They are kinda funny if you think properly hahaha\\n\\n\r\nSound:7/10 \\n\r\nThe opening song is not bad it is not really like the rock type but rather calming it fits this anime.I REALLY wondered WHY 90% of the shounen ai or yaoi anime have very good songs? Seriously like WHY? And they are sung by guys as well haha \\n\\n\r\nCharacter:6/10 \\n\r\nEach couple there's like a S and M . What pisses me off is that Misaki always says that he \"don't love\" Usagi but then he always give in . Just like when Misaki is angry then Usagi kissed him then he accepted it instead of rejecting it. Duh same goes for other couples . I like terrorist the most as its just cute and sweet.\\n\\n\r\nEnjoyment:6/10 \\n\r\nThis anime have WAY TOO MANY awkward moments . I am really hiding my face or turning down the volume XD . But i do enjoy it (some) . 1 thing i really like in this anime is that there's many LOVE TRIANGLE and i really love it ^^\\n\r\nIn fact in most shounen ai and yaoi anime or manga there's love triangle . It is special as its NOT harem i simply enjoy them :) \\n\\n\r\nOverall:7/10 \\n\r\nOverall its a sweet \"shounen ai\" anime though there's no such coincidence in this world . Watch this if ur like me who like to watch couples arguing  (i sound like a S =_=)",
            "date": "2015-03-13T08:40:00+00:00",
            "helpful_count": 12,
            "mal_id": 182264,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=182264"
        },
        {
            "content": "Nine again because of the third couple. I just really do not enjoy them. This season was the wrap up for all three, but I kind of feel like Misaki and Usagi's story needed an episode more or two.\r\nBut anyways I loved this season! I did not like Usagi's father and brother, i think they both were being childish and ridiculous, especially his brother.He didn't seem to be very bright in one episode and even after his side fo the story came out as to why he acted and does what he does, it still didn't do enough for me to see him in adifferent light. He was still childish.\\n\\n\r\nWith Hiro and Nowaki's story I think it was cute. I'mma have to disagree with Hiro though about the age gap. There's nothing wrong with it. and I didn't really think he was as shy as he was apparently suppose to be. i think the writers could have done a better job with it. He just came off as indifferent and  whatever-ish to me Like he was already taking the relationship for granted like they already fell into some routine or something.\\n\\n\r\nToo bad there isn't a third season. I think it would be just as much of a success as the first two.",
            "date": "2013-09-01T08:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 111835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182527.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hachiko75",
                "username": "Hachiko75"
            },
            "url": "https://myanimelist.net/reviews.php?id=111835"
        },
        {
            "content": "Junjou Romantica. My first introduction to Yaoi. \r\nI was linked this by a friend, and at first turned my nose up at it, thinking it would be all dirt and guy on guy love. But, as I got further into the episodes, I found myself hooked; yearning for more seasons of this outstanding anime. \r\nThe compelling and heart wrenching story-lines are intricately woven throughout the comedy, which had me rolling on the floor laughing. \r\nThis stunner of an Anime really is worth the watch, and will have you laughing one minute; crying the next.",
            "date": "2010-09-24T06:35:00+00:00",
            "helpful_count": 8,
            "mal_id": 30750,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/387156.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HanaHiroshi",
                "username": "HanaHiroshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=30750"
        },
        {
            "content": "this was awsome......well the first was better but.....this one was not that bad .....it talks about  Usami's family and there feed back on the relationship with misaki...n the twist that they put in it Usami's brother falling for misaki was also awsome.....the ending was the best part of the whole thing when Usami's father finally accepted misaki and the relationship that they had......it truley showed how much Usami loved misaki and how they can't live witout each other...i was totally turned on by the way they expressed there love for each other...and even though misaki does not want to admit that he's in lovewit someone of the same sex he still shows that he loves Usami.THIS WAS SOOOOOOO GREAT I JUST WANT TO WATCH IT AGAIN",
            "date": "2009-04-04T12:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 13829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10504.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tanola",
                "username": "tanola"
            },
            "url": "https://myanimelist.net/reviews.php?id=13829"
        },
        {
            "content": "Whelp, I'm assuming that if you're reading the reviews for season two, then you likely already watched season one. Either that, or you're like me-- you like to watch every anime you start to completion, and you just wanted to see what you're in for. Regardless of what brought you here, I'm going to give it to you straight-- if you're here after liking the first season or liking shows akin to the first season of this anime, then you're definitely in the right place. This anime is for you. I can't say that this season is the same level as season one, but itcaters to all of the same tastes. \\n\\n\r\nLet's start off by talking plot. Last time around, I mentioned in my review that this anime had very little plot. Well, seems that the anime gods heard me (or I asked for the same thing that everyone else wanted, seeing as I'm writing this years after the show aired, haha!) and added more than just makeouts and smutty scenes to this season. However, to people who like the other couples more than they like Akihiko and Misaki, I have to apologize-- our main couple completely hogs the spotlight this time around. The others are barely even in it other than for an episode or two, and even then, they just domestic troubles opposed to the smutty goodness I suppose most of the viewers want. Not being particularly what one would classify as a fujioshi, I was actually surprised that they managed to make their semblance of plot into a sexual undertone anyways. It's kinda cheap-- they use predictable elements and just make complicated love triangles and sexual assault-y situations for fan service, really. But this isn't a completely negative review!! Stick around. :) \\n\\n\r\nAs for the art, I can say that it has improved. It's by no means good art, but it's much better than the first season. A lot of things still seem lazy about it, and all the human forms look really unnatural and creepy, but at least they don't look like somebody drew them with their eyes closed anymore. It's slightly more refined, basically. \\n\\n\r\nI still have a problem with the background music being too cheery while rape is essentially happening, but other than that, I think they did a pretty good job with it. Again, the OP was pretty good, but I found the closing pretty boring. The voice actors were forgettable, but nobody was especially grating, so it's not a big deal. \\n\\n\r\nThe characters got a lot better. I appreciate that they recognized what was happening was rape. Was I bothered Misaki fell in love with his rapist? Yes. Do I still think Akihiko is hot? Unfortunately, yes, even as much as I hate myself for it. There was significant development in the characters of the other two couples, but Misaki and Akihiko remained kinda consistently flat. The introduction of Aki's family did help the situation, but it seemed forced to me either way. \\n\\n\r\nI know this entire time it sounds like I'm insulting the show, but in the end, I really enjoyed it too. And I hate myself for enjoying it. It has events and romances that are unhealthy, abusive, and unrealistic, but as much as I go off harping about all the bad things about this show, it's become a guilty pleasure. So make your own decision-- can you live with yourself after liking something against pretty much all of your values and beliefs about consent? Can you like with something that fetishizes and makes pretty much soft porn out of a an entire sexuality? After answering these questions, I think you can take a go at this. :) \\n\\n\r\nI would recommend this if you: liked the first season, like Misaki and Akihiko, like love triangles/boy magnet ukes\\n\\n\r\nI would NOT recommend this if you: didn't like the first season, like the other couples better than our main, don't like love triangles\\n\\n\r\nHave a great day everyone!  \\n",
            "date": "2018-07-17T16:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 284195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=284195"
        },
        {
            "content": "I don't really know how one should properly grade or rate animes based on all the different factors that make one up. And I obviously have seen other lists, blogs, comments etc. that have said this is so terrible and that the story is uninteresting or makes no sense. Honestly, I can kinda see where some of that comes from. But, I don't know what the hell it is about this anime, but every episode I watch makes my stomach hurt...in a good way, I guess. For some reason, even though I know all the characters would never cheat on each other (because they areso cheesily in love with each other), everytime some problem is presented my jaws clench, my heart stops, and I find myself watching and not blinking until it is resolved, no matter how many episodes it takes. I watched this season in one sitting and I hadn't even realized how long i'd been watching. Everything the story lacks is made up by the characters. They are the things that made it possible to sit through this super sappy and super gay anime. So, fuck it, I give it a 9/10 would (and have) watch again.",
            "date": "2017-06-12T00:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 249741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6202257.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BasicLush",
                "username": "BasicLush"
            },
            "url": "https://myanimelist.net/reviews.php?id=249741"
        },
        {
            "content": "It's my first yaoi and im amazed how much tenderness and emotional drive is to be found here !\r\nOne thing that i never seen depicted in a more common anime patern is the potential of visage mimic of the (male) characters and that's where the 'it's not cartoon it's anime' comes from. To draw good anime you have to be a good psychologist, both in terms of narrative and characteral plastic design. \r\nEven if this expresionism come as a trait characteristic of this genre, i can whitout a doubt say that in this anime is an outstanding characteristic.",
            "date": "2010-04-24T22:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 25411,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/320206.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shakiri",
                "username": "Shakiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=25411"
        },
        {
            "content": "I have never had a huge desire to watch or read yaoi or BL before.  But while looking for an anime to watch I came across Junjou and thought the artwork was good and the story sounded good.  Yeah I didn't get a yaoi vibe at all, not sure why but anyway.\r\nI was a little lost since I watched season 2 before 1 but it was cute and funny so I kept watching.  The story and characters really pulled me in and by the end of the second episode I was searching for where I could watch season one.  I hadsuch absolute fun watching this and there were so many times I found myself tearing up or feeling so utterly embarrassed for the characters. \\n\\n\r\nI am so happy that this was my welcome to the wonderful world of yaoi and BL because I could not think of one better, well exception being Sekaiichi Hatsukoi.  I would suggest this for anyone who wants to broaden their anime genre horizons.  You will not be disappointed.  The only problem might be you will find yourself searching out more and more yaoi and BL anime and manga like me.\\n\\n\r\nJunjou is on  my \"need a pick me up\" list of anime and manga now",
            "date": "2015-01-11T19:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 177475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4364561.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/meese49",
                "username": "meese49"
            },
            "url": "https://myanimelist.net/reviews.php?id=177475"
        },
        {
            "content": "*I'm not a big fan of manga so I know I've watched a good anime after I plan to read it's manga where the anime left off just to get more of the story.\r\nI watched Jonjou Romantica and Jonjou Romantica Season 2 a bit differently. According to the couples, I watched the Romantica episodes first, then the Terrorist, following by the Egoist episodes. For me, it made the stories easier to follow and that much more enjoyable. I loved being able to recognize a conection between the 3 couples such as Miaski purchasing flowers from the Egoist couple's Nowaki. The first time I started watchingJonjou Romantica(season 1) I loved the Romantica couple but when they started pulling these other couples out of know where I became disinterested and the idea of skiping around didn't occor to me. I eventually gave the series another try and I'm very glad I did. \\n\\n\r\nI was pretty skeptical for this being my first time watching a Yaoi but I think I enjoyed it as much as I would or maybe more any other anime. I easily really got attatched to each couple which is probally why I liked it so much. Regardless of how unsightly a plot can be if there are good characters it cancels it out. Although it wasn't nessisarily the case here. There was a probally in mostly every episode which usually tugged at my heart and be kindly resolved at the end which I'm greatful for, if I care about the character I need a happy ending. \\n\\n\r\nIf you aren't ecspecially tollerent with this show like I was, you'll probally dislike how each couple basicly has the similar sort of same problems/plot but for me, I was okay with it. What I wasn't okay with is how annoying some of the tsundere were, always denying how they felt and pushing the one they love away with their always angry faces, geez. In the case, the character development must've been was REALLY good so it made up for it. Even the tsundere were still characters I loved characters.\\n\\n\r\nThe art; Eh, my only complaint about it is that most of the characters looked too much alike which might turn someone off from this anime because of getting confused. But each character was drawn very good looking, I must say. I liked the way they potrayed the comedy scenes as well.\\n\\n\r\nI even took me a long time to get through one episode because of how many scenes I kept replaying. Jonjou Romantica 2 was a really good time for me, just as the first season. \\n",
            "date": "2012-06-19T02:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 63789,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332867.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wuddupashley",
                "username": "Wuddupashley"
            },
            "url": "https://myanimelist.net/reviews.php?id=63789"
        },
        {
            "content": "There are some really vicious reviews here but I found this anime really enjoyable, and not just because I have an affinity for shonen ai. (some light spoilers in the character section).\r\nArt - While the art is pretty simple, and sometimes their proportions are off, I think the characters are really cute, and the females are adorable too.\r\nSound - uhh, well the Japanese dubbing is good. I love Usami/Usagi's voice. And the opening themes are pretty good. \r\nCharacters - I found all of them really enjoyable, especially Usagi and Misaki, though they both have their flaws. Nearly every main character and side character is enjoyableto watch, though. If you haven't seen any seasons of this show, skip the rest of this part.............. Anyone who's watched at least one season knows how Usagi is quite forceful about his affection to Misaki. I see how this is sketchy, but remember this attitude is really popular in this genre for some reason, maybe stemming from the idea that women have fantasies about take-charge men? (and the genre is generally written for females) idk..........but we know it's not okay in real life. If it bothers you too much, you probably didn't finish season 1. We also know Misaki does like him and said himself that he'd try harder to stop him if he didn't actually want it. This is also gets annoying on HIS part, though, how often he acts like he doesn't like him. But they're still both adorable, especially Usagi's romantic side. Nowaki and Hiroki always seem to have their frustrating problems, but they're still enjoyable, too. \\n\\n\r\nEnjoyment - This series is hilarious and super freaking cute (and sometimes steamy) if you like romance and anime boys being together. I personally find the drama enjoyable too because I like some angst in my shows, and I don't expect it to be super realistic, since it's fiction. Anyways, all in all I found this series really fun to watch so far. The story may not be genius or super realistic, but it's still good, cute, and funny. 8/10. The most annoying thing through a lot of this series is Misaki still acting like nothing is going on and acting like Usagi is a weird pervert.",
            "date": "2017-09-09T00:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 257150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6408168.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shayne112",
                "username": "shayne112"
            },
            "url": "https://myanimelist.net/reviews.php?id=257150"
        },
        {
            "content": "I gave the first season a 7 (Good) and after watching this season, I'm going to have to give it the same rating. It had the same pace as the first season, and wasn't too slow because if it was, I wouldn't have watched all 12 episodes in one sitting. I noticed this season had much more to do with Misaki and Usami than the first season did. I wanted to see more of the second couple since they became my favorite in the first anime. Well it wasn't too disappointing. I enjoyed seeing the two main characters grow and get to know each other.\r\nImust admit, I would have liked it if this second season got a better rating than the first. It's still entertaining, still funny, and still makes you shake your head sometimes are how idiotic some characters can be lol\\n\\n\r\nI was surprised to hear that after so many years they released a season 3. Gonna look into that later on. Hopefully it's better. For now, though, I'm going to try out the manga, and see what it's like. Hopefully it's better, as mangas are usually better than anime adaptations.",
            "date": "2015-12-19T22:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 206072,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=206072"
        }
    ],
    [
        {
            "content": "My God, as if they couldn't do worse than the first season of this tripe. \r\nI can't see how anyone in their right mind would think that this is a good anime. Firstly, the story is so ridiculously melodramatic, convenient and just plain old unbelievable. \r\nIn fact, so much of it is redundant. Ooh, to spice things up a bit, rather than just having all the passive gay guys get victimised, let them get victimised by relatives of and friends of and co-workers of their lovers! Everyone loves infidelity!\r\nJust it makes no sense, since we all know they won't cheat since they're SUCH GOOD GUYS.So then, what was the point of even including that in the plot?! \\n\\n\r\nThe art is still dirt poor as always. Ugliest gay guys I ever saw, I thought gay dudes were supposed to be fabulous? These weren't. And the sound is still lame. The theme songs are awful. \\n\\n\r\nCharacters, ha! Only a bunch of immature, horny bastards who cannot understand the concept of love but understand the concept of butt secks very well. They don't grow, change, develop. In fact, they spend so much time wallowing in angst and self-pity and jealously that it's a wonder that they're not all thirteen years old. \\n\\n\r\nThen again, only thirteen year olds would watch this.",
            "date": "2009-03-24T05:10:00+00:00",
            "helpful_count": 143,
            "mal_id": 13427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=13427"
        },
        {
            "content": "The second season or half as some may put it, was outstanding. This portion of Junjou Romantica entailed more drama, more harsh realities and sense of compassion and love within each of the stories. The main focus set eyes on Usagi and Misaki which, let's be real, is the best OTP going. Their growing relationship became more obvious and open with each other. We finally get to see a less embarrassed side to Misaki (Manly?)  which lifted a worry off my shoulders, as I thought this season would end the same as it began - shy, awkward Misaki. His development was quite impressive, likewatching your own child grow up and fly out of the nest. I noticed placement of the other characters in different scenes which sort of made me go \"Ohh look there's the other guy! Cool!\". \\n\\n\r\nThe sub stories were touched lightly - more so for Myagi and Shinobu (2 episodes I think?). Hiroki and Nowaki had some serious issues, but their stories were the ones I found myself nearly in tears for, it really warms the heart. I am surprised how much climax and resolve they managed to squeeze in without over crowding the episodes and straying too much from the Main MC's story. \\n\\n\r\nAs mentioned earlier, there is a lot more drama involved in this section than there was in the first. We jumped from rom-com to rom-rama which was what I never knew I wanted and I was surprised and satisfied all the same. The romance never dies, which I was even more happy for and they played a little on family, giving a realistic feel towards the harsh judgement of BL.\\n\\n\r\nSome of the ecchi scenes looked a little forced but when conflict was always resolved there was a line i think Misaki said (?) that went something like \"If I didn't want it, I could have just left and never came back\" which solved every issue I had right there. Heres hoping for Season 3 this Spring!!!\\n",
            "date": "2015-04-30T07:05:00+00:00",
            "helpful_count": 17,
            "mal_id": 186823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Utsusemi1",
                "username": "Utsusemi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=186823"
        },
        {
            "content": "******this is a spoiler free******\r\nIS THIS EVEN PG 13 =_= \r\n3S and 3M \r\nToo many Usagi X Misaki :( \r\nThis is my 1st time rewatching this series\r\nStory: 7/10 \r\nIts split into 3 different couples . But they are somehow being linked to each other (relationship) . Well in season 1 they juz started like : \" Hey! There's NO WAY im gonna love a guy\" but in season 2 they eventually accept each other . In season 2 the plot is being carried on . Like the couples having arguments then get back again . Well this is normal is \"romance\" anime duh XD .There's nothing much for me say as i might spoil the anime . \\n\\n\r\nArt: 6/10 \\n\r\nV SHAPED FACE . Did they all went for plastic surgery? LOL . The legs are way TOO slim even for a guy haha then the body is big . And the hairstyle are kind of weird . The eyes are too big for guys in Misaki's case . They are kinda funny if you think properly hahaha\\n\\n\r\nSound:7/10 \\n\r\nThe opening song is not bad it is not really like the rock type but rather calming it fits this anime.I REALLY wondered WHY 90% of the shounen ai or yaoi anime have very good songs? Seriously like WHY? And they are sung by guys as well haha \\n\\n\r\nCharacter:6/10 \\n\r\nEach couple there's like a S and M . What pisses me off is that Misaki always says that he \"don't love\" Usagi but then he always give in . Just like when Misaki is angry then Usagi kissed him then he accepted it instead of rejecting it. Duh same goes for other couples . I like terrorist the most as its just cute and sweet.\\n\\n\r\nEnjoyment:6/10 \\n\r\nThis anime have WAY TOO MANY awkward moments . I am really hiding my face or turning down the volume XD . But i do enjoy it (some) . 1 thing i really like in this anime is that there's many LOVE TRIANGLE and i really love it ^^\\n\r\nIn fact in most shounen ai and yaoi anime or manga there's love triangle . It is special as its NOT harem i simply enjoy them :) \\n\\n\r\nOverall:7/10 \\n\r\nOverall its a sweet \"shounen ai\" anime though there's no such coincidence in this world . Watch this if ur like me who like to watch couples arguing  (i sound like a S =_=)",
            "date": "2015-03-13T08:40:00+00:00",
            "helpful_count": 12,
            "mal_id": 182264,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=182264"
        },
        {
            "content": "Nine again because of the third couple. I just really do not enjoy them. This season was the wrap up for all three, but I kind of feel like Misaki and Usagi's story needed an episode more or two.\r\nBut anyways I loved this season! I did not like Usagi's father and brother, i think they both were being childish and ridiculous, especially his brother.He didn't seem to be very bright in one episode and even after his side fo the story came out as to why he acted and does what he does, it still didn't do enough for me to see him in adifferent light. He was still childish.\\n\\n\r\nWith Hiro and Nowaki's story I think it was cute. I'mma have to disagree with Hiro though about the age gap. There's nothing wrong with it. and I didn't really think he was as shy as he was apparently suppose to be. i think the writers could have done a better job with it. He just came off as indifferent and  whatever-ish to me Like he was already taking the relationship for granted like they already fell into some routine or something.\\n\\n\r\nToo bad there isn't a third season. I think it would be just as much of a success as the first two.",
            "date": "2013-09-01T08:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 111835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/182527.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hachiko75",
                "username": "Hachiko75"
            },
            "url": "https://myanimelist.net/reviews.php?id=111835"
        },
        {
            "content": "Junjou Romantica. My first introduction to Yaoi. \r\nI was linked this by a friend, and at first turned my nose up at it, thinking it would be all dirt and guy on guy love. But, as I got further into the episodes, I found myself hooked; yearning for more seasons of this outstanding anime. \r\nThe compelling and heart wrenching story-lines are intricately woven throughout the comedy, which had me rolling on the floor laughing. \r\nThis stunner of an Anime really is worth the watch, and will have you laughing one minute; crying the next.",
            "date": "2010-09-24T06:35:00+00:00",
            "helpful_count": 8,
            "mal_id": 30750,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/387156.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HanaHiroshi",
                "username": "HanaHiroshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=30750"
        },
        {
            "content": "this was awsome......well the first was better but.....this one was not that bad .....it talks about  Usami's family and there feed back on the relationship with misaki...n the twist that they put in it Usami's brother falling for misaki was also awsome.....the ending was the best part of the whole thing when Usami's father finally accepted misaki and the relationship that they had......it truley showed how much Usami loved misaki and how they can't live witout each other...i was totally turned on by the way they expressed there love for each other...and even though misaki does not want to admit that he's in lovewit someone of the same sex he still shows that he loves Usami.THIS WAS SOOOOOOO GREAT I JUST WANT TO WATCH IT AGAIN",
            "date": "2009-04-04T12:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 13829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10504.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tanola",
                "username": "tanola"
            },
            "url": "https://myanimelist.net/reviews.php?id=13829"
        },
        {
            "content": "Whelp, I'm assuming that if you're reading the reviews for season two, then you likely already watched season one. Either that, or you're like me-- you like to watch every anime you start to completion, and you just wanted to see what you're in for. Regardless of what brought you here, I'm going to give it to you straight-- if you're here after liking the first season or liking shows akin to the first season of this anime, then you're definitely in the right place. This anime is for you. I can't say that this season is the same level as season one, but itcaters to all of the same tastes. \\n\\n\r\nLet's start off by talking plot. Last time around, I mentioned in my review that this anime had very little plot. Well, seems that the anime gods heard me (or I asked for the same thing that everyone else wanted, seeing as I'm writing this years after the show aired, haha!) and added more than just makeouts and smutty scenes to this season. However, to people who like the other couples more than they like Akihiko and Misaki, I have to apologize-- our main couple completely hogs the spotlight this time around. The others are barely even in it other than for an episode or two, and even then, they just domestic troubles opposed to the smutty goodness I suppose most of the viewers want. Not being particularly what one would classify as a fujioshi, I was actually surprised that they managed to make their semblance of plot into a sexual undertone anyways. It's kinda cheap-- they use predictable elements and just make complicated love triangles and sexual assault-y situations for fan service, really. But this isn't a completely negative review!! Stick around. :) \\n\\n\r\nAs for the art, I can say that it has improved. It's by no means good art, but it's much better than the first season. A lot of things still seem lazy about it, and all the human forms look really unnatural and creepy, but at least they don't look like somebody drew them with their eyes closed anymore. It's slightly more refined, basically. \\n\\n\r\nI still have a problem with the background music being too cheery while rape is essentially happening, but other than that, I think they did a pretty good job with it. Again, the OP was pretty good, but I found the closing pretty boring. The voice actors were forgettable, but nobody was especially grating, so it's not a big deal. \\n\\n\r\nThe characters got a lot better. I appreciate that they recognized what was happening was rape. Was I bothered Misaki fell in love with his rapist? Yes. Do I still think Akihiko is hot? Unfortunately, yes, even as much as I hate myself for it. There was significant development in the characters of the other two couples, but Misaki and Akihiko remained kinda consistently flat. The introduction of Aki's family did help the situation, but it seemed forced to me either way. \\n\\n\r\nI know this entire time it sounds like I'm insulting the show, but in the end, I really enjoyed it too. And I hate myself for enjoying it. It has events and romances that are unhealthy, abusive, and unrealistic, but as much as I go off harping about all the bad things about this show, it's become a guilty pleasure. So make your own decision-- can you live with yourself after liking something against pretty much all of your values and beliefs about consent? Can you like with something that fetishizes and makes pretty much soft porn out of a an entire sexuality? After answering these questions, I think you can take a go at this. :) \\n\\n\r\nI would recommend this if you: liked the first season, like Misaki and Akihiko, like love triangles/boy magnet ukes\\n\\n\r\nI would NOT recommend this if you: didn't like the first season, like the other couples better than our main, don't like love triangles\\n\\n\r\nHave a great day everyone!  \\n",
            "date": "2018-07-17T16:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 284195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=284195"
        },
        {
            "content": "I don't really know how one should properly grade or rate animes based on all the different factors that make one up. And I obviously have seen other lists, blogs, comments etc. that have said this is so terrible and that the story is uninteresting or makes no sense. Honestly, I can kinda see where some of that comes from. But, I don't know what the hell it is about this anime, but every episode I watch makes my stomach hurt...in a good way, I guess. For some reason, even though I know all the characters would never cheat on each other (because they areso cheesily in love with each other), everytime some problem is presented my jaws clench, my heart stops, and I find myself watching and not blinking until it is resolved, no matter how many episodes it takes. I watched this season in one sitting and I hadn't even realized how long i'd been watching. Everything the story lacks is made up by the characters. They are the things that made it possible to sit through this super sappy and super gay anime. So, fuck it, I give it a 9/10 would (and have) watch again.",
            "date": "2017-06-12T00:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 249741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6202257.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BasicLush",
                "username": "BasicLush"
            },
            "url": "https://myanimelist.net/reviews.php?id=249741"
        },
        {
            "content": "It's my first yaoi and im amazed how much tenderness and emotional drive is to be found here !\r\nOne thing that i never seen depicted in a more common anime patern is the potential of visage mimic of the (male) characters and that's where the 'it's not cartoon it's anime' comes from. To draw good anime you have to be a good psychologist, both in terms of narrative and characteral plastic design. \r\nEven if this expresionism come as a trait characteristic of this genre, i can whitout a doubt say that in this anime is an outstanding characteristic.",
            "date": "2010-04-24T22:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 25411,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/320206.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shakiri",
                "username": "Shakiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=25411"
        },
        {
            "content": "I have never had a huge desire to watch or read yaoi or BL before.  But while looking for an anime to watch I came across Junjou and thought the artwork was good and the story sounded good.  Yeah I didn't get a yaoi vibe at all, not sure why but anyway.\r\nI was a little lost since I watched season 2 before 1 but it was cute and funny so I kept watching.  The story and characters really pulled me in and by the end of the second episode I was searching for where I could watch season one.  I hadsuch absolute fun watching this and there were so many times I found myself tearing up or feeling so utterly embarrassed for the characters. \\n\\n\r\nI am so happy that this was my welcome to the wonderful world of yaoi and BL because I could not think of one better, well exception being Sekaiichi Hatsukoi.  I would suggest this for anyone who wants to broaden their anime genre horizons.  You will not be disappointed.  The only problem might be you will find yourself searching out more and more yaoi and BL anime and manga like me.\\n\\n\r\nJunjou is on  my \"need a pick me up\" list of anime and manga now",
            "date": "2015-01-11T19:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 177475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4364561.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/meese49",
                "username": "meese49"
            },
            "url": "https://myanimelist.net/reviews.php?id=177475"
        },
        {
            "content": "*I'm not a big fan of manga so I know I've watched a good anime after I plan to read it's manga where the anime left off just to get more of the story.\r\nI watched Jonjou Romantica and Jonjou Romantica Season 2 a bit differently. According to the couples, I watched the Romantica episodes first, then the Terrorist, following by the Egoist episodes. For me, it made the stories easier to follow and that much more enjoyable. I loved being able to recognize a conection between the 3 couples such as Miaski purchasing flowers from the Egoist couple's Nowaki. The first time I started watchingJonjou Romantica(season 1) I loved the Romantica couple but when they started pulling these other couples out of know where I became disinterested and the idea of skiping around didn't occor to me. I eventually gave the series another try and I'm very glad I did. \\n\\n\r\nI was pretty skeptical for this being my first time watching a Yaoi but I think I enjoyed it as much as I would or maybe more any other anime. I easily really got attatched to each couple which is probally why I liked it so much. Regardless of how unsightly a plot can be if there are good characters it cancels it out. Although it wasn't nessisarily the case here. There was a probally in mostly every episode which usually tugged at my heart and be kindly resolved at the end which I'm greatful for, if I care about the character I need a happy ending. \\n\\n\r\nIf you aren't ecspecially tollerent with this show like I was, you'll probally dislike how each couple basicly has the similar sort of same problems/plot but for me, I was okay with it. What I wasn't okay with is how annoying some of the tsundere were, always denying how they felt and pushing the one they love away with their always angry faces, geez. In the case, the character development must've been was REALLY good so it made up for it. Even the tsundere were still characters I loved characters.\\n\\n\r\nThe art; Eh, my only complaint about it is that most of the characters looked too much alike which might turn someone off from this anime because of getting confused. But each character was drawn very good looking, I must say. I liked the way they potrayed the comedy scenes as well.\\n\\n\r\nI even took me a long time to get through one episode because of how many scenes I kept replaying. Jonjou Romantica 2 was a really good time for me, just as the first season. \\n",
            "date": "2012-06-19T02:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 63789,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332867.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wuddupashley",
                "username": "Wuddupashley"
            },
            "url": "https://myanimelist.net/reviews.php?id=63789"
        },
        {
            "content": "There are some really vicious reviews here but I found this anime really enjoyable, and not just because I have an affinity for shonen ai. (some light spoilers in the character section).\r\nArt - While the art is pretty simple, and sometimes their proportions are off, I think the characters are really cute, and the females are adorable too.\r\nSound - uhh, well the Japanese dubbing is good. I love Usami/Usagi's voice. And the opening themes are pretty good. \r\nCharacters - I found all of them really enjoyable, especially Usagi and Misaki, though they both have their flaws. Nearly every main character and side character is enjoyableto watch, though. If you haven't seen any seasons of this show, skip the rest of this part.............. Anyone who's watched at least one season knows how Usagi is quite forceful about his affection to Misaki. I see how this is sketchy, but remember this attitude is really popular in this genre for some reason, maybe stemming from the idea that women have fantasies about take-charge men? (and the genre is generally written for females) idk..........but we know it's not okay in real life. If it bothers you too much, you probably didn't finish season 1. We also know Misaki does like him and said himself that he'd try harder to stop him if he didn't actually want it. This is also gets annoying on HIS part, though, how often he acts like he doesn't like him. But they're still both adorable, especially Usagi's romantic side. Nowaki and Hiroki always seem to have their frustrating problems, but they're still enjoyable, too. \\n\\n\r\nEnjoyment - This series is hilarious and super freaking cute (and sometimes steamy) if you like romance and anime boys being together. I personally find the drama enjoyable too because I like some angst in my shows, and I don't expect it to be super realistic, since it's fiction. Anyways, all in all I found this series really fun to watch so far. The story may not be genius or super realistic, but it's still good, cute, and funny. 8/10. The most annoying thing through a lot of this series is Misaki still acting like nothing is going on and acting like Usagi is a weird pervert.",
            "date": "2017-09-09T00:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 257150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6408168.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shayne112",
                "username": "shayne112"
            },
            "url": "https://myanimelist.net/reviews.php?id=257150"
        },
        {
            "content": "I gave the first season a 7 (Good) and after watching this season, I'm going to have to give it the same rating. It had the same pace as the first season, and wasn't too slow because if it was, I wouldn't have watched all 12 episodes in one sitting. I noticed this season had much more to do with Misaki and Usami than the first season did. I wanted to see more of the second couple since they became my favorite in the first anime. Well it wasn't too disappointing. I enjoyed seeing the two main characters grow and get to know each other.\r\nImust admit, I would have liked it if this second season got a better rating than the first. It's still entertaining, still funny, and still makes you shake your head sometimes are how idiotic some characters can be lol\\n\\n\r\nI was surprised to hear that after so many years they released a season 3. Gonna look into that later on. Hopefully it's better. For now, though, I'm going to try out the manga, and see what it's like. Hopefully it's better, as mangas are usually better than anime adaptations.",
            "date": "2015-12-19T22:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 206072,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=206072"
        }
    ]
]