[
    [
        {
            "content": "Hey there!\r\nSo I just got done watching Brothers Conflict, the shoujo anime of the summer season 2013. So in Brothers Conflict we are following Ema Hinata, a young girl of 16 years old that decided to live with her 13 so called 'siblings' and here is where the trouble begins.\r\nStory: 4/10 The story is very simple, it is a reverse harem it speaks for itself. Girl lives with brothers, all the brothers want a piece of her (or at least most of them). The sad thing is that each episode basically jumps from brother to brother, the main character Ema doesn't form a strong bondwith any of the brothers because of the continuesly jumping from one to the other yet most of the brothers all want a romanctic relationship with her while they barely know anything about our main character Ema. But I will delve into this further in the character section.\\n\\n\r\nThe reason why I gave the story a 4/10 is because it is a very mainstream anime and not a lot happens, it is all centered around one question which is: who gets the girl? which is exactly the point of a reverse harem. The odd thing that bothers me is that  each time you see one of the brothers on screen with Ema they either hug her or kiss her or in the very least touch her and after all that happened she just carries on with her day like nothing of the sorts happened though she consiously knows how all of them feel about her but it just seems like she shrugs it off like it is an everyday thing. Although she proclaims to only want to be 'siblings' with her brothers she gradually allows any of the guys to kiss her and do anything with her as they please. \\n\\n\r\nFrom episode 1 she knows that they aren't really her siblings since her dad married their mother so technically non of them are related by blood only they are legally a family on paper. Eventhough she knows this she still continues to call them her 'siblings' which is disturbing since the fact that almost everyone of them want to have a romantic relationship with our main character Ema. Everytime she called them her siblings I found myself yelling at the screen 'You aren't siblings! realize that!'\\n\\n\r\nArt: 7/10 the art is basically the save and grace for this anime, the animation is beautiful and fluent, the backgrounds are spendidly done and of course the originality of each character is beautifully portrait. Each one of the brothers are easy to recognize by either hair style/hair color and the color of their eyes. The only downside I have on the art is that the emotions aren't easily recognizable on their faces. Even when they are happy they are very mediocre about it.\\n\\n\r\nSound: 5/10 the sound was very average in my opinion, each time the intro music and the outro music began to play I found myself skipping over it entirely since I didn't enjoy listening to them. The lyrics weren't the best either, the music is very upbeat and fast paced. Not that there is anything wrong with an upbeat song and I understand they needed to make a happy sounding opening/ending since it is a reverse harem and it is all about romance but I felt like it wasn't necessary. It wasn't bad so to say but it wasn't really enjoyable to me but that is just my personal opinion, each person has his or her own taste of music.\\n\\n\r\nCharacter: 3/10 The character development is very bad to say the least. Like I said before each episode focuses on one brother at a time and since we have 13 brothers in the house and our main character Ema, character development is very limited.\\n\\n\r\nNot to mention that Ema our lovely main character is as emotional as a brick wall. What is so appealing to her that almost every guy wants a romantic relationship with her? The only traits she has is that she is a nice and caring person and likes video games. That's it. Nothing more. \\n\\n\r\nThe fact annoys me that the brothers barely spoke with her and immediatly they have a crush on her, with some of the brothers she has a better connection then with the others but eventhough despite this most of them want her, is it because she is good looking? Not particularly, she looks like  an average young girl. Is it because of her character then? No because her emotions are turned off 24/7. So what is it? It is because she is our main character and so that makes it automatically the person everyone desires.\\n\\n\r\nBecause it has so many characters and only 12 episodes the character development was sadly nowhere to be found.\\n\\n\r\nEnjoyment: 7/10 despite all the negative aspects of this anime I found it rather enjoyable. not because of the story writing or the characters but mostly because I had a good laugh out of it, every time one of the guys had an encounter with Ema that didn't make any sense at all I found myself at least given a chuckle about this whole affair.\\n\\n\r\nI might give a little spoiler here but in one of the scenes one of the brothers realized he wanted to grow more before he can be a good man to her and it was a very dramatic scene with sad music playing in the background and you know that this was one of those scenes that was meant to make your heart break but instead I found myself laughing on the floor because especially that brother had barely any interactions with her at all.\\n\\n\r\nSo my overall score of this anime is a 5/10. If you are into the harem genre I would recommend it or either if you want to laugh at a romantic story that doesn't make any sense at all this is the anime for you! \\n\\n\r\nHopefully this was helpful\\n\\n\r\n~Ms9222",
            "date": "2013-09-18T02:59:00+00:00",
            "helpful_count": 235,
            "mal_id": 113285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474417.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ms9222",
                "username": "Ms9222"
            },
            "url": "https://myanimelist.net/reviews.php?id=113285"
        },
        {
            "content": "So I barely ever write reviews but I just have to share my opinions on this horrible anime.\r\nBrothers conflict is a reverse harem, and probably the worst one out there. I don't really dislike anime that easily, but this anime is the worst anime i've seen. (Ps: Excuse my horrible punctuation)\r\nStory-\r\nAlright, to sum it up it's basically about a girl who's always been alone in her childhood (excluding the squirrel) and then her father decides to marry a woman that has 13 sons (like seriously? wtf how could she conceive 13 boys without dying) anyway, she ends up moving to the house where 12 ofthe sons live. And of course, they all start liking her and fighting over her without reason. \\n\\n\r\nThe story was a pile of absolute shit.\\n\r\nit was very cliché (girl moving to a house/school full with boys) but that wasn't even the problem. It's not so much lacking comedy, the comedy is just horrible that it's basically non existant. They even manage to mess up the classic \"overreactions\" that anime characters usually make. The jokes that are made don't match the voice acting and the characters expressions, and just end up looking extremely awkward. The problems/events that happen during the anime are just plain dumb and make no sense - making the anime super boring.\\n\\n\r\nArt:\\n\\n\r\nI admit the art in this anime is not THAT bad, but i've seen alot better. The backgrounds are quite dull and boring. \\n\\n\r\nSound:\\n\\n\r\nOkay one of the few things that pissed me off was the fact that the voice of Wataru did NOT match the characters voice AT ALL. It's like placing a cute anime character in a cute shoujo setting but then giving him the voice of fucking godzilla or some shit. Some characters fit their voice actors but some absolutely don't. The squirrels voice was the most annoying out of all, but i'll get into that later. \\n\r\nAn character could be casually looking but the voice of it would be excited and laughing, Making the voice acting not match the actual expressions of the characters. I've also seen a few out of sync voice acting (when the character doesn't have their mouth open and moving but the voice is still playing).\\n\\n\r\nOther than character voices I enjoyed the theme song, and the ending song with the dance.\\n\\n\r\nCharacter: \\n\\n\r\nOh my god, the fucking squirrel. I can not handle that thing, it made me want to jump of a cliff. it was constantly ruining the mood and failed with it's attempts at jokes. Not even a funny type of 'ruining the mood' that usually happens within anime. As for the other characters : they're ok, some don't make fuckin sense in what they dobut basically the entire anime series doesn't make sense anyway. The heroine was really annoying, she wasn't standing up for herself or saying anything back, the anime could've been way better without a cliché annoying heroine.\\n\\n\r\nEnjoyment:\\n\\n\r\nNone, I got so bored watching this anime. It had so many flaws it made me focus more on them then the actual story.\\n\\n\r\nOverall:\\n\\n\r\nIt's a piece of shit, and even I, an reverse harem lover thought this was complete shit. \\n\\n\r\nThis anime makes Boku No Pico seem like heaven.",
            "date": "2014-12-09T11:14:00+00:00",
            "helpful_count": 97,
            "mal_id": 171573,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941591.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/mina24",
                "username": "mina24"
            },
            "url": "https://myanimelist.net/reviews.php?id=171573"
        },
        {
            "content": "Now, this is my first review ever and I feel I need to write it after seeing so many bad reviews about this anime.\r\nIn fact, the only reason I watched this anime was because I was curious after I read all these negative reviews. I wanted to see just how bad it was, and I'm glad I did. I went in with low expectations, and was pleasantly surprised. \r\nI will detail what I liked or didn't like about the anime, and will not focus on individual scores for story, characters, music etc. \r\n*spoilers*\r\nThe things I didn't like/understand >\r\n# The girl's character\r\n# Why everybody liked her.There was nothing special about her\\n\r\n# The squirrel (who also is in love with her)\\n\r\n# Why such unbelievably hot guys would instantly fall for someone so average.\\n\r\n# No romantic development - they just fall in love with her\\n\r\n# The eldest two bros showed no romantic interest in her (the lawyer was once left red faced, but that story line wasn't pursued)\\n\r\n# Why such a rich family has no servant\\n\\n\r\nThe things I liked>\\n\r\n# Unlike what many reviews here state, the brothers did have character development, some more than the others.\\n\r\n# Pleasantly surprised to see how well balanced these guys were - instead of fighting with each other over the girl, they gave her the option of choosing one of them. Very mature and very unexpected.\\n\r\n# I really liked the 2 guys who were shown to genuinely (according to me) like her - the red head and the sports guy.\\n\r\n# Every brother has a distinct personality\\n\r\n# The brothers are smoking hot.\\n\\n\r\nI'm sure there are more likes and dislikes, but only these come to mind now. It's a \"junk food\" type of anime where you watch it for the sake of watching it. I binge watched it in a day. Go in with low expectations and you'll be pleasantly surprised.\\n\\n\\n",
            "date": "2017-02-07T20:53:00+00:00",
            "helpful_count": 56,
            "mal_id": 240138,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5909765.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Sonal1988",
                "username": "Sonal1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=240138"
        },
        {
            "content": "I don't know what I was thinking when I decided to watch this anime. But I do know  watching this anime was a complete struggle. \r\nStory: The storyline is fairly simple: dad remarries, daughter moves in with 'brothers'-they certainly don't act like brothers-and 'shenanigans' ensue. Predictable and incredibly dull. Although this anime is only twelve episodes long, it felt longer and it was a chore for me to watch. I can't even remember how it ended. 1/10\r\nArt: I am just going to cut to the chase and say that I didn't like the art. While it is more appealing than the actual story, thatdoesn't really say a lot. The art is boring for lack of a better word. 3/10\\n\r\nSound: I despised the opening...it was tedious in every way possible. I don't have any words to describe how bad it is. 2/10\\n\r\nCharacters: Oh boy, on a scale of 1 to Haruka from Uta no Prince-sama on the irritating metre, the female protagonist is about as annoying and spineless as Haruka is. She barely reacted when her so-called brothers were being perverted and hitting on her. I  hoped that she would stand up for herself and tell them to back off. The vast majority of the characters fade into the background. 1/10\\n\r\nEnjoyment: Needless to say I didn't like this anime. At all. It was pure torture. 2/10",
            "date": "2014-07-30T07:07:00+00:00",
            "helpful_count": 56,
            "mal_id": 154433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/quirkista",
                "username": "quirkista"
            },
            "url": "https://myanimelist.net/reviews.php?id=154433"
        },
        {
            "content": "We all know that the internet has a lot of power nowadays. And it can raise a lot of awareness for all kinds of good causes, such as famine and natural disasters, but instead, the producers of this anime decided to use it for illustrating the dilemma that every young female has to face nowadays: with which of her 13 brothers does the main character want to start a romantic relationship? First world problems, right?\r\n~Story~ 1/10\r\nSo I kind of explained the plot of this show in one sentence in my introduction. The series is about Ema Hinata, a 16-year old girl, who's actually been aloneall of her life (can you already see the clichés coming?), and I'm excluding her stupid pet squirrel while making this statement. Basically, her life sucked until her father decided to marry a woman who has 13 (!) sons. And so Ema ends up with 13 new brothers, who are, of course, all deeply in love with her. I won't start about how unrealistic it is that a girl ends up with 13 brothers because of a remarriage, but what are the chances that ALL 13 OF THEM (including a toddler for God's sake) are in love with her? Every episode featured Ema with another brother, and it was all incredibly predictable and dull. Seriously, when I finished, it felt like I had watched around 50 episodes, and watching these 12 episodes (which felt like 50) felt like a chore. I'm not going to dig deeper into the story, because this is all there is to it. I'll admit it, maybe I'm just not the kind of person to enjoy reverse harems, but I can't imagine anyone else (apart from obsessive fictional bishounen-sensitive teens) enjoying this crap.\\n\r\n[CONCLUSION]\\n\r\nIt's debatable whether there's really a story in this. The comedy was lousy, and not in place, sometimes even cringeworthy. The \"plot\" was unrealistic and seriously stupid. Who came up with this?\\n\\n\r\n~Art~ 5/10\\n\r\nThe art in this wasn't the worst I've ever seen, but it definitely wasn't great. For some reason, every single dude in this looked like a chick, and there was even one brother that resembled a cat (yes, I'm talking about the perverted one). It had some pretty colors (to attract horny nose-bleeding teens, probably), but don't fall for them, this anime is still a pile of shit. A colorful pile of shit, but still a pile of shit.\\n\r\n[CONCLUSION]\\n\r\nColors everywhere, and males looked like females. It was so confusing that at one point, I couldn't even tell who was supposed to be a trap anymore.\\n\\n\r\n~Sound~ 4/10\\n\r\nOne word to describe the music in this: forgettable. The opening was a stereotypical reverse harem intro, so forgettable, I have no idea how it went anymore. The show probably had some OSTs, but umm yeah. Wait, I remember three things considering the sound in this. 1) The ending. I didn't know I was watching Uta no Prince-Sama? Nobody asked for those traumatizing ending visuals, but then again, nobody asked for this piece-of-shit-anime either... \"Kissu kissu, Ai need ur lavu\"... 2) The voice of that damned squirrel. At one point, I was just irritated beyond belief, to the point where I actually wanted to set my computer on fire, so that I could see that stupid rodent with its stupid voice finally burn. 3) The voice of that toddler..... Woah. You know how some things are called a match made in heaven? Yeah, the character and the voice of the toddler were the complete opposite of that. It was as if Jigsaw was trying to convince the viewers of his cuteness. Seriously, no toddler has a voice that low. \\n\r\n[CONCLUSION]\\n\r\nMost of this was below average, and the voice acting was rather bad.\\n\\n\r\n~Characters~ 1/10\\n\r\nWell, this should be fun. I'll go over the characters a bit quick, since there are so many. I'll start with the main character, Ema. The wiki calls her the heroine of the story, but I don't think she's a heroine. She's just kind of there. She doesn't stand up for herself even once. Seriously, why is the girl in reverse harems always either an aggressive tsundere or a retarded, brainless zombie like Ema? There's nothing interesting to tell about her, so I'll move on to my favorite character: the squirrel. Just kidding, I hated him more than anyone. He was trying to \"protect\" our beloved main character from the brothers, which involved some serious stalking incidents. There was even a moment where us viewers were supposed to feel bad for that gnawer, because Ema didn't take it with her to school or something. Is that the definition of \"feels\" nowadays? Now, for our 13 Asahina brothers. The oldest son, Masaomi, the stereotypical caring guy, whose only life concern is his family. The second son, Ukyo, the stereotypical smart guy, who is basically the slave of the entire household. The third son, Kaname, who is a monk, but a very perverted one, and he hits on every girl he sees. Great monk. Seriously, does buddhism allow that kind of shit? The fourth son, Hikaru, is the trap of the family. The fifth and sixth sons, Tsubaki and Azusa, the twins who have the same two lifegoals; becoming anime voice actors and becoming Ema's boyfriend. The seventh son, Natsume, the only normal guy, who decided to leave the house and live on his own (and who could possibly blame him for that?). The eighth son, Louis, the stereotypical silent guy who wants to be a hairdresser or something. The ninth son, Subaru, the stereotypical sporty and awkward guy. The tenth son, Iori, who seems normal at first, but he has a strange obsession for flowers. The eleventh son, Yusuke, the stereotypical tryharding guy, who's failing at life. The twelfth son, Fuuto, who is 13 years old, yet looks like he's 18. Has some sadistic tendencies, even though he's just a spoiled 13-year old. He's kind of like the Joffrey Baratheon of Brothers Conflict. And last but definitely not least, the thirteenth son, Wataru, the toddler with the godzilla voice. I don't know about you, but I love this cast.\\n\r\n[CONCLUSION]\\n\r\nThe cast consisted of stereotypes and the characters got no development at all.\\n\\n\r\n~Enjoyment~ 2/10\\n\r\nWell, this is very subjective. After watching this (which I do not recommend you) you might end up laughing at the stupidity of this, or you might be crying because of your loss of faith in humanity. One thing that's for sure though, is that you'll be incredibly frustrated by the main character, who could have been replaced by a doll and no one would have noticed a thing. The final episode of this show is absolute and utter bullshit and will make you question why you watched it (even though you already did that whilst watching the series itself). Oh, and your eyes will probably bleed because of the ending.\\n\r\n[CONCLUSION]\\n\r\nThe second hand embarrassment in the comedy of this was huge, the show wasn't funny and all in all just very boring.\\n\\n\r\nI have only one more thing to say: spare yourself. Spare yourself from this so-called Brothers Conflict, which I experienced as a conflict with my inner self, debating about whether I should drop the shit or not. And that repeated itself after every episode. I definitely made the wrong choice finishing it, it's not worth your precious time. Peace.",
            "date": "2016-07-01T17:25:00+00:00",
            "helpful_count": 48,
            "mal_id": 222671,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ThatCrazyElitist",
                "username": "ThatCrazyElitist"
            },
            "url": "https://myanimelist.net/reviews.php?id=222671"
        },
        {
            "content": "Brothers Conflict was a breath of fresh air for me. Sure, it's a reverse harem, but it is one that isn't too flamboyant and with a myriad of personalities, this is a show that I could easily re-watch again and again. This show is not for all, but from what I've stated from another review, I am weak at heart when it comes to this type of genre. ;)\r\nStory: So the protagonist, Ema Hinata, is put into a predicament in where she has to move in with 13 step-brothers. Yes, 13 of them. Her father is re-marrying and here is a girl who has livedmost of her life alone, so the result is that she has had a lack of physical and social contact with her father. Now, you throw her into the mix and boy oh boy is she in for some surprising events. Sure the plot isn't too creative, but it's nice to see that the female is self-sufficient and not such a damsel in distress like in other shows I've seen. \\n\\n\r\nArt: The animation style is nice, though not mind-blowing. It's nice to see the different character designs of each of the men and the one younger brother. Some wardrobe and fashion designs were thought out and sometimes it's nice to see a new hairstyle or a charming outfit on the characters you are viewing.\\n\\n\r\nSound: The show doesn't offer anything memorable in terms of music. Yes, even with one of the characters being an idol, I don't think the show really focused much of his particular songs. I would say  The OP theme is probably the only thing that stuck out for me, which is sung by Nobuhiko Okamoto! That aside, we have a range of voice actors, all of which are very talented and that bit of fan-girl in me just goes *toki-toki* with various discourse that is portrayed throughout the series. \\n\\n\r\nCharacter: For a 12-episode show, it's fair that they included all personalities and different perspectives of the males with how they view their beloved imouto (sister). Of course, don't expect to see flushed-out character development. Our female protagonist is a typical teen going through her goals and life choices; she's looking to graduate high school, but during the series, there are qualities in her that are quite passive. If she had a touch of spunk or another trait that made her more dynamic, I think I would have rated the character category a bit higher. Oh and let's not forget, Ema has a talking pet squirrel with whom she is able to communicate, which is a cute bonus. \\n\\n\r\nEnjoyment and Overall Conclusion: This show is worth re-watching again. Though it's not my top choices of a reverse harem show, it's light and rather short, still leaving room for hope and a sense of mystery about various possibilities that could happen in the future. ;) \\n\\n\r\nPros - A shoujo, reverse harem that isn't flamboyant and provides opportunities for viewers to see many personalities of the male characters\\n\r\nCons -  Protagonist's qualities in some instances (imo), short series and lack of plot creativity.",
            "date": "2013-12-09T07:52:00+00:00",
            "helpful_count": 24,
            "mal_id": 123121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1124729.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NonkiLauren",
                "username": "NonkiLauren"
            },
            "url": "https://myanimelist.net/reviews.php?id=123121"
        },
        {
            "content": "Obviously, this show's not for those who look for a story to follow. So if you're here complaining about the storyline and shallow characters I wonder why you even watched the show in the first place. \r\nThis series is literally intended for a bunch of hormonal teenage girls, and it does a great job in being that kind of show. As a  hormonal teenage girl myself I can tell you that as long as you turn off your brain, these kinds of anime can be highly enjoyable. (or a hormonal teenage boy idk luv is luv amirite)\r\nI'm not even going into detail about thisshow's flaws because there are too many to name and I also think we can all imagine them, especially if you've watched reversed harem before. To sum it up - masochistic heroine, twincest, \"you worked hard\", talking animal friends ft. \"wait....that's supposed to be a guy?!\"\\n\\n\r\nIf you're forever alone like me and you need something to replace the void in your cold empty heart, I recommend this show. Thank you for your time, it's been great.",
            "date": "2015-11-24T12:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 204095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4028617.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/takeyana",
                "username": "takeyana"
            },
            "url": "https://myanimelist.net/reviews.php?id=204095"
        },
        {
            "content": "My sister\r\nMechakucha ni aishiteru\r\nYasashii dake no kisu ga iinokai\r\nGomen dakishime tai yo\r\n( Chikaeruna!)\r\nKanashi mesae setsuna sasae\r\nHiki uketta ra\r\nIma sugu ni\r\nSubete wo azukete\r\nKiss kiss kiss\r\nI need your love.\r\nOk, so without further adieu, I hereby make my presnt my ratings for each category of this 12 episode anime, which at first it was 13, eh who cares?\r\nSo my ratings:\r\nStory and character-fair 6.\r\nStory:\r\nBasically this is a reverse harem at its simplest and every plot  revolves around Ema who is caught in a conflict with the  Asahina Brothers who are vying for her affection. Despite of its title \"Brother Conflict\" only a handful are  in competitionfor the girl's heart, I gave it such score because there some episodes that I really don't like and there are episodes that were really touching.\\n\\n\r\nCharacter:\\n\\n\r\nI gonna classify each characters in this anime in the following:\\n\\n\\n\r\nNo Contest: Masaomi, Ukyo, Hikaru, Iori and Wataru.\\n\\n\r\nUnder this category, the mentioned brother were never seen actually competing for Ema's affection in fact the anime itself never gave these character's such opportunity to show their romantic intention for Ema. Masaomi is more like the father figure, Ukyo was more of the mother figure since he does the cooking and cleaning before Ema's arrival, Hkaru is gay and even if he did mention that he's gonna get in the fray it don't look like he's serious due to the fact that he's a novelist who needs ideas for his literary works, Iori on the other hand have very limited roles and Wataru ? Well, he's still a kid dress as a girl that I'll never understand why this anime's illustrator drew him that way.\\n\\n\r\nPredators: Kaname, Futo and Tsubaki\\n\\n\r\nHere, pretty obvious these brother have exhibited a certain aggressiveness towards Ema, it started with Kaname whom it wasn't clear if he's a monk or a club host you might say he's one of the reason why I gave this category  such score, Futo is one character that I would like to kick his balls and Tsubaki, I'd probably wanna slit his throat, I placed them in this category co'z these are the characters that I love to hate.\\n\\n\r\nNice guys: Azusa, Natsume, Subaru and Yusuke\\n\\n\r\nThese, for me, are the guys that I like to be Ema's love interest, though thery're gentlemen, it wasn't enough for me to give this anime a score higher than 6. Personally, if can have it my way I would prefer a Yusuke X Ema arc, since those two go nicely.\\n\\n\r\nFriend zone: Louis and Juli\\n\\n\r\nPretty obvious that Louis and Ema share the same situation were they're both adopted and can speak to Juli (CHIIIIIIII), but Juli is quite annoying and you might say he's another reason why this anime's category deserves  a 6.\\n\\n\r\nThe prize: Ema\\n\\n\r\nbasically she the center of the whole \"Brother's Conflict,\" I like heer sweet and kind characteristics, but there are time that her being passive is quite annoying.     \\n\\n\r\nArt- mediocre 5.\\n\\n\r\nI just really have no comment about this anime's art designed.\\n\\n\r\nSound, enjoyment and overall- good 7.\\n\\n\r\nSound:\\n\\n\r\nI like both the opening and closing theme.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nSince this anime and the manga was taken out from a otome game, it wasn't surprising that such enjoyment was like a game itself, except it was studio Brain Base who is playing it.\\n\\n\r\nOverall: \\n\\n\r\nThis anime is good enough to be enjoyed, though there are some situation that we wish as to whom the female character should be with, I think that it's enough that such anime with a harem genre should end that way it is. overall this anime is good, CHIIIIIIII!!!!!\\n\\n",
            "date": "2013-09-18T09:53:00+00:00",
            "helpful_count": 13,
            "mal_id": 113311,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=113311"
        },
        {
            "content": "Brothers Conflict is an anime that in my opinion, never stood a chance beyond episode three. It follows the main character Ema Hinata, who we only ever really know as Chi. I didn't actually discover her real name until the very last episode. And even then, i never once thought, 'what actually is the name of this girl?' Nope i guess i was too busy trying to survive what has been one of the most disappointing animes of my life. What might have been exciting to reverse harem lovers, turns out to be...\r\nStory:\r\n....A story thats shallow and unrealistic.\r\nSo what this story is trying to makeus believe is that a seventeen/eighteen year old girl was able to seduce 13 boys regarded as her brothers all by sitting there and looking \"cute\". Though throughout this anime my opinion of cute and annoying have been dramatically redefined. Chi/Ema offers nothing to the story, she rarely does anything to actually seduce these boys and does nothing when they start falling at her feet. What we experience throughout this anime is the progression of love, awaiting the response to the many confessions this girl receives. \\n\\n\r\nArt:\\n\r\n....Art that has nothing to say for itself. \\n\r\nThe art was just your typical modern day anime art. Mainstream and unremarkable. Good quality yes but engaging or interesting, no.\\n\\n\r\nSound:\\n\r\n....Music that that will make you cringe. \\n\r\nI have never rated sound badly in an anime before. Before writing this i had no idea what it actually meant to have bad sound, i mean what could be wrong with it? This anime however has shown me. If you actually attempt to watch this anime you will be plagued by a series of cheesy renditions afforded by one of Chi's superstar brothers, and if that wasn't enough, just to make sure you don't go away disappointed, at the end of every episode is a traumatising song in which all the brothers sing and dance. Never again do i ever want to experience what i went through here. \\n\\n\r\nCharacters:\\n\r\n....Characters that have no soul.\\n\r\nYou have the brothers. Some who like basketball. Some who like video games. One who is a superstar and another who is a transvestite. Just your typical everyday family. All of the brothers however, despite their likes and clothing preferences make the same cheesy moves on the main character Chi and then expect us to be surprised when the grab her by the arm and pull her against them for a dramatic and passionate...hug? Yeah, that all your really gonna get. A lot of hugging and not much else. The main character Chi or Ema is the most disappointing. This girl has no depth to her on any level. What we see of her is a boring girl who rarely makes a sound other than the occasional gasp when one of her brothers makes a move on her. She never objects to any of the things her brothers do but would rather stand there like a deer in headlights without any input what so ever. Yep she has been one of the most annoying characters of a the many shows i have seen, a conclusion i largely put down to her defenceless persona and stupid disposition.\\n\\n\r\nEnjoyment:\\n\r\nThis anime doesn't really amount to anything. Its got an unrealistic story that never evolves, run of the mill art, traumatising music renditions, characters with no depth or personality and an ending which renders all of these events pointless. \\n\r\nBut by all means go ahead and watch this anime, it not so much terrible and as a big lump of boring that never improves or evolves.",
            "date": "2013-09-19T19:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 113463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1910014.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lyon-Lark",
                "username": "Lyon-Lark"
            },
            "url": "https://myanimelist.net/reviews.php?id=113463"
        },
        {
            "content": "[STORY] - 5/10\r\n-----------\r\nThe story and the plot to me was a complete and utter blur. I didn't understand many things in this story, and often got to the point where I got so confused, I just got bored. The romance in this story was very weak in my opinion, although it wasn't the worst. The ending was also kind of disappointing, because nothing major really happened. I felt like there would be a continuation of this anime. Maybe the Specials is a continuation since it is listed as a sequel, but I don't think I'll ever be in the mood to watch it. \r\n[ART] -7/10\\n\r\n-----------\\n\r\nThe graphics were fine, but I'd expect that from an anime that was released in 2013. The scenery and the background was kind of weak and didn't really fit in with the scenes most of the time. \\n\\n\r\n[SOUND] - 5/10\\n\r\n-----------\\n\r\nI only watched the dubbed version of this anime, and the actors / actresses did an amazing job, except Asahina, Wataru, the youngest (I think) son. The English voice actor didn't really fit in with Wataru's appearance, because he's very young and probably around his teenage years still. I would expect the producers to have a young actor to act out Wataru. I also don't know how to feel about the opening and the ending themes. Often times, the ending would be so loud compared to the actual story of the anime, that it would often hurt my ears. \\n\\n\r\n[CHARACTER] - 6/10\\n\r\n-----------\\n\r\nThe appearances of the characters didn't really suit their personality, especially Asahina, Fuuto. His look gives a kind and generous vibe to me, but he was just shown to be very cold at times, and keeps to himself a lot. Also, I feel like there was too many protagonists / main leads. According to MAL, there are 14 main leads, like jeez, I already have to study for exams, and now I have to study all 14 of the protagonists' names? Give me a break!\\n\\n\r\n[ENJOYMENT] - 3/10\\n\r\n-----------\\n\r\nI didn't really enjoy this anime all that much. Yes. That's all I have to say. \\n\\n\r\n[OVERALL] - 5/10\\n\r\n-----------\\n\r\nOverall, I will definitely not recommend this anime to any of my friends to watch, and I don't think I'll rewatch this ever again, but again, it could've been worse, but it wasn't the worst. \\n\\n\r\nFINAL SCORE: \\n\r\n5/10?",
            "date": "2018-10-16T20:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 291912,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6159701.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnastasiyaV",
                "username": "AnastasiyaV"
            },
            "url": "https://myanimelist.net/reviews.php?id=291912"
        },
        {
            "content": "Brothers Conflict is one of the very few watchable reverse harems in the world of anime, but that's just it. 's not good, or bad, it's just, \"watchable.\" and unfortunately it can be addicting to weak watchers, like me. \nStory: 7\nI'm sorry, but the plot is way too outrageous to take seriously. I mean, really? A girl who isn't all that special looking moves into her brothers' home with NO PARENT SUPERVISION, and they all end up falling in love with her, and she just shakes them all off like they're a bunch of fucking cats. That's too perfect. I know its just an anime,but that's not how life works. It actually made me kind of angry. Though, some elements, like the fluffiness of the cute scenes/exchanges with my personal favorite brothers. (Yuusuke, Natsume, Azusa, but I'll get into that later...) I really liked that. SOME of them respected her and that led to a lot of cute scenes. \\n\\n\nArt: 7\\n\\n\nThe art isn't anything to giggle otokully (wtf Hattie?) at. It's obviously not as good as Death Note and Shingeki no Kyojin, but whatever. I mean, I didn't like the design of the protagonist, Ema. She looked ditzy and dumb. (Again, more on that later) But some character designs were pretty creative, even though they looked like ripoffs of other characters of other anime. Some their designs totally pissed me off. Whatever, it wasn't that bad, really...\\n\\n\nSound: 6 \\n\\n\nMy sister was obsessed with the ending song for some gay reason. She would sing it nonstop when we got home from school, and I would yell, \"What the fuck is that?!\" And she'd yell back. \"It's the Brothers Conflict ending!\" I'm not one to watch endings, but since she mentioned it, I took the time to watch it that day, and I guess the ending's pretty creative relatively. I mean, you got all these Brothers, why not use them for a choreographed dance number in which they all sing, even though some of them really shouldn't. (Subaru, when he sings, sounds like a dying cat.) It was okay. The opening was so annoying though!\\n\\n\nCharacter: 5\\n\\n\nOkay, there are 13 Brothers and one annoying protagonist. Its kind of given that I would hate all of them except a legitimate few. They all ended up falling in love with her, in which I scream,\"BOLLLOOCCKSSS!\" But some characters are worth mentioning. I mean, the only one that didn't force himself upon the protagonist was Yuusuke, that red haired bastard. Their exchanges were so sweet, along with Azusa's and Natsume's. I'm just saying, they weren't overwhelming, and seemed fair to her, giving her a chance to breathe! While there are characters I like, I pretty much hate the rest of them and their designs. A perverted monk is basically a contradiction in it's own name, really. Is that the best of your creativity? And that pop star! Fuuto! I spit at his name! He's 15, my age, and attempting rape! Modern society, people. Is that normal in Japan? Also, I hated his design. Whenever he came on screen, I'd yell, \"FUCKING NEKO-CHAN!!\" Cause face it, he looks like a cat and needs mouth surgery. There are too many hateable characters! That's a harem's nightmare! \\n\\n\nEnjoyment:\\n\\n\nAs I said, it was my guilty pleasure. I watched it to the end, sadly. I didn't mean to, it just happened...\\n\\n\nOverall: 6.5\\n\\n\\n\\n",
            "date": "2013-09-21T20:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 113741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HattiewithSugar",
                "username": "HattiewithSugar"
            },
            "url": "https://myanimelist.net/reviews.php?id=113741"
        },
        {
            "content": "Well this anime earn my 2nd worst anime to watch. Reason the story start with a girl that live with 13 brother way older then her and wait the story lead to nothing and if I was the writer of the script I will be a shame to put a anime that have no development of the personage how so ever and to add the love that the brothers show the female lead personage is almost shameful. I just believe that should create a better story that to traumatize the girl in the show. Well to say that the show need better arts as theFemale lead she where 90% of the show the school uniform and useless character as Squirrel that is maybe 5% of the show. I do not recommend that show to been watch because even the script that is use make no scent how so ever. I do not recommend the waste of 13 episode to watch this show.",
            "date": "2016-01-24T17:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 209312,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4858237.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ALBrassard",
                "username": "ALBrassard"
            },
            "url": "https://myanimelist.net/reviews.php?id=209312"
        },
        {
            "content": "Okay, so despite all the negative reviews, I absolutely fell IN LOVE with this anime. i was just searching for something to watch, but after the first episode, I just wanted to keep going. The brothers all have pretty different personalities, and in each episode, the girl has a \"special moment\" with some characters. \r\nStory (7/10): Like most other reviews have mentioned, it is just a typical reverse harem anime, but story was very well written.\r\nArt (8/10): This art was overall really good! It's nothing too fancy, but it's a lot better than most animes.\r\nSound (6/10): I didn't like the intro or outro song alot. The tune was kinda hideous and it was not catchy. The lyrics were okay, but the voices for the songs were terrible.\\n\r\nCharacter (9/10): Okay, so this is all based on personal opinion. As I said, different boys get their time with Ema. The development, although kind of slow, was pretty entertaining. \\n\r\nEnjoyment (10/10): As I've mentioned, I was hooked on the first episode! Each episode, it wanted to make me continue watching!  Most of the characters were pretty hot and despite their outside appearance, their inner personality is quite adorable. ^-^\\n\r\nOverall (9/10): This reverse harem anime is mostly directed towards girls. The way I see it, just put yourself in the position of Ema, the main character, and it's basically like a choose your prince games. If you need to get something or someone off your mind, this is a great piece to watch.",
            "date": "2015-01-25T07:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 178936,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/um_idkbro",
                "username": "um_idkbro"
            },
            "url": "https://myanimelist.net/reviews.php?id=178936"
        },
        {
            "content": "I'm a bit ashamed to admit that reverse harem is one of my guilty pleasures. This, however, was utter crap. I only watched half of the anime, but I don't think I need to watch any more. The ending is way too predictable, and I'd like to spare my eyes from finishing the rest of that dreadful anime.\r\nThe story (2/10):\r\nNot only did this anime have no proper plot, it was just crammed with clichés and obvious scenarios. Furthermore, it had nothing else that could compensate for the horrible storyline. There was no humor, action, excitement, nothing. This anime was bland and a complete waste oftime. I demand to have my hours back.\\n\\n\r\nThe art (8/10):\\n\\n\r\nJust about the only thing that prevented me from giving this anime a 1 was the art. I've seen better, of course, but I'm not going to lie and say that the artwork was terrible. \\n\\n\r\nThe sound (5/10): \\n\\n\r\nI don't have anything particularly bad to say about the voices/soundtrack, mainly because I don't remember how any of them went. I was most likely thinking about how horrible the anime was than paying attention to the soundtrack.\\n\\n\r\nThe character (2/10):\\n\\n\r\nOkay, I can probably write an entire book describing how detestable and flawed these characters are, but I won't because I don't want to waste your or my time. \\n\\n\r\nThroughout the entire anime (or at least the half that I watched), I wondered if the female protagonist was a robot. I have never seen such a boring, voiceless character before. \\n\r\nAs for the brothers, no matter how hard I tried to identify them and remember their names, I couldn't. Aside from the color and style of their hair, there's nothing else that distinguishes any of the brothers. \\n\\n\r\nOverall (2/10):\\n\\n\r\nDid I enjoy this anime? Hell naw. Would I recommend this anime to anyone else? Have you been paying attention to my review? \\n\\n\r\nThis anime was just as bad as Diabolik Lovers (anyone who's interested in reverse harem would most likely know about this one). I strongly advise you to not waste your time watching this anime... I mean, unless this kind of stuff floats your boat, of course. \\n\\n\r\nIf you're planning on watching this anime, be WARNED: you WILL lose brain cells.",
            "date": "2015-06-23T06:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 191012,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Grapesandraisin",
                "username": "Grapesandraisin"
            },
            "url": "https://myanimelist.net/reviews.php?id=191012"
        },
        {
            "content": "Ok. Now where do I start?\r\nBrothers conflict was pretty much a reverse harem on steroids. Not only are there TOO MANY hot bishies, but there is also a stupid squirrel that can fucking talk. Oh lord. \r\nThe main protagonist is a stupid, indecisive, thick headed girl. She couldn't even tell if the guy liked or should I say lusted after her. Another thing that bothered me was the lack of character development. It seemed as if all Ema had to do was breathe or blink and another step brother fell in love with her. The step brothers had no respect for her and did nothesitate to force themselves upon her. Honestly, I think I think I would have liked this anime so much better if it was a hentai.",
            "date": "2015-01-19T13:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 178537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/codegeassxoxo",
                "username": "codegeassxoxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=178537"
        },
        {
            "content": "I think what really made my issue was the age differences in the characters. While some only shared 3-5 year differences, it's still very very strange and mostly illegal. Ema is 17 in the first season, and only 4 of the boys are anywhere near her age, from 20 and under. \r\nLets do this by age shall we? \r\nHere are the 4 nearest to her age:\r\nFuuto - 15\r\nYuusuke - 17\r\nIori - 18 (Mind you he is now a legal adult and since they seem to set in Tokyo, any relations with Ema are considered a type of statutory rape)\r\nSubaru - 20 (Same applies to thisdude)\\n\\n\r\nEveryone Else's Ages from Youngest to Oldest:\\n\r\nWataru - 10\\n\r\nLouis - 21\\n\r\nAzusa - 24\\n\r\nNatsume - 24\\n\r\nTsubaki - 24\\n\r\nHikaru - 26 (though not really romantically involved with Ema)\\n\r\nKaname - 27\\n\r\nUkyou - 29\\n\r\nMasaomi - 31 \\n\\n\r\nTherefore, everything else should be off limits and all of these men (excluding Wataru) should be quite disgusted with themselves.\\n\\n\r\nOne of the most flirtatious is Kaname, who is nearly 30 and he flirts and kisses her, and that is not appropriate. And Ukyou is 29 and has fantasies of her, and Masaomi also has feelings for her and they are the two oldest siblings! Then there is Tsubaki, who likes to tease her and make her feel bad or nervous, and if that isn't a sign of emotional abuse/manipulation, i don't know what is, especially from his jealousy. \\n\\n\r\nI have to say, this underage girl with older men liking her is very unsettling and what moved me to stop watching it. It would have worked better if say, they were the father's sons from different mothers, all closer in the same age, rather than coming from their mother ( i mean 13 kids? that poor woman ). I really couldn't see past that in the anime and could not enjoy it. \\n\\n\r\nNot to mention there wasn't really any reason to like Ema that was spectacular, she was a kind person and though pretty, it would be unlikely ( yes i know its a fictional thing ) that ALL the boys would like her. Ema's emotions seem stuck on: \"Um, hi, im Ema, and i'm still new so everything is awkward\".",
            "date": "2017-12-29T15:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 266806,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MissCritical",
                "username": "MissCritical"
            },
            "url": "https://myanimelist.net/reviews.php?id=266806"
        },
        {
            "content": "I'm going to have to say that this anime, unfortunately, is on my bad list of anime. It's not the worst though. This anime does has its pros along with its cons. I'm going to admit, this review may have spoilers, but to be rather honest, it's best to maybe put this anime to the side, reader.\r\nStory [3/10]\r\nThe reason I give the story a 3 out of 10 is because, well, the 'story' isn't that great. In fact, there's no real story at all. There's no plot driving this anime. The main objective of this anime was to sell its game(s) to the young audienceof teenage girls. If I have to say what the anime use to drive the anime to keep going, its that it use each episode to show off a brother for the main protagonist. And I must admit, this makes this EXTREMELY boring to watch. Because there's nothing to help the viewer to keep motivated to watch, it was so boring to watch that it was mentally painful. One of the main objectives of an anime to do is to keep the viewer encouraged to keep watching. If there's no real plot or anything to keep the viewer watching, the anime will turn stale, no matter how much pretty artwork you shove into the anime itself. And speaking of art...\\n\\n\r\nArt [7/10]\\n\\n\r\nNow, the art isn't that bad. The art was able to stand on its own ground and it helps catches the viewer's eyes. The background of the anime, however, is boring and bland. It had the generic anime style to it, but the characters had an interesting appearance. But the male characters, unfortunately, mostly look like females themselves. The anime is supposed to grasp its audience of young, teenage girls, right? If the characters don't look masculine, it'll throw off the viewer who was interested in a reverse harem. Art is a major key opponent to an anime, and if it can't appeal to the audience, it might throw them off and eventually make them not feel the need to continue watching the anime. The art is good enough to keep me wanting to watch, but due to the lack of plot, it left a dryness in my mind, a static, basically.\\n\\n\r\nSound [4/10]\\n\\n\r\nHonestly, I don't even remember the music at all. If I don't remember or ever notice the music to begin with, it must've not been anything special. Music in reverse harem tends to be bland and lacking of what it could've been, in my opinion. I feel bad for the composer(s) of the music. Maybe because of the lacking of moments that could've gotten the viewer's attention, they weren't able to push out good, emotional music. In a short summary, I'll say the music was lacking here.\\n\\n\r\nCharacter [2/10]\\n\\n\r\nOh boy, here's the fun part. The characters were UTTERLY BORING. They lacked real personalities and above all, I could only see them as just selling points of the games the anime producers were trying to throw over to get customers. The only time I can see the 'personalities' of the male characters were when an episode puts them into the spotlight. And what makes me very tasteless to this anime is that they threw in a young boy and the freaking squirrel (the voice's annoying, might I add) and that astounds me. If there was one character I had some interest in, it was Fuuto, even though I have an angry hatred towards him as a character after a major stunt he attempts in one later episode. \\n\\n\r\nIf there's something I would've love to see, its how the brothers interact with one another, showing brotherly love. There were 'times' where they would, but its cut in a matter of seconds. Showing brotherly love would've helped create characters. What I would've also love is how the brothers would've reacted to having a new step-sister in the house realistically. Their mother just married to some guy they barely even knew about and now they have to act like its nothing when there's a new sibling in the house? That would've been interesting to see really, to see maybe some react negatively to the new step-sister of theirs, and the new step-father even. But then again, what am I saying? Their mother had 13 sons and somehow is not dead or extremely fat. She seriously needs to get her tubes tied.\\n\\n\r\nEnjoyment [1/10]\\n\\n\r\nI didn't have a fun time watching this. It was a painful watch through and I feel empty after finishing this anime. This left a dry taste through out the whole anime and never will I ever watch this again, period. Hate would be a strong word for this, but rather heavily disliked this anime. The anime doesn't show real conflict (get it?) between the idea of having a new step-sister and for some reason, the bland main character, Ema, they fall for her easily, and all 13 of them. What kind of luck is that? Even when she flat out says that she only sees them as brothers, they will still get onto her and kiss her. Heck, one of the brothers even almost raped her in her sleep! Unacceptable!\\n\\n\r\nOverall [2/10]\\n\\n\r\nIf anything, its the art that somehow pull this anime out to a '2' on me. This anime is not appealing, even as a reverse harem. I know I shouldn't expect much from a reverse harem, but this anime goes down into a very big, dark hole and it won't be able to dig itself out. I will never recommend someone to watch this anime. If you're looking for an interesting reverse harem to watch, this is not the place you should look over to. There are some other actually good reverse harems out there, trust me.",
            "date": "2017-02-28T14:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 241614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5150897.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RememberMeAsOne",
                "username": "RememberMeAsOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=241614"
        },
        {
            "content": "Honestly, this has to be one of the most boring anime I had ever watched. When I first watched it, I thought it was gonna be a good reverse harem anime, but boy was I wrong, this anime was super boring and I literally took a nap while watching this. The story was...meh, it's about a girl romancing with her new 13 step-brothers. The art was pretty, in my opinion. The opening is catchy, that's the only thing I like about this anime! :D The characters were decent, I'm not even sure if they even had character development, I'm pretty sure they didn't. Overall, Idid not enjoy this anime one bit and dropped it because of how boring it is. It's a painfully boring anime and I give this a 1 out of 5 stars. :(",
            "date": "2017-02-21T21:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 241119,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4544027.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/m_ngu",
                "username": "m_ngu"
            },
            "url": "https://myanimelist.net/reviews.php?id=241119"
        },
        {
            "content": "When I first came across Brothers Conflict, I was binge watching reverse harem anime like nobody's business. I mean what else could entertain a 13 year old girl on a quest for the perfect fantasy? Well, after checking out my review from the past, I see that I grossly undermined the true awfulness of this particular harem, so I'd like to correct my original findings.\r\nStory - 4/10: A harem revolving around the daughter of a famous adventurer, who one day finds out her father's going to re-marry. Instead of living with her father and new step-mother, she decides to move to an apartment complex ownedby her step-mother, only to find out that she has 13 step-brothers. Sounds interesting? To my past self, yes, to present me? No way on God's green earth would I give an anime with a synopsis like that a second glance. Unfortunately, I find this a reoccurring theme with reverse harems in general. Typically a really shallow plot revolving around a girl who somehow gets caught up with a bunch of attractive guys who fall in love after she breathes. Although shallow, the plot could have been put to use (somehow), unfortunately the creators squandered that opportunity with the characters.\\n\\n\r\nCharacters - 3/10: I cannot force myself to give a score higher than this because of the way the characters turned out. Out of all 13 brothers, only Tsubaki, Azusa, Louis, and Subaru get decent background stories. That may be sad, but just wait til you get a hold of the main character, Ema Hinata. Like I said before, in most reverse harems you get main characters lacking a personality (see, Amnesia and Diabolik Lovers), but man Chi's squirrel had more personality in his stupid bow than she had in all 12 episodes. It really soured my mood to see 13 dudes fall in love with a chick who's only capable of blushing. All in all, the story just had too many characters, with bland/blank backgrounds, and too little reason for them all to fall in love with blandy, the blushing broad. \\n\\n\r\nArt - 8/10: Although there's many things wrong with this anime, to my amateur eye, the art is fantastic. The only thing all the characters have going for them, is that they're at least distinguishable in a crowd. I'm not much of an art fiend, so I can't be too specific, but I'd have to say that one of the reasons I kept watching had to be because the art was so nice.\\n\\n\r\nMusic - 5/10: The main reason I watched this anime was for the opening. There are too many anime that I've come across with lackluster music, but I have to say, the opening is catchier than I'd like to admit and I looked forward to starting each episode for it. Besides that, I don't remember the music standing out in any particular way, so I'd say a 5 is a fair score.\\n\\n\r\nEnjoyment- 3/10: If you couldn't gather from the rest of this review, I did not enjoy this poor excuse for an anime. My time was thoroughly wasted and those hours I spent drooling at my computer screen, could have been dedicated to drooling over better anime, or repeatedly bashing my head into a wall. :)\\n\\n\r\nOverall Score- 3/10: I was going to give it a 4 just to be nice, but I'd be lying. The only reason I'd recommend this anime to anybody is if I wanted revenge. I could have gone my whole life without watching this sorry show and others like it. All I can hope is that, all who read this take will take my review seriously and spend time on the endless list of GOOD romance anime, with a GREAT plot, and AMAZING characters.",
            "date": "2013-11-18T02:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 120677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/promesse14",
                "username": "promesse14"
            },
            "url": "https://myanimelist.net/reviews.php?id=120677"
        },
        {
            "content": "Whoooah! Girl who thinks she's just plain somehow has a house of not 2, 3, or 4 boys in love with her- It's a baker dozen! All in love with her and kinda sexual harassment-y at times.\r\nAnd that's it. That's as deep as it goes. Sure they try and put some tragic back story to gain some sort of plot- But the attempt is weak and the outcome is a fomalic romance that only a young teenage would find romantic. \r\nStory: Just like above- the story can barely stand on it's own two feet. We meet Ema who is forced to move in with hernew dozen (give or take) brother. Sure there's some whole family love thing going on with her, but all the brothers seem to want more than just darling sister, and let her know. A lot. It's to the point of cringe. \\n\\n\r\nArt: yeah, It looks pretty.\\n\\n\r\nSound: the voice to me is annoying. Especially the attempt at a side kick. No thank you.\\n\\n\r\nCharacter: Development? Plot? what are those things? There is no changes to speak of! Nothing happens between them and in the end everything is the same. Did any of them grow? no. Did any of them become a better person? NO. In fact, they just learned better ways to step up the rapey game. Awesome. Not to mention that I am to believe that a dozen men all fall in love with the same girl within a couple of months of meeting this person for the first time and the whole family is ruined because of it? Not even close to true. \\n\\n\r\nOverall: I think this helped me learn some Japanese phrases as it was the same thing over and over. Not really enjoyable. I kept thinking it'd get better. Nope. If you are thinking this is a great harem like Ouran- please keep going. Don't waste your time.",
            "date": "2014-10-19T16:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 165335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4189459.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lehcara",
                "username": "Lehcara"
            },
            "url": "https://myanimelist.net/reviews.php?id=165335"
        }
    ],
    [
        {
            "content": "Hey there!\r\nSo I just got done watching Brothers Conflict, the shoujo anime of the summer season 2013. So in Brothers Conflict we are following Ema Hinata, a young girl of 16 years old that decided to live with her 13 so called 'siblings' and here is where the trouble begins.\r\nStory: 4/10 The story is very simple, it is a reverse harem it speaks for itself. Girl lives with brothers, all the brothers want a piece of her (or at least most of them). The sad thing is that each episode basically jumps from brother to brother, the main character Ema doesn't form a strong bondwith any of the brothers because of the continuesly jumping from one to the other yet most of the brothers all want a romanctic relationship with her while they barely know anything about our main character Ema. But I will delve into this further in the character section.\\n\\n\r\nThe reason why I gave the story a 4/10 is because it is a very mainstream anime and not a lot happens, it is all centered around one question which is: who gets the girl? which is exactly the point of a reverse harem. The odd thing that bothers me is that  each time you see one of the brothers on screen with Ema they either hug her or kiss her or in the very least touch her and after all that happened she just carries on with her day like nothing of the sorts happened though she consiously knows how all of them feel about her but it just seems like she shrugs it off like it is an everyday thing. Although she proclaims to only want to be 'siblings' with her brothers she gradually allows any of the guys to kiss her and do anything with her as they please. \\n\\n\r\nFrom episode 1 she knows that they aren't really her siblings since her dad married their mother so technically non of them are related by blood only they are legally a family on paper. Eventhough she knows this she still continues to call them her 'siblings' which is disturbing since the fact that almost everyone of them want to have a romantic relationship with our main character Ema. Everytime she called them her siblings I found myself yelling at the screen 'You aren't siblings! realize that!'\\n\\n\r\nArt: 7/10 the art is basically the save and grace for this anime, the animation is beautiful and fluent, the backgrounds are spendidly done and of course the originality of each character is beautifully portrait. Each one of the brothers are easy to recognize by either hair style/hair color and the color of their eyes. The only downside I have on the art is that the emotions aren't easily recognizable on their faces. Even when they are happy they are very mediocre about it.\\n\\n\r\nSound: 5/10 the sound was very average in my opinion, each time the intro music and the outro music began to play I found myself skipping over it entirely since I didn't enjoy listening to them. The lyrics weren't the best either, the music is very upbeat and fast paced. Not that there is anything wrong with an upbeat song and I understand they needed to make a happy sounding opening/ending since it is a reverse harem and it is all about romance but I felt like it wasn't necessary. It wasn't bad so to say but it wasn't really enjoyable to me but that is just my personal opinion, each person has his or her own taste of music.\\n\\n\r\nCharacter: 3/10 The character development is very bad to say the least. Like I said before each episode focuses on one brother at a time and since we have 13 brothers in the house and our main character Ema, character development is very limited.\\n\\n\r\nNot to mention that Ema our lovely main character is as emotional as a brick wall. What is so appealing to her that almost every guy wants a romantic relationship with her? The only traits she has is that she is a nice and caring person and likes video games. That's it. Nothing more. \\n\\n\r\nThe fact annoys me that the brothers barely spoke with her and immediatly they have a crush on her, with some of the brothers she has a better connection then with the others but eventhough despite this most of them want her, is it because she is good looking? Not particularly, she looks like  an average young girl. Is it because of her character then? No because her emotions are turned off 24/7. So what is it? It is because she is our main character and so that makes it automatically the person everyone desires.\\n\\n\r\nBecause it has so many characters and only 12 episodes the character development was sadly nowhere to be found.\\n\\n\r\nEnjoyment: 7/10 despite all the negative aspects of this anime I found it rather enjoyable. not because of the story writing or the characters but mostly because I had a good laugh out of it, every time one of the guys had an encounter with Ema that didn't make any sense at all I found myself at least given a chuckle about this whole affair.\\n\\n\r\nI might give a little spoiler here but in one of the scenes one of the brothers realized he wanted to grow more before he can be a good man to her and it was a very dramatic scene with sad music playing in the background and you know that this was one of those scenes that was meant to make your heart break but instead I found myself laughing on the floor because especially that brother had barely any interactions with her at all.\\n\\n\r\nSo my overall score of this anime is a 5/10. If you are into the harem genre I would recommend it or either if you want to laugh at a romantic story that doesn't make any sense at all this is the anime for you! \\n\\n\r\nHopefully this was helpful\\n\\n\r\n~Ms9222",
            "date": "2013-09-18T02:59:00+00:00",
            "helpful_count": 235,
            "mal_id": 113285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474417.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ms9222",
                "username": "Ms9222"
            },
            "url": "https://myanimelist.net/reviews.php?id=113285"
        },
        {
            "content": "So I barely ever write reviews but I just have to share my opinions on this horrible anime.\r\nBrothers conflict is a reverse harem, and probably the worst one out there. I don't really dislike anime that easily, but this anime is the worst anime i've seen. (Ps: Excuse my horrible punctuation)\r\nStory-\r\nAlright, to sum it up it's basically about a girl who's always been alone in her childhood (excluding the squirrel) and then her father decides to marry a woman that has 13 sons (like seriously? wtf how could she conceive 13 boys without dying) anyway, she ends up moving to the house where 12 ofthe sons live. And of course, they all start liking her and fighting over her without reason. \\n\\n\r\nThe story was a pile of absolute shit.\\n\r\nit was very cliché (girl moving to a house/school full with boys) but that wasn't even the problem. It's not so much lacking comedy, the comedy is just horrible that it's basically non existant. They even manage to mess up the classic \"overreactions\" that anime characters usually make. The jokes that are made don't match the voice acting and the characters expressions, and just end up looking extremely awkward. The problems/events that happen during the anime are just plain dumb and make no sense - making the anime super boring.\\n\\n\r\nArt:\\n\\n\r\nI admit the art in this anime is not THAT bad, but i've seen alot better. The backgrounds are quite dull and boring. \\n\\n\r\nSound:\\n\\n\r\nOkay one of the few things that pissed me off was the fact that the voice of Wataru did NOT match the characters voice AT ALL. It's like placing a cute anime character in a cute shoujo setting but then giving him the voice of fucking godzilla or some shit. Some characters fit their voice actors but some absolutely don't. The squirrels voice was the most annoying out of all, but i'll get into that later. \\n\r\nAn character could be casually looking but the voice of it would be excited and laughing, Making the voice acting not match the actual expressions of the characters. I've also seen a few out of sync voice acting (when the character doesn't have their mouth open and moving but the voice is still playing).\\n\\n\r\nOther than character voices I enjoyed the theme song, and the ending song with the dance.\\n\\n\r\nCharacter: \\n\\n\r\nOh my god, the fucking squirrel. I can not handle that thing, it made me want to jump of a cliff. it was constantly ruining the mood and failed with it's attempts at jokes. Not even a funny type of 'ruining the mood' that usually happens within anime. As for the other characters : they're ok, some don't make fuckin sense in what they dobut basically the entire anime series doesn't make sense anyway. The heroine was really annoying, she wasn't standing up for herself or saying anything back, the anime could've been way better without a cliché annoying heroine.\\n\\n\r\nEnjoyment:\\n\\n\r\nNone, I got so bored watching this anime. It had so many flaws it made me focus more on them then the actual story.\\n\\n\r\nOverall:\\n\\n\r\nIt's a piece of shit, and even I, an reverse harem lover thought this was complete shit. \\n\\n\r\nThis anime makes Boku No Pico seem like heaven.",
            "date": "2014-12-09T11:14:00+00:00",
            "helpful_count": 97,
            "mal_id": 171573,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941591.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/mina24",
                "username": "mina24"
            },
            "url": "https://myanimelist.net/reviews.php?id=171573"
        },
        {
            "content": "Now, this is my first review ever and I feel I need to write it after seeing so many bad reviews about this anime.\r\nIn fact, the only reason I watched this anime was because I was curious after I read all these negative reviews. I wanted to see just how bad it was, and I'm glad I did. I went in with low expectations, and was pleasantly surprised. \r\nI will detail what I liked or didn't like about the anime, and will not focus on individual scores for story, characters, music etc. \r\n*spoilers*\r\nThe things I didn't like/understand >\r\n# The girl's character\r\n# Why everybody liked her.There was nothing special about her\\n\r\n# The squirrel (who also is in love with her)\\n\r\n# Why such unbelievably hot guys would instantly fall for someone so average.\\n\r\n# No romantic development - they just fall in love with her\\n\r\n# The eldest two bros showed no romantic interest in her (the lawyer was once left red faced, but that story line wasn't pursued)\\n\r\n# Why such a rich family has no servant\\n\\n\r\nThe things I liked>\\n\r\n# Unlike what many reviews here state, the brothers did have character development, some more than the others.\\n\r\n# Pleasantly surprised to see how well balanced these guys were - instead of fighting with each other over the girl, they gave her the option of choosing one of them. Very mature and very unexpected.\\n\r\n# I really liked the 2 guys who were shown to genuinely (according to me) like her - the red head and the sports guy.\\n\r\n# Every brother has a distinct personality\\n\r\n# The brothers are smoking hot.\\n\\n\r\nI'm sure there are more likes and dislikes, but only these come to mind now. It's a \"junk food\" type of anime where you watch it for the sake of watching it. I binge watched it in a day. Go in with low expectations and you'll be pleasantly surprised.\\n\\n\\n",
            "date": "2017-02-07T20:53:00+00:00",
            "helpful_count": 56,
            "mal_id": 240138,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5909765.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Sonal1988",
                "username": "Sonal1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=240138"
        },
        {
            "content": "I don't know what I was thinking when I decided to watch this anime. But I do know  watching this anime was a complete struggle. \r\nStory: The storyline is fairly simple: dad remarries, daughter moves in with 'brothers'-they certainly don't act like brothers-and 'shenanigans' ensue. Predictable and incredibly dull. Although this anime is only twelve episodes long, it felt longer and it was a chore for me to watch. I can't even remember how it ended. 1/10\r\nArt: I am just going to cut to the chase and say that I didn't like the art. While it is more appealing than the actual story, thatdoesn't really say a lot. The art is boring for lack of a better word. 3/10\\n\r\nSound: I despised the opening...it was tedious in every way possible. I don't have any words to describe how bad it is. 2/10\\n\r\nCharacters: Oh boy, on a scale of 1 to Haruka from Uta no Prince-sama on the irritating metre, the female protagonist is about as annoying and spineless as Haruka is. She barely reacted when her so-called brothers were being perverted and hitting on her. I  hoped that she would stand up for herself and tell them to back off. The vast majority of the characters fade into the background. 1/10\\n\r\nEnjoyment: Needless to say I didn't like this anime. At all. It was pure torture. 2/10",
            "date": "2014-07-30T07:07:00+00:00",
            "helpful_count": 56,
            "mal_id": 154433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/quirkista",
                "username": "quirkista"
            },
            "url": "https://myanimelist.net/reviews.php?id=154433"
        },
        {
            "content": "We all know that the internet has a lot of power nowadays. And it can raise a lot of awareness for all kinds of good causes, such as famine and natural disasters, but instead, the producers of this anime decided to use it for illustrating the dilemma that every young female has to face nowadays: with which of her 13 brothers does the main character want to start a romantic relationship? First world problems, right?\r\n~Story~ 1/10\r\nSo I kind of explained the plot of this show in one sentence in my introduction. The series is about Ema Hinata, a 16-year old girl, who's actually been aloneall of her life (can you already see the clichés coming?), and I'm excluding her stupid pet squirrel while making this statement. Basically, her life sucked until her father decided to marry a woman who has 13 (!) sons. And so Ema ends up with 13 new brothers, who are, of course, all deeply in love with her. I won't start about how unrealistic it is that a girl ends up with 13 brothers because of a remarriage, but what are the chances that ALL 13 OF THEM (including a toddler for God's sake) are in love with her? Every episode featured Ema with another brother, and it was all incredibly predictable and dull. Seriously, when I finished, it felt like I had watched around 50 episodes, and watching these 12 episodes (which felt like 50) felt like a chore. I'm not going to dig deeper into the story, because this is all there is to it. I'll admit it, maybe I'm just not the kind of person to enjoy reverse harems, but I can't imagine anyone else (apart from obsessive fictional bishounen-sensitive teens) enjoying this crap.\\n\r\n[CONCLUSION]\\n\r\nIt's debatable whether there's really a story in this. The comedy was lousy, and not in place, sometimes even cringeworthy. The \"plot\" was unrealistic and seriously stupid. Who came up with this?\\n\\n\r\n~Art~ 5/10\\n\r\nThe art in this wasn't the worst I've ever seen, but it definitely wasn't great. For some reason, every single dude in this looked like a chick, and there was even one brother that resembled a cat (yes, I'm talking about the perverted one). It had some pretty colors (to attract horny nose-bleeding teens, probably), but don't fall for them, this anime is still a pile of shit. A colorful pile of shit, but still a pile of shit.\\n\r\n[CONCLUSION]\\n\r\nColors everywhere, and males looked like females. It was so confusing that at one point, I couldn't even tell who was supposed to be a trap anymore.\\n\\n\r\n~Sound~ 4/10\\n\r\nOne word to describe the music in this: forgettable. The opening was a stereotypical reverse harem intro, so forgettable, I have no idea how it went anymore. The show probably had some OSTs, but umm yeah. Wait, I remember three things considering the sound in this. 1) The ending. I didn't know I was watching Uta no Prince-Sama? Nobody asked for those traumatizing ending visuals, but then again, nobody asked for this piece-of-shit-anime either... \"Kissu kissu, Ai need ur lavu\"... 2) The voice of that damned squirrel. At one point, I was just irritated beyond belief, to the point where I actually wanted to set my computer on fire, so that I could see that stupid rodent with its stupid voice finally burn. 3) The voice of that toddler..... Woah. You know how some things are called a match made in heaven? Yeah, the character and the voice of the toddler were the complete opposite of that. It was as if Jigsaw was trying to convince the viewers of his cuteness. Seriously, no toddler has a voice that low. \\n\r\n[CONCLUSION]\\n\r\nMost of this was below average, and the voice acting was rather bad.\\n\\n\r\n~Characters~ 1/10\\n\r\nWell, this should be fun. I'll go over the characters a bit quick, since there are so many. I'll start with the main character, Ema. The wiki calls her the heroine of the story, but I don't think she's a heroine. She's just kind of there. She doesn't stand up for herself even once. Seriously, why is the girl in reverse harems always either an aggressive tsundere or a retarded, brainless zombie like Ema? There's nothing interesting to tell about her, so I'll move on to my favorite character: the squirrel. Just kidding, I hated him more than anyone. He was trying to \"protect\" our beloved main character from the brothers, which involved some serious stalking incidents. There was even a moment where us viewers were supposed to feel bad for that gnawer, because Ema didn't take it with her to school or something. Is that the definition of \"feels\" nowadays? Now, for our 13 Asahina brothers. The oldest son, Masaomi, the stereotypical caring guy, whose only life concern is his family. The second son, Ukyo, the stereotypical smart guy, who is basically the slave of the entire household. The third son, Kaname, who is a monk, but a very perverted one, and he hits on every girl he sees. Great monk. Seriously, does buddhism allow that kind of shit? The fourth son, Hikaru, is the trap of the family. The fifth and sixth sons, Tsubaki and Azusa, the twins who have the same two lifegoals; becoming anime voice actors and becoming Ema's boyfriend. The seventh son, Natsume, the only normal guy, who decided to leave the house and live on his own (and who could possibly blame him for that?). The eighth son, Louis, the stereotypical silent guy who wants to be a hairdresser or something. The ninth son, Subaru, the stereotypical sporty and awkward guy. The tenth son, Iori, who seems normal at first, but he has a strange obsession for flowers. The eleventh son, Yusuke, the stereotypical tryharding guy, who's failing at life. The twelfth son, Fuuto, who is 13 years old, yet looks like he's 18. Has some sadistic tendencies, even though he's just a spoiled 13-year old. He's kind of like the Joffrey Baratheon of Brothers Conflict. And last but definitely not least, the thirteenth son, Wataru, the toddler with the godzilla voice. I don't know about you, but I love this cast.\\n\r\n[CONCLUSION]\\n\r\nThe cast consisted of stereotypes and the characters got no development at all.\\n\\n\r\n~Enjoyment~ 2/10\\n\r\nWell, this is very subjective. After watching this (which I do not recommend you) you might end up laughing at the stupidity of this, or you might be crying because of your loss of faith in humanity. One thing that's for sure though, is that you'll be incredibly frustrated by the main character, who could have been replaced by a doll and no one would have noticed a thing. The final episode of this show is absolute and utter bullshit and will make you question why you watched it (even though you already did that whilst watching the series itself). Oh, and your eyes will probably bleed because of the ending.\\n\r\n[CONCLUSION]\\n\r\nThe second hand embarrassment in the comedy of this was huge, the show wasn't funny and all in all just very boring.\\n\\n\r\nI have only one more thing to say: spare yourself. Spare yourself from this so-called Brothers Conflict, which I experienced as a conflict with my inner self, debating about whether I should drop the shit or not. And that repeated itself after every episode. I definitely made the wrong choice finishing it, it's not worth your precious time. Peace.",
            "date": "2016-07-01T17:25:00+00:00",
            "helpful_count": 48,
            "mal_id": 222671,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ThatCrazyElitist",
                "username": "ThatCrazyElitist"
            },
            "url": "https://myanimelist.net/reviews.php?id=222671"
        },
        {
            "content": "Brothers Conflict was a breath of fresh air for me. Sure, it's a reverse harem, but it is one that isn't too flamboyant and with a myriad of personalities, this is a show that I could easily re-watch again and again. This show is not for all, but from what I've stated from another review, I am weak at heart when it comes to this type of genre. ;)\r\nStory: So the protagonist, Ema Hinata, is put into a predicament in where she has to move in with 13 step-brothers. Yes, 13 of them. Her father is re-marrying and here is a girl who has livedmost of her life alone, so the result is that she has had a lack of physical and social contact with her father. Now, you throw her into the mix and boy oh boy is she in for some surprising events. Sure the plot isn't too creative, but it's nice to see that the female is self-sufficient and not such a damsel in distress like in other shows I've seen. \\n\\n\r\nArt: The animation style is nice, though not mind-blowing. It's nice to see the different character designs of each of the men and the one younger brother. Some wardrobe and fashion designs were thought out and sometimes it's nice to see a new hairstyle or a charming outfit on the characters you are viewing.\\n\\n\r\nSound: The show doesn't offer anything memorable in terms of music. Yes, even with one of the characters being an idol, I don't think the show really focused much of his particular songs. I would say  The OP theme is probably the only thing that stuck out for me, which is sung by Nobuhiko Okamoto! That aside, we have a range of voice actors, all of which are very talented and that bit of fan-girl in me just goes *toki-toki* with various discourse that is portrayed throughout the series. \\n\\n\r\nCharacter: For a 12-episode show, it's fair that they included all personalities and different perspectives of the males with how they view their beloved imouto (sister). Of course, don't expect to see flushed-out character development. Our female protagonist is a typical teen going through her goals and life choices; she's looking to graduate high school, but during the series, there are qualities in her that are quite passive. If she had a touch of spunk or another trait that made her more dynamic, I think I would have rated the character category a bit higher. Oh and let's not forget, Ema has a talking pet squirrel with whom she is able to communicate, which is a cute bonus. \\n\\n\r\nEnjoyment and Overall Conclusion: This show is worth re-watching again. Though it's not my top choices of a reverse harem show, it's light and rather short, still leaving room for hope and a sense of mystery about various possibilities that could happen in the future. ;) \\n\\n\r\nPros - A shoujo, reverse harem that isn't flamboyant and provides opportunities for viewers to see many personalities of the male characters\\n\r\nCons -  Protagonist's qualities in some instances (imo), short series and lack of plot creativity.",
            "date": "2013-12-09T07:52:00+00:00",
            "helpful_count": 24,
            "mal_id": 123121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1124729.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NonkiLauren",
                "username": "NonkiLauren"
            },
            "url": "https://myanimelist.net/reviews.php?id=123121"
        },
        {
            "content": "Obviously, this show's not for those who look for a story to follow. So if you're here complaining about the storyline and shallow characters I wonder why you even watched the show in the first place. \r\nThis series is literally intended for a bunch of hormonal teenage girls, and it does a great job in being that kind of show. As a  hormonal teenage girl myself I can tell you that as long as you turn off your brain, these kinds of anime can be highly enjoyable. (or a hormonal teenage boy idk luv is luv amirite)\r\nI'm not even going into detail about thisshow's flaws because there are too many to name and I also think we can all imagine them, especially if you've watched reversed harem before. To sum it up - masochistic heroine, twincest, \"you worked hard\", talking animal friends ft. \"wait....that's supposed to be a guy?!\"\\n\\n\r\nIf you're forever alone like me and you need something to replace the void in your cold empty heart, I recommend this show. Thank you for your time, it's been great.",
            "date": "2015-11-24T12:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 204095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4028617.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/takeyana",
                "username": "takeyana"
            },
            "url": "https://myanimelist.net/reviews.php?id=204095"
        },
        {
            "content": "My sister\r\nMechakucha ni aishiteru\r\nYasashii dake no kisu ga iinokai\r\nGomen dakishime tai yo\r\n( Chikaeruna!)\r\nKanashi mesae setsuna sasae\r\nHiki uketta ra\r\nIma sugu ni\r\nSubete wo azukete\r\nKiss kiss kiss\r\nI need your love.\r\nOk, so without further adieu, I hereby make my presnt my ratings for each category of this 12 episode anime, which at first it was 13, eh who cares?\r\nSo my ratings:\r\nStory and character-fair 6.\r\nStory:\r\nBasically this is a reverse harem at its simplest and every plot  revolves around Ema who is caught in a conflict with the  Asahina Brothers who are vying for her affection. Despite of its title \"Brother Conflict\" only a handful are  in competitionfor the girl's heart, I gave it such score because there some episodes that I really don't like and there are episodes that were really touching.\\n\\n\r\nCharacter:\\n\\n\r\nI gonna classify each characters in this anime in the following:\\n\\n\\n\r\nNo Contest: Masaomi, Ukyo, Hikaru, Iori and Wataru.\\n\\n\r\nUnder this category, the mentioned brother were never seen actually competing for Ema's affection in fact the anime itself never gave these character's such opportunity to show their romantic intention for Ema. Masaomi is more like the father figure, Ukyo was more of the mother figure since he does the cooking and cleaning before Ema's arrival, Hkaru is gay and even if he did mention that he's gonna get in the fray it don't look like he's serious due to the fact that he's a novelist who needs ideas for his literary works, Iori on the other hand have very limited roles and Wataru ? Well, he's still a kid dress as a girl that I'll never understand why this anime's illustrator drew him that way.\\n\\n\r\nPredators: Kaname, Futo and Tsubaki\\n\\n\r\nHere, pretty obvious these brother have exhibited a certain aggressiveness towards Ema, it started with Kaname whom it wasn't clear if he's a monk or a club host you might say he's one of the reason why I gave this category  such score, Futo is one character that I would like to kick his balls and Tsubaki, I'd probably wanna slit his throat, I placed them in this category co'z these are the characters that I love to hate.\\n\\n\r\nNice guys: Azusa, Natsume, Subaru and Yusuke\\n\\n\r\nThese, for me, are the guys that I like to be Ema's love interest, though thery're gentlemen, it wasn't enough for me to give this anime a score higher than 6. Personally, if can have it my way I would prefer a Yusuke X Ema arc, since those two go nicely.\\n\\n\r\nFriend zone: Louis and Juli\\n\\n\r\nPretty obvious that Louis and Ema share the same situation were they're both adopted and can speak to Juli (CHIIIIIIII), but Juli is quite annoying and you might say he's another reason why this anime's category deserves  a 6.\\n\\n\r\nThe prize: Ema\\n\\n\r\nbasically she the center of the whole \"Brother's Conflict,\" I like heer sweet and kind characteristics, but there are time that her being passive is quite annoying.     \\n\\n\r\nArt- mediocre 5.\\n\\n\r\nI just really have no comment about this anime's art designed.\\n\\n\r\nSound, enjoyment and overall- good 7.\\n\\n\r\nSound:\\n\\n\r\nI like both the opening and closing theme.\\n\\n\\n\r\nEnjoyment:\\n\\n\r\nSince this anime and the manga was taken out from a otome game, it wasn't surprising that such enjoyment was like a game itself, except it was studio Brain Base who is playing it.\\n\\n\r\nOverall: \\n\\n\r\nThis anime is good enough to be enjoyed, though there are some situation that we wish as to whom the female character should be with, I think that it's enough that such anime with a harem genre should end that way it is. overall this anime is good, CHIIIIIIII!!!!!\\n\\n",
            "date": "2013-09-18T09:53:00+00:00",
            "helpful_count": 13,
            "mal_id": 113311,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=113311"
        },
        {
            "content": "Brothers Conflict is an anime that in my opinion, never stood a chance beyond episode three. It follows the main character Ema Hinata, who we only ever really know as Chi. I didn't actually discover her real name until the very last episode. And even then, i never once thought, 'what actually is the name of this girl?' Nope i guess i was too busy trying to survive what has been one of the most disappointing animes of my life. What might have been exciting to reverse harem lovers, turns out to be...\r\nStory:\r\n....A story thats shallow and unrealistic.\r\nSo what this story is trying to makeus believe is that a seventeen/eighteen year old girl was able to seduce 13 boys regarded as her brothers all by sitting there and looking \"cute\". Though throughout this anime my opinion of cute and annoying have been dramatically redefined. Chi/Ema offers nothing to the story, she rarely does anything to actually seduce these boys and does nothing when they start falling at her feet. What we experience throughout this anime is the progression of love, awaiting the response to the many confessions this girl receives. \\n\\n\r\nArt:\\n\r\n....Art that has nothing to say for itself. \\n\r\nThe art was just your typical modern day anime art. Mainstream and unremarkable. Good quality yes but engaging or interesting, no.\\n\\n\r\nSound:\\n\r\n....Music that that will make you cringe. \\n\r\nI have never rated sound badly in an anime before. Before writing this i had no idea what it actually meant to have bad sound, i mean what could be wrong with it? This anime however has shown me. If you actually attempt to watch this anime you will be plagued by a series of cheesy renditions afforded by one of Chi's superstar brothers, and if that wasn't enough, just to make sure you don't go away disappointed, at the end of every episode is a traumatising song in which all the brothers sing and dance. Never again do i ever want to experience what i went through here. \\n\\n\r\nCharacters:\\n\r\n....Characters that have no soul.\\n\r\nYou have the brothers. Some who like basketball. Some who like video games. One who is a superstar and another who is a transvestite. Just your typical everyday family. All of the brothers however, despite their likes and clothing preferences make the same cheesy moves on the main character Chi and then expect us to be surprised when the grab her by the arm and pull her against them for a dramatic and passionate...hug? Yeah, that all your really gonna get. A lot of hugging and not much else. The main character Chi or Ema is the most disappointing. This girl has no depth to her on any level. What we see of her is a boring girl who rarely makes a sound other than the occasional gasp when one of her brothers makes a move on her. She never objects to any of the things her brothers do but would rather stand there like a deer in headlights without any input what so ever. Yep she has been one of the most annoying characters of a the many shows i have seen, a conclusion i largely put down to her defenceless persona and stupid disposition.\\n\\n\r\nEnjoyment:\\n\r\nThis anime doesn't really amount to anything. Its got an unrealistic story that never evolves, run of the mill art, traumatising music renditions, characters with no depth or personality and an ending which renders all of these events pointless. \\n\r\nBut by all means go ahead and watch this anime, it not so much terrible and as a big lump of boring that never improves or evolves.",
            "date": "2013-09-19T19:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 113463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1910014.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lyon-Lark",
                "username": "Lyon-Lark"
            },
            "url": "https://myanimelist.net/reviews.php?id=113463"
        },
        {
            "content": "[STORY] - 5/10\r\n-----------\r\nThe story and the plot to me was a complete and utter blur. I didn't understand many things in this story, and often got to the point where I got so confused, I just got bored. The romance in this story was very weak in my opinion, although it wasn't the worst. The ending was also kind of disappointing, because nothing major really happened. I felt like there would be a continuation of this anime. Maybe the Specials is a continuation since it is listed as a sequel, but I don't think I'll ever be in the mood to watch it. \r\n[ART] -7/10\\n\r\n-----------\\n\r\nThe graphics were fine, but I'd expect that from an anime that was released in 2013. The scenery and the background was kind of weak and didn't really fit in with the scenes most of the time. \\n\\n\r\n[SOUND] - 5/10\\n\r\n-----------\\n\r\nI only watched the dubbed version of this anime, and the actors / actresses did an amazing job, except Asahina, Wataru, the youngest (I think) son. The English voice actor didn't really fit in with Wataru's appearance, because he's very young and probably around his teenage years still. I would expect the producers to have a young actor to act out Wataru. I also don't know how to feel about the opening and the ending themes. Often times, the ending would be so loud compared to the actual story of the anime, that it would often hurt my ears. \\n\\n\r\n[CHARACTER] - 6/10\\n\r\n-----------\\n\r\nThe appearances of the characters didn't really suit their personality, especially Asahina, Fuuto. His look gives a kind and generous vibe to me, but he was just shown to be very cold at times, and keeps to himself a lot. Also, I feel like there was too many protagonists / main leads. According to MAL, there are 14 main leads, like jeez, I already have to study for exams, and now I have to study all 14 of the protagonists' names? Give me a break!\\n\\n\r\n[ENJOYMENT] - 3/10\\n\r\n-----------\\n\r\nI didn't really enjoy this anime all that much. Yes. That's all I have to say. \\n\\n\r\n[OVERALL] - 5/10\\n\r\n-----------\\n\r\nOverall, I will definitely not recommend this anime to any of my friends to watch, and I don't think I'll rewatch this ever again, but again, it could've been worse, but it wasn't the worst. \\n\\n\r\nFINAL SCORE: \\n\r\n5/10?",
            "date": "2018-10-16T20:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 291912,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6159701.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnastasiyaV",
                "username": "AnastasiyaV"
            },
            "url": "https://myanimelist.net/reviews.php?id=291912"
        },
        {
            "content": "Brothers Conflict is one of the very few watchable reverse harems in the world of anime, but that's just it. 's not good, or bad, it's just, \"watchable.\" and unfortunately it can be addicting to weak watchers, like me. \nStory: 7\nI'm sorry, but the plot is way too outrageous to take seriously. I mean, really? A girl who isn't all that special looking moves into her brothers' home with NO PARENT SUPERVISION, and they all end up falling in love with her, and she just shakes them all off like they're a bunch of fucking cats. That's too perfect. I know its just an anime,but that's not how life works. It actually made me kind of angry. Though, some elements, like the fluffiness of the cute scenes/exchanges with my personal favorite brothers. (Yuusuke, Natsume, Azusa, but I'll get into that later...) I really liked that. SOME of them respected her and that led to a lot of cute scenes. \\n\\n\nArt: 7\\n\\n\nThe art isn't anything to giggle otokully (wtf Hattie?) at. It's obviously not as good as Death Note and Shingeki no Kyojin, but whatever. I mean, I didn't like the design of the protagonist, Ema. She looked ditzy and dumb. (Again, more on that later) But some character designs were pretty creative, even though they looked like ripoffs of other characters of other anime. Some their designs totally pissed me off. Whatever, it wasn't that bad, really...\\n\\n\nSound: 6 \\n\\n\nMy sister was obsessed with the ending song for some gay reason. She would sing it nonstop when we got home from school, and I would yell, \"What the fuck is that?!\" And she'd yell back. \"It's the Brothers Conflict ending!\" I'm not one to watch endings, but since she mentioned it, I took the time to watch it that day, and I guess the ending's pretty creative relatively. I mean, you got all these Brothers, why not use them for a choreographed dance number in which they all sing, even though some of them really shouldn't. (Subaru, when he sings, sounds like a dying cat.) It was okay. The opening was so annoying though!\\n\\n\nCharacter: 5\\n\\n\nOkay, there are 13 Brothers and one annoying protagonist. Its kind of given that I would hate all of them except a legitimate few. They all ended up falling in love with her, in which I scream,\"BOLLLOOCCKSSS!\" But some characters are worth mentioning. I mean, the only one that didn't force himself upon the protagonist was Yuusuke, that red haired bastard. Their exchanges were so sweet, along with Azusa's and Natsume's. I'm just saying, they weren't overwhelming, and seemed fair to her, giving her a chance to breathe! While there are characters I like, I pretty much hate the rest of them and their designs. A perverted monk is basically a contradiction in it's own name, really. Is that the best of your creativity? And that pop star! Fuuto! I spit at his name! He's 15, my age, and attempting rape! Modern society, people. Is that normal in Japan? Also, I hated his design. Whenever he came on screen, I'd yell, \"FUCKING NEKO-CHAN!!\" Cause face it, he looks like a cat and needs mouth surgery. There are too many hateable characters! That's a harem's nightmare! \\n\\n\nEnjoyment:\\n\\n\nAs I said, it was my guilty pleasure. I watched it to the end, sadly. I didn't mean to, it just happened...\\n\\n\nOverall: 6.5\\n\\n\\n\\n",
            "date": "2013-09-21T20:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 113741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HattiewithSugar",
                "username": "HattiewithSugar"
            },
            "url": "https://myanimelist.net/reviews.php?id=113741"
        },
        {
            "content": "Well this anime earn my 2nd worst anime to watch. Reason the story start with a girl that live with 13 brother way older then her and wait the story lead to nothing and if I was the writer of the script I will be a shame to put a anime that have no development of the personage how so ever and to add the love that the brothers show the female lead personage is almost shameful. I just believe that should create a better story that to traumatize the girl in the show. Well to say that the show need better arts as theFemale lead she where 90% of the show the school uniform and useless character as Squirrel that is maybe 5% of the show. I do not recommend that show to been watch because even the script that is use make no scent how so ever. I do not recommend the waste of 13 episode to watch this show.",
            "date": "2016-01-24T17:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 209312,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4858237.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ALBrassard",
                "username": "ALBrassard"
            },
            "url": "https://myanimelist.net/reviews.php?id=209312"
        },
        {
            "content": "Okay, so despite all the negative reviews, I absolutely fell IN LOVE with this anime. i was just searching for something to watch, but after the first episode, I just wanted to keep going. The brothers all have pretty different personalities, and in each episode, the girl has a \"special moment\" with some characters. \r\nStory (7/10): Like most other reviews have mentioned, it is just a typical reverse harem anime, but story was very well written.\r\nArt (8/10): This art was overall really good! It's nothing too fancy, but it's a lot better than most animes.\r\nSound (6/10): I didn't like the intro or outro song alot. The tune was kinda hideous and it was not catchy. The lyrics were okay, but the voices for the songs were terrible.\\n\r\nCharacter (9/10): Okay, so this is all based on personal opinion. As I said, different boys get their time with Ema. The development, although kind of slow, was pretty entertaining. \\n\r\nEnjoyment (10/10): As I've mentioned, I was hooked on the first episode! Each episode, it wanted to make me continue watching!  Most of the characters were pretty hot and despite their outside appearance, their inner personality is quite adorable. ^-^\\n\r\nOverall (9/10): This reverse harem anime is mostly directed towards girls. The way I see it, just put yourself in the position of Ema, the main character, and it's basically like a choose your prince games. If you need to get something or someone off your mind, this is a great piece to watch.",
            "date": "2015-01-25T07:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 178936,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/um_idkbro",
                "username": "um_idkbro"
            },
            "url": "https://myanimelist.net/reviews.php?id=178936"
        },
        {
            "content": "I'm a bit ashamed to admit that reverse harem is one of my guilty pleasures. This, however, was utter crap. I only watched half of the anime, but I don't think I need to watch any more. The ending is way too predictable, and I'd like to spare my eyes from finishing the rest of that dreadful anime.\r\nThe story (2/10):\r\nNot only did this anime have no proper plot, it was just crammed with clichés and obvious scenarios. Furthermore, it had nothing else that could compensate for the horrible storyline. There was no humor, action, excitement, nothing. This anime was bland and a complete waste oftime. I demand to have my hours back.\\n\\n\r\nThe art (8/10):\\n\\n\r\nJust about the only thing that prevented me from giving this anime a 1 was the art. I've seen better, of course, but I'm not going to lie and say that the artwork was terrible. \\n\\n\r\nThe sound (5/10): \\n\\n\r\nI don't have anything particularly bad to say about the voices/soundtrack, mainly because I don't remember how any of them went. I was most likely thinking about how horrible the anime was than paying attention to the soundtrack.\\n\\n\r\nThe character (2/10):\\n\\n\r\nOkay, I can probably write an entire book describing how detestable and flawed these characters are, but I won't because I don't want to waste your or my time. \\n\\n\r\nThroughout the entire anime (or at least the half that I watched), I wondered if the female protagonist was a robot. I have never seen such a boring, voiceless character before. \\n\r\nAs for the brothers, no matter how hard I tried to identify them and remember their names, I couldn't. Aside from the color and style of their hair, there's nothing else that distinguishes any of the brothers. \\n\\n\r\nOverall (2/10):\\n\\n\r\nDid I enjoy this anime? Hell naw. Would I recommend this anime to anyone else? Have you been paying attention to my review? \\n\\n\r\nThis anime was just as bad as Diabolik Lovers (anyone who's interested in reverse harem would most likely know about this one). I strongly advise you to not waste your time watching this anime... I mean, unless this kind of stuff floats your boat, of course. \\n\\n\r\nIf you're planning on watching this anime, be WARNED: you WILL lose brain cells.",
            "date": "2015-06-23T06:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 191012,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Grapesandraisin",
                "username": "Grapesandraisin"
            },
            "url": "https://myanimelist.net/reviews.php?id=191012"
        },
        {
            "content": "Ok. Now where do I start?\r\nBrothers conflict was pretty much a reverse harem on steroids. Not only are there TOO MANY hot bishies, but there is also a stupid squirrel that can fucking talk. Oh lord. \r\nThe main protagonist is a stupid, indecisive, thick headed girl. She couldn't even tell if the guy liked or should I say lusted after her. Another thing that bothered me was the lack of character development. It seemed as if all Ema had to do was breathe or blink and another step brother fell in love with her. The step brothers had no respect for her and did nothesitate to force themselves upon her. Honestly, I think I think I would have liked this anime so much better if it was a hentai.",
            "date": "2015-01-19T13:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 178537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/codegeassxoxo",
                "username": "codegeassxoxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=178537"
        },
        {
            "content": "I think what really made my issue was the age differences in the characters. While some only shared 3-5 year differences, it's still very very strange and mostly illegal. Ema is 17 in the first season, and only 4 of the boys are anywhere near her age, from 20 and under. \r\nLets do this by age shall we? \r\nHere are the 4 nearest to her age:\r\nFuuto - 15\r\nYuusuke - 17\r\nIori - 18 (Mind you he is now a legal adult and since they seem to set in Tokyo, any relations with Ema are considered a type of statutory rape)\r\nSubaru - 20 (Same applies to thisdude)\\n\\n\r\nEveryone Else's Ages from Youngest to Oldest:\\n\r\nWataru - 10\\n\r\nLouis - 21\\n\r\nAzusa - 24\\n\r\nNatsume - 24\\n\r\nTsubaki - 24\\n\r\nHikaru - 26 (though not really romantically involved with Ema)\\n\r\nKaname - 27\\n\r\nUkyou - 29\\n\r\nMasaomi - 31 \\n\\n\r\nTherefore, everything else should be off limits and all of these men (excluding Wataru) should be quite disgusted with themselves.\\n\\n\r\nOne of the most flirtatious is Kaname, who is nearly 30 and he flirts and kisses her, and that is not appropriate. And Ukyou is 29 and has fantasies of her, and Masaomi also has feelings for her and they are the two oldest siblings! Then there is Tsubaki, who likes to tease her and make her feel bad or nervous, and if that isn't a sign of emotional abuse/manipulation, i don't know what is, especially from his jealousy. \\n\\n\r\nI have to say, this underage girl with older men liking her is very unsettling and what moved me to stop watching it. It would have worked better if say, they were the father's sons from different mothers, all closer in the same age, rather than coming from their mother ( i mean 13 kids? that poor woman ). I really couldn't see past that in the anime and could not enjoy it. \\n\\n\r\nNot to mention there wasn't really any reason to like Ema that was spectacular, she was a kind person and though pretty, it would be unlikely ( yes i know its a fictional thing ) that ALL the boys would like her. Ema's emotions seem stuck on: \"Um, hi, im Ema, and i'm still new so everything is awkward\".",
            "date": "2017-12-29T15:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 266806,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MissCritical",
                "username": "MissCritical"
            },
            "url": "https://myanimelist.net/reviews.php?id=266806"
        },
        {
            "content": "I'm going to have to say that this anime, unfortunately, is on my bad list of anime. It's not the worst though. This anime does has its pros along with its cons. I'm going to admit, this review may have spoilers, but to be rather honest, it's best to maybe put this anime to the side, reader.\r\nStory [3/10]\r\nThe reason I give the story a 3 out of 10 is because, well, the 'story' isn't that great. In fact, there's no real story at all. There's no plot driving this anime. The main objective of this anime was to sell its game(s) to the young audienceof teenage girls. If I have to say what the anime use to drive the anime to keep going, its that it use each episode to show off a brother for the main protagonist. And I must admit, this makes this EXTREMELY boring to watch. Because there's nothing to help the viewer to keep motivated to watch, it was so boring to watch that it was mentally painful. One of the main objectives of an anime to do is to keep the viewer encouraged to keep watching. If there's no real plot or anything to keep the viewer watching, the anime will turn stale, no matter how much pretty artwork you shove into the anime itself. And speaking of art...\\n\\n\r\nArt [7/10]\\n\\n\r\nNow, the art isn't that bad. The art was able to stand on its own ground and it helps catches the viewer's eyes. The background of the anime, however, is boring and bland. It had the generic anime style to it, but the characters had an interesting appearance. But the male characters, unfortunately, mostly look like females themselves. The anime is supposed to grasp its audience of young, teenage girls, right? If the characters don't look masculine, it'll throw off the viewer who was interested in a reverse harem. Art is a major key opponent to an anime, and if it can't appeal to the audience, it might throw them off and eventually make them not feel the need to continue watching the anime. The art is good enough to keep me wanting to watch, but due to the lack of plot, it left a dryness in my mind, a static, basically.\\n\\n\r\nSound [4/10]\\n\\n\r\nHonestly, I don't even remember the music at all. If I don't remember or ever notice the music to begin with, it must've not been anything special. Music in reverse harem tends to be bland and lacking of what it could've been, in my opinion. I feel bad for the composer(s) of the music. Maybe because of the lacking of moments that could've gotten the viewer's attention, they weren't able to push out good, emotional music. In a short summary, I'll say the music was lacking here.\\n\\n\r\nCharacter [2/10]\\n\\n\r\nOh boy, here's the fun part. The characters were UTTERLY BORING. They lacked real personalities and above all, I could only see them as just selling points of the games the anime producers were trying to throw over to get customers. The only time I can see the 'personalities' of the male characters were when an episode puts them into the spotlight. And what makes me very tasteless to this anime is that they threw in a young boy and the freaking squirrel (the voice's annoying, might I add) and that astounds me. If there was one character I had some interest in, it was Fuuto, even though I have an angry hatred towards him as a character after a major stunt he attempts in one later episode. \\n\\n\r\nIf there's something I would've love to see, its how the brothers interact with one another, showing brotherly love. There were 'times' where they would, but its cut in a matter of seconds. Showing brotherly love would've helped create characters. What I would've also love is how the brothers would've reacted to having a new step-sister in the house realistically. Their mother just married to some guy they barely even knew about and now they have to act like its nothing when there's a new sibling in the house? That would've been interesting to see really, to see maybe some react negatively to the new step-sister of theirs, and the new step-father even. But then again, what am I saying? Their mother had 13 sons and somehow is not dead or extremely fat. She seriously needs to get her tubes tied.\\n\\n\r\nEnjoyment [1/10]\\n\\n\r\nI didn't have a fun time watching this. It was a painful watch through and I feel empty after finishing this anime. This left a dry taste through out the whole anime and never will I ever watch this again, period. Hate would be a strong word for this, but rather heavily disliked this anime. The anime doesn't show real conflict (get it?) between the idea of having a new step-sister and for some reason, the bland main character, Ema, they fall for her easily, and all 13 of them. What kind of luck is that? Even when she flat out says that she only sees them as brothers, they will still get onto her and kiss her. Heck, one of the brothers even almost raped her in her sleep! Unacceptable!\\n\\n\r\nOverall [2/10]\\n\\n\r\nIf anything, its the art that somehow pull this anime out to a '2' on me. This anime is not appealing, even as a reverse harem. I know I shouldn't expect much from a reverse harem, but this anime goes down into a very big, dark hole and it won't be able to dig itself out. I will never recommend someone to watch this anime. If you're looking for an interesting reverse harem to watch, this is not the place you should look over to. There are some other actually good reverse harems out there, trust me.",
            "date": "2017-02-28T14:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 241614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5150897.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RememberMeAsOne",
                "username": "RememberMeAsOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=241614"
        },
        {
            "content": "Honestly, this has to be one of the most boring anime I had ever watched. When I first watched it, I thought it was gonna be a good reverse harem anime, but boy was I wrong, this anime was super boring and I literally took a nap while watching this. The story was...meh, it's about a girl romancing with her new 13 step-brothers. The art was pretty, in my opinion. The opening is catchy, that's the only thing I like about this anime! :D The characters were decent, I'm not even sure if they even had character development, I'm pretty sure they didn't. Overall, Idid not enjoy this anime one bit and dropped it because of how boring it is. It's a painfully boring anime and I give this a 1 out of 5 stars. :(",
            "date": "2017-02-21T21:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 241119,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4544027.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/m_ngu",
                "username": "m_ngu"
            },
            "url": "https://myanimelist.net/reviews.php?id=241119"
        },
        {
            "content": "When I first came across Brothers Conflict, I was binge watching reverse harem anime like nobody's business. I mean what else could entertain a 13 year old girl on a quest for the perfect fantasy? Well, after checking out my review from the past, I see that I grossly undermined the true awfulness of this particular harem, so I'd like to correct my original findings.\r\nStory - 4/10: A harem revolving around the daughter of a famous adventurer, who one day finds out her father's going to re-marry. Instead of living with her father and new step-mother, she decides to move to an apartment complex ownedby her step-mother, only to find out that she has 13 step-brothers. Sounds interesting? To my past self, yes, to present me? No way on God's green earth would I give an anime with a synopsis like that a second glance. Unfortunately, I find this a reoccurring theme with reverse harems in general. Typically a really shallow plot revolving around a girl who somehow gets caught up with a bunch of attractive guys who fall in love after she breathes. Although shallow, the plot could have been put to use (somehow), unfortunately the creators squandered that opportunity with the characters.\\n\\n\r\nCharacters - 3/10: I cannot force myself to give a score higher than this because of the way the characters turned out. Out of all 13 brothers, only Tsubaki, Azusa, Louis, and Subaru get decent background stories. That may be sad, but just wait til you get a hold of the main character, Ema Hinata. Like I said before, in most reverse harems you get main characters lacking a personality (see, Amnesia and Diabolik Lovers), but man Chi's squirrel had more personality in his stupid bow than she had in all 12 episodes. It really soured my mood to see 13 dudes fall in love with a chick who's only capable of blushing. All in all, the story just had too many characters, with bland/blank backgrounds, and too little reason for them all to fall in love with blandy, the blushing broad. \\n\\n\r\nArt - 8/10: Although there's many things wrong with this anime, to my amateur eye, the art is fantastic. The only thing all the characters have going for them, is that they're at least distinguishable in a crowd. I'm not much of an art fiend, so I can't be too specific, but I'd have to say that one of the reasons I kept watching had to be because the art was so nice.\\n\\n\r\nMusic - 5/10: The main reason I watched this anime was for the opening. There are too many anime that I've come across with lackluster music, but I have to say, the opening is catchier than I'd like to admit and I looked forward to starting each episode for it. Besides that, I don't remember the music standing out in any particular way, so I'd say a 5 is a fair score.\\n\\n\r\nEnjoyment- 3/10: If you couldn't gather from the rest of this review, I did not enjoy this poor excuse for an anime. My time was thoroughly wasted and those hours I spent drooling at my computer screen, could have been dedicated to drooling over better anime, or repeatedly bashing my head into a wall. :)\\n\\n\r\nOverall Score- 3/10: I was going to give it a 4 just to be nice, but I'd be lying. The only reason I'd recommend this anime to anybody is if I wanted revenge. I could have gone my whole life without watching this sorry show and others like it. All I can hope is that, all who read this take will take my review seriously and spend time on the endless list of GOOD romance anime, with a GREAT plot, and AMAZING characters.",
            "date": "2013-11-18T02:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 120677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3235033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/promesse14",
                "username": "promesse14"
            },
            "url": "https://myanimelist.net/reviews.php?id=120677"
        },
        {
            "content": "Whoooah! Girl who thinks she's just plain somehow has a house of not 2, 3, or 4 boys in love with her- It's a baker dozen! All in love with her and kinda sexual harassment-y at times.\r\nAnd that's it. That's as deep as it goes. Sure they try and put some tragic back story to gain some sort of plot- But the attempt is weak and the outcome is a fomalic romance that only a young teenage would find romantic. \r\nStory: Just like above- the story can barely stand on it's own two feet. We meet Ema who is forced to move in with hernew dozen (give or take) brother. Sure there's some whole family love thing going on with her, but all the brothers seem to want more than just darling sister, and let her know. A lot. It's to the point of cringe. \\n\\n\r\nArt: yeah, It looks pretty.\\n\\n\r\nSound: the voice to me is annoying. Especially the attempt at a side kick. No thank you.\\n\\n\r\nCharacter: Development? Plot? what are those things? There is no changes to speak of! Nothing happens between them and in the end everything is the same. Did any of them grow? no. Did any of them become a better person? NO. In fact, they just learned better ways to step up the rapey game. Awesome. Not to mention that I am to believe that a dozen men all fall in love with the same girl within a couple of months of meeting this person for the first time and the whole family is ruined because of it? Not even close to true. \\n\\n\r\nOverall: I think this helped me learn some Japanese phrases as it was the same thing over and over. Not really enjoyable. I kept thinking it'd get better. Nope. If you are thinking this is a great harem like Ouran- please keep going. Don't waste your time.",
            "date": "2014-10-19T16:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 165335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4189459.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lehcara",
                "username": "Lehcara"
            },
            "url": "https://myanimelist.net/reviews.php?id=165335"
        }
    ],
    [
        {
            "content": "I wanted to kill myself for watching this upon a friend's recommendation.\r\nPathetic one-dimensional girl, horrid plot and those good-looking brothers of hers might really be sexually uninhibited for all 12(?) of them to launch at their step-sister.\r\nAt one pointed I couldn't decide whether to be sympathetic towards her suffocating situation or punch my screen due to the level of stupidity main girl has. FeelsBadMan\r\n*What's there to spoil? We all know where these kind of stories go.*\r\nAt least the art is decent enough for it to gain a cult following.\r\nThe only rating I gave that is higher than 3 is the Sound for the catchy OPand ED.",
            "date": "2016-07-09T17:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 223608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5528166.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/lilxan",
                "username": "lilxan"
            },
            "url": "https://myanimelist.net/reviews.php?id=223608"
        },
        {
            "content": "how do i describe this anime? This is a good example of a guilty pleasure anime. While i CRINGE at parts especially the kissing scenes, i find it hard to stop watching because i want to see where the plot goes. I despise the incest that is this series as a whole but i still rewatch it from time to time when i want to watch some comedy guilty pleasure type of series. The voice acting is really decent which what brought me to find out about this anime in the first place. my official analysis, i find this anime very cringeworthy but surprisingly enjoyable.",
            "date": "2018-08-06T07:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 285728,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nylife1022",
                "username": "nylife1022"
            },
            "url": "https://myanimelist.net/reviews.php?id=285728"
        },
        {
            "content": "P R E M I S E\r\nBrothers Conflict is an anime adaption to the otome game series; I've played both Passion Pink and Brilliant Blue, where the numerous stepbrothers are split to the more \"passionate\" ones (ex. Fuuto, Tsubaki, and Kaname) to the more \"mysterious\" ones (ex. Azusa, Hikaru, and Iori). I personally prefer Passion Pink because of the route plots and the appeal of the cast.\r\nAside from watching this anime in respective Japanese, I've recently viewed the English dub episodes purely because I can appreciate English dub if they're good and Funimation has featured their talented voice actors in this one (J. Michael Tatumas Masaomi, Michael Solusod as Tsubaki, and Josh Grelle as Azusa are only a few of them). Other than that, I would never want to view this messy and nonsensical anime again. Below is why.\\n\\n\r\nS H O R T C O M I N G S\\n\r\nI'll begin with the plot - poor, poor, poor. There's hardly an excuse to have every single brother fall in love with you, despite you being the only sister they have, unless they've previously known you (and only one of them has so they have an excuse I'll accept). The heroine is a dumb female lead, having too much optimism to the point of *SPOILER ALERT* being sexually harassed by her brothers and actually allowing it to happen. Hinata Ema's - or should I say Asahina Ema's - thoughts are too pure for her own good, and I suppose that's just her innocent personality, but it gets on my nerves. It doesn't make me care for her, and it definitely doesn't make me root for any of the guys to grow their romantic attraction to her.\\n\\n\r\nAs for the rest of the characters, I have to say this - the Asahina brothers' mother must've been absolutely insane to get pregnant to all 13 boys. You'd think that at least one of them would be a girl or that the mother herself would die. But no. This is anime, so it barely passes as a \"silly what-if story,\" and it just so happens that all of the boys are completely different in personality and talent. The diversity in appearances and such makes you question if they really are related, but again, this is to be expected from an anime. I just don't like most of them; they aren't attractive either in looks or personality. If one is nice, they're either creepy or suspicious. If one is mean, they're annoying tsun about it. The ones I disliked the most were Kaname and Fuuto, who may I mention had the most screen time along with Tsubaki. Unfortunately enough, the few characters I did like a bit have very little screen time in this anime. Masaomi, Yusuke, and Subaru are very pure characters, but you can only see just how beautiful they are in the games. That's what I really don't like about this anime; I know that the characters have much more depth to them, and they're not shown adequately, if at all. Naturally, I wouldn't expect so much from an adaption, but this was below my hopes. Very sad. \\n\\n\r\nP R O S\\n\r\nWhile I ranted to what seemed like forever above, there are some qualities that might still interest you some more if you think you want to watch it. For one thing, the OP is very catchy - something to be expected from a reverse harem, might you be aware - and the ED is sung by all of the seiyuus voicing the Asahina brothers. The sound effects aren't horrible and the art isn't overly cringeworthy either, although it can be inconsistent. The part that made me watch this anime to the end was the fact that all of the characters aren't introduced in the beginning, and it takes a few episodes for all of them to make an appearance. I personally think that this is a good decision, or else I'd be overwhelmed with all of these faces and names to connect them to and it'd just make this anime messier. The most redeeming quality is the seiyuus themselves, as they're very fitting to each character. The English dub cast is great as well, and they hardly skip a beat with their choices. The only thing with the English dub that I would've changed is that J. Michael Tatum should voice Kaname instead of Masaomi (if you don't know, he voices Ootori Kyouya from Ouran and Sebastian Michaelis from Black Butler). If this anime is anything close to enjoyable, it's the fact that the whole thing seems like a joke, enough to get you to laugh at serious moments.\\n\\n\r\nC L O S U R E\\n\r\nIf you thought that this anime would make sense as you watch it, you're so, so wrong. This anime is the definition of \"wtf\" (my friend said this and there isn't a better word for it). There're so many moments that just made me deadpan and apathetic. If you want to busy yourself and kill time, this shallow anime might do you some service, if anything.\\n\\n\r\nStory: 1/10\\n\r\nArt: 6/10\\n\r\nSound: 7/10\\n\r\nCharacter: 3/10\\n\r\nEnjoyment: 4/10\\n\r\nOverall: 22/50 ~ 42% ~ 4/10",
            "date": "2016-06-09T14:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 220370,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5437669.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mythia-san",
                "username": "mythia-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=220370"
        },
        {
            "content": "Brother's Conflict, a blissful reverse-harem anime with many characters of different styles and personalities.\r\nFollowing with the story of a 16-year-old high school, Ema, living her whole life alone(well, she has a pet so not alone like totally alone), being that, her father is not always present because of work.\r\nAnd SUDDENLY, her dad marries an apparel maker, Asahina Miwa, who surprisingly has 13 kids and obviously it's all guys, because you all surely know where a reverse-harem genre is heading.\r\nHer life turned from OMG-I-need-to-take-care-of-myself-cuz-I'm-all-alone-and-lonely to a lifestyle where everybody worries about her( and no more spoilers from here). Well honestly, I loved the series, mainly becauseof the ikemen (hot guys), and of course, the voice actors, I'm a seiyuu addict so this anime is kind of heaven for me. Their voice is just....just... DAMN <3. And plus, they were the ones who sang the ending song! (14 to 1) I actually watched this series a couple of years ago, I guess when I was in 6th grade (13 yrs old) I just got into anime that time so I re watched it t remember the pleasure of cringe-worthy scenes and hearing my favorite seiyuus. I even memorized all their songs XD. As for the characters, each of them really has a unique personality, resulting to complicated and exciting situations so it's really worth watching (mostly for girls who're into romance). Each brother has that charm that makes you confused of who's really for her.\\n\\n\r\nThe only thing I kinda disliked in this series is Ema's character, no offense but her character is somewhat bland and boring. Making the brothers to act more dominant around her, but most of them are really caring though and I still love Ema <3 I can't blame the person who made her.\\n\\n\r\nShowing you a lot of twists and turns. Each brother with charming styles and personalities, with intense rivalries and conflicts, they share the same feeling towards Ema. Is it the love for a family or an affection of romance perhaps? How will this turn out?\\n\\n\\n\r\n If you're a typical shoujo anime lover where you love romantic and \"nosebleeding\" dramatic scenes, I highly recommend this anime.",
            "date": "2018-06-29T09:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 282528,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6698424.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mikangtrololol",
                "username": "Mikangtrololol"
            },
            "url": "https://myanimelist.net/reviews.php?id=282528"
        },
        {
            "content": "the anime is trash , why you ask because you will eventually get bored from anime and you will regret after watching it , so do not waste your time watching , i am not a hater of reverse anime ,i love ouran high schoool host club , but this anime has no enjoyment. the story revolves around a girl and his step 13 brothers and they live together so to make the show running for no reason they all fall in love with the girl and after 13 ep you still have no idea about what the hell is going on .and you haveno idea of whom she loves.",
            "date": "2016-09-09T10:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 228641,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5632504.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MIKASA_YEAGER",
                "username": "MIKASA_YEAGER"
            },
            "url": "https://myanimelist.net/reviews.php?id=228641"
        },
        {
            "content": "The name does not deceive you, there is certainly a conflict with brothers in this anime, too much so if you ask me. I'd honestly just like to ask why. If not for the spectacular artwork, which is virtually the only thing keeping me from rating this series a \"2\", this anime would be a complete flop. \r\nLet's just address for a moment, stay with me because it can get confusing— 13 new step brothers. If that weren't bizarre enough (not necessarily saying that bizarre is bad), they all miraculously fall in love with her? I have to believe that the screen writers for thisshow were absolutely drained of decent ideas. I have no qualms with originality, because this notion of suddenly getting 13 guys to fall in love with you within a few day time span, unless you're Kate Upton, is a new idea for me. Frankly, all girls should be taking notes from Ema Asahina, she's the key to a jackpot of hot guys fawning over you for doing absolutely nothing. \\n\\n\r\nThere's really nothing to say about the plot. There was zero complexity. If you happened to miss a few episodes, don't bother going back, just replace one of the brother's names with another, add a few instances of passive sexual harassment, and you essentially have every episode. \\n\\n\r\nI would discuss character, but it leaves a lot to be desired as well. Ema was basically a sex doll for the brother's frustration. Obviously not to that degree of severity, but she had absolutely NO input on anything. She sat by passively while her brother's pushed her around, literally, and force kisses or embraces on her. The only thing she could do was cry when her brother's relationship began to fall apart because they all started hating one another, as they blindly sought her affection. Gee, I guess having illicit relationships with your brothers wasn't such a good idea, surprise, surprise. \\n\\n\r\nI won't lie, the series was enjoyable, simply because the character attraction was high. Well-drawn males who play on their sexual appeal isn't a bad thing, but it wasn't enough to draw an eye from the blatant lack of character development. To sum it up, 13 guys, 1 girl, steamy interactions. \\n\\n\r\nWhen I phrase it like that, I'm almost tempted to re-watch it... So, knock yourself out.\\n\\n",
            "date": "2015-11-09T17:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 203075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4973500.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vassalord-",
                "username": "vassalord-"
            },
            "url": "https://myanimelist.net/reviews.php?id=203075"
        },
        {
            "content": "Let me state for the record that I am not a fan of incestuous themes in anything.  The only reason I kept watching once I realized what was going on is not because they were steps, but because the step sibling thing happened when all of the characters were 16/17 years of age or older except one and he didn't count.  \r\nAlright now that that's out the way...\r\nI'm a fan of reverse harems.  I enjoyed the brothers.  They're personalities were well developed except for maybe Iori's, who I forgot existed..  The brothers were charming, humorous, and bishie from #1-12 (likeI said borther 13 is a kid).  They ranged in ages, careers, but they eldest weren't that far from each other which allowed for clashes. \\n\\n\r\nThe female character known mostly as Chi was a ditz.  As well as the brothers were written she was not.  What little development they had, she had none.  I was hoping she'd get a slap, but it never happened.  I really couldn't tell why any of the brothers aside from the teens would fall her.  She had nothing to offer them. The most I could reason is that their mother was an absentee so having a female in the house just confused them completely.\\n\\n\r\nI would watch this for the brothers.  I truly enjoyed them and wouldn't mind seeing all them again as brothers minus the step-sister.",
            "date": "2013-09-19T23:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 113497,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1739023.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dragynfaerie",
                "username": "dragynfaerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=113497"
        },
        {
            "content": "Ok, for starters, how the HECK did one woman have all those boys and STILL come out looking that good? That's some load of baloney, there man. She doesn't even look that old?! I mean, there's fantasy, and then there's the world of Brother's Conflict.\r\nWhat the heck is this show even? It's a baffling series, indeed. Unlike many other similar shows where a lady is thrown into a dilemma of having a few males crushing on her, this chick has Thirteen - yes - thirteen males wanting a piece of action. No, I'm not kidding. Even the elementary school kid jokes about winning her heartwhen he's older. Oh, and they're all her step-brothers. \\n\\n\r\nWhat's even more baffling is the girl does absolutely nothing in the entire show to warrant this type of reaction in the men. She's cute, she's sweet, and that's about it. Oh, she does play zombie shooter games. I guess that gives her an edge. It must be enough for thirteen grown men to immediately have the hots for her. Either that, or they've never interacted with another woman besides their mother before.\\n\\n\r\nDespite this ridiculous concept, it's not totally unwatchable. Oh, sure, I was writhing in pain a few times at how awkward the whole situation was, but that's part of the fun. The premise of this show is just so far fetched, you can't help but be curious to see what goes down. Of course, a lot of it is predictable: chick is kind, encourages boy, boy gets surprised, then boy grabs and hugs her passionately. That about sums all the interactions up. \\n\\n\r\nFor the most part, it is the male characters that are the best part of the show (shocking right? I mean, it's not like this is a show based on a game where you have to fall in love with these guys or anything). Most of them are likable, except for that pop star kid. The heroine really needed to punch him in the face. Sadly, though, that doesn't happen, because ONCE AGAIN, the main heroine is a door mat. Yeah, surprise, surprise.  It's only after a guy makes a move on her for the fourth time - yes, fourth - that she suddenly shoves him away. \\n\\n\r\nI only wish more of these kinds of shows were like Ouran, where the girl actually has some chutzpah and stands up to the guys who are crushing on her when she thinks they're being idiots. This show really needed that, since the poor chick can't get a moment to breathe with all those dudes hitting on her. Will say, though, the squirrel was the best part of the show. Though with a talking squirrel, be forewarned that there's a whole other level of crazy that this show could offer - or its sequel. I'm not saying much, but let's just say that the squirrel might become a bigger character later on. Just think about that for a moment...\\n",
            "date": "2015-09-21T17:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 199173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4676368.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/cthulhuhuhu",
                "username": "cthulhuhuhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=199173"
        },
        {
            "content": "Here we have something that's becoming more regular; the reverse harem. \r\nWhich I'm definitely not mad about, the ladies need eye-candy just as much as the guys. \r\nBrothers Conflict doesn't have the best ratings or reviews, so I figured I'd see whats so bad about it.\r\nEma Hinata has her family extended.. by 13 step-brothers to be exact. Most of them all live together in a big complex, which she ends up moving into as well.\r\nWhy is there a talking squirrel? \r\nIt does feel a little strange. There's lots of guys so it's a bit overwhelming, but as you're introduced they all have their own personalitiesand looks. Plus they all seem really nice and have interesting careers which help give them more of a reason to be more prominent than just being love interests.\\n\\n\r\nEma, or Chi, is really sweet, gentle and innocent. You can tell she feels a little uncomfortable and likes shes imposing in their home, but they're very welcoming and look after her. \\n\r\nIt's enjoyable seeing them all become closer and learn about each other, though there's some indifferent feelings about it. I'm just really conflicted. \\n\r\nThe sweetness of them all as brothers, loving each other as a family. Ema is a lovely character who deserves to be happy and loved. Each of them as they confess could be perfect for her, it just gets hard there being so many, and the fact that they're all brothers so it results in differences between them makes it harder. \\n\\n\r\nIf you get uncomfortable with in-family relationships you definitely wont like this. \\n\r\nI really like Natsume as a partner for her, he feels more like a natural fit with their personalities and hobbies.\\n\\n\r\nOverall it's not terrible, it can feel a bit odd when it's expressed they're brother and sister while talking about how they love Ema, but really it's not a big deal. If you like reverse harem, sweet romance stuff and handsome guy characters with lots of different personalities among them, then you should enjoy watching this.",
            "date": "2016-12-23T04:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 236213,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=236213"
        },
        {
            "content": "to be completely honest, i have no idea how i survived 12 episodes of this.\r\nstory- 1/10.\r\nthe story. it's probably the most boring storyline i have ever come across in my life. every single episode, the same thing happens. one of the brothers confess, or realise, or try to seduce the main character. and it always ends with her proclaiming how she wishes only to be family with the thirteen brothers, who CLEARLY want to be more than that. absolutely pathethic, not to mention illogical, because some of the brothers are more than ten years older than her, and they are supposedly in love with her,AND they are siblings. it makes absolutely *perfect* sense.\\n\r\n-\\n\\n\r\nart-4/10\\n\\n\r\nnothing very special about it- it's plain, and i don't have any particular comments or complaints. the only reason why i'm failing it is because it's plain.\\n\r\n-\\n\\n\r\nsound-3/10\\n\\n\r\njust to get this out there, i barely paid any mind to the sounds (osts, voice actors) other than the opening and ending. (because i was too busy raging over how dumb the characters were.) just to comment, though, the opening sort of suits the anime, and i like the idea that the ending is sang by the brothers, although its mostly about how much they love their younger sister. which is pretty much what ruined its rating.\\n\r\n-\\n\\n\r\ncharacter- 2/10\\n\\n\r\nto be completely honest with you, i was 300% ready to give this a 1/10. but when i thought about it, i decided to give it a ttwo, mainly because the brothers, although plain stupid and have a horrible taste in girls, *are* good looking.\\n\\n\r\n[WARNING: I'm about to go on a rant about how terrible the characters are, feel free to skip to the conclusion~]\\n\\n\r\naside from that, the main character is a useless idiot. i.'ll be very open about this- i hate her. yes, i agree that she is pretty, but on what other basis do the brothers have to find a reason to 'fall in love with her'? the fact that she is their first sister? and, let me point this out- the oldest son, masaomi asahina, is 31 years old (yes, i checked the wikia) and is working as a doctor.\\n\\n\r\nand he is in love with a seventeen year-old girl who just graduated from high school. \\n\\n\r\nsee? where did THAT come from? shouldn't he be more interested in women his age? sure, some people have tastes in very young women and i DO know of some married couples in which the age gap is very wide, but it's not just this guy. the other twelve are all head-over-heels for her.\\n\\n\r\nto add to that, she is their sister.\\n\\n\r\ni mean, it would be fine if  JUST yusuke (the one who is the same age as the mc) or subaru (the college basketballer) were the ones fighting over her, BUT IT'S NOT JUST THEM. you have a lawyer, two voice actors, one perverted idol, one twelve year old child, one game developer and a couple more supposedly in love with her.\\n\\n\r\nnot to mention that all the main character does is blush.\\n\\n\r\nthroughout the anime, it seems as though she has these two permanent pink circles slapped onto her cheeks. and when some of the brothers attempt to do *funny* things with her, she shows no sign of resistance.\\n\\n\r\nshe doesn't give firm or proper answers to their confessions- what she mainly replies them with is \"i only wish to be family with you guys\" or something like that. \\n\\n\r\neven though it is more than clear that they want to be something more. \\n\\n\r\ni don't know if this is her way of stopping them, but whatever it is, it's not working. it's only getting them more fired up to win her over and all that crap. \\n\\n\r\nto conclude all this, the characters are dumb, and the anime would be nicer if they used their brains to think a bit more.\\n\r\n-\\n\\n\r\nenjoyment- 1/10\\n\\n\r\ni think that in my rant above, it is clear why i dislike the anime and did not enjoy it at all, so i doubt i need to elaborate. \\n\r\n-\\n\\n\r\noverall:\\n\\n\r\nadding all the elements together, i don't recommend this anime at all. i may sound like a BroCon hater, and maybe i am, but it's not really the brothers that i hate. it's more of the main character. i'm not fond of useless and sissy characters like ema, and she *really* got on my nerves throughout this series.\\n\\n\r\njust to point out though, out of all the reverse harems that i have watched (which is only, like, three, fyi) this is the one i would rank second. so if you like reverse harem, you might want to consider BroCon. \\n\\n\\n",
            "date": "2016-06-06T05:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 220107,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5449881.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/soorumi",
                "username": "soorumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=220107"
        },
        {
            "content": "This is my first time reviewing, so yeah.\r\nStory (2/10) :\r\nOh well. At first I expected this is just a simple reverse harem anime only. I never thought that she will be part of the Asahina Family. The plot is so simple (more like worse). There are no even character developments at all. It is just every episode, one of the brothers will show how they \"love\" their lovely imouto.\r\nArt (7/10) :\r\nThe art saved the story. Haha. It's nice but not too nice.\r\nSound (6/10) :\r\nI found the OP song kinda catchy but it's still not that good to make me not to skip the opening song.For the EP, it's not catchy but great job for making the brothers dance.\\n\\n\r\nCharacter (4/10) :\\n\\n\r\nFor the appearance, they quite did a good job. The brothers are attractive, the heroine is beautiful. But as for the attitude, uhm? Yes, they have diff. jobs, personalities but they didn't made a step forward in just being a brother of that heroine. And last, can't they just say the heroine's name?! Lol, they even made me search her name.\\n\\n\\n\r\nEnjoyment (5/10) :\\n\\n\r\nIt's bad but good. Good but bad. Since I am a female, I can't help myself to be attracted to the brothers. I really enjoy seeing them in the series! And there are some jokes and some cute moments between the brother and the heroine that I forgot how worst the plot is. /laughs/\\n\\n\\n\\n\r\nWe have different opinions, right? So this is my opinion :)\\n\\n",
            "date": "2015-04-17T10:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 185815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4564906.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/jikayoshi",
                "username": "jikayoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185815"
        },
        {
            "content": "I will try to keep this short and to the point despite having hated the show with all my heart.\r\nHonestly, keep away from this one. I'm not very familiar with reverse harems (much less 13-on-1 incest reverse harems like this one) but this might have put me off the genre for good. The otherwise mediocre art and sound are really the best thing the show has to offer. Story is practically nonexistent: a girl moves in with her brothers and suddenly all of them want to jump on her first chance they get....this show doesn't give a shit about even a halfway decent explanation. Thecharacters: God, do I hate the female lead. All she does is bleat 'but they're my brothers' and some 'so nice to be a family' crap, she is as passive as a plank of wood when her 'brothers' are flirting with her, and about half as emotional as one. The brothers are forgettable, only that conceited pop idol guy is even remotely interesting. Enjoyment? You've got to be kidding me.\\n\\n\r\nFootnote: Dat pet squirrel... I've had fantasies about wringing his neck. I hope there is a special place in anime hell for him and that youngest brother who's basically the male equivalent of a loli. Talking of fantasies, I've also fantasized about an ending for this show where the girl turns out to be a lesbian...but let that be.\\n\\n\r\nStill tl;dr? DON'T WATCH THIS.",
            "date": "2015-07-14T11:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 193381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4085447.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Greninja46",
                "username": "Greninja46"
            },
            "url": "https://myanimelist.net/reviews.php?id=193381"
        },
        {
            "content": "Story-1. The plot was both predictable and derivative/overused. It did not feel \"original.\" The more the story went on, the less interested I was. Very predictable ending. \r\nArt-7- basic. Nothing extraordinary but not \"bad\" either. I do appreciate how the viewer can easily distinguish the 13 brothers from each other. Usually anime boys all look the same in my opinion.\r\nSound-9 did well with conveying emotions of the characters. I was able to have this on while working and it did not require much undivided attention since I had headphones in. Audio/dialog is good.\r\n Character-3. The personalities of the brothers were diverse from each other. Themain character, (the girl) repeats herself throughout the entire series so this is why the ending is predictable. Her character is the typical sweet/caring/too nice, etc girl. Pretty ordinary. \\n\\n\r\nEnjoyment-3. Did not really enjoy the storyline.  It is possible to enjoy an anime even if it has an unfavorable outcome; however, in this case, I feel like it was a waste of time.\\n\\n\r\nOverall-3. Don't waste your time watching this. Do not recommend.",
            "date": "2016-08-30T12:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 227953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ncolumbia",
                "username": "ncolumbia"
            },
            "url": "https://myanimelist.net/reviews.php?id=227953"
        },
        {
            "content": "I cannot emphasize how disappointed I was in this anime adaptation of Brothers Conflict, especially since I was a big fan of the original light novel series and the otome game adaptation.\r\nFirst off, the art in the animation just looks really sloppy, especially when you put it side to side with the light novel art by Udajo (which is beautiful, by the way).\r\nObviously, 12 episodes is not enough to cover the stories surrounding all 13 stepbrothers (they can't even get one episode in per brother), so you get none of the backstory of each brother and why exactly they're drawn to the protagonist. In thatsense, I do recommend reading the light novels because they do follow a clear plotline with a clear conclusion, and like the title, there is ACTUAL CONFLICT among the brothers, both over their pasts and over their sister.\\n\r\nThe only positive thing I did like about this was the OP and ED songs. I particularly liked the ED, where all 13 brothers, plus a squirrel sing, but that's probably because I'm a huge fan of the seiyuu in Brothers Conflict.\\n\r\nOverall: If you're a fan of reverse harems, skip this anime, but PLEASE PLEASE give the light novel a shot!",
            "date": "2017-04-04T18:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 244627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ayumirose",
                "username": "ayumirose"
            },
            "url": "https://myanimelist.net/reviews.php?id=244627"
        },
        {
            "content": "well i don't know how to start with that\r\n...............................welp brother conflict have kind of  a weird and stupid story\r\n13 brother fell in love with they step sister\r\nand bla bla bla romance and stuff happen\r\ni really like this show\r\n1 because i love reverse harem anime\r\n2 - we barely find reverse harem anime\r\n3 - this is one of the best reverse harem anime made until now\r\n4- it have good romance scenes\r\n5- and focis on romance\r\n--story 7: 13 brother who love they sister\r\n.............whatever\r\n--art 4: the boys are so ugly\r\ni never seen an anime where a boy is uglyer than  his look in the game\r\nthe girl isbeautiful even if they need to work more on drawing her side profile\\n\\n\r\n--sound 1: one of the worst op and end song ever i just skiped them because they were so bad. they watsed money on making a bad song\\n\r\nthe singer voice is good but the song sucks\\n\r\nthe background music isn't that good to\\n\\n\r\n--characters 6: i can't tell you how stupid are the boys\\n\r\nand heroine act like an idiot\\n\r\ni can't even tell if she love them or no DX i mean something happen between her brother then boom in the next time it like nothing happen\\n\r\nthis girl just want to have  a familly ,she is so cold\\n\r\nthe 13 brothers are so ugly stupid ,and weird \\n\\n\r\n--enjoyment 10: i really enjoy watching this anime \\n\\n\r\n--overall 10: you should watch it\\n\r\nbut if you don't like brother sister relation ship anime then don't bother\\n\\n\\n\\n",
            "date": "2017-01-05T00:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 237472,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5683417.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 1,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Anime1Liker",
                "username": "Anime1Liker"
            },
            "url": "https://myanimelist.net/reviews.php?id=237472"
        },
        {
            "content": "~Story~ 5\r\nThe story is very simple, it is a reverse harem and so it speaks for itself. Girl lives with brothers, all the brothers want to have her (or at least most of them). The sad thing is that each episode basically jumps from brother to brother, the main character Ema doesn't form a strong bond with any of the brothers because of the continuous jumping. Yet most of the brothers all want a romantic relationship with her while they barely know anything about her as an individual. This anime is very mainstream and not a lot happens, it is all centered around the question,who gets the girl? The thing that bothers me is that each time you see one of the brothers on screen with Ema they either hug her or kiss her or in the very least touch her and after all that happened she just carries on with her day like nothing happened. Even though she consciously knows how all of them feel about her, she shrugs it off like it is an everyday thing. Although she says she only wants to be 'siblings' with her brothers she gradually allows any of the guys to kiss her. From the first episode she knows that they aren't really her siblings since her dad married their mother so technically none of them are related by blood only they are legally a family on paper. Even though she knows this she still continues to call them her 'siblings' which is disturbing since the fact that almost everyone of them want to have a romantic relationship with her.  \\n\r\n~Art~   7\\n\r\nthe animation is beautiful and fluent, the backgrounds are colorful and fits with what's going on around the characters and of course the originality of each character is beautifully displayed. Each one of the brothers are easy to recognize by either hair style/color and the color of their eyes. Although a downside to the artwork is that at points the emotions are not easily recognizable on the characters faces. \\n\r\n ~Sound~ 5\\n\r\nEntry song: Okay admittedly I found the first song to be very upbeat and semi exciting but, for me it wasn’t very catchy. Within moments of hearing it I easily forgot not only the lyrics but most of the beat, having only a few phrases and beats sticking to my memory. \\n\r\nEnding song: the ending song was more catchy and exciting then the intro, I found it easier to memorize, (mind you that could just be because of those dance moves XD) and I was more into memorizing it. \\n\r\nVoice acting: Because I watched the dubbed version and only parts of the subbed I can only speak for half of the voice acting. I thought that most of the actors were well suited to their respective anime characters and it fit well and made it easier for me to submerge myself in this anime. Although that being said one of the most voiced opinions on this is about Wataru and how his voice sounds so deep despite him being an adorable character and a toddler. Now may I just point out that Wataru is not in fact a toddler, he is ten years old in this first part. But I do agree that the voice actor who acts as him on both sides does not fit his character, which of course is unfortunate. \\n\r\n~Character~ 4\\n\r\nI have found that there is a major lack of character development, in all of the characters. Despite was is said about how there is no character development you will find that there actually is a small amount of development  and all of it is found with the brothers. \\n\r\nEma Hinata is the heroine in this anime who is shown to be polite, kind-hearted, and seems to get embarrassed very easily, especially when her brothers are involved. she also seems to be a good cook (not that that has anything to do with her personality). Masaomi, the eldest brother, has a more gentle personality, and seems to love his family a lot. Most of the time he is seen as the protector of the family but Wataru seems to be his  'favorite' brother. Ukyo, the second son, has a calm, reliable and diligent personality. Before Ema's entrance into the family, he was the \"mother\" of the house, responsible for cooking, doing laundry, ect. He eventually grew so use to doing these things, that it no longer bothered him that none of his brothers bothered to welcome him home at the end of the day, or thank him. While, he was also jealous that everyone was beginning to rely on Ema instead of him, he still appreciated her help, and was touched by her constant cheer and gratitude towards him. Kaname, the third son, although his profession is a Buddhist monk he does not act like one. He is seen as more of a playboy, although he is also seen as the most reliable of the brothers and is always there if any of them need him. Hikaru, the fourth son, is very cunning, being able to provoke reactions from his brothers with only a few simple questions. He has a very sly nature and is able to get what he wants through harmless manipulation. He also has something of a slight sadistic shade to him as well, seeing the conflict of his family as a game and keeping statistical track of each brothers chances, including his own. Still, in the end, he is a good person who cares about his family, albeit in an unorthodox manner. Tsubaki, the fifth son, he is usually playful and easygoing, but can be very pushy sometimes. He likes to tease his brothers and Ema. However, he also has a serious side as well, especially when it comes to work. He takes his job very seriously, and he always does the best he can. He’s also an otaku who loves anime, manga, and games. Azusa, the sixth son, he is caring, calm and is often found scolding his twin brother tsubaki, but will sacrifice everything for him. He is also shy when it comes to Ema.  Natsume, the seventh son, he is the youngest triplet. He has a blunt way of talking, but greatly encourages other people. He is very strict when it comes to problems and will willingly help to resolve it. He is rather calm and would protect his siblings. Louis, the eighth son, is mysterious man, always looking up at the clouds. He is a very calm and mellow, with a relaxed and slow-toned voice. He takes much joy in styling hair. It seems like he is sometimes not aware of his surroundings, being up in the clouds. Subaru, the ninth son, because of his stoic and upright personality, combined with the fact that he’s absolutely not interested in anything other than sports than basketball, Subaru doesn't have any experience with women. He is very shy around Ema and always stutters when he speaks to her. Iori, the tenth son, is known for having a prince-like behavior, as well as his calm and collected nature. He is very caring. But despite that prince-like personality of his, he can also be very scary, especially during winters. Iori is perceptive of the feelings of others, but he is also somewhat reclusive, being called anti-social by his brothers. Yuusuke, the eleventh son, Even though he behaves wildly, Yuusuke has a really strong sense of justice. He hates everything twisted, often getting into a fight with delinquents to defend what’s right. Fuuto, the twelfth son, behind his charming idol smile, Fuuto is actually a cheeky, sharp-tongued idol, and tends to have fights with his brother Yuusuke. Though he is an idol, he dreams of pursuing a career in acting. He will 'act' and put on performances by toying with people, though not necessarily always being sincere in what he says. He is a very confident often bordering on arrogant and determined individual. Once he sets a goal, he will do all that is within his power to achieve it.  He also has an almost unimaginably acute attention to detail, being able to single out Ema in a huge crowd, at night, during one of his live concerts only a few seconds after his performance begins. Of the brothers, Fuuto is the least restrained, doing whatever he wants without consideration for others. He is sneaky and sly, often finding ways to corner and seduce Ema. Wataru, the youngest son, is sweet and honest, but very spoiled. His sometimes spoiled behavior may be due to the over-protection of his older brothers, as seen that he is very playful. He has a confident personality. And last but not least, Juli. Juli, Ema's pet squirrel, He's a very loyal friend to Ema, and tries to protect her whenever he can. Juli can also be very hostile, as he is towards the Asahina brothers, hissing at them and calling them pack of wolves. Juli considers it his duty and mission in life to protect Ema at all costs, and he upholds this self-imposed task to the best of his ability.  He cares about Ema's happiness first and foremost, and will not forgive anyone who dares to make her sad. \\n\r\n~Enjoyment~ 7\\n\r\nEven though there were a few drawback in this anime, such as a few moments were things don’t align when they speak or even the characters lacking major develop. I found this anime to be entertaining and worth the watch. It was a good chuckle to be honest. It was also nice to see how much the guys wanted to change so they could be a better man for Ema. Although most of the time I was trying not to laugh at the guys confessions and how serious and dramatic they could be, mainly because the brothers don’t exactly have much of actual personal conversations with Ema but they say they love her. These dudes don’t even know her favorite color XD. \\n\r\n~Overall~ \\n\r\nI rate this to be a 6.2/10. Mainly for the laugh factor. I do recommend this to people, either for the love story that so confusing it's laughable, or even just the fact that it’s a reverse harem anime. Either way I recommend it for you cuties.",
            "date": "2016-12-28T02:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 236743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5932951.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Anna_Thorn",
                "username": "Anna_Thorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=236743"
        },
        {
            "content": "NOT SPOILER FREE and CURSING ISN'T PROHIBITED!\r\nWhat in the world…\r\n     So right now I’ll start with the notion that 8/13 of the boys fall in love with Ema, the main character of the series.\r\n     And what a freaking shitty character--\r\n     Like man, I don’t see anything special about this chick at all! She has no common sense, and doesn’t even think it possible her brothers would fall in love with her because they’re “family”. All she does is act like a doormat to the series, just letting stuff around her happen without doinganything to stop conflict or doing anything useful for that matter. She literally has no character and I feel like she gets fought over for no reason. And the trigger to being loved by the brothers--an adorable sweet smile or some lame stuff like that. That’s it! Apparently 8 hot guys can all fall in love with you because of your smile. And because she envies you because of your dreams and shit. Man, a hundred men would want me if I ever left my house and did that everyday. Anyways. The only thing interesting about her is that she likes to play Zombie Hazard video games. \\n\r\n     Anyway, as for the boys, they were what kept the “story” going. If they weren’t who they were I probably would’ve dropped the series after about 2-3 episodes. Here are my personal favorites:\\n\r\n     1.Yuusuke- he’s absolutely adorable and tsundere, and he liked Ema first (they’re in the same class). So back off everyone, Yuusuke was the original. One of his best moments: even though he doesn’t get good grades, he takes extra days in school so he can study to get ready for an exam to get into the same high school as Ema. Not much to love him for, but I have a soft spot for him. I liked what he did. Even though Ema doesn’t deserve it in the least. \\n\r\n     2. Louis- Usually I don’t like this character, but Louis is an exception. I like him a lot. He’s adopted, so maybe it’s that he’s just not as annoying as the other brothers can be. He doesn’t fall in love with Ema either, instead he partners up with her pet squirrel (did I mention the squirrel?) and they decide to protect her. Once again, the bitch deserves none of this protection, but still, I liked how he cared.\\n\r\n     3.Subaru-Subaru’s probably the most normal-looking one out of the brothers. And the reason I like him is simple: he’s the most honest and decent to Ema. Once he accidentally insults her, he will always apologize, more than once, which is something I’d probably do. He asks her consent on things, and though she doesn’t give much of an answer, he still hugs her and appreciates her all the same. Once again: BITCH DESERVES NOTHING. But Subaru was nice. (Plus he was voiced by Daisuke Ono *fangirl scream*.)\\n\\n\r\n     So in completion of my character analysis: only about 3-4 characters really stood out to me, and that’s not really good, considering there are about 15 characters that are focused on throughout the show. I absolutely DESPISED the main character, and I’m honestly holding back all my hate for her so I can diminish all this hatred in my black soul. And don’t even get me started on the squirrel. \\n\\n\r\n     As for a plot analysis, I can’t really do that since there wasn’t really a plot at all. It just follows Ema's life with her new brothers, and it gets really boring at times. Except when Fuuto tries to seduce her and when Tsubaki and Natsume kiss her (I actually sorta liked Natsume but I didn’t pair him with Ema) and Azusa constantly expresses his love for her and Juli the Squirrel protects her; those parts were annoying. Whenever I saw my favorite characters, tho, I was entertained. I’m admitting it. I was entertained. \\n\r\n     Animation: It was very pretty, I liked the style. But all the distinguishing features were all over the place, I mean they were nice, but the hairstyles and clothes and eyes just stuck out and I’d get headaches. Especially Fuuto’s mouth. For some reason it’s always like :3 even when nothing’s happening. And everyone’s helplessly handsome. THAT’S NOT REAL LIFE, MY FRIENDS!!! \\n\r\n     The soundtrack: there was a piece during the show’s dramatic times with a piano that I liked and always recognized. It was subtle, but nice. The opening “BELOVEDxSURVIVAL” was pretty catchy and I kept singing it after each episode although I had no idea what was being said. But it wasn’t outstanding. And the ending “14 to 1” was cute and odd but fun to watch, with all the boys singing a song about their sister. Although I don’t believed Ema deserves to have a song dedicated to her, at least it was a mediocre song. I don’t really think they’ll be going on my personal favorite playlist anytime soon.  \\n\\n\r\nOVERALL ANALYSIS:\\n\r\nCharacters: 4/10 rating \\n\r\nPlot: 4.5/10\\n\r\nAnimation: 7/10\\n\r\nSoundtrack: 6.5/10\\n\r\nTOTAL ANIME RATING: 5.5/10\\n\r\nRECOMMENDATION SCALE: 1.5/5\\n\\n\r\nFor now, everyone, Momentai!",
            "date": "2014-06-23T08:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 148197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863977.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/notactive2000000",
                "username": "notactive2000000"
            },
            "url": "https://myanimelist.net/reviews.php?id=148197"
        },
        {
            "content": "This is one of my first reviews so bare with me for this one;\r\nI started this anime because my friend suggested it to me, I had never watched a anime she had suggested to me - and, I thought 'fine, I'll give it a try then, it can't be that bad'. Well, it wasn't.. But, it certainly did have it's flaws. \r\nStory: The story had a good idea, putting a girl into a house with a bunch of guys - It would be sure to have some interesting turn outs. It had guys falling for her, which added suspense in finding out who she wouldchoose in the end.. but, it annoyed me to see her as the guys 'play toy', I guess you could say. She never fought back, she thought of them as siblings, but she always stood there dazed like a zombie. And, the ending.. The ending was horrible. I hate cliffhangers, honestly - I'm a person who likes to know what happened at the end.. especially if it's a harem.\\n\\n\r\nArt: The art wasn't that bad, it had very clear images and had details. All the characters had unique features, so you could tell them apart easily. I do wish the twins would've looked a bit more alike, but that's okay.\\n\\n\r\nSound: The theme song was okay, but there really was no memorable music in the actual show itself. The ending was easily forgettable as well.\\n\\n\r\nCharacter: Where do I begin.. No character development, whatsoever. Chii is the same as she was when the show began. We didn't see her grow, at all. Most of the guys are the same as well, except for maybe one or two.\\n\\n\r\nEnjoyment: I enjoyed the show, as it was a light anime and a nice change from the usual horror/psychological anime I watch. Therefor, I'm giving it a 7/10.",
            "date": "2013-09-23T12:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 113937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2051981.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SnowxFlower",
                "username": "SnowxFlower"
            },
            "url": "https://myanimelist.net/reviews.php?id=113937"
        },
        {
            "content": "Ok, to those who reviewed this anime to be quite bad, I understand its your opinion. but i'm reviewing this anime on the reason it was made: for the shoujo romance. also i'm not just reviewing the anime, i'm reviewing the whole story; in the anime & novel. just saying in case somebody reads it and is like 'but that shouldn't be a valid reason cuz its not in the anime (yet)'\r\nStory: I mainly gave this a 7 because of the end (i'll get to that later).the plot is pretty straightforward; girl moves in with her new step-brothers and starts have a reverse harem. itspretty predictable. the only 2 parts of the story I think I should mention is Juli's character and the end. ok, I did NOT expect Juli the squirrel to have this kinda human form (in her dreams) and actually have a crush on Ema. I kind of think that they should've done more with that, and then it might've been a better and more interesting anime. ok the 2nd part is THE END!!! btw MAJOR SPOILERS AHEAD! SPOILERS NOT IN THE ANIME!!! ITS WHO ENDS UP WITH EMA!! SKIP IF DONT WANT SPOILERS! \\n\r\nwell then. I was actually quite surprised when I found out ema ended up with masaomi (I think that's his name). I found this out when I finished the anime and hadn't started reading the novel. this was a nice decision. I reckon they did an ok good on the whole reverse harem thing. and they had a nice content of romance.\\n\\n\r\nArt: quite modern, I liked it but not as much as some. at least its not like Horizon in the Middle of Nowhere which had great art but riduclously large hair-dos. its an 8\\n\\n\r\nSound: the ending is exactly the type I like: the main characters all singing. like UtaPri or even Love Live/K-on. Maybe twgok (I cant remember if they did that). rating it 9\\n\\n\r\nCharacter: ok, they did a horrible job on this. I understand that it'll be pretty hard to think up on like 15 characters with different personalities, but seriously? there's an idol, 2 twin voice actors, a doctor, something to do with games (natsume), I mean seriously? I understand they're rich and obviously well educated but how could this family get more overwhelming?? for all you know, their mother could be a queen!!! im surprised there isn't paparazzi trying to sneak into their house every day.\\n\\n\r\nthe 2 characters who were interesting yet not a fabulous as their famous siblings, was kaname and iori (I have such good memory of their names :D) who are a monk and... idk something to do with flowers? nice and simple and not too mainstream or predictable.\\n\r\nok I admit ema was dull as. when I watched those brothers saying all those things to her, I was surprised like 1000 times that she didn't respond that strongly or even had any reaction. is she partly deaf??? but I still like her cuz she has juli :3 cuteee\\n\r\n4 for the rating\\n\\n\r\nEnjoyment: meh I reckon 4-5 but I'm feeling good so i'll be nice to the anime and say 6\\n\\n\r\nOverall: 7",
            "date": "2015-02-10T04:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 180076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4462635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NanakoYata",
                "username": "NanakoYata"
            },
            "url": "https://myanimelist.net/reviews.php?id=180076"
        },
        {
            "content": "I have to be honest, when I first watched this anime through I was going through a phase of loving reverse harem animes where the main lead girl was surrounded by hot, attractive guys.... and this anime was just that. \r\nI liked it, but when I looked back at what I had watched I realized it had quite a lot of flaws. I don't like writing super long reviews, so I'll talk about one thing.\r\nThe main lead is a cute girl, and luckily enough she ends up having all these attractive step brothers. They all want a taste of her... and no matter how muchthey annoy/or sexually harass her... she does frickin nothing?? she is the most emotionless lead character in an anime I've ever watched in my life. she'll blush and just stare into the face of the boy, saying nothing because she's either too \"shocked\" or \"surprised\" at the current events going on. It just bothers me that she had no personality, because the premise of this show wasn't too bad. I was left feeling disappointed by the end but I don't know what else I was expecting.",
            "date": "2014-12-31T13:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 175449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4355333.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/carnelia",
                "username": "carnelia"
            },
            "url": "https://myanimelist.net/reviews.php?id=175449"
        }
    ],
    [
        {
            "content": "Story and Character:\r\nTypical. Low quality. Worthless. PATHETIC.\r\nIt is just the common reverse harem you'd encounter everytime you see one, the only difference is this is a lot lesser production--one that should not have been available to watch.\r\nThis would have been better off as hentai than as regular anime. There is really no demeaning anything about this and I feel so unlucky to have crossed path with this anime. I cannot connect to the characters even a bit. The only thing they seem to sell to the audience is their pretty drawn face...and nothing else. Story is so messed-up and the characters are all so poorlymade. The romance is all over the place like a swamp of flies you would not want to even share the same air with.\\n\\n",
            "date": "2016-02-21T03:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 211362,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5195913.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Amiabooklover",
                "username": "Amiabooklover"
            },
            "url": "https://myanimelist.net/reviews.php?id=211362"
        },
        {
            "content": "this anime was different from all the other anime I've watched but i was still good. but they only thing i strongly disliked about it was the fact the fact it was only 12 episodes long if it was longer and it had a little better story line i would enjoy it much more. so i hope that they come out with a new season or something related to brothers conflict.",
            "date": "2015-08-02T19:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 195022,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4784978.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TruthOrLie",
                "username": "TruthOrLie"
            },
            "url": "https://myanimelist.net/reviews.php?id=195022"
        },
        {
            "content": "Ok...So I thought I'd try out this reverse harem.  It is cliche in every sense of the word.  The situation, the characters, the reactions, etc.\r\nThe story is a clueless girl moves into a house full of brothers.  Each brother is different of course having their own \"personality\".  And then, you have this ridiculous little chipmunk/squirrel thing that follows her and \"protects\" her from sex hungry men....Yeah I said it... Anyways so she thinks she's finally found her place of belonging with a family but her clueless ways don't help her when every brother starts confessing to her.  This is prettymuch the story.  A clueless girl with every single brother falling for her.  Every situation nearly irritated me to the point of punching my own screen. \\n\\n\r\nArt. The art wasn't bad, but it wasn't amazing either.  It was your typical style with no real pop to it.  Each character had their own little artistic style however. I guess that wasn't bad and gave the anime a little boost.\\n\\n\r\nThe characters.  The girl bothered me. No matter what I did she just really got on my nerves.  She was clueless and created more problems.  The other characters, being her brothers, were each cliche in their own way.  The pop star, that all the girls swooned over yet loved his little sister, the basketball player in which had a bad attitude and quickly let his feelings overcome logic, the little younger brother that played games, and the older brother that created and managed games that was more mature, the one that belonged to a temple/or was in training, and the list goes on.  You think of a character that another anime has done, they were sure to add it into this anime as a character that was after their sister.  The characters all played some ridiculous role in created stupid unnecessary drama that could be easily resolved but dragged on. \\n\\n\r\nMy enjoyment of this anime was not much.  That little squirrel irritated me and so did the main character (the sister).  I attempted to go into this with an open mind, but it failed miserably in my eyes.  \\n\\n\r\nI gave this anime a 5 because it wasn't the worst, but it certainly wasn't up to par.  They could have had a few less brothers and it would have probably made the anime a little better as you could have probably had time to get to know them a little better.  Instead of ten brother's in each eps. trying to win her over.  So overall I think this anime needs some work. If you go into it knowing that it's going to have a lot of really stupid moments; and don't get your hopes too high that some magical moment will happen that will just make this anime, than you might be able to finish it like I did.",
            "date": "2013-09-18T10:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 113315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1199201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lovelydeath",
                "username": "lovelydeath"
            },
            "url": "https://myanimelist.net/reviews.php?id=113315"
        },
        {
            "content": "This anime is ridiculous.\r\nI LOVE IT!\r\nLet me explain:  The plot of this story is ridiculous.  This chicks dad gets re-married to a woman who has 13 sons, and because of work the parents live in a house god only knows where so the dad sends the girl to live with 12 of her 13 new step brothers and of course they all like her.\r\nShe has a talking pet squirrel that only she and one of the brothers can understand (because this makes total sense right?  In a world that is otherwise not magical) that tries to protect her from all the \"malesin heat\" in the house.  The squirrel is one of my favorite parts.\\n\\n\r\nOne of the brothers is in her high school class and did in fact like her before they became step brothers.\\n\\n\r\nWhat is hilarious is this girl is stupid.  These dudes kiss her, declare her love, and she is like, in major denial the whole time \"We're siblings\".  I think the poor girl just wants a damn family because her dad appears to have been gone most of her childhood (WHO RAISED HER?)\\n\\n\r\nAnyway, yes, this anime, the story, is not very good, but I love watching absolute ridiculous shows like this.  It's comical how horrible it is and I laughed, screamed out loud, and had a great time watching it.  I mean, it IS a reverse harem after all, it's not going to be anime of the year.",
            "date": "2016-11-12T06:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 233629,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5780700.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/simply_sahri",
                "username": "simply_sahri"
            },
            "url": "https://myanimelist.net/reviews.php?id=233629"
        },
        {
            "content": "How to say it, I found this anime very enjoyable, despite a 2, or better 1 humongous problem.\r\nFirst things first, I'm an harem lover, then my opinion can be a little spoiled ^^;;;\r\nStory (mark 6): it  isn't something new, I see a very large ammount of anime with the same story, a girl (or a guy) found that her father is remarried and she got new non blood related brothers, and for a reason or another they all (or almost all) fall in love with her\r\nArt (mark 8): I really liked the character design of this anime, I don't remember if it has verygood animation (i think not), but the drawings are very cool\\n\\n\r\nSound (mark9): I loved the musics, specially the Opening\\n\\n\r\nCharacters (mark 6): I loved every character of the series, they have very good personalities, ok they don't grow on the story goes on, but even becouse they don't get much screen time, but I got a liking to all...\\n\r\nAnd then \"why only a mark of 6?\"\\n\r\nThe answer is simple \"Because there is a very BIG flaw that affect the whole story\"...\\n\r\nWhat's this flaw? The main character... Ema have the same personality of an ornament, she is more or less cute (not a very beautifull), she is watching what happening, but she doesn't take much action... she is useless and having a pool of character whose personality have a mark of 8... we have a main character wit a personality of 1 (or 0 if possible) who lowers the mark to everyone... and made doubt the audience \"why everyone fall in love with her?\" She took all the anime down...\\n\\n\r\nEnjoyment (mark 8): Like I already said, I loved this anime despite the heroine, I found all the atmosphere and situations very enjoyable\\n\\n\\n\\n\\n\\n\r\nI think that my overall mark may lack the big problem of this series, but, in my opinion, the good parts of it menage to make amends.\\n\\n\\n\\n\\n\\n\r\n(I'm sorry for my bad english, but it isn't my main language ^^;;; )",
            "date": "2018-01-16T19:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 268781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257395.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mervis",
                "username": "Mervis"
            },
            "url": "https://myanimelist.net/reviews.php?id=268781"
        },
        {
            "content": "I couldn't believe i made it up until the end. I couldn't completely say that it bores me, but the thing is, i kept thinking how the story will end but im disappointed because the ending was not clear. I dunno if there will be a second season for this anime but it really pisses me off that it was left at that kind of ending. I mean, this is super reversed harem (11 guys all have fallen inlove with one girl) but at least they could have an ending like she made it clear to all the guys that she will not be inany relationship in any of them, however, it turns out that they refused to believe-- they remain persistent. And left at the last moment where in the heroine kept hoping that she will be a real siblings to them. And she havent talked to all of them at all!",
            "date": "2013-10-15T11:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 116947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91674.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/red_888",
                "username": "red_888"
            },
            "url": "https://myanimelist.net/reviews.php?id=116947"
        },
        {
            "content": "I haven't watched any shoujo/ reverse harem anime for quite a while, so perhaps that has something to do with why Brothers Conflict (BC) feels so fresh and exciting, but I really believe that even if I hadn't had a break from the genre, I would still have held the same opinions as I did now and found it truly enjoyable.\r\nStory: 7/10\r\nGiven that there are 13 \"potential\" male characters in this anime, I presumed that it was based on an otome game, which indeed it was. Bearing this in mind, I think that, although there wasn't so much of an exciting plot in terms ofanything outside of Ema's relationship with each brother and the various conflicts that arose, the anime was actually well woven together in a coherent way. I've read that other people find the lack of depth due to the jumping between brothers a little disappointing, which I can agree with.  However, the last episode gave what appeared to be strong hints at another season, so I'm hoping that in that case, the obvious lack of focus on certain characters will be remedied and give a more well-rounded and complete feeling to the series. As far as otome-to-anime adaptions go, this is one of the better ones that I've seen.\\n\\n\r\nArt : 9/10\\n\\n\r\nArt style preferences are subjective, however I for one absolutely adored the art in BC. The apartment is an example of how beautiful not only the characters are, but the level of attention to detail that went into every other aspect as far as I could see. Colourful but not obnoxiously so; a complete pleasure to my eyes. I may even go as far to say that even if the anime itself had bored me, I may have persevered simply for the gorgeous art.\\n\\n\r\nSound: 7/10\\n\\n\r\nThe first time I heard the OP I wasn't too fond of it; it seems jarring and just not that enjoyable. However, as the series progressed and as I heard it again and again, it started to grow on me. By the time I'd reached episode 6 or 7, I loved it. I think that it suits the anime perfectly; happy, charged, carefree and it never failed to get me genuinely excited for the episode to begin. I'm never normally one who pays much attention to the background music in animes, however for once there were a few pieces that I actively appreciated at the time, fitting the scene and enhancing the mood. The soundtrack isn't one of the greatest in the world, but it is good.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nAs mentioned before, there is a lack of depth of development with a lot of characters, and any development that does happen occurs quite quickly given  the 12-episode run. However I've given BC an 8/10 on this simply for the sheer volume of characters that they included, and the diversity within them. As an otome game, it makes sense to create as many character types to appeal to as wide of an audience as possible, but this can sometimes be lost in the transition to an anime, where some characters get thrown under the bus, so to speak. In this case, however, each brother was distinct and seperate in both appearance and personality, and within a few episodes, the names of the vast majority had stuck and by the end I genuinely cared about each and every one, even the ones that we had only gotten a brief flavour of. Yes, some of the standard shoujo tropes are thrown in, but in refreshing combinations so they don't just feel like 13 cookie-cuttered replicas of every other male love interest in history.\\n\\n\r\nThe main character herself was quite passive until the very end (necessary to facilitate what I assume are multiple CG references from the game from multiple men), but wasn't a pushover or a crybaby - something which seems to plague the genre. Initially she cannot tell when she is being teased, but over time she ADAPTS and fits in with the dynamic of the other characters. Had she had a bit more... je ne sais quoi, she could have been better, but as far as otome protagonists go, at least she has a name, eyes and somewhat of a personality!\\n\\n\r\nI stayed up until 5am to finish marathoning this.  I had only intended to find a new anime, watch a couple of episodes to get a feel of it and then go to bed. But I ended up being too enthralled to stop and I'm now full of regret for staying up so late, but not for spending that time watching this anime. \\n\\n\r\nIf you enjoy reverse harems and don't mind a primarily character-focused story rather than an over-arching plot about mystery or magic or demons or anything, then I cannot recommend this enough.",
            "date": "2014-07-01T04:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 149763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/412657.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KiwiChan_x",
                "username": "KiwiChan_x"
            },
            "url": "https://myanimelist.net/reviews.php?id=149763"
        },
        {
            "content": "So I just finished watching Brothers Conflict, I know many people really didn't enjoy the anime but I thoroughly enjoyed it. Often anime adaptions of otome games are regarded as poor and never really leave you feeling fully satisfied, Brothers Conflict can be argued to be the same, however it is definitely one of the better anime adaptions out there.\r\nThe story line was pretty standard, a young girl entering a house of brothers, soon to be chased by the majority of them. It may seem wrong in many peoples eyes but it doesn't mean it's not enjoyable. I liked how it wasn't just purely \"romance\"and managed to throw in some humor here and there. I haven't played the game so I can't compare on whether it was truthful to the game but I can still say that it was pretty good.\\n\\n\r\nAs for the characters I think it's up to your personal taste on whether you like them or not. Everyone has their preferences and with plenty of characters to choose from in BroCon you can't exactly say you didn't like at least one of them. The protagonist was slightly dull in some areas but when you have so many guys who are supposed to be your brothers chasing after you, I'd say she has every right to be like that from time to time.\\n\\n\r\nI think the art in Brothers Conflict was something you can't shake your fist at. Although I can't say it was 100% perfect I can say that it was done very well. The colour's were vibrant and the characters were all unique in there own way. It was nice to look at and I'm sad that I'm not going to be able to get my weekly dose of it anymore.\\n\\n\r\nOverall I gave Brothers Conflict an 8. It was light-hearted, humorous and quite cute. If you enjoy anime with this sort of genre and can get over the fact all the guys are meant to be her brothers (some people really do disagree with this, but I think it's something you have to get over-it's not like they are blood related), I'd definitely recommend watching the anime. If you are really unsure on whether you enjoy this sort of anime, don't watch it, it may put you off watching other anime's that are similar.\\n",
            "date": "2013-09-18T02:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 113279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2634255.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BethD",
                "username": "BethD"
            },
            "url": "https://myanimelist.net/reviews.php?id=113279"
        },
        {
            "content": "Ema had gained 13 brothers after the marriage of Ema father and The Asahina mother. Each character have their unique characteristic. Well as usual i have a few complained about the MC. As much as i love the progress for every episode i cant take it when the MC became a total slut. The MC is a gamer so that differ from others Reverse Harem anime. Since most Reverse Harem MC is usually lady like naive and ended up as like a slut. Ema however after many advances from her \"Brothers\" accept it and did not even struggle to move. Even after telling all her\"brothers\" that she just wants to be family she got affected by every move they made on her. Enjoying the pleasure given. Like looking at a plate full of delicacy. \\n\\n\r\nYes i had given this anime an overall 10 as i ignore the MC and frantically fan girl at the brother.",
            "date": "2015-11-29T06:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 204433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3421487.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/glenn27",
                "username": "glenn27"
            },
            "url": "https://myanimelist.net/reviews.php?id=204433"
        },
        {
            "content": "TL;dr: Another anime based off an otome that doesn't work. Characters are already in love and you never get much backstory of either side.\r\n---------------\r\nStory: The main girl moves into her new home and meets her new family. They are all her brothers and they just love her immediately, all trying to get her to get with them and competing with each other to get her =.= so each episode is just them fighting over her and kissing her. It's just like why? They act as if this is the only female they've ever interacted with...\r\nArt: The art style to me was okay. Nothing super alluringto me. Their faces kinda weirded me out actually...\\n\\n\r\nSound: Wasn't that fond of the opening or ending. The ending has the characters from the show singing and well they aren't good >m",
            "date": "2015-12-10T21:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 205223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288882.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/UltySo",
                "username": "UltySo"
            },
            "url": "https://myanimelist.net/reviews.php?id=205223"
        },
        {
            "content": "The idea that all 13 boys have fallen for one submissive girl is not ideal; however, I think it brings much need humor to the show. At first it is hard to grasp who is who for there are 13 of them and they are introduced so fast. Watching the show through separates the brothers because they all have very different personalities. \r\nEach episodes builds upon the last by allowing one brothers feeling to be continued while another is starching to form. The anticipation on which boy will go farther than the other to win her affection is great. In fact it is so greatthat one brother charts the progress. \\n\\n\r\nWith her there, the brothers' interest have begun to broaden. She bring out the best for the family in the boy wanting to strive to be perfect for her. However, she also brings out rivalries as well. The anime is worth watching to see how they progress to obtain her love. \\n\\n\r\nThe is one issue and that may just be me, but I did not know her real name. I do not think the brother used it and Julie, along with Louis, always used the nickname, Chi. I know it now, but I'm not sure it is specified in the anime.",
            "date": "2016-04-25T22:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 217191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Desi_Barton",
                "username": "Desi_Barton"
            },
            "url": "https://myanimelist.net/reviews.php?id=217191"
        },
        {
            "content": "Hi there \r\nOverall brothers conflict is a great anime in my opinion. It is about Ema ( the main charater )\r\nThat was an only child that gets \" dragged \" in to a family with her new 13 brothers. I liked the anime because the story line kept on going and has graeat quality. \r\n The only problem was that she is a little to sensitive for me and doesn't really get that involved with her step-brothers \r\nIf you like reverse Harlem you will like this anime and the art of it\r\nBy your fellow anime lover",
            "date": "2013-11-27T16:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 121615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3308963.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Briga21",
                "username": "Briga21"
            },
            "url": "https://myanimelist.net/reviews.php?id=121615"
        },
        {
            "content": "I had a lot of fun watching this anime. It's totally unrealistic of all 13 brothers falling in love with the same women especially considering she is their new step sister but none the less I found it to be enjoyable.\r\n I loved the opening and ending themes as well as the variety of brothers. Their are so many of them but I felt that any guy or girl could love at least one of them XD However, the large cast of characters meant it became quite difficult to delve deep into all of them but all of them at some point shared amoment between the protagonist which was sweet. \\n\\n\r\nFor me I felt weird that all these brothers somehow loved her in a romantic way so soon, it felt unrealistic but it was interesting to see the varies situations the boys would put her through and their really were some beautiful moments between the characters.\\n\\n\r\nThe third youngest of the bunch actually had genuine feelings for the protagonist before she became his sister which I felt made much more sense.\\n\\n\r\nWhat surprised me the most about this anime was that their was actual plot in this series, mainly concerning around the triplets who I just adore. Their were some series moments in this show as well. Which were extremely heartfelt and OMG that squirrel too cute ♥\\n\\n\r\nIt's a nice little reverse harem that is filled with in my opinion pure enjoyment. The boys are beautiful and are great for any fangirl needing something to brighten up her day.\\n\\n\r\nI give props to this series for after 12 episodes, not putting her in a relationship. It felt right but that doesn't mean the boys wont's stop loving her :)",
            "date": "2016-05-01T18:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 217657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3164339.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/I_Love_Pikachu",
                "username": "I_Love_Pikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=217657"
        },
        {
            "content": "Brothers Conflict is a difficult anime to review, as though it is by no means critically astounding, with a mediocre set of characters and faulty story-line, it is the perfect guilty pleasure for those seeking the ultimate reverse harem anime. Though the protagonist is overly-obliging and personality-less, this can be overlooked by the fact there are swarms of hot new 'brothers' about infatuated by her. The art and sound are also well done, as may be expected for such a recent anime. \r\nIf you are looking for a deep anime with meaning thet will imprint your heart, here is not the place. But if youenjoy drama and romance with lots of enjoyment factor you may well find it!",
            "date": "2014-03-12T09:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 135507,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623933.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rayandjim",
                "username": "rayandjim"
            },
            "url": "https://myanimelist.net/reviews.php?id=135507"
        },
        {
            "content": "This is definitely a fluffy guilty pleasure kind of anime. The animation is lovely, the voices are nice, the characters are all pretty adorable, and the plot is low-maintenance.\r\nThe main character is pretty standard for shoujo--sweet and cute, shy and a little naive--she's an independent teen who deals with her loneliness by honing her homemaker skills. All she really wants is to feel like part of a family, so when all her new step-brothers decide they want to be her boyfriend, she initially has no idea how to cope. Most of the plot is mini-arcs about each boy as she gets to know and lovethem, even if it's not the same way as they love her. \\n\\n\r\nIf you want something simple with pretty boys and a surprisingly charming lead, watch this. \\n\\n\r\nIf you're looking for genre subversion, groundbreaking stories, or a leading lady who wears her inner strength like armor, look elsewhere.",
            "date": "2017-07-13T08:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 252727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6397541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nekonekonekochat",
                "username": "nekonekonekochat"
            },
            "url": "https://myanimelist.net/reviews.php?id=252727"
        },
        {
            "content": "13  Boys. 1 Girl. \r\nWhen I first saw this anime, I wondered to myself, \"Is this going to be a good idea?\"\r\nStory 3/10\r\nThe story is as bare-bones as you can get. Ema, the main protagonist, moves into  her new mother's house before the wedding between the new mother and her father.In the house, she meets her 13 step brothers and each one develops a crush on her throughout the series. \r\nWhile the plot can be explained in a matter of sentences, this anime focused more on the development of each brother and how they develop feelings for Ema. I really enjoyed this \"slice-of-life\"harem aspect to the anime even if there wasn't an overall narrative. \\n\\n\r\nSound 8/10 \\n\r\nThe sound of brothers conflict is amazing! The opening theme is incredibly catchy and I love how every brother has a different colored flower. The ending theme now one of my favorite endings in anime history because it is catchy, cute, and I always love to sing along with it. The dance the brothers do is awesome as well. \\n\\n\r\nCharacter 8/10 \\n\r\nThe show focuses heavily on developing the brothers, which I felt this show did incredibly well. There's a different brother for every type of girl: Subaru, the sporty brother; Fuuto, the stubborn pop idol; The triplets, two of which are identical twins and voice actors and Natsume the game developer; Louis, the hairstylist who can understand animals; Kaname, the perverted monk; and so on. \\n\r\nThere's also a little squirrel named Juli who acts as Ema's guardian. I liked his character and loved how he always hissed and clawed the brothers. \\n\r\nEma herself is a very kindhearted girl who just wants to be part of the family. She's never had brothers before, and she enjoys learning about them and getting to know them. She is always nice and sweet, and the only part I don't like about her is she never makes mistakes. As a character, she is consistent, but we never see grow or change. This is perhaps most likely due to the fact she is supposed to be a kind of avatar for girls to picture themself as and live in the fantasy of having 13 brothers. \\n\\n\r\nEnjoyment 8/10 \\n\r\nI really enjoyed this anime. Every episode I was excited to see which brother we would get to learn more about and where Ema's life would lead. The only thing that's weird is that they are supposed to be her brothers and they like her....but I guess that's part of the fantasy. After all, with games like Fire Emblem Fates, Japan seems to have developed some kind of attachment to forbidden romance.\\n\\n\r\nOverall 7/10 \\n\r\nThis was pretty good for a reverse harem. If you enjoyed this anime, I would recommend Kagami no Asobi, a show that features 1 girl surrounded by 6 gods. It is more plot oriented than Brothers Conflict, but it is good for someone thirsting for more. \\n\\n\r\nThank you for reading!",
            "date": "2017-05-11T18:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 247484,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881860.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HanbeiCat",
                "username": "HanbeiCat"
            },
            "url": "https://myanimelist.net/reviews.php?id=247484"
        },
        {
            "content": "Kiss, kiss, kiss, I need your love!! \r\nThis anime was super fun to watch! I especially enjoyed the music for the opening and ending themes, they always made me so happy! \r\nThe originality in all the characters amazed me. The fact that each brother was completely different from the next was amazing. I had no problems learning all their names and being able to tell who was who when a name was mentioned. \r\nWhat really made this show enjoyable was how Ema wasn't jumping all over the boys like female leads have done in the past. I love how she was a \"go with the flow\" kind ofcharacter. She didn't exactly accept the love from her step brothers, but she also didn't flat out reject them either. Her calm manner when handling her brothers was what won me over.  \\n",
            "date": "2017-02-15T19:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 240662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240662"
        },
        {
            "content": "\"Blood is not important, it's the heart that connects\" -Louis\r\nThis anime i believe, aired off in 2013 and has a special plus 2 Ovas to be released on Christmas 2014 and on Valentines day 2015. \r\nThe story starts with a beautiful lady named Ema setting to live with 13 step-brothers who has different contrasting personalities. This is a Harem, so i don't need to explain the romance elements as they were well thought out. Days go by and the charas get close and things get heated. \r\nStory: It was interesting from the start, there were many developments, many characters and many plot twists. However therewere some controversial elements, but since every Harem has that, it became a naturally settled in the end. What i noticed especially is that even though they are 12 (excluding the youngest son) not all of them had romantic interest towards the lady. Which makes it an added change. \\n\\n\r\nArt: Is absolutely Beautiful. Not a single complaint is there.Justice has been done to every character even the squirrel. Opening and Ending was done thoughtfully. \\n\\n\r\nSound: The Opening and Ending music is very good, however even thought the background music section had some interesting pieces, i noticed that some of them were played at the wrong time, simply meaning that some of them were unsuitable to the required situation. \\n\\n\r\nCharacter: The limelight of the anime is the chara's different and unique personalities and how they conflict with the others. As there were 14 different people with different obsessions/age/interests/traits it was interesting to see how they got along each other. There were probably Yandere/Tsundere and you can probably even a whole collection of different deres for each of them. \\n\\n\r\nEnjoyment: I thoroughly enjoyed this, it has the required humor and the drama, the music was fine and the story was interesting, i desperately wished for more episodes. \\n\\n\r\nOverall: This anime is considered Reverse Harem, but has a different taste to it. If you are a fan of harems, this is a must-list for your collection, if you are an average watcher then excuse the congested lovey-dovey scenes and enjoy the uh plot!",
            "date": "2014-08-19T06:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 157115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1310853.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/greatyu",
                "username": "greatyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=157115"
        },
        {
            "content": "This story is typical for reverse harems, much like Diabolic Lovers. It was basic and of course, you have your favorites, but I wish the female was a lot more outspoken in this anime. I enjoyed the art and the sound, music and voice actors, as it all fit with the anime. Characters are a bit basic, none really get the chance to fully fill out and so thats sad, because I felt that if I could have seen more of each guy, I would have really enjoyed it more. I still enjoyed the anime and of course I have my favorites, as anyone does.\\n\r\nThough, the most addicting thing about the anime is the ending sequence where the brothers sing and dance and it's addicting to watch over and over!",
            "date": "2016-03-28T21:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 214628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5048025.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MissRaichyl",
                "username": "MissRaichyl"
            },
            "url": "https://myanimelist.net/reviews.php?id=214628"
        },
        {
            "content": "Brother's Conflict is a truly unique anime. Although I am quite a hater of rom-com and especially harem anime, this one CHANGED MY LIFE. I think that it is possibly one of the best that I have ever seen in my life. And also one of the shittiest. Why? Let's explore, shall we?\r\nStory: We start with a cliche as fuck reverse harem theme. Some average chick winds up living with 13 hot guys. But what makes this story really unique? They are all her stepbrothers. And they all want to screw her. You get the idea. SO, by the sixth episode, half of them haveproclaimed their undying love for her, and have kissed her. I really love the fact that the heroine (Ema, Chii, I don't know, she wasn't that interesting) was so bland and emotionless. And the best part was how she kept just ignoring the fact that she could quite literally get raped at any time, AS SHE KEEPS OPENING THE DAMN DOOR TO THESE CREEPY-ASS STEPBROTHERS. One would think that, if some girl kept getting hit on by all these guys that she keeps not having any interest in, that she would tell them to, oh, I don't know, STOP KISSING HER. But she just takes it, and looks all blushy and stupid.\\n\\n\r\nArt: The art was all right, actually pretty good.\\n\\n\r\nSound: Meh. The op and ed kinda pissed me off.\\n\\n\r\nCharacter: Dear Lord, the characters. There was literally every single romance cliche guy in here. I didn't even bother remembering these boys names, just their cliches. For example, 'Pervy twin', 'Normal twin', 'Father Figure', and 'Probable sex offender'. If you watch the show, you know who I'm talking about.  My favorite character had to be the stoned looking brother (Luis) and the fucking squirrel. That damn thing was hilarious.  And sadly, was the smartest character in the show, which was probably why the boring protagonist didn't listen to it. Oh, and the okama brother. He was a ray of pure damn sunshine whenever he talked in this awful, awful show.\\n\\n\r\nEnjoyment: A PERFECT 10/10. Why? Because this show was so bad, it became good. Every time that one of those freaks kissed her, I died laughing at her messed-up expression. And honestly, it takes me a full 45-60 min to watch one 20 minute episode. Mainly as I had to pause every few seconds to REACT to all the bullshit that was happening. I can't explain how much I anticipated episodes of this trash show. I derive nothing from it but pure JOY.\\n\\n\r\nOverall: 10/10. This show is literally so terrible, all of your troubles will float away. And watch it dubbed. There's this one line; \"Your school life will get 50 shades more exciting...\" I cannot explain the tears of laughter when that was said.\\n\\n",
            "date": "2016-03-18T19:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 213285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984935.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dipothebookworm",
                "username": "dipothebookworm"
            },
            "url": "https://myanimelist.net/reviews.php?id=213285"
        }
    ],
    [
        {
            "content": "I understand why many people don't like Brothers Conflict. The story is indeed a simple one, but does it have to be complicated to be enjoyeable? I don't think so, I loved this anime. It might be just a girl who moves in with her 13 brothers and the only thing that happens is that they fall in love with her, but the way that all these characters come forward is unique and has a certain charm. \r\nI for one wanted to marry half of them and wanted for the other half to be my real brothers! \r\nEach brother seemed like an actual individual, bythe end of the anime I had the feeling that they were real people that I had known for years.\\n\r\nThe only thing I didn't quite like was the main character Ema. She wasn't actually present troughout the story even though she is the main character. I thought it a pity that she was kind of just being there like a liveless plant. Like she wasn't even alive. That made some moments a little annoying, but on the other hand it made me more engaged in the story. I was often screaming at her, telling her to stand up for herself!\\n\\n\r\nAs for the art, I think it was done very well. The brothers were seriously handsome, I didn't just have to assume they were. \\n\\n\r\nYet this is an anime that you either love or hate. You'll have to watch it for yourself to know wheter it's good or not, but I would recommend it!",
            "date": "2016-04-02T07:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 215177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5063755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/rosex",
                "username": "rosex"
            },
            "url": "https://myanimelist.net/reviews.php?id=215177"
        },
        {
            "content": "Okay before hand i'm just going to say I am just a sucker for reverse harems(Probably the reason I stuck with it) and even when I say I prefer darker characters I enjoy things as fluffy and cute as this at times. This anime is one when your feelings aren't always the black and white,  I'd say its more likely you'll feel somewhere in between when it comes to this one. \r\nStory(5) - Yes it is a typical one girl, multiple guys living together sort of thing, you've probably seen this on wattpad and fanfiction hundreds of times! Yes the plot is sort ofblah, and I can understand what people are saying when they say it's completely unbelievable. I don't disagree with them because really it is, I mean what do you expect it was based off an Otome Game and some of those things are pretty sketchy. But really it wasn't that bad, it just wasn't that good if you get what I'm saying. For me it was just something to watch because I had heard things about. \\n\\n\r\nArt(6) - What do you want me to say? Once again this art was sort of blah blending in with the mainstream of today, but it's not like you looked at it and  cringed. It's just your everyday mainstream anime style and once again isn't that bad isn't that good. If you're one of those people who appreciate/prefer/want really unique good artwork, the content isn't good enough for you to overlook the blah art. Not to say you won't like it but if you're looking specifically for really nice/different art  you'll probably want to look somewhere else.\\n\\n\r\nSound(5) - Um let's compare the songs to when you have a food that has no nutritional value and tastes blah almost to the extent of being gross, but you can't stop stop eating it, it's just that addicting. I found the same thing with the music of Brothers Conflict. The opening was in one word...meh, I can't really say much about it other than that. As I say this again it wasn't that bad, but it wasn't that good the song. Although this song is leaning towards the bad side this time, it was still fine and I find it better than the ending despite me finding guilty pleasure in watching the ending multiple times... Well moving on to the latter, yes I did find some guilty pleasure in watching and hearing the song. The set up was awesome and creative, the lyrics were fine since I couldn't understand them unless I looked at the subtitles that were in every other episode, but the voices... Ugh. For example Yusuke who started us off with a  wonderful example of how not only did the family have flaws, but that some people are better left unheard. Despite the voices being all over the place, it was a cute set up. So close to ending this evaluation of sound one teensy weensy little thing about the voice acting, I could not handle Wataru's voice no matter how hard I tried to ignore it. It was just ugh...\\n\\n\r\nCharacter(6) - Yes a six, a six despite the choppy cookie cutter personalities of the guys, despite me hating naive characters and how despite that watched twelve episodes of a single girl's stupidity. Yes I gave it a six because the brothers had a sense of diversity to them, because each one had an a extremely different personality. Some people might find that annoying that there were this many characters with all these different  personalities, but I'm amazed the people creating this could keep it all straight. I don't think there was single moment when I thought that the personalities were mixing together. Plus the fact that all the different personalities could create these different moments in nice to see, despite the feeling that they didn't work the angle as well as they could have it was still pretty good. Now that's the brothers, the so called heroine is a different story. The ponytail and face fit her personality perfectly and I absolutely hated that. Not that it fit perfectly, but her character. I just can't see how she can be that stupid throughout this entire thing, heck how'd her dad leave his supposedly cute yet enormously stupid, naive daughter in a house full of teenage/young adult boys!?\\n\\n\r\nEnjoyment(6) - Two words, Guilty Pleasure, that's all I can say about this anime. Well obviously not all I can say about it, but that basically sums up my enjoyment of it. Adding to the fact I hadn't seen anime in a while (Just got off my mostly manga phase), much less a fluffy reverse harem (I was sticking to more fighter ones) one that's probably the reason I liked it as much as I did. Not to say no one else will like love this like teenage girls loved 1D and JB, but it's probably more likely to be a guilty pleasure. \\n\\n\r\nWell that's it for this one and really as one last thing I'm just going to say I feel like this anime could of been so much better with it's potential, but it just kinda fizzled instead of becoming what it could of been. That's just my opinion though so, yeah.",
            "date": "2014-08-22T08:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 157519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4039625.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/aRogueRaven",
                "username": "aRogueRaven"
            },
            "url": "https://myanimelist.net/reviews.php?id=157519"
        },
        {
            "content": "This anime is a reversed harem, but I think it could have been a lot better if it wasn't that. I find the characters to be very interesting and I'd like to know more about them. The family theme and how Ema feels about all of this is what I liked the most about this anime. It's just too bas that they had to include love into it, because I think it ruins the family aspect. I know it is based on a visual novel thus is a romance, but still.\r\nOther than that, if you liked reversed harems, you'll like it. It is enjoyable towatch, and there are some nice funny moments too. Most characters get some development which is quite nice. If you don't like harems, I would pass on that.",
            "date": "2014-05-31T22:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 145303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2231733.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/flaming-moltres",
                "username": "flaming-moltres"
            },
            "url": "https://myanimelist.net/reviews.php?id=145303"
        },
        {
            "content": "Synopsis:\r\nHinata Ema is the only daughter of a famous adventurer, Hinata Rintarou. One day, Ema learns that Rintarou is going to remarry with a successful apparel maker named Asahina Miwa. Since she doesn't want to disturb them, Ema decides to move out and live with her 13 new brothers in a mansion called Sunrise Residence. As they live under the same roof, romance is starting to grow between Ema and the Asahina brothers.\r\n------\r\nSo the story was all about Ema (also called as Chii) who had a reverse harem for herself. Of course I was curious of how things will end. Like \"who will she endup with\" \"how will they sort out their relationship\". The plot has nothing much to expect. But because of my curiosity of what may happen, I watched it. As a reverse harem/shoujo anime, It is well made, very good, that it's not obvious of who'll she'll choose and end up with. And as a girl, this anime tickled my girl side-- It got me interested, added that those 13 brothers are all good looking.\\n\\n\r\nEma is a simple girl. I really like the part of her that she's not a crybaby. We all know that in most shoujo manga/ anime, that if the heroine is being teased, she'll cry (stupid, right? -_- ) Good thing about Ema that she's strong enough not to cry for simple reasons. But she's too quiet. It really bothers me like how can she go on through the day like nothing happened? I really don't get it why Ema doesn't say anything. She just lets them do things with her, like it's okay since they're family? (wtf)\\n\\n\r\n\"Brothers Conflict\" gave each and everyone chances to be with the heroine (to make the watchers think more of who'll she'll end up with), and that's good. But the thing is.. the heroine didn't establish any strong bond with anyone since the anime jumps from a brother to another every episode.\\n\r\nSo none of their pasts were really highlighted.. but it's really fine. I think their pasts don't have to do with anything, so nothing much was included. Eventually you'll understand each and everyone's attitude and personalities.\\n\r\nBut isn't it confusing that none of those good looking brothers have girlfriends? lol that's reverse harem for you\\n\\n\r\nThe characters, the landscape, the background.. all of them were well-drawn! To be honest, I got hooked by their looks rather than the plot.\\n\\n\r\nThe anime doesn't really have interesting storyline. It was just all about \"who'll she end up with\", really. There is no twist that got me excited but still, I kept on watching because the 'curiosity' drives me to.\\n\\n\r\n I love how the author made this anime with good looking guys. It made the watchers root for their own choices.\\n\\n\r\n People who like reverse harem and shoujo/ romance genre, \"Brothers Conflict\" may just fit the spot.",
            "date": "2014-06-05T22:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 146045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778743.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KatrinLouiseo24",
                "username": "KatrinLouiseo24"
            },
            "url": "https://myanimelist.net/reviews.php?id=146045"
        },
        {
            "content": "A big fan of reverse harems, having a rare anime which had that as a theme was exciting for me. However, watching this anime made me laugh at the ridiculous and emotionless heroine, and cringe at her actions.\r\nOur little protagonist Chi, may be the worst protag i have ever had to watch. Her emotions are completely bland, even her smiling feels cold and with no feeling, her dialogue also consists in \"um...I.. , sorry, it's okay!, we are siblings.\" and I can go on and on...\r\nThe plot is of no interest, I always play a game on the side when I watch it, and rarelyeven read the translations. \\n\\n\r\nI guess the only good side of this anime would be the character designs and the music, and the cheap, cute and totally consented romantic scenes between Chi and her brothers. (sarcasm level over 9000)\\n\\n\r\nOverall, this anime is something to look at when you're bored, enjoy bishies and random cute scenes, or simply laughing at the emotions of Chi and suffer with that annoying pet she neglects so much.",
            "date": "2014-02-16T11:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 132773,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/469996.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/guusagi",
                "username": "guusagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=132773"
        },
        {
            "content": "This was actually the very first anime I ever saw. I saw its promo in my television and that's when i decided 'I HAVE TO WATCH THIS THING!!'\r\nA typical reverse harem\r\nJUST MY TYPE\r\nA cute girl\r\nchased by not 1,2,3 or 4 but almost 9-10 really HOT guys\r\nmoreover these guys are now her BROTHERS!!\r\nwhat could be more uncomfortable for a girl who didn't have romance in her life till now and suddenly one day 10 guys are fighting for her!!\r\n~~~~~~~~~~~~~~~~~~~~LOVE IT~~~~~~~~~~~~~~~~~~~~~~~\r\nIt would have been better if Ema would have chosen someone in the end. But SADLY she just kept saying 'You all are my brothers and Ilove you all'\\n\r\nThat broke my heart :((",
            "date": "2018-02-07T10:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 270928,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962247.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/otakuAshu2812",
                "username": "otakuAshu2812"
            },
            "url": "https://myanimelist.net/reviews.php?id=270928"
        },
        {
            "content": "Brothers Conflict in a word: Typical\r\nThe best thing about this anime is the End Credits song (so catchy!). Yes, I did enjoy it, but that's just because I love reverse harem animes. As an anime overall, it's not very good. Story, characters, and animation are all weak.\r\nThe boys are beautiful. So if that's all you're looking for, forget reading reviews and just go watch it!\r\nMy biggest complain with this anime (as with most reverse harems) is that the main girl is an idiot! Hinata is very bland and ignorant. Pretty much the only thing that makes her different from Haruka in Uta no Prince Sama,Yui in Diabolic Lovers, Heroine in Amnesia, and Ritsuka in Dances with Devils is that she likes videos games. Other than that, all five of these female leads are basically the same person. Apparently girls surrounded by hawt men are instantly dumbstruck and robbed of any common sense. It would be nice to see a reverse harem anime where the female lead isn't so clueless!\\n\\n",
            "date": "2016-02-24T11:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 211617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4884977.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/VegetaOver9000",
                "username": "VegetaOver9000"
            },
            "url": "https://myanimelist.net/reviews.php?id=211617"
        },
        {
            "content": "This anime is okay if you don't take it too seriously. I mean, it's a reverse harem with 13 stepbrothers with not even enough episodes for each of them. I didn't expect much and it gave me a few good laughs and light entertainment.\r\nIt's fun to watch if you're looking for a reverse harem with lots of bishounen with a shallow plot. The girl isn't too annoying but she doesn't have any redeeming qualities either and is a bit too complacent for my taste.\r\nI think the saving grace of this anime is its art. The character designs are actually quite nice and each of theguys are easily distinguishable from one another. The animation is also surprisingly clean and fluid with nice settings.",
            "date": "2015-07-10T13:02:00+00:00",
            "helpful_count": 0,
            "mal_id": 192899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4650106.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/minapisan",
                "username": "minapisan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192899"
        }
    ]
]