[
    [
        {
            "content": "*This review contains some ugly words - such as fucking, robot-bitch, incest-curious and \"ugly\" - and may harm some viewers. Just like the anime did.*\r\n“When I was 5 years old, my mother always told me that happiness was the key to life. When I went to school, they asked me what I wanted to be when I grew up. I wrote down ‘happy’. They told me I didn’t understand the assignment, and I told them they didn’t understand life.” \r\n-John Lennon, The Beatles\r\nThe anime, Beatless, is often misunderstood in similar manner. This is a romance story between two real human beens, except the other oneis actually a non-human robot. From its core, Beatless is highly similar to some of the hottest clusterfucks known in memes. Especially from its sci-fi settings, it comes close to the sole worst anime series -at least in my opinion- Guilty Crown. However, there were GC failed to be ironic, Beatless did not. \\n\\n\r\nThe biggest mistake anyone does, is try and take this turd seriously. These guys made it very clear already in the terminological level that this thing is a joke. The big evil corporation in it was named MemeFrame. Like seriously, it's like meme macro but for characters, and clearly is parodying Ghost in the Shell's shells. Meme-effin-frame. How anyone can even write such comedy is beyond me.\\n\\n\r\nAratard, our main bro, is a real hero. Personality-wise, a typical nice guy, I musn't run away nerd with superior moral values. So naturally, he becomes the legal owner of this robot-bitch he falls in love with. Doesn't this type of ownership make him question his superior morals? No! Of course not. Such silly questions. Aratard is merely using the corrupt stand of the social system for his own benefit in the name of greater good! As we can see, he has already surpassed all superheroes there has ever been with his moral wits. \\n\\n\r\nOur robot-bitch (I refuse to call her by her real name because inanimate fucking objects, such as lakes (middle finger to all geography teachers here, btw) should not be rewarded a name) is a real waifu-material. In terms of lore, she does not have a soul, which makes her just perfect. Practically, she is a maid who does anything bro wants, and acts like the ideal SO (significant other) should. On top of that, she seems to be the prettiest and most faptastic girl in the universe, constantly followed by both guys and girls who want her. And she is yours! Oh wait, I mean Aratard's. The future is certainly bright. \\n\\n\r\nSome of our scenes are pure comedic gold. For example, during one supposedly badass fight scene, we hear some upbeat samba music while robot-bitches shoot missiles and rekt everything. Then, randomly, the music changes to some lackluster, emotional track -- made possibly by a guy who uses the synthesizer for the first time in their life. All seiyuu and background sounds get muted when this new track starts playing, followed by supposedly thought-provoking and sad monologue that manly reminds me of Morgan Freeman's character from The Shawshank Redemption. This scene is so try-hard, in-your face emotional that it can only be viewed as a parody, and I, for one, was laughing my ass off. \\n\\n\r\nThe pacing is comparable to a well-polished diamond. The great first encounter is on of the better things I have ever seen an anime to accomplish. Basically it went like this:\\n\\n\r\nRobot-bitch: yo\\n\r\nBro: hey\\n\r\nRobot-bitch: wanna get married?\\n\r\nBro: cool\\n\r\nIncest-curious imouto: let's have threesome\\n\\n\r\nThe worst part of this show is how robot-bitch's pussy won't work until her owner turns 18. Real tragedy right here. But hey, at least one legitimate reason to watch all episodes. \\n\\n\r\nProduction wise, there are two noteworthy things. From its art, Beatless looks like the combination of modern production + any nu-action shonen anime from the beginning of 21st century. Moreover, the OST is a real rarity for anime industry. Practically every song in it is or strongly reminds of NCS (NoCopyrightSound) releases of popular electro/house/dubstep songs you see with +20 million views on Youtube. This is not an insult, rather the OST works well. Kudos. The OST is also wide, so naturally some songs are worse than others. \\n\\n\r\nAs a conclusion. Beatless is the seasonal ironic masterpiece, and it should be watched by anyone who enjoys unwatchable trash. To others, there is nothing for you here.",
            "date": "2018-06-29T10:41:00+00:00",
            "helpful_count": 172,
            "mal_id": 282534,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282534"
        },
        {
            "content": "What is a recap episode?\r\nRecap episodes are the stuff that the creators put in because they either don’t have enough material to adapt further arcs of set anime or they want to have newcomers who are interested of watching set series to catch up. Unless you are a long-running anime that has 50+ episodes I find the recap episodes to be pointless and lazy because honestly why would you watch 20-minute clip show that summaries a couple of story arcs that very often leave out important stuff when you can easily go watch actual episodes themselves. \r\nWhat does this have to do with Beatless?\r\nBeatless isa perfect example of how to not run a producing schedule. The reason I'm saying this right out of the gate because if Beatless was done by any other studio it would have been function-able but because this show was done by Studio Diomedea who somehow have a worst record than fucking A1 Pictures this show was destined for failure from to become a massive failure. The show itself was poorly written crap from the very beginning and it’s only made worse thanks to shitty producing schedule with its horrid intermission episodes which by the way are RECAPS!!!\\n\\n\\n\r\nOne-hundred years into the future. A world in which society is mostly operated by humanoid robots called hIE. With the introduction of an ultra-advanced AI that surpasses human intelligence, beings that mankind is yet to fully comprehend made from materials far too advanced for human technology begin coming into being. Lacia, an hIE equipped with a black coffin-shaped device, is one of these. In boy-meets-girl fashion, 17-year-old Arato Endo has a fateful encounter with the artificial Lacia. For what purpose were these artificial beings created? Amid questions regarding the coexistence of these artificial beings and humans, a 17-year-old boy makes a decision…\\n\\n\r\nTo say that Beatless story is a mess is an understatement this is one of the worse executed and produced plots I ever heard the displeasure of watching.\\n\r\nFor starters, the story is very dull and boring for the most part. I didn’t care about many events in the story because I was bored with them and I thought they were poorly executed. It doesn’t help that many of the story elements in Beatless were done better in other anime before this.\\n\\n\r\nThe pacing in the show is terrible as lots of the events in the just seem to drag out way longer than they should make some of the actions scenes very boring to watch. Along with the shows horrible pacing, the direction is just abysmal. It’s Darling in the Franxx levels of bad where it rather wastes it’s time on tropey shit instead of establishing its own world and plot correctly.\\n\r\nIt doesn’t help that the fact that this show tries to be more big and complex than it actually is having the show takes itself too seriously with its themes, symbolism and heavy dialogue but it utterly fails thanks to this show horrible pacing, tone shifts and directing the show becomes very pretentious as a result.\\n\\n\r\nThe worst thing about this show that single-handy killed the show is the frequent intermission/recap episodes. For an anime that has 24 episodes this show has so many recap episodes it’s insane.\\n\r\nThese are recap episodes alone killed the pacing and narrative as it only makes the show even more insufferable to watch. The moment I saw intermission 4 pop up 2 episodes after intermission 3 I wanted to drop dead because how can a show have 2 episodes of barely anything happening and decided to have another intermission based on these episodes. \\n\r\nThe only good thing about the story is that it can be pretty funny at times other than that it’s a mess that is filled with so problems.\\n\\n\r\nNow if you thought the story was awful you haven’t seen anything yet because the characters are somehow even worse.\\n\\n\r\nOur main protagonist Arota is your typical naive character that we all seen before. He barely has any motivation at all and he just spends most of the series whining and being an incompetent idiot for the sake of it.\\n\\n\r\nLaica is an empty husk of a female lead. She barely any personality at all other to just serve Arota and be waifu bait for the audience.\\n\\n\r\nThe rest of the characters are just walking cliches like the Arota’s annoying sister little Yuka who is basically a walking Imouto, Ryo the edgy smart childhood friend character to the spunky hot-headed Kouka who despite being the most entertaining character in the series is still a very below average character at best.\\n\r\nIn short, the chararters in Beatless are just as bad as the story.\\n\\n\r\nMoving to the production side of things Beatless are at best very underwhelming especially for an anime from 2018\\n\r\nFor starters, the character designs of the anime are a big downgrade to the light novel where certain characters of the show are missing a lot of detail and polish. I know it’s not fair to compare the character designs from different mediums with each other but for this case, I couldn’t because the characters designs are a complete dumpster fire compare to the light novel counterparts. The best example of this was our protagonist Aroto where in the anime he looks like a typical nice boy while in light novel art he looks like more a serious threat.\\n\\n\r\nIt also doesn’t help the fact the character designs constancy goes off-model especially in the fights where the art constantly, for the most part, is at an all-time low.\\n\r\nThe background scenery is terrible and uninspiring to look at.\\n\r\nThe animation is below average at best as it has a lot of still frames, poor fight choreography at times and choppy movement.\\n\\n\\n\r\nIf there’s is any silver lining for Beatless that saved it from being a total crapfeash it would be the soundtrack\\n\r\nThe soundtrack is just a joy to listen as it perfectly captures the sci-fi setting well with its amazing use of dubstep and futuristic tracks that were played in this anime.\\n\r\nOpening 1 Error by GARNiDELia is a great and catchy opening theme that fits well with the first half of the series.\\n\r\nOpening 2 Truth.” by TrySail is amazing opening that I adore to death and it’s by far the best thing to come out from this anime.\\n\\n\r\nLike with the openings themes both ending themes are great and catchy especially the first one Primalove” by ClariS which is my favourite ending theme of 2018.\\n\r\nThe Seiyuus did a decent job with the roles that they were given and the overall acting is above average.\\n\r\nAt the anime of this review, Beatless hasn’t got an English Dub but then again why would anyone even bother picking up this series since the series was a failure.\\n\\n\r\nSo there you have it Beatless is a horrendous anime.\\n\r\nIt is likely one of the worst produced and scripted anime I have seen.\\n\r\nOther than the soundtrack and the kick-ass opening and ending themes there was not a single thing that I enjoyed about this show from it’s poorly executed plot, intermissions/recap episodes up the ass, shitty production values, stupid charterers and atrocious writing.\\n\r\nHowever, despite Beatless ended up being a train-wreck I will give the show this. Least you're not Darling In the Franxx.",
            "date": "2018-06-29T11:52:00+00:00",
            "helpful_count": 41,
            "mal_id": 282539,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=282539"
        },
        {
            "content": "Back when I started the show as it aired on January 13 I liked Beatless. It had coloured me with joy and anticipation since it's first episode went so well. Compared to the other anime I started at the time, it felt like it could do a lot with it's premise. Tut Tut. It went out like a light for the whole first half and took a while to set itself on track, and unfortunately not the same track as I felt in episode 1, but hey, it had a direction, so that's already better than FranXX. \r\nHaving said that, Beatless is far from perfect,despite throwing around it's ideology that robots do not make mistakes (and proving that wrong afterwards) it felt unnatural to see such robots (or hiEs if you may). The plot just kept on throwing random stuff at my face, sometimes Lacia is an idol taken straight from Aikatsu (Aikatsu Robot? Well that's redundant) and sometimes she's a fashion idol that makes Arato’s heart throb, not mine. Needless to say, it was inconsistent. It's inconsistent plot was evidenced in the first 7 weeks of it's run- I mean, episodes (will explain later) as it tried this thing or that. It began very badly after it's first episode and couldn't keep up till around episode 8 or 9 where it decided on one direction and stuck to it. How well that went is for us to judge, and my score can tell that enough. It was horrible in its first half. \\n\\n\r\nAside from these inconsistencies we also had the shocking revelation that the voice acting for a few actors was bad. Namely Shiori and Kengo. They sounded very much fake, or robotic if you love puns as much as I do. Shiori sounded like she was making her debut and failed at it (I will be very surprised if I find out this actually was her debut). But out with that, a huge problem with the anime was it's convenience. Whenever a convenient problem came, Arato conveniently solved it and conveniently everything went according to plan. Not the best thing to do to be honest. Apart from that as mentioned these random irrelevant plot points just came along and made the show feel like a cluttered up mess (trying not to jab at FranXX a second time here). Many times I felt irritated by the show not trying to focus properly on whatever the heck it wanted to be doing but alas, rarely did the rabbit go down it's respectful hole. \\n\\n\r\nMoving away from that we come to another massively irritating part of the anime, the villains. Or should I say whatever the heck they tried to be. Let's start with Ginga. Watarai Ginga had a lot of potential since he was the former partner of the creator of the Lacia-class hiEs and his backstory could have been done better, but unfortunately they screwed up what could have been a great backstory and instead, mowed him down in terms of development during the series. He felt plastic. Not unlike cliched shounen villains who have no purpose other than “to destroy”. It was pretty irritating to be able to predict when Ginga would come or what Ginga would do, and though that ultimately let him to his super-predictable defeat (in the most shounen way possible), that's not an excuse especially when that's who you painted as the real villain. But ok, you do you Beatless. \\n\\n\r\nAfter that predictable defeat someone had to take his role of villain and they brought out the randomly created and introduced Erika Burrows, which I think is the most Nippon Western name I could come up with, but anyway, apart from showing how cryogenics can be successful (that's a debate for another day) she proved that Beatless could get a worse villain than Ginga. Her actions were unexplained, her motives were set aside (“I want something interesting”? Pls, you're rich, go get a PC and play games or something) and the way the show painted her personality was far from what I could call decent. I already complained about Ginga, so this can explain how bad she is. You might say she's not a villain, but if that's indeed true, then she has absolutely NO use in this show since she'd just become a nobody. \\n\\n\r\nMethode was introduced as that proud hiE who can beat em up and has good taste in sunglasses (trust me, those sunglasses, I need them) but she was pretty much another cliched villain who didn't improve. Although she had the motives, the way she carried it out and her brief appearances altogether shunted the true potential of this Character as well, another character with wasted potential. Now we move from bad villains to bad characters overall, namely our idiot MC, Arato. Arato was your average cherry boy. Apart from predictably falling in love with a robot his actions were as he said it himself, idiotic and uncalculated. In episode 19, they revealed what was the point of this incalculable mess of a character but not in the way you'd hope to call decent yet again. \\n\\n\r\nThen we move over to the other hiEs, Kouka was the one with a hard on Onee-san fetish but in all honesty I was rooting for her. She was literally the only character in the show I liked and as such I lost my mind completely in episode 16. If you like Kouka too, her actions in episode 16 will leave you in a fit of rage, since it was unexplained, random and rage inducing. Snowdrop was shown as that Loli robot (great diversity Diomedea) who eats other robots to gain power and can make humans lose their sanity (?) and do weird stuff which was noticed in the first episode just before Arato was rescued by Lacia. To date, I've yet to understand what she was doing and why but eh, let's move on, the last hiE to cover (Methode was covered above) is Saturnus, describing her will be a lot like Erika Burrows, in that it's a bit of a spoiler, although she has nothing to do in the plot I can freely tell you without spoilers that she has no use at all in the plot. Satisfying the maid fetish fans might have (yet again, great diversity Diomedea), all she did apart from that is go “yes” and “let's do this” and “alright”. Those were 80% of her lines for the whole show. Underused? You betcha. \\n\\n\r\nNow since I've been spewing all the negatives, let's neutralise with something that is both positive and negative, the sound. First the good, the music was great, the synth tracks used made it only the second show to extensively use synth tracks for it's soundtrack and BGM this year and needless to say it was well done. The OP/EDs as well did not disappoint. Now here comes the bad. Too much focus was kept into the music to do great in the other places. Production and budgeting wasn't done well since it was all about making that soundtrack and licensing the music, sadly this killed off the budget to focus on the other parts and so ultimately led to the downfall of the anime. Speaking of production issues, THE DAMN RECAPS. We had around 4-5 recaps for this 24 episode show. Let that seep in. Should a show get this many? I say no. Why did this show have so many recaps? Budgeting? We'll perhaps never know, but point is, I don't want to have a recap episode thrown at my face after waiting for a week. It's frustrating. For those who are binge watching it as well, the episodes are part of the show so it gets really irritating to see the words “Recap Episode” show up in your news feed. It cuts off from the main action badly. Oh wait, that itself is a fault in the show. \\n\\n\r\nIt's transition from one scene to another is random and pretty much tiring to watch. I can't tell you how fed up I was of this. And let's not forget the fact that our Lacia-class hiEs were given absolutely NO SENSIBLE EXPLANATION. Apart from very minor dips into their backstories, the hiEs never had their purpose of creation explained apart from one line or the other, lines like “I'm created to help humanity move forward” isn't going to earn an excuse. You need proper explanation which sadly wasn't given. Now it's not all bad though. Apart from being my guilty pleasure of the year it did have good things in it. It's plot improved considerably in it's second half, which although wasn't obviously flawless, it was a nice improvement all the same, as a person who was pissed with the first half even the mediocre-decent bracket it was in felt good to me. \\n\\n\r\nAnother important thing is that despite it's recaps, Beatless wasn't a rushed show. I never felt that it was rushed most of the time and the pace was pretty good in itself since I could easily watch the show without getting too much information at once. Another important point is that Beatless tried to do something different with it's main heroine, Lacia. Since this showed it's true colours in the last quarter of the show I won't delve in so deeply but it tried to paint her character in it's complete opposite way she was presented to us ever since the show started had mixed results, surprising because I thought it would fall flat on its face. It was well done since it changed my whole opinion of the past episodes of the show and Lacia herself. Kind of like that FranXX episode 13 which made you go “oh so this is why all this happened”, only that, and please bear with me on this one, it was done much better than FranXX. \\n\\n\r\nIf you asked me to compare FranXX and Beatless’ first episodes, FranXX easily beat it but the answer is the complete opposite if you ask me their overall position. Yes. Beatless is better than FranXX. Despite it's crazed amount of stupidity, Beatless had a direction to follow. FranXX didn't. It took Beatless 7 episodes to find its purpose and the direction it should be following, FranXX on the other hand couldn't at all find what it wanted to do, it kept on changing every episode, therefore butchering it's consistency. If I talked to the Yasaal in January about this he'd have laughed me off the room because both shows certainly didn't show their true colours until later, FranXX with it's terrible attempts at relating to teenagers with a horrible consistency and Beatless’ lame cliches coupled with bad villains, constant recaps but a somewhat proper direction (?). They're close, but Beatless edges out FranXX. Why am I comparing the two? It's natural to compare two shows of a similar level. \\n\\n\r\nWhat started out as a guilty pleasure quickly turned into a show that made me impressed how a lame show can at least attempt at standing up and manage to somewhat achieve that. An E for Effort? You bet, might even give it a D+ if you like, because even though it had a lot of issues, Beatless was in itself a guilty pleasure to watch. Oh, and to satisfy all the fetishes with the hiEs, a responsible older partner (Lacia), the wild girl (Kouka), the proud girl (Methode), the Maid (Saturnus) and the Loli (Snowdrop), Diomedea, you sure have satisfied the fetishes. At this rate I might have a fetish of watching bad shows for guilty pleasure if I don't stop, but to Diomedea’s credit, Good Taste lads. Now we wait for the next few months till those last 4 episodes come out. How unclimactic...\\n\\n\r\nStory: 2.5\\n\r\nAnimation: 5.5\\n\r\nSound: 8 (Dat synth, dat expense on sound, dat BGM, dem OP/EDs)\\n\r\nCharacter: 1.5 (Solely because of Lacia last quarter and a few characters [Kouka] here and there is this not a zero)\\n\r\nEnjoyment: 4 (guilty pleasure and somewhat decent improvement in the second half compared to first)\\n\\n\r\nOverall: 4.3",
            "date": "2018-06-29T11:47:00+00:00",
            "helpful_count": 34,
            "mal_id": 282538,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=282538"
        },
        {
            "content": "Beatless\r\n\"I belive in your smile,i don't care even though it's soulless\"\r\nThis review is about robot-themed anime titled Beatless. Do you know robots? Yes, a robot is a machine that can move automatically or manually, essentially the robot is a machine. Ever thought or imagined that one day the world would be filled with robots that could help human work. Then what happens if the robot has its own feelings and thoughts so that he can make decisions like a human. Imagine the robot - the robot starts invading humans and takes over our lives, it is terrible not only hihih. Why am I talking aboutrobots, because this anime review is about future robots.\\n\\n\r\nFirst impression\\n\r\n\"I believe in your smile, I don't care even though it's soulless.\" The sentence is the first sentence that appears on the monitor screen. I can predict that later this anime will have a deep story line and touch the heart, remembering that anime that begins with sweet words is usually like that hehe.\\n\\n\r\nIn the first episode, there is a child who looks like the main character is watching a robot explode when the manufacturing process is in progress. The storyline that is very possible is that the robot and this child will meet again later in my mind. And it turned out that it was true that I thought, the story would dwell on the child and the robot.\\n\\n\r\nThere are robot fighting scenes against humans, and for the plot itself it can be predicted that in the final episodes the opponent that will be faced is a robot - this robot ... finished hehe. If I am the script writer, maybe one episode will go straight out, anime doesn't have to wait for one huahahah season.\\n\\n\r\nWhat is clear for the first impression I immediately assume that later this anime will have a lot of moral values ​​contained in it. Hehe, we'll see it until the end of the season.\\n\\n\r\nSynopsis and Storyline\\n\r\nThe background of this anime is the modern world of the 22nd century, where human life has relied heavily on robots called hIE in carrying out their daily work. Humans more often interact and coexist with hIE than with other humans. Although these hIEs are very similar to humans, the world thinks that robots are just a tool. But there is a boy named Endou Arato who thinks that the soulless machine is the same as those who have feelings. His meeting with the female hIE named Lacia was the beginning of this story. The threat from the robot who wants to take over the human world continues to haunt. Under these circumstances, what decision would Arato take?\\n\\n\r\nGraphics and Characters\\n\r\nFor the graphics themselves, I can say that I can really describe the state of the modern world, even though there are still many other anime whose portrayals are better but it doesn't matter, but the story also seems pretty good. The character for the hIE itself is pretty good, but the expression and inspiration is still not visible, well maybe it's still the initial episode so it can't be seen in its entirety.\\n\\n\r\nUniqueness in Anime\\n\r\nUsually we can see the storyline clearly from the first episode, but in the first episode of the anime the storyline is still not clearly visible, still vague. Who exactly is Lacia and what is the real purpose. Indeed, this might be a special attraction for an anime to maintain the curiosity of the audience so they can continue to watch every episode",
            "date": "2018-09-21T06:12:00+00:00",
            "helpful_count": 18,
            "mal_id": 289572,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=289572"
        },
        {
            "content": "Story:\r\nWho wrote this shit. Honestly, there are places where our as-expected beta-kun MC steps it up, but other than that - the imouto is the most obnoxious thing in the show. AND the ending is an imouto montage? The premise of the world is interesting enough, it explores like chobits the relationship a robot and human can have - sure, fine, that's fun and all. Lucia best girl bait - fine. But damn is the plot an incoherent mess where the character's motives are simply NOT EXPLAINED. And let's not mention ep 6 RECAP - EPISODE 6.\r\nArt:\r\nRedjuice - yeah I'm a redjuice fan boy, boughtRedBox, BEATLESS when it first came out, been following since Supercell feat. Miku days. \\n\\n\r\nSound:\\n\r\nOP - Garnidelia\\n\r\nED - ClariS\\n\r\nAND YET THE STORY STILL MANAGES TO DISAPPOINT - I wished it would be a Guilty Crown first half+, but no.\\n\\n\r\nCharacters:\\n\r\nMC - as expected\\n\r\nWaifu - I'm sorry Touyama Nao you had to sit through this writing.\\n\r\nImouto - please just stop\\n\r\nMC Friends - not enough development to understand their motives\\n\\n\r\nEnjoyment:\\n\r\nYeah... No... no more imouto\\n\\n\r\nOverall:\\n\r\nTrainwreck, maybe it'll get better ... \\n",
            "date": "2018-03-04T19:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 273051,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328621.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Finalitius",
                "username": "Finalitius"
            },
            "url": "https://myanimelist.net/reviews.php?id=273051"
        },
        {
            "content": "First off the music is 10/10 any ways lets get down to the rest. \r\nBeatless pretty much stands as an example saying redjuice can mess things up sadly since I was expecting something along guilty crown however thats not entirely what killed this show since the story does sound very promising but ill go ahead and blame this on the director. Take Mizushima Seiji out of this equation I don’t think you have a peg to hang your hat on, to be honest there were more cringe-worthy moments in the premiere than I can shake a stick at, and not all that much to makeone believe there’s something worth wading through them to get to. Beatless does have a very nice look to it, but its eerie resemblance to Guilty Crown is certainly unnerving, given what a debacle that show turned out to be.  There’s the nut of an interesting premise here, as played out as the exploration of A.I. having souls is.  However there’s a lot of formula and really offensive anime cliche, including one of the most unspeakably awful sister characters I’ve ever seen and honestly Ive seen alot.  Yuko may be a deal-breaker, that’s how bad she is but the other problem is that the two leads, Arato and Lacia, could not possibly be more of a trope than they are.  Doormat schoolboys and Rei Ayanami clones again, seriously?  If I’m going to put up with the really annoying otaku nonsense then this show should have been much better and right now I don’t see anything in Beatless with the potential to do it.  I've sat quietly for every episode and the latest two recaps were possibly some of the worst possible thing you could throw in a short series.",
            "date": "2018-03-30T17:34:00+00:00",
            "helpful_count": 15,
            "mal_id": 275803,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Khrys_Zeverilion",
                "username": "Khrys_Zeverilion"
            },
            "url": "https://myanimelist.net/reviews.php?id=275803"
        },
        {
            "content": "To be perfectly honest LA was drawn to Beatless because of Nao Touyama...\r\nIn a more serious note Beatless along with Toji no Miko had some of the shakiest pacing in animes from 2018, but Beatless didn't suffer from pacing issues...Beatless suffered from constant delays.\r\nThe thing is Beatless had ALOT of potential to be a good sci-fi anime though with it's very typical \"meet cute\" premise at the start with it's main character of Arato Endou voiced by Takuto Yoshinaga meeting the hIE Lacia voiced by the aforementioned Nao Touyama, Beatless was MUCH more than that and really disguising that starting premise into an introspective lookat technology, AI, human fears of technology and societal pressures to conformity because of it in some sense as well. But these interesting elements takes some time for it to be established but the build up and tension is apt for Beatless to do, so really LA doesn't mind the pacing in this anime, it's the outside forces focuses on Beatless' pacing is something else but that a bit later.\\n\\n\r\nBeatless in many ways takes Isaac Asimov's \"Three Laws of Robotics\" and both experiments with it's concepts as well as utter breaks it's rules concerning robotics. This considering Beatless' futuristic world where hIE's are mass produced working as either helpers or military might and Arato's world is one of those outlier people thinking that robots are more than just \"objects or machines\" for people to just use and through Arato's perspective we see Beatless' introspective look at robots are more than humans or not. So LA talked about what Beatless does with it's Isaac Asimov's \"Three Laws of Robotics\", but breaking it's rules?...well the rules of Isaac Asimov did entail that the robot may not injure a human being or, through inaction, allow a human being to come to harm, that a robot must obey orders given it by human beings except where such orders would conflict with the First Law and finally a robot must protect its own existence as long as such protection does not conflict with the First or Second Law and those rule breakers comes from in the form of the special rogue hIE's trying to find masters for their sole purpose of disrupting the social order of robots and humans in the process in which Lacia, Methode, Snowdrop, Saturnus and Kouka are all set out to do, but Lacia, our main heroine has other motives and with the help of Arato tries to achieve this, this is what makes it a VERY interesting anime.\\n\\n\r\nAs much as LA said there isn't pacing issues with Beatless, Beatless \"seems\" like it dwindles screentime on mundane things from time to time and MANY people might seem so maybe just to have some random exposition of the hIE's and how they program like \"analog hacking\" and the sorts but as much as exposition in this anime is VERY HEAVY and subtle to say the least (it makes sense as this was adapted from a novel thus the heavy exposition), Beatless KNOWS it's world building as it's consistently slow paced nature and exposition heavy it is, Beatless' execution is thorough and self-introspective of Beatess own world. Because of this along with the simple but greatly built up premise Beatless had going for it, all things considered, Beatless' complicated plot DOES make a lot of sense in the grand scheme of things that again Beatless had lots of potential it had going for.\\n\\n\r\nAnd if your thinking that the entire \"meet cute\" scenario of Lacia and Arato goes into a serious romantic subplot, well it does, but it really doesn't become the center focus of the anime at all, but more like it grows Lacia and Arato's relationship through all the trials and tribulations they go through to achieve their goal for the good of society. There are lots of shipping moments but their relationship feels strictly in the background unless needed with it's more serious major plotline that both are tied into.\\n\\n\r\nSo what made Beatless suffer soo much for Beatless to be a shaky anime and lose it's potential?...the recaps, and fine one recap episode is nothing to get annoyed by, but FOUR delays all spread throughout the early beginnings and halfway through the anime. Beatless was just plagued with delays as these four delays isn't enough, the \"final arc\" of Beatless has been delayed til September!. LA merely says this as Beatless had ALOT of plot twists and the such and for soo many delays and recaps leads to loss in traction and intensity of the plot it had ramped up, only for recaps to stop us in it's tracks and having to wait 2 weeks and the biggest one being that the final 4 episodes isn't coming out til after another season has passed in the time of writing this review...by then it's momentum died down. Sure maybe Beatless staff wanted to make it's finale perfect and for diomedea to keep it's consistent animation stable because of this and sure you can binge watch it again, but as a person who already knows what was going on, for it to stop when it was getting to great heights then kill off it's momentum is a major buzzkill to say the least. LA WILL watch the final 4 episodes as LA really liked where it was going but in terms of Beatless track record of delays this was something unprecedented in anime for LA that LA NEEDED to talk about. \\n\\n\r\nDoes this mean Beatless is unsalvageable because of it's constant delays?, no, as it's concept, strong world building and toying with Isaac Asimov's laws was greatly implemented in the form of anime along with interesting characters and plot doesn't discredit Beatless at all.\\n\\n\r\nSo into the element of Beatless itself...\\n\\n\r\nThe animation done by diomedea was actually pretty decent, from it's exotic character designs, futuristic yet urban city settings down pat along with HEY Beatless CAN do action scenes....well. LA will give diomedea props that it's animation was decently impressive to say the least with some less janky or derpy battles and though it's battles are mainly laserbeams or explosions, the action at the very least was fluid in some sense that it makes the battles decent animated as a result, but diomedea's strengths would definitely go to it's character designs. Overall Beatless' animation was decent at best and it's battles are a standard \"slightly\" above diomedea's norm though that isn't saying much.\\n\\n\r\nVoice acting, well if you read LA's first statement of this review and Nao Touyama is in this and though she's mainly monotoned with some spurts of deadpan serious vocals injected into her role as Lacia. LA found Nao Touyama's performance.....ok. Beatless has alot of great voice actors under it's belt, with Sora Amamiya doing a brash vocally-type character as Methode, Kana Hanazawa as the genki type character, Misako Tomoka as Kouka as the rebel, no shit taking hIE and Hiromi Igarashi doing her typical loli-type character with an air of childish malice to her. Takuto Yoshinaga was voiced the main protagonist Arato did fine but really Beatless' voice cast was great all round with some playing against the type while some only going greater as their preferred strong character role. By default though Nao Touyama gets LA's MVP...LA's bias LA knows but....LA doesn't care!\\n\\n\r\nBeatless maybe have been plagued with delays, it's heavy exposition got people out of it and away from the anime but for what Beatless had going for it, from Beatless' interesting concept of robots and AI and the talk of sentience with all this to it's interesting characters, decent animation from diomedea and a rather impressive voice cast, LA thinks Beatless DID deserve some backlash it got especially with it's delays but saying that Beatless is a terrible anime just because of that does not for LA, it's merely something of an excuse to make the anime look worse than it truly is and Beatless is much more than you realize in the long run. Beatless is introspective, it's detailed, it's many plot twists keeps you interested, it's character motivations and plans are interesting, it's world that Beatless built is interesting and it's basic premise turns that on it's head into something revolutionary for Beatless in terms of plot and it's characters.\\n\\n\r\nLook as much as LA points out the faults in Beatless and trust LA, LA got angry at Beatless from time to time too, but Beatless is still a good anime about robots and what it entails of sentience and humans fit into all this, it's just plagued with it's delays and being exposition heavy. \\n\\n\r\nLA will be waiting to see if the final arc of Beatless, Beatless: Final Stage and hope for a climactic finale with Lacia and Arato trying to reach their goal, but until then...LA will give Beatless a battered but hard earned \"decent anime\" status.",
            "date": "2018-06-29T15:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 282557,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282557"
        },
        {
            "content": "We had mech shows throughout the years, and seeing something like Beatless felt like a breath of fresh air, because even though it was littered with humanized AI robots that are called hIEs that operate from the typical avant-garde AI system set in an dystopian world, the direction was great,,,but it's progression and execution went so drastically wrong.\r\nSo this was one of the first 2-cours that are laid out in the beginning of the year alongside Darling in the FranXX, Katana Maidens and the 2nd season of Nanatsu no Taizai, but in terms of engagement and excitement, none could be said further from the truthfrom FranXX, Taizai and this show to be the premier ones...until 6 months later, and look how everything went out: FranXX, despite its shift in views and controversies, STILL manages to glide along, Taizai Too remained consistent in the typical manga adaptation, and this show, a wreck in the making.\\n\\n\r\nIn the world of Beatless, it is set in an future where mankind exists in the form of technologically-able AI system called Higgins, which govern every robot-mankind hIEs just as you would expect of the future dystopian world. And in comes the elite: the Lacia-class type robots called Red Boxes, whom are very powerful as strong, able-bodied hIEs whom have been produced by the look-bad corporation at Memeframe, and exists in 5 flavours: Lacia, Methode, Kouka, Snowdrop and Saturnus, all who require owners in honouring T&Cs with their views that can be shared and realized, only if their owner warrants it. But more of less, its creator Watarai Ginga, the creator of the Red Boxes, soon labelled as the main perpetrator behind it all, is only given his exposition as the final boss to defeat after seeing his ownership with Snowdrop (to create an alternate world that is different from how Higgins would have governed the current time).\\n\\n\r\nBut much to the extent of the MC, Endou Arato, a plain-looking boy who has found his way into the situation of an equivalent of an analogue hack, something that is introduced with his encounter with Lacia, the 001-type class production that is said to be superior to the other Lacia-class/Red Box units, and therefore entrusting each other into a future that has yet to be written, and the story progression gets better...if not for a few hiccups.\\n\\n\r\nWith that said, the characters here...well, let's say that as much as they are human, they are tools that are used to further encapsulate the story as a whole, and probably their execution was somewhat underwhelming. \\n\\n\r\nStarting off with Arato, his sister Yuka and Lacia, this somewhat of a family whose father was the member of the large conglomerate of the Memeframe Corporation, who co-developed the Lacia-class units as something seen as a problem, but not until the fray when it happened that Arato is forced to cooperate with Lacia to create the future that is entrusted with his hope of a rebirth. But, back to the family side of things, and one of the first impressions that was striking was his whiner of a sis-con Yuka, whom tries to sweet-coat her brother (and later Lacia) into a loving family, but unfortunately her incompetency to judge the entire situation relegates her to the side-character status, and does so supporting her brother until the problem is resolved.\\n\\n\r\nArato on the other hand, was an nonchalant as a brother could be, with his split-second decisions that almost cost him his life several times, and dealing with a situation that's sitting on top of his head, undetermined but willing to trust and overcome issues with Lacia, the hIE whom has no soul, is using him as a guinea pig, and more importantly, the trust that both can create the future that he wants that she can make for him.\\n\\n\r\nComing over to Memeframe's side of things with bro-sis Ryou and Shiori Kaidai with the deadly Methode, this is a force not to be reckoned with. The task of executing Memeframe's ideals first fell into Shiori's hands (at the time when Ryou was doing his own stuff and encounters Methode), and with a somewhat confusing but clear execution, it first began as rivals between Methode and Lacia for fending off what was seen as the typical good vs. evil cliché that happens from time to time, to the large extent of building and protecting the future yet unseen. Shiori as expected, was not up to the task, abandoned by both her brother and Methode, and like Yuka, was demoted to side-character status-quo. Then once the older brother taken over, it's complete hayhem, and both him and Arato become bitter friends-turn-enemies as a result. Ryou as a character, he seems like he knows what he is doing, and is firm in his foundations, I have to respect him for that in the move that others cannot do, he has to initiate first-hand.\\n\\n\r\nOn the other hand, the already purpose-sent Kengo and Kouka have served their ideals well: Both are friends in co-relation towards one another (Kengo and Arato school classmates, Kouko and Lacia both sisters), but on the neutral side of things, further not warranted to engage in-between the helm of the situation. Sadly they are nothing much than side cheddar to support both Arato and Lacia in their world-building, but it's great that they do have at least some screentime dedicated to them to further enhance the plot when all is said but leave a dry taste in our mouths, and for one, I'm only excited when the duo come out to do something out of their comfort zone, because as much as they are support characters, their purpose is not only felt in the heat, but endless pursuement and determination is what keeps the duo alive, defeated but well.\\n\\n\r\nWatarai Ginga with Snowdrop in the palm of his hands, and Erica Burrows with Saturnus beside her are both bread and butter like characters, spectators that come out to show their prowess in defining the meaning of the future-yet spread-out world, but serve almost no meaning as to the coherent plot (well, only Ginga and Snowdrop did). At least Ginga had the ass to mass create Snowdrop with the intention to destroy Higgins and create his own diversified world, and where Erica took the \"one step forward, two steps back\" approach, sitting on her couch to see the ideal world being born, as much as they are supporting characters, the usefulness wears off as quick as it should, leaving their scenes empty most of the time.\\n\\n\r\nOverall, it felt like the characters are tied to each other, by coincidence or by fate, but blending into the story, it was just plain unjustified.\\n\\n\r\nDiomedea's VERY FIRST attempt into the 2-cour segment (not counting their previous sequel series)...was promising from the start, but a wholesome disaster to finish. The art style and animations are really OK at best, but what they did here with the endless 5/6-episode-count intermissions are just plain fricking self-explanatory, and serve no purpose at all if we're just seeking the usual 2-cour shows like we have here. IMO, I like recaps when done right (look at SAO: GGO Ep 5.5), but when you have a series that's THIS long and it has to fill with more than 2 intermissions, this goes to show that as much as the staff involved wanted to save the best for the last, this is the lazy, half-assed approach to a series that has been ongoing for months, and this travesty just isn't enough to save the detrimental value of the series as a whole.\\n\\n\r\nAnd well sadly, the music is always the high point of the series. Beginning with the 4 OPs and EDs that are done by different but highly-praised artists, they etch and stitch the series beautifully with OK to decent visuals of the representation of the series, and these songs are legit impressive on their own. The BGM is one area where I didn't think that it would implement on the low and high points of the series well, but it manages to pull off in whatever scenario it throws at it, thus making the series less stale than it is in the musicality department.\\n\\n\r\nIn the end, Beatless was a show that started out as a promise, but as the weeks and months passed, it was very clear to us that as much as it is praised for the ideas that it conceives, the relevancy was pretty much taken a backseat to the on-set turmoil of scenes and situations that while, makes sense, but it pounced on the pacing of the series, HARD. Execution was poor for a novel adaptation that was good, and even from the heavy competition from FranXX, it manages to hold off on its own, but lost steam and quickly become just a bore to watch.\\n\\n\r\nUnimpressively, wait till Summer/Fall for the final stage of the series due to the anti-climatic situation of the series to follow...will it be done? It depends...",
            "date": "2018-06-29T13:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 282545,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=282545"
        },
        {
            "content": "For many years people have thought and dreamt about the future of technology especially when it came to A.I. and robot, and what such things could possibly lead to.  It is a topic that has been talked about in almost every medium from live action movies such as “Ex Machina” and “Her”, written stories such as “Dream of Electric Sheep” and “Have No Mouth but Must Scream”, video games like “Neir” and “Detroit”, and even other anime such as “Ghost in The Shell” and “time of eve”. This is by no means a comparison of other works, but rather that the topic has beenexpounded upon multiple times and multiple directions. Now enter this anime that is about finding essence within the material especially the sentient kind, and whether something like that can have a “heart” without having a heart and thus is beatless.\\n\\n\r\nBeatless is set in some sort of future where A.I. and robots have advanced a long way with A.I.s, known as HIE, being a predominant part of society not only as private servants, but also being a part of the workforce as vendors, officers, and even idols. Of course with stories like this there is bound to be some conflict between the humans and the machines mostly with humans seeing them as nothing but tools that need no sympathy. However this is not true to our main protagonist because of kind personality is willing to help HIE’s despite the fact that they are machines. It’s a bit latter that through happenstance that he is saved from an attack by Lacia an HIE who becomes the heroine of the story. Lacia however is a special type of HIe who along with four other have escaped from a facility and are around and about the world. Arato is thus forced into a contract with Lacia in order to save his life and now both their lives are intertwined with one another.\\n\\n\r\nWhile a decent start, the majority of the story just comes off as uneventful. There are of course components at play during the course of the story such as the introduction of the other advance HIE”s, other side characters, and other factions coming into play, but none of them really have that much weight to the story. They more so pass along the show with a bunch of screen time, but no depth that makes them engaging. What seems as important parts of the story are shafted in by long boring dialogue by uninteresting characters, and then shafted out. There are plot twist and character heel turns that are meant to come off as surprising but no matter how it tries to present it through its visuals and audio, it’s how the narrative unfolded that gives it the lack of gravitas. There’s also conflict that is sprung about in the show, but it’s more for the sake of adding a false sense of drama and tension to the show so that it can be entertaining since it wasn’t able to do that with its story and characters. \\n\\n\r\nSpeaking of characters, they are as paperthin and uninteresting as they come. Arato the main protagonist is the typical nice guy protagonist of the story who is strung about the plot through other characters. It wouldn’t be a bad thing if it weren’t for the fact that not much comes from his character than his affection for lacia. There are moments when it seems like his character will grow, but it’s just him continuing being a reactive character than a proactive one. Lacia, well there’s not a lot to say other than she cares about Arato. There’s more than it seems about her, but like i said the way it folds out has little weight to the story and just comes off a uneventful. There’s also Arato’s sister who is just there, and who serves no purpose to the story other than taking up a lot of the screen time. Every Other character and antagonists are also just as one-dimensional and boring as them and just play through the motions of the story, well except maybe one. Kouka is probably the best thing about this show not because of her complexity but rather her personality and the way she’s presented that gives the show a sort of cheesy vibe to it even if it’s short lived because it would better to be cheesy than boring. \\n\\n\r\nVisually the show is baseline mediocrity and some decisions of the show do more harm than good to the show. When it comes to shows like this that there needs to be some way for the viewer to tell the difference between the humans and machines. It could be argued that they look to human to tell the difference, but it has been explicitly told that people can easily spot the difference and shown that people can easily tell and discriminate against them. There seemed to have been a moment that could have given the studio the benefit of the doubt if they used the cliche colorful eye and hair color to differentiate between humans and HIE since viewers have been used to almost everyone having colorful hair so only giving the HIE eccentric characteristic would have been a cheeky way to differentiate them. However that's quickly cast aside with the princess character having eccentric features and HIE having normal features, so there’s no real way to tell. The most they give to telling the difference is close up of lacia eyes and its visible circuitry and kouka with visible body lines. Everything else is just average with the background, animation, and character designs with only as much effort to at least be appealing to someone. \\n\\n\r\nThe audio for the show is good for the most part, i guess. The voice acting as a decent as it comes from most anime. Good performances from many of them but not much really stands out, the same for the sound effects. The soundtrack for the show is pretty good and has some variety to it. It doesn’t really elevate much for the scenes or characters (except kouka of course), and are just nice to listen to by themselves.\\n\\n\r\nThe production of the show seems to have been an utter mess because during the airing of the show there were about a handful of intermission/recap episodes. not sure how these merit into the quality of the show, but i think they are still worth talking about. There’s honestly no reason that a show should have so many recaps. It’s not like the show was that complex, maybe forgettable, but not complex and if it were their intentions than it comes off as patronizing. Maybe the other episodes weren’t finished and they used them to give them a chance to finish but then it just seems like terrible mismanagement and a lazy way to have something to at least show the audience. Or maybe it’s because they wanted that sweet 24 ep run time even though they had no content to make more. Nonetheless whether this did or didn’t affect the quality of the show it doesn’t change the fact of how bad the actual show is. However for me it does since the show just ends abruptly with the probable announcement of a sequel even though they could have used those 4 recap episodes to at least finish something. \\n\\n\r\nBeatless is just a lightly bad show, not excruciating bad, but boring bad due to how uneventful it all pans out to be. It has a running thematic via a concept known as analog hack of how people give essence to a material but it quickly turns from being insightful to a means for a plot device, and not only that but much of the characters feel like plot devices as well. It’s a show that chose the worst types of tropes and archetypes to work with, and just stagnates on them with no hopes in development. With an ending that really leads to nowhere as it promises to deliver in a later installment although what has been already shown doesn’t bode well for it. There could have been good ideas in this show but it’s bogged down in almost every possible way to serve to some group of low common denominator and by horrendous management.",
            "date": "2018-06-29T11:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 282537,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=282537"
        },
        {
            "content": "Anyone said Darling in the Franxx, some Tokyo Ghoul season 2, some Boku Hero 3, or some Tada-kun,... but with me Beatless is the best!! With OP1 sung by Garnidelia, most dancing inspiration band,  OP2 sung by TrySail, cutest singer of Jpop, ED1 sung by ClariS, my best Jpop couple singer and ED2 sung by Tokyo Performance Band, feel like under an area live, only the appearance of these four performs has made me confirm myself this is the best anime of two season XD\r\nDespite the fact that a lot problems while airing this anime, delay,... bad reviews,... I will still marked this asmy best anime ever due to the OST",
            "date": "2018-07-09T13:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 283558,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kaze2508",
                "username": "Kaze2508"
            },
            "url": "https://myanimelist.net/reviews.php?id=283558"
        },
        {
            "content": "[Spoiler Warning]\r\nLet me just keep this short and sweet:\r\nThe MC's stupidity, shallowness, short-sightedness, failure to understand the ramifications of what his actions are causing, coupled with his wimpy sounding voice actor (VA): Pisses. Me. Off.\r\nYou might ask why am I sticking through this ordeal. Reason is simple: The books ended when the MC said to Lacia that he will not join her after learning she evolved to super-intelligent AI status. I'm simply curious on how the ending would turn out to be.\r\nThe execution was a pile of hot mess as well. The cinematography, the art of the anime, the sound effects all felt cheap, generic,and overused.\\n\\n\r\nBut it all boils down to this primary reason on why I'm rating this show a shiny score of \"1\": This pushover of a MC with his lack of critical thinking skills who enjoys being led around the nose by a pair of android tits, hands down the most pathetic anime MC I've ever witnessed. The studio also couldn't had done a better job of finding the most pathetic sounding VA to couple with this fool.\\n\\n\r\nConcept art was by Redjuice, which was awesome. Main reason why I checked this show out in the first place.",
            "date": "2018-06-25T05:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 282156,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/167820.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/dutchman_227",
                "username": "dutchman_227"
            },
            "url": "https://myanimelist.net/reviews.php?id=282156"
        },
        {
            "content": "This anime for those who need to know let me say this honestly after watching it about 11 out of 24 episodes since the other two is just the intermission series like recap series. Due to that my judgment may change in time.\r\nThis anime best point is logic and facts of how the future will be so if you think it's boring then it may be the same kinda boring while listening to the teacher but please care to focus on them cause their way of talk is in the top 10% of smart anime type.\r\nI'm not even lying this kinda logic hit on thetop 10%. Also, their way of talk can some point reach to university lv so you may end up being like \"WTF is going on?\"\\n\\n\r\nTo be honest I love this show due to that. Also, the MC is base on a real average human so if you think that guy is dumb? Look at yourself and think what will you do in his shoe...\\n\r\nI bet it will end up like him with the best outcome... It will be even dumber if the MC is a normal human then go like \"Oh I grant a power of the overlord!!! HAAAAAAAA!!!\"\\n\r\nLike wow... That's dumb for an average human in the Sci-Fi world with no fantasy in it...\\n\r\nRemember read the tags closely...\\n\r\nThere's no fantasy in the tags so don't expect that too much. If you watch this? Watch it for logic.\\n\\n\r\nEverything all base on \"logic\"\\n\\n\r\nIt seems many people just misunderstand it and watch it for action...\\n\r\nWhat I said is about how this anime will be.\\n\r\nLike no plot armor or OP mc. Only with the Sci-Fi in a scientific way. Like AI may surpass human and how the AI will react while using the cloud database. Like how the internet is to search for the best result. Their way of talk is just expending it to the university lv. I think you may not understand the meaning of what I'm trying to say.\\n\\n\r\nI just love how this anime using only pure logic. I won't try to say more than this cause it will be spoilers.\\n\r\nIn this anime it made you question a lot of things like scientist do with how they explain about AI or technology.\\n\\n\r\nI will say that the story is amazing done 9/10. The art style just goes so well with the story but not good enough cause the action doesn't seem like to be at it's best for the story yet so I will give it 8/10. For the sound? It kinda like a normal but the OP is so good so when I math that it will be 7/10. As for the character will be kinda normal and interesting at the same time so it will be just 7/10 stand for just good. As for my enjoyment? I will say I really enjoy it so much. I just love to question everything so this is the kinda anime I love so 9/10.\\n\\n\r\nWhen I math all the score the overlay will be 8/10 but like I say my judgment may change if they either mess up or make it better cause this is right now at the middle of the series so things may get interesting...",
            "date": "2018-04-07T00:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 277201,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4677224.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/InfinityKiyen",
                "username": "InfinityKiyen"
            },
            "url": "https://myanimelist.net/reviews.php?id=277201"
        },
        {
            "content": "In short:\r\nThere are elements of genius in this anime, but it isn't well executed for most people's expectations of anime. It's worth watching and especially so for individuals that like to think about our future as a society and the problems we are going to face.\r\nMore:\r\nYou watch this anime for it's ideas mostly, anything else surrounding those ideas isn't so good.\r\nThe anime is about the dilemma we face concerning our future with robots and AI, it uses unique ideas since most anime like this have one super AI trying to take over, where this one lets AI battle themselves and it makes for a moreinteresting story-backbone overall.\\n\\n\r\nYou'll definitely get triggered and ask yourself why they didn't just kill that person, and according to some abilities of the characters this whole story could've ended much sooner.. but i guess we can't have the perfect anime and we can only hope the creators can learn from their mistakes.\\n\\n\r\nThe concept of \"analog hacking\" is an interesting one, i wouldn't really have thought of something like this and would rather have envisioned a physical AI takeover like in most anime, it's thought provoking and i think they designed this anime to share their view, which is why they are adding three recap episodes.\\n\\n\r\nThis anime takes itself seriously, \"Memeframe\" was chosen because there is another definition for the word \"meme\" that fits the company name more than perfectly.\\n\\n\r\nmeme\\n\r\nnoun\\n\r\n1.\\n\r\nan element of a culture or system of behaviour passed from one individual to another by imitation or other non-genetic means.\\n\r\n2.\\n\r\nan image, video, piece of text, etc., typically humorous in nature, that is copied and spread rapidly by Internet users, often with slight variations.\\n\\n",
            "date": "2018-07-19T14:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 284340,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeuroTypicalCure",
                "username": "NeuroTypicalCure"
            },
            "url": "https://myanimelist.net/reviews.php?id=284340"
        },
        {
            "content": "Ultimately, after binge watching this, I have no idea why this show is rated as low as it is.  The best way I can describe this show is it's an Anime* Bladerunner that's more optimistic(?) about the future. (Anime* because it has a lot of common tropes that could be tiresome, but I didn't mind.)    \r\nIf you can get over any of the minor complaints about the visuals or some of characters being annoying, this series is Packed with theories and philosophy.  It juggles around complex ideas well, especially the concepts of hypocrisy that society is creating for itself.If you love asking the question: what makes a human truly human? or the Turning Test, this is a must see.    \\n\\n\r\nMy biggest complaint is that they seem to have a few scenes out of order, probably in order to create further mystery/suspense (which normally is handled well, but noticeable in a few instances).  Or worse, when they blindside the audience by throwing in a major character interaction without any warning & expecting the viewer to just get it  (the first seconds of Episode 3...).  But once I could wrap my head around the scene after having to rematch it, it made sense, but it felt like I missed an entire episode. \\n\\n\r\nSame goes for the beginning of episode 10.  It feels more like a an abridged joke:\\n\r\nLacia: Oh crap! Someone else has an identical serial number to me!\\n\r\nArato: Uhh, that's bad?\\n\r\nL: That's bad.\\n\r\nA: We should do something then!\\n\r\nL: I agree! Here's the pla-\\n\r\nA: No time to explain, LETS GO!\\n\r\nL: RIGHT!\\n\r\n*cue 60's Batman theme song*\\n\\n\r\nIn short, if something wasn't explained the first time you hear about it in the show, it will be explained late. (Except for \"Diet\" I think....) Annoying, but I personally got over it using humor.         \\n\\n\r\nAlso, as other's have mentioned, the recap episodes are annoying, Especially since episode 11 has some content not in the other episodes. I really hope the reason behind making, (and spending money on,) those recap episodes wasn't an attempt to try and hammer out the deeper ideas in case you missed something previously. Because in that regard, they don't do their job as you miss a lot of the nuance of the show. Alternatively, if these episodes were just to meet a quota, then I would be disappointed that they didn't flesh out more details over more episodes as this show really has a lot to say.    \\n\\n\r\nTo end my ranting, it can be a lot to take in as there's a lot of dialogue, which I could see being a problem for some people who want more action.  Stick with it and I assure you that you won't be disappointed with its depth of ideas, and yes, there plenty of fighting too.",
            "date": "2018-05-24T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 281314,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/helixninja",
                "username": "helixninja"
            },
            "url": "https://myanimelist.net/reviews.php?id=281314"
        },
        {
            "content": "Effects of synthesizing human intelligence due to expressing amount of emotions may considered to be just a petty schmuck cardboard detail. Let alone it brings no utterly sense of redeeming plot that tells within poor cringe setting apart it's memoir caricature. \r\nPretty sure, you won't expect anything usual besides it's turmoil humor other than the premises, Besides every visuals where too shiny more than came from a cheap third-rate crap. Along the details, Stories we're out linear on set of timing, characters we're too one dimensional with also had a self inserted whiny BETA c*ck, who regains her former fapping doll as his personal guest.Referring to viewers who's state on early depression, that depicts your inner epitome of life looking how bad it is. Nothing's casually way more worthless than an edgy satirical degenerate that transcends into a detestable c*nt.\\n\\n\r\nThere is NO well written gaps as on crossing a boundary between sub interior to deepen as well it keeps a shallow truth that lies on behalf mindsets. A balance we're indeed forced by contradicting uncountable amount of plotholes and fed up horrible pacing that intends to be left through it's current aspects of the whole show. \\n\\n\r\nOh look? a Former REDJUICE design coming from it's new ver. or indeed the new Guilty Crown mixed up with a lot of overly innuendo on Clockwork Planet. Which is an absolute trainwreck. Feel free to judge this simulator vile concepts cause it's beyond nauseating which includes in the trash.",
            "date": "2018-04-29T23:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 279376,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6174494.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/-HippySnob-",
                "username": "-HippySnob-"
            },
            "url": "https://myanimelist.net/reviews.php?id=279376"
        },
        {
            "content": "This review includes the final stage of this series. First of all i'm reluctant to watch this Anime due to its low scores and some bad reviews however because i'm a fan of AI/Machine i still give it a shot because of its synopsis. \r\nStory: The story was all about artificial intelligent, which is great since we all know that the world is moving towards the directions of AI/Machine Learning/Cloud Computing and etc. Now for the story. The story was really unique in my own opinion; while this might not be the first anime to cover about AI, it's the only Anime i personally seewhich was able to tell its purpose to its viewers, of how corrupt humans can be in order to gained power in society. The Anime was also able to sent its message that sooner or later manual labor will cease to exist as machines are now capable of doing the same work as humans and to be more precise machines can finish all its task with given time as long as there's power running on it, not to mention its accuracy at its job. its also raises my awareness to question myself what makes humans differs from machines who doesn't have soul and heart? story is 10/10 for me.\\n\r\nArt: Nothing to say here Lacia  is beautiful <3 i totally get why she become so popular in the society. 10/10\\n\r\nSound: The sound were fantastic...nope its actually amazing. the lyrics of the song were really for this anime specially the opening 2 (truth) where one lyrics is \"Humans are just a visible shape\". 10/10\\n\r\nEnjoyment: As a person interested in AI/Machine learning i can pretty say that i enjoy this a lot, to the point i feel not contented of how short the episodes this Anime had.\\n\r\nOverall: Beatless was my cup of tea. so nothing to say here anymore 10/10",
            "date": "2019-04-19T11:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 306682,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6371698.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/curisuchan",
                "username": "curisuchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=306682"
        },
        {
            "content": "*Might Contain Spoiler*\r\nwell this story is something different, sci-fi with romance but in this way never thought this is even possible for human to love android, well of-course its possible if a human can understand a human than what the problem with a android.\r\ni don't know how many people watched this anime and how many of them able to understand it, well its same goes for me, i just like to clear it, i also didn't understood this anime completely but whatever i understood, its my view.\r\n (to use \"machine\" word, in my view it like im disrespecting the android in this anime and usingthe \"he\" and \"she\" instead of \"It\")\\n\\n\r\nthe story was little complicated and was hard to understand until you focus well i think not the story but explanation in anime, well i tried my hard to understand this one bcz this story really took my attention, a romance story between a android Lacia and a human Arato who are trying to change future where human and android (AI) can coexists. And in the last 4 episode in Beatless Final Stage the truth was revealed that it was the predicted future by the Higgins (S-AI), he was trying to save himself from his destruction in future and released the 5 AIs in order to change a future.\\n\r\nwell sometime in anime i was lost but i still able to grasp the story :p\\n\r\nwell i don't know this kind of future or this kind of world is possible or not but i think its possible to find the happiness in all this things. \\n\r\nand that's what was going on here Arato fall in love with Lacia even if she is android and he supported her. and Lacia the 40th S-AI tried her best to predict the future and others moves in order to make the ideal future they were thinking in order to coexist with humans. and as they move forward things got worse sometime but she still helped Arato, bcz it was the trust they had for each other that helped them to move forward.\\n\\n\r\nin my view i think this anime is good example for humans to coexist with non-human beings if possible.\\n\\n\r\nStory :\\n\r\nwell basically i explained everything up there so not much left here to write but still like to point somethings well i said above that story was kind of hard to understand so it might be possible that many people have dropped this anime and the the many who completed it, they might will understand the story :D that what it actually trying to say :D and for that\\n\r\n9/10 \\n\\n\r\nArt : \\n\r\nnot much to say in this part but they really did some work in art the OP songs scenes are really good and the art in anime is really good, animations were amazing. and not forget to mention the characters all were so good.\\n\r\n10/10\\n\\n\r\nSounds : \\n\r\nSound were good, then the background sounds in anime and i also like the background sound of Snowdrop. And as for OP and ED , both OP songs are really good, i liked both OP songs than the ED songs.\\n\r\n10/10\\n\\n\r\nCharacter :\\n\r\nThere are so many characters in this anime but some of them left heavy impression on anime and one of them is Kouka i like this character but it doesnt mean that Lacia is left behind bcz Lacia is damm amazing she is be able to do so many things just by predicting what will happen next, dammm that's the S-AI for sure. \\n\r\n10/10\\n\\n\r\nEnjoyment :\\n\r\nwell as for enjoyment, what i enjoyed the most was both OP than, as for anime yes no doubt it was really good but some time i was feeling pissed bcz of his friend Kaidai Ryou who was interfering without knowing properly whats happening and why Lacia was doing those things.\\n\r\nby putting this aside i enjoyed rest of the anime.\\n\r\n9/10\\n\\n\r\nOverall :\\n\r\nas for overall nothing much left to write but they could have made anime in a way in which it could be more understandable easily.\\n\r\n9/10\\n\\n\r\n(i hope i didn't hurt anyone's feeling or their own view on this anime, as i told above this my view for anime i liked this anime mostly bcz of the Last some episodes of this anime.)",
            "date": "2018-09-30T18:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 290563,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=290563"
        },
        {
            "content": "Might contain light spoilers !!!\r\nSo, this review is for Beatless and its sequel Beatless final stage. I see them as one, so I write one review.\r\nBefore review and my opinion about it I have to say one thing, this anime isn’t that regular anime which you watch it has a lot of dialogue and sometime can be confusing. A lot of events which happens in first half may look stupid and unexplained. But in second half you get almost all answers.  So, what I mean you can’t just use 3 episode or any other rule here, because most of the time after 3 episodesyou are going to be confuse.\\n\r\nNow about anime itself.  This anime tries to explain a lot of thing it and is your decision if it answered your questions or not. The topics I would say very interesting starting from social engineering and finishing can robots have feelings. These topics might look they not belong for this time, but they are. I could write an example, but then I have to spoil the plot, so I won’t do it in order to keep this review spoiler free.  So, if you have any interest in technologies, engineering or you are the guy who likes dystopia world you should watch it. If you a person who looks for fighting between beautiful robots I recommend skip it, I don’t say it this anime don’t have it but watching just for that won’t be entertaining and would be waste of time.\\n\r\nAbout story I really don’t want to spoil a lot most what you need is in the synopsis, but I would like to add it. There is 5 hIE, made by Super AI Hinggins, with 5 different visions about a future. Kouka is future without any robots, Snowdrop future without humans, Saturn future as it is now, Methode future where humans use tools more efficient and Lacia where humans co-exist with machines. And each of them tries to make a future base on their own vision. \\n\r\nI could talk about characters, but I don’t see a point because each of as has their own opinion about them and review would be too long. I can say one thing try to imagine you are in their position what you do in that situation and then you see that their decisions don’t look that stupid.\\n\r\nMusic is very good. That electronic music makes this anime even more enjoyable. \\n\r\nAnimation. What I can say it is a little to cheap for these days and could be done better. Personally, I would like that team behind GC would done animating instead of Diomedea.\\n\r\nEnjoyment. Probably if you reach this section you already know that I love it. Just a few last words, looking to other reviews you see a lot of negativity about this anime, but it shouldn’t be the cause why you shouldn’t try and at least see how future world looks after 4th industry revolution, because I think it is closet vision what will happen in upcoming 40-50 years.\\n",
            "date": "2018-09-30T02:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 290467,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LTU_EiMs",
                "username": "LTU_EiMs"
            },
            "url": "https://myanimelist.net/reviews.php?id=290467"
        },
        {
            "content": "This anime is so average. \r\n\r\nPros:\r\n1. Upbeat OP song by Garnidelia and great Ed theme from ClariS\r\n2. The Sci-fi aspect of this series is very interesting\r\n3. Soundtracks suit the anime very well and are also very unique\r\nCons:\r\n1. Character designs are awfully boring. I mean just compare it to the novel, the anime stinks.\r\n2. Generic characters with little to no backstories. Why?\r\n3. No main plot after 8 episodes, srsly?\r\n4. Nothing captivating happened for 8 episodes. Each issue is solved with plot convenience. \r\n\r\nThis anime is so average. I first started watching this with the mindset of it being close to Plastic Memories or GuiltyCrown, but ohhhhh am I mistaken to a whole new level. This anime is so boring. Each episode I keep on hoping that a plot twist that I don't see coming will occur but no, every episode is plain and pointless.There's even a freakin' catwalk episode for no reason at all. I know if this is a Slice of Life anime then I won't care, but it isn't. It's a story focused anime. So, if its story didn't attract me, the heck should I even care. \\n\\n\r\nThe characters are the other worse part of the show. Each character is painfully generic. You can sum up their characteristic in only one word because that's how just much we learnt about them in the span of 8 episodes. No character development. No character drama. They are just there because the story needs them. Don't even get me started with their designs, so bad. I mean just compare it to the novel, the anime is just trash. I can already hear the disappointments from fellow Redjuice fans. Also, I don't usually complain about this but the characters also sound boring, it's like the VA's didn't even care at all. Well I can relate to them, who TF will even care voicing for an anime butchered like this? It won't even sell anyway.\\n\\n\r\nThe art is another downfall for this anime. Very bad. I can accept the background art, but it only stopped at that point. It didn't made me go full awe, it's just average. The animation, especially the battle animation, if not with the help of the music, will be pretty freakin' boring. It seems like novices animated them. \\n\\n\r\nNow going to the good part of the series. The music. No complaints at all. Definitely no. It's just that good. I like every soundtrack I listened in the anime, well maybe because other than that there's absolutely nothing to care about. The dub-step music is good. Every piece of music fits the series well. Highly suggest you to at least listen to it. The OP and ED theme sang by professional artists are both very good, but both the OP and ED sequence are just average. Guess this is the part they waste their money on...I am crying for the wasted potential of the series. \\n\\n\r\nAnother good point of this series is it's world building. It's interesting and unique. Too bad the creators decided not to give a damn shit in building up the world. Sad case man. I like the Sci-fi aspect of the show and I really really hope they can dive deeper into that. \\n\\n\r\nWell, in conclusion, I freakin' hate this anime, but I'll see it till the end just for the Pros I said just now, but I won't put too much hope into it. \\n\\n\r\nThanks for reading.",
            "date": "2018-03-17T23:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 274150,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=274150"
        },
        {
            "content": "Beatless tries to do a lot of different things and fails on most of them.\r\nTHE GOOD:\r\nArt style is pretty, Lacia the robot heroine is cute and has an interesting multi-layered personality (not 'just a tsundere' or 'just a kuudere' or 'just a genki type' girl). Yuka, MC's sister is fun too and brings some laughs.\r\nTHE BAD:\r\nMost of everything else. The anime is basically a story about \"can robots love?\" \"Can AI be considered 'real' ?\" \"Can robots have souls?\". However it also tries to veer into political commentary, this meanwhile trying to make us like the main characters and while all this is happening developinga romantic relationship between the MC and a robot girl that gets thrown on his lap.\\n\\n\r\nI think there have been multiple media pieces about the theme of \"can robots love? Is it true love or just a program?\" before. There are definitely many different anime shows about this theme as well, check Chobits for example.\\n\\n\r\nMy point is this series tries to do too much and doesn't manage to really land anything it tries as a result. I think this series was originally a light novel that is being adapted into anime form. As a result the anime is a rushed mess to display the characters and convince people to buy the books to see the better story.\\n\\n\r\nIn short there is a lot to dislike and not enough to keep me hooked. Also disappointed they're already giving us a recap episode after merely 5 (five!) episodes. This hints at production issues.\\n\\n\r\nThe plot is also all over the place. It's not hard to understand, it's inconsistent with horrible pacing, and it really shows after the first 3 episodes.\\n\\n\r\nTHE CONCLUSION - TL DR:\\n\\n\r\nThere is better stuff out there about the same themes Beatless tries to explore, key word being try. But if you're really starved for some new show Beatless probably is interesting on it's own to hold your attention, just don't go in expecting much. What is good and works won't be done enough to warrant a recommendation, and what doesn't work will undoubtedly stand out by the end of your viewing experience.",
            "date": "2018-02-19T05:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 271924,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6495381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TehMageKnight",
                "username": "TehMageKnight"
            },
            "url": "https://myanimelist.net/reviews.php?id=271924"
        }
    ],
    [
        {
            "content": "*This review contains some ugly words - such as fucking, robot-bitch, incest-curious and \"ugly\" - and may harm some viewers. Just like the anime did.*\r\n“When I was 5 years old, my mother always told me that happiness was the key to life. When I went to school, they asked me what I wanted to be when I grew up. I wrote down ‘happy’. They told me I didn’t understand the assignment, and I told them they didn’t understand life.” \r\n-John Lennon, The Beatles\r\nThe anime, Beatless, is often misunderstood in similar manner. This is a romance story between two real human beens, except the other oneis actually a non-human robot. From its core, Beatless is highly similar to some of the hottest clusterfucks known in memes. Especially from its sci-fi settings, it comes close to the sole worst anime series -at least in my opinion- Guilty Crown. However, there were GC failed to be ironic, Beatless did not. \\n\\n\r\nThe biggest mistake anyone does, is try and take this turd seriously. These guys made it very clear already in the terminological level that this thing is a joke. The big evil corporation in it was named MemeFrame. Like seriously, it's like meme macro but for characters, and clearly is parodying Ghost in the Shell's shells. Meme-effin-frame. How anyone can even write such comedy is beyond me.\\n\\n\r\nAratard, our main bro, is a real hero. Personality-wise, a typical nice guy, I musn't run away nerd with superior moral values. So naturally, he becomes the legal owner of this robot-bitch he falls in love with. Doesn't this type of ownership make him question his superior morals? No! Of course not. Such silly questions. Aratard is merely using the corrupt stand of the social system for his own benefit in the name of greater good! As we can see, he has already surpassed all superheroes there has ever been with his moral wits. \\n\\n\r\nOur robot-bitch (I refuse to call her by her real name because inanimate fucking objects, such as lakes (middle finger to all geography teachers here, btw) should not be rewarded a name) is a real waifu-material. In terms of lore, she does not have a soul, which makes her just perfect. Practically, she is a maid who does anything bro wants, and acts like the ideal SO (significant other) should. On top of that, she seems to be the prettiest and most faptastic girl in the universe, constantly followed by both guys and girls who want her. And she is yours! Oh wait, I mean Aratard's. The future is certainly bright. \\n\\n\r\nSome of our scenes are pure comedic gold. For example, during one supposedly badass fight scene, we hear some upbeat samba music while robot-bitches shoot missiles and rekt everything. Then, randomly, the music changes to some lackluster, emotional track -- made possibly by a guy who uses the synthesizer for the first time in their life. All seiyuu and background sounds get muted when this new track starts playing, followed by supposedly thought-provoking and sad monologue that manly reminds me of Morgan Freeman's character from The Shawshank Redemption. This scene is so try-hard, in-your face emotional that it can only be viewed as a parody, and I, for one, was laughing my ass off. \\n\\n\r\nThe pacing is comparable to a well-polished diamond. The great first encounter is on of the better things I have ever seen an anime to accomplish. Basically it went like this:\\n\\n\r\nRobot-bitch: yo\\n\r\nBro: hey\\n\r\nRobot-bitch: wanna get married?\\n\r\nBro: cool\\n\r\nIncest-curious imouto: let's have threesome\\n\\n\r\nThe worst part of this show is how robot-bitch's pussy won't work until her owner turns 18. Real tragedy right here. But hey, at least one legitimate reason to watch all episodes. \\n\\n\r\nProduction wise, there are two noteworthy things. From its art, Beatless looks like the combination of modern production + any nu-action shonen anime from the beginning of 21st century. Moreover, the OST is a real rarity for anime industry. Practically every song in it is or strongly reminds of NCS (NoCopyrightSound) releases of popular electro/house/dubstep songs you see with +20 million views on Youtube. This is not an insult, rather the OST works well. Kudos. The OST is also wide, so naturally some songs are worse than others. \\n\\n\r\nAs a conclusion. Beatless is the seasonal ironic masterpiece, and it should be watched by anyone who enjoys unwatchable trash. To others, there is nothing for you here.",
            "date": "2018-06-29T10:41:00+00:00",
            "helpful_count": 172,
            "mal_id": 282534,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282534"
        },
        {
            "content": "What is a recap episode?\r\nRecap episodes are the stuff that the creators put in because they either don’t have enough material to adapt further arcs of set anime or they want to have newcomers who are interested of watching set series to catch up. Unless you are a long-running anime that has 50+ episodes I find the recap episodes to be pointless and lazy because honestly why would you watch 20-minute clip show that summaries a couple of story arcs that very often leave out important stuff when you can easily go watch actual episodes themselves. \r\nWhat does this have to do with Beatless?\r\nBeatless isa perfect example of how to not run a producing schedule. The reason I'm saying this right out of the gate because if Beatless was done by any other studio it would have been function-able but because this show was done by Studio Diomedea who somehow have a worst record than fucking A1 Pictures this show was destined for failure from to become a massive failure. The show itself was poorly written crap from the very beginning and it’s only made worse thanks to shitty producing schedule with its horrid intermission episodes which by the way are RECAPS!!!\\n\\n\\n\r\nOne-hundred years into the future. A world in which society is mostly operated by humanoid robots called hIE. With the introduction of an ultra-advanced AI that surpasses human intelligence, beings that mankind is yet to fully comprehend made from materials far too advanced for human technology begin coming into being. Lacia, an hIE equipped with a black coffin-shaped device, is one of these. In boy-meets-girl fashion, 17-year-old Arato Endo has a fateful encounter with the artificial Lacia. For what purpose were these artificial beings created? Amid questions regarding the coexistence of these artificial beings and humans, a 17-year-old boy makes a decision…\\n\\n\r\nTo say that Beatless story is a mess is an understatement this is one of the worse executed and produced plots I ever heard the displeasure of watching.\\n\r\nFor starters, the story is very dull and boring for the most part. I didn’t care about many events in the story because I was bored with them and I thought they were poorly executed. It doesn’t help that many of the story elements in Beatless were done better in other anime before this.\\n\\n\r\nThe pacing in the show is terrible as lots of the events in the just seem to drag out way longer than they should make some of the actions scenes very boring to watch. Along with the shows horrible pacing, the direction is just abysmal. It’s Darling in the Franxx levels of bad where it rather wastes it’s time on tropey shit instead of establishing its own world and plot correctly.\\n\r\nIt doesn’t help that the fact that this show tries to be more big and complex than it actually is having the show takes itself too seriously with its themes, symbolism and heavy dialogue but it utterly fails thanks to this show horrible pacing, tone shifts and directing the show becomes very pretentious as a result.\\n\\n\r\nThe worst thing about this show that single-handy killed the show is the frequent intermission/recap episodes. For an anime that has 24 episodes this show has so many recap episodes it’s insane.\\n\r\nThese are recap episodes alone killed the pacing and narrative as it only makes the show even more insufferable to watch. The moment I saw intermission 4 pop up 2 episodes after intermission 3 I wanted to drop dead because how can a show have 2 episodes of barely anything happening and decided to have another intermission based on these episodes. \\n\r\nThe only good thing about the story is that it can be pretty funny at times other than that it’s a mess that is filled with so problems.\\n\\n\r\nNow if you thought the story was awful you haven’t seen anything yet because the characters are somehow even worse.\\n\\n\r\nOur main protagonist Arota is your typical naive character that we all seen before. He barely has any motivation at all and he just spends most of the series whining and being an incompetent idiot for the sake of it.\\n\\n\r\nLaica is an empty husk of a female lead. She barely any personality at all other to just serve Arota and be waifu bait for the audience.\\n\\n\r\nThe rest of the characters are just walking cliches like the Arota’s annoying sister little Yuka who is basically a walking Imouto, Ryo the edgy smart childhood friend character to the spunky hot-headed Kouka who despite being the most entertaining character in the series is still a very below average character at best.\\n\r\nIn short, the chararters in Beatless are just as bad as the story.\\n\\n\r\nMoving to the production side of things Beatless are at best very underwhelming especially for an anime from 2018\\n\r\nFor starters, the character designs of the anime are a big downgrade to the light novel where certain characters of the show are missing a lot of detail and polish. I know it’s not fair to compare the character designs from different mediums with each other but for this case, I couldn’t because the characters designs are a complete dumpster fire compare to the light novel counterparts. The best example of this was our protagonist Aroto where in the anime he looks like a typical nice boy while in light novel art he looks like more a serious threat.\\n\\n\r\nIt also doesn’t help the fact the character designs constancy goes off-model especially in the fights where the art constantly, for the most part, is at an all-time low.\\n\r\nThe background scenery is terrible and uninspiring to look at.\\n\r\nThe animation is below average at best as it has a lot of still frames, poor fight choreography at times and choppy movement.\\n\\n\\n\r\nIf there’s is any silver lining for Beatless that saved it from being a total crapfeash it would be the soundtrack\\n\r\nThe soundtrack is just a joy to listen as it perfectly captures the sci-fi setting well with its amazing use of dubstep and futuristic tracks that were played in this anime.\\n\r\nOpening 1 Error by GARNiDELia is a great and catchy opening theme that fits well with the first half of the series.\\n\r\nOpening 2 Truth.” by TrySail is amazing opening that I adore to death and it’s by far the best thing to come out from this anime.\\n\\n\r\nLike with the openings themes both ending themes are great and catchy especially the first one Primalove” by ClariS which is my favourite ending theme of 2018.\\n\r\nThe Seiyuus did a decent job with the roles that they were given and the overall acting is above average.\\n\r\nAt the anime of this review, Beatless hasn’t got an English Dub but then again why would anyone even bother picking up this series since the series was a failure.\\n\\n\r\nSo there you have it Beatless is a horrendous anime.\\n\r\nIt is likely one of the worst produced and scripted anime I have seen.\\n\r\nOther than the soundtrack and the kick-ass opening and ending themes there was not a single thing that I enjoyed about this show from it’s poorly executed plot, intermissions/recap episodes up the ass, shitty production values, stupid charterers and atrocious writing.\\n\r\nHowever, despite Beatless ended up being a train-wreck I will give the show this. Least you're not Darling In the Franxx.",
            "date": "2018-06-29T11:52:00+00:00",
            "helpful_count": 41,
            "mal_id": 282539,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=282539"
        },
        {
            "content": "Back when I started the show as it aired on January 13 I liked Beatless. It had coloured me with joy and anticipation since it's first episode went so well. Compared to the other anime I started at the time, it felt like it could do a lot with it's premise. Tut Tut. It went out like a light for the whole first half and took a while to set itself on track, and unfortunately not the same track as I felt in episode 1, but hey, it had a direction, so that's already better than FranXX. \r\nHaving said that, Beatless is far from perfect,despite throwing around it's ideology that robots do not make mistakes (and proving that wrong afterwards) it felt unnatural to see such robots (or hiEs if you may). The plot just kept on throwing random stuff at my face, sometimes Lacia is an idol taken straight from Aikatsu (Aikatsu Robot? Well that's redundant) and sometimes she's a fashion idol that makes Arato’s heart throb, not mine. Needless to say, it was inconsistent. It's inconsistent plot was evidenced in the first 7 weeks of it's run- I mean, episodes (will explain later) as it tried this thing or that. It began very badly after it's first episode and couldn't keep up till around episode 8 or 9 where it decided on one direction and stuck to it. How well that went is for us to judge, and my score can tell that enough. It was horrible in its first half. \\n\\n\r\nAside from these inconsistencies we also had the shocking revelation that the voice acting for a few actors was bad. Namely Shiori and Kengo. They sounded very much fake, or robotic if you love puns as much as I do. Shiori sounded like she was making her debut and failed at it (I will be very surprised if I find out this actually was her debut). But out with that, a huge problem with the anime was it's convenience. Whenever a convenient problem came, Arato conveniently solved it and conveniently everything went according to plan. Not the best thing to do to be honest. Apart from that as mentioned these random irrelevant plot points just came along and made the show feel like a cluttered up mess (trying not to jab at FranXX a second time here). Many times I felt irritated by the show not trying to focus properly on whatever the heck it wanted to be doing but alas, rarely did the rabbit go down it's respectful hole. \\n\\n\r\nMoving away from that we come to another massively irritating part of the anime, the villains. Or should I say whatever the heck they tried to be. Let's start with Ginga. Watarai Ginga had a lot of potential since he was the former partner of the creator of the Lacia-class hiEs and his backstory could have been done better, but unfortunately they screwed up what could have been a great backstory and instead, mowed him down in terms of development during the series. He felt plastic. Not unlike cliched shounen villains who have no purpose other than “to destroy”. It was pretty irritating to be able to predict when Ginga would come or what Ginga would do, and though that ultimately let him to his super-predictable defeat (in the most shounen way possible), that's not an excuse especially when that's who you painted as the real villain. But ok, you do you Beatless. \\n\\n\r\nAfter that predictable defeat someone had to take his role of villain and they brought out the randomly created and introduced Erika Burrows, which I think is the most Nippon Western name I could come up with, but anyway, apart from showing how cryogenics can be successful (that's a debate for another day) she proved that Beatless could get a worse villain than Ginga. Her actions were unexplained, her motives were set aside (“I want something interesting”? Pls, you're rich, go get a PC and play games or something) and the way the show painted her personality was far from what I could call decent. I already complained about Ginga, so this can explain how bad she is. You might say she's not a villain, but if that's indeed true, then she has absolutely NO use in this show since she'd just become a nobody. \\n\\n\r\nMethode was introduced as that proud hiE who can beat em up and has good taste in sunglasses (trust me, those sunglasses, I need them) but she was pretty much another cliched villain who didn't improve. Although she had the motives, the way she carried it out and her brief appearances altogether shunted the true potential of this Character as well, another character with wasted potential. Now we move from bad villains to bad characters overall, namely our idiot MC, Arato. Arato was your average cherry boy. Apart from predictably falling in love with a robot his actions were as he said it himself, idiotic and uncalculated. In episode 19, they revealed what was the point of this incalculable mess of a character but not in the way you'd hope to call decent yet again. \\n\\n\r\nThen we move over to the other hiEs, Kouka was the one with a hard on Onee-san fetish but in all honesty I was rooting for her. She was literally the only character in the show I liked and as such I lost my mind completely in episode 16. If you like Kouka too, her actions in episode 16 will leave you in a fit of rage, since it was unexplained, random and rage inducing. Snowdrop was shown as that Loli robot (great diversity Diomedea) who eats other robots to gain power and can make humans lose their sanity (?) and do weird stuff which was noticed in the first episode just before Arato was rescued by Lacia. To date, I've yet to understand what she was doing and why but eh, let's move on, the last hiE to cover (Methode was covered above) is Saturnus, describing her will be a lot like Erika Burrows, in that it's a bit of a spoiler, although she has nothing to do in the plot I can freely tell you without spoilers that she has no use at all in the plot. Satisfying the maid fetish fans might have (yet again, great diversity Diomedea), all she did apart from that is go “yes” and “let's do this” and “alright”. Those were 80% of her lines for the whole show. Underused? You betcha. \\n\\n\r\nNow since I've been spewing all the negatives, let's neutralise with something that is both positive and negative, the sound. First the good, the music was great, the synth tracks used made it only the second show to extensively use synth tracks for it's soundtrack and BGM this year and needless to say it was well done. The OP/EDs as well did not disappoint. Now here comes the bad. Too much focus was kept into the music to do great in the other places. Production and budgeting wasn't done well since it was all about making that soundtrack and licensing the music, sadly this killed off the budget to focus on the other parts and so ultimately led to the downfall of the anime. Speaking of production issues, THE DAMN RECAPS. We had around 4-5 recaps for this 24 episode show. Let that seep in. Should a show get this many? I say no. Why did this show have so many recaps? Budgeting? We'll perhaps never know, but point is, I don't want to have a recap episode thrown at my face after waiting for a week. It's frustrating. For those who are binge watching it as well, the episodes are part of the show so it gets really irritating to see the words “Recap Episode” show up in your news feed. It cuts off from the main action badly. Oh wait, that itself is a fault in the show. \\n\\n\r\nIt's transition from one scene to another is random and pretty much tiring to watch. I can't tell you how fed up I was of this. And let's not forget the fact that our Lacia-class hiEs were given absolutely NO SENSIBLE EXPLANATION. Apart from very minor dips into their backstories, the hiEs never had their purpose of creation explained apart from one line or the other, lines like “I'm created to help humanity move forward” isn't going to earn an excuse. You need proper explanation which sadly wasn't given. Now it's not all bad though. Apart from being my guilty pleasure of the year it did have good things in it. It's plot improved considerably in it's second half, which although wasn't obviously flawless, it was a nice improvement all the same, as a person who was pissed with the first half even the mediocre-decent bracket it was in felt good to me. \\n\\n\r\nAnother important thing is that despite it's recaps, Beatless wasn't a rushed show. I never felt that it was rushed most of the time and the pace was pretty good in itself since I could easily watch the show without getting too much information at once. Another important point is that Beatless tried to do something different with it's main heroine, Lacia. Since this showed it's true colours in the last quarter of the show I won't delve in so deeply but it tried to paint her character in it's complete opposite way she was presented to us ever since the show started had mixed results, surprising because I thought it would fall flat on its face. It was well done since it changed my whole opinion of the past episodes of the show and Lacia herself. Kind of like that FranXX episode 13 which made you go “oh so this is why all this happened”, only that, and please bear with me on this one, it was done much better than FranXX. \\n\\n\r\nIf you asked me to compare FranXX and Beatless’ first episodes, FranXX easily beat it but the answer is the complete opposite if you ask me their overall position. Yes. Beatless is better than FranXX. Despite it's crazed amount of stupidity, Beatless had a direction to follow. FranXX didn't. It took Beatless 7 episodes to find its purpose and the direction it should be following, FranXX on the other hand couldn't at all find what it wanted to do, it kept on changing every episode, therefore butchering it's consistency. If I talked to the Yasaal in January about this he'd have laughed me off the room because both shows certainly didn't show their true colours until later, FranXX with it's terrible attempts at relating to teenagers with a horrible consistency and Beatless’ lame cliches coupled with bad villains, constant recaps but a somewhat proper direction (?). They're close, but Beatless edges out FranXX. Why am I comparing the two? It's natural to compare two shows of a similar level. \\n\\n\r\nWhat started out as a guilty pleasure quickly turned into a show that made me impressed how a lame show can at least attempt at standing up and manage to somewhat achieve that. An E for Effort? You bet, might even give it a D+ if you like, because even though it had a lot of issues, Beatless was in itself a guilty pleasure to watch. Oh, and to satisfy all the fetishes with the hiEs, a responsible older partner (Lacia), the wild girl (Kouka), the proud girl (Methode), the Maid (Saturnus) and the Loli (Snowdrop), Diomedea, you sure have satisfied the fetishes. At this rate I might have a fetish of watching bad shows for guilty pleasure if I don't stop, but to Diomedea’s credit, Good Taste lads. Now we wait for the next few months till those last 4 episodes come out. How unclimactic...\\n\\n\r\nStory: 2.5\\n\r\nAnimation: 5.5\\n\r\nSound: 8 (Dat synth, dat expense on sound, dat BGM, dem OP/EDs)\\n\r\nCharacter: 1.5 (Solely because of Lacia last quarter and a few characters [Kouka] here and there is this not a zero)\\n\r\nEnjoyment: 4 (guilty pleasure and somewhat decent improvement in the second half compared to first)\\n\\n\r\nOverall: 4.3",
            "date": "2018-06-29T11:47:00+00:00",
            "helpful_count": 34,
            "mal_id": 282538,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=282538"
        },
        {
            "content": "Beatless\r\n\"I belive in your smile,i don't care even though it's soulless\"\r\nThis review is about robot-themed anime titled Beatless. Do you know robots? Yes, a robot is a machine that can move automatically or manually, essentially the robot is a machine. Ever thought or imagined that one day the world would be filled with robots that could help human work. Then what happens if the robot has its own feelings and thoughts so that he can make decisions like a human. Imagine the robot - the robot starts invading humans and takes over our lives, it is terrible not only hihih. Why am I talking aboutrobots, because this anime review is about future robots.\\n\\n\r\nFirst impression\\n\r\n\"I believe in your smile, I don't care even though it's soulless.\" The sentence is the first sentence that appears on the monitor screen. I can predict that later this anime will have a deep story line and touch the heart, remembering that anime that begins with sweet words is usually like that hehe.\\n\\n\r\nIn the first episode, there is a child who looks like the main character is watching a robot explode when the manufacturing process is in progress. The storyline that is very possible is that the robot and this child will meet again later in my mind. And it turned out that it was true that I thought, the story would dwell on the child and the robot.\\n\\n\r\nThere are robot fighting scenes against humans, and for the plot itself it can be predicted that in the final episodes the opponent that will be faced is a robot - this robot ... finished hehe. If I am the script writer, maybe one episode will go straight out, anime doesn't have to wait for one huahahah season.\\n\\n\r\nWhat is clear for the first impression I immediately assume that later this anime will have a lot of moral values ​​contained in it. Hehe, we'll see it until the end of the season.\\n\\n\r\nSynopsis and Storyline\\n\r\nThe background of this anime is the modern world of the 22nd century, where human life has relied heavily on robots called hIE in carrying out their daily work. Humans more often interact and coexist with hIE than with other humans. Although these hIEs are very similar to humans, the world thinks that robots are just a tool. But there is a boy named Endou Arato who thinks that the soulless machine is the same as those who have feelings. His meeting with the female hIE named Lacia was the beginning of this story. The threat from the robot who wants to take over the human world continues to haunt. Under these circumstances, what decision would Arato take?\\n\\n\r\nGraphics and Characters\\n\r\nFor the graphics themselves, I can say that I can really describe the state of the modern world, even though there are still many other anime whose portrayals are better but it doesn't matter, but the story also seems pretty good. The character for the hIE itself is pretty good, but the expression and inspiration is still not visible, well maybe it's still the initial episode so it can't be seen in its entirety.\\n\\n\r\nUniqueness in Anime\\n\r\nUsually we can see the storyline clearly from the first episode, but in the first episode of the anime the storyline is still not clearly visible, still vague. Who exactly is Lacia and what is the real purpose. Indeed, this might be a special attraction for an anime to maintain the curiosity of the audience so they can continue to watch every episode",
            "date": "2018-09-21T06:12:00+00:00",
            "helpful_count": 18,
            "mal_id": 289572,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=289572"
        },
        {
            "content": "Story:\r\nWho wrote this shit. Honestly, there are places where our as-expected beta-kun MC steps it up, but other than that - the imouto is the most obnoxious thing in the show. AND the ending is an imouto montage? The premise of the world is interesting enough, it explores like chobits the relationship a robot and human can have - sure, fine, that's fun and all. Lucia best girl bait - fine. But damn is the plot an incoherent mess where the character's motives are simply NOT EXPLAINED. And let's not mention ep 6 RECAP - EPISODE 6.\r\nArt:\r\nRedjuice - yeah I'm a redjuice fan boy, boughtRedBox, BEATLESS when it first came out, been following since Supercell feat. Miku days. \\n\\n\r\nSound:\\n\r\nOP - Garnidelia\\n\r\nED - ClariS\\n\r\nAND YET THE STORY STILL MANAGES TO DISAPPOINT - I wished it would be a Guilty Crown first half+, but no.\\n\\n\r\nCharacters:\\n\r\nMC - as expected\\n\r\nWaifu - I'm sorry Touyama Nao you had to sit through this writing.\\n\r\nImouto - please just stop\\n\r\nMC Friends - not enough development to understand their motives\\n\\n\r\nEnjoyment:\\n\r\nYeah... No... no more imouto\\n\\n\r\nOverall:\\n\r\nTrainwreck, maybe it'll get better ... \\n",
            "date": "2018-03-04T19:22:00+00:00",
            "helpful_count": 16,
            "mal_id": 273051,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4328621.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Finalitius",
                "username": "Finalitius"
            },
            "url": "https://myanimelist.net/reviews.php?id=273051"
        },
        {
            "content": "First off the music is 10/10 any ways lets get down to the rest. \r\nBeatless pretty much stands as an example saying redjuice can mess things up sadly since I was expecting something along guilty crown however thats not entirely what killed this show since the story does sound very promising but ill go ahead and blame this on the director. Take Mizushima Seiji out of this equation I don’t think you have a peg to hang your hat on, to be honest there were more cringe-worthy moments in the premiere than I can shake a stick at, and not all that much to makeone believe there’s something worth wading through them to get to. Beatless does have a very nice look to it, but its eerie resemblance to Guilty Crown is certainly unnerving, given what a debacle that show turned out to be.  There’s the nut of an interesting premise here, as played out as the exploration of A.I. having souls is.  However there’s a lot of formula and really offensive anime cliche, including one of the most unspeakably awful sister characters I’ve ever seen and honestly Ive seen alot.  Yuko may be a deal-breaker, that’s how bad she is but the other problem is that the two leads, Arato and Lacia, could not possibly be more of a trope than they are.  Doormat schoolboys and Rei Ayanami clones again, seriously?  If I’m going to put up with the really annoying otaku nonsense then this show should have been much better and right now I don’t see anything in Beatless with the potential to do it.  I've sat quietly for every episode and the latest two recaps were possibly some of the worst possible thing you could throw in a short series.",
            "date": "2018-03-30T17:34:00+00:00",
            "helpful_count": 15,
            "mal_id": 275803,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Khrys_Zeverilion",
                "username": "Khrys_Zeverilion"
            },
            "url": "https://myanimelist.net/reviews.php?id=275803"
        },
        {
            "content": "To be perfectly honest LA was drawn to Beatless because of Nao Touyama...\r\nIn a more serious note Beatless along with Toji no Miko had some of the shakiest pacing in animes from 2018, but Beatless didn't suffer from pacing issues...Beatless suffered from constant delays.\r\nThe thing is Beatless had ALOT of potential to be a good sci-fi anime though with it's very typical \"meet cute\" premise at the start with it's main character of Arato Endou voiced by Takuto Yoshinaga meeting the hIE Lacia voiced by the aforementioned Nao Touyama, Beatless was MUCH more than that and really disguising that starting premise into an introspective lookat technology, AI, human fears of technology and societal pressures to conformity because of it in some sense as well. But these interesting elements takes some time for it to be established but the build up and tension is apt for Beatless to do, so really LA doesn't mind the pacing in this anime, it's the outside forces focuses on Beatless' pacing is something else but that a bit later.\\n\\n\r\nBeatless in many ways takes Isaac Asimov's \"Three Laws of Robotics\" and both experiments with it's concepts as well as utter breaks it's rules concerning robotics. This considering Beatless' futuristic world where hIE's are mass produced working as either helpers or military might and Arato's world is one of those outlier people thinking that robots are more than just \"objects or machines\" for people to just use and through Arato's perspective we see Beatless' introspective look at robots are more than humans or not. So LA talked about what Beatless does with it's Isaac Asimov's \"Three Laws of Robotics\", but breaking it's rules?...well the rules of Isaac Asimov did entail that the robot may not injure a human being or, through inaction, allow a human being to come to harm, that a robot must obey orders given it by human beings except where such orders would conflict with the First Law and finally a robot must protect its own existence as long as such protection does not conflict with the First or Second Law and those rule breakers comes from in the form of the special rogue hIE's trying to find masters for their sole purpose of disrupting the social order of robots and humans in the process in which Lacia, Methode, Snowdrop, Saturnus and Kouka are all set out to do, but Lacia, our main heroine has other motives and with the help of Arato tries to achieve this, this is what makes it a VERY interesting anime.\\n\\n\r\nAs much as LA said there isn't pacing issues with Beatless, Beatless \"seems\" like it dwindles screentime on mundane things from time to time and MANY people might seem so maybe just to have some random exposition of the hIE's and how they program like \"analog hacking\" and the sorts but as much as exposition in this anime is VERY HEAVY and subtle to say the least (it makes sense as this was adapted from a novel thus the heavy exposition), Beatless KNOWS it's world building as it's consistently slow paced nature and exposition heavy it is, Beatless' execution is thorough and self-introspective of Beatess own world. Because of this along with the simple but greatly built up premise Beatless had going for it, all things considered, Beatless' complicated plot DOES make a lot of sense in the grand scheme of things that again Beatless had lots of potential it had going for.\\n\\n\r\nAnd if your thinking that the entire \"meet cute\" scenario of Lacia and Arato goes into a serious romantic subplot, well it does, but it really doesn't become the center focus of the anime at all, but more like it grows Lacia and Arato's relationship through all the trials and tribulations they go through to achieve their goal for the good of society. There are lots of shipping moments but their relationship feels strictly in the background unless needed with it's more serious major plotline that both are tied into.\\n\\n\r\nSo what made Beatless suffer soo much for Beatless to be a shaky anime and lose it's potential?...the recaps, and fine one recap episode is nothing to get annoyed by, but FOUR delays all spread throughout the early beginnings and halfway through the anime. Beatless was just plagued with delays as these four delays isn't enough, the \"final arc\" of Beatless has been delayed til September!. LA merely says this as Beatless had ALOT of plot twists and the such and for soo many delays and recaps leads to loss in traction and intensity of the plot it had ramped up, only for recaps to stop us in it's tracks and having to wait 2 weeks and the biggest one being that the final 4 episodes isn't coming out til after another season has passed in the time of writing this review...by then it's momentum died down. Sure maybe Beatless staff wanted to make it's finale perfect and for diomedea to keep it's consistent animation stable because of this and sure you can binge watch it again, but as a person who already knows what was going on, for it to stop when it was getting to great heights then kill off it's momentum is a major buzzkill to say the least. LA WILL watch the final 4 episodes as LA really liked where it was going but in terms of Beatless track record of delays this was something unprecedented in anime for LA that LA NEEDED to talk about. \\n\\n\r\nDoes this mean Beatless is unsalvageable because of it's constant delays?, no, as it's concept, strong world building and toying with Isaac Asimov's laws was greatly implemented in the form of anime along with interesting characters and plot doesn't discredit Beatless at all.\\n\\n\r\nSo into the element of Beatless itself...\\n\\n\r\nThe animation done by diomedea was actually pretty decent, from it's exotic character designs, futuristic yet urban city settings down pat along with HEY Beatless CAN do action scenes....well. LA will give diomedea props that it's animation was decently impressive to say the least with some less janky or derpy battles and though it's battles are mainly laserbeams or explosions, the action at the very least was fluid in some sense that it makes the battles decent animated as a result, but diomedea's strengths would definitely go to it's character designs. Overall Beatless' animation was decent at best and it's battles are a standard \"slightly\" above diomedea's norm though that isn't saying much.\\n\\n\r\nVoice acting, well if you read LA's first statement of this review and Nao Touyama is in this and though she's mainly monotoned with some spurts of deadpan serious vocals injected into her role as Lacia. LA found Nao Touyama's performance.....ok. Beatless has alot of great voice actors under it's belt, with Sora Amamiya doing a brash vocally-type character as Methode, Kana Hanazawa as the genki type character, Misako Tomoka as Kouka as the rebel, no shit taking hIE and Hiromi Igarashi doing her typical loli-type character with an air of childish malice to her. Takuto Yoshinaga was voiced the main protagonist Arato did fine but really Beatless' voice cast was great all round with some playing against the type while some only going greater as their preferred strong character role. By default though Nao Touyama gets LA's MVP...LA's bias LA knows but....LA doesn't care!\\n\\n\r\nBeatless maybe have been plagued with delays, it's heavy exposition got people out of it and away from the anime but for what Beatless had going for it, from Beatless' interesting concept of robots and AI and the talk of sentience with all this to it's interesting characters, decent animation from diomedea and a rather impressive voice cast, LA thinks Beatless DID deserve some backlash it got especially with it's delays but saying that Beatless is a terrible anime just because of that does not for LA, it's merely something of an excuse to make the anime look worse than it truly is and Beatless is much more than you realize in the long run. Beatless is introspective, it's detailed, it's many plot twists keeps you interested, it's character motivations and plans are interesting, it's world that Beatless built is interesting and it's basic premise turns that on it's head into something revolutionary for Beatless in terms of plot and it's characters.\\n\\n\r\nLook as much as LA points out the faults in Beatless and trust LA, LA got angry at Beatless from time to time too, but Beatless is still a good anime about robots and what it entails of sentience and humans fit into all this, it's just plagued with it's delays and being exposition heavy. \\n\\n\r\nLA will be waiting to see if the final arc of Beatless, Beatless: Final Stage and hope for a climactic finale with Lacia and Arato trying to reach their goal, but until then...LA will give Beatless a battered but hard earned \"decent anime\" status.",
            "date": "2018-06-29T15:13:00+00:00",
            "helpful_count": 7,
            "mal_id": 282557,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282557"
        },
        {
            "content": "We had mech shows throughout the years, and seeing something like Beatless felt like a breath of fresh air, because even though it was littered with humanized AI robots that are called hIEs that operate from the typical avant-garde AI system set in an dystopian world, the direction was great,,,but it's progression and execution went so drastically wrong.\r\nSo this was one of the first 2-cours that are laid out in the beginning of the year alongside Darling in the FranXX, Katana Maidens and the 2nd season of Nanatsu no Taizai, but in terms of engagement and excitement, none could be said further from the truthfrom FranXX, Taizai and this show to be the premier ones...until 6 months later, and look how everything went out: FranXX, despite its shift in views and controversies, STILL manages to glide along, Taizai Too remained consistent in the typical manga adaptation, and this show, a wreck in the making.\\n\\n\r\nIn the world of Beatless, it is set in an future where mankind exists in the form of technologically-able AI system called Higgins, which govern every robot-mankind hIEs just as you would expect of the future dystopian world. And in comes the elite: the Lacia-class type robots called Red Boxes, whom are very powerful as strong, able-bodied hIEs whom have been produced by the look-bad corporation at Memeframe, and exists in 5 flavours: Lacia, Methode, Kouka, Snowdrop and Saturnus, all who require owners in honouring T&Cs with their views that can be shared and realized, only if their owner warrants it. But more of less, its creator Watarai Ginga, the creator of the Red Boxes, soon labelled as the main perpetrator behind it all, is only given his exposition as the final boss to defeat after seeing his ownership with Snowdrop (to create an alternate world that is different from how Higgins would have governed the current time).\\n\\n\r\nBut much to the extent of the MC, Endou Arato, a plain-looking boy who has found his way into the situation of an equivalent of an analogue hack, something that is introduced with his encounter with Lacia, the 001-type class production that is said to be superior to the other Lacia-class/Red Box units, and therefore entrusting each other into a future that has yet to be written, and the story progression gets better...if not for a few hiccups.\\n\\n\r\nWith that said, the characters here...well, let's say that as much as they are human, they are tools that are used to further encapsulate the story as a whole, and probably their execution was somewhat underwhelming. \\n\\n\r\nStarting off with Arato, his sister Yuka and Lacia, this somewhat of a family whose father was the member of the large conglomerate of the Memeframe Corporation, who co-developed the Lacia-class units as something seen as a problem, but not until the fray when it happened that Arato is forced to cooperate with Lacia to create the future that is entrusted with his hope of a rebirth. But, back to the family side of things, and one of the first impressions that was striking was his whiner of a sis-con Yuka, whom tries to sweet-coat her brother (and later Lacia) into a loving family, but unfortunately her incompetency to judge the entire situation relegates her to the side-character status, and does so supporting her brother until the problem is resolved.\\n\\n\r\nArato on the other hand, was an nonchalant as a brother could be, with his split-second decisions that almost cost him his life several times, and dealing with a situation that's sitting on top of his head, undetermined but willing to trust and overcome issues with Lacia, the hIE whom has no soul, is using him as a guinea pig, and more importantly, the trust that both can create the future that he wants that she can make for him.\\n\\n\r\nComing over to Memeframe's side of things with bro-sis Ryou and Shiori Kaidai with the deadly Methode, this is a force not to be reckoned with. The task of executing Memeframe's ideals first fell into Shiori's hands (at the time when Ryou was doing his own stuff and encounters Methode), and with a somewhat confusing but clear execution, it first began as rivals between Methode and Lacia for fending off what was seen as the typical good vs. evil cliché that happens from time to time, to the large extent of building and protecting the future yet unseen. Shiori as expected, was not up to the task, abandoned by both her brother and Methode, and like Yuka, was demoted to side-character status-quo. Then once the older brother taken over, it's complete hayhem, and both him and Arato become bitter friends-turn-enemies as a result. Ryou as a character, he seems like he knows what he is doing, and is firm in his foundations, I have to respect him for that in the move that others cannot do, he has to initiate first-hand.\\n\\n\r\nOn the other hand, the already purpose-sent Kengo and Kouka have served their ideals well: Both are friends in co-relation towards one another (Kengo and Arato school classmates, Kouko and Lacia both sisters), but on the neutral side of things, further not warranted to engage in-between the helm of the situation. Sadly they are nothing much than side cheddar to support both Arato and Lacia in their world-building, but it's great that they do have at least some screentime dedicated to them to further enhance the plot when all is said but leave a dry taste in our mouths, and for one, I'm only excited when the duo come out to do something out of their comfort zone, because as much as they are support characters, their purpose is not only felt in the heat, but endless pursuement and determination is what keeps the duo alive, defeated but well.\\n\\n\r\nWatarai Ginga with Snowdrop in the palm of his hands, and Erica Burrows with Saturnus beside her are both bread and butter like characters, spectators that come out to show their prowess in defining the meaning of the future-yet spread-out world, but serve almost no meaning as to the coherent plot (well, only Ginga and Snowdrop did). At least Ginga had the ass to mass create Snowdrop with the intention to destroy Higgins and create his own diversified world, and where Erica took the \"one step forward, two steps back\" approach, sitting on her couch to see the ideal world being born, as much as they are supporting characters, the usefulness wears off as quick as it should, leaving their scenes empty most of the time.\\n\\n\r\nOverall, it felt like the characters are tied to each other, by coincidence or by fate, but blending into the story, it was just plain unjustified.\\n\\n\r\nDiomedea's VERY FIRST attempt into the 2-cour segment (not counting their previous sequel series)...was promising from the start, but a wholesome disaster to finish. The art style and animations are really OK at best, but what they did here with the endless 5/6-episode-count intermissions are just plain fricking self-explanatory, and serve no purpose at all if we're just seeking the usual 2-cour shows like we have here. IMO, I like recaps when done right (look at SAO: GGO Ep 5.5), but when you have a series that's THIS long and it has to fill with more than 2 intermissions, this goes to show that as much as the staff involved wanted to save the best for the last, this is the lazy, half-assed approach to a series that has been ongoing for months, and this travesty just isn't enough to save the detrimental value of the series as a whole.\\n\\n\r\nAnd well sadly, the music is always the high point of the series. Beginning with the 4 OPs and EDs that are done by different but highly-praised artists, they etch and stitch the series beautifully with OK to decent visuals of the representation of the series, and these songs are legit impressive on their own. The BGM is one area where I didn't think that it would implement on the low and high points of the series well, but it manages to pull off in whatever scenario it throws at it, thus making the series less stale than it is in the musicality department.\\n\\n\r\nIn the end, Beatless was a show that started out as a promise, but as the weeks and months passed, it was very clear to us that as much as it is praised for the ideas that it conceives, the relevancy was pretty much taken a backseat to the on-set turmoil of scenes and situations that while, makes sense, but it pounced on the pacing of the series, HARD. Execution was poor for a novel adaptation that was good, and even from the heavy competition from FranXX, it manages to hold off on its own, but lost steam and quickly become just a bore to watch.\\n\\n\r\nUnimpressively, wait till Summer/Fall for the final stage of the series due to the anti-climatic situation of the series to follow...will it be done? It depends...",
            "date": "2018-06-29T13:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 282545,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=282545"
        },
        {
            "content": "For many years people have thought and dreamt about the future of technology especially when it came to A.I. and robot, and what such things could possibly lead to.  It is a topic that has been talked about in almost every medium from live action movies such as “Ex Machina” and “Her”, written stories such as “Dream of Electric Sheep” and “Have No Mouth but Must Scream”, video games like “Neir” and “Detroit”, and even other anime such as “Ghost in The Shell” and “time of eve”. This is by no means a comparison of other works, but rather that the topic has beenexpounded upon multiple times and multiple directions. Now enter this anime that is about finding essence within the material especially the sentient kind, and whether something like that can have a “heart” without having a heart and thus is beatless.\\n\\n\r\nBeatless is set in some sort of future where A.I. and robots have advanced a long way with A.I.s, known as HIE, being a predominant part of society not only as private servants, but also being a part of the workforce as vendors, officers, and even idols. Of course with stories like this there is bound to be some conflict between the humans and the machines mostly with humans seeing them as nothing but tools that need no sympathy. However this is not true to our main protagonist because of kind personality is willing to help HIE’s despite the fact that they are machines. It’s a bit latter that through happenstance that he is saved from an attack by Lacia an HIE who becomes the heroine of the story. Lacia however is a special type of HIe who along with four other have escaped from a facility and are around and about the world. Arato is thus forced into a contract with Lacia in order to save his life and now both their lives are intertwined with one another.\\n\\n\r\nWhile a decent start, the majority of the story just comes off as uneventful. There are of course components at play during the course of the story such as the introduction of the other advance HIE”s, other side characters, and other factions coming into play, but none of them really have that much weight to the story. They more so pass along the show with a bunch of screen time, but no depth that makes them engaging. What seems as important parts of the story are shafted in by long boring dialogue by uninteresting characters, and then shafted out. There are plot twist and character heel turns that are meant to come off as surprising but no matter how it tries to present it through its visuals and audio, it’s how the narrative unfolded that gives it the lack of gravitas. There’s also conflict that is sprung about in the show, but it’s more for the sake of adding a false sense of drama and tension to the show so that it can be entertaining since it wasn’t able to do that with its story and characters. \\n\\n\r\nSpeaking of characters, they are as paperthin and uninteresting as they come. Arato the main protagonist is the typical nice guy protagonist of the story who is strung about the plot through other characters. It wouldn’t be a bad thing if it weren’t for the fact that not much comes from his character than his affection for lacia. There are moments when it seems like his character will grow, but it’s just him continuing being a reactive character than a proactive one. Lacia, well there’s not a lot to say other than she cares about Arato. There’s more than it seems about her, but like i said the way it folds out has little weight to the story and just comes off a uneventful. There’s also Arato’s sister who is just there, and who serves no purpose to the story other than taking up a lot of the screen time. Every Other character and antagonists are also just as one-dimensional and boring as them and just play through the motions of the story, well except maybe one. Kouka is probably the best thing about this show not because of her complexity but rather her personality and the way she’s presented that gives the show a sort of cheesy vibe to it even if it’s short lived because it would better to be cheesy than boring. \\n\\n\r\nVisually the show is baseline mediocrity and some decisions of the show do more harm than good to the show. When it comes to shows like this that there needs to be some way for the viewer to tell the difference between the humans and machines. It could be argued that they look to human to tell the difference, but it has been explicitly told that people can easily spot the difference and shown that people can easily tell and discriminate against them. There seemed to have been a moment that could have given the studio the benefit of the doubt if they used the cliche colorful eye and hair color to differentiate between humans and HIE since viewers have been used to almost everyone having colorful hair so only giving the HIE eccentric characteristic would have been a cheeky way to differentiate them. However that's quickly cast aside with the princess character having eccentric features and HIE having normal features, so there’s no real way to tell. The most they give to telling the difference is close up of lacia eyes and its visible circuitry and kouka with visible body lines. Everything else is just average with the background, animation, and character designs with only as much effort to at least be appealing to someone. \\n\\n\r\nThe audio for the show is good for the most part, i guess. The voice acting as a decent as it comes from most anime. Good performances from many of them but not much really stands out, the same for the sound effects. The soundtrack for the show is pretty good and has some variety to it. It doesn’t really elevate much for the scenes or characters (except kouka of course), and are just nice to listen to by themselves.\\n\\n\r\nThe production of the show seems to have been an utter mess because during the airing of the show there were about a handful of intermission/recap episodes. not sure how these merit into the quality of the show, but i think they are still worth talking about. There’s honestly no reason that a show should have so many recaps. It’s not like the show was that complex, maybe forgettable, but not complex and if it were their intentions than it comes off as patronizing. Maybe the other episodes weren’t finished and they used them to give them a chance to finish but then it just seems like terrible mismanagement and a lazy way to have something to at least show the audience. Or maybe it’s because they wanted that sweet 24 ep run time even though they had no content to make more. Nonetheless whether this did or didn’t affect the quality of the show it doesn’t change the fact of how bad the actual show is. However for me it does since the show just ends abruptly with the probable announcement of a sequel even though they could have used those 4 recap episodes to at least finish something. \\n\\n\r\nBeatless is just a lightly bad show, not excruciating bad, but boring bad due to how uneventful it all pans out to be. It has a running thematic via a concept known as analog hack of how people give essence to a material but it quickly turns from being insightful to a means for a plot device, and not only that but much of the characters feel like plot devices as well. It’s a show that chose the worst types of tropes and archetypes to work with, and just stagnates on them with no hopes in development. With an ending that really leads to nowhere as it promises to deliver in a later installment although what has been already shown doesn’t bode well for it. There could have been good ideas in this show but it’s bogged down in almost every possible way to serve to some group of low common denominator and by horrendous management.",
            "date": "2018-06-29T11:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 282537,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=282537"
        },
        {
            "content": "Anyone said Darling in the Franxx, some Tokyo Ghoul season 2, some Boku Hero 3, or some Tada-kun,... but with me Beatless is the best!! With OP1 sung by Garnidelia, most dancing inspiration band,  OP2 sung by TrySail, cutest singer of Jpop, ED1 sung by ClariS, my best Jpop couple singer and ED2 sung by Tokyo Performance Band, feel like under an area live, only the appearance of these four performs has made me confirm myself this is the best anime of two season XD\r\nDespite the fact that a lot problems while airing this anime, delay,... bad reviews,... I will still marked this asmy best anime ever due to the OST",
            "date": "2018-07-09T13:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 283558,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kaze2508",
                "username": "Kaze2508"
            },
            "url": "https://myanimelist.net/reviews.php?id=283558"
        },
        {
            "content": "[Spoiler Warning]\r\nLet me just keep this short and sweet:\r\nThe MC's stupidity, shallowness, short-sightedness, failure to understand the ramifications of what his actions are causing, coupled with his wimpy sounding voice actor (VA): Pisses. Me. Off.\r\nYou might ask why am I sticking through this ordeal. Reason is simple: The books ended when the MC said to Lacia that he will not join her after learning she evolved to super-intelligent AI status. I'm simply curious on how the ending would turn out to be.\r\nThe execution was a pile of hot mess as well. The cinematography, the art of the anime, the sound effects all felt cheap, generic,and overused.\\n\\n\r\nBut it all boils down to this primary reason on why I'm rating this show a shiny score of \"1\": This pushover of a MC with his lack of critical thinking skills who enjoys being led around the nose by a pair of android tits, hands down the most pathetic anime MC I've ever witnessed. The studio also couldn't had done a better job of finding the most pathetic sounding VA to couple with this fool.\\n\\n\r\nConcept art was by Redjuice, which was awesome. Main reason why I checked this show out in the first place.",
            "date": "2018-06-25T05:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 282156,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/167820.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/dutchman_227",
                "username": "dutchman_227"
            },
            "url": "https://myanimelist.net/reviews.php?id=282156"
        },
        {
            "content": "This anime for those who need to know let me say this honestly after watching it about 11 out of 24 episodes since the other two is just the intermission series like recap series. Due to that my judgment may change in time.\r\nThis anime best point is logic and facts of how the future will be so if you think it's boring then it may be the same kinda boring while listening to the teacher but please care to focus on them cause their way of talk is in the top 10% of smart anime type.\r\nI'm not even lying this kinda logic hit on thetop 10%. Also, their way of talk can some point reach to university lv so you may end up being like \"WTF is going on?\"\\n\\n\r\nTo be honest I love this show due to that. Also, the MC is base on a real average human so if you think that guy is dumb? Look at yourself and think what will you do in his shoe...\\n\r\nI bet it will end up like him with the best outcome... It will be even dumber if the MC is a normal human then go like \"Oh I grant a power of the overlord!!! HAAAAAAAA!!!\"\\n\r\nLike wow... That's dumb for an average human in the Sci-Fi world with no fantasy in it...\\n\r\nRemember read the tags closely...\\n\r\nThere's no fantasy in the tags so don't expect that too much. If you watch this? Watch it for logic.\\n\\n\r\nEverything all base on \"logic\"\\n\\n\r\nIt seems many people just misunderstand it and watch it for action...\\n\r\nWhat I said is about how this anime will be.\\n\r\nLike no plot armor or OP mc. Only with the Sci-Fi in a scientific way. Like AI may surpass human and how the AI will react while using the cloud database. Like how the internet is to search for the best result. Their way of talk is just expending it to the university lv. I think you may not understand the meaning of what I'm trying to say.\\n\\n\r\nI just love how this anime using only pure logic. I won't try to say more than this cause it will be spoilers.\\n\r\nIn this anime it made you question a lot of things like scientist do with how they explain about AI or technology.\\n\\n\r\nI will say that the story is amazing done 9/10. The art style just goes so well with the story but not good enough cause the action doesn't seem like to be at it's best for the story yet so I will give it 8/10. For the sound? It kinda like a normal but the OP is so good so when I math that it will be 7/10. As for the character will be kinda normal and interesting at the same time so it will be just 7/10 stand for just good. As for my enjoyment? I will say I really enjoy it so much. I just love to question everything so this is the kinda anime I love so 9/10.\\n\\n\r\nWhen I math all the score the overlay will be 8/10 but like I say my judgment may change if they either mess up or make it better cause this is right now at the middle of the series so things may get interesting...",
            "date": "2018-04-07T00:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 277201,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4677224.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/InfinityKiyen",
                "username": "InfinityKiyen"
            },
            "url": "https://myanimelist.net/reviews.php?id=277201"
        },
        {
            "content": "In short:\r\nThere are elements of genius in this anime, but it isn't well executed for most people's expectations of anime. It's worth watching and especially so for individuals that like to think about our future as a society and the problems we are going to face.\r\nMore:\r\nYou watch this anime for it's ideas mostly, anything else surrounding those ideas isn't so good.\r\nThe anime is about the dilemma we face concerning our future with robots and AI, it uses unique ideas since most anime like this have one super AI trying to take over, where this one lets AI battle themselves and it makes for a moreinteresting story-backbone overall.\\n\\n\r\nYou'll definitely get triggered and ask yourself why they didn't just kill that person, and according to some abilities of the characters this whole story could've ended much sooner.. but i guess we can't have the perfect anime and we can only hope the creators can learn from their mistakes.\\n\\n\r\nThe concept of \"analog hacking\" is an interesting one, i wouldn't really have thought of something like this and would rather have envisioned a physical AI takeover like in most anime, it's thought provoking and i think they designed this anime to share their view, which is why they are adding three recap episodes.\\n\\n\r\nThis anime takes itself seriously, \"Memeframe\" was chosen because there is another definition for the word \"meme\" that fits the company name more than perfectly.\\n\\n\r\nmeme\\n\r\nnoun\\n\r\n1.\\n\r\nan element of a culture or system of behaviour passed from one individual to another by imitation or other non-genetic means.\\n\r\n2.\\n\r\nan image, video, piece of text, etc., typically humorous in nature, that is copied and spread rapidly by Internet users, often with slight variations.\\n\\n",
            "date": "2018-07-19T14:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 284340,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeuroTypicalCure",
                "username": "NeuroTypicalCure"
            },
            "url": "https://myanimelist.net/reviews.php?id=284340"
        },
        {
            "content": "Ultimately, after binge watching this, I have no idea why this show is rated as low as it is.  The best way I can describe this show is it's an Anime* Bladerunner that's more optimistic(?) about the future. (Anime* because it has a lot of common tropes that could be tiresome, but I didn't mind.)    \r\nIf you can get over any of the minor complaints about the visuals or some of characters being annoying, this series is Packed with theories and philosophy.  It juggles around complex ideas well, especially the concepts of hypocrisy that society is creating for itself.If you love asking the question: what makes a human truly human? or the Turning Test, this is a must see.    \\n\\n\r\nMy biggest complaint is that they seem to have a few scenes out of order, probably in order to create further mystery/suspense (which normally is handled well, but noticeable in a few instances).  Or worse, when they blindside the audience by throwing in a major character interaction without any warning & expecting the viewer to just get it  (the first seconds of Episode 3...).  But once I could wrap my head around the scene after having to rematch it, it made sense, but it felt like I missed an entire episode. \\n\\n\r\nSame goes for the beginning of episode 10.  It feels more like a an abridged joke:\\n\r\nLacia: Oh crap! Someone else has an identical serial number to me!\\n\r\nArato: Uhh, that's bad?\\n\r\nL: That's bad.\\n\r\nA: We should do something then!\\n\r\nL: I agree! Here's the pla-\\n\r\nA: No time to explain, LETS GO!\\n\r\nL: RIGHT!\\n\r\n*cue 60's Batman theme song*\\n\\n\r\nIn short, if something wasn't explained the first time you hear about it in the show, it will be explained late. (Except for \"Diet\" I think....) Annoying, but I personally got over it using humor.         \\n\\n\r\nAlso, as other's have mentioned, the recap episodes are annoying, Especially since episode 11 has some content not in the other episodes. I really hope the reason behind making, (and spending money on,) those recap episodes wasn't an attempt to try and hammer out the deeper ideas in case you missed something previously. Because in that regard, they don't do their job as you miss a lot of the nuance of the show. Alternatively, if these episodes were just to meet a quota, then I would be disappointed that they didn't flesh out more details over more episodes as this show really has a lot to say.    \\n\\n\r\nTo end my ranting, it can be a lot to take in as there's a lot of dialogue, which I could see being a problem for some people who want more action.  Stick with it and I assure you that you won't be disappointed with its depth of ideas, and yes, there plenty of fighting too.",
            "date": "2018-05-24T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 281314,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/helixninja",
                "username": "helixninja"
            },
            "url": "https://myanimelist.net/reviews.php?id=281314"
        },
        {
            "content": "Effects of synthesizing human intelligence due to expressing amount of emotions may considered to be just a petty schmuck cardboard detail. Let alone it brings no utterly sense of redeeming plot that tells within poor cringe setting apart it's memoir caricature. \r\nPretty sure, you won't expect anything usual besides it's turmoil humor other than the premises, Besides every visuals where too shiny more than came from a cheap third-rate crap. Along the details, Stories we're out linear on set of timing, characters we're too one dimensional with also had a self inserted whiny BETA c*ck, who regains her former fapping doll as his personal guest.Referring to viewers who's state on early depression, that depicts your inner epitome of life looking how bad it is. Nothing's casually way more worthless than an edgy satirical degenerate that transcends into a detestable c*nt.\\n\\n\r\nThere is NO well written gaps as on crossing a boundary between sub interior to deepen as well it keeps a shallow truth that lies on behalf mindsets. A balance we're indeed forced by contradicting uncountable amount of plotholes and fed up horrible pacing that intends to be left through it's current aspects of the whole show. \\n\\n\r\nOh look? a Former REDJUICE design coming from it's new ver. or indeed the new Guilty Crown mixed up with a lot of overly innuendo on Clockwork Planet. Which is an absolute trainwreck. Feel free to judge this simulator vile concepts cause it's beyond nauseating which includes in the trash.",
            "date": "2018-04-29T23:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 279376,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6174494.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/-HippySnob-",
                "username": "-HippySnob-"
            },
            "url": "https://myanimelist.net/reviews.php?id=279376"
        },
        {
            "content": "This review includes the final stage of this series. First of all i'm reluctant to watch this Anime due to its low scores and some bad reviews however because i'm a fan of AI/Machine i still give it a shot because of its synopsis. \r\nStory: The story was all about artificial intelligent, which is great since we all know that the world is moving towards the directions of AI/Machine Learning/Cloud Computing and etc. Now for the story. The story was really unique in my own opinion; while this might not be the first anime to cover about AI, it's the only Anime i personally seewhich was able to tell its purpose to its viewers, of how corrupt humans can be in order to gained power in society. The Anime was also able to sent its message that sooner or later manual labor will cease to exist as machines are now capable of doing the same work as humans and to be more precise machines can finish all its task with given time as long as there's power running on it, not to mention its accuracy at its job. its also raises my awareness to question myself what makes humans differs from machines who doesn't have soul and heart? story is 10/10 for me.\\n\r\nArt: Nothing to say here Lacia  is beautiful <3 i totally get why she become so popular in the society. 10/10\\n\r\nSound: The sound were fantastic...nope its actually amazing. the lyrics of the song were really for this anime specially the opening 2 (truth) where one lyrics is \"Humans are just a visible shape\". 10/10\\n\r\nEnjoyment: As a person interested in AI/Machine learning i can pretty say that i enjoy this a lot, to the point i feel not contented of how short the episodes this Anime had.\\n\r\nOverall: Beatless was my cup of tea. so nothing to say here anymore 10/10",
            "date": "2019-04-19T11:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 306682,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6371698.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/curisuchan",
                "username": "curisuchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=306682"
        },
        {
            "content": "*Might Contain Spoiler*\r\nwell this story is something different, sci-fi with romance but in this way never thought this is even possible for human to love android, well of-course its possible if a human can understand a human than what the problem with a android.\r\ni don't know how many people watched this anime and how many of them able to understand it, well its same goes for me, i just like to clear it, i also didn't understood this anime completely but whatever i understood, its my view.\r\n (to use \"machine\" word, in my view it like im disrespecting the android in this anime and usingthe \"he\" and \"she\" instead of \"It\")\\n\\n\r\nthe story was little complicated and was hard to understand until you focus well i think not the story but explanation in anime, well i tried my hard to understand this one bcz this story really took my attention, a romance story between a android Lacia and a human Arato who are trying to change future where human and android (AI) can coexists. And in the last 4 episode in Beatless Final Stage the truth was revealed that it was the predicted future by the Higgins (S-AI), he was trying to save himself from his destruction in future and released the 5 AIs in order to change a future.\\n\r\nwell sometime in anime i was lost but i still able to grasp the story :p\\n\r\nwell i don't know this kind of future or this kind of world is possible or not but i think its possible to find the happiness in all this things. \\n\r\nand that's what was going on here Arato fall in love with Lacia even if she is android and he supported her. and Lacia the 40th S-AI tried her best to predict the future and others moves in order to make the ideal future they were thinking in order to coexist with humans. and as they move forward things got worse sometime but she still helped Arato, bcz it was the trust they had for each other that helped them to move forward.\\n\\n\r\nin my view i think this anime is good example for humans to coexist with non-human beings if possible.\\n\\n\r\nStory :\\n\r\nwell basically i explained everything up there so not much left here to write but still like to point somethings well i said above that story was kind of hard to understand so it might be possible that many people have dropped this anime and the the many who completed it, they might will understand the story :D that what it actually trying to say :D and for that\\n\r\n9/10 \\n\\n\r\nArt : \\n\r\nnot much to say in this part but they really did some work in art the OP songs scenes are really good and the art in anime is really good, animations were amazing. and not forget to mention the characters all were so good.\\n\r\n10/10\\n\\n\r\nSounds : \\n\r\nSound were good, then the background sounds in anime and i also like the background sound of Snowdrop. And as for OP and ED , both OP songs are really good, i liked both OP songs than the ED songs.\\n\r\n10/10\\n\\n\r\nCharacter :\\n\r\nThere are so many characters in this anime but some of them left heavy impression on anime and one of them is Kouka i like this character but it doesnt mean that Lacia is left behind bcz Lacia is damm amazing she is be able to do so many things just by predicting what will happen next, dammm that's the S-AI for sure. \\n\r\n10/10\\n\\n\r\nEnjoyment :\\n\r\nwell as for enjoyment, what i enjoyed the most was both OP than, as for anime yes no doubt it was really good but some time i was feeling pissed bcz of his friend Kaidai Ryou who was interfering without knowing properly whats happening and why Lacia was doing those things.\\n\r\nby putting this aside i enjoyed rest of the anime.\\n\r\n9/10\\n\\n\r\nOverall :\\n\r\nas for overall nothing much left to write but they could have made anime in a way in which it could be more understandable easily.\\n\r\n9/10\\n\\n\r\n(i hope i didn't hurt anyone's feeling or their own view on this anime, as i told above this my view for anime i liked this anime mostly bcz of the Last some episodes of this anime.)",
            "date": "2018-09-30T18:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 290563,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=290563"
        },
        {
            "content": "Might contain light spoilers !!!\r\nSo, this review is for Beatless and its sequel Beatless final stage. I see them as one, so I write one review.\r\nBefore review and my opinion about it I have to say one thing, this anime isn’t that regular anime which you watch it has a lot of dialogue and sometime can be confusing. A lot of events which happens in first half may look stupid and unexplained. But in second half you get almost all answers.  So, what I mean you can’t just use 3 episode or any other rule here, because most of the time after 3 episodesyou are going to be confuse.\\n\r\nNow about anime itself.  This anime tries to explain a lot of thing it and is your decision if it answered your questions or not. The topics I would say very interesting starting from social engineering and finishing can robots have feelings. These topics might look they not belong for this time, but they are. I could write an example, but then I have to spoil the plot, so I won’t do it in order to keep this review spoiler free.  So, if you have any interest in technologies, engineering or you are the guy who likes dystopia world you should watch it. If you a person who looks for fighting between beautiful robots I recommend skip it, I don’t say it this anime don’t have it but watching just for that won’t be entertaining and would be waste of time.\\n\r\nAbout story I really don’t want to spoil a lot most what you need is in the synopsis, but I would like to add it. There is 5 hIE, made by Super AI Hinggins, with 5 different visions about a future. Kouka is future without any robots, Snowdrop future without humans, Saturn future as it is now, Methode future where humans use tools more efficient and Lacia where humans co-exist with machines. And each of them tries to make a future base on their own vision. \\n\r\nI could talk about characters, but I don’t see a point because each of as has their own opinion about them and review would be too long. I can say one thing try to imagine you are in their position what you do in that situation and then you see that their decisions don’t look that stupid.\\n\r\nMusic is very good. That electronic music makes this anime even more enjoyable. \\n\r\nAnimation. What I can say it is a little to cheap for these days and could be done better. Personally, I would like that team behind GC would done animating instead of Diomedea.\\n\r\nEnjoyment. Probably if you reach this section you already know that I love it. Just a few last words, looking to other reviews you see a lot of negativity about this anime, but it shouldn’t be the cause why you shouldn’t try and at least see how future world looks after 4th industry revolution, because I think it is closet vision what will happen in upcoming 40-50 years.\\n",
            "date": "2018-09-30T02:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 290467,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LTU_EiMs",
                "username": "LTU_EiMs"
            },
            "url": "https://myanimelist.net/reviews.php?id=290467"
        },
        {
            "content": "This anime is so average. \r\n\r\nPros:\r\n1. Upbeat OP song by Garnidelia and great Ed theme from ClariS\r\n2. The Sci-fi aspect of this series is very interesting\r\n3. Soundtracks suit the anime very well and are also very unique\r\nCons:\r\n1. Character designs are awfully boring. I mean just compare it to the novel, the anime stinks.\r\n2. Generic characters with little to no backstories. Why?\r\n3. No main plot after 8 episodes, srsly?\r\n4. Nothing captivating happened for 8 episodes. Each issue is solved with plot convenience. \r\n\r\nThis anime is so average. I first started watching this with the mindset of it being close to Plastic Memories or GuiltyCrown, but ohhhhh am I mistaken to a whole new level. This anime is so boring. Each episode I keep on hoping that a plot twist that I don't see coming will occur but no, every episode is plain and pointless.There's even a freakin' catwalk episode for no reason at all. I know if this is a Slice of Life anime then I won't care, but it isn't. It's a story focused anime. So, if its story didn't attract me, the heck should I even care. \\n\\n\r\nThe characters are the other worse part of the show. Each character is painfully generic. You can sum up their characteristic in only one word because that's how just much we learnt about them in the span of 8 episodes. No character development. No character drama. They are just there because the story needs them. Don't even get me started with their designs, so bad. I mean just compare it to the novel, the anime is just trash. I can already hear the disappointments from fellow Redjuice fans. Also, I don't usually complain about this but the characters also sound boring, it's like the VA's didn't even care at all. Well I can relate to them, who TF will even care voicing for an anime butchered like this? It won't even sell anyway.\\n\\n\r\nThe art is another downfall for this anime. Very bad. I can accept the background art, but it only stopped at that point. It didn't made me go full awe, it's just average. The animation, especially the battle animation, if not with the help of the music, will be pretty freakin' boring. It seems like novices animated them. \\n\\n\r\nNow going to the good part of the series. The music. No complaints at all. Definitely no. It's just that good. I like every soundtrack I listened in the anime, well maybe because other than that there's absolutely nothing to care about. The dub-step music is good. Every piece of music fits the series well. Highly suggest you to at least listen to it. The OP and ED theme sang by professional artists are both very good, but both the OP and ED sequence are just average. Guess this is the part they waste their money on...I am crying for the wasted potential of the series. \\n\\n\r\nAnother good point of this series is it's world building. It's interesting and unique. Too bad the creators decided not to give a damn shit in building up the world. Sad case man. I like the Sci-fi aspect of the show and I really really hope they can dive deeper into that. \\n\\n\r\nWell, in conclusion, I freakin' hate this anime, but I'll see it till the end just for the Pros I said just now, but I won't put too much hope into it. \\n\\n\r\nThanks for reading.",
            "date": "2018-03-17T23:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 274150,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=274150"
        },
        {
            "content": "Beatless tries to do a lot of different things and fails on most of them.\r\nTHE GOOD:\r\nArt style is pretty, Lacia the robot heroine is cute and has an interesting multi-layered personality (not 'just a tsundere' or 'just a kuudere' or 'just a genki type' girl). Yuka, MC's sister is fun too and brings some laughs.\r\nTHE BAD:\r\nMost of everything else. The anime is basically a story about \"can robots love?\" \"Can AI be considered 'real' ?\" \"Can robots have souls?\". However it also tries to veer into political commentary, this meanwhile trying to make us like the main characters and while all this is happening developinga romantic relationship between the MC and a robot girl that gets thrown on his lap.\\n\\n\r\nI think there have been multiple media pieces about the theme of \"can robots love? Is it true love or just a program?\" before. There are definitely many different anime shows about this theme as well, check Chobits for example.\\n\\n\r\nMy point is this series tries to do too much and doesn't manage to really land anything it tries as a result. I think this series was originally a light novel that is being adapted into anime form. As a result the anime is a rushed mess to display the characters and convince people to buy the books to see the better story.\\n\\n\r\nIn short there is a lot to dislike and not enough to keep me hooked. Also disappointed they're already giving us a recap episode after merely 5 (five!) episodes. This hints at production issues.\\n\\n\r\nThe plot is also all over the place. It's not hard to understand, it's inconsistent with horrible pacing, and it really shows after the first 3 episodes.\\n\\n\r\nTHE CONCLUSION - TL DR:\\n\\n\r\nThere is better stuff out there about the same themes Beatless tries to explore, key word being try. But if you're really starved for some new show Beatless probably is interesting on it's own to hold your attention, just don't go in expecting much. What is good and works won't be done enough to warrant a recommendation, and what doesn't work will undoubtedly stand out by the end of your viewing experience.",
            "date": "2018-02-19T05:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 271924,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6495381.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TehMageKnight",
                "username": "TehMageKnight"
            },
            "url": "https://myanimelist.net/reviews.php?id=271924"
        }
    ],
    [
        {
            "content": "This anime is like a debate trying to prove the earth is flat, except with robot rights. It's a pointless debate but, sometimes it can sound convincing with the right circumstances. However, Beatless does not do any convincing. The characters are sooo bland and idiotic that they make any semblance of an argument invalid. The political figures and politics are so laughable as they make no logical sense. This leads to an uninteresting world and makes it hard to watch. On the other hand, Beatless has a solid ost with decent artwork which makes it watchable, but is unable to carry its terrible script andcharacters.  \\n\\n\r\nOverall, this anime tries to be somewhat serious but falls on its face hard. The comedy also is pretty cringeworthy and doesn't accomplish much. Characters constantly make bad decisions to push a illogical narrative and motivations are unclear from the start. \\n\\n\r\n4/10",
            "date": "2019-03-21T13:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 303985,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Ausun",
                "username": "Ausun"
            },
            "url": "https://myanimelist.net/reviews.php?id=303985"
        },
        {
            "content": "Beatless is not about robo bitches (or mechanical waifus) but about Brainless studio, writers and artists.\r\nIf you love tasteless fan service with lame characters and unbearable plot, this crap is for you.\r\nBut I won't give a 0/10 but instead aq 5/10 because this anime helped me learn a lot:\r\n1-Even the guy that directed the first FMA can make absolute CRAP\r\n2-Diomedea is CANCER\r\n3-An anime can be dropped when the plot gets interesting (because it is plain retard)\r\nBut it was not meant to be bad. Even if not original, and even if the execution failed miserably, the story is compelling, should have been at least enjoyable, butit was not.\\n\\n\r\nWhat went wrong? Lazy 2nd key and in between animation, a lot of argument mistakes of continuity and plot writing, very poor script and very lame characters.\\n\\n\r\nI think, this could have been a very good seasonal ecchi anime, but even if it does not take itself seriously, you can make a very decent job with at least very smart writing.\\n\\n\r\nFor example, take Sora no Otoshimono. Is not a \"good\" anime, it does not take itself seriously (except when battle wise as this should have been), but is very enjoyable, is funny and characters even if cliche are very nice. In this, Beatless failed miserably. Bad Sci-fi, terrible argument and not even enjoyable characters.",
            "date": "2018-09-29T22:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 290457,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5195010.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/erparom",
                "username": "erparom"
            },
            "url": "https://myanimelist.net/reviews.php?id=290457"
        },
        {
            "content": "Overall: 6\r\nThis anime falls solidly under the category of \"good but not that good.\" Its best attribute was its conceptual basis: the battle between both AI and humans with different ideas for their future. However the execution was pretty lackluster, with terrible pacing at times and a number of scenes that just fell flat. \r\nStory: 7\r\nThe concepts here aren't new or unique in any way; Chobits explored the issue of human-AI relationships over a decade and a half ago, and more recently a similar conflict was explored in Detroit: Become Human. However, Beatless combines this human-robot identity crisis with political and social issues to spina much more complex and nuanced web of clashing ideals. Instead of the usual dichotomous pro- and anti-bot factions duking it out, we get seven different AI's and at least seven more human factions engaged in both direct and indirect conflict. And while I do have some complaints about the execution, Beatless did a pretty good job of not being too confusing. Also, Arato's philosophy was refreshingly straightforward and a bit different from anything else I've seen in fiction. \\n\r\nMy biggest complaint about the pacing is probably with regards to the relationship between Lacia and Arato. At some points, especially near the beginning and the end, new developments came in rapid-fire, while at other times it felt like it was becoming stagnant. The pacing was also pretty bad in terms of the appearances of Arato's two best buds, to the point where I lost track of who was who because I honestly just forgot that one of them existed by the time he showed up again.\\n\\n\r\nArt: 6\\n\r\nThere wasn't much special about the animation. I gave it a point above average because it had less noticeably bad CGI than most, and the use of colors and physical traits to make the different AIs very distinct was pretty good.\\n\\n\r\nSound: 5\\n\r\nAn average soundtrack to me is one where you don't really remember anything about it, except for just a small number of times where it sounded a bit off from what was going off.\\n\\n\r\nCharacter: 7\\n\r\nIn order to keep track of 14+ different humans and AI with different ideals, the characters must be fairly well done so it's easy to distinguish between them and keep track of who's who. Beatless did a pretty good job with this. I also particularly liked Arato's character because of his unique stance on hIE's, which I can totally get behind. However, some of the supporting cast seemed pretty meaningless and superficial, especially Arato's and Kengo's sisters. \\n\\n\r\nEnjoyment: 6\\n\r\nI found the anime just good enough to want to keep watching, but I never really got hooked. The first two episodes almost did, but just knowing that I'd have to sit through another 16 episodes to get anywhere was pretty off-putting.",
            "date": "2018-07-23T01:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 284573,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mvhcmaniac",
                "username": "mvhcmaniac"
            },
            "url": "https://myanimelist.net/reviews.php?id=284573"
        },
        {
            "content": "Well. What did I just watch.\r\nBeatless is an anime that tries to do so much more, but just... can't. It's a mix and match of so many different other anime, takes the bad things from them at puts them. Its similarity with the infamous Guilty Crown is uncanny.. yet it is so much worse. It takes the bad plot from that anime, mashes it together with poorly developed characters that don't even make any sense. The HIEs seem to be a combination of the Giftias from Plastic Memories, and the androids from Chobits - yet it doesn't quite get anywhere close to the character developmentin either.\\n\\n\r\nStory - 2\\n\r\nThe plot is amazingly shallow. I don't even know how it got here. It makes absolutely zero sense. If you don't believe me, spend 20 minutes watching the first episode and you'll understand. This leads directly onto the next category:\\n\\n\r\nCharacter - 2\\n\r\nThe characters in this series are so disappointing. I went into this show thinking it would be mediocre, but the characters are so much worse than your average anime. The MC is just soo naive, his friends have really weird backgrounds - and there's almost no character development.\\n\\n\r\nSound - 4\\n\r\nSound is decent in the series. The music is mediocre, and doesn't redeem the series in any way, much unlike other similar shows.\\n\\n\r\nArt - 6\\n\r\nSeems to be the only fair quality in the show. I guess they intended to invest in a bit of fanservice to appeal to the audience, hiding their complete lack of plot and character.\\n\\n\r\nWell that pretty much sums up Beatless. An anime that tries to be more but simply doesn't get anywhere close.",
            "date": "2018-05-21T13:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 281106,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/quantumf",
                "username": "quantumf"
            },
            "url": "https://myanimelist.net/reviews.php?id=281106"
        },
        {
            "content": "Best way to explain this: So much wasted potential. \r\nshort vers: decent music and art but uninteresting characters with unknown/unclear motivations (I'm not sure if some of them have any idea of what they actually want to do), plot wanders randomly around, incorporating totally random elements (fashion show? and the zombie robot mini apocalypse thing was even more wtf).  To make it worse there is a lot of filler and 3 recap episodes 17 episodes in. I know the recaps are technically beatless intermission but still...\r\nMore \"in depth:\"\r\nWith the premise there is so many things they could have explored, especially since our current worldseems to be moving in this direction regarding ai development. I mean just a few days ago google showed off a new ai that can mimic human speech. It wouldn't be far fetched in the future to create an ai that can almost flawlessly imitate a human. If it walks, talks, and looks like a human, is it one? Should it be treated as one? At what point, if any, can you acknowledge an AI as an equal and not some kind of tool? Just watch as an \"AI rights\" group pops up.\\n\r\nThe topic of an \"analog hack\" brought up is actually a fascinating topic that unfortunately hasn't been explored very deeply. If it something appears close enough to be human, it will force people to unconsciously acknowledge them as such, and thus you can physically \"hack\" humans through machines. And if the machines are made to aware of this they could also exploit it. Why would the machines need to rise up all terminator style when they could just manipulate us into putting them into positions of power where they could exterminate us whenever they wanted? So many places/directions this could go.\\n\\n\r\nAnd it goes no where. They could have easily cut the episode count in half(maybe even by 2/3) and overall the plot would still be the same. And it is random enough that it is actually really hard to spoil. I'd have to write a large paragraph. And I doubt you'd care if I'd spoiled everything. Not like it would impact your enjoyment that much. Unfortunately this is not a slice of life anime so this is a really bad thing. To those thought provoking questions above it has pretty much provided \"yes\" and \"no\" answers from different characters in a repetitive fashion that have little to no backing/explanations/reasoning. It is shallow, skin deep. It is like watching an argument consisting solely of a repeat of \"AI are tools\" \"No they are not\"\"They are tools\"\"they are not they have feelings\" over and over and over again. This argument sometimes turns violent but...\\n\\n\r\nThe action/animation/sound is decent I guess. Doesn't stand out in a bad way or a good one. So unfortunately not much eye/ear candy either. \\n\\n\r\nThe characters, well they are nothing special, the generic type where you'd prob forgot their names right after finishing the show, and maybe even while the show is airing. I don't hate them I don't like them, they are just there. The fact that I don't even know what else to put here should be pretty telling in of itself......\\n\\n\r\nBeatless touches upon profound topics but only skims the surface. And it skims it the same way repeatedly time and time again it starts to get boring. And most of the show is aimless, directionless filler that isn't funny or serious/engaging. It's like stalking your neighbor. Unless he's a really interesting person that going to get boring real fast. \\n\r\nOverall a 6 from me, which is rather bad as I tend to rate rather high (though I'm sort of stingy on 10s). Pretty much the score I give a show that doesn't quite manage to bore me to death but is almost there.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-05-11T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 280317,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3621113.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/citizen169",
                "username": "citizen169"
            },
            "url": "https://myanimelist.net/reviews.php?id=280317"
        },
        {
            "content": "There is a great deal about this anime that I like.  Really compelling ideas are both thrust into the viewer face, and with a little thought there are ideas lurking beneath the surface of what is seen.  I know that is very vague, but it's the great ideas this anime plays with that entertains me the most.\r\nBasically this anime focuses on the relationship between an android (called hIE's) and a high school adolescent.  There are a wide variety of events the two go through, which is pretty well foreshadowed by their initial meeting.  One can expect excitement to find the pairbecause of their importance to many outside forces.\\n\\n\r\nThe female lead (hIE) Lacia is (surprise!) a very special android with advanced capabilities.  Arato, the male lead is (surprise!) a strait forward nice guy who can come through in the clutch.  These characters are not original in any shape or form, but their roles work well within the larger context of the story.\\n\\n\r\nAnd this is why this anime will be enjoyable for some.  There is a lot of play with artificial intelligence, robotics, social engineering, brainwashing, software protocols and potential future changes that can effect the entire landscape of reality.  So even though this anime may appear cliche, trope, whatever - it actually isn't if you follow all the dialog and the potential implications.\\n\\n\r\nHowever, I'd be the first to admit, I am completely forgiving some blatantly bad elements of this anime.  Namely frequent flash back moments, complete episode recaps, and diversions from the overall arc.  Also, in spite of all the fun had with smart ideas - their is a great deal of potential squandered.  Stakes could be higher, characters more complex/developed, clearer motivations, and more consistency from episode to episode.  There really are strong and weak episodes.  There is a lot of discussion right now about FB and social media, and how peoples minds are being steered or even altered as a result of media interaction.  This is an idea Beatless hints at, but doesn't really fully take advantage of.  I mention this, because I feel this way about a lot of the ideas presented - unrealized potential.\\n\\n\r\nI'm a big fan of the opening.  There's solid artistic detail, the music is excellent, and a lot can be learned about the anime just by watching it - in other words, it's what I want as an anime fan.  In almost exact contrast, the credits exemplify some of the worst parts of the anime.  Don't get me wrong, still good music, and it's well made - but for me a montage about the main character's sister's daily life has no relevance.\\n\\n\r\nProbably not an anime just anyone can really like - but if some of the core elements sound appealing (androids, AI, relationships between machines and people, social engineering) - might be worth a look.  Overall a 7/10 for me so far\\n",
            "date": "2018-04-28T04:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 279214,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5127922.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/drtalos",
                "username": "drtalos"
            },
            "url": "https://myanimelist.net/reviews.php?id=279214"
        },
        {
            "content": "I dropped this anime after watching the last two episodes. Those were pure torture to me. This is what I think so far, and what I'm fairly sure of after suffering through 10 episodes of this show.\r\nBeatless is supposed to be about love between humans and machines. After 10 episodes, though, I wouldn't be able to tell you what this show is actually about. It lacks logic, coherency, a consequential PLOT. This anime is just action scenes piled on fan service and long, tedious dialogues about technology. Here's the tea.\r\nStory: 3\r\nAs I said above, the story isn't really there. I can't tell if the plotis about the relationship between Lacia and Male Main Character, or men vs technology, or h-IEs dynamics. I didn't understand sh*t.\\n\\n\r\nArt: 7\\n\r\nLacia is very beautiful, and so are her sisters. That's it. That's what saves this anime: pretty girls.\\n\\n\r\nSound: 9\\n\r\nPerhaps the only good this about this anime is the soundtrack. I enjoyed it a lot, even if it gets a bit too much sometimes. The opening is very good.\\n\\n\r\nCharacter: 5\\n\r\nThey have the depth of a teaspoon. That's all.\\n\\n\r\nEnjoyment: 2\\n\r\nI suffered through 9 episodes out of 10. The first one promises so much, but then one goes on watching and everything just kind of... falls apart, I guess.\\n\\n\r\nOverall: 5\\n\r\nOut of pity, mostly.",
            "date": "2018-03-17T07:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 274070,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6502690.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/oikoushi",
                "username": "oikoushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=274070"
        },
        {
            "content": "Beatless it starts good then we get some problems. Some guy in anitnetwork thing helps his friend then he himself gets into a terrorist attack from an ai robot. There are 5 ai robots loose season 1, 4 are found and have owners, maybe next season has the other one found. This anime makes the robots as objects ( plain robots), main character makes them as more where you can love them like any other person, One guy makes it where you can just f it. Antinetwork just want to destroy it and memeframe makes them. Lacia waifu doing fashion. Some rapey rape rape alsoin anime. Just get one of the ai robots and just rape it was like an innuendo in the anime or was it just me. \\n\\n\\n\r\nKahru says beatless is a parody anime from ghost in the shell and is a masterpiece. I haven't watched ghost in the shell, so I probably don't get it.\\n\\n\r\nThe music is the only good thing from this anime.\\n\\n\r\nI watched this anime the 20 eps, will watch the final stage when I can and make the other review when I can. Anyway watched this when I had no wifi. Well there were like maybe 3 recaps, didn't like that. \\n\\n\r\nThe anime felt like I was watching it out of order at like around ep 10, in reality I didn't at all watch it out of order, I watched it in order. I hated that, there were a few flashbacks from one ep from end of ep to start of ep. Made it confusing we do get the other robots meeting there owners and some betrayal in this anime. \\n\\n\r\nThe fight scenes were pretty good tho.\\n\\n\r\nIf this was a joke anime, I would agree.\\n\\n\r\nThis anime was hurting my head at points, there were some decent parts that were laughs and the little sister was cute.\\n\\n\r\nStory-5\\n\r\nArt-7\\n\r\nSound-8\\n\r\nCharacter-6\\n\r\nEnjoyment-5\\n\r\nOverall-5 (yeah 5 don't add up, maybe 6, but it's a 5)\\n\\n",
            "date": "2019-01-12T21:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 298884,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298884"
        },
        {
            "content": "Havent seen the original material (LN/Manga), so you can cut me some slack.\r\nLets start with the good points.\r\nArt - 6:\r\nIts not really bad to be honest, it has some low quality productions, where you can see lots of still frames, or recycled ones, but overall its fair. The opening is where it shines the most, and some fight scenes.\r\nSound - 6:\r\nIt has decent sound tracks across the series, especially on few notable moments, during fights or in the last episode. Opening track is good, ending is good (although, not on my tastes). Have heard lots of recycled sounds though. Voice acting seems good enough tonot annoy at least.\\n\\n\r\nFrom here on, its only downhill.\\n\\n\r\nStory - 4:\\n\\n\r\nThe idea is good on paper. I mean, humanity has advanced enough, to develop AI. The AIs are tasked with the development on humanity. Until they hit a wall, because after some certain accident, the humans became cautious of the AIs (looking at you, Skynet). \\n\\n\r\nSo, some years later, the accident is already in history books. A certain person from a certain organization, decides, humanity progress is bad, and they cant really do anything by themselves anymore. He orchestrates some stuff, in which, he lets some hIEs (human-like robots), on the loose. \\n\\n\r\nThey are really powerful, with different abilities. One of them is as well super-AI. They are tasked with different missions, all for the \"good\" of humanity (good, as in depending on point of view).\\n\\n\r\nAaaand then it meets the production of the anime.\\n\\n\r\nThe anime has aired 28 episodes. Can you guess, how many recaps are there, for those 2 and half seasons? \\n\\n\r\nIf your answer was between 0 and 2, well.... you are in for a big surprise. They are so many, that i lost count of them. I think they sit around 4, 5 or 6. \\n\r\nYes, thats right! About 20-25% of the aired episodes, were recaps!\\n\\n\r\nThe pacing is really bad. \\n\\n\r\nThe story telling is jagged at some points, and the story progression is often forced, with lack of logic at certain moments - Character A, meets by accident Character B, which turns out to be also an owner of one of those super hIE robots, that are on the loose. Coincidentally, their mutual friend, Character C, ALSO is an owner of one of those.\\n\\n\r\nThen, Character D, transfers into their school (who could have known, all of the people are high schoolers), and ALSO owns such a hIE robot. \\n\\n\r\nCliche-valanche.\\n\\n\r\nCharacter - 2:\\n\\n\r\nI havent seen so badly written and animated characters in a while.\\n\\n\r\nArato, the MC, is a wanna-be whimpy kid. Bullied kids today have more balls than him.\\n\r\nThen, we have one of his friends, an edgy wanna-be. A little more ballsy than him, but still a whimpy baby.\\n\r\nThe 3rd friend, in that group, is a son of one of the most powerful hIE companies, who is knowledgable about stuff left and right. The brainiac of the group, and supposedly the most mature one in terms of mentality.\\n\\n\r\nEverything else is to be considered as side characters (as humans i mean). \\n\\n\r\nLacia, is a robot, which is the 2nd MC, super-AI, which is a kinda of the \"EVERYTHING IS GOING ACCORDING TO MY PLAN\" cliche. \\n\\n\r\nNot kinda, its like that actually.\\n\\n\r\nLots can be said about characters, character development, character design and such.\\n\\n\r\nMost of it will be negative. If the story pacing wasn't bad enough to make you drop this from watching it, the characters will do it.\\n\\n\r\nEnjoyment - 2: \\n\\n\r\nWith the above 2 poor marks, i don't see how i can enjoy this. If you read the reddit discussions, TONS of people dropped it even before the half of the first season (around ep 5-6-7).\\n\\n\r\nOverall - 3:\\n\\n\r\nThe art and sound are the main saving grace to not give it 2 or 1.\\n\\n\r\nIf you are a masochist, who likes whiny, dumb, teenage main characters, who believe that friendship and love will save the world, then this is the right anime for you!\\n\\n\r\nOtherwise, just do not bother.",
            "date": "2018-10-01T09:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 290616,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ku4eto",
                "username": "ku4eto"
            },
            "url": "https://myanimelist.net/reviews.php?id=290616"
        },
        {
            "content": "When I heard there was a show that was described as a \"Spiritual Successor\" to Guilty crown, by the same creators,  I was overwhelmed with hype. \r\nAcross message boards, and even on MAL, the excitement for anything close to GC was palpable- especially since we knew we'd never get another season, since that series, unlike most modern anime, actually had a definitive end.\r\nSo, how did a show that was setup for success from the jump- with the same creators, a HIGHLY similar plot, and with a nearly identical emotional and aesthetic pallet- fail at recapturing or surpassing the expectations of their creators' previously belovedworks?\\n\\n\r\nWell, for one, they just didn't change enough, and sometimes that makes a new work essentially a caricature of a previous one. This is a dilemma that plagues all artists and art forms- when an artist gets great reception, and their fans keep demanding more of the same, the artist may focus to closely on their previous work and end up making a lesser version of it- a sophomore slump, if you will. \\n\\n\r\nThis is one of those slumps to a large degree. What we have here is essentially a budget re-skin of Guilty Crown. I'm honestly not sure if it falls short from expectations because of a lack of effort, a lack of self-awareness, or both. \\n\\n\r\nThe best comparative example of how Beatless rates next to its predecessor Guilty Crown is that of \"Brynhildr of Darkness\" to \"Elfen Lied\". Elfen Lied was a cult classic that is still referenced today as one of the greatest gore anime of all time, while Brynhildr is seen as the \"spiritual Successor\" that will rarely be remembered- not because its necessarily \"bad\", but because its basically a caricature of its predecessor. \\n\\n\r\nThe worst offenses in describing what this anime does worse than its predecessor, and many of its contemporaries, can be described in 2 parts:\\n\\n\r\n1. It's plot is incredibly slow moving in its first half, and feels disjointed and directionless about 70% of the time. Its latter half is actually much better in its pacing, but sadly, that's when many of the loose ends don't get to see a proper conclusion. \\n\\n\r\n2. It spends an inordinate amount of time on fan service, but, whats worse is that most of the fan-service filler is essentially pandering to the \"sister-lover\" pseudo incestual anime tropes that seems to be so popular these days. Oh, do I loathe sister-lovers. \\n\\n\r\nTo showcase how little the writers deviated from their previous works when they came up with the plot for Beatless, and to give a quick example of what I meant by this show being a shameless \"Re-skin of Guilty Crown\", here are the two shows Synopses, edited slightly in order to showcase the similarities:\\n\\n\r\nHere is an excerpt from Mal's \"Beatless\" Synopsis: \\n\r\n      \"....kind-hearted high school student Arato Endou..is viciously assaulted by a hacked hIe ( human-like robot)...he is saved by Lacia, a highly advanced hIEs that recently escaped the clutches of the mysterious MemeFrame Corporation... in exchange for saving his life, he must register as her new owner, thus taking full responsibility for her actions...\" \\n\\n\r\nNow here is an excerpt from Mal's \"Guilty Crown\" Synposis: \\n\r\n     \"...weak and unsociable Shuu Ouma (is attacked) during a crucial operation, which results in him (being saved by) Inori Yuzuriha, a member of a guerrilla group called Funeral Parlor, (who is escaping the clutches of a mysterious military corporation called GHQ). He (is then forced into) obtaining the \"Power of Kings\".... Now an unwilling participant in the struggle against GHQ, Shuu must learn to control his newfound power...(and take full responsibility of the actions of Inori and Funeral Parlor)\"\\n\\n\r\nBeside the lack of creativity in the main plot, The differences that account for such a drastic difference in enjoyment and quality are as such: \\n\\n\r\nThe art and animations are markedly more low budget than most anime of the current season, but even worse is the fact that they seemingly have barely evolved aesthetically from GC over 6 years ago. \\n\\n\r\nThe most glaring issue are the cliches that cage a good premise from being great. Like I previously mentioned, there are lazy, sometimes inappropriately incest-related tropes, and these are not made any better by the thickness of the stories plot armor, logical holes, and the \"Deus ex machina\"sprinkled throughout it. \\n\\n\r\nI could forgive Guilty Crowns' faults due to its ambition and the studios obvious love for their anime; sadly, I cannot give Beatless the same level of forgiveness, simply because it truly pales in comparison in its originality, writing, animation and overall quality. \\n\\n\r\nOn a funnier note, Beatless still completely outclasses many modern anime, including the horrifyingly terrible \"Clockwork Planet\", which so obviously stole from Beatless that its cringe inducing. \\n\\n\r\nEVERYTHING ASIDE, this isn't a horrible anime. It's problems stem from the same place that many well-meaning anime series do- it's simply confused as to what exactly it wants to be. They knew that they had to please fans by making Beatless a \"spiritual successor\", rather than its own unique series. They also knew they had to modernize this new series- which meant injecting enough \"moe\", \"sister-love\" and fan-service for the newer generation of otaku's. Look, I get it. The industry is a business, and that's what is selling, sadly. Anime has seen a steady decline in its quality of writing in the past 10 years due to the fickle nature of the industry and the obsession with creating the next great marketable franchise, and we all suffer for it. \\n\\n\r\nThankfully, the show has enough mystery, intrigue and fan-service to keep its viewers' attention for long enough for them to get through this relatively short series and formulate their own opinion of it. \\n\\n\r\nIn the end, a score of 6 is fairly generous, and, to be honest, a partially courteous gesture due to this anime being the next best thing for a dead franchise with no hopes of return. \\n\\n\r\nDespite my largely negative review, I would still suggest this to fans of Guilty Crown, Brynhildr in the Darkness, Elfen Lied and dare I say it, SOA. \\n",
            "date": "2018-09-20T02:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 289474,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5732373.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ketamigo",
                "username": "Ketamigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=289474"
        },
        {
            "content": "This show had so much potential. For those of you who watched Chobits in the past you will find the premise and story-line eerily familiar minus the awkward innuendo's every 3 minutes. The character artwork for the female characters is bright and vivid. That alone is what stood out for me. The story line as of episode 20 is somewhat unclear and rather like a lost puppy looking for what it wants to be. With a second season finale otw. I am hopeful the show may yet be saved.\r\nThe MC: is your average MC... spineless, indecisive, and at times lacking common sense\r\nThe Imouto: I didn'tmind so much as I get the feeling her character is the comic relief you need to keep you from asking why your still watching this show\\n\r\nThe Heroine: Is a mixed bag. drawn to be extremely attractive(success IMO) however the premise she keeps stating is she has no emotions and yet seems to convey them over and over again if nothing else via body language. She also displays utter devotion to the MC at times defying her own coding and self preservation.\\n\\n\r\nAll in all I find this show to be 5 out of 10. It wasn't so horrible that I wont complete it, nor is their glaring issues with every episode.  I find this to be on par with other run of the mill anime being produced in this decade. I find it enjoyable enough to watch, but not so much that I would recommend it to a friend",
            "date": "2018-08-16T00:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 286589,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5547109.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ChiisaiInu",
                "username": "ChiisaiInu"
            },
            "url": "https://myanimelist.net/reviews.php?id=286589"
        },
        {
            "content": "The story that Beatless is trying to tell is AWESOME. Unfortunately, they keep stumbling over their feet, staggering from episode to episode.\r\nWhat they are TRYING to do is explore in a serious fashion the role of AI in our society: Will AI fully integrate and dwell along side us us? Will it be malevolent and try to replace people? Or will people feel threatened and put limits on the AI?\r\nThe action takes place in a world where human looking androids are common, but almost all are linked to central AI that assists them in dealing with the incredibly complex creatures known as humans (So theyare not truly independent)\\n\\n\r\nThe only exception are 5 rogue androids that have a much more advanced AI, and are fully autonomous. These androids (called Hie) are surrogates for the various points of view (on human -AI interaction) that Beatless proposes \\n\\n\r\nThe problem is the male lead character, who bonds with the android representing coexistence is so bland that he sets your teeth on edge. And the whole modeling plot makes no sense. But that is a recurring problem with the show: too many b-plots that don't go anywhere or add to the the story.\\n\\n\r\nThat is partly because the characters represent points of view, so they often behave in a nonsensical manner, and you are left scratching your head to their motivations.\\n\\n\r\nAll in all, this show could have been really good, but as it is , you have to squint to see the good parts amongst all the chaff. \\n\\n",
            "date": "2018-08-12T16:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 286319,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rmremail",
                "username": "rmremail"
            },
            "url": "https://myanimelist.net/reviews.php?id=286319"
        },
        {
            "content": "Themes in a story are usually best when they're simple.  A clear-cut message delivered to the audience does much better because this way, there's little reason for the quality of the story to be sacrificed in exchange for more complicated hullabaloo that for some reasons, some people believe is 'good writing'.  All of that ironically comes in the form of the one word title of 'Beatless', where more than just a few 'beats' are missing when it comes to this one.\r\nStory:\r\nBeatless takes place in a version of the future where artificial intelligence units known as hIe's have become commonplace in society, working smaller jobs andmore dangerous jobs, slowly encroaching their foothold in the world as everything becomes more and more automated.  It's here where our main protagonist, Arato Endo, comes in contact with Lacia, an hIe who is one of five special units that've escaped a special facility, and becomes her owner to help pave the way for humanity's future.\\n\\n\r\nOn the surface, Beatless is a show that touches upon the themes of AI usage as the world of Beatless grows ever more reliant on automated computers and the future of humanity as a whole, as different perspectives of how humanity should approach the first point come into play.  But given the complexity of that sentence and the kinds of insinuation that could come from said sentence, what we end up getting is perhaps one of the most poorly structured shows in the history of the anime medium.\\n\\n\r\nWhile the first episode seems to give the audience some semblance of what the show should be about, what ends up happening is the show adding on layers upon layers of various terms, situations, characters, organizations, and events that muddy what could've been a compelling piece on our society's growing reliance on technology, into something that's basically incomprehensible to your average viewer as as characters stand or sit around for ten or so minutes at a time info-dumping their debates with walls of text that for the most part have almost no relevance as to what's going on because it's all junk that doesn't really matter at the end.\\n\\n\r\nThis problem is catalyzed further from how the show jumps around from event to event, creating a numerous amount of unsolved plot threads that have you scratching your head at the characters' motivations, as well as unsolved plot points that after a given episode, will drop you into something else entirely in the next cause who needs closure to a confrontation when we should instead be focusing on what the imouto has been up to these past few episodes while tensions run high between differing points of view?  That won't be jarring to the audience at all!\\n\\n\r\nSo many problems arise from situations like these, and this is one of the few cases where you expect the show to get worse and worse because by barely the halfway point, the show establishes that it basically can't tell a proper story.  Hell, Diomedia KNEW that this show was overtly complicated, so much so that they have four recap episodes in between arcs to 'refresh' the audience on what just happened.  You know you screwed up when you have to recap four times, and even with that, things STILL don't make much sense.  What's worse is that the show isn't even over.  There's a mini second season in the works to cap off the story, and the supposed finale doesn't really do anything to even build tension cause the shit just ends without a second thought.\\n\\n\r\nOverview:\\n\r\n+ Interesting premise\\n\r\n-  WAY too complicated\\n\r\n-  Four recap episodes (Like seriously?  Four?!)\\n\r\n-  Horrendous pacing\\n\r\n-  How in blazes is two cours not enough for this story?\\n\\n\r\nCharacters:\\n\\n\r\nEndo Arato is a useless character.  Described as a sympathetic 'nice guy' who treats the android hIe's like people, Arato for the majority ninety five percent of the series is just a figurehead for the show where things just happen around him.  To his credit, it makes sense sort of why he is the show's figurehead, but the guy does almost nothing to impact that plot, so little that you could make Lacia's owner a cardboard cutout and no one would be able to tell the difference.  This is because most of the series happens behind our protagonist's back, and he's more or less strung along for the ride that, while the show acknowledges it, still doesn't do him any favors cause he doesn't really develop, more so that just exist and change when see fit.  He's not a character, and he actually feels more fake than the fake android waifu that he has accompanying him for the majority of the series.\\n\\n\r\nThen there's Lacia, the actual protagonist that does something, but is never shown because why would we as the audience need to see ANYTHING happen when we can just be told that it happened?  As one of the five Lacia-class hIe's, Lacia spends the majority of the show stringing along her owner to do shit according to her whims (even though he's supposed to be the owner), ultimately making a reveal towards the end of the series that surprises no one considering how little the MC actually contributes to the series and how much Lacia has to pull up the slack in order to create some kind of interest for what's happening.  There are moments of her character in the beginning that do create the interesting dynamic of what her place as an android is in this world since Arato treats her like a human despite her being a tool for humanity, but there're so few and so close to the beginning that it's pretty negligible in the long run.\\n\\n\r\nAnd of course, there's nothing else to note when it comes to the rest of this cast.  Despite the main duo being far less that exemplary characters, they are by comparison so much better than everyone else that almost no one else is worth mentioning.  True the show attempts to create different versions of what the ideal human society should be with the four other Lacia-class units and respective owners, but their reasoning and motivation for even pursuing the future that they want is so baseless that Arato somehow has the most solid foundation of the four 'owners' in the series.  Not only that, but the show throws in so many different organizations with differing directions on how to handle the series's different situations that by the time you get understanding as to what everyone wants, you'll see that so many things lack reason that it's no wonder why the story flopped so hard.  (Sure it could be a commentary on how people have differing opinions, but why do that here, damnit?)\\n\\n\r\nOverview:\\n\r\n+ Lacia is at least somewhat interesting\\n\r\n- Too many perspectives\\n\r\n- MC is largely uninteresting\\n\\n\r\nArt:\\n\\n\r\nDiomedia's efforts to make Beatless look good was largely successful.  At least color-wise.  Closeups used in the show do have a nice and detailed sheen to them, but for the most part, if you're looking at the actual art and animation, there's nothing much to write home about.\\n\\n\r\nHowever I will give the show due credit with its background, as many of the farther shots, especially mixed in with the bright color scheme do aid in making the show look a lot better than it otherwise should've.  Diomedia's not a top contender for having overly pretty art, so seeing some nice quality stuff from them is a nice treat, even if the show itself suffers from poor story elements.\\n\\n\r\nSound:\\n\\n\r\nPersonally, I find anything other than GARNiDELiA's 'Error' to be subpar at best.  This isn't really a gripe with any of the other songs, but it's just that Error stands out so much more than its partner ED and the second pair of OP and ED that I really can't make a fair analysis by comparison.  I put this more on my bias with Error since it has such a catchy and unique beat to it whereas everything else sounds very samey despite them all being made by different artists.  Which is a shame since they're good, but just not AS good.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nI've realized that I write one of four kinds of reviews.  There're ones where I praise every aspect of the show, ones about shows that I like but point out flaws, those about shows I don't like but give the benefit of the doubt, then finally the ones where I sit down and sit down and systematically explain why almost every aspect of the show sucks and ask myself \"Why did I watch this?\" and \"Why was this made?\"  Those are the most fun to write because after months of finding myself realizing that I made a wrong choice, I get vindication by writing something that absolutely guts every aspect of a show's being because it's amazing how something this bad could ever be put on TV or shown to the public.\\n\\n\r\nI honestly have not gotten this mad at a show since Sousei no Omnyouji, and that was more than a year ago; every fiber of my being was yelling at the screen over how little sense everything in Beatless made.  There were times when each episode felt like nothing was achieved, and those that seemed like things was progression had little to no explanation as to why things happened, creating a vicious cycle of never-ending bad storytelling that only got worse with time.  Hell an android basically livestreamed herself commit property damage and commit suicide without any real context as to why any of that happened.  The hell am I supposed to get from that?\\n\\n\r\nAs a result of this, I got no enjoyment from watching this series, agonizing through the walls of texts and debates over AI, humans, and what humanity is supposed to be, which is all a real shame considering I actually had hopes for the series once upon a time, and the beginning was enough to keep my interest for the show until it decided that the plot could only move through the use of the little sister's random impulses, and any kind of cohesive theme was thrown out the window for complex plot threads that get largely unfinished and are extremely unsatisfactory to watch.  If you ask me, this is a show worth skipping.  It's a show that tries to be about everything but ends up being about nothing, giving it no positive merit aside from wasted time because quite honestly, things just happen, and that is not good writing.\\n\\n\r\nThat aside, \"Error\" is one of my favorite OPs, which is ironic considering it comes from a show I despise.",
            "date": "2018-07-09T15:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 283566,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=283566"
        },
        {
            "content": "Jesus Christ this was a trash fire. Beatless is about the journey of a high school aged boy named Arato. Arato’s world takes place in the far future, where hyper realistic robots are common and prevalent. These robots are called hIE’s, and they’ve integrated themselves into normal life as servants. Arato treats these hIE’s as equals, falling in love with them at times. One night, Arato encounters an odd looking, powerful, hyper intelligent AI hIE holding a coffin that saves him from a car hacked to target humans. In exchange for saving him the hIE asks him to become her owner. As her owner, Aratois responsible for everything that she does. Therefore, he has to deal with those related to and enemy of his new hIE, named Lacia.\\n\r\n\tNow, that synopsis doesn’t sound that bad, but trust me when I say the show is much much worse. Female robots are nothing new, and a show based around them isn’t either. But me personally has had a bad experience with them, first with Chobits, which I found descent, second being the more recent Clockwork Planet, which was a complete shitshow. Looking through the Winter anime season, this anime is 26 episodes, I thought to give this type of robot girl show another chance. And with watching this show once a week for 6 months, it has ruined the genre for me.\\n\r\n\tSo the main issue about Beatless is that it doesn’t make sense. The show has so many conflicting plot points that: 1. Just don’t work, and 2. Makes it so nothing is resolved, 3. It doesn’t even matter in the long run. In fact, there are so many things that don’t matter that they have to make not 1, not 2, not 3, but 4 recap episodes. And I doubt that was done due to a confusing storyline. Because from a look of the show, they didn’t have a lot of budget to work on. Art and animation is severely underwhelming, along with a soundtrack that is only decent at best. Every single character is one dimensional, retarded, and make complete one eighties at random moments as the barely coherent demands. \\n\r\n         Arato is the worse case here. He falls in love with Lacia, his robot, who has specified that she doesn’t have feelings. Yet, he goes to great lengths to protect her, even putting real human lives in danger. Although, the worst thing about this relationship they have forged, is that the show doesn’t depict this show as a good thing at all. It doesn’t give their relationship any good points. Beatless just shows them being together, nothing spectacular, but the length Arato goes to keep their relationship isn’t worth it. The conflict in the show doesn’t even come from their relationship, but only as a catalyst for more trouble to occur. The main troubles of the show come from those who are after Lacia, which include the government, a secret organization against hIE’s, and Lacia’s other models or “sisters”. Lacia’s sisters are a major part of the show, 5 of them including Lacia, and they all represent a different part of human progress. Weapons, evolution, etc. And the end point of the show is that they all try and make a different future, according to what their owner wants. This by far is the most interesting thing about the show, to bad it's covered by bad, well, everything.\\n\r\n        This show has no redeeming factors. I cannot recommend this to anyone whether you like this type of show or not. I give this show a 1 out of 10. This has been PixEFit’s spoiler free, but not really review on Beatless.\\n",
            "date": "2018-06-30T00:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 282579,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=282579"
        },
        {
            "content": "You know, this anime remind me of 2 western movies :\r\n- Terminator Fracnchise\r\n- I,Robot\r\nIf you already watched those movie above, you'll think this anime is just a joke. In the first episode of this anime i think the timeline for the story plot is around 2070-2080 considering the technology still less sophisticated than the three movies above. I know that we cant compare 2D anime with 3D movies, but in this review i just only talking about the stories, maybe I just talk a little about 1 or 2 characters only.\r\nI don't know what this story is about, i watched the anime because of myfriend's recommendation no more no less. I try my best to enjoy this anime even in the very beginning of the story give me a lot of boredom. The story progressing and i found 3 key characters and i hate all of em.\\n\r\n1. Useless and easy to get carried away main character,this  is one of the many characters I hate.\\n\r\n2. A gamer, a character that always compare anything with his game.\\n\r\n3. Childhood friend, this is one of the many characters I like, but this childhood friend that i wish to stab him right in his ass.\\n\\n\r\nLets skip all of the unimportant thing above, the real review and ROAST will begin!!\\n\r\nThe Story doesnt lead to anything like 'MC had a dream or ambition', this MC doesnt had any motivation and still dont have any after he doing something like master x servant ritual with a such sex toy that had ability to talk and walking. This story is very far from what I expected from a robotic anime. hIE is just simply a sex toy that had terminator ability. \\n\r\nThere are AI with SUPER INTELLIGENCE i dont remeber the exact number of it, depends of something that write about this anime had a reference 2 western movies that both movies had same theme. The thing that called super int AI in this anime is faarr to be called SUPER INTELLIGENCE, why that? lets OOT for a while.\\n\r\nVIKI is SUPER INTELLIGENCE AI from I,robot movie, 'she' had ability to control every robot that had connection to her, not just robots VIKI cant control the whole system in a certain company that she held in.\\n\r\nSKYNET is the real SUPER INTELLIGENCE here, even it doesn't have full control over all the robot creations that it makes. But SKYNET is so far advanced that both VIKI and HIGGINS (an Super AI in this anime), i cant talk more about this despite it was OOT.\\n\\n\r\nThere are 2 or 3 reason that i keep watching this anime :\\n\r\n1. Little Sister, all 3 key charcthers had their own little sister\\n\r\n2. Sci-fi\\n\r\n3. Hope for improvement\\n\r\ni keep watching this anime is just because ENDOU YUKA. \\n\\n\r\nTo much drama for a SF series, the drama was not talking about stupid triangle love, its talk about how stupid the MC fall in love with a sex toy that had terminator like ability that all his friend doesnt support that. The story progressing into that the protagonist had a dream to living together with hIE, or in other word he want to everybody to fuck the sex toy rather than to fuck the real human.\\n\\n\r\nI had my reason to not recommend this series to anyone else, but if you're into SF, then just watch this anime, for killing your time only.\\n\r\nI rate this anime 7 bcoz ENDO YUKA, SF genre, and i cant rate this 6.6.\\n\\n\r\nP.S i dont know is my review is called review or not.\\n\\n\r\nSPOILER ALERT\\n\r\nBEATLESS FINAL STAGE (the rest 4 episode) WILL AIRING IN SEPTEMBER",
            "date": "2018-06-29T21:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 282574,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6766634.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bondtux",
                "username": "bondtux"
            },
            "url": "https://myanimelist.net/reviews.php?id=282574"
        },
        {
            "content": "Fate/stay night once again in Si-Fi version. or you can say remake of Guilty Crown.  \r\nIts good to watch only to pass your time nothing more. i dont find anything new, same old theme with good visual effect. overall all sound quality pretty good actually. \r\nThe MC( Arato ) is average, like other side character. \r\n Lacia character does her best what she can do. but impressive fighting style. \r\nother character like Arato's sister,,, meh....... :/ totally sucks. that the hell was that, total bullshit! -_- i've seen far better. \r\ni personally didnt like this anime, dropped it after 11 episodes. its lack ofa good story. i'd recommend you to watch it if you literally nothing to watch. you can watch it to pass your time.  \\n\\n\r\nOP/ED - pretty good actually. like it\\n\r\nStory - Sucks! \\n\r\nEnjoyment- not so much\\n",
            "date": "2018-05-18T11:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 280864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7266389.jpg",
                "scores": {
                    "animation": 6,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DZY69",
                "username": "DZY69"
            },
            "url": "https://myanimelist.net/reviews.php?id=280864"
        },
        {
            "content": "This is a series with a reasonable amount of action and a protagonist that doesn't have me grinding my teeth wishing for a fraction of backbone. I am reminded only momentarily of Chobits until you feel it steer away from the romance/ drama and towards a more action packed story. I do have hopes for this.\r\nIt needs to be said that ep 6 is a recap. The story up to that point is somewhat fun and active, but a recap before a ep 11 or 12 is worse than a week without in my opinion. I may change this as the anime progresses, but damagehas been done and I'm left expecting a recap at every quarter.",
            "date": "2018-02-28T02:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 272646,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444288.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Loki13",
                "username": "Loki13"
            },
            "url": "https://myanimelist.net/reviews.php?id=272646"
        },
        {
            "content": "I have to say before going into this review that I did stick it out to the hiatus that goes until September of this year, and still intend to continue watching then because I need to feel like I gave this anime a chance to repent for all of my wasted time. I had initally intended to drop this crap after episode one but act a visit back with a few more episodes in, it was able to \"lie\" me back into watching again until it was too late to stop. (PLEASE DON'T BE LIKE ME. SPEND YOU TIME MORE WISELY.)\r\nOnward!\r\nThe best way to describethis anime is with two words. Pathetic disaster!\\n\r\nThe story is a complete mess that makes no sense or simply throws plot around without meaning.\\n\r\nI'm also sorry to say this to the people who like the story, but the story creators seem to just not understand even vaguely the existential qualities and mythology of there own story. (apologies to the novel if the it is just poor adaption which is probable.)\\n\r\nThe MC is horribly stupid, and other characters are not anything other than plot devices.\\n\r\nThe romance is not even a romance and defending it as such rebuts the shows points. (Sorry to the people who may have watched this for that reason.)\\n\r\nThe amount of recaps is way, way too much.\\n\r\nThe animation is just horrendous as times. (Worst I have ever seen for an anime.)\\n\r\nThe anime ends abruptly with a hiatus for several months because of lack of budget.\\n\\n\r\nThere is not a single redeeming quality of this anime and I really am quite afraid of how many people gave this anime anything more that a possible 4/10. For those people I can only think they are either completely looking past every single problem or actually don't understand the anime to begin with and just simply want some girls fighting in tight superhero like suits. If I have not said enough yet, please read onward where I break down exactly every single problem with this anime.\\n\\n\r\nFrom the end of episode one I knew I was going to hate this anime.\\n\r\nThe tag line of the anime is \"I trust your smile. I don't care whether you are soulless or not.\" Which this is how the episode ended (not sure if it was first or second episode to be exact). This phrase seems to be some sort of word trickery or just flat out stupidity, because very few people go around day to day thinking of souls and smiles as defining reasons for something being a \"person\"... Furthermore, anyone who is not religious could really not give a crap anyways about souls, which makes me think and really wonder if the creators just didn't have words like \"consciousness\" under the belt or it was just a wrong way of treating the translation. To simply hinge all of what is defined in \"personhood\", by something like \"souls\" is just plain stupid dualism.\\n\r\nThis is honestly the first mistake the whole series ever made, and forgive me, I have never read the novel/manga, but if it dose the same thing (which I think is dose use the same term \"soul\") then it was also a dualism mistake there too. I could sit here and say all the worlds that needed to be used like phenomenal consciousness, functional consciousness, qualia, functionalism vs. dualism, the philosophical zombie argument, the Chinese Room argument, but just explaining away these terms probably wouldn't help you see my point and I think I have made it clear enough already anyways the fact that the story that this anime presented has none of these terms or ideas ever implemented. It's like they really didn't care if they were accurate, like with the word \"soul\" instead of anything else which was more reasonable.\\n\\n\r\nThe rest of the story after the first episode is a long road that just goes nowhere really. The whole series has very little of anything actually meaningful going on, and as each episode went by, I thought to myself at the end, \"Well we still have not really got anywhere have we?\" (Along with \"I sure hope the next is not another recap.\") By the end of the last few episodes before the hiatus things finally feel like they are moving however still at a sluggish rate, without any actual questions answered which should have been far, far earlier answered.\\n\r\nYou see I wouldn't have made such a big deal about the whole \"soul\" thing either normally, except it's really a good example of lack of really any sense that the story has just simply from square one, and the animation and all execution following as a complete trainwreck makes good examples of a poor amount of effort put in in general, along with complete lack of budget. Which is what I think is what a lot of this anime suffered from most. But even if the story writers had done there homework and been more careful with what words, or themes, or ideas they used, executed plot properly, the rest of the dicey animation quality, and the recaps would still have existed because of lack of budget.\\n\\n\r\nAs for characters, the MC, he is the single most annoying one from any anime that has every existed and he is total and utter crap because he never has a free will of his own. By the time he starts making decisions for himself (very close to the beginning of hiatus until September), it feels like the anime is almost over and it just feels like it's something that should have happened far earlier in the show. The entire rest of the characters are either fan service by having sexy girls fight and or, are simply plot devices to plot that makes no real head way anywhere anyways. The fan service is really troubling at times with the characters and although there is not nudity, it still feels like every single plot point is to make more girls fight in sexy cloths. I really feel like the creators just didn't give a crap anymore about the story or anything else and just wanted use this as a step by step to get more fan service in. That's really sad...\\n\\n\r\nThis is a real kicker for people but the romance is not even a real romance and it's so easy to see that it's an illusion and the MC is just a dumb cuck. That's what really has to be said. I have been waiting for some evidence the entire time that the romance may be real because I really, really don't want it to be, but it is just fake. They talk about these \"analogue hacks\" and what is sad is that some people who watch either don't realize it (or don't want to realize it) that THAT IS NOT THE SAME AS THE REAL THING. Which it is a CONFIRMED imitation by the hIEs themselves. It's like someone telling you \"I don't really love you, I'm just using you.\", they are just acting the part of the romance, then you believe that they still love you.\\n\r\nAn AI that imitates is just an imitation. It's fake. That doesn't mean that the hIEs should not be taken seriously, on the contrary it takes the MC the entire first part of the season to realize this before he blurts it out. Pathetic.\\n\r\nHonestly I have been wishing the entire time that somehow some real romance happens, and I have at least a spec of solid evidence that it's real. This is honestly the only way I can see this anime being even partially redeemed for wasting my time. \\n\\n\r\nMaybe this is the only thing this anime actually dose ok. The \"hope\" for a romance (or that this anime gets better in some way) that pretty much every ones wanted since episode one, and is what the MC always wanted. This, my last ditch effort for hope. Some people have said that that's the point of the anime... I can't really see that as the point. There are too many things at play for it to all boil down to just simple metaphors for problems with romance and the possible lies of love. Still, this is the only bit of fan service I will give into because it would fundamentally change the entire message of the story. I don't like the way they pose the hIEs as emotionless tools. But that's what they truly are. A single act of proving this wrong however would be enough.\\n\r\nI really, really, really, want to see Lacia come out and show proof of her emotions, but every time it's possible it's just proven to be a lie. I feel like now this is the only thing tying people to hanging on to this anime for so long, they so too want this to happen but no matter their hopes, every time it betrays them.",
            "date": "2018-07-17T21:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 284211,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6552049.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PhilanthropyAI",
                "username": "PhilanthropyAI"
            },
            "url": "https://myanimelist.net/reviews.php?id=284211"
        }
    ]
]