[
    [
        {
            "content": "I personally love ''To LOVE-Ru'' and the new Motto To LOVE-Ru. In the first season it's a story about the girl called Lala, which apparently met Yuuki Rito in the washroom. Lala wants to get married to Yuuki due to his kindness from saving her multiple times. However, Motto To LOVE-Ru gets more interesting. They add numerous random scenes per episode. It really isn't a story that relates to each episode, but it's a different way of telling the story. I'm reading the manga on a daily basic. So far it kind of matches up, but not a lot. I recommend this type of animeto people that like ecchi, romance, and comedy. \\n\\n\r\nStory (8/10)\\n\r\nEach story has a new problem towards nearly all the characters in the story. The story is getting more into the comedy section, such as when Yuuki is turned into a dog, because Lala inventions. He also had to lick every part of Haruna's body, because Haruna's dog said so! (cough even a dog is perverted). Yuuki in season two is more developed and more mature then he was in season one. Yuuki quoted, ''The most important thing is not the outside, but the inside''. (Cough that's what she said xD), sounds wrong at first but he is more kind, and generous towards the girls now in season two. I also like how Golden Darkness or (aka) Yami! is developing feelings toward Yuuki. Even though she has a mission to kill him, she is seeing how good of a person Yuuki is. Overall the story is made for comedy, so far not a lot of intense or serious episodes/scenes. So far I'm more interested how the relationship between Yuuki and Lala develops.\\n\r\n-Yami Forever!-\\n\\n\\n\r\nArt (9/10)\\n\r\nThe art was a lot better then the first season when i compared both. The color and the design was nearly perfect, except for the white blocking. The white blocking or white flash is used for blocking the parts of the story where its too Ecchi or perverted. If they could take out that white flash, then i would of gave the art 10/10, and it would make a lot of people happy. Overall i though art was well done.\\n\\n\r\nCharacter (10/10)\\n\r\nMost characters in season one changed either physically or mentally. Lala is getting more out of hands, using her inventions and making them. Yami is now not that aggressive as she was in season one. She is more kind and is trying new things, also Yami is maybe.. Liking Yuuki to a certain degree. I think Yami has a crush on Yuuki Rito, because she usually blushes when shes near him or when his helping her. Haruna and Yui is developing feeling for Yuuki. Such as, when Yui was sick, Yuuki came to deliver some paperwork, but there stay was longer then expected. Haruna is showing more that she likes Yuuki, but she really hasn't confess to him yet in season two. Overall i like how the characters are much different from season one, but not too different. They added some changes that i personally love.\\n\\n\r\nEnjoyment (10/10)\\n\r\nI enjoyed season one, but season two is where the action and comedy steps in. It makes me laugh much more then usually, also there is more ecchi scenes in season two which adds some kick! I'm also enjoying how each character is starting to develop a feeling towards Yuuki Rito. I personally enjoyed the first eight episodes so far and hope it gets better forward. Why i watch Motto To LOVE-Ru is because of Golden Darkness/Yami, because shes so CUTE! and starting to have feelings toward Yuuki!.\\n\\n\r\nMy Dislikes and Cons\\n\r\nMy dislikes for Motto to LOVE-Ru is waiting for the new episodes.\\n\\n\r\n   I hope you enjoy this review :)",
            "date": "2010-12-01T17:33:00+00:00",
            "helpful_count": 121,
            "mal_id": 32441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/412715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/XiaoYami",
                "username": "XiaoYami"
            },
            "url": "https://myanimelist.net/reviews.php?id=32441"
        },
        {
            "content": "As a fan of To LOVE-Ru, I didn't enjoy the first season at all.  I know it wasn't very faithful to the manga, but the way it was executed left a bad taste in my mouth.  However, Motto changed that by following the manga more closely, and the result?  An adaption that was enjoyable from start to finish.\r\nIf you're familiar with To LOVE-Ru, then you probably know that there's not really a driven plot.  Those that are new to TLR (which I'll refer to this series as for the rest of the review), you're not gonna expect much of a storyhere.  Since Motto follows the manga more closely, we're given about three 6-8 minute long (give or take) segments of various chapters of mainly Rito in weird, ecchi, and sometimes comedic situations, accompanied with the various side characters of TLR, with some having a segment dedicated to them.  Because of that, almost none of the episodes follow up to the next one, thereby making my point that TLR doesn't have a driven plot.  I, however, liked how each episode had different segments since it compliments the manga well.  They're both fast and easy to dive into.\\n\\n\r\nThe art has slightly improved from the first season (ooooh shiny), but the animation has really improved as well, at least from my standpoint.  You may also notice that in the censored broadcast, in some ecchi situations, there's a \"white light out of nowhere\" covering a certain part considered ecchi.  While in some cases it's acceptable, others it just doesn't seem needed at all.  Luckily for me (and hopefully for you), I was able to watch the uncensored broadcast, which to me, is what makes TLR enjoyable in the first place. *wink wink*\\n\\n\r\nThough I feel that sound wasn't a big factor in Motto, the music did, however, compliment some of the scenes pretty well in order to fit the mood.  The opening theme is catchy and lively and the ending theme is easy-listening.\\n\\n\r\nBecause Motto follows the manga more closely, we're not always given an episode that focuses solely on either the two main heroines, Lala and Haruna.  Like I said earlier, some side characters get a segment of their own as well.  As for character development, almost everyone is their usual self, but with some of the girls beginning to develop feelings for Rito.  Rito himself is also coming to realize that he's developing feelings for Lala as well.\\n\\n\r\nComparing the first and second season of TLR, I honestly think that the 2nd was just simply better than the 1st season because...you guessed it...it follows the manga more closely.  Seeing some of my favorite chapters animated and having some of my favorite characters get their own segment definitely beats than having to watch something entirely stupid and pointless (ex. most of the episodes and Lala's transformation sequence in the first season).  The fanservice, in my opinion, is definitely where it needs to be since it is of course, TLR, which is known for that, and the 2nd season definitely did that a lot more than the 1st.  \\n\\n\r\nIt may seem I'm giving Motto a little more credit than it deserves, but it does have its flaws.  For those that, somehow, enjoyed the 1st season, the 2nd doesn't pick up at all where it left off, so expect that if you're going into the 2nd season.  *Spoiler Alert* You may also question to yourself as to who is that character and how *insert character* is like that since it wasn't portrayed in the anime at all, such as Celine originally being a plant, who is now in the form of a baby, or Oshizu now having a prosthetic body when she was originally a ghost.\\n\\n\r\nWith all that said, Motto TLR is a good watch...IF you happen to be a fan of the series.  They removed, in my opinion, everything that was just terrible from the first season and just made the second season better by just following the manga, which pretty much what made me enjoy Motto from start to end.",
            "date": "2010-12-28T21:51:00+00:00",
            "helpful_count": 64,
            "mal_id": 33168,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/chinoman",
                "username": "chinoman"
            },
            "url": "https://myanimelist.net/reviews.php?id=33168"
        },
        {
            "content": "Motto To LOVE-Ru\r\n WOOOOW, okay. If you’re interested in watching the To LOVE-Ru series, skip the first season and start with Motto To LOVE-Ru instead. I know I know, why in the world would I say this when I thought that To LOVE-Ru was a pretty good first season? Well the answer is mega simple; To LOVE-Ru ends in a way that lets Motto start off in a very much “let’s start all over” again sort of way. It’s ecchier/lewder, the art style is changed/upgraded to match the To LOVE-Ru ecchi aspects and it’s a huge over haul. Sure, it may take a while toget used to the characters, since there is a ton of girls to remember, but honestly, starting with Motto is far far far better. It’s not just art that changed too; the way the episodes are shown has changed as well. Instead of being forced to watch a 23 minute episode of sometimes archaic and rather ridiculous scenarios, Motto To LOVE-Ru employs a new tactic, each episode (except for the last one) is cut into 5-9 minute chunks; what this means is that in a 23 minute episode, we the viewers, are able to watch 3 different plots/stories/scenes/thing…. It works so unbelievably well; since the biggest issue I had with To LOVE-Ru (even if I didn’t mention it) was how dragged out some episodes were, especially since To LOVE-Ru was 2-cour.\\n\\n\r\n Motto To LOVE-Ru takes what To LOVE-Ru did really well in and makes it a whole ton better, it also fixes all the issues I had with the first season. If you really like the older art style (I know I liked it a ton), you can give To LOVE-Ru a watch, but aside from knowing who’s who, you’re not missing much by skipping the first season, that’s my honest opinion.\\n\\n\r\n Motto starts off a little later in time after To LOVE-Ru ended and the first episode, the first 10 seconds, really sets off with a “Hey you, yeah…you, you’re watching this for lewd ecchi goodness, don’t forget that”. Momo, Lala’s younger sister is in Yuuki’s bed and her head is near his crotch, so uhm, yeah it’s the perfect way to introduce everyone back into the To LOVE-Ru universe. Because of the episodic changes, Motto actually has 36 “episodes” and each episode is executed perfectly. To LOVE-Ru did a poor job giving meaning to the girls, Motto fixes this big time. Each girl gets at least one “episode” of exposition, I’d honestly say most get around 2 and then some. This makes it a lot easier to understand why they like Yuuki to begin with and that’s huge, giving characters a reason is something all anime should strive for, even if it’s a shameless ecchi anime. Yami, Mikan, Saki, Kotegawa, Oshizu, Lala, Haruna, Momo, Nana, Run, Celine, they all have episodes dedicated to them and their feelings, their likes and it’s incredible. Of that entire list, Celine, Momo and Nana are new to To LOVE-Ru; Celine is a super cute sunflower child that Lala gave to Yuuki on his birthday (from the OVA if you paid attention), every time she’s involved in an episode, hilarity ensues and she’s just too adorable!, Nana and Momo are Lala’s imouto, running away from the planet Deviluke, they live with Lala, Mikan and Yuuki. Momo has some of the best episodes in this entire anime and Nana eventually grows to like Yuuki, as additions to the cast, they’re fantastic and entirely lovable",
            "date": "2015-09-09T18:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 198243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568362.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_Arcadia0",
                "username": "_Arcadia0"
            },
            "url": "https://myanimelist.net/reviews.php?id=198243"
        },
        {
            "content": "Sequels. They really are a world on their own. A few maintain the success from the first series and are able to carry it onwards. Others attempt the same, but cannot compare, yet still provide an enjoyable ride. And then there are cases like Motto To Love-Ru, where you watch the same thing yet it feels like something completely different.\r\nBefore anything else, I have watched the first season and really enjoyed it. Then came the OVA, also enjoyable. Then came the sequel. And for some reason, within a few episodes the feeling the first series gave me completely left me. Now I find myself recognizingthe characters and seiyuu but nothing else from the first season. Where has it gone? Let's take a bite at figuring that out.\\n\\n\r\nTo Love-Ru is known as a romantic comedy. Our harem lead is Mr.Nice guy, caught up in a love triangle between A) a cute and shy girl he's had a crush on for a while and B) a busty / childish alien that fell from space and makes him go through alot of adventures. The first season portrayed this well; between the laughs was also room for plot development and romance. A nice mix along with a good production value that made for an enjoyable ride.\\n\\n\r\nIn the second season however, I can only see a ton of fanservice and a story that is (at the moment I write this) not progressing anywhere. The charm of season I is a relic of the past, replacing it is a display of how magical the sun rays are once again, conveniently censoring everything that comes into the screen. And in a series that is mainly about fanservice..it tends to beat the point.\\n\\n\r\nIn a nutshell, Motto To Love-Ru supports the notion a recent article on Sankaku made about the anime industry becoming a porn industry. You want fanservice? Watch it. You want anything else? Do not watch it. A simple logic that should save both you and me quite some time.",
            "date": "2010-11-21T04:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 32212,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152508.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stigs",
                "username": "Stigs"
            },
            "url": "https://myanimelist.net/reviews.php?id=32212"
        },
        {
            "content": "OK...\r\nThe sequel to  To-love RU...\r\nSadly it can't even compare to the original..\r\nThis sequel really destroyed everything in the show..\r\nArt:Well it looks like they changed how characters look a bit...They all seem shinier and pretty much better than before\r\nSound:Can't really comment here..the only music we get to hear is the op and ending which is ok..not great but ok\r\nCharacters: Nothing new..Everyone is still the same...if not worse...The main character Yuuki Rito seems to be even shier than before...They made him an even bigger douche than before..which is amazing...But really annoying as time passes..Lala is still the wacky ,happy , strange girl like in the firstpart..The rest are just plain and pretty much the same boring and annoying characters as before\\n\\n\r\nEnjoyment: Where is the enjoyment..? Every episode is the same really...Either 1:Lala creates a machine that fucks up Rito in some kind of way... 2:A day where Rito is alone with some other girl that's in love with him (every girl qualifies) ..It's so boring and predictable...Hey look fanservice...flashing beam of light hindering  fanservice...Yuuki Rito looks at fanservice....Stands like an idiot...Girl slaps him....that's the whole plot of this show\\n\\n\\n\r\nOverall: A sequel that is failing miserably.....I'm watching it cause I'm curious on what's gonna happen and if there is a possible chance of improvement but no....there is no improvement    \\n\\n\\n\r\nOverall score: 5  Mediocre seems to fit this sequel..",
            "date": "2010-11-26T09:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 32314,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Reaper_1992",
                "username": "Reaper_1992"
            },
            "url": "https://myanimelist.net/reviews.php?id=32314"
        },
        {
            "content": "Motto: to-LOVE-ru\r\nFinally, the much awaited sequel to a show that hundreds if not thousands demanded have a sequel. Oh, when the OVA came out, that was not enough. The cries of the people rang in the ears of the producers, who then had to oblige. At last: a sequel that’s a sequel. They’ve kept us waiting long enough, right? But wait…is THIS what I’ve been waiting for?\r\nStory:\r\nWhat story? So far, all it is is a continuation of the first season. Not a sequel. Just an OVA that they named all fancy and stuff. There’re really no plot (at least none seen yet ). At thevery least, the first season had a story that it tried to follow, and I say tried because there were so many arcs and so many sub plots that you kind of lost sight of what the point was – it started to look like just a slice of life genre, and you forgot that she was a big important person on Deviluke and that he was her chosen mate and that they were supposed to rule the galaxy. But, it did end on a good note. At least, that’s what I think. I’ve really been looking forward to this second season but so far I am thoroughly disappointed. \\n\\n\r\nArt:\\n\r\nThe artistic value went up slightly. I can’t say that it was a big change, but it was enough for you to notice. The only thing that’s slightly bothering me is the lighting issue. I’ve been watching this on animeseason, and every time there’s a panty shot, it’s either covered by light of dark. AND THIS IS PISSING ME OFF. Sure, coincidence that hair is directly over the nipple, fine. But these supposed “glares” on your view come out of freaking nowhere. It’s probably not the producers or directors fault or anything, but this is a dent in the art. Those shots are supposed to be there so that you can see what the character is seeing (sometimes).\\n\\n\r\nSound:\\n\r\nI’ll update this later, because I have a feeling they’re going to change the ending theme.\\n\\n\r\nCharacters:\\n\r\nLala has become even more bubbly then before. She’s also become sweeter, and the faces she makes are often priceless. All the ladies of the show are back and you can count on the fact that they’re proportions are just as big if not bigger than it was in the first season. You also meet Momo and Nana.\\n\r\nIf you read the manga (before all the manga sites got scared of posting it), then you know these characters and you’ll probably be pleasantly surprised by what you’re going to get. \\n\\n\r\nEnjoyment:\\n\r\nSo far, through all the fan service and nonsense that they’re throwing at the viewer, I can’t say that I’m not enjoying it. I’m not particularly ecstatic either, and I probably won’t be if I don’t see a plot or focus point soon. Though I like it, all it is so far is fan service. And the update will change the entire outcome of the review depending on whether or not I see a plot or definitive point to the show. \\n\\n\r\nFaults:\\n\r\nYou’re probably tired of hearing me say this, but I cannot get over the fact that the show has NO POINT. I’m watching it because I figured it would jump right back to where it left off: what happens with the earth, and what’s going on with Rito and how he’s coping with everything. But, this second series acts almost as if the ending events of the first didn’t matter. Sure, Rito remembers everything, but he doesn’t seem at all affected by it. I’d imagine that he would still be having a hard time accepting the fact that the earth was almost obliterated thanks to him and the fact that he will probably still end up ruling the universe someday if lala stays with him any longer. It just doesn’t follow the personalities that the characters had in the first season. \\n\\n\r\nOverall:\\n\r\nOverall, I just can’t wait for the season to finish. That’s about it. From here on is what will make or break this anime. I’ve pretty much gone through 7 episodes of fan service that should have been in the OVA, and now I’m ready for some more action, and I want a plot.\\n",
            "date": "2010-11-25T10:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 32297,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/389472.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xxcchaosxx",
                "username": "xxcchaosxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=32297"
        },
        {
            "content": "English:\r\nI watched \"Motto To LOVE-Ru\" because I was in kind of a race. The first four days I watched the first season, and then I got to watch the \"Motto\" season / shorts / specials. I was surprised on how the image quality improved since the first season, but the story itself wasn't something I could enjoy. I was more a break than an actual plot. I really prefer the first season over this one, but it's always good to see more \"Plot\" than just plot. ¬w¬\r\nEspañol:\r\nLlegué a ver \"Motto To LOVE-Ru\" porque estaba en un frenesí. En los primeros cuatro días ví la primeratemporada, y enseguida vi la temporada / cortos / especiales de \"Motto\". Me sorprendió la forma en que la calidad de imagen mejoró desde la primera temporada, pero la historia en sí no fue algo que disfruté. Fue más un descanso que una trama real. Realmente prefiero la primera temporada, pero siempre es bueno ver algo de \"Trama\" que simple trama. ¬w¬",
            "date": "2016-04-14T17:28:00+00:00",
            "helpful_count": 7,
            "mal_id": 216386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4871999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/linkuan",
                "username": "linkuan"
            },
            "url": "https://myanimelist.net/reviews.php?id=216386"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 8\r\nMotto To LOVE-Ru is a show that brings in the goodness of fanservice at your doorstep just like the first season, except it's even better! With new characters and perspective on previous ones, there is a guarantee for enjoyment to blossom at each episode.\r\nPreviously on To LOVE-Ru. Episodes came in like a filler trainwreck and the cargoes that toppled out were too heavy to really be enjoyable to carry. I mean, the contents inside were too similar, so there really was no point in carrying them anyways! That's my quite peculiar analogy on what Ifelt during the first season, but it gets the point across. And now, the curtains unveiled in this season and oh boy was that a welcomed surprise. How and why was it better? First thing would be the structure of the episodes. Rather than dragging the length out with one episodic story, they decided to put in three mini stories in each episode. The new structure helped in giving the diversity which was lacking in the first season. It paved way to much-needed focus on the cast of girls, particularly with the beloved golden assasin and the disciplinary tsundere. What comes out of that was progression on the romance life of many girls, along with the development of their personality showcasing the sides they never truly shown before. The culmination of each girl's differing personalities added up into many fun and silly situations that made them so likable and made me laugh. Though all that said, this season still came with issues. Some comedy were not funny and even though it's an ecchi, the dragged on fanservice may get excessive at times. But while there was a bit of boredom here and there mostly due to lesser-than-previous-season repetition, their entertaining pureness overweighed most of these issues. Main boy Rito went through so much ever since he became unlucky that I got to hand it to him for dealing with everything. Keep up the good work!\\n\\n\r\nAnd with that out of the way, we do a hop and a skip to the visuals of the anime! At first glance, the difference was definitely there if we compare it to To LOVE-Ru. Just like how Lala can transform her clothes with the help of Peke, the anime also did a transformation in its art style. The biggest difference was that the brightness of the colors were whitewashed so some slight color were lost there. It took a bit of time to get used but in the end, I really liked how it looked. In a way it's an upgrade, especially when the lines still felt refined and the animation was quite normal and consistent. There was a couple of noticeable ones where the art was amplified, especially in the more significant scenes that appeared throughout the show. As for the character designs, no change in there and they all looked youthfully cute (except the principal). Ecchi scenes were still as exaggerated as ever with more gloss to define the curves, so nothing really new there. When the characters goes through all sorts of havoc, they came in with a bunch of expressions and of course the white-eyed one that's really common in comedic anime was no exception. From happiness to clumsiness, whatever face they decided to put on, it placed a smile on my face. Especially with that Celine. Her non-stop smiles were too contagious. Most scenes were blasted with loudness and energy radiating out of the girls. Definitely can't see Rito taking a break with that going on in his life. Cheerful soundtracks complemented with the tone and the character's voice acting were done well, capturing the charmingness of each character.\\n\\n\r\nMotto To LOVE-Ru is simply a step up to the previous season. It's an improvement on pretty much all aspect, and that's a good thing because better enjoyment comes out of better quality. If To LOVE-Ru is an enjoyment that reaches the Moon, then this one had enough fun comedy, romance, and personality to reach Mars. This journey of harem and ecchi is awaiting you!",
            "date": "2018-04-02T10:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 276541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=276541"
        },
        {
            "content": "To love ru or not to love ru? That is the question. Being the first ecchi ever watched, and one of the first 10 anime in general, it held a certain place in my heart as i was exposed to the world of this genre. Captivated by that new experience I remembered it when i saw that a second season was airing. So i tested the waters of the sequel to something that had remained untouchable for so long.\r\nExpectation: 7\r\nEpisode Scores: -,-,-,-, 7, 6, 7, 8, 7, 7, 9, 7\r\nActual: 7 (Good)\r\nHalf as long as the first season, and having a heck lot more materialto work for it is obvious which was superior. I had read the manga, mindlessly mind you, and they picked only the best chapters; or rather they picked the top 36. Divided into 3 parts per episode it stays true to its wacky random antics and everyone gets their fair share of trouble. I mean literally everyone, because they put effort into spliting the air time evenly with all the characters. The majority of the comedy is still dependant on ecchi humor and slapstick.\\n\\n\r\nHowever due to the true comedy format of short segments, there was not that much character development at all. Despite some good scenes, the relationships stayed relatively unchanged and it left me sort of disappointed. It might of been my foolishness in expecting a couple to form when i watched the first season, but i regained that hope only to be shattered yet again.\\n\\n\r\nMotto to love-ru gives just that, more to love-ru. It is slightly better than the first season due to it being condensed into only the best parts, but that can only improve it so much.",
            "date": "2011-01-04T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 33440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33440"
        },
        {
            "content": "Motto to love ru, i think is a really good well made anime. This anime gives you exactly what it says it will give you. There are no surprises.\r\nI dont think this anime is a masterpiece and is not one that gives you like crazy feelings that you want to cry.\r\nNo, this anime isnt like that. This anime is one of those animes that it just fun to watch and makes you feel really good inside and while you watch it you will smile.\r\nArt- (9) The art in this anime is perfect this kind of animation suits the anime itself perfectly also which you willnotice as you watch\\n\\n\r\nCharacters - (8) The characters are great. There is basically every type of character in this anime from the clueless happy one to the devious but good at heart one.\\n\\n\r\nStory - (8) The story is very unique and original, I definitely have never seen an anime like this one before so I would give it a(9), but because i favor animes with romance and action with some comedy thrown in this gets an (8)\\n\\n\r\nOverall if you look at the genres of this anime and you happen to like them, then you will most definitely enjoy this anime as i did. What the genres tell you that you will get in the anime are exactly what you will get.\\n\r\nI definitely recommend this anime to all people.",
            "date": "2012-10-13T07:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 74807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asdcvvbbd1",
                "username": "asdcvvbbd1"
            },
            "url": "https://myanimelist.net/reviews.php?id=74807"
        },
        {
            "content": "Well as you probly know motto to LOVE-ru is the sequel To LOVE-ru. They are very alike in alot of aspects but if your looking for more LOLs, ROFLs, and LMAOs then your probly looking for this. With the new season they step up there game by making it much funnier and (not exhilarated) much more perverted i will bet you any amount of money people will wait on the uncensored version for this one. ;)\r\nO K first off...\r\nStory:9\r\nWhen you think about it there is not really plot or story to it, its mostly just rito getting himself into hopeless situations and getting beat upafterwards xD There was defiantly more plot in the first season but this one with make you LOL so hard you won't care. \\n\\n\r\nArt: 9 \\n\r\nOk, with motto to love-ru they have a whole new way of drawing the characters they are draw completely different (but of course you can who the old characters are). I like the art better than the last one its modern but they do have alot of animation on the chest area if your into that. e.e \\n\\n\r\nSound:8\\n\r\nNot much to rate on sound cause they don't use sound effects alot alot but opening i was fond of and the ending was pretty good too.\\n\\n\r\nCharacters:10\\n\r\nstill the funny as ever characters from to love-ru and more such as lala's sisters Nana, and Momo, and also Celine\\n\\n\r\nEnjoyment:9\\n\r\nVery enjoyable and very funny, since theres no main story your just thinking what could happen next and how worse could rito's life could get.\\n\\n\r\nOverall:9\\n\r\nGreat anime if you like comedy, harem, and ecchi",
            "date": "2010-12-31T04:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 33251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/absolute_soul",
                "username": "absolute_soul"
            },
            "url": "https://myanimelist.net/reviews.php?id=33251"
        },
        {
            "content": "What can I say about this season that I didn't with the first one, now this one apparently is the first season to follow the manga. But to people who haven't read the manga, this new season didn't feel any different from the first. Motto was just as fun as the first season (only shorter) but some of the plot holes, like how Celina came into the show in the first place aren't really explained. Overall, this is a fun watch and I recommend it to anyone who likes a good romantic comedy.",
            "date": "2014-08-01T18:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 154809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=154809"
        },
        {
            "content": "Motto To Love-Ru is the sequel to the first season of To Love-Ru.  If you have not figured that out then you just fell down a cliff.  \r\nSince this is the second season which was dearly needed to help the first one, I was caught a bit off guard because the first season had much intail with the story while this season was more along the lines of random adventures that you could see in Hayate no Gotoku.  But even though this season was more of a circle jerk of different stories with each episode containing 3 different stories, I was fairlyentertained.  If you are into that type of romance then by all means watch it.  But if you are looking more for the continuation of the story, then I would say don't really go a watch it.\\n\\n\r\nI was able to find this anime uncensored so this added to the value a bit of enjoyment since I am a firm believer of not censoring things.  If you are squeemish to nudity then there is a censored version. \\n\\n\r\nThis review was quite short but, eh who cares. Till Next Time.",
            "date": "2011-06-09T18:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 37710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/434514.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LoneAngel",
                "username": "LoneAngel"
            },
            "url": "https://myanimelist.net/reviews.php?id=37710"
        },
        {
            "content": "I really enjoyed the first TL-R series, this one was better for a number of reasons. First was that, unlike the first series, Motto TL-R followed closely to the manga, without putting additional plot points. Each episode is split into 3 sub-episodes, with each of those covering a particular chapter from the manga; for the most part the sub-episodes are actually named after the chapters on which they're based with a few notable exceptions--more about this at a later time.\r\n          The major liberty taken from themanga was the use of the entire cast from the start. This wasn't necessarily an issue; however; it took some 162 chapters of the manga to get Yuuki's entire harem assembled. Most character explanations and backgrounds are taken care of in the first sub-episode but done briefly (From the Beginning) through exposition. It is assumed that most viewers of the anime are already familiar with the basics of the TL-R universe, and the series serves to fill in gaps that have been left out by the first series. Also notable is that the chapter order bears no real relation with the order of the episodes; characters are sometimes added as needed, but seamlessly. \\n\\n\r\n          The reason this works is that the chapters used for the anime were more the side-stories and not in the major plot arc; for example, no appearance of King Deviluke and Zastin only shows up briefly once or twice of the manga. The only real arc in the series as a whole is the developing friendship/crush/romance between Mikan and Yami, dealt with in several episodes. Yui's feelings for Rito are given some multi-episode treatment as well; the Haruna/Lala/Rito triangle is taken as obvious (to the viewer) from the start.\\n\\n\r\n          I enjoyed the art style and the animation was good as well. It had great scenes of humor which I really enjoyed. I was a fan of the original series like I mentioned.\\n\\n\r\n          The final episode is the final four chapters of the manga, encompassing the \"I Love You\" story arc, and ends with the same hilarious nonsense as the manga. And this leaves space for more series in the future. Hopefully...",
            "date": "2012-03-24T18:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 56821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Zephyrat",
                "username": "Zephyrat"
            },
            "url": "https://myanimelist.net/reviews.php?id=56821"
        },
        {
            "content": "Your level of enjoyment while watching To Love-Ru is directly proportional with how hard a boner you've got. If your boner is as hard as titanium as you watch this, then this anime may very well be a ten for you. Unfortunately, while I was watching mine was only as hard as concrete.\r\nTo Love-Ru is a great epitome of all the fan service animes out there. It is the anime to go to if all you want to see is boobs, butts, and a faceless boring male lead who all the girls wanna be with. You could easily put yourself in his shoes and imagineyourself doing all the perverted things.  \\n\\n\r\nTo Love-Ru has no shame at all. While the first season actually had something that resembled a plot (introduce a new girl, have the new girl fall in love with Rito. Not to mention the plot regarding the king of the universe), Motto has nothing like that. The anime consists of several short segments, one episode usually housing two or three of them. Within these segments, something unique occurs. For instance, in one segment Lala invents a gender swapping machine. Anyways, these plot devices exist for the sole purpose of getting Rito, our male lead, into as many perverted situations as humanly possible. And oh boy does Rito deliver. Throughout this short 12 episode anime, Rito will get his hands on every pair of breasts and every butt, get his face between every pair of legs, undo every bra, pull down every pair of underwear, you name it. He'll see every female naked at some point, and every female will see him naked at some point.\\n\\n\r\nTo Love-Ru's perversions are almost all 'accidental perversion'. What I mean by this is Rito is a goody two shoes that never has perverted thoughts on his mind. The only way he gets into perverted situations is by tripping, getting catapulted into, being mind controlled, or whatever into them. What this means is almost every segment consists of the following formula: Rito or a girl gets attacked, Rito falls over the girl, Rito and the girl realize his hand is on her boob, the girl gets pissed. Rinse and repeat. Especially in the first 7-8 episodes, this was the entirety of Motto To Love-Ru. You should be able to guess how repetitive it gets. \\n\\n\r\nBut hey, it's hot, right? Yeh, it's hot. There's a looooooot of girls, so chances are high at least one of them tickles your fancies. Unfortunately, there's only one Rito, and all the girls have to take turns getting into perverted situations with him. As such, in order to enjoy everything that is Motto, you need to already be really really aroused, such that every situation will just turn you on more, despite the poor plot and annoying Rito. \\n\\n\r\nHowever, we reach a problem which is in all fan service anime: it never actually goes all the way into hentai. Nobody will ever kiss nor do anything above that ever in Motto. This means that no matter how aroused you get from watching it, the show will never be anything more than a cock tease. After watching Motto To Love-Ru, you're most definitely going to need some supplemental doujins or hentai games to truly be satisfied. You might be better off watching some hentai right from the start.\\n\\n\r\nThere is one good thing about watching this show, and that is that it has a LOT of doujins. Those Japanese fans have drawn a doujin for every girl in the show (except for Run for some reason), so even if you're unsatisfied after watching a few episodes of Motto, all you need is the internet and you're bound to find a doujin to take you all the way.",
            "date": "2012-10-13T09:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 74813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=74813"
        },
        {
            "content": "To love ru and mottoe to love ru i one of the most funniest ecchi and romance ive seen. Girls just keeps piling up on the main protagonists(luck Ba**tard). Hope the harem kees going.",
            "date": "2012-03-27T13:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 57141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kerweezyy",
                "username": "kerweezyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=57141"
        },
        {
            "content": "I'll say this right away. Motto To Love-Ru is a massive improvement compared to To Love-Ru. To be fair, To Love-Ru was the first season of the anime, and with that series' success, I suppose it's only natural for the next season to have much higher quality all around!\r\nStory: MTLR has a lot of different little scenes packed into each episode, but the good thing is, at least there's some continuation between them. At times, it feels like some scenes should have gone longer but it doesn't really matter. It was a great show.\r\nArt: A very significant improvement, the art in MTLR compared to TLRis definitely quite noticeable. Character faces have more detail, hair has more detail, the environment is much more detailed. I had to pause several times just to be able to enjoy the hilarious character expressions!\\n\\n\r\nSound: I think the sound is a lot calmer in this series? I found that TLR's sound, such as music, was often much too fast-paced. It's still pretty fast paced in MTLR but I feel the sound's a bit better this season.\\n\\n\r\nCharacters: Another major improvement was the characters. Somehow, in just twelve episodes, a lot of the series' characters actually had quite a bit of development and interesting scenes. Save for a few though. I like how much deeper we get to understand characters like Yumi, Katagawa, Momo, Nana, and Run. It goes without saying there's a lot of focus on Haruna, Yuuki, and Lala!\\n\\n\r\nEnjoyment: At times I felt teary eyed due to the romance, which is a good thing. At other times, I couldn't stop laughing!\\n\\n\r\nOverall: Absolutely hilarious, and the show has definitely gotten a lot better. Can't wait to see what happens next!",
            "date": "2018-09-21T06:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 289573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289573"
        },
        {
            "content": "Story (6/10) - One of the first noticeable differences with Motto To LOVE-Ru and its predecessor is that Motto is divided into three little mini-episodes. Does that hinder the story in any way? No, but it doesn't really help the fact that there isn't really an overarching storyline.\r\nArt (7/10) - Another notable difference is the art in Motto. It has a more modern feel (2010) than the prequel series.\r\nSound (6/10) - I'd say the biggest improvement would be the music. The tone of the intro and outro seemed better than before, as well as the visuals along with it.\r\nCharacter (8/10) - I feel like themain aspect of this series was to develop Rito's feelings and the feelings of those around him.\\n\\n\r\nEnjoyment (7/10) - I enjoyed Motto To LOVE-Ru about as much as I did To LOVE-Ru and the OVAs, and I can't wait to start watching To LOVE-Ru Darkness.\\n\\n\r\nOverall (6.8/10) - Motto To LOVE-Ru is essentially more about character development than anything else. I feel as thought its main purpose was to build up for the third series, To LOVE-Ru Darkness.",
            "date": "2017-11-07T09:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 262733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=262733"
        },
        {
            "content": "When it comes to an anime like this, you know that it's going to be filled with ecchi and perverted moments galore. But what you didn't know is that this anime, aside from other ones just like this, actually has good, enjoyable characters with a good backstory. \r\nThis is basically a continuation from where we left off in the OVAs'. Rito is still being accused of being the \"accidental pervert\" that he is. And the funny gags that are in just about every episode are even more so, but the question is. WHY does this anime deserve the score I gave.\r\nLike I said before, thisseries has a good backstory and a ton of characters that make up for it. But is it at all justified? Let me elaborate a bit deeper. What you will get about 60% of the time will be accidental perverted moments including Rito and an enraged girl who beats the hell out of him for his \"accidental\" accident. The other 40% of the time you will get serious moments that sort-of tie in with the plot for the moment. Most episodes are filled with filler, and while that's not a bad thing, if you like a serious story with extremely intricate characters and a evolving backstory, then this anime is NOT for you. Let me repeat, this anime does NOT contain any extreme intricate characters or plot that will make your eye balls pop out from being dazzled. This anime is purely for the \"fun\" of being a good anime with a lot of laughs.\\n\\n\r\nThe sound and art of this one are, meh. They're good enough to enjoy in the moment, but there are no visuals that captured my eyes and made me say wow. And I'm not completely sure, this may just be me, but the characters look slightly different in this series than in their older predecessors. The OP is alright, not too catchy, but does stick in your head for a bit.\\n\\n\r\nLike I said before, the characters are definitely a good reason to keep watching this. Most of them are sort-of one-dimensional, but they all add to the funny moments to keep the show as interesting as it is. I must admit, the most interesting character in this anime is Yui Kotegawa. She may be the most uptight character in the show, but she has some dynamic. I would state the rest of the characters, but there are so many so I'll just say this. They are all good in their own ways. However, the lot of the main characters are definitely the most interesting.\\n\\n\r\nSo like I've said before, if you come to this anime expecting outstanding characters and a dynamic story, well you're dreaming. You will, for the most part, be laughing and maybe feeling a bit uncomfortable as you're put in the shoes of Mr. Rito a LOT when he get's himself into trouble. But for the most part, this anime is very entertaining but has a bit of filler that may take you away from what we're ultimately trying to get at. I recommend you give this one a watch.\\n",
            "date": "2017-10-18T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 261154,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=261154"
        },
        {
            "content": "The second installment of the To Love-Ru series, I can at least say Motto To Love-Ru was better than the first series. If you were disappointed by the first one, have some hope for this one is much improved. \r\nStory: 6/10\r\nMotto To Love-Ru adapts the same kind of storytelling that the first one used: a bunch of random filler episodes that don't have that much plot movement. The difference this time is the producers distinctly tell you that each episode is stand-alone (one 24 min ep is actually three mini-eps that are unrelated, but all have their own titles), which gives the audience a sensethat they are about to witness a casual 8 minute mini-episode that serves only comedic purposes. This small detail of simply naming each mini-episode seems trivial, but it really sets up the relaxed feel which the first one did not have. That being said, again there is not much plot movement with each episode, and you could watch the episodes in random order and not miss much. But because you start each episode with the knowledge that it's not going to be serious and is going to be more like a comedy sketch, it's a vastly different feel when you watch it.\\n\r\nBut while it was an improvement from the first show, it still wasn't a \"good\" story if we're speaking in terms of all anime out there because it still follows the format of having random filler episodes rather than telling a longer and more well-developed story. \\n\\n\r\nArt: 10/10\\n\r\nThe first thing you'll probably notice is the huge improvement in art, so congrats to the studio for being able to provide better animation! No complaints here. \\n\\n\r\nSound: 10/10\\n\r\nI liked the opening for the first one and I liked it for this one too. No complaints for any of the sounds during the show either.\\n\\n\r\nCharacter: 7/10\\n\r\nI think that Motto To Love-Ru really tried to focus on character development in this second installment, and while they do a pretty good job of it, it sacrifices the development of Rito and Lala, a relationship that I enjoyed watching in the first series. Instead, all the other characters in his harem are further developed, but if you're a fan of Rito x ______(someone other than Lala), then Motto To Love-Ru will be pretty enjoyable for you since minor characters like Kotegawa, Yami, and Nana reveal what they truly think about Rito. Like I said, this means Rito and Lala don't really have much improvement in their relationship until the very last few episodes, so this is more of a personal opinion I have about character development. Overall, their goal was to evenly develop all of the other characters since the first show focused so much on Rito and Lala, and they definitely achieved it here.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI actually did enjoy this one a lot more than the first one since I could start each episode knowing that it was a comedy and actually laugh at some of the scenes. It's a comedy, which is meant to be relaxing and humorous, and that's what this show did. \\n\\n\r\nOverall: 7/10\\n\r\nA clear improvement from the first show, but still not a very strong anime. It didn't have any glaringly bad aspects, but also not much creative and new content either that you haven't seen in other shows. For To Love-Ru fans, however,  who have seen the first one, it should be a relief to watch a sequel that is much better.",
            "date": "2014-04-17T15:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 140337,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=140337"
        }
    ],
    [
        {
            "content": "I personally love ''To LOVE-Ru'' and the new Motto To LOVE-Ru. In the first season it's a story about the girl called Lala, which apparently met Yuuki Rito in the washroom. Lala wants to get married to Yuuki due to his kindness from saving her multiple times. However, Motto To LOVE-Ru gets more interesting. They add numerous random scenes per episode. It really isn't a story that relates to each episode, but it's a different way of telling the story. I'm reading the manga on a daily basic. So far it kind of matches up, but not a lot. I recommend this type of animeto people that like ecchi, romance, and comedy. \\n\\n\r\nStory (8/10)\\n\r\nEach story has a new problem towards nearly all the characters in the story. The story is getting more into the comedy section, such as when Yuuki is turned into a dog, because Lala inventions. He also had to lick every part of Haruna's body, because Haruna's dog said so! (cough even a dog is perverted). Yuuki in season two is more developed and more mature then he was in season one. Yuuki quoted, ''The most important thing is not the outside, but the inside''. (Cough that's what she said xD), sounds wrong at first but he is more kind, and generous towards the girls now in season two. I also like how Golden Darkness or (aka) Yami! is developing feelings toward Yuuki. Even though she has a mission to kill him, she is seeing how good of a person Yuuki is. Overall the story is made for comedy, so far not a lot of intense or serious episodes/scenes. So far I'm more interested how the relationship between Yuuki and Lala develops.\\n\r\n-Yami Forever!-\\n\\n\\n\r\nArt (9/10)\\n\r\nThe art was a lot better then the first season when i compared both. The color and the design was nearly perfect, except for the white blocking. The white blocking or white flash is used for blocking the parts of the story where its too Ecchi or perverted. If they could take out that white flash, then i would of gave the art 10/10, and it would make a lot of people happy. Overall i though art was well done.\\n\\n\r\nCharacter (10/10)\\n\r\nMost characters in season one changed either physically or mentally. Lala is getting more out of hands, using her inventions and making them. Yami is now not that aggressive as she was in season one. She is more kind and is trying new things, also Yami is maybe.. Liking Yuuki to a certain degree. I think Yami has a crush on Yuuki Rito, because she usually blushes when shes near him or when his helping her. Haruna and Yui is developing feeling for Yuuki. Such as, when Yui was sick, Yuuki came to deliver some paperwork, but there stay was longer then expected. Haruna is showing more that she likes Yuuki, but she really hasn't confess to him yet in season two. Overall i like how the characters are much different from season one, but not too different. They added some changes that i personally love.\\n\\n\r\nEnjoyment (10/10)\\n\r\nI enjoyed season one, but season two is where the action and comedy steps in. It makes me laugh much more then usually, also there is more ecchi scenes in season two which adds some kick! I'm also enjoying how each character is starting to develop a feeling towards Yuuki Rito. I personally enjoyed the first eight episodes so far and hope it gets better forward. Why i watch Motto To LOVE-Ru is because of Golden Darkness/Yami, because shes so CUTE! and starting to have feelings toward Yuuki!.\\n\\n\r\nMy Dislikes and Cons\\n\r\nMy dislikes for Motto to LOVE-Ru is waiting for the new episodes.\\n\\n\r\n   I hope you enjoy this review :)",
            "date": "2010-12-01T17:33:00+00:00",
            "helpful_count": 121,
            "mal_id": 32441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/412715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/XiaoYami",
                "username": "XiaoYami"
            },
            "url": "https://myanimelist.net/reviews.php?id=32441"
        },
        {
            "content": "As a fan of To LOVE-Ru, I didn't enjoy the first season at all.  I know it wasn't very faithful to the manga, but the way it was executed left a bad taste in my mouth.  However, Motto changed that by following the manga more closely, and the result?  An adaption that was enjoyable from start to finish.\r\nIf you're familiar with To LOVE-Ru, then you probably know that there's not really a driven plot.  Those that are new to TLR (which I'll refer to this series as for the rest of the review), you're not gonna expect much of a storyhere.  Since Motto follows the manga more closely, we're given about three 6-8 minute long (give or take) segments of various chapters of mainly Rito in weird, ecchi, and sometimes comedic situations, accompanied with the various side characters of TLR, with some having a segment dedicated to them.  Because of that, almost none of the episodes follow up to the next one, thereby making my point that TLR doesn't have a driven plot.  I, however, liked how each episode had different segments since it compliments the manga well.  They're both fast and easy to dive into.\\n\\n\r\nThe art has slightly improved from the first season (ooooh shiny), but the animation has really improved as well, at least from my standpoint.  You may also notice that in the censored broadcast, in some ecchi situations, there's a \"white light out of nowhere\" covering a certain part considered ecchi.  While in some cases it's acceptable, others it just doesn't seem needed at all.  Luckily for me (and hopefully for you), I was able to watch the uncensored broadcast, which to me, is what makes TLR enjoyable in the first place. *wink wink*\\n\\n\r\nThough I feel that sound wasn't a big factor in Motto, the music did, however, compliment some of the scenes pretty well in order to fit the mood.  The opening theme is catchy and lively and the ending theme is easy-listening.\\n\\n\r\nBecause Motto follows the manga more closely, we're not always given an episode that focuses solely on either the two main heroines, Lala and Haruna.  Like I said earlier, some side characters get a segment of their own as well.  As for character development, almost everyone is their usual self, but with some of the girls beginning to develop feelings for Rito.  Rito himself is also coming to realize that he's developing feelings for Lala as well.\\n\\n\r\nComparing the first and second season of TLR, I honestly think that the 2nd was just simply better than the 1st season because...you guessed it...it follows the manga more closely.  Seeing some of my favorite chapters animated and having some of my favorite characters get their own segment definitely beats than having to watch something entirely stupid and pointless (ex. most of the episodes and Lala's transformation sequence in the first season).  The fanservice, in my opinion, is definitely where it needs to be since it is of course, TLR, which is known for that, and the 2nd season definitely did that a lot more than the 1st.  \\n\\n\r\nIt may seem I'm giving Motto a little more credit than it deserves, but it does have its flaws.  For those that, somehow, enjoyed the 1st season, the 2nd doesn't pick up at all where it left off, so expect that if you're going into the 2nd season.  *Spoiler Alert* You may also question to yourself as to who is that character and how *insert character* is like that since it wasn't portrayed in the anime at all, such as Celine originally being a plant, who is now in the form of a baby, or Oshizu now having a prosthetic body when she was originally a ghost.\\n\\n\r\nWith all that said, Motto TLR is a good watch...IF you happen to be a fan of the series.  They removed, in my opinion, everything that was just terrible from the first season and just made the second season better by just following the manga, which pretty much what made me enjoy Motto from start to end.",
            "date": "2010-12-28T21:51:00+00:00",
            "helpful_count": 64,
            "mal_id": 33168,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/chinoman",
                "username": "chinoman"
            },
            "url": "https://myanimelist.net/reviews.php?id=33168"
        },
        {
            "content": "Motto To LOVE-Ru\r\n WOOOOW, okay. If you’re interested in watching the To LOVE-Ru series, skip the first season and start with Motto To LOVE-Ru instead. I know I know, why in the world would I say this when I thought that To LOVE-Ru was a pretty good first season? Well the answer is mega simple; To LOVE-Ru ends in a way that lets Motto start off in a very much “let’s start all over” again sort of way. It’s ecchier/lewder, the art style is changed/upgraded to match the To LOVE-Ru ecchi aspects and it’s a huge over haul. Sure, it may take a while toget used to the characters, since there is a ton of girls to remember, but honestly, starting with Motto is far far far better. It’s not just art that changed too; the way the episodes are shown has changed as well. Instead of being forced to watch a 23 minute episode of sometimes archaic and rather ridiculous scenarios, Motto To LOVE-Ru employs a new tactic, each episode (except for the last one) is cut into 5-9 minute chunks; what this means is that in a 23 minute episode, we the viewers, are able to watch 3 different plots/stories/scenes/thing…. It works so unbelievably well; since the biggest issue I had with To LOVE-Ru (even if I didn’t mention it) was how dragged out some episodes were, especially since To LOVE-Ru was 2-cour.\\n\\n\r\n Motto To LOVE-Ru takes what To LOVE-Ru did really well in and makes it a whole ton better, it also fixes all the issues I had with the first season. If you really like the older art style (I know I liked it a ton), you can give To LOVE-Ru a watch, but aside from knowing who’s who, you’re not missing much by skipping the first season, that’s my honest opinion.\\n\\n\r\n Motto starts off a little later in time after To LOVE-Ru ended and the first episode, the first 10 seconds, really sets off with a “Hey you, yeah…you, you’re watching this for lewd ecchi goodness, don’t forget that”. Momo, Lala’s younger sister is in Yuuki’s bed and her head is near his crotch, so uhm, yeah it’s the perfect way to introduce everyone back into the To LOVE-Ru universe. Because of the episodic changes, Motto actually has 36 “episodes” and each episode is executed perfectly. To LOVE-Ru did a poor job giving meaning to the girls, Motto fixes this big time. Each girl gets at least one “episode” of exposition, I’d honestly say most get around 2 and then some. This makes it a lot easier to understand why they like Yuuki to begin with and that’s huge, giving characters a reason is something all anime should strive for, even if it’s a shameless ecchi anime. Yami, Mikan, Saki, Kotegawa, Oshizu, Lala, Haruna, Momo, Nana, Run, Celine, they all have episodes dedicated to them and their feelings, their likes and it’s incredible. Of that entire list, Celine, Momo and Nana are new to To LOVE-Ru; Celine is a super cute sunflower child that Lala gave to Yuuki on his birthday (from the OVA if you paid attention), every time she’s involved in an episode, hilarity ensues and she’s just too adorable!, Nana and Momo are Lala’s imouto, running away from the planet Deviluke, they live with Lala, Mikan and Yuuki. Momo has some of the best episodes in this entire anime and Nana eventually grows to like Yuuki, as additions to the cast, they’re fantastic and entirely lovable",
            "date": "2015-09-09T18:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 198243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568362.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_Arcadia0",
                "username": "_Arcadia0"
            },
            "url": "https://myanimelist.net/reviews.php?id=198243"
        },
        {
            "content": "Sequels. They really are a world on their own. A few maintain the success from the first series and are able to carry it onwards. Others attempt the same, but cannot compare, yet still provide an enjoyable ride. And then there are cases like Motto To Love-Ru, where you watch the same thing yet it feels like something completely different.\r\nBefore anything else, I have watched the first season and really enjoyed it. Then came the OVA, also enjoyable. Then came the sequel. And for some reason, within a few episodes the feeling the first series gave me completely left me. Now I find myself recognizingthe characters and seiyuu but nothing else from the first season. Where has it gone? Let's take a bite at figuring that out.\\n\\n\r\nTo Love-Ru is known as a romantic comedy. Our harem lead is Mr.Nice guy, caught up in a love triangle between A) a cute and shy girl he's had a crush on for a while and B) a busty / childish alien that fell from space and makes him go through alot of adventures. The first season portrayed this well; between the laughs was also room for plot development and romance. A nice mix along with a good production value that made for an enjoyable ride.\\n\\n\r\nIn the second season however, I can only see a ton of fanservice and a story that is (at the moment I write this) not progressing anywhere. The charm of season I is a relic of the past, replacing it is a display of how magical the sun rays are once again, conveniently censoring everything that comes into the screen. And in a series that is mainly about fanservice..it tends to beat the point.\\n\\n\r\nIn a nutshell, Motto To Love-Ru supports the notion a recent article on Sankaku made about the anime industry becoming a porn industry. You want fanservice? Watch it. You want anything else? Do not watch it. A simple logic that should save both you and me quite some time.",
            "date": "2010-11-21T04:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 32212,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152508.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stigs",
                "username": "Stigs"
            },
            "url": "https://myanimelist.net/reviews.php?id=32212"
        },
        {
            "content": "OK...\r\nThe sequel to  To-love RU...\r\nSadly it can't even compare to the original..\r\nThis sequel really destroyed everything in the show..\r\nArt:Well it looks like they changed how characters look a bit...They all seem shinier and pretty much better than before\r\nSound:Can't really comment here..the only music we get to hear is the op and ending which is ok..not great but ok\r\nCharacters: Nothing new..Everyone is still the same...if not worse...The main character Yuuki Rito seems to be even shier than before...They made him an even bigger douche than before..which is amazing...But really annoying as time passes..Lala is still the wacky ,happy , strange girl like in the firstpart..The rest are just plain and pretty much the same boring and annoying characters as before\\n\\n\r\nEnjoyment: Where is the enjoyment..? Every episode is the same really...Either 1:Lala creates a machine that fucks up Rito in some kind of way... 2:A day where Rito is alone with some other girl that's in love with him (every girl qualifies) ..It's so boring and predictable...Hey look fanservice...flashing beam of light hindering  fanservice...Yuuki Rito looks at fanservice....Stands like an idiot...Girl slaps him....that's the whole plot of this show\\n\\n\\n\r\nOverall: A sequel that is failing miserably.....I'm watching it cause I'm curious on what's gonna happen and if there is a possible chance of improvement but no....there is no improvement    \\n\\n\\n\r\nOverall score: 5  Mediocre seems to fit this sequel..",
            "date": "2010-11-26T09:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 32314,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366633.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Reaper_1992",
                "username": "Reaper_1992"
            },
            "url": "https://myanimelist.net/reviews.php?id=32314"
        },
        {
            "content": "Motto: to-LOVE-ru\r\nFinally, the much awaited sequel to a show that hundreds if not thousands demanded have a sequel. Oh, when the OVA came out, that was not enough. The cries of the people rang in the ears of the producers, who then had to oblige. At last: a sequel that’s a sequel. They’ve kept us waiting long enough, right? But wait…is THIS what I’ve been waiting for?\r\nStory:\r\nWhat story? So far, all it is is a continuation of the first season. Not a sequel. Just an OVA that they named all fancy and stuff. There’re really no plot (at least none seen yet ). At thevery least, the first season had a story that it tried to follow, and I say tried because there were so many arcs and so many sub plots that you kind of lost sight of what the point was – it started to look like just a slice of life genre, and you forgot that she was a big important person on Deviluke and that he was her chosen mate and that they were supposed to rule the galaxy. But, it did end on a good note. At least, that’s what I think. I’ve really been looking forward to this second season but so far I am thoroughly disappointed. \\n\\n\r\nArt:\\n\r\nThe artistic value went up slightly. I can’t say that it was a big change, but it was enough for you to notice. The only thing that’s slightly bothering me is the lighting issue. I’ve been watching this on animeseason, and every time there’s a panty shot, it’s either covered by light of dark. AND THIS IS PISSING ME OFF. Sure, coincidence that hair is directly over the nipple, fine. But these supposed “glares” on your view come out of freaking nowhere. It’s probably not the producers or directors fault or anything, but this is a dent in the art. Those shots are supposed to be there so that you can see what the character is seeing (sometimes).\\n\\n\r\nSound:\\n\r\nI’ll update this later, because I have a feeling they’re going to change the ending theme.\\n\\n\r\nCharacters:\\n\r\nLala has become even more bubbly then before. She’s also become sweeter, and the faces she makes are often priceless. All the ladies of the show are back and you can count on the fact that they’re proportions are just as big if not bigger than it was in the first season. You also meet Momo and Nana.\\n\r\nIf you read the manga (before all the manga sites got scared of posting it), then you know these characters and you’ll probably be pleasantly surprised by what you’re going to get. \\n\\n\r\nEnjoyment:\\n\r\nSo far, through all the fan service and nonsense that they’re throwing at the viewer, I can’t say that I’m not enjoying it. I’m not particularly ecstatic either, and I probably won’t be if I don’t see a plot or focus point soon. Though I like it, all it is so far is fan service. And the update will change the entire outcome of the review depending on whether or not I see a plot or definitive point to the show. \\n\\n\r\nFaults:\\n\r\nYou’re probably tired of hearing me say this, but I cannot get over the fact that the show has NO POINT. I’m watching it because I figured it would jump right back to where it left off: what happens with the earth, and what’s going on with Rito and how he’s coping with everything. But, this second series acts almost as if the ending events of the first didn’t matter. Sure, Rito remembers everything, but he doesn’t seem at all affected by it. I’d imagine that he would still be having a hard time accepting the fact that the earth was almost obliterated thanks to him and the fact that he will probably still end up ruling the universe someday if lala stays with him any longer. It just doesn’t follow the personalities that the characters had in the first season. \\n\\n\r\nOverall:\\n\r\nOverall, I just can’t wait for the season to finish. That’s about it. From here on is what will make or break this anime. I’ve pretty much gone through 7 episodes of fan service that should have been in the OVA, and now I’m ready for some more action, and I want a plot.\\n",
            "date": "2010-11-25T10:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 32297,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/389472.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xxcchaosxx",
                "username": "xxcchaosxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=32297"
        },
        {
            "content": "English:\r\nI watched \"Motto To LOVE-Ru\" because I was in kind of a race. The first four days I watched the first season, and then I got to watch the \"Motto\" season / shorts / specials. I was surprised on how the image quality improved since the first season, but the story itself wasn't something I could enjoy. I was more a break than an actual plot. I really prefer the first season over this one, but it's always good to see more \"Plot\" than just plot. ¬w¬\r\nEspañol:\r\nLlegué a ver \"Motto To LOVE-Ru\" porque estaba en un frenesí. En los primeros cuatro días ví la primeratemporada, y enseguida vi la temporada / cortos / especiales de \"Motto\". Me sorprendió la forma en que la calidad de imagen mejoró desde la primera temporada, pero la historia en sí no fue algo que disfruté. Fue más un descanso que una trama real. Realmente prefiero la primera temporada, pero siempre es bueno ver algo de \"Trama\" que simple trama. ¬w¬",
            "date": "2016-04-14T17:28:00+00:00",
            "helpful_count": 7,
            "mal_id": 216386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4871999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/linkuan",
                "username": "linkuan"
            },
            "url": "https://myanimelist.net/reviews.php?id=216386"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 8\r\nMotto To LOVE-Ru is a show that brings in the goodness of fanservice at your doorstep just like the first season, except it's even better! With new characters and perspective on previous ones, there is a guarantee for enjoyment to blossom at each episode.\r\nPreviously on To LOVE-Ru. Episodes came in like a filler trainwreck and the cargoes that toppled out were too heavy to really be enjoyable to carry. I mean, the contents inside were too similar, so there really was no point in carrying them anyways! That's my quite peculiar analogy on what Ifelt during the first season, but it gets the point across. And now, the curtains unveiled in this season and oh boy was that a welcomed surprise. How and why was it better? First thing would be the structure of the episodes. Rather than dragging the length out with one episodic story, they decided to put in three mini stories in each episode. The new structure helped in giving the diversity which was lacking in the first season. It paved way to much-needed focus on the cast of girls, particularly with the beloved golden assasin and the disciplinary tsundere. What comes out of that was progression on the romance life of many girls, along with the development of their personality showcasing the sides they never truly shown before. The culmination of each girl's differing personalities added up into many fun and silly situations that made them so likable and made me laugh. Though all that said, this season still came with issues. Some comedy were not funny and even though it's an ecchi, the dragged on fanservice may get excessive at times. But while there was a bit of boredom here and there mostly due to lesser-than-previous-season repetition, their entertaining pureness overweighed most of these issues. Main boy Rito went through so much ever since he became unlucky that I got to hand it to him for dealing with everything. Keep up the good work!\\n\\n\r\nAnd with that out of the way, we do a hop and a skip to the visuals of the anime! At first glance, the difference was definitely there if we compare it to To LOVE-Ru. Just like how Lala can transform her clothes with the help of Peke, the anime also did a transformation in its art style. The biggest difference was that the brightness of the colors were whitewashed so some slight color were lost there. It took a bit of time to get used but in the end, I really liked how it looked. In a way it's an upgrade, especially when the lines still felt refined and the animation was quite normal and consistent. There was a couple of noticeable ones where the art was amplified, especially in the more significant scenes that appeared throughout the show. As for the character designs, no change in there and they all looked youthfully cute (except the principal). Ecchi scenes were still as exaggerated as ever with more gloss to define the curves, so nothing really new there. When the characters goes through all sorts of havoc, they came in with a bunch of expressions and of course the white-eyed one that's really common in comedic anime was no exception. From happiness to clumsiness, whatever face they decided to put on, it placed a smile on my face. Especially with that Celine. Her non-stop smiles were too contagious. Most scenes were blasted with loudness and energy radiating out of the girls. Definitely can't see Rito taking a break with that going on in his life. Cheerful soundtracks complemented with the tone and the character's voice acting were done well, capturing the charmingness of each character.\\n\\n\r\nMotto To LOVE-Ru is simply a step up to the previous season. It's an improvement on pretty much all aspect, and that's a good thing because better enjoyment comes out of better quality. If To LOVE-Ru is an enjoyment that reaches the Moon, then this one had enough fun comedy, romance, and personality to reach Mars. This journey of harem and ecchi is awaiting you!",
            "date": "2018-04-02T10:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 276541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=276541"
        },
        {
            "content": "To love ru or not to love ru? That is the question. Being the first ecchi ever watched, and one of the first 10 anime in general, it held a certain place in my heart as i was exposed to the world of this genre. Captivated by that new experience I remembered it when i saw that a second season was airing. So i tested the waters of the sequel to something that had remained untouchable for so long.\r\nExpectation: 7\r\nEpisode Scores: -,-,-,-, 7, 6, 7, 8, 7, 7, 9, 7\r\nActual: 7 (Good)\r\nHalf as long as the first season, and having a heck lot more materialto work for it is obvious which was superior. I had read the manga, mindlessly mind you, and they picked only the best chapters; or rather they picked the top 36. Divided into 3 parts per episode it stays true to its wacky random antics and everyone gets their fair share of trouble. I mean literally everyone, because they put effort into spliting the air time evenly with all the characters. The majority of the comedy is still dependant on ecchi humor and slapstick.\\n\\n\r\nHowever due to the true comedy format of short segments, there was not that much character development at all. Despite some good scenes, the relationships stayed relatively unchanged and it left me sort of disappointed. It might of been my foolishness in expecting a couple to form when i watched the first season, but i regained that hope only to be shattered yet again.\\n\\n\r\nMotto to love-ru gives just that, more to love-ru. It is slightly better than the first season due to it being condensed into only the best parts, but that can only improve it so much.",
            "date": "2011-01-04T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 33440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33440"
        },
        {
            "content": "Motto to love ru, i think is a really good well made anime. This anime gives you exactly what it says it will give you. There are no surprises.\r\nI dont think this anime is a masterpiece and is not one that gives you like crazy feelings that you want to cry.\r\nNo, this anime isnt like that. This anime is one of those animes that it just fun to watch and makes you feel really good inside and while you watch it you will smile.\r\nArt- (9) The art in this anime is perfect this kind of animation suits the anime itself perfectly also which you willnotice as you watch\\n\\n\r\nCharacters - (8) The characters are great. There is basically every type of character in this anime from the clueless happy one to the devious but good at heart one.\\n\\n\r\nStory - (8) The story is very unique and original, I definitely have never seen an anime like this one before so I would give it a(9), but because i favor animes with romance and action with some comedy thrown in this gets an (8)\\n\\n\r\nOverall if you look at the genres of this anime and you happen to like them, then you will most definitely enjoy this anime as i did. What the genres tell you that you will get in the anime are exactly what you will get.\\n\r\nI definitely recommend this anime to all people.",
            "date": "2012-10-13T07:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 74807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asdcvvbbd1",
                "username": "asdcvvbbd1"
            },
            "url": "https://myanimelist.net/reviews.php?id=74807"
        },
        {
            "content": "Well as you probly know motto to LOVE-ru is the sequel To LOVE-ru. They are very alike in alot of aspects but if your looking for more LOLs, ROFLs, and LMAOs then your probly looking for this. With the new season they step up there game by making it much funnier and (not exhilarated) much more perverted i will bet you any amount of money people will wait on the uncensored version for this one. ;)\r\nO K first off...\r\nStory:9\r\nWhen you think about it there is not really plot or story to it, its mostly just rito getting himself into hopeless situations and getting beat upafterwards xD There was defiantly more plot in the first season but this one with make you LOL so hard you won't care. \\n\\n\r\nArt: 9 \\n\r\nOk, with motto to love-ru they have a whole new way of drawing the characters they are draw completely different (but of course you can who the old characters are). I like the art better than the last one its modern but they do have alot of animation on the chest area if your into that. e.e \\n\\n\r\nSound:8\\n\r\nNot much to rate on sound cause they don't use sound effects alot alot but opening i was fond of and the ending was pretty good too.\\n\\n\r\nCharacters:10\\n\r\nstill the funny as ever characters from to love-ru and more such as lala's sisters Nana, and Momo, and also Celine\\n\\n\r\nEnjoyment:9\\n\r\nVery enjoyable and very funny, since theres no main story your just thinking what could happen next and how worse could rito's life could get.\\n\\n\r\nOverall:9\\n\r\nGreat anime if you like comedy, harem, and ecchi",
            "date": "2010-12-31T04:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 33251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/absolute_soul",
                "username": "absolute_soul"
            },
            "url": "https://myanimelist.net/reviews.php?id=33251"
        },
        {
            "content": "What can I say about this season that I didn't with the first one, now this one apparently is the first season to follow the manga. But to people who haven't read the manga, this new season didn't feel any different from the first. Motto was just as fun as the first season (only shorter) but some of the plot holes, like how Celina came into the show in the first place aren't really explained. Overall, this is a fun watch and I recommend it to anyone who likes a good romantic comedy.",
            "date": "2014-08-01T18:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 154809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=154809"
        },
        {
            "content": "Motto To Love-Ru is the sequel to the first season of To Love-Ru.  If you have not figured that out then you just fell down a cliff.  \r\nSince this is the second season which was dearly needed to help the first one, I was caught a bit off guard because the first season had much intail with the story while this season was more along the lines of random adventures that you could see in Hayate no Gotoku.  But even though this season was more of a circle jerk of different stories with each episode containing 3 different stories, I was fairlyentertained.  If you are into that type of romance then by all means watch it.  But if you are looking more for the continuation of the story, then I would say don't really go a watch it.\\n\\n\r\nI was able to find this anime uncensored so this added to the value a bit of enjoyment since I am a firm believer of not censoring things.  If you are squeemish to nudity then there is a censored version. \\n\\n\r\nThis review was quite short but, eh who cares. Till Next Time.",
            "date": "2011-06-09T18:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 37710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/434514.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LoneAngel",
                "username": "LoneAngel"
            },
            "url": "https://myanimelist.net/reviews.php?id=37710"
        },
        {
            "content": "I really enjoyed the first TL-R series, this one was better for a number of reasons. First was that, unlike the first series, Motto TL-R followed closely to the manga, without putting additional plot points. Each episode is split into 3 sub-episodes, with each of those covering a particular chapter from the manga; for the most part the sub-episodes are actually named after the chapters on which they're based with a few notable exceptions--more about this at a later time.\r\n          The major liberty taken from themanga was the use of the entire cast from the start. This wasn't necessarily an issue; however; it took some 162 chapters of the manga to get Yuuki's entire harem assembled. Most character explanations and backgrounds are taken care of in the first sub-episode but done briefly (From the Beginning) through exposition. It is assumed that most viewers of the anime are already familiar with the basics of the TL-R universe, and the series serves to fill in gaps that have been left out by the first series. Also notable is that the chapter order bears no real relation with the order of the episodes; characters are sometimes added as needed, but seamlessly. \\n\\n\r\n          The reason this works is that the chapters used for the anime were more the side-stories and not in the major plot arc; for example, no appearance of King Deviluke and Zastin only shows up briefly once or twice of the manga. The only real arc in the series as a whole is the developing friendship/crush/romance between Mikan and Yami, dealt with in several episodes. Yui's feelings for Rito are given some multi-episode treatment as well; the Haruna/Lala/Rito triangle is taken as obvious (to the viewer) from the start.\\n\\n\r\n          I enjoyed the art style and the animation was good as well. It had great scenes of humor which I really enjoyed. I was a fan of the original series like I mentioned.\\n\\n\r\n          The final episode is the final four chapters of the manga, encompassing the \"I Love You\" story arc, and ends with the same hilarious nonsense as the manga. And this leaves space for more series in the future. Hopefully...",
            "date": "2012-03-24T18:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 56821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Zephyrat",
                "username": "Zephyrat"
            },
            "url": "https://myanimelist.net/reviews.php?id=56821"
        },
        {
            "content": "Your level of enjoyment while watching To Love-Ru is directly proportional with how hard a boner you've got. If your boner is as hard as titanium as you watch this, then this anime may very well be a ten for you. Unfortunately, while I was watching mine was only as hard as concrete.\r\nTo Love-Ru is a great epitome of all the fan service animes out there. It is the anime to go to if all you want to see is boobs, butts, and a faceless boring male lead who all the girls wanna be with. You could easily put yourself in his shoes and imagineyourself doing all the perverted things.  \\n\\n\r\nTo Love-Ru has no shame at all. While the first season actually had something that resembled a plot (introduce a new girl, have the new girl fall in love with Rito. Not to mention the plot regarding the king of the universe), Motto has nothing like that. The anime consists of several short segments, one episode usually housing two or three of them. Within these segments, something unique occurs. For instance, in one segment Lala invents a gender swapping machine. Anyways, these plot devices exist for the sole purpose of getting Rito, our male lead, into as many perverted situations as humanly possible. And oh boy does Rito deliver. Throughout this short 12 episode anime, Rito will get his hands on every pair of breasts and every butt, get his face between every pair of legs, undo every bra, pull down every pair of underwear, you name it. He'll see every female naked at some point, and every female will see him naked at some point.\\n\\n\r\nTo Love-Ru's perversions are almost all 'accidental perversion'. What I mean by this is Rito is a goody two shoes that never has perverted thoughts on his mind. The only way he gets into perverted situations is by tripping, getting catapulted into, being mind controlled, or whatever into them. What this means is almost every segment consists of the following formula: Rito or a girl gets attacked, Rito falls over the girl, Rito and the girl realize his hand is on her boob, the girl gets pissed. Rinse and repeat. Especially in the first 7-8 episodes, this was the entirety of Motto To Love-Ru. You should be able to guess how repetitive it gets. \\n\\n\r\nBut hey, it's hot, right? Yeh, it's hot. There's a looooooot of girls, so chances are high at least one of them tickles your fancies. Unfortunately, there's only one Rito, and all the girls have to take turns getting into perverted situations with him. As such, in order to enjoy everything that is Motto, you need to already be really really aroused, such that every situation will just turn you on more, despite the poor plot and annoying Rito. \\n\\n\r\nHowever, we reach a problem which is in all fan service anime: it never actually goes all the way into hentai. Nobody will ever kiss nor do anything above that ever in Motto. This means that no matter how aroused you get from watching it, the show will never be anything more than a cock tease. After watching Motto To Love-Ru, you're most definitely going to need some supplemental doujins or hentai games to truly be satisfied. You might be better off watching some hentai right from the start.\\n\\n\r\nThere is one good thing about watching this show, and that is that it has a LOT of doujins. Those Japanese fans have drawn a doujin for every girl in the show (except for Run for some reason), so even if you're unsatisfied after watching a few episodes of Motto, all you need is the internet and you're bound to find a doujin to take you all the way.",
            "date": "2012-10-13T09:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 74813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=74813"
        },
        {
            "content": "To love ru and mottoe to love ru i one of the most funniest ecchi and romance ive seen. Girls just keeps piling up on the main protagonists(luck Ba**tard). Hope the harem kees going.",
            "date": "2012-03-27T13:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 57141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kerweezyy",
                "username": "kerweezyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=57141"
        },
        {
            "content": "I'll say this right away. Motto To Love-Ru is a massive improvement compared to To Love-Ru. To be fair, To Love-Ru was the first season of the anime, and with that series' success, I suppose it's only natural for the next season to have much higher quality all around!\r\nStory: MTLR has a lot of different little scenes packed into each episode, but the good thing is, at least there's some continuation between them. At times, it feels like some scenes should have gone longer but it doesn't really matter. It was a great show.\r\nArt: A very significant improvement, the art in MTLR compared to TLRis definitely quite noticeable. Character faces have more detail, hair has more detail, the environment is much more detailed. I had to pause several times just to be able to enjoy the hilarious character expressions!\\n\\n\r\nSound: I think the sound is a lot calmer in this series? I found that TLR's sound, such as music, was often much too fast-paced. It's still pretty fast paced in MTLR but I feel the sound's a bit better this season.\\n\\n\r\nCharacters: Another major improvement was the characters. Somehow, in just twelve episodes, a lot of the series' characters actually had quite a bit of development and interesting scenes. Save for a few though. I like how much deeper we get to understand characters like Yumi, Katagawa, Momo, Nana, and Run. It goes without saying there's a lot of focus on Haruna, Yuuki, and Lala!\\n\\n\r\nEnjoyment: At times I felt teary eyed due to the romance, which is a good thing. At other times, I couldn't stop laughing!\\n\\n\r\nOverall: Absolutely hilarious, and the show has definitely gotten a lot better. Can't wait to see what happens next!",
            "date": "2018-09-21T06:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 289573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289573"
        },
        {
            "content": "Story (6/10) - One of the first noticeable differences with Motto To LOVE-Ru and its predecessor is that Motto is divided into three little mini-episodes. Does that hinder the story in any way? No, but it doesn't really help the fact that there isn't really an overarching storyline.\r\nArt (7/10) - Another notable difference is the art in Motto. It has a more modern feel (2010) than the prequel series.\r\nSound (6/10) - I'd say the biggest improvement would be the music. The tone of the intro and outro seemed better than before, as well as the visuals along with it.\r\nCharacter (8/10) - I feel like themain aspect of this series was to develop Rito's feelings and the feelings of those around him.\\n\\n\r\nEnjoyment (7/10) - I enjoyed Motto To LOVE-Ru about as much as I did To LOVE-Ru and the OVAs, and I can't wait to start watching To LOVE-Ru Darkness.\\n\\n\r\nOverall (6.8/10) - Motto To LOVE-Ru is essentially more about character development than anything else. I feel as thought its main purpose was to build up for the third series, To LOVE-Ru Darkness.",
            "date": "2017-11-07T09:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 262733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=262733"
        },
        {
            "content": "When it comes to an anime like this, you know that it's going to be filled with ecchi and perverted moments galore. But what you didn't know is that this anime, aside from other ones just like this, actually has good, enjoyable characters with a good backstory. \r\nThis is basically a continuation from where we left off in the OVAs'. Rito is still being accused of being the \"accidental pervert\" that he is. And the funny gags that are in just about every episode are even more so, but the question is. WHY does this anime deserve the score I gave.\r\nLike I said before, thisseries has a good backstory and a ton of characters that make up for it. But is it at all justified? Let me elaborate a bit deeper. What you will get about 60% of the time will be accidental perverted moments including Rito and an enraged girl who beats the hell out of him for his \"accidental\" accident. The other 40% of the time you will get serious moments that sort-of tie in with the plot for the moment. Most episodes are filled with filler, and while that's not a bad thing, if you like a serious story with extremely intricate characters and a evolving backstory, then this anime is NOT for you. Let me repeat, this anime does NOT contain any extreme intricate characters or plot that will make your eye balls pop out from being dazzled. This anime is purely for the \"fun\" of being a good anime with a lot of laughs.\\n\\n\r\nThe sound and art of this one are, meh. They're good enough to enjoy in the moment, but there are no visuals that captured my eyes and made me say wow. And I'm not completely sure, this may just be me, but the characters look slightly different in this series than in their older predecessors. The OP is alright, not too catchy, but does stick in your head for a bit.\\n\\n\r\nLike I said before, the characters are definitely a good reason to keep watching this. Most of them are sort-of one-dimensional, but they all add to the funny moments to keep the show as interesting as it is. I must admit, the most interesting character in this anime is Yui Kotegawa. She may be the most uptight character in the show, but she has some dynamic. I would state the rest of the characters, but there are so many so I'll just say this. They are all good in their own ways. However, the lot of the main characters are definitely the most interesting.\\n\\n\r\nSo like I've said before, if you come to this anime expecting outstanding characters and a dynamic story, well you're dreaming. You will, for the most part, be laughing and maybe feeling a bit uncomfortable as you're put in the shoes of Mr. Rito a LOT when he get's himself into trouble. But for the most part, this anime is very entertaining but has a bit of filler that may take you away from what we're ultimately trying to get at. I recommend you give this one a watch.\\n",
            "date": "2017-10-18T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 261154,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=261154"
        },
        {
            "content": "The second installment of the To Love-Ru series, I can at least say Motto To Love-Ru was better than the first series. If you were disappointed by the first one, have some hope for this one is much improved. \r\nStory: 6/10\r\nMotto To Love-Ru adapts the same kind of storytelling that the first one used: a bunch of random filler episodes that don't have that much plot movement. The difference this time is the producers distinctly tell you that each episode is stand-alone (one 24 min ep is actually three mini-eps that are unrelated, but all have their own titles), which gives the audience a sensethat they are about to witness a casual 8 minute mini-episode that serves only comedic purposes. This small detail of simply naming each mini-episode seems trivial, but it really sets up the relaxed feel which the first one did not have. That being said, again there is not much plot movement with each episode, and you could watch the episodes in random order and not miss much. But because you start each episode with the knowledge that it's not going to be serious and is going to be more like a comedy sketch, it's a vastly different feel when you watch it.\\n\r\nBut while it was an improvement from the first show, it still wasn't a \"good\" story if we're speaking in terms of all anime out there because it still follows the format of having random filler episodes rather than telling a longer and more well-developed story. \\n\\n\r\nArt: 10/10\\n\r\nThe first thing you'll probably notice is the huge improvement in art, so congrats to the studio for being able to provide better animation! No complaints here. \\n\\n\r\nSound: 10/10\\n\r\nI liked the opening for the first one and I liked it for this one too. No complaints for any of the sounds during the show either.\\n\\n\r\nCharacter: 7/10\\n\r\nI think that Motto To Love-Ru really tried to focus on character development in this second installment, and while they do a pretty good job of it, it sacrifices the development of Rito and Lala, a relationship that I enjoyed watching in the first series. Instead, all the other characters in his harem are further developed, but if you're a fan of Rito x ______(someone other than Lala), then Motto To Love-Ru will be pretty enjoyable for you since minor characters like Kotegawa, Yami, and Nana reveal what they truly think about Rito. Like I said, this means Rito and Lala don't really have much improvement in their relationship until the very last few episodes, so this is more of a personal opinion I have about character development. Overall, their goal was to evenly develop all of the other characters since the first show focused so much on Rito and Lala, and they definitely achieved it here.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI actually did enjoy this one a lot more than the first one since I could start each episode knowing that it was a comedy and actually laugh at some of the scenes. It's a comedy, which is meant to be relaxing and humorous, and that's what this show did. \\n\\n\r\nOverall: 7/10\\n\r\nA clear improvement from the first show, but still not a very strong anime. It didn't have any glaringly bad aspects, but also not much creative and new content either that you haven't seen in other shows. For To Love-Ru fans, however,  who have seen the first one, it should be a relief to watch a sequel that is much better.",
            "date": "2014-04-17T15:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 140337,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=140337"
        }
    ],
    [
        {
            "content": "I've always been a fan of the harem genre, all the way back to Love Hina. Though for me it stands between safe for work and not safe for work. I tend to dislike the ones inbetween, where semi nudity is bigger. This cause I like to focus on either my taste for normal romance or the ecchi side of harem. \r\nFor me, what devides the Harem genre and is keen to it's enjoyment or not, is two golden rules with different headtopic whether you are a boy or a girl watching the show. \r\n1) Fall in love with the girls (boys)orlike the girls (Girl). \\n\r\nThe more girls the audience falls in love with, the better the harem series. \\n\\n\r\n2) Make the watcher fall in love with the boy (girl)\\n\r\n    or understand why the guy gets girls to fall in love with him (boy)\\n\\n\r\nSo is Motto to Love-ru Darkness, or well the whole series worth watching?\\n\r\nWhy certainly yes.\\n\\n\r\nBecause of the depth of the cast, the almost perfect voice cast you tend to fall in love with the characters. You appreciate their different types, personalities and want the lead to marry em all. This usually is broken up by the lead having to take the choice of whether to go for the harem ending or choose one. I like both choices, but tend to favor the harem ending, which Love-Ru is definitely going for. Whether Yuuki Rito, the smoothtalker of all harem kings will suceed? We'll just have to wait and see I guess. \\n\\n\r\nThe art is definitely gorgeous, and the girls look very beautiful, with some nice animated fight scenes too boot. \\n\\n\r\nA worthwhile watch if you are interested in the harem genre. \\n\\n\r\nEnjoy.",
            "date": "2013-11-19T07:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 120787,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2228403.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ranthir",
                "username": "Ranthir"
            },
            "url": "https://myanimelist.net/reviews.php?id=120787"
        },
        {
            "content": "For those who have seen the first season and felt that it had very little to do with the actual story and in fact was just a filler season. This sequel to that disappointing season happens to be much more enjoyable. \r\nReluctant at first, i decided to give this sequel a shot since i hadnt got what i wanted from the first season. Motto To LOVE-Ru follows chapters from the actual manga and brings to the table what the first season never did, entertainment. Even after the recycled gags and the archetypal characters, it reminds us why harem/comedy animes are quite popular. Funny characters gettinginto awkward situations which we can all see coming like psychics but even if its not innovative its still something that will put a smile to your face.\\n\\n\r\nFor those of you who want to see more material from the manga in the anime, this season shouldnt disappoint. No more pulling out random episodes from thin air, these episodes take from material that actually existed in the manga and ends up being much more enjoyable and a much better adaptation of the manga even if the sequence of the anime is not following the manga in a linear fashion.",
            "date": "2010-12-09T10:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 32617,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=32617"
        },
        {
            "content": "SPOILER ALERT. \r\nI thought the original was okay. The art wasn't much and it was absolutely confusing. Still, a great story. The OVA was even more confusing, with the exception of the final. But when the time came for a new season, it got better. Story's a nine. It has loads of clichés, (Magical Girl, Guy Can't Confess, Girl From Outer Space, to name a few), but this comedy-ecchi, which also has a censored version, is very creative. Art gets an eight. It takes anime's animation pattern to another level, with sweatdrops and eye whites everywhere. My favorite part is episode 6 act 2, whenRun has learned Kyouko's secret. It just makes me crack up. Anyway, sound gets a seven. This anime, which doesn't have a dub, has little to no sound effects, but the voicing is very good, sounding quite realistic to their character, especially Yami's, Yui's, Ringo's (Ringo is female), and Riko's. Character takes a nine for aforementioned creativity. It just makes you think, \"Who came up with this stuff?\" In my opinion, the best character might be Celine, the headdress-wearing stepdaughter of Rito who has a little secret. The ecchi adds to the enjoyment, as you just can't help but let out your inner perv and wait for a girl to drop her clothes. Maybe it's just me. Anyway, enjoyment takes a nine, with a nice mix of comedy and ecchi, with a bit of romance tossed in for an interesting mix. Overall, I give this an eight, so it's one to definitely check out.",
            "date": "2011-07-28T14:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 40237,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Boozooka",
                "username": "Boozooka"
            },
            "url": "https://myanimelist.net/reviews.php?id=40237"
        },
        {
            "content": "While I liked the first season of To Love-RU for the comedy, I found Motto to be lacking. Sure, we get more of the ecchi aspect, but I feel like the writers got lazy with the humor. It's just the same awkward moments over and over. And while the first season at least had somewhat of a continuing story, this season is purely episodic until the last few episodes, even going so far as to split each episode into essentially three episodes. I will point out, however, that the main point of this season seems to be character development, and in that, they succeeded wonderfully.The variety of stories is also nice, but there just simply weren't any moments in this season that kept me laughing and laughing as in the first.\\n\\n\r\nI did feel it was absolutely worth the watch; however, prepare to be disappointed if you expect the same quality of writing as in the first season.",
            "date": "2013-12-03T02:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 122409,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2831569.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hraktuus",
                "username": "Hraktuus"
            },
            "url": "https://myanimelist.net/reviews.php?id=122409"
        },
        {
            "content": "Motto To LOVE-Ru is a spin-off of the To LOVE-Ru series.\r\nIf you're a To LOVE-Ru fan, this is going to deliver.\r\nStory - 8: The story(ies) are really just miniature plots in each episode. Most of them don't connect to each other in any specific ways. The story really strays from the fact that Yuuki is dealing with aliens and really everyone's treated more like regular humans. Most of these episodes are centered around school life and funny mishaps that make Yuuki get into trouble. I really liked the small plots, but it did go away from the main storyline from the original series.\r\nArt- 9: Greatart and animation. Nothing significantly different from the other seasons.\\n\\n\r\nSound - 8: Good sound. Nothing significantly different from the other seasons.\\n\\n\r\nCharacters - 9: You really learn about the characters in a relaxed way in this series. In general they're all the same as before. They're all lovable and have great personalities that fit the story.\\n\\n\r\nEnjoyment - 9: I liked the shows all throughout the series. There were a few awkward or boring plots but in general they're all great.\\n\\n\r\nOverall - 9: Great in general. I would recommend this if you enjoyed something like Love Hina or the previous seasons.",
            "date": "2013-05-23T15:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 98151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2545029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Narudatsu",
                "username": "Narudatsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=98151"
        }
    ]
]