[
    [
        {
            "content": "The Gundam franchise is a massive universe. As another installment, there can be a lot of optimism for Iron-Blooded Orphans. I have to admit, getting into this show at first made me nervous. Some of the recent Gundam related series such as Gundam AGE and Gundam: G no Reconguista received very mixed reception. Furthermore, Iron-Blooded Orphans is spearheaded by Mari Okada, a director who is well-known for adding in melodrama into the story. But for this show, I can safely say that it’s definitely something worth investing time into whether you’re a fan of Gundam or not.\r\nFor timeline purposes, the show takes place after theCalamity War, a war between Earth and Outer colonies. Actually, make that 300+ years. A major conflict involves Mars and its city Chryse. The people there seek independence from the government and make their own lives into something better. A young Martian woman named Kudelia Aina Bernstein hopes to secure independence. Her role in the story becomes more complicated as she gets involved with a group known as the Tekkadan, whom is entrusted to protect her life. So begins this story that leads politics, warfare, and a world of internal conflicts. As the show’s catch phrase, this is “the sustenance of life is on the battlefield.\"\\n\\n\r\nIn context, the show is a war story but also deals with a variety of real life issues. From poverty to child soldiers and imperialism, the show really offers a lot of insightful concepts. There’s even themes of experimentation as certain characters are fit with the Alaya-Vijnana System (Whiskers) to enhance their fighting abilities. Still, the show constructs a story that expands beyond just fighting a war for independence but also takes a look at the interpersonal conflicts of people in its universe. At the heart of it, we have members of the Tekkadan. Led by Orga Itsuka, the show capitalizes on their role to protect Aina. Their ace pilot, Mikazuki Augus (also known as Mika) pilots the mysterious mobile suit known as Barbartos. Throughout the show, we see his piloting and combat skills including his role to fight off Gjallarhorn, an Earth Military organization set up to capture Aina. Tekkadan also consists of other members including Biscuit Griffin (a strategist), Eugene Stark (former leader of the third army’s division), Norba Shino, Akihiro Atland, Atra Mixta, among others. What’s interesting about this group is that although they all come from different backgrounds, they are all united with similar purposes and treats each other like family. The family theme extends to not just the group but also Aina as she gets to know more of its core members. With such a colorful cast of characters, the show really can be appreciated for its characterization.\\n\\n\r\nA good part of the story involves the journey Aina and Tekkadan takes in order to reach their goals. Part of it feels like a cat-and-mouse story while other parts are calmer with even has a feel of slice of life. In addition, the show also introduces others factions, some who later become valuable ally of Tekkadan while others are against them. Now I have to admit though, the story itself may feel like it has some pacing problems. A few of the episodes are non-combat related and some lacks development with the overall presentation of the story. However, it also emphasizes on the characters because they really are something special. The director and producers are aiming high for with this TV show so everything constructed has a purpose. The main characters has an iron will with their goals so a few of the episodes examines at their personal lives. Throughout their on-screen roles and background storytelling, we learn more about them especially Mika. He is an orphan with poor social skills but learns throughout the show with help from Aina. There’s a change about his character through his acquaintance with her as he becomes more casual and more interested in his own future. Their relationship even has a taste of romance in it as time goes on and this doesn’t seem like a surprise. Aina’s a kind woman who cares about others’ well-being above her own. She is also a good role model for the children through her ways of teaching them how to write, in particular Mika. This opens up his interest to forging his own future someday. Similarly, Mika’s relationship with Orga is strong. Their friendship has already been established during their childhood and it’s evident that the two would risk their lives to protect each other and their goals. Now I don’t expect everyone to like Aina’s role in the story. Despite her aristocratic status and selfless nature, she is still a bit naïve at times. And furthermore, her insecurity to provide help during crucial moments of fighting can be a bit irritating. Because of the nature of the show, expect other characters to relive moments from the past that resurfaces in the present storyline. A prime example is Akihiro as he deals with a blast from the past. On the other hand, there are also lighthearted relationships such as Mika and Atra. Some may see her involvement with him to almost be part of a love triangle. However, don’t expect this show to be a love story. It’s still an iron-blooded war tale. In retrospect, the show really has an iron blood with its story and characters.\\n\\n\r\nWhen looking at the themes of the show, it’s easy to notice how much it has relations with the past, present, and future. The poverty of the past influences people to try and find a better future for themselves. The present has an emphasis on neo-colonism as we see advanced civilizations expand through funding and technology. For the future, Aina’s ambition to seek independence is a hopeful vision for her people. This is a bit contrast with Gjallarhorn. In essence, they are a military organization who seeks peace but pursuits them with violence means. Some of its core members such as McGillis Fareed, Gaelio Bauduin, Ein Dalton, and among others has their own ideologies. But one thing they seem to all share is strengthening their nation’s own relations and wealth. On the other hand, there’s also Teiwaz, a business conglomerate. Their relationship with Tekkadan also a similarity about family as their representative member forges a pact with Orga. The amount of relationships in this show is really special and something to take by heart. Whether you agree with their goals or ambitions, it’s important to understand why they fight. And this show is pretty damn good at making its point about that.\\n\\n\\n\r\nProduced by Sunrise, the show’s visual quality is a unique piece of work. Michinori Chiba is in charge of the character designs but visually looks a bit different compared to some of Gundam’s previous predecessors. I guess it feels like a fusion of Gundam 00 and Gundam AGE as the characters looks both childish and mature the same time. This is especially true with characters like Mika and Biscuit. Orga on the other hand has the look of a mature commander. Aina has more of the look of an aristocrat but can also look like a simple lady when she needs to be. Character visuals aren’t the only thing interesting about the artwork though. The universe of the show has colonies that shows wealth with its rich technology and weapons of war As such, it brings legitimacy to their statuses. From the mysterious Barbados to Teiwaz’s Saisei, everything looks crisp and establishes the studio’s effort to craft them as technological innovations. This is further enhanced by the solid action with a great amount of effort during fight scenes. Be amazed. This is a show that can be will leave strong memories even with its action.\\n\\n\r\nAt first, I wasn’t much of a fan of the music or soundtrack. But after watching a good amount of the show, it’s definitely something to take in by heart. Masaru Yokoyama clearly invested a good amount of effort into producing the music for various scenarios in the show. From melancholic moments to intense combat oriented moments waged in space, it has everything that a mecha fan can wish for. The OP song “Raise Your Flag” is also a way that symbolizes the fight for independence especially with its catchy tone and choreography. And finally, voice mannerism is impressive. Characters such as Orga shows their commanding presence while Mika is known for his cold personality.\\n\\n\r\nIron-Blooded Orphans is definitely a show to invest time in. Whether you’re a veteran or a causal viewer, the experience after watching this show will be memorable for its story, characters, themes, world-building, and powerful action. Characters’ actions all have purpose and the show offers a balanced way to showcase their motivations. I don’t expect everyone to like all the characters as some may find them less likeable than others. Still, this show is not to be underestimated and is a triumphant one at that. Watch it with an open mind and you’ll see why.",
            "date": "2016-03-27T05:22:00+00:00",
            "helpful_count": 158,
            "mal_id": 214327,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214327"
        },
        {
            "content": "Kidou Senshi Gundam: Tekketsu no Orphans/機動戦士ガンダム 鉄血のオルフェンズ Review\r\nStory (7/10) Good\r\nMore Specifically (7.75/10) Good+ \r\nThe story for Mobile Suit Gundam: Iron-Blooded Orphans like majority of the gundam plots attempts to juggle two main plots at the same time. One being about the characters and their goals they want to achieve and the second being the political side of things and they intertwine with each other. One would say if you want to follow the Gundam story plot formula both of these story plots need to be present and as synced with each other as you can possibly get. Like majority of Gundam alternate universes this universedoes indeed have a just a little bit more focused on the character side of things (which there's nothing wrong with that). The political side of things (kind of like Gundam Wing's and Gundam 00) can be a little be hard to follow if one is not paying full attention during the political scenes. I personally think it wasn't too hard to follow but I can't say I understand majority of what was going down during the political scenes and that's kind of the thing that may turn off a lot of people because it did with previous Gundam series. Luckily in my personal opinion even with it's political influence side of things  Tekketsu no Orphans' character is something that should keep most people a bay because the are good ones. \\n\\n\\n\r\nArt and Animation (8.75/10) Very Good\\n\\n\r\nThe art and animation in Tekketsu no Orphans was for the most part very good. I couldn't give this second a 9 because there were obviously some art style derps here and there when it came to characters only slightly in the background and the actually mech fights some Mech designs looked a teensy bit whanky at times but the scenes they were focused on and polished out are what is keeping it at a high 8 for me. Another thing I appreciate is that it is hand drawn, not a lot of mech anime comes out these days and when they do most of the time it is all CG. And I don't mind CG mechs trust I'm not one of those people to complain about CG mech (I love CG in Gundam Unicorn and The Origin). And I think CG on Mechs is the only thing that looks acceptable to an extent when it comes to putting anything CG in an anime. BUT I do appreciate to a well hand drawn mech anime because that's how it all started and what I'm used to. And I'm sure all the scenes that I felt could have looked better WILL look better in the retail blu-ray release... one would assume and hope.\\n\\n\\n\r\nSound (10/10) Masterpiece \\n\\n\r\nThe sound does not disappoint in any category and that's usually the case when it comes to Gundam. Voice acting (JP), BGM, both openings and endings are all outstanding.\\n\\n\\n\r\nCharacters (8/10) Very Good \\n\\n\r\nThe characters like I said in the story category are very good and what will keep newcomers to Gundam staying and watching. Although there are not a TON of characters that this applies to the ones that it does like our MC Mikazuki Augus is definitely a character that I've heard nothing but positive things from. He's not like your typical whiny pilot that we've seen in the past. He's more in the category of Heero Yuy and Setsuna F. Seiei but calling him a clone of either of the two is definitely not what I'm saying either. Because honestly I think from a character standpoint Mikazuki is a better and more interesting character than both Heero and Setsuna combine. Yes he has traits from both of them but he also has his own flair of insanity which comes out in the heat of battle. I haven't seen a main gundam pilot with such a personality trait yet the closest I can think of is Haptism Allelujah but he's not an MC. They are either on the whiny, calm or dull for the most part so to see this definitely sparks things up. Majority of the other characters are very good and like Gundam tradition we have character deaths we didn't want but expect. I knew a hand full of people where going to die not because of the countless death flags we've been given throughout the anime but because it's basically tradition at this point. \\n\\n\\n\r\nEnjoyment (8/10) Very Good\\n\\n\r\nI'm a Gundam fan if you couldn't tell I love majority of the series and I'm not your average anime fan that despises all mech anime expect Code Geass and Gurren Laggan. Some might say I give Gundam a little bit too much credit but that's all opinions and a discussion for another time. Going into Tekketsu no Orphans sadly I was already ready to like it because like I said it's Gundam. You have to really fuck up on some Reconguista type shit for me not to like you and it's definitely no where near as bad as that trash. Tekketsu no Orphans brings us a nice 8th MS Team vibe to the series. And I doubt a lot of people realize this but there was absolutely no beam sabers or laser guns in the series (as far as season 1 is concerned). Impressive because a lot of Gundam anime and other mech anime kind of have that as the requirement in their anime and it cool to see a series were as of season 1 is concern does not exist, it was enjoyable to watch the mech fights, characterization with the combination of outstanding BGM this series brought to the table.\\n\\n\\n\r\nOverall (8/10) Very Good\\n\r\nMore Specifically (8.50/10) Very Good+\\n\\n\r\nTekketsu no Orphans in my opinion delivered what it was suppose to which was a good spin off adaptation to the Gundam series and can be recommended proudly when the franchise Gundam is brought up in conversation. Tekketsu no Orphans had people worried not only because the series before it Reconguista was trash but because the Main Director Episode Director, and Storyboard creator Nagai Tatsuyuki had his hands on it and people were extremely worried that this was going to flop because of his past works. It even had me a bit worried when I heard that. But that wasn't the case as Tekketsu no Orphans in my opinion is a successful and very good alternate universe to the Gundam franchise. And with the announcement of the english dub a couple of months ago I hope Toonami grabs it and airs it on there so that the western toonami viewers can possibly get into the Gundam series like what happened back int the good ole Gundam Wing days.",
            "date": "2016-03-27T13:31:00+00:00",
            "helpful_count": 99,
            "mal_id": 214407,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=214407"
        },
        {
            "content": "Not only is this the worst Gundam anime, it's one of the worst anime of all time. In this review I'll be talking about both seasons. There will be some spoilers. Im going to have to include some of them to truly prove how terrible this anime is.\r\nSo the very first reason why this anime is terrible, the characters. The only character I actually enjoyed was McGillis Fareed. I will say that he was an enjoyable character to watch since he was so mysterious. Other than that, all of the other charactets are bad. Since the moment I started this I knew the characters wouldbe terrible. This anime has such a large cast of characters, and that is a problem. Since there are so many characters, barely any of them had character development at all. Almost every single character is one dimensional, and that is absolutely terrible. The thing is, I wouldn't have too much of a problem with the very minor characters not getting any character development. The problem is that the main character (Mikazuki) gets absolutely no significant character development throughout the entire series. Like seriously, he hasn't had a significant change in his character since episode 1. The other character, Orga Itsuka is just as bad. Now I'm going to have to include a spoiler, so if you arent caught up you might want to exit this review. There is a character that goes by the name of Shino. He sacrificed himself in an attempt to kill the enemy leader in episode 45. Once he fails, Orga Itsuka tells tells everyone to go back and rescue Shino. This is just one of the many examples of extremely bad writing. He has been leading all of the orphans for such a long time yet his leadership skills didn't develop at all. That was his moment to shine and actually develop as a character, but they fucked it up. He could've actually started acting more like a leader but he didn't. Once again ladies and gentleman, this is onle one of the many examples I have for this review. It's already bad enough that most characters don't get developed, but if the main two characters never had any significant character development, then that is an absolute problem for the story. My next point is that this many episodes in this anime have no story progression whatsoever, specifically the first season. All they fucking did was fight battle after battle until they escorted that one girl to earth. The plot of this anime is somewhat similar to the plot in Jojos Bizarre adventure part 3. The main cast of characters just had the goal of arriving to a destination. This was really bad in the case of this anime, since a shit ton of episodes had no story progression at all. What made Jojos Bizarre Adventure part 3 at least interesting was the battles. Each battle was a masterpiece in my eyes. It was so much of a pain to even get through part 1 of this shitty anime because it's extremely slow paced. \\n\\n\r\nThe animation and sound are really the only good things about this anime. The openings and some of the fight scenes are pretty damn good. I won't talk much about this anyways. The good animation and fight scenes wont redeem the bad writing that this show has.\\n\\n\r\nThis anime has many useless characters that contribute absolutely nothing for the story. An example of a useless character would be Atra Mixta. This character was absolutely useless. She was simply just a one dimensional character that did nothing but flirt with Mikazuki (which is very cringe since she appears to be an 8 year old). This also brings me to my next point, the romance in this anime is done horribly. It's extremely bad. It just turned somewhat into a harem with Kudelia and Atra (the worst characters in the story). It was so poorly done because there was so much build up between Mikazuki and Kudelia's relationship, but then he just ends up with the girl that appears to be 8 years old. Not only this, but the romance is just extremely cringey. It makes it even worse because the characters have minimal to none character development. The romance between Akihiro and Lafter was terrible. All of that build up just so she can get shot by a RANDOM person? That's extremely bad writing. This also brings me to my next point, the way the characters die in the end was EXTREMELY bad, especially in the case of Orga Itsuka. He just randomly gets shot by a random person! That's the absolute worst way to kill off a protagonist. If you're still reading this review, I want you to do something. Think of a long running anime that you really like. How the fuck would you feel if the main characters just gets killed by a random person that shot him. It's fucking pathetic isn't it? Instead of making him die in a badass way like Shino, the directors decide to get him killed like that. That's extremely bad writing. This anime pretty much did the same thing Akame Ga Kill did, killing of characters in the dumbest of ways. What makes it so bad is that the characters have zero depth to them, so us as the audience really couldn't care less if they die. \\n\\n\r\nSo here is an overall summary of my review\\n\\n\r\nAnimation: 8/10\\n\r\nSound: 8/10\\n\r\nCharacters: 0/10\\n\r\nPlot: 0/10\\n\r\nWriting: 0/10\\n\r\nEnjoyment: 2/10\\n\\n\r\nOverall: 2/10\\n\\n\\n",
            "date": "2018-07-21T19:41:00+00:00",
            "helpful_count": 18,
            "mal_id": 284473,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6115012.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/thatrpgdude",
                "username": "thatrpgdude"
            },
            "url": "https://myanimelist.net/reviews.php?id=284473"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans is an original series not based on any other work like manga, novel or a game. It's quite a rare to see original anime these days and most of them are poorly made. But this one may surprise you.\r\nAn easy-to-follow story with flow and focus, exciting space combats, strong both male and female characters, some well-placed plot twists and a little bit of romance and comedy just to spice things up. But above all this story present the human side of  characters while not neglecting the plot. We can see strong friendships, trust, how they all deal with tragicdeaths of their families, friends and comrades, how they try to find their place in this messed up world and not losing hope. Not very original but interesting to watch. Animation is also very smooth and nice. \\n\\n\r\nDownside is that the story was rushed. Especially in the last few episodes. There was that “last battle” where they all went on a shooting rampage and all was over just in one episode. I felt like the main message was lost. Not to mention some of the so called good guys turned bad all off a sudden, like McGillis. Also one of the main characters Orga went downhill from a strong confident leader to someone who doesn’t think rationally and makes rush decisions. The political background of the story was a little bit confusing too and hard to follow. And some of the dialogues were just meaningless and boring. \\n\\n\r\nTo sum up, this anime has big potential and the story is not about typical battle of good vs. evil. More like a fight to make things better. If you ignore some minor flaws in concept of characters, parts of the plot which are not clearly explained and rushed ending it’s really fun to watch. So give it a try. \\n",
            "date": "2016-03-28T06:25:00+00:00",
            "helpful_count": 48,
            "mal_id": 214524,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2465721.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/plisetskytrash",
                "username": "plisetskytrash"
            },
            "url": "https://myanimelist.net/reviews.php?id=214524"
        },
        {
            "content": "Gundam has always been a franchise that focused on the horrors of war. It is the nightmare of existence, the human race being in a state of perpetual conflict. Throughout the franchise's history, the effects of war have been tackled from a variety of different angles. From those with autism (kamille) to brown skinned traps (Loran) but there has never been a Gundam entry that focused specifically on child warfare. The real world is rife with conflict, and in lesser developed countries, children are on the frontline. There is a saying that in war the truth dies first. This is true but there is anotherimportant piece missing from that saying, innocence is also the first to die. Mobile Suit Gundam Iron Blooded Orphans is the first in the franchise that focuses on a child army and the effects that war has on children. My initial hype for the premise led me to believe this show was going to be something very special. However, in actuality the gravitas of the subject was much too heavy for famed melodrama/romance writer, Mari Okada, to handle competently. Although this series spans 50 episodes, you leave with the feeling that the show was never finished.\\n\\n\r\nIt is 300 years after the calamity war, a conflict that utterly decimated human civilization and led to the death of billions of people. The effects of that war are still seen in the destitute conditions that our protagonists live in. Iron Blooded Orphans focuses on a group of rambunctious youths who work in a mining facility on Mars. These children were either abandoned at a young age or forced to work to pay off their family's debts. The conditions at the mining facility are brutal; the adults verbally abuse the children and beat them if they do not perform adequately. It isn't uncommon for kids to fall dead from exhaustion. The tone is well set in the beginning episodes. This changes when the mining facility is contracted to protect (for some reason) a young politician, Kudelia Aina Bernstein, who seeks to rid both Mars and Earth of economic inequality and exploitation. Unbeknownst to the kids, her life is threatened by forces who want to maintain the status quo. These people are gjallarhorn, a paramilitary organization created to prevent conflict and corrupt politicians. These kids, while mining, find an ancient Gundam frame, a mobile suit model that helped to end the calamity war. After finding the Gundam, the children become embroiled in war much bigger than themselves with their freedom and the fate of humanity rides on the success of the newly formed army, Tekkadan.\\n\\n\r\nIron Blooded orphans are divided up into several arcs with the overarching conflict of the show holding everything in place.  The quality of these arcs is consistent in their mediocrity. Rarely are there any episodes which make good use of the darkness of the subject matter. There is always a feeling of levity in contrast to the direness of their circumstances. The arcs revolve around a conflict that focuses on a specific character. So the quality of the character writing directly impacts the strength of that arc. Sadly, the characters are milquetoast to say the least.\\n\\n\r\nIron Blooded Orphans has a rather large cast of characters with Tekkadan, the child army, having about 10 or so important characters and Gjallahorn having about 3 or 4. The front men of Tekkadan, Orga and Mika are the weakest protagonists in the Gundam franchise. Orga in particular is a very forgettable character. He is tasked with being the Leader of Tekkadan meaning he has to make difficult decisions that could get him or his comrades killed in battle. Although this is a reoccurring issue throughout IBO, these scenarios seldom leave any emotional impact. Orga is just boring. He can be confident when he has to be, but other than those moments he is so indecisive. IBO fails to delve deeper into the psychology of leader struggling to make decisions. Mobile Suit Gundam Thunderbolt is a show that in merely four episodes, we can see the internal struggle of being a leader where Claudia, a fleet ship captain knowingly has to send untrained children to their deaths for the sake of the Federation. She breakdown and does drugs to cope with her guilt. There are no moments that are as nearly as impactful as that in IBO with Orga. He lacks any defining character traits that put him beyond that mold of characters of the same archetype. Every arc that he is the focal point of struggled to hold me interest merely because he is not compelling enough to be a main character.\\n\\n\r\nHis counterpart, Mikazuki Augus is a case of wasted potential. He behaves in a sociopathic manner. Mikazuki has no problem killing entire groups of people if it for his comrades or Orga specifically. However, the relationship that he has with Orga is never sufficiently elaborated upon so I could never understand why their bond is so close. This is especially frustrating when the entire cast get some flashback episode while the faces of Iron Blooded Orphans, Mika and Orga, never do. It feels as though the writers did not know how to making their backstory tragic enough so opted out of trying to explain it. \\n\\n\r\nDespite the breadth of the cast, there are very few characters worth mentioning. We have Akihiro Atland, whom I affectionately call “Space Guts” due to his brooding aura and character design. He would have to be my favorite character out of the bunch. His backstory, where he was given up by his family to slavers to pay off their debts gave him and other like him the title of “human debris”. I would argue that the show would have been a lot better if there was a singular focus on Akihiro and others like him since they have the most interesting backstory and their stories parallel those in the real world. But, like many other characters, after Akihiro’s character arc was finished, he never got any more focus. His character remained unexplored which upset me because they could have taken him down a lot of interesting character routes. Mcgillis Fareed or “The loli lover char” could have been better if he was fleshed out more beyond his initial charm and cunning. And then we have the quintessential loli character, Atra, who is best girl.\\n\\n\r\nThis is where the show feeling “not finished” comes in because characters are never explored efficiently. Mari Okada is not talented enough to write a varied cast like Yoshiyuki Tomino is. She does not know how to juggle subplots and can only focus on one thing at a time. This also ties in with the show’s issue with world building. The lore of the world is not sufficiently fleshed out, meaning there are a lot of gaps in the history of the show. For example, we do not know the philosophy of Gjallahorn nor why the calamity war occurred. These things are mere afterthoughts and you know the same amount of information from the beginning to the end. The Gundam franchise, more specifically Tomino’s Gundam, had a big emphasis on political philosophy. The series were a dialogue between fascism, monarchism, and democracy. Iron Blood Orphans is brain dead in this department. The underlying philosophy of the show is literally “muh equality” with no deeper examination of why equality is good or how to realistically achieve it. Apparently, all you need in the world of IBO is naïve idealism and you can accomplish anything. \\n\\n\r\nIron Blooded Orphans is a show that I was desperately hoping to be good, considering that good entries in the Gundam franchise are far too few and between nowadays. Sadly, Mari Okada was not up to the task of living up to Tomino’s legacy. She should stick to her melodrama and leave war to someone who has the talent to survive it. \\n",
            "date": "2018-07-25T13:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 284767,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=284767"
        },
        {
            "content": "First off, I have to say that i dropped this series after the first couple of episodes. I didn't like Mika, I thought he'd be a stereotypical stoic character, but he's MUCH more of an interesting character than I had previously believed.\r\nStory: 9- The story is fairly simple, but how it is handled is done masterfully. Very few shows have me hooked and can keep my attention for the majority of the series.\r\nCharacters: 10- First off, Mika isn't the only main character, because, at least in my opinion, Orga is also the main character. EVERY character is interesting, besides maybe Ein, and not one ofthem is disposable, and not one death goes unnoticed. Mika seemed like an annoying stoic character at first, but whats so interesting about his is that you don't really know him. He isn't a personable character, but he is certainly one that cares about his comrades, but at times you may feel that he is a sociopath.\\n\\n\r\nOverall/Enjoyment: 10- This is a fantastic and consistently excellent show, one that should be watched and appreciated more than most. It isn't filled with fan service or annoying romance. It's a realist story about child soldiers that isn't made to make you cry, but to give you hope and spirit.",
            "date": "2016-03-27T09:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 214361,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KLRock",
                "username": "KLRock"
            },
            "url": "https://myanimelist.net/reviews.php?id=214361"
        },
        {
            "content": "First, i'm going to be honest that i have never watched Gundam before. i have played the game with my cousin or friends a few time in the past but i don't really know much about Gundam. So after i saw this adaptation, i wasn't really interested in it, but because of the popularity, i got curious and i tried to watch it and! i was expecting something like Aldnoah Zero but WOW! it was beyond my expectation. Well, personally, i prefer Aldnoah Zero, but this anime is great too in my opinion. The brotherhood is real!!!\r\nI don't really know much about the story butit started with a bunch of kids who was being slaved in some company. They got attacked but an organitation or a goverment in the first episode, and that's how everything begins. and i think it's pretty similiar to Aldnoah Zero, the story i mean. The Princess wants revolution. yeah... pretty same, but the difference is the Character Relationship. i had to choose Aldnoah Zero or This series based on the Character Relationship, i would choose Gundam. I really like the brotherhood relationship. A bunch of kids who are not supposed to be holding a gun or so whatever it is, they were fighting together with the princess. with them to fight besied the princess, their relationship got bigger and bigger, into some point which they can even sacrifice themselve for their own goals, for their own friends. i seriously like that. \\n\\n\r\nFrom the story or the plot, i don't really understand it, but overall i can still understand the plot and the story, but if they connected with the past, i'm out, because this is the very first gundam series which i have ever watched. \\n\\n\r\nThe soundtrack.... NO MORE WORDS!!! Man With Misson sing the OP and Kalafina sing the ED song. with that, they created a really unique atmosphere. NO MORE WORDS FROM ME!!! GREAT!!!\\n\\n\r\nI think i don't need to say it again about how good the character to me. Botherhood relationship, that is the most thing which i like from this series. The princess personality was great too. probably she will be the second one which i like. She is so brave and kind. \"The Revolution Maiden\" that is her role in this series and i really like her role. when she made her desicion, MAN! HER DETERMINATION!!!i liked her more than before. she was so cool at that time. \\n\\n\r\nThe animation was really great too in my opinon, esepcialy when it comes to Mika in Action. really badass AF!!!. \\n\\n\r\nOverall it was a really great series in my opinion. really like the unique felling too which i felt in the whole series. it was an enjoyable and great series with all of that rage in the action too. GREAT!!! 9/10. \\n\\n\r\nSorry for bad english.\\n\r\nHope my review can be helpful to you all. \\n\r\nThanks. Have a nice day\\n",
            "date": "2016-03-27T11:00:00+00:00",
            "helpful_count": 16,
            "mal_id": 214378,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=214378"
        },
        {
            "content": "IF THIS ANIME IS NOT THAT GREAT IT WOULDN'T HAVE A 2ND SEASON...THIS IS THE ONLY ANIME I ENCOUNTERED TO END IN THE SAME YEAR AND START THE 2ND SEASON AT THE SAME YEAR...\r\nwell if your a realist dont watch anime...especially if your not into gundams...\r\nto the person who says that the characters are uneducated kid, you are stupid...u didnt read what yukino ojisan said...some kids know how to read some are not thats why they are in combat like the main character mikazuki...he also explain why an uneducated kid like mikazuki can control barbatos is because of alayana system that he has.... the characterswho can read are the human debris thats why they are in control of the ships and akihiro can control a graze before he gets his second gundam.... they get their fighting experience because they are orphans who are used as a tool in combat... that's why Orga is not in the main control of the ship he's in command of the ship\\n\\n\r\nthe title is MOBILE SUIT GUNDAM IRON BLOODED ORPHANS that means its about orphans who struggle to fight for their group using gundams... the story is great and it was really heart breaking for me to see how they struggle to live and protect their found family....\\n\\n\r\nIT IS A BEAUTIFUL STORYLINE, CHARACTERS AND SOUND...I REALLY ENJOYED IT A LOT...MY HEART BEATS FAST EVERY TIME I SEE THEM IN COMBAT...IT FEELS LIKE I'M ONE OF THE GIRLS WHO WISHES FOR THEM TO LIVE BECAUSE THEY DESERVE TO LIVE...\\n\\n\r\nTHANK YOU FOR THE CREATORS OF THIS ANIME!!!!!!!!!! THANK YOU FOR THE HARD WORK!!!!!!!!!\\n\\n\\n",
            "date": "2016-03-29T22:18:00+00:00",
            "helpful_count": 16,
            "mal_id": 214756,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/alcas001",
                "username": "alcas001"
            },
            "url": "https://myanimelist.net/reviews.php?id=214756"
        },
        {
            "content": "Gundam: Iron Blooded Orphans is another Gundam series set in an alternate timeline, this one being the Post Disaster timeline. Set in a future where hostilities between human settlers on Mars and the Earth Sphere are escalating due to Earth's influence on Martian affairs through the private military organization Gjallarhorn, the series is prominently focused on a private Martian military group called Tekkadan who are given the job of protecting Kudelia Aina Bernstein, the young daughter of a Martian political family who seeks to travel to Earth to persuade the Earth Sphere government to grant independence to Martian settlers and inform them of Gjallarhorn's corruption.As Tekkadan make their journey to Earth while protecting Kudelia, they are continuously hunted down by Gjallarhorn forces seeking to prevent Kudelia from making it to Earth.\\n\\n\r\nIron Blooded Orphans has many of the typical elements you would find from a Gundam series. There are escalating conflicts between Earth and space residents, prejudice felt from those having unique abilities of some sort (Alaya-Vijnana implanted pilots in place of Newtypes), a strong willed young woman seeking to settle conflicts between the opposing sides, a high death count, corrupt individuals on the opposing side taking advantage of hostilities for their personal gain, and a young man piloting the highly powerful Gundam mecha used throughout the series. While drawing from these elements, Iron Blooded Orphans actually uses them to create its own unique plot and character developments and give it its own unique identity.\\n\\n\r\nA strong element that Iron Blooded Orphans offers up is exploring the problems faced by child soldiers through the fighting they undergo. This gets prominent focus through Mikazuki's character as due to his upbringing as a child soldier, he is psychologically unstable from his inability to properly express his emotions and deal with social situations outside of military settings. The boy will usually find himself giving into berserk rages while in battle, is completely merciless to enemy forces and has difficulty properly expressing emotions; traits that he is well aware of internally throughout the series. His interactions with Kudelia at varying points in the series lead Mikazuki to get some gradual developments in improving his social skills and empathy toward others. Besides Mikazuki, the series also explores the good deal of abuse that child soldiers are subjected to through military factions like the Brewers as the children are subjected to fear and abuse, as well as being forced into getting the risky Alaya Vijnana implants used to empower the mobile suits they pilot.\\n\\n\r\nIron Blooded Orphans plays up on many of the strengths that make Universal Century titles like Gundam Unicorn and Zeta Gundam worthwhile and memorable titles in the Gundam franchise. The series explores the conflict between Tekkadan and Gjallarhorn from the perspectives of both sides as viewers get introduced to characters among both sides that have a good deal of depth in their motivations and personalities, making the majority of characters among both factions relatable to the audience. Some of the characters find their personal beliefs challenged from confronting the harsh realities of war, this prominently shown through Kudelia's exposure to the escalation in Earth and Mars' hostilities toward one another and Tekkadan's continued struggles against Gjallarhorn. Besides the mentioned child soldiers, the series is also not afraid to show how brutal and harsh war can be with major characters being killed off, the morality of some characters deteriorating from dealing with war's brutality and influential figures among Gjallarhorn exploiting said hostilities for their personal gain.\\n\\n\r\nThe series does have its occasional bumps in quality though, mostly stemming from the typical flaws of Gundam titles. Mikazuki is mostly unstoppable as the pilot of Gundam Barbatos, killing any kind of suspense for whether or not he survives any battles throughout the series. Some characters in the series are portrayed to be rather shallow and are over-the-top in their villainy, notable case being Kudel Cadel of the Brewers. Also, the series doesn't escape the occasional annoying habit of having mobile suit pilots angrily yelling out ideologies and motives at their enemies during heated battles that are found from a number of past Gundam titles.\\n\\n\r\nVisually, Gundam: Iron-Blooded Orphans is easily one of the better quality titles released this past year. The series sports a great amount of visual detail put into the designs of its scenery, character and mecha designs; accompanied with a bright color palette. The mecha designs mostly borrow off of visual details used from past Gundam titles, including Barbatos maintaining the classic Gundam appearance. Mecha battle scenes offer up the animated highlight of the series as battles between Tekkadan and enemy forces take place in a variety of locations throughout the series that include space colonies, space, reentry into Earth and on the Earth itself. The fight scenes are mostly fluid, have great choreography and the variety of locations offer diversity in the ways that mecha battles are fought throughout the series.\\n\\n\r\nOverall, Iron Blooded Orphans is easily among the best alternate continuity titles that you can find within the Gundam franchise. Offering up all the strengths of the Gundam franchise with its own spin on them and having a strong focus on the effects that war has on child soldiers, Iron Blooded Orphans is a definite recommendation for seasoned Gundam fans or those looking for a worthwhile mecha title to get into without having to delve too deep into the convoluted continuities of the Gundam franchise.",
            "date": "2016-03-27T10:16:00+00:00",
            "helpful_count": 13,
            "mal_id": 214367,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=214367"
        },
        {
            "content": "As a big-time Gundam fan and Gunpla builder, I gotta say that Iron-Blooded Orphans (IBO) is my all-time favorite Gundam. Please, do yourself a favor, and even if you never watched Gundam or are not a fan of the mecha genre, watch IBO, you must, just must. I`ll tell you why!\r\nStory: The story of the first season is slow-building. You can`t expect the mecha action to star right away. For a while, you will get more of the characters stories, motivations, dramas, interests, and backstory. And that's why IBO is the greatest of all Gundam series. The motivation is deep and emotional, full of meaningand sensible moments, but without the shonen drama! The characters have real motivation, trying to find their place in the world and when the action starts, you will be way more driven to see the outcome, you will learn to care for these characters in ways no other Gundam made me do. The plot is interesting, with a different background that the regular Gundam anime. The plot is set with a different motivation, diverging from the classic Earth vs Space backstory that all Gundam try to achieve. Even the story of the mechas is more in-depth than any other. It's just a masterpiece of a story. The only people that the story won't reach are those who are on this only for the action. Nevertheless, for those, I say: Don`t worry, when the action starts, you will get VERY satisfied since Mika and Barbatos are the most badass fighters in Gundam history (not.....joking....at....all). And the second season is pure action. Finally, I must say that IBO is the most adult Gundam ever, with hard scenes and adult theme, which makes it even more enjoyable and puts some distance from the classic shonen.\\n\\n\r\nArt and Sound: Outstanding. I`ll only highlight the OST, which has the most awesome battle music from the franchise Crescent Moon.\\n\\n\r\nCharacters: As I mentioned above, characters design and development is the major strong point of IBO. ALL OF THEM GET DEVELOPED. You won`t see the same thing that happens in other Gundam (I am looking at you 00), in which some characters never get the spotlight. They all do, they all have feelings, motivations, opinions of their one. Orga is the best characters of the Gundam franchise for me, and Mika, although having not much within him, is the best Gundam pilot in the history of Gundam. He is straight out savage, and in not one single moment you will see him doubting his actions. No more shonen dumb doubts about the war and \"which is the right thing\" with Mika. Mika sees the enemy of his friends and family, and he goes for the throat. All secondary characters like Biscuit, Akihiro, Dante, Eugene, Ride etc are developed well. Akihiro is also one badass pilot and great character.  And, be shocked people, the blonde-politician (that almost all Gundam have at some point) has the best development of them all. She is indeed relevant to the plot and to the events surrounding her.  \\n\\n\r\nMechas: Barbatos, the main Gundam, became my favorite Gundam in terms of design. Calm down now, let me explain. I build Gunplas, so far I`ve built a lot of them. Although Barbatos follows some of the same formulae, he is the only feral-looking Gundam. He actually looks like a savage Gundam, which is consistent with Mika fighting style. The Graize models (your standard NPC-Mobile Suits) have also good designs, very distant from the Zaku/Tieren types. You will see some other MS, with not much to discuss, but Gusion Rebake is one nice Gundam as well. The amazing part of the mechas is also their backstory. Anyway, Barbatos rules.\\n\\n\r\nOverall: Best Gundam in the series for me, with AMAZING, AWESOME, COLOSSAL character development. You will be cheering for Tekkadan the whole series and caring for their members in a way no other Gundam did. Even if you are not a mecha fan, IBO is still for you.",
            "date": "2018-12-30T20:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 297541,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7676083.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Manthors",
                "username": "Manthors"
            },
            "url": "https://myanimelist.net/reviews.php?id=297541"
        },
        {
            "content": "Before I get into the review this is the first Gundam series I have watched. I have watched a few mech series in the past none of them being Gundam. In all honesty I watched the series because I liked the opening by Man With A Mission  \"Raise Your Flag\". In the end its probably my most liked series featuring Mechs. \r\nStory 10/10 \r\nThe story is about a group of child soldiers wanting to make the company they create become big. To make their company big they take a very hard first job that will either destroy their company or make it. Their jobis to guide a politician to earth who is being targeted by a corrupt military group with a lot of power. The story except the beginning and end  follows this pattern, main characters plan their next move and interact with each other for one episode, go into a huge Mech battle in the following episode. The story does not let up on entertainment and the episodes that don't focus on battles aren't boring to watch as the characters interactions can be quite entertaining. If you are into interesting characters getting into epic mechs for 20 minute fights than this is a show for you.\\n\\n\r\nArt 9/10\\n\\n\r\nAt first I did not think I would not like the art very much as it is different to other anime I have watched in the past where characters are drawn very smoothly. The character designs seem plain at first but you get used to them as the anime progresses. the backgrounds and environments drawn look nice while the mechs themselves which are 2d look amazing and are drawn masterfully.\\n\\n\r\nSound 10/10 \\n\\n\r\nLike I said in my intro I mainly watched this anime because of the opening. Other songs in the ost where good especially the fight theme as well as sound effects produced by the mechs. \\n\\n\r\nCharacter 10/10\\n\\n\r\nAt first I was thinking the characters would be bland in boring throughout the series based on the first episode. However every second episode they focus on developing characters even minor ones and some of the enemys. The characters with the highest role stay interesting gaining development through their actions. Minor characters such as members of the crew who are not fighting on the front lines (because not everyone can have a mech) get some character development. The enemys are characters you dont want to win but halve who are main character level in development gain your pity when they are defeated. \\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI got really into this show and I am very sad to see it gone. I will probably watch more Gundam in the future. \\n\\n\r\nOverall 10/10\\n",
            "date": "2016-04-29T03:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 217418,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cyborg_Dragon",
                "username": "Cyborg_Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=217418"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans (Hence forth referred to as IBO) is another addition to the Gundam universe. It has many of the themes and plots that surround Gundam. It has politics, mechas, explosions, and questions about humans and differing beliefs. IBO is a nice addition to the franchise, just that. While the topic it chooses to explore involve exploitation of children, workers rights, and the unification of different factions, it falls short of actually fully exploring everything in detail.\r\nIBO asks a lot of questions to the viewer, but it doesn't actually make the viewer think too much about the reasons of a character's action,aside from the \"this is the morally correct decision to make\" or \"for my comrades.\" While these are commendable reasons, they don't create a very good character that is strong and communicable. The strongest and most charismatic character in the show is Kudelia Bernstein (that's even stretching it), she has a huge objective, but limited drive to actually achieve it. She does everything in her own power and with the power of others to try and help the people of Mars, but she herself is completely dull in every sense of the imagination. Her lines are predictable and do not inspire any sort of fire to burn within me to try and relate, or sympathize with her cause; however I have to note that even her character development was lacking.\\n\\n\r\nNone of the characters really had their pasts fully explored and the circumstances they were thrown in seemed irreverent to the characters. No one had to true determination and drive to succeed their pitiful existence, and to soar into a better life. They sort of just dragged themselves nonchalantly, and fumbled around with Orga, acting as a mediocre leader. The most memorable charcter besides Kuedliam, is Carta, because she was the only one that really had any background reasons for her actions, her love and adoration for McGillis, and her warped personality. Everyone else? Who? Exactly. \\n\\n\r\nWell, these days Art and Sound are so standard that sometimes it takes something truly unique to break the current, and present something amazing. This is not one of those animes. It is a meat and potato, good consistent art, with a decent and good soundtrack. Orphans no Namida does get a note for bringing back that amazing soul/jazz vibe back into the anime scene. \\n\\n\r\nOverall, not a bad anime. Amazing and truly unique? Nope. It was overambitious and reaching for too many things, and while taking that risk fell short of being extraordinary. This show definitely needed to be stretched out to 50 episodes with the pacing it was using, and with a second season I expect it to get better.",
            "date": "2016-04-05T19:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 215623,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85715.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zerokill",
                "username": "zerokill"
            },
            "url": "https://myanimelist.net/reviews.php?id=215623"
        },
        {
            "content": "This anime is fantastic. I have always been a fan of the \"Mecha\" genre. Over recent years though I had become quite tired of Gundam. It became repetitive and the universe honestly became quite dull and filled with a pattern that was honestly lacking. \r\nThat being said \"Iron Blood Orphans\" has been a pleasure to watch. The animation is slick. The movement of the \"Mechs and Gundams\" really creates an interesting sense of combat and fluidity which changes depending on environment. It has a style which  blends well with the stories and personality of the pilots without going to overboard or in depth. Theclose combat style of fighting allowed for some brilliant exchanges and animation as well. It also added a level of belivabiltiy to the combat for me as ammunition is not infinite and close quarters battles can and will result. The animation was well done overall and blends well with the story. \\n\\n\r\nThe story is brutal, engaging, and surprisingly relevant. They may hold to some common archetypes, yet do a solid job of creating an interesting variation with them. This \"child soldier\" aspect is a very difficult premise to work with. In \"Iron Blood Orphans\" however it helps explain and lend credence to young people being capable of outstanding fighting prowess. The character backstories aren't very in depth, but it works for creating the feel these children are \"disposable,\" a trait very common in real life child soldiers. I feel that simple fact helps bring a sense of authenticity to a universe that is often lacking in that department. The revolution of mars over earth theme is a fairly common story in the Gundam universe. I just found myself not caring very much as this plot just felt very organic to the premise of \"revolution.\" It wasn't to outlandish or over the top, it felt grounded in some form of reality, even if based in the future. \\n\\n\r\nMy only gripe comes from wishing their was more. Occasionally things feel like they are being rushed because of episode constraints, etc. I would really like to see how far they could take this premise- and how it will not only effect the characters but the universe in which they inhabit. \\n\\n\r\nIf I were to sum \"Iron Blood Orphans\" up in a few lines, I would say, \"it proves you can teach an old dog new tricks that are both stunning and enjoyable.\"",
            "date": "2016-03-30T23:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 214897,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Caddie_revo",
                "username": "Caddie_revo"
            },
            "url": "https://myanimelist.net/reviews.php?id=214897"
        },
        {
            "content": "Mobile suit gundam iron blooded orphans takes place in another alternate universe of gundam. Where kids are mercenary's and shit and the story is they have toget this princess girl to  earth. See the problem with this series is that it just isn't intriguing and that it literalsly shouts at you throughout the whole eries. When characters and children die WAR IS BAD CHILDREN SOLIDERS SEE HOW HORRIBLE IS THAT  where  l really did not care most of the characters feel like they came out of a michael bay film.\r\nThe art and sound are alright the  show looks decent and themusic isn't really amazing except for the opening and ending.  The show can be pretty enjoyable if you want to lose brain cells its not the worst au gundam in the world but it  certainly isn't a good gundam series.\\n\\n\\n\\n\r\nP.s shitty review to do when l am hung over as fuck",
            "date": "2016-04-02T06:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 215170,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4255489.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Mas0chist",
                "username": "Mas0chist"
            },
            "url": "https://myanimelist.net/reviews.php?id=215170"
        },
        {
            "content": "Iron-Blooded Orphans (IBO) is the most recent installment in the Mobile Suit Gundam Universe, but avoids the tired and stale aspects of the more recent predecessors. IBO paints the disturbing reality that child soldiers face in a war torn era - it is a provocative yet grief-stricken series that highlights everything wrong with placing a gun in a child's hands. While the story itself is a highlight of the series, IBO's most glaring problem is in character development where it is hard to support the convictions on many of the characters due to incomplete background knowledge of their circumstances.\r\n{Story} - IBO's story is most certainlyits strongest point. There is never a dull episode and the pacing is consistent and engaging throughout the 25 episode series. The heart-wrenching stories of child soldiers fighting for what they believe is the only way they can live will keep you rooting for characters beyond the main characters and the overarching story is fulfilling.\\n\\n\r\n{Art} - As with nearly all Gundam series, the art is very good. With that said, there is nothing in IBO that makes it stand-out from the rest of the Gundam universe.\\n\\n\r\n{Sound} - Similarly to IBO's art, the sound in IBO is very good and on par with most Gundam series. The opening and ending songs are all very catchy and will likely find their way onto your anime playlist (if you're into that sort of thing).\\n\\n\r\n{Character} - Character development in IBO is where I found the series to fall flat. I really never understood or believed the rationality behind some of the main characters motivations - particularly Mikazuki. While there is an announced season 2 on its way where their background may be expanded upon - until then I found their lack of backstory to be a glaring issue as I never felt connected to anyone except for Orga.\\n\\n\r\n{Enjoyment} - As I mentioned earlier, the series never had a dull moment. Even the slower paced episodes had interesting and important elements that kept the story flowing and keeping the viewers interest. As long as you're into the mecha genre, you'll be entertained the whole way.\\n\\n\r\n{Overall} - Overall I gave IBO an 8/10. The overarching story and subject matter was excellent and would have earned a solid 9/10 if not for a severe lack of character development and background information. Hopefully this will be remedied in the upcoming season 2 in the Fall of 2016! The series is definitely worth watching and my favorite Gundam series since Seed.",
            "date": "2016-05-10T21:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 218338,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5325623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kyantoweru",
                "username": "Kyantoweru"
            },
            "url": "https://myanimelist.net/reviews.php?id=218338"
        },
        {
            "content": "They misspell tomato on the wall of the cafeteria in episode 18. There, I saved you from watching the series.... kidding.\r\nThis series seems to annoy hardcore Gundam fans, so if you are one of those people... don't watch Iron-Blooded Orphans. But if you just enjoy the mech genre in general, this series could be right up your alley. Spoiler-free below.\r\nStory - 7\r\nWith less politics and more focus on the conditions of people (namely people oppressed by Gjallarhorn, people from different planets, people without a planet) Iron-Blooded Orphans is pretty tame compared to other Gundam shows, but still has good fight sequences and a decent storyline. They convey some darker themes, bloody action, and sadly some slice of life (filler is filler regardless of the show) but not enough to turn me away at any particular episode.\\n\\n\r\nArt - 7\\n\r\nI'm not too sold on the animation, as it seems to be a big soft and childish, but it's by no means poorly done. I'm a fan of everything being hand drawn.\\n\\n\r\nSound - 8\\n\r\nGood sound tracks, decent FX, and enjoyable VA.\\n\\n\r\nCharacter - 6\\n\r\nThey have a pretty big cast, but only 4-6 of them are important in each episode. Development is lacking, but considering they are mostly children who were former slaves I can't really be too hard since they all have a similar backstory. They could use more diversity here and the use of backstory/flashbacks would have helped fill out the main characters better. They do however have some nice character growth for a few of the cast. Unfortunately, there are usually character deaths in fighting/war anime so be prepared for the possibility of losing a character you like.\\n\\n\r\nEnjoyment - 8\\n\r\nWhen you put the simple story, next to a giant robot; then add some action and a few plot twists here and there it makes for an easy watch. You don't have to think too much to enjoy this and IMO the lack of too many overbearing themes (religion, convoluted politics, culture saturation) makes this a good starter show for people who want to get into mech anime.\\n\\n\r\nOverall - 8\\n\r\nA score of 8 is what MAL says is \"very good\" which is how I would describe this show. It's not a masterpiece and not mediocre, so its got to be somewhere in between. Also, give the show a few episodes and make your own decisions, I know I'd have missed out on several anime if I had only watched the first few episodes.",
            "date": "2016-04-02T20:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 215274,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365387.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheBax",
                "username": "TheBax"
            },
            "url": "https://myanimelist.net/reviews.php?id=215274"
        },
        {
            "content": "SPOILER WARNING!!!!\r\nThis is will be my first sh*tty review, so If you don't like it, don't READ IT. Thank You.\r\nWatched All episodes of Gundam IBO, and... I'm disappointed of this. That ending... Isn't even an ending @-@\r\nThe only good parts of this anime is their mechs and their fights, and Badass Mikazuki \"Killer Machine\" Augus. The plot of first part was better than the second one, honestly. McGillis and Gaelio relationship are only the best point out there.\r\nThe bad parts is the charas design that really weird and more akin to AGE rejected designs than 00, too much \"QUALITY\" animations and terrible pacing (3-4 episodesonly sleeper talking without actions). I think Okada isn't the writer that anyone hopes to be and she ruined everything on second half. Characterization error can be seen at last episodes (24-25) and it's really terrible.\\n\\n\r\nAt least their music is decent. The OP 1 music is very great anyway\\n\\n\r\nBut... It's just an reverse \"engineered\" ripoff of Aldnoah.Zero...\\n\\n\r\nAt least its still slightly better than AGE and G-Wrecko shit. I considering to watch 2nd season or not.\\n\\n\r\nBut still, my fav Gundam series is SEED (but Destiny is just decent for me but still my fav), 00, Unicorn, and Build Fighters (Minus Try-ain Wreck).\\n\\n\r\nI give this show 6/10 for me.\\n\\n\r\nAnd that's my opinion about the IBO, feel agree or disagree anyway...",
            "date": "2016-04-04T22:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 215548,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957306.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SaltyShoebill",
                "username": "SaltyShoebill"
            },
            "url": "https://myanimelist.net/reviews.php?id=215548"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans is a series that is obviously trying to do something \"new\" with the often predictable story of Gundam-genre shows.  To this end, it succeeds in some places and fails in others.  It is a ponderous, often slow-moving character-focused anime that actually does not focus very much on mobile suits at all.\r\nSet in an alternate universe not explored before in Gundam, IBO follows a group of rebellious \"space rats\", children who are essentially corporate slaves, as they overthrow their corporate masters and work to establish an independent economic sphere on Mars.\r\nI say that IBO is attempting to do somethingnew because it breaks away, or at least attempts to, from many of the cliches of the Gundam genre.  There are space colonies, but they are not the focus.  The story is focused mostly on the pilots of the mobile suits, rather than the suits themselves.  A lot of time is devoted to character development.  The mobile suits use conventional ballistic and steel weapons, rather than lasers, charged particle beams, and beam sabers.\\n\\n\r\nWhere it fails, however, it does so spectacularly.  There is a \"Char\" character here, and even a companion character with purple hair ala Garma.  There is also a wunderkind almost superhuman child protagonist who is never really given any reason for his abilities.  Also, a conflict between the rich on Earth and the oppressed in space is very much in line with traditional Gundam tropes.  The mobile suits themselves also rely very heavily on deus ex type technology reminiscent of Minovsky Particles from the UC universe.  There is also a Relena Peacecraft-esque character.\\n\\n\r\nThe story itself feels like someone took Gundam SEED and smashed it together with Gundam Wing.  If the art weren't so good, I'd think I was watching an over-the-top melodrama anime from the late 90s or early 2000s.  The series' focus on overt displays of masculinity is also an odd choice.  This appears to be a universe where strong females only exist to be dominated by the men around them.  All the females who start out strong are reduced to weepy whiny babies by the end of the show, whereas all the weak men become super buff macho characters.  In many ways, this show almost feels like a harem anime with all the traditional harem roles filled by other men instead of women.\\n\\n\r\nThe series also does a relatively good job of world building--that is, setting the stage for the characters and action of the story, without being too nebulous like Gundam AGE tended to be.\\n\\n\r\nOverall, as an alternative series to the traditional UC setting of Gundam, IBO is worth a watch.  I actually hope they develop the world more with future series and OVAs because it feels like there is much more storytelling to be done here.",
            "date": "2016-06-02T15:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 219861,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AH1cm",
                "username": "AH1cm"
            },
            "url": "https://myanimelist.net/reviews.php?id=219861"
        },
        {
            "content": "Iron-Blooded Orphans is my second entry into the Gundam Universe whereby the first one was Build Fighters. Taking it as a story on its own as I do not know about previous Gundams, this story is AMAZING. It makes utter sense when looking at it from a reality perspective. The characters are quite well developed despite sometimes the story, in general, has some shortcomings. The art varies from high detailed to low details in a very nice way that makes it look cute and accurate at different points.\r\nWhy I enjoyed this Anime so much? If you never watched Gundam before but knows a bit aboutthe flashy swords and beams and think that those are too extravagant, this is for you. This Gundam story is not only about mechs, it's about much more than that and the mechs just brings that final touch to it that makes it perfect. As I mentioned above, compared to previous Gundams, this series, moves from a fantasy mech level to a more sci-fi mech level, so you have this sense that there is no wrongness in terms of combats and physical maneuvers even for weaponry and everything associated. \\n\\n\r\nLastly, the story contains everything in terms of feelings, rage, sadness, happiness, it's a good blend that will make the experience thoroughly enjoyable from episode 1 to episode 25.\\n\\n\r\nDefinitely something to watch!\\n\\n\\n",
            "date": "2017-01-31T19:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 239613,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2940751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RoughVoice",
                "username": "RoughVoice"
            },
            "url": "https://myanimelist.net/reviews.php?id=239613"
        },
        {
            "content": "(This review only covers the first season)\r\n\"Teenagers piloting giant robots\"\r\nIf you'd try to sum up the Gundam-francise in one sentence then this one would suffice for most of its series. Children in giant Mobile Suits, forced into becoming soldiers and being thrown into war is by no means new, not just for Gundam actually, but also for the mecha-genre in general. In fact almost every Gundam series, starting with the very first one, has done it so far. And the same goes for Iron Blooded Orphans though it emphasizes the topic more than the others did before.\r\nThe abuse of children by adults, the loss ofchildhood and the fight for survival are the central themes as the series follows a group of child soldiers who try to build a future for themselves. Starting out as mercenaries, they are thrown into a conflict they don't really understand in the beginning and struggle to stay alive along the way.\\n\\n\r\nThe story itself isn't too complex and also not as serious as it may sound at first. Which is quite a shame really, the potential is definitely there. Though there are some twist and turns along the way the plot is mostly by the book and there aren't many real surprises. All in all, story-wise Iron Blooded Orphans is mostly unexceptional. \\n\\n\r\nIn the long line of Gundam protagonists, the main character Mikazuki belongs to the emotionless kind (like Heero from Wing or Setsuna from 00); meaning he has the same expression in pretty much every situation. Throughout the series he shows hardly any sympathy or remorse and kills all of his opponents without mercy. It makes sense from the point of view of him being a person that only knew war ever since he was a child, but his constant indifference makes it hard to relate to him. He simply kills whoever his leader Orga orders him to and follows the principle of crushing anyone in his way without a second thought; something he manages because his Gundam is seriously overpowered.\\n\\n\r\nDifferent to Mikazuki, Orga, leader of the group of child soldiers, and Kudelia, a prestigious girl who tries to negotiate for the economical independence of Mars, struggle with responsibility and doubts. They act in a relatively predictable manner throughout the series and therefore aren't particularly complex or interesting. The same goes for most of their comrades who usually have one character trait which is constantly repeated. It also doesn't help that they have very little impact in the actual fights since Mikazuki wins most of them completely on his own. \\n\\n\r\nAs for the villains, Gjallahorn is this Gundam's equivalent to Zeon of the Universal Century, however they are far less complex and threatening. You don't learn too much about them aside from the fact that they are corrupt. The series establishes them as a resourceful, world - and space-dominating organisation, yet they are shown as incredibly incompetent. Example: their objective is to find Kudelia at all costs, since she is a threat to their power, but most of Gjallarhorns soldiers have no idea what she looks like. In an age where space travel and giant robots are the norm it is not possible for them to spread the picture of the girl they desperately want to stop. \\n\\n\r\nAs far as Gjallarhorns most important members go, McGillis, who manipulates both sides for his own gain, is surprisingly pale in the impact he leaves (though this may change in season two). His best friend Gaelio is probably the character who develops the most, as he slowly begins to question the circumstances around him and is confronted with loss and difficult decisions. To me he was the most likable and well-rounded character of the show. \\n\\n\r\nAnimation-wise Iron Blooded Orphans is quite good, particularly the mecha-fights are usually a highlight, since they are great in their detail and dynamic. Plus most of the mechas have cool and sleek designs that look sharp across the board. The character designs are a mixed bag; some are great others not so much. At some points CG-animation is used, which isn't pretty, but it could have been much worse. \\n\\n\r\nThe soundtrack is excellent, one of the best parts of the show by a mile. A lot of the tracks are memorable and definitely contribute to the atmosphere of certain scenes. \\n\\n\r\nSo what's my final verdict? Iron Blooded Orphans could have been better: better in the way it treats the problems it wants to address, better when it comes to the complexity of the politics in the world it tries to build, better in the exploration of the themes it wants to discuss. \\n\\n\r\nIt is not like it doesn't try, there are casualties on both sides, people get injured and scarred for life, the stakes are high and yet it is too simple, too superficial and too far away from coming close to giving the viewer a somewhat realistic impression of war and its cruelties. With that it feels half-baked and not forceful enough to truly be great, resulting in a series slightly above average thanks to its well animated fights and great soundtrack.",
            "date": "2018-12-24T16:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 296740,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5689582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tisarana",
                "username": "Tisarana"
            },
            "url": "https://myanimelist.net/reviews.php?id=296740"
        }
    ],
    [
        {
            "content": "The Gundam franchise is a massive universe. As another installment, there can be a lot of optimism for Iron-Blooded Orphans. I have to admit, getting into this show at first made me nervous. Some of the recent Gundam related series such as Gundam AGE and Gundam: G no Reconguista received very mixed reception. Furthermore, Iron-Blooded Orphans is spearheaded by Mari Okada, a director who is well-known for adding in melodrama into the story. But for this show, I can safely say that it’s definitely something worth investing time into whether you’re a fan of Gundam or not.\r\nFor timeline purposes, the show takes place after theCalamity War, a war between Earth and Outer colonies. Actually, make that 300+ years. A major conflict involves Mars and its city Chryse. The people there seek independence from the government and make their own lives into something better. A young Martian woman named Kudelia Aina Bernstein hopes to secure independence. Her role in the story becomes more complicated as she gets involved with a group known as the Tekkadan, whom is entrusted to protect her life. So begins this story that leads politics, warfare, and a world of internal conflicts. As the show’s catch phrase, this is “the sustenance of life is on the battlefield.\"\\n\\n\r\nIn context, the show is a war story but also deals with a variety of real life issues. From poverty to child soldiers and imperialism, the show really offers a lot of insightful concepts. There’s even themes of experimentation as certain characters are fit with the Alaya-Vijnana System (Whiskers) to enhance their fighting abilities. Still, the show constructs a story that expands beyond just fighting a war for independence but also takes a look at the interpersonal conflicts of people in its universe. At the heart of it, we have members of the Tekkadan. Led by Orga Itsuka, the show capitalizes on their role to protect Aina. Their ace pilot, Mikazuki Augus (also known as Mika) pilots the mysterious mobile suit known as Barbartos. Throughout the show, we see his piloting and combat skills including his role to fight off Gjallarhorn, an Earth Military organization set up to capture Aina. Tekkadan also consists of other members including Biscuit Griffin (a strategist), Eugene Stark (former leader of the third army’s division), Norba Shino, Akihiro Atland, Atra Mixta, among others. What’s interesting about this group is that although they all come from different backgrounds, they are all united with similar purposes and treats each other like family. The family theme extends to not just the group but also Aina as she gets to know more of its core members. With such a colorful cast of characters, the show really can be appreciated for its characterization.\\n\\n\r\nA good part of the story involves the journey Aina and Tekkadan takes in order to reach their goals. Part of it feels like a cat-and-mouse story while other parts are calmer with even has a feel of slice of life. In addition, the show also introduces others factions, some who later become valuable ally of Tekkadan while others are against them. Now I have to admit though, the story itself may feel like it has some pacing problems. A few of the episodes are non-combat related and some lacks development with the overall presentation of the story. However, it also emphasizes on the characters because they really are something special. The director and producers are aiming high for with this TV show so everything constructed has a purpose. The main characters has an iron will with their goals so a few of the episodes examines at their personal lives. Throughout their on-screen roles and background storytelling, we learn more about them especially Mika. He is an orphan with poor social skills but learns throughout the show with help from Aina. There’s a change about his character through his acquaintance with her as he becomes more casual and more interested in his own future. Their relationship even has a taste of romance in it as time goes on and this doesn’t seem like a surprise. Aina’s a kind woman who cares about others’ well-being above her own. She is also a good role model for the children through her ways of teaching them how to write, in particular Mika. This opens up his interest to forging his own future someday. Similarly, Mika’s relationship with Orga is strong. Their friendship has already been established during their childhood and it’s evident that the two would risk their lives to protect each other and their goals. Now I don’t expect everyone to like Aina’s role in the story. Despite her aristocratic status and selfless nature, she is still a bit naïve at times. And furthermore, her insecurity to provide help during crucial moments of fighting can be a bit irritating. Because of the nature of the show, expect other characters to relive moments from the past that resurfaces in the present storyline. A prime example is Akihiro as he deals with a blast from the past. On the other hand, there are also lighthearted relationships such as Mika and Atra. Some may see her involvement with him to almost be part of a love triangle. However, don’t expect this show to be a love story. It’s still an iron-blooded war tale. In retrospect, the show really has an iron blood with its story and characters.\\n\\n\r\nWhen looking at the themes of the show, it’s easy to notice how much it has relations with the past, present, and future. The poverty of the past influences people to try and find a better future for themselves. The present has an emphasis on neo-colonism as we see advanced civilizations expand through funding and technology. For the future, Aina’s ambition to seek independence is a hopeful vision for her people. This is a bit contrast with Gjallarhorn. In essence, they are a military organization who seeks peace but pursuits them with violence means. Some of its core members such as McGillis Fareed, Gaelio Bauduin, Ein Dalton, and among others has their own ideologies. But one thing they seem to all share is strengthening their nation’s own relations and wealth. On the other hand, there’s also Teiwaz, a business conglomerate. Their relationship with Tekkadan also a similarity about family as their representative member forges a pact with Orga. The amount of relationships in this show is really special and something to take by heart. Whether you agree with their goals or ambitions, it’s important to understand why they fight. And this show is pretty damn good at making its point about that.\\n\\n\\n\r\nProduced by Sunrise, the show’s visual quality is a unique piece of work. Michinori Chiba is in charge of the character designs but visually looks a bit different compared to some of Gundam’s previous predecessors. I guess it feels like a fusion of Gundam 00 and Gundam AGE as the characters looks both childish and mature the same time. This is especially true with characters like Mika and Biscuit. Orga on the other hand has the look of a mature commander. Aina has more of the look of an aristocrat but can also look like a simple lady when she needs to be. Character visuals aren’t the only thing interesting about the artwork though. The universe of the show has colonies that shows wealth with its rich technology and weapons of war As such, it brings legitimacy to their statuses. From the mysterious Barbados to Teiwaz’s Saisei, everything looks crisp and establishes the studio’s effort to craft them as technological innovations. This is further enhanced by the solid action with a great amount of effort during fight scenes. Be amazed. This is a show that can be will leave strong memories even with its action.\\n\\n\r\nAt first, I wasn’t much of a fan of the music or soundtrack. But after watching a good amount of the show, it’s definitely something to take in by heart. Masaru Yokoyama clearly invested a good amount of effort into producing the music for various scenarios in the show. From melancholic moments to intense combat oriented moments waged in space, it has everything that a mecha fan can wish for. The OP song “Raise Your Flag” is also a way that symbolizes the fight for independence especially with its catchy tone and choreography. And finally, voice mannerism is impressive. Characters such as Orga shows their commanding presence while Mika is known for his cold personality.\\n\\n\r\nIron-Blooded Orphans is definitely a show to invest time in. Whether you’re a veteran or a causal viewer, the experience after watching this show will be memorable for its story, characters, themes, world-building, and powerful action. Characters’ actions all have purpose and the show offers a balanced way to showcase their motivations. I don’t expect everyone to like all the characters as some may find them less likeable than others. Still, this show is not to be underestimated and is a triumphant one at that. Watch it with an open mind and you’ll see why.",
            "date": "2016-03-27T05:22:00+00:00",
            "helpful_count": 158,
            "mal_id": 214327,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214327"
        },
        {
            "content": "Kidou Senshi Gundam: Tekketsu no Orphans/機動戦士ガンダム 鉄血のオルフェンズ Review\r\nStory (7/10) Good\r\nMore Specifically (7.75/10) Good+ \r\nThe story for Mobile Suit Gundam: Iron-Blooded Orphans like majority of the gundam plots attempts to juggle two main plots at the same time. One being about the characters and their goals they want to achieve and the second being the political side of things and they intertwine with each other. One would say if you want to follow the Gundam story plot formula both of these story plots need to be present and as synced with each other as you can possibly get. Like majority of Gundam alternate universes this universedoes indeed have a just a little bit more focused on the character side of things (which there's nothing wrong with that). The political side of things (kind of like Gundam Wing's and Gundam 00) can be a little be hard to follow if one is not paying full attention during the political scenes. I personally think it wasn't too hard to follow but I can't say I understand majority of what was going down during the political scenes and that's kind of the thing that may turn off a lot of people because it did with previous Gundam series. Luckily in my personal opinion even with it's political influence side of things  Tekketsu no Orphans' character is something that should keep most people a bay because the are good ones. \\n\\n\\n\r\nArt and Animation (8.75/10) Very Good\\n\\n\r\nThe art and animation in Tekketsu no Orphans was for the most part very good. I couldn't give this second a 9 because there were obviously some art style derps here and there when it came to characters only slightly in the background and the actually mech fights some Mech designs looked a teensy bit whanky at times but the scenes they were focused on and polished out are what is keeping it at a high 8 for me. Another thing I appreciate is that it is hand drawn, not a lot of mech anime comes out these days and when they do most of the time it is all CG. And I don't mind CG mechs trust I'm not one of those people to complain about CG mech (I love CG in Gundam Unicorn and The Origin). And I think CG on Mechs is the only thing that looks acceptable to an extent when it comes to putting anything CG in an anime. BUT I do appreciate to a well hand drawn mech anime because that's how it all started and what I'm used to. And I'm sure all the scenes that I felt could have looked better WILL look better in the retail blu-ray release... one would assume and hope.\\n\\n\\n\r\nSound (10/10) Masterpiece \\n\\n\r\nThe sound does not disappoint in any category and that's usually the case when it comes to Gundam. Voice acting (JP), BGM, both openings and endings are all outstanding.\\n\\n\\n\r\nCharacters (8/10) Very Good \\n\\n\r\nThe characters like I said in the story category are very good and what will keep newcomers to Gundam staying and watching. Although there are not a TON of characters that this applies to the ones that it does like our MC Mikazuki Augus is definitely a character that I've heard nothing but positive things from. He's not like your typical whiny pilot that we've seen in the past. He's more in the category of Heero Yuy and Setsuna F. Seiei but calling him a clone of either of the two is definitely not what I'm saying either. Because honestly I think from a character standpoint Mikazuki is a better and more interesting character than both Heero and Setsuna combine. Yes he has traits from both of them but he also has his own flair of insanity which comes out in the heat of battle. I haven't seen a main gundam pilot with such a personality trait yet the closest I can think of is Haptism Allelujah but he's not an MC. They are either on the whiny, calm or dull for the most part so to see this definitely sparks things up. Majority of the other characters are very good and like Gundam tradition we have character deaths we didn't want but expect. I knew a hand full of people where going to die not because of the countless death flags we've been given throughout the anime but because it's basically tradition at this point. \\n\\n\\n\r\nEnjoyment (8/10) Very Good\\n\\n\r\nI'm a Gundam fan if you couldn't tell I love majority of the series and I'm not your average anime fan that despises all mech anime expect Code Geass and Gurren Laggan. Some might say I give Gundam a little bit too much credit but that's all opinions and a discussion for another time. Going into Tekketsu no Orphans sadly I was already ready to like it because like I said it's Gundam. You have to really fuck up on some Reconguista type shit for me not to like you and it's definitely no where near as bad as that trash. Tekketsu no Orphans brings us a nice 8th MS Team vibe to the series. And I doubt a lot of people realize this but there was absolutely no beam sabers or laser guns in the series (as far as season 1 is concerned). Impressive because a lot of Gundam anime and other mech anime kind of have that as the requirement in their anime and it cool to see a series were as of season 1 is concern does not exist, it was enjoyable to watch the mech fights, characterization with the combination of outstanding BGM this series brought to the table.\\n\\n\\n\r\nOverall (8/10) Very Good\\n\r\nMore Specifically (8.50/10) Very Good+\\n\\n\r\nTekketsu no Orphans in my opinion delivered what it was suppose to which was a good spin off adaptation to the Gundam series and can be recommended proudly when the franchise Gundam is brought up in conversation. Tekketsu no Orphans had people worried not only because the series before it Reconguista was trash but because the Main Director Episode Director, and Storyboard creator Nagai Tatsuyuki had his hands on it and people were extremely worried that this was going to flop because of his past works. It even had me a bit worried when I heard that. But that wasn't the case as Tekketsu no Orphans in my opinion is a successful and very good alternate universe to the Gundam franchise. And with the announcement of the english dub a couple of months ago I hope Toonami grabs it and airs it on there so that the western toonami viewers can possibly get into the Gundam series like what happened back int the good ole Gundam Wing days.",
            "date": "2016-03-27T13:31:00+00:00",
            "helpful_count": 99,
            "mal_id": 214407,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4538743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rikuson1",
                "username": "Rikuson1"
            },
            "url": "https://myanimelist.net/reviews.php?id=214407"
        },
        {
            "content": "Not only is this the worst Gundam anime, it's one of the worst anime of all time. In this review I'll be talking about both seasons. There will be some spoilers. Im going to have to include some of them to truly prove how terrible this anime is.\r\nSo the very first reason why this anime is terrible, the characters. The only character I actually enjoyed was McGillis Fareed. I will say that he was an enjoyable character to watch since he was so mysterious. Other than that, all of the other charactets are bad. Since the moment I started this I knew the characters wouldbe terrible. This anime has such a large cast of characters, and that is a problem. Since there are so many characters, barely any of them had character development at all. Almost every single character is one dimensional, and that is absolutely terrible. The thing is, I wouldn't have too much of a problem with the very minor characters not getting any character development. The problem is that the main character (Mikazuki) gets absolutely no significant character development throughout the entire series. Like seriously, he hasn't had a significant change in his character since episode 1. The other character, Orga Itsuka is just as bad. Now I'm going to have to include a spoiler, so if you arent caught up you might want to exit this review. There is a character that goes by the name of Shino. He sacrificed himself in an attempt to kill the enemy leader in episode 45. Once he fails, Orga Itsuka tells tells everyone to go back and rescue Shino. This is just one of the many examples of extremely bad writing. He has been leading all of the orphans for such a long time yet his leadership skills didn't develop at all. That was his moment to shine and actually develop as a character, but they fucked it up. He could've actually started acting more like a leader but he didn't. Once again ladies and gentleman, this is onle one of the many examples I have for this review. It's already bad enough that most characters don't get developed, but if the main two characters never had any significant character development, then that is an absolute problem for the story. My next point is that this many episodes in this anime have no story progression whatsoever, specifically the first season. All they fucking did was fight battle after battle until they escorted that one girl to earth. The plot of this anime is somewhat similar to the plot in Jojos Bizarre adventure part 3. The main cast of characters just had the goal of arriving to a destination. This was really bad in the case of this anime, since a shit ton of episodes had no story progression at all. What made Jojos Bizarre Adventure part 3 at least interesting was the battles. Each battle was a masterpiece in my eyes. It was so much of a pain to even get through part 1 of this shitty anime because it's extremely slow paced. \\n\\n\r\nThe animation and sound are really the only good things about this anime. The openings and some of the fight scenes are pretty damn good. I won't talk much about this anyways. The good animation and fight scenes wont redeem the bad writing that this show has.\\n\\n\r\nThis anime has many useless characters that contribute absolutely nothing for the story. An example of a useless character would be Atra Mixta. This character was absolutely useless. She was simply just a one dimensional character that did nothing but flirt with Mikazuki (which is very cringe since she appears to be an 8 year old). This also brings me to my next point, the romance in this anime is done horribly. It's extremely bad. It just turned somewhat into a harem with Kudelia and Atra (the worst characters in the story). It was so poorly done because there was so much build up between Mikazuki and Kudelia's relationship, but then he just ends up with the girl that appears to be 8 years old. Not only this, but the romance is just extremely cringey. It makes it even worse because the characters have minimal to none character development. The romance between Akihiro and Lafter was terrible. All of that build up just so she can get shot by a RANDOM person? That's extremely bad writing. This also brings me to my next point, the way the characters die in the end was EXTREMELY bad, especially in the case of Orga Itsuka. He just randomly gets shot by a random person! That's the absolute worst way to kill off a protagonist. If you're still reading this review, I want you to do something. Think of a long running anime that you really like. How the fuck would you feel if the main characters just gets killed by a random person that shot him. It's fucking pathetic isn't it? Instead of making him die in a badass way like Shino, the directors decide to get him killed like that. That's extremely bad writing. This anime pretty much did the same thing Akame Ga Kill did, killing of characters in the dumbest of ways. What makes it so bad is that the characters have zero depth to them, so us as the audience really couldn't care less if they die. \\n\\n\r\nSo here is an overall summary of my review\\n\\n\r\nAnimation: 8/10\\n\r\nSound: 8/10\\n\r\nCharacters: 0/10\\n\r\nPlot: 0/10\\n\r\nWriting: 0/10\\n\r\nEnjoyment: 2/10\\n\\n\r\nOverall: 2/10\\n\\n\\n",
            "date": "2018-07-21T19:41:00+00:00",
            "helpful_count": 18,
            "mal_id": 284473,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6115012.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/thatrpgdude",
                "username": "thatrpgdude"
            },
            "url": "https://myanimelist.net/reviews.php?id=284473"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans is an original series not based on any other work like manga, novel or a game. It's quite a rare to see original anime these days and most of them are poorly made. But this one may surprise you.\r\nAn easy-to-follow story with flow and focus, exciting space combats, strong both male and female characters, some well-placed plot twists and a little bit of romance and comedy just to spice things up. But above all this story present the human side of  characters while not neglecting the plot. We can see strong friendships, trust, how they all deal with tragicdeaths of their families, friends and comrades, how they try to find their place in this messed up world and not losing hope. Not very original but interesting to watch. Animation is also very smooth and nice. \\n\\n\r\nDownside is that the story was rushed. Especially in the last few episodes. There was that “last battle” where they all went on a shooting rampage and all was over just in one episode. I felt like the main message was lost. Not to mention some of the so called good guys turned bad all off a sudden, like McGillis. Also one of the main characters Orga went downhill from a strong confident leader to someone who doesn’t think rationally and makes rush decisions. The political background of the story was a little bit confusing too and hard to follow. And some of the dialogues were just meaningless and boring. \\n\\n\r\nTo sum up, this anime has big potential and the story is not about typical battle of good vs. evil. More like a fight to make things better. If you ignore some minor flaws in concept of characters, parts of the plot which are not clearly explained and rushed ending it’s really fun to watch. So give it a try. \\n",
            "date": "2016-03-28T06:25:00+00:00",
            "helpful_count": 48,
            "mal_id": 214524,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2465721.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/plisetskytrash",
                "username": "plisetskytrash"
            },
            "url": "https://myanimelist.net/reviews.php?id=214524"
        },
        {
            "content": "Gundam has always been a franchise that focused on the horrors of war. It is the nightmare of existence, the human race being in a state of perpetual conflict. Throughout the franchise's history, the effects of war have been tackled from a variety of different angles. From those with autism (kamille) to brown skinned traps (Loran) but there has never been a Gundam entry that focused specifically on child warfare. The real world is rife with conflict, and in lesser developed countries, children are on the frontline. There is a saying that in war the truth dies first. This is true but there is anotherimportant piece missing from that saying, innocence is also the first to die. Mobile Suit Gundam Iron Blooded Orphans is the first in the franchise that focuses on a child army and the effects that war has on children. My initial hype for the premise led me to believe this show was going to be something very special. However, in actuality the gravitas of the subject was much too heavy for famed melodrama/romance writer, Mari Okada, to handle competently. Although this series spans 50 episodes, you leave with the feeling that the show was never finished.\\n\\n\r\nIt is 300 years after the calamity war, a conflict that utterly decimated human civilization and led to the death of billions of people. The effects of that war are still seen in the destitute conditions that our protagonists live in. Iron Blooded Orphans focuses on a group of rambunctious youths who work in a mining facility on Mars. These children were either abandoned at a young age or forced to work to pay off their family's debts. The conditions at the mining facility are brutal; the adults verbally abuse the children and beat them if they do not perform adequately. It isn't uncommon for kids to fall dead from exhaustion. The tone is well set in the beginning episodes. This changes when the mining facility is contracted to protect (for some reason) a young politician, Kudelia Aina Bernstein, who seeks to rid both Mars and Earth of economic inequality and exploitation. Unbeknownst to the kids, her life is threatened by forces who want to maintain the status quo. These people are gjallarhorn, a paramilitary organization created to prevent conflict and corrupt politicians. These kids, while mining, find an ancient Gundam frame, a mobile suit model that helped to end the calamity war. After finding the Gundam, the children become embroiled in war much bigger than themselves with their freedom and the fate of humanity rides on the success of the newly formed army, Tekkadan.\\n\\n\r\nIron Blooded orphans are divided up into several arcs with the overarching conflict of the show holding everything in place.  The quality of these arcs is consistent in their mediocrity. Rarely are there any episodes which make good use of the darkness of the subject matter. There is always a feeling of levity in contrast to the direness of their circumstances. The arcs revolve around a conflict that focuses on a specific character. So the quality of the character writing directly impacts the strength of that arc. Sadly, the characters are milquetoast to say the least.\\n\\n\r\nIron Blooded Orphans has a rather large cast of characters with Tekkadan, the child army, having about 10 or so important characters and Gjallahorn having about 3 or 4. The front men of Tekkadan, Orga and Mika are the weakest protagonists in the Gundam franchise. Orga in particular is a very forgettable character. He is tasked with being the Leader of Tekkadan meaning he has to make difficult decisions that could get him or his comrades killed in battle. Although this is a reoccurring issue throughout IBO, these scenarios seldom leave any emotional impact. Orga is just boring. He can be confident when he has to be, but other than those moments he is so indecisive. IBO fails to delve deeper into the psychology of leader struggling to make decisions. Mobile Suit Gundam Thunderbolt is a show that in merely four episodes, we can see the internal struggle of being a leader where Claudia, a fleet ship captain knowingly has to send untrained children to their deaths for the sake of the Federation. She breakdown and does drugs to cope with her guilt. There are no moments that are as nearly as impactful as that in IBO with Orga. He lacks any defining character traits that put him beyond that mold of characters of the same archetype. Every arc that he is the focal point of struggled to hold me interest merely because he is not compelling enough to be a main character.\\n\\n\r\nHis counterpart, Mikazuki Augus is a case of wasted potential. He behaves in a sociopathic manner. Mikazuki has no problem killing entire groups of people if it for his comrades or Orga specifically. However, the relationship that he has with Orga is never sufficiently elaborated upon so I could never understand why their bond is so close. This is especially frustrating when the entire cast get some flashback episode while the faces of Iron Blooded Orphans, Mika and Orga, never do. It feels as though the writers did not know how to making their backstory tragic enough so opted out of trying to explain it. \\n\\n\r\nDespite the breadth of the cast, there are very few characters worth mentioning. We have Akihiro Atland, whom I affectionately call “Space Guts” due to his brooding aura and character design. He would have to be my favorite character out of the bunch. His backstory, where he was given up by his family to slavers to pay off their debts gave him and other like him the title of “human debris”. I would argue that the show would have been a lot better if there was a singular focus on Akihiro and others like him since they have the most interesting backstory and their stories parallel those in the real world. But, like many other characters, after Akihiro’s character arc was finished, he never got any more focus. His character remained unexplored which upset me because they could have taken him down a lot of interesting character routes. Mcgillis Fareed or “The loli lover char” could have been better if he was fleshed out more beyond his initial charm and cunning. And then we have the quintessential loli character, Atra, who is best girl.\\n\\n\r\nThis is where the show feeling “not finished” comes in because characters are never explored efficiently. Mari Okada is not talented enough to write a varied cast like Yoshiyuki Tomino is. She does not know how to juggle subplots and can only focus on one thing at a time. This also ties in with the show’s issue with world building. The lore of the world is not sufficiently fleshed out, meaning there are a lot of gaps in the history of the show. For example, we do not know the philosophy of Gjallahorn nor why the calamity war occurred. These things are mere afterthoughts and you know the same amount of information from the beginning to the end. The Gundam franchise, more specifically Tomino’s Gundam, had a big emphasis on political philosophy. The series were a dialogue between fascism, monarchism, and democracy. Iron Blood Orphans is brain dead in this department. The underlying philosophy of the show is literally “muh equality” with no deeper examination of why equality is good or how to realistically achieve it. Apparently, all you need in the world of IBO is naïve idealism and you can accomplish anything. \\n\\n\r\nIron Blooded Orphans is a show that I was desperately hoping to be good, considering that good entries in the Gundam franchise are far too few and between nowadays. Sadly, Mari Okada was not up to the task of living up to Tomino’s legacy. She should stick to her melodrama and leave war to someone who has the talent to survive it. \\n",
            "date": "2018-07-25T13:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 284767,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=284767"
        },
        {
            "content": "First off, I have to say that i dropped this series after the first couple of episodes. I didn't like Mika, I thought he'd be a stereotypical stoic character, but he's MUCH more of an interesting character than I had previously believed.\r\nStory: 9- The story is fairly simple, but how it is handled is done masterfully. Very few shows have me hooked and can keep my attention for the majority of the series.\r\nCharacters: 10- First off, Mika isn't the only main character, because, at least in my opinion, Orga is also the main character. EVERY character is interesting, besides maybe Ein, and not one ofthem is disposable, and not one death goes unnoticed. Mika seemed like an annoying stoic character at first, but whats so interesting about his is that you don't really know him. He isn't a personable character, but he is certainly one that cares about his comrades, but at times you may feel that he is a sociopath.\\n\\n\r\nOverall/Enjoyment: 10- This is a fantastic and consistently excellent show, one that should be watched and appreciated more than most. It isn't filled with fan service or annoying romance. It's a realist story about child soldiers that isn't made to make you cry, but to give you hope and spirit.",
            "date": "2016-03-27T09:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 214361,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KLRock",
                "username": "KLRock"
            },
            "url": "https://myanimelist.net/reviews.php?id=214361"
        },
        {
            "content": "First, i'm going to be honest that i have never watched Gundam before. i have played the game with my cousin or friends a few time in the past but i don't really know much about Gundam. So after i saw this adaptation, i wasn't really interested in it, but because of the popularity, i got curious and i tried to watch it and! i was expecting something like Aldnoah Zero but WOW! it was beyond my expectation. Well, personally, i prefer Aldnoah Zero, but this anime is great too in my opinion. The brotherhood is real!!!\r\nI don't really know much about the story butit started with a bunch of kids who was being slaved in some company. They got attacked but an organitation or a goverment in the first episode, and that's how everything begins. and i think it's pretty similiar to Aldnoah Zero, the story i mean. The Princess wants revolution. yeah... pretty same, but the difference is the Character Relationship. i had to choose Aldnoah Zero or This series based on the Character Relationship, i would choose Gundam. I really like the brotherhood relationship. A bunch of kids who are not supposed to be holding a gun or so whatever it is, they were fighting together with the princess. with them to fight besied the princess, their relationship got bigger and bigger, into some point which they can even sacrifice themselve for their own goals, for their own friends. i seriously like that. \\n\\n\r\nFrom the story or the plot, i don't really understand it, but overall i can still understand the plot and the story, but if they connected with the past, i'm out, because this is the very first gundam series which i have ever watched. \\n\\n\r\nThe soundtrack.... NO MORE WORDS!!! Man With Misson sing the OP and Kalafina sing the ED song. with that, they created a really unique atmosphere. NO MORE WORDS FROM ME!!! GREAT!!!\\n\\n\r\nI think i don't need to say it again about how good the character to me. Botherhood relationship, that is the most thing which i like from this series. The princess personality was great too. probably she will be the second one which i like. She is so brave and kind. \"The Revolution Maiden\" that is her role in this series and i really like her role. when she made her desicion, MAN! HER DETERMINATION!!!i liked her more than before. she was so cool at that time. \\n\\n\r\nThe animation was really great too in my opinon, esepcialy when it comes to Mika in Action. really badass AF!!!. \\n\\n\r\nOverall it was a really great series in my opinion. really like the unique felling too which i felt in the whole series. it was an enjoyable and great series with all of that rage in the action too. GREAT!!! 9/10. \\n\\n\r\nSorry for bad english.\\n\r\nHope my review can be helpful to you all. \\n\r\nThanks. Have a nice day\\n",
            "date": "2016-03-27T11:00:00+00:00",
            "helpful_count": 16,
            "mal_id": 214378,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4481249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YizelTro",
                "username": "YizelTro"
            },
            "url": "https://myanimelist.net/reviews.php?id=214378"
        },
        {
            "content": "IF THIS ANIME IS NOT THAT GREAT IT WOULDN'T HAVE A 2ND SEASON...THIS IS THE ONLY ANIME I ENCOUNTERED TO END IN THE SAME YEAR AND START THE 2ND SEASON AT THE SAME YEAR...\r\nwell if your a realist dont watch anime...especially if your not into gundams...\r\nto the person who says that the characters are uneducated kid, you are stupid...u didnt read what yukino ojisan said...some kids know how to read some are not thats why they are in combat like the main character mikazuki...he also explain why an uneducated kid like mikazuki can control barbatos is because of alayana system that he has.... the characterswho can read are the human debris thats why they are in control of the ships and akihiro can control a graze before he gets his second gundam.... they get their fighting experience because they are orphans who are used as a tool in combat... that's why Orga is not in the main control of the ship he's in command of the ship\\n\\n\r\nthe title is MOBILE SUIT GUNDAM IRON BLOODED ORPHANS that means its about orphans who struggle to fight for their group using gundams... the story is great and it was really heart breaking for me to see how they struggle to live and protect their found family....\\n\\n\r\nIT IS A BEAUTIFUL STORYLINE, CHARACTERS AND SOUND...I REALLY ENJOYED IT A LOT...MY HEART BEATS FAST EVERY TIME I SEE THEM IN COMBAT...IT FEELS LIKE I'M ONE OF THE GIRLS WHO WISHES FOR THEM TO LIVE BECAUSE THEY DESERVE TO LIVE...\\n\\n\r\nTHANK YOU FOR THE CREATORS OF THIS ANIME!!!!!!!!!! THANK YOU FOR THE HARD WORK!!!!!!!!!\\n\\n\\n",
            "date": "2016-03-29T22:18:00+00:00",
            "helpful_count": 16,
            "mal_id": 214756,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/alcas001",
                "username": "alcas001"
            },
            "url": "https://myanimelist.net/reviews.php?id=214756"
        },
        {
            "content": "Gundam: Iron Blooded Orphans is another Gundam series set in an alternate timeline, this one being the Post Disaster timeline. Set in a future where hostilities between human settlers on Mars and the Earth Sphere are escalating due to Earth's influence on Martian affairs through the private military organization Gjallarhorn, the series is prominently focused on a private Martian military group called Tekkadan who are given the job of protecting Kudelia Aina Bernstein, the young daughter of a Martian political family who seeks to travel to Earth to persuade the Earth Sphere government to grant independence to Martian settlers and inform them of Gjallarhorn's corruption.As Tekkadan make their journey to Earth while protecting Kudelia, they are continuously hunted down by Gjallarhorn forces seeking to prevent Kudelia from making it to Earth.\\n\\n\r\nIron Blooded Orphans has many of the typical elements you would find from a Gundam series. There are escalating conflicts between Earth and space residents, prejudice felt from those having unique abilities of some sort (Alaya-Vijnana implanted pilots in place of Newtypes), a strong willed young woman seeking to settle conflicts between the opposing sides, a high death count, corrupt individuals on the opposing side taking advantage of hostilities for their personal gain, and a young man piloting the highly powerful Gundam mecha used throughout the series. While drawing from these elements, Iron Blooded Orphans actually uses them to create its own unique plot and character developments and give it its own unique identity.\\n\\n\r\nA strong element that Iron Blooded Orphans offers up is exploring the problems faced by child soldiers through the fighting they undergo. This gets prominent focus through Mikazuki's character as due to his upbringing as a child soldier, he is psychologically unstable from his inability to properly express his emotions and deal with social situations outside of military settings. The boy will usually find himself giving into berserk rages while in battle, is completely merciless to enemy forces and has difficulty properly expressing emotions; traits that he is well aware of internally throughout the series. His interactions with Kudelia at varying points in the series lead Mikazuki to get some gradual developments in improving his social skills and empathy toward others. Besides Mikazuki, the series also explores the good deal of abuse that child soldiers are subjected to through military factions like the Brewers as the children are subjected to fear and abuse, as well as being forced into getting the risky Alaya Vijnana implants used to empower the mobile suits they pilot.\\n\\n\r\nIron Blooded Orphans plays up on many of the strengths that make Universal Century titles like Gundam Unicorn and Zeta Gundam worthwhile and memorable titles in the Gundam franchise. The series explores the conflict between Tekkadan and Gjallarhorn from the perspectives of both sides as viewers get introduced to characters among both sides that have a good deal of depth in their motivations and personalities, making the majority of characters among both factions relatable to the audience. Some of the characters find their personal beliefs challenged from confronting the harsh realities of war, this prominently shown through Kudelia's exposure to the escalation in Earth and Mars' hostilities toward one another and Tekkadan's continued struggles against Gjallarhorn. Besides the mentioned child soldiers, the series is also not afraid to show how brutal and harsh war can be with major characters being killed off, the morality of some characters deteriorating from dealing with war's brutality and influential figures among Gjallarhorn exploiting said hostilities for their personal gain.\\n\\n\r\nThe series does have its occasional bumps in quality though, mostly stemming from the typical flaws of Gundam titles. Mikazuki is mostly unstoppable as the pilot of Gundam Barbatos, killing any kind of suspense for whether or not he survives any battles throughout the series. Some characters in the series are portrayed to be rather shallow and are over-the-top in their villainy, notable case being Kudel Cadel of the Brewers. Also, the series doesn't escape the occasional annoying habit of having mobile suit pilots angrily yelling out ideologies and motives at their enemies during heated battles that are found from a number of past Gundam titles.\\n\\n\r\nVisually, Gundam: Iron-Blooded Orphans is easily one of the better quality titles released this past year. The series sports a great amount of visual detail put into the designs of its scenery, character and mecha designs; accompanied with a bright color palette. The mecha designs mostly borrow off of visual details used from past Gundam titles, including Barbatos maintaining the classic Gundam appearance. Mecha battle scenes offer up the animated highlight of the series as battles between Tekkadan and enemy forces take place in a variety of locations throughout the series that include space colonies, space, reentry into Earth and on the Earth itself. The fight scenes are mostly fluid, have great choreography and the variety of locations offer diversity in the ways that mecha battles are fought throughout the series.\\n\\n\r\nOverall, Iron Blooded Orphans is easily among the best alternate continuity titles that you can find within the Gundam franchise. Offering up all the strengths of the Gundam franchise with its own spin on them and having a strong focus on the effects that war has on child soldiers, Iron Blooded Orphans is a definite recommendation for seasoned Gundam fans or those looking for a worthwhile mecha title to get into without having to delve too deep into the convoluted continuities of the Gundam franchise.",
            "date": "2016-03-27T10:16:00+00:00",
            "helpful_count": 13,
            "mal_id": 214367,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=214367"
        },
        {
            "content": "As a big-time Gundam fan and Gunpla builder, I gotta say that Iron-Blooded Orphans (IBO) is my all-time favorite Gundam. Please, do yourself a favor, and even if you never watched Gundam or are not a fan of the mecha genre, watch IBO, you must, just must. I`ll tell you why!\r\nStory: The story of the first season is slow-building. You can`t expect the mecha action to star right away. For a while, you will get more of the characters stories, motivations, dramas, interests, and backstory. And that's why IBO is the greatest of all Gundam series. The motivation is deep and emotional, full of meaningand sensible moments, but without the shonen drama! The characters have real motivation, trying to find their place in the world and when the action starts, you will be way more driven to see the outcome, you will learn to care for these characters in ways no other Gundam made me do. The plot is interesting, with a different background that the regular Gundam anime. The plot is set with a different motivation, diverging from the classic Earth vs Space backstory that all Gundam try to achieve. Even the story of the mechas is more in-depth than any other. It's just a masterpiece of a story. The only people that the story won't reach are those who are on this only for the action. Nevertheless, for those, I say: Don`t worry, when the action starts, you will get VERY satisfied since Mika and Barbatos are the most badass fighters in Gundam history (not.....joking....at....all). And the second season is pure action. Finally, I must say that IBO is the most adult Gundam ever, with hard scenes and adult theme, which makes it even more enjoyable and puts some distance from the classic shonen.\\n\\n\r\nArt and Sound: Outstanding. I`ll only highlight the OST, which has the most awesome battle music from the franchise Crescent Moon.\\n\\n\r\nCharacters: As I mentioned above, characters design and development is the major strong point of IBO. ALL OF THEM GET DEVELOPED. You won`t see the same thing that happens in other Gundam (I am looking at you 00), in which some characters never get the spotlight. They all do, they all have feelings, motivations, opinions of their one. Orga is the best characters of the Gundam franchise for me, and Mika, although having not much within him, is the best Gundam pilot in the history of Gundam. He is straight out savage, and in not one single moment you will see him doubting his actions. No more shonen dumb doubts about the war and \"which is the right thing\" with Mika. Mika sees the enemy of his friends and family, and he goes for the throat. All secondary characters like Biscuit, Akihiro, Dante, Eugene, Ride etc are developed well. Akihiro is also one badass pilot and great character.  And, be shocked people, the blonde-politician (that almost all Gundam have at some point) has the best development of them all. She is indeed relevant to the plot and to the events surrounding her.  \\n\\n\r\nMechas: Barbatos, the main Gundam, became my favorite Gundam in terms of design. Calm down now, let me explain. I build Gunplas, so far I`ve built a lot of them. Although Barbatos follows some of the same formulae, he is the only feral-looking Gundam. He actually looks like a savage Gundam, which is consistent with Mika fighting style. The Graize models (your standard NPC-Mobile Suits) have also good designs, very distant from the Zaku/Tieren types. You will see some other MS, with not much to discuss, but Gusion Rebake is one nice Gundam as well. The amazing part of the mechas is also their backstory. Anyway, Barbatos rules.\\n\\n\r\nOverall: Best Gundam in the series for me, with AMAZING, AWESOME, COLOSSAL character development. You will be cheering for Tekkadan the whole series and caring for their members in a way no other Gundam did. Even if you are not a mecha fan, IBO is still for you.",
            "date": "2018-12-30T20:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 297541,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7676083.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Manthors",
                "username": "Manthors"
            },
            "url": "https://myanimelist.net/reviews.php?id=297541"
        },
        {
            "content": "Before I get into the review this is the first Gundam series I have watched. I have watched a few mech series in the past none of them being Gundam. In all honesty I watched the series because I liked the opening by Man With A Mission  \"Raise Your Flag\". In the end its probably my most liked series featuring Mechs. \r\nStory 10/10 \r\nThe story is about a group of child soldiers wanting to make the company they create become big. To make their company big they take a very hard first job that will either destroy their company or make it. Their jobis to guide a politician to earth who is being targeted by a corrupt military group with a lot of power. The story except the beginning and end  follows this pattern, main characters plan their next move and interact with each other for one episode, go into a huge Mech battle in the following episode. The story does not let up on entertainment and the episodes that don't focus on battles aren't boring to watch as the characters interactions can be quite entertaining. If you are into interesting characters getting into epic mechs for 20 minute fights than this is a show for you.\\n\\n\r\nArt 9/10\\n\\n\r\nAt first I did not think I would not like the art very much as it is different to other anime I have watched in the past where characters are drawn very smoothly. The character designs seem plain at first but you get used to them as the anime progresses. the backgrounds and environments drawn look nice while the mechs themselves which are 2d look amazing and are drawn masterfully.\\n\\n\r\nSound 10/10 \\n\\n\r\nLike I said in my intro I mainly watched this anime because of the opening. Other songs in the ost where good especially the fight theme as well as sound effects produced by the mechs. \\n\\n\r\nCharacter 10/10\\n\\n\r\nAt first I was thinking the characters would be bland in boring throughout the series based on the first episode. However every second episode they focus on developing characters even minor ones and some of the enemys. The characters with the highest role stay interesting gaining development through their actions. Minor characters such as members of the crew who are not fighting on the front lines (because not everyone can have a mech) get some character development. The enemys are characters you dont want to win but halve who are main character level in development gain your pity when they are defeated. \\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI got really into this show and I am very sad to see it gone. I will probably watch more Gundam in the future. \\n\\n\r\nOverall 10/10\\n",
            "date": "2016-04-29T03:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 217418,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cyborg_Dragon",
                "username": "Cyborg_Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=217418"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans (Hence forth referred to as IBO) is another addition to the Gundam universe. It has many of the themes and plots that surround Gundam. It has politics, mechas, explosions, and questions about humans and differing beliefs. IBO is a nice addition to the franchise, just that. While the topic it chooses to explore involve exploitation of children, workers rights, and the unification of different factions, it falls short of actually fully exploring everything in detail.\r\nIBO asks a lot of questions to the viewer, but it doesn't actually make the viewer think too much about the reasons of a character's action,aside from the \"this is the morally correct decision to make\" or \"for my comrades.\" While these are commendable reasons, they don't create a very good character that is strong and communicable. The strongest and most charismatic character in the show is Kudelia Bernstein (that's even stretching it), she has a huge objective, but limited drive to actually achieve it. She does everything in her own power and with the power of others to try and help the people of Mars, but she herself is completely dull in every sense of the imagination. Her lines are predictable and do not inspire any sort of fire to burn within me to try and relate, or sympathize with her cause; however I have to note that even her character development was lacking.\\n\\n\r\nNone of the characters really had their pasts fully explored and the circumstances they were thrown in seemed irreverent to the characters. No one had to true determination and drive to succeed their pitiful existence, and to soar into a better life. They sort of just dragged themselves nonchalantly, and fumbled around with Orga, acting as a mediocre leader. The most memorable charcter besides Kuedliam, is Carta, because she was the only one that really had any background reasons for her actions, her love and adoration for McGillis, and her warped personality. Everyone else? Who? Exactly. \\n\\n\r\nWell, these days Art and Sound are so standard that sometimes it takes something truly unique to break the current, and present something amazing. This is not one of those animes. It is a meat and potato, good consistent art, with a decent and good soundtrack. Orphans no Namida does get a note for bringing back that amazing soul/jazz vibe back into the anime scene. \\n\\n\r\nOverall, not a bad anime. Amazing and truly unique? Nope. It was overambitious and reaching for too many things, and while taking that risk fell short of being extraordinary. This show definitely needed to be stretched out to 50 episodes with the pacing it was using, and with a second season I expect it to get better.",
            "date": "2016-04-05T19:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 215623,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85715.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zerokill",
                "username": "zerokill"
            },
            "url": "https://myanimelist.net/reviews.php?id=215623"
        },
        {
            "content": "This anime is fantastic. I have always been a fan of the \"Mecha\" genre. Over recent years though I had become quite tired of Gundam. It became repetitive and the universe honestly became quite dull and filled with a pattern that was honestly lacking. \r\nThat being said \"Iron Blood Orphans\" has been a pleasure to watch. The animation is slick. The movement of the \"Mechs and Gundams\" really creates an interesting sense of combat and fluidity which changes depending on environment. It has a style which  blends well with the stories and personality of the pilots without going to overboard or in depth. Theclose combat style of fighting allowed for some brilliant exchanges and animation as well. It also added a level of belivabiltiy to the combat for me as ammunition is not infinite and close quarters battles can and will result. The animation was well done overall and blends well with the story. \\n\\n\r\nThe story is brutal, engaging, and surprisingly relevant. They may hold to some common archetypes, yet do a solid job of creating an interesting variation with them. This \"child soldier\" aspect is a very difficult premise to work with. In \"Iron Blood Orphans\" however it helps explain and lend credence to young people being capable of outstanding fighting prowess. The character backstories aren't very in depth, but it works for creating the feel these children are \"disposable,\" a trait very common in real life child soldiers. I feel that simple fact helps bring a sense of authenticity to a universe that is often lacking in that department. The revolution of mars over earth theme is a fairly common story in the Gundam universe. I just found myself not caring very much as this plot just felt very organic to the premise of \"revolution.\" It wasn't to outlandish or over the top, it felt grounded in some form of reality, even if based in the future. \\n\\n\r\nMy only gripe comes from wishing their was more. Occasionally things feel like they are being rushed because of episode constraints, etc. I would really like to see how far they could take this premise- and how it will not only effect the characters but the universe in which they inhabit. \\n\\n\r\nIf I were to sum \"Iron Blood Orphans\" up in a few lines, I would say, \"it proves you can teach an old dog new tricks that are both stunning and enjoyable.\"",
            "date": "2016-03-30T23:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 214897,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Caddie_revo",
                "username": "Caddie_revo"
            },
            "url": "https://myanimelist.net/reviews.php?id=214897"
        },
        {
            "content": "Mobile suit gundam iron blooded orphans takes place in another alternate universe of gundam. Where kids are mercenary's and shit and the story is they have toget this princess girl to  earth. See the problem with this series is that it just isn't intriguing and that it literalsly shouts at you throughout the whole eries. When characters and children die WAR IS BAD CHILDREN SOLIDERS SEE HOW HORRIBLE IS THAT  where  l really did not care most of the characters feel like they came out of a michael bay film.\r\nThe art and sound are alright the  show looks decent and themusic isn't really amazing except for the opening and ending.  The show can be pretty enjoyable if you want to lose brain cells its not the worst au gundam in the world but it  certainly isn't a good gundam series.\\n\\n\\n\\n\r\nP.s shitty review to do when l am hung over as fuck",
            "date": "2016-04-02T06:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 215170,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4255489.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Mas0chist",
                "username": "Mas0chist"
            },
            "url": "https://myanimelist.net/reviews.php?id=215170"
        },
        {
            "content": "Iron-Blooded Orphans (IBO) is the most recent installment in the Mobile Suit Gundam Universe, but avoids the tired and stale aspects of the more recent predecessors. IBO paints the disturbing reality that child soldiers face in a war torn era - it is a provocative yet grief-stricken series that highlights everything wrong with placing a gun in a child's hands. While the story itself is a highlight of the series, IBO's most glaring problem is in character development where it is hard to support the convictions on many of the characters due to incomplete background knowledge of their circumstances.\r\n{Story} - IBO's story is most certainlyits strongest point. There is never a dull episode and the pacing is consistent and engaging throughout the 25 episode series. The heart-wrenching stories of child soldiers fighting for what they believe is the only way they can live will keep you rooting for characters beyond the main characters and the overarching story is fulfilling.\\n\\n\r\n{Art} - As with nearly all Gundam series, the art is very good. With that said, there is nothing in IBO that makes it stand-out from the rest of the Gundam universe.\\n\\n\r\n{Sound} - Similarly to IBO's art, the sound in IBO is very good and on par with most Gundam series. The opening and ending songs are all very catchy and will likely find their way onto your anime playlist (if you're into that sort of thing).\\n\\n\r\n{Character} - Character development in IBO is where I found the series to fall flat. I really never understood or believed the rationality behind some of the main characters motivations - particularly Mikazuki. While there is an announced season 2 on its way where their background may be expanded upon - until then I found their lack of backstory to be a glaring issue as I never felt connected to anyone except for Orga.\\n\\n\r\n{Enjoyment} - As I mentioned earlier, the series never had a dull moment. Even the slower paced episodes had interesting and important elements that kept the story flowing and keeping the viewers interest. As long as you're into the mecha genre, you'll be entertained the whole way.\\n\\n\r\n{Overall} - Overall I gave IBO an 8/10. The overarching story and subject matter was excellent and would have earned a solid 9/10 if not for a severe lack of character development and background information. Hopefully this will be remedied in the upcoming season 2 in the Fall of 2016! The series is definitely worth watching and my favorite Gundam series since Seed.",
            "date": "2016-05-10T21:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 218338,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5325623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kyantoweru",
                "username": "Kyantoweru"
            },
            "url": "https://myanimelist.net/reviews.php?id=218338"
        },
        {
            "content": "They misspell tomato on the wall of the cafeteria in episode 18. There, I saved you from watching the series.... kidding.\r\nThis series seems to annoy hardcore Gundam fans, so if you are one of those people... don't watch Iron-Blooded Orphans. But if you just enjoy the mech genre in general, this series could be right up your alley. Spoiler-free below.\r\nStory - 7\r\nWith less politics and more focus on the conditions of people (namely people oppressed by Gjallarhorn, people from different planets, people without a planet) Iron-Blooded Orphans is pretty tame compared to other Gundam shows, but still has good fight sequences and a decent storyline. They convey some darker themes, bloody action, and sadly some slice of life (filler is filler regardless of the show) but not enough to turn me away at any particular episode.\\n\\n\r\nArt - 7\\n\r\nI'm not too sold on the animation, as it seems to be a big soft and childish, but it's by no means poorly done. I'm a fan of everything being hand drawn.\\n\\n\r\nSound - 8\\n\r\nGood sound tracks, decent FX, and enjoyable VA.\\n\\n\r\nCharacter - 6\\n\r\nThey have a pretty big cast, but only 4-6 of them are important in each episode. Development is lacking, but considering they are mostly children who were former slaves I can't really be too hard since they all have a similar backstory. They could use more diversity here and the use of backstory/flashbacks would have helped fill out the main characters better. They do however have some nice character growth for a few of the cast. Unfortunately, there are usually character deaths in fighting/war anime so be prepared for the possibility of losing a character you like.\\n\\n\r\nEnjoyment - 8\\n\r\nWhen you put the simple story, next to a giant robot; then add some action and a few plot twists here and there it makes for an easy watch. You don't have to think too much to enjoy this and IMO the lack of too many overbearing themes (religion, convoluted politics, culture saturation) makes this a good starter show for people who want to get into mech anime.\\n\\n\r\nOverall - 8\\n\r\nA score of 8 is what MAL says is \"very good\" which is how I would describe this show. It's not a masterpiece and not mediocre, so its got to be somewhere in between. Also, give the show a few episodes and make your own decisions, I know I'd have missed out on several anime if I had only watched the first few episodes.",
            "date": "2016-04-02T20:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 215274,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365387.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheBax",
                "username": "TheBax"
            },
            "url": "https://myanimelist.net/reviews.php?id=215274"
        },
        {
            "content": "SPOILER WARNING!!!!\r\nThis is will be my first sh*tty review, so If you don't like it, don't READ IT. Thank You.\r\nWatched All episodes of Gundam IBO, and... I'm disappointed of this. That ending... Isn't even an ending @-@\r\nThe only good parts of this anime is their mechs and their fights, and Badass Mikazuki \"Killer Machine\" Augus. The plot of first part was better than the second one, honestly. McGillis and Gaelio relationship are only the best point out there.\r\nThe bad parts is the charas design that really weird and more akin to AGE rejected designs than 00, too much \"QUALITY\" animations and terrible pacing (3-4 episodesonly sleeper talking without actions). I think Okada isn't the writer that anyone hopes to be and she ruined everything on second half. Characterization error can be seen at last episodes (24-25) and it's really terrible.\\n\\n\r\nAt least their music is decent. The OP 1 music is very great anyway\\n\\n\r\nBut... It's just an reverse \"engineered\" ripoff of Aldnoah.Zero...\\n\\n\r\nAt least its still slightly better than AGE and G-Wrecko shit. I considering to watch 2nd season or not.\\n\\n\r\nBut still, my fav Gundam series is SEED (but Destiny is just decent for me but still my fav), 00, Unicorn, and Build Fighters (Minus Try-ain Wreck).\\n\\n\r\nI give this show 6/10 for me.\\n\\n\r\nAnd that's my opinion about the IBO, feel agree or disagree anyway...",
            "date": "2016-04-04T22:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 215548,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957306.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SaltyShoebill",
                "username": "SaltyShoebill"
            },
            "url": "https://myanimelist.net/reviews.php?id=215548"
        },
        {
            "content": "Mobile Suit Gundam: Iron-Blooded Orphans is a series that is obviously trying to do something \"new\" with the often predictable story of Gundam-genre shows.  To this end, it succeeds in some places and fails in others.  It is a ponderous, often slow-moving character-focused anime that actually does not focus very much on mobile suits at all.\r\nSet in an alternate universe not explored before in Gundam, IBO follows a group of rebellious \"space rats\", children who are essentially corporate slaves, as they overthrow their corporate masters and work to establish an independent economic sphere on Mars.\r\nI say that IBO is attempting to do somethingnew because it breaks away, or at least attempts to, from many of the cliches of the Gundam genre.  There are space colonies, but they are not the focus.  The story is focused mostly on the pilots of the mobile suits, rather than the suits themselves.  A lot of time is devoted to character development.  The mobile suits use conventional ballistic and steel weapons, rather than lasers, charged particle beams, and beam sabers.\\n\\n\r\nWhere it fails, however, it does so spectacularly.  There is a \"Char\" character here, and even a companion character with purple hair ala Garma.  There is also a wunderkind almost superhuman child protagonist who is never really given any reason for his abilities.  Also, a conflict between the rich on Earth and the oppressed in space is very much in line with traditional Gundam tropes.  The mobile suits themselves also rely very heavily on deus ex type technology reminiscent of Minovsky Particles from the UC universe.  There is also a Relena Peacecraft-esque character.\\n\\n\r\nThe story itself feels like someone took Gundam SEED and smashed it together with Gundam Wing.  If the art weren't so good, I'd think I was watching an over-the-top melodrama anime from the late 90s or early 2000s.  The series' focus on overt displays of masculinity is also an odd choice.  This appears to be a universe where strong females only exist to be dominated by the men around them.  All the females who start out strong are reduced to weepy whiny babies by the end of the show, whereas all the weak men become super buff macho characters.  In many ways, this show almost feels like a harem anime with all the traditional harem roles filled by other men instead of women.\\n\\n\r\nThe series also does a relatively good job of world building--that is, setting the stage for the characters and action of the story, without being too nebulous like Gundam AGE tended to be.\\n\\n\r\nOverall, as an alternative series to the traditional UC setting of Gundam, IBO is worth a watch.  I actually hope they develop the world more with future series and OVAs because it feels like there is much more storytelling to be done here.",
            "date": "2016-06-02T15:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 219861,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AH1cm",
                "username": "AH1cm"
            },
            "url": "https://myanimelist.net/reviews.php?id=219861"
        },
        {
            "content": "Iron-Blooded Orphans is my second entry into the Gundam Universe whereby the first one was Build Fighters. Taking it as a story on its own as I do not know about previous Gundams, this story is AMAZING. It makes utter sense when looking at it from a reality perspective. The characters are quite well developed despite sometimes the story, in general, has some shortcomings. The art varies from high detailed to low details in a very nice way that makes it look cute and accurate at different points.\r\nWhy I enjoyed this Anime so much? If you never watched Gundam before but knows a bit aboutthe flashy swords and beams and think that those are too extravagant, this is for you. This Gundam story is not only about mechs, it's about much more than that and the mechs just brings that final touch to it that makes it perfect. As I mentioned above, compared to previous Gundams, this series, moves from a fantasy mech level to a more sci-fi mech level, so you have this sense that there is no wrongness in terms of combats and physical maneuvers even for weaponry and everything associated. \\n\\n\r\nLastly, the story contains everything in terms of feelings, rage, sadness, happiness, it's a good blend that will make the experience thoroughly enjoyable from episode 1 to episode 25.\\n\\n\r\nDefinitely something to watch!\\n\\n\\n",
            "date": "2017-01-31T19:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 239613,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2940751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RoughVoice",
                "username": "RoughVoice"
            },
            "url": "https://myanimelist.net/reviews.php?id=239613"
        },
        {
            "content": "(This review only covers the first season)\r\n\"Teenagers piloting giant robots\"\r\nIf you'd try to sum up the Gundam-francise in one sentence then this one would suffice for most of its series. Children in giant Mobile Suits, forced into becoming soldiers and being thrown into war is by no means new, not just for Gundam actually, but also for the mecha-genre in general. In fact almost every Gundam series, starting with the very first one, has done it so far. And the same goes for Iron Blooded Orphans though it emphasizes the topic more than the others did before.\r\nThe abuse of children by adults, the loss ofchildhood and the fight for survival are the central themes as the series follows a group of child soldiers who try to build a future for themselves. Starting out as mercenaries, they are thrown into a conflict they don't really understand in the beginning and struggle to stay alive along the way.\\n\\n\r\nThe story itself isn't too complex and also not as serious as it may sound at first. Which is quite a shame really, the potential is definitely there. Though there are some twist and turns along the way the plot is mostly by the book and there aren't many real surprises. All in all, story-wise Iron Blooded Orphans is mostly unexceptional. \\n\\n\r\nIn the long line of Gundam protagonists, the main character Mikazuki belongs to the emotionless kind (like Heero from Wing or Setsuna from 00); meaning he has the same expression in pretty much every situation. Throughout the series he shows hardly any sympathy or remorse and kills all of his opponents without mercy. It makes sense from the point of view of him being a person that only knew war ever since he was a child, but his constant indifference makes it hard to relate to him. He simply kills whoever his leader Orga orders him to and follows the principle of crushing anyone in his way without a second thought; something he manages because his Gundam is seriously overpowered.\\n\\n\r\nDifferent to Mikazuki, Orga, leader of the group of child soldiers, and Kudelia, a prestigious girl who tries to negotiate for the economical independence of Mars, struggle with responsibility and doubts. They act in a relatively predictable manner throughout the series and therefore aren't particularly complex or interesting. The same goes for most of their comrades who usually have one character trait which is constantly repeated. It also doesn't help that they have very little impact in the actual fights since Mikazuki wins most of them completely on his own. \\n\\n\r\nAs for the villains, Gjallahorn is this Gundam's equivalent to Zeon of the Universal Century, however they are far less complex and threatening. You don't learn too much about them aside from the fact that they are corrupt. The series establishes them as a resourceful, world - and space-dominating organisation, yet they are shown as incredibly incompetent. Example: their objective is to find Kudelia at all costs, since she is a threat to their power, but most of Gjallarhorns soldiers have no idea what she looks like. In an age where space travel and giant robots are the norm it is not possible for them to spread the picture of the girl they desperately want to stop. \\n\\n\r\nAs far as Gjallarhorns most important members go, McGillis, who manipulates both sides for his own gain, is surprisingly pale in the impact he leaves (though this may change in season two). His best friend Gaelio is probably the character who develops the most, as he slowly begins to question the circumstances around him and is confronted with loss and difficult decisions. To me he was the most likable and well-rounded character of the show. \\n\\n\r\nAnimation-wise Iron Blooded Orphans is quite good, particularly the mecha-fights are usually a highlight, since they are great in their detail and dynamic. Plus most of the mechas have cool and sleek designs that look sharp across the board. The character designs are a mixed bag; some are great others not so much. At some points CG-animation is used, which isn't pretty, but it could have been much worse. \\n\\n\r\nThe soundtrack is excellent, one of the best parts of the show by a mile. A lot of the tracks are memorable and definitely contribute to the atmosphere of certain scenes. \\n\\n\r\nSo what's my final verdict? Iron Blooded Orphans could have been better: better in the way it treats the problems it wants to address, better when it comes to the complexity of the politics in the world it tries to build, better in the exploration of the themes it wants to discuss. \\n\\n\r\nIt is not like it doesn't try, there are casualties on both sides, people get injured and scarred for life, the stakes are high and yet it is too simple, too superficial and too far away from coming close to giving the viewer a somewhat realistic impression of war and its cruelties. With that it feels half-baked and not forceful enough to truly be great, resulting in a series slightly above average thanks to its well animated fights and great soundtrack.",
            "date": "2018-12-24T16:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 296740,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5689582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tisarana",
                "username": "Tisarana"
            },
            "url": "https://myanimelist.net/reviews.php?id=296740"
        }
    ],
    [
        {
            "content": "For a Gundam fan I don't watch enough if I'm honest. I've watched Gundam wing and Gundam OO and now this. One thing that stays the same besides the plot lines is my enjoyment. So if you're not a Gundam fan, I can't say how helpful this review will be. Anyways, let get to the nitty and gritty.\r\nI would say it was one of the more generic Gundam series. It was nothing special in terms of character development but I felt I matured with these kids. I watched over them as they navigated a harsh world with naivety, determination and tough skin. So even ifthey were one dimensional, they grew on me to the point a certain death, hit me harder than expected.\\n\\n\r\nThe story itself started rather basic but the second half became a world wind of complex plotlines intersecting each other. The politics really picked up while at the same time leaving too many questions for my liking. For a Gundam series, the politics was really light. Same with the combat unfortunately. The fight scenes were nothing to write home about until the last few episodes. But boy, it was worth the wait.\\n\\n\r\nI can't emphasise enough the intensity the last 5 episodes delivered and also the foundations for a second season, it has laid out. The stage has been set and I have enjoyed this enough to be excited for round 2. I felt this season built up a new Gundam storyline from the ground up and it will be worth as we keep watching. I would recommend it for newcomers and old fans equally even if I have some criticisms.",
            "date": "2016-04-02T13:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 215232,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5172188.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/abovetheveil",
                "username": "abovetheveil"
            },
            "url": "https://myanimelist.net/reviews.php?id=215232"
        },
        {
            "content": "After Aldnoah, i have searched for something in similar and i found this, i'm not a huge fan of Mecha anime but after watching 2-3 of them i can't stop myself to seek more of robots. I guess my inner kid is resurfacing again. its kinda good to remember the good old days where i watched gundam and transformers as a kid. It's quite reminiscing and nostalgic.\r\nAs for the story, well ahem! A naive rich girl wants to free her home planet from the grasps of the economic blocks from earth, but, that's the least of her problem being the head of the mars revolutionshe is being targeted by Gjallarhorn (a very corrupt military branch from earth that reaches its reach to mars). In order for her plans to work she must go to earth safely and talk to the prime ministers, and so he hired a private army full of child militants and so happens with luck on her side she stumbles upon a relic from the past, it's a 300 year old Gundam. So far so good aint it? Well this is probably one of the best mecha anime i have ever seen in my entire life! It was well thought and very well put as expected from an action packed mecha anime. Although you may think senseless deaths all around but its actually not and there's a good reason for it, their deaths are not invain, it was a beautiful and honorable death. Enough talk, don't wanna spoil it. So well i guess you have to find out more then. 10/10\\n\\n\r\nAs for the art: well it was decent enough for me to keep watching, although sometimes it's out of proportion, but nah, all i care about is a good story and some ass kicking action scenes thrown in with a little bit of romance! Yep you heard me there is romance! It's the reason i came for. XD 8/10\\n\\n\r\nAs for the Sound: well doesn't quite interest me at all, but i like music so its decent, but not catchy. 7/10\\n\\n\r\nCharacters: hohoho they are amazing! All of them! That's all! just check it out you'll be amazed at the different personalities of each one of them especially the main character, he looks badass being small and all but his personality is the most BADASS of all. The perfect protagonist for a mecha/action anime nothing beats him. 10/10\\n\\n\r\nEnjoyment: yes ofcourse i enjoy every last one of it, for Godsakes i've enjoyed so much i binged it till the end. 10/10\\n\\n\r\nOverall it's a 9/10 that sums it all up. I'm off to the 2nd season! And i heard its even better. Happy conquest everyone XD\\n\\n",
            "date": "2018-07-01T08:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 282697,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6760269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Wasakanene",
                "username": "Wasakanene"
            },
            "url": "https://myanimelist.net/reviews.php?id=282697"
        },
        {
            "content": "Brawniness men, female protagonist who leads the revolution army, conspiracies within the enemy, this equation makes a good story and a lot of necessary deaths. The story moves fast so expect surprises and not drag out.\r\nThe intros and eds fit perfectly and sometimes it'll play into the ending song. I don't think I skipped the ending too many times because the song was really good and how dramatic it was when it ends an episode. The episodes felt a bit longer and fulfilling than normal due to that.\r\nIf you enjoy a good plot, a journey 'til the very end for a cause, romance, you'll likethis anime. The mechs are a bonus.\\n\\n\r\n9/10 it's great!",
            "date": "2016-04-03T00:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 215300,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/squier9up",
                "username": "squier9up"
            },
            "url": "https://myanimelist.net/reviews.php?id=215300"
        },
        {
            "content": "This is my first dive into the GUNDAM series, this was a fun excursion, the story moved me from one episode to the next, it is a sweet flow of combat meshing with hard hitting narrative flowing to an excellent climax.\r\nI liked this series in particular as it appeared to be a diversion from the presumed norm of this franchise, staring orphans among most things, like an elder scrolls game, you see the world you are introduced in at the angle of the down trodden and low. \r\nA wonderful journey from the bottom to a place they belong, you'd be surprised what the right fluecan do to a group of otherwise strangers united by the same upbringing, the idea of \"human debris\" a presumed euphemism for a much more darker word, you could even call it a stain on human history. These individuals are driven for one common cause.\\n\\n\r\nThe love they had for there comrades in arms, the way there bonds stretched across countless battlefields, onto a near boundless sea of stars, painted hot, with the burning flowers that bloom the many havens ( I liked that bullets that hit and looked like fire flowers).\\n\\n\r\nIn closing it was the bonds that bind between this rag tag group of people that extended past the no-tangible embodied made tangible in iron-body-machinery, GUMDAMS are cool.\\n\\n\r\nSuperb, brilliant, wonderful.\\n\\n\r\nbravo. \\n",
            "date": "2018-03-21T14:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 274472,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3803865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TrueNeo",
                "username": "TrueNeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=274472"
        },
        {
            "content": "I'm a huge fan of mecha series and even more of Gundam Series. I was disapointed of the last one they've done. So I had doubt about this one but IT WAS GREAT. They didn't do like the last one and accelerate thing so it can enter into a 25 episode series. They had let thing go and everything was in place. The annonce of a season 2 proove that there are still thing they didn't tell us about the story,caracter, mecha, etc. If you wish for a good Mecha series watch it till the end. The only downside of this is, maybe, the factthat all main caracter are kids but you can go beyond that with the extremly good story.",
            "date": "2016-03-29T03:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 214649,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1444455.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sercale",
                "username": "Sercale"
            },
            "url": "https://myanimelist.net/reviews.php?id=214649"
        },
        {
            "content": "Right. I really didn't want to write a review, [I've finished season 2 btw] until I saw some 3 rating here in MAL. A thought dawned to me that, they must have too many first-world problems because they've got luxurious comfort zones.\r\nBecause it's like this:\r\nUp until Daniel Craig, James Bond(s) have to be suave, and commandeering, caresses women, full of spy-gadgets like laser Omega watches, and that submersible Lotus Esprit in The Spy Who Loved Me.\r\nThen Daniel Craig's Bond came along, and the idea of Commander Bond being witty, calculating, sly, sexual, a gambler, all that, well, he got his balls whipped.\r\n\"No Mr. Bond, Iexpect you to cry,\" Bond's villain sneered.\\n\\n\r\nMobile Suit Gundam: Iron-Blooded Orphans works like that.\\n\r\nIts ball-wrenching, murderous, vengeful, self-destructing intent shatters comfort zones since 2015.\\n\\n\r\nIf you're a \"Gundam fan\" who sees Gundams full of lasers and overpowerful, moves like a mosquito, with armors thicker than French goat cheese, and you expect the enemies to be the numerous usual baddies who got shot or slashed, of course you'll see Iron-Blooded as off. \\n\r\nBut, that'd be like you have to be the sort of person who'd be hating Daniel Craig's Bond because he has no explosive pens.\\n\\n\\n\r\nSTORY - 8\\n\r\nIt isn't particularly impressive for Iron-Blooded Orphans, so I won't discuss that much. But it is devious, and brilliantly executed to deviate from the \"normal powerful Gundam\" we know.\\n\r\nTo understand it even, when you say \"Gundam\", it actually means the Universal Century timeline kind of Gundams: the RX-78-2, the Z-, the ZZ-, the RX-93, these kinda.\\n\r\nThe \"other\" Gundams, like: the Shining, Wing, Strike, Exia, Barbatos, they're the \"spin-offs\", made to create \"nth-versions\" of the franchise. Hence, Iron-Blooded can create its \"own version\", correct? Right.\\n\\n\r\nThe themes have to be the same to make it Gundam-ish, ofc: politics and war, showing the human nature both complex and twisted characters who either participated the war or got involved, as well as these overpowerful \"real robots\" that could shoot a hundred mobile suits in a strike.\\n\\n\r\nIn Iron-Blooded, it's just metal-to-metal, no lasers, no frills thing of relic (according to story) that has difficulty finishing each enemy. No one gets erased by a laser that can fill your TV screens here, or raining plasma shots. They have to be crunched, gutted, and die horribly, no exemptions on any character.\\n\\n\\n\r\nART = 10\\n\r\nI always score most anime as 10, anyway.\\n\\n\\n\r\nSOUND = 7\\n\r\nSeiyuus are awesome, with Takahiro Sakurai, and Squid Gi--I mean, Hisako Kanemoto around, yeah.\\n\\n\\n\r\nCHARACTER = 8\\n\r\nThere are people who'd argue that Mikazuki is a flat character or didn't change throughout. And that's the thing, because \"protagonists\" need to change, need to be dynamic and such. And that's good, if you're actually making a \"hero\" type of protagonist, because the \"plot\" is his/her journey, he/she needs to develop it, one way or the other.\\n\r\nBut let's say you're not into making \"hero characters\", you're a lot more creative than that. Like if you're the writer of Iron-Blooded, why follow some Lit101 lessons, when you have a darker idea in mind, right?  \\n\r\nCommander Bond didn't \"develop\" from being a weaboo-spy nerd to an actual spy, you know. Protagonists, as well as deuteragonists, or any other characters types, that are complex can be, well, complex---that is, if you know what you're doing. Don't try writing something like a sparklepire.\\n\\n\r\nIron-Blooded had been as character-driven to begin with, anyway. It wasn't that Gjallarhorn just attacked them because they were planting corn in Mars, scene C happened because the characters chose scene A over scene B. Basically it's just that, and harbor a ton of characters that inherently still has as what Bandai/Sunrise is known for with their Gundam series, the thing called \"human nature\" that makes legitimacy of Iron-Blooded to bear the \"Gundam\" recognition on its own. \\n\r\nForget the lasers, real lasers actually are invisible and US Army are already experimenting them even.\\n\\n\\n\r\nENJOYMENT = 10\\n\r\nThat is, if you're NOT someone who wears their comfort shells.\\n\\n\\n\r\nOVERALL = 9\\n\r\nMobile Suit Gundam: Iron-Blooded Orphans is a bizarre masterpiece.\\n\r\nIt's like the wicked sheep of the family of Gundam series, the Daniel Craig Bond, the Hennessey Venom GT of supercars, the death metal of music genres, and unless you can get past the thought that Gundams doesn't always have to be ridiculously unbeatable, you'll see its dark-lit side of things.\\n\\n\r\nBut if you're still stuck with your comfort zone, then consider trashing this show, because it can damage and implode your comfort zones so bad.\\n\\n\\n\r\nVERDICT: a masterpiece that is not for uber-laser-powerful Gundam fans.",
            "date": "2017-08-17T19:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 255701,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=255701"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nRoses are red. Violets are blue. Mobile Suit Gundam: Iron-Blooded Orphans makes for a pretty flower, too.\r\nSTORY\r\nIron-Blooded Orphans (reduced to this title because it’s cool as all get out) centers on a large group of kids who, for one reason or another, have found themselves ditched by society. As they get mistreated at the hands of the higher-ups, Kudelia, the famous leader of the recent Martian civil-rights movement, arrives at their base, shaking up events on an interplanetary scale.\r\nFrom the very beginning, the anime follows this ragtag group of children as they deal with twofronts simultaneously: societal investigation and futuristic warfare.\\n\\n\r\nOn the societal side, Tekkadan (the new name of their group) highlights the difficulties that people in their position endure. They are treated as worthless when they are abandoned to act as a decoy. They are seen as monsters when others catch a glimpse of the Alaya-Vijnana on their backs. They are given no remorse by the government or those in power.\\n\\n\r\nIt’s not just them, either. The everyday people of Mars are on the verge of economic collapse caused by foreign (planet) affairs, and hard-pressed laborers are forced to take drastic measures as their living conditions and wages reach all-time lows.\\n\\n\r\nGranted, the juxtaposition between the elite and the dirt can be a teeny tiny bit heavy-handed at times. Literally having a “Human Debris” designation for some of the cast members makes this statement more than arguable.\\n\\n\r\nNevertheless, Iron-Blooded Orphans sticks to its (robot) guns, bolstering one of its most prominent themes: the little guy can defeat the big guy. Kudelia’s pleas to the government as well as the people allows each to come to agreements that protect those on Mars and those on Earth. And Tekkadan traverses across the solar system, completing their mission despite the immense troubles that plagued their path.\\n\\n\r\nSimultaneously, the anime incorporates its familial theme. Again, it’s hard to miss in regards to Tekkadan. They live together. They go to “school” together. They fight for each other together. They are orphans, most not bound by blood, but that makes them no less a family. Because family is not defined by something so scientific as genetics. It’s defined by the feelings, the thoughts, the connections held between them.\\n\\n\r\nOnce more, it’s not just them that focus on the familial. Naze’s harem, while unconventional, is a family for him and the other women. On a broader scale, the labor union is a family. And, on an even broader scale, the unfortunate people of Mars are a family, too.\\n\\n\r\nThe magic is when this and the previous theme are harmonized. I.e., according to Iron-Blooded Orphans, in order for the little guy to defeat the big guy, family is required. Tekkadan sacrifice themselves for their brothers. The labor union reach a peaceful agreement. The people of Earth vote to save the people of Mars.\\n\\n\r\nAgain, they aren’t the families people normally think of, and it’s not literally “family wins the day.” Instead, the anime’s mindset that family is what one makes of it, that family makes the impossible possible, ties together its political issues with the themes it touts.\\n\\n\r\nThis familial theme is indirectly related to one of the show’s bigger problems. Namely, not letting background information sink in long enough. On two obtuse occasions, the anime, for some reason, decides it well within reason to immediately and conveniently follow-up on previously unknown information: Akihiro’s younger brother and Biscuit’s older brother.\\n\\n\r\nDisregarding the fact that they both deal with a long-lost brother (which is already iffy), the anime drops this information followed immediately with using it. Build-up is traded in favor of at-the-ready drama, leading to said drama falling flat.\\n\\n\r\nTo be fair, it can handle such narrative points with grace. Fumitan’s conflicting actions and Mikazuki’s bracelet he received from Atra come to mind. Meaning not every example reeks of poor execution.\\n\\n\r\nThis all still leaves the other side of the anime: Mobile Suit battles. This show derives from the Gundam series, after all, so it wouldn’t do to ignore what amounts to about half of the season and one of the main draws of the series.\\n\\n\r\nSurprisingly, despite the blackness of space, the anime does well in differentiating the fights that ensue. One takes place within a cluttered asteroid field, impairing vision and creating obstacles. One involves the group careening their ship into an orbital station. One occurs on two fronts – on a guarded bridge and on a deserted field.\\n\\n\r\nBut Iron-Blooded Orphans’ greatest achievement with its battles comes from incorporating the “space-rat” motif. Many of the fights are uncouth. Mikazuki ignores the formal duel offer, choosing to strike first instead. The boys use an extra ship to shield themselves from oncoming fire. And they purposefully narrowly miss crashing into an enemy ship to plant infiltrators. Tekkadan is treated as dirty, so they play dirty in retaliation.\\n\\n\r\nNot all of the fights are peachy, though. Ein always protecting Gaelio, and perhaps one-too-many just-in-the-nick-of-time saves, turns the fights from thrilling experiences into repetitive altercations. Plus, the anime shies away from killing off more of its characters – especially when it appears that will happen (e.g., when “new” Ein takes out Shino’s, Lafter’s, and Azee’s Mobile Suits).\\n\\n\r\nAltogether, the narrative is, much like what its title touts, a mixed offering.\\n\\n\r\nANIMATION\\n\\n\r\nDespite the space setting of Iron-Blooded Orphans, its art and animation remain relatively in strong standing.\\n\\n\r\nEspecially when considering the contrasts. Mars is a barren, reddened wasteland where mountains reign and sand occupies. The various spaceships – with their metallic, compartmentalized layout – add a sense of structure and familiarity; a home away from home. Earth’s greens and blues and yellows make it into an ideal, a goal worth fighting for.\\n\\n\r\nPlaying devil’s advocate, these separate locations are not awe-inspiring. Mars is just mountains. The spaceships are just hallways. Earth is just trees. But, again, when looked at together, they tell a story all their own.\\n\\n\r\nActual animation sits somewhere around average. While the various robot battles (and there are quite a few of them) see much in the way of clashing, dodging, and destroying, downtime does not have the same level of movement. Understandably, characters are often found standing around the ship or sitting at cafeteria tables.\\n\\n\r\nThe character designs are likewise mixed in their execution. Some of the enemies, such as Kudal and Brooke, while detailed and symbolic in their looks (the former is dressed in green with a snake tongue, and the latter is pudgy with a pig nose), they are a bit too animalistic when compared to the grounded, more realistic designs of the other characters.\\n\\n\r\nOrga’s design is silly, too. His faded-purple hair, with its one blade that slices across his face, is almost cartoonish.\\n\\n\r\nBut the other characters’ designs are cared for. Kudelia’s long blonde hair, purple eyes, and red, frilly dress give her an air of both beauty and royalty – perfect for the savior princess. Mikazuki’s short stature and seemingly weak build makes his commanding of the Gundam all the more impressive. And the stark contrast between the regal outfits of the soldiers of Gjallarhorn and the ragtag coats of Tekkadan adds more to the little-guy-versus-big-guy motif.\\n\\n\r\nNo matter which design is investigated, the crisp lines, sharp eyes, and various minor details (buttons, necklaces, etc.) add even more flair.\\n\\n\r\n(As a side note, some of the cast members love to close just one of their eyes. Especially Orga. He should really see an eye doctor about that….)\\n\\n\r\nThe various robot designs also deserve an inspection. In short, they reflect the disposition of the characters themselves. Fareed’s uses two swords and stands in a classy manner, coinciding with his finesse. Lafter’s is quick and energetic just like her personality. Akihiro’s uses a shield as an homage to the one person he failed to protect.\\n\\n\r\nPerhaps obviously, Mikazuki’s Gundam is particularly intriguing. Barbatos’s mainly white, multicolored frame not only helps to make it stand out among the blackness of space, but also it symbolizes the purity of Tekkadan’s mission and the colorful life in which they wish to lead.\\n\\n\r\nCHARACTERS\\n\\n\r\nOne of the more surprising parts to Iron-Blooded Orphans is its characters.\\n\\n\r\nMore specifically, the anime actually does a nice job of cycling through its huge cast. Yes, certain characters do garner more attention than others – Kudelia, Mikazuki, and so on. And rightly so. They are, after all, the main protagonists. But that doesn’t take away from the apparent development of the side characters.\\n\\n\r\nThe most surprising comes from Shino. During Tekkadan’s run to save Akihiro’s younger brother and fend off the encroaching pirates, Shino leads a team of men aboard the enemy ship. Unfortunately, many lives are lost. Shino blames himself for their deaths, believing that he “wasn’t good enough” to save them.\\n\\n\r\nAs a result, he chooses to pilot one of the extra Mobile Suits. This decision not only gives him the opportunity to “make amends” for “failing” to protect his family, but also it pushes him away from leading others because he feels that he is better suited being responsible for him and him alone.\\n\\n\r\nThis small focus on the side characters happens all over.\\n\\n\r\nFumitan hated Kudelia’s naïveté, going so far as to double-cross her despite the time and relationship they had built together. But she sacrifices herself for the girl whose sincere wish would aid the people of the solar system.\\n\\n\r\nBiscuit regularly objected to Orga’s dangerous decisions. He argued that, given their situation, a more rationale, more safe, solution could potentially be found and pursued. Their feud apexes when Biscuit declares he will be leaving Tekkadan. He later perishes during battle, and, later still, Orga learns that Biscuit decided against his initial decision because he knew that this goal was one they fought for and shared together.\\n\\n\r\nEugene usually seems hesitant to join in on the action but reluctantly does so anyway. However, he is regularly given second-in-command duty and control of the ship presumably because nobody else can handle the position. Indeed, when he does take the reins, he proves his capabilities as a commander.\\n\\n\r\nThe main cast is different. Although not always in a positive nature.\\n\\n\r\nMikazuki is most notable as a negative. He has two prerogatives: follow Orga’s orders and kill. As such, he is resolute, remorseless in his dealings with others. The anime makes it a point to point out (somewhat heavy-handedly) that he enjoys killing, but that doesn’t seem to affect him much. In fact, the beginning of his character shows him not flinching from murdering another.\\n\\n\r\nIn other words, Mikazuki’s only role is to man the Gundam Barbatos. Unfortunately, that also means he’s not much of a character since he simply walks around without expressing emotion and acting generally uninteresting. The total result makes him arguably the worst character in Iron-Blooded Orphans.\\n\\n\r\nOrga is nowhere near as lame as Mikazuki. Orga is the leader, the one that almost everybody (especially Mikazuki) looks up to. So he acts accordingly. He takes the abuse instead of his family. He remains tough in front of the younger children. He shoulders the burden of the harder choices that Tekkadan has to make.\\n\\n\r\nSo it makes sense that his character develops, or at least is influenced, by the other characters that surround him. Naze represents the leader he wants to be: calm, determined, and steadfast. Merribit challenges the “child” within him. Biscuit makes him question whether or not the path they have chosen really is the right one.\\n\\n\r\nNow, both Mikazuki and Orga have a history together, a backstory. Yet it goes unexplored. To be fair, a second season awaits, so presumably the show will set aside time to flesh out them and their relationship some more. Meaning, for now, some leniency is acceptable for this close duo.\\n\\n\r\nTwo important characters, the best that this first season of Iron-Blooded Orphans has offer, remain: Kudelia and Fareed.\\n\\n\r\nKudelia is arguably the strongest character in the anime (either her or Fareed). Growing up, she never fully understood the conditions that the majority of people were living in on Mars. Her candy-giving scene demonstrates just how out of touch she was with reality.\\n\\n\r\nGranted, she was just a kid. But her being “just a kid” continues into the present where, despite fighting for and spearheading the Martian revolution, she still has yet to truly experience what the common person goes through.\\n\\n\r\nHer time with Tekkadan opens her eyes. Mikazuki sees her as selfish. She witnesses the brutality of war. The various sacrifices, outcomes, and problems that the kids have to constantly put up with. Her journey from Mars to Earth is something she has never experienced.\\n\\n\r\nAll the while, she feels useless. And, to some extent, she is. She cannot man the Mobile suits or help with the supplies or fight on the ground. So she does what she can. From cleaning dishes to delivering the kids their lunches, she tries to make herself useful.\\n\\n\r\nIt’s not enough, though. At least, not enough to Kudelia. She understands that she is a symbol of hope. A person capable of solving the issues on Mars and elsewhere.\\n\\n\r\nThus, she does what only she can do: speak. She uses her voice to instill compassion. Morality. Hope. The speeches she gives and the words she uses do not topple Mobile Suits, but, when all is said and done, it’s clear that her voice is powerful enough to move planets.\\n\\n\r\nFareed also stands above the other cast members. Grabbing the front of his hair when thinking, he is a tactical, deliberate man. He’s meant to be engaged to Gaelio’s younger (much younger) sister, he is the “son” of Gjallarhorn’s top dog, and he commands a fleet all his own.\\n\\n\r\nInitially, Fareed appears to be just another bad guy. But as the story unfolds, it becomes quite clear that he has greater ambitions in mind. Throughout the season, the audience sees him acting gentlemanly towards both his bride-to-be and the friends he has grown up with. Yet, and more importantly, he detests Gjallarhorn’s corruption.\\n\\n\r\nHis allegiance gets called into question when he chooses to support Tekkadan, giving them the means to make it to Earth’s surface. Seemingly, he wants Kudelia to succeed.\\n\\n\r\nAnd by the end, Fareed’s sinister ploy comes to fruition. He coerced Gaelio to integrate Ein, the subordinate looking to avenge his mentor Crank, not to save the boy but to use him as a means to slander his father-in-power. He married Gaelio’s younger sister to obtain more connections. He abandoned Carta to get her out of the picture. All in an effort to take over Gjallarhorn and change it from within, making him quite the strong main antagonist.\\n\\n\r\nSadly, and again, the show’s improper backstory handling causes Fareed to be not as strong character-wise as he could have ultimately been. While his childhood is briefly shown, it’s not enough to get a clear grasp on the hatred he holds towards his father as well as the stinging betrayal he commits towards both Gaelio and Carta.\\n\\n\r\nSOUND\\n\\n\r\nIron-Blooded Orphans makes the all-too-common mistake of replacing its killer opening and ending tracks in favor of ones that are much less appealing.\\n\\n\r\nThe first OP is adrenaline-pumping, catchy, and fun. Shouting “Raise your flag!” and trying to sing along with the Japanese lyrics may seem silly to anyone listening, but it’s difficult to ignore the vocalist’s charge and the charging tune. The second OP, in comparison, does have some strong guitar playing, but the piece doesn’t come together as naturally, as flavorful as its previous iteration.\\n\\n\r\nThe ED’s are quite similar. Arguably speaking, the first ED is the strongest track out of the four. The docile singer’s voice, the blues accompaniment, and the grandiose tone it adopts fits both the spacefaring group and the majestic nature of the Gundam and their mission. The second ED is a big step down. While the vocalist certainly has range, the combination of the instruments, beat, and sudden drop-off in the track itself do not hold the same level of intricacy as before.\\n\\n\r\nListening to the rest of the original soundtrack, it follows (thankfully) in the footsteps of the first OP and ED, consisting of many strong tracks that both fit the anime well and demonstrate care in their arrangements. Some examples follow below.\\n\\n\r\n“Barren Land” feels like the emptiness of space with its repetitive pounding.\\n\\n\r\n“Strengths Focus” combines acoustic guitar and xylophones to create a quick fervor.\\n\\n\r\n“Lady Kudelia” uses piano and violins that are soft, delicate in their delivery – a nice fit for the hope-inspiring princess.\\n\\n\r\n“Military Scheme” sounds sinister and foreign in its plotting.\\n\\n\r\nAnd “Fallen Flower” goes ultra-somber as it slows everything down.\\n\\n\r\nAs for voice acting, while everyone involved does more or less a nice job, no notable shout-outs are to be had. At the minimum, the sound-effects for the colliding Mobile Suits, gunshots, and different weapons gave their battles the weight they deserved.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis iteration of Gundam is my first exposure to this universe, and I can happily declare that I am a fan.\\n\\n\r\nI liked how Mikazuki always wrecked the competition (even if his character was weak). I could always depend on him to use his spear, clamp, and katana to eviscerate the enemy. His friends, from Masahiro to Lafter, brought their own fighting flavor, too. Masahiro with his shield and Lafter’s no-arm speed made the various robot skirmishes a lot of fun to watch.\\n\\n\r\nI also appreciated the miniscule nods to romance. Kudelia’s reaction afterwards to being kissed by Mikazuki, as well as Atra liking the possibility of multiple wives a la Naze and his harem, made me smile. I was also rooting for the possible romantic relationship between Orga and Merribit. Orga is a tough yet kind dude who looks older than he is and Merribit is a tough yet kind woman who looks younger than she is. Opposites attract and what-not.\\n\\n\r\nCan’t forget about Fareed; it’s hard to do so regardless. Betraying both the person who raised him and his best friends, all in a cold, logical, and believable manner? He’s a heartless son, friend, and person in general – and it’s awesome.\\n\\n\r\nSome of the drama, like Akihiro’s brother’s death, could tread into strained territory. And many of the villains, like Todo or Kudal, were a bit too lame in my eyes. But that wasn’t enough to stop me from having a lot of fun with this one.\\n\\n\r\nMobile Suit Gundam: Iron-Blooded Orphans raises its flag to victory. While issues such as weird narrative happenings, ignored character backstory, and switching to lesser tracks exist, the story’s connected themes, the large yet focused cast, and the various flourishes in its art and music otherwise create a flower that smells like roses.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, societal and robotic conflicts, alongside themes on the little guy and family, are brought down by slight heavy-handedness, a couple of convenient plot points, and some repetitive, “safe” action\\n\\n\r\nAnimation: Good, nice artistic direction, about average actual animation, and nice character designs\\n\\n\r\nCharacters: Good, while Mikazuki is weak as a character, the focus on the rest of Tekkadan and Orga, as well as the strength in Kudelia and Fareed’s characters, make for an interesting cast\\n\\n\r\nSound: Fine, good first OP, okay second OP, good first ED, bad second ED, good OST, okay VA performances, and good sound-effects\\n\\n\r\nEnjoyment: Good, a fun first venture into this popular universe\\n\\n\r\nFinal Score: 6/10",
            "date": "2017-06-07T15:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 249461,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249461"
        },
        {
            "content": "Story: (10/10)\r\nYes its a mecha anime, no it is not just fighting. MSG: IBO has a clear, meaningful, deep, personal story throughout the entirety of the show, if I could rate the story higher I would. \r\nArt: (8.5/10)\r\nThe art in the show is normally great but there are also times where the backdrop isn't perfect.\r\nSound: (10/10)\r\nIncredible OPs and great voice acting; they really make me connect with the characters\r\nCharacters: (10/10)\r\nThe characters grow with you. They are all unique and even those who are based on a cliche are run with excellently. I would die for even a barely shown minor character, that's how fleshed outthe characters are and yet there aren't random pointless scenarios that make this happen, everything has a purpose in this show.\\n\\n\r\nEnjoyment: (10/10)\\n\r\nLet me make this clear, this was my first mecha anime and I did not expect to like it at all, in fact, the reason I watched the first episode is I accidentally clicked on it once and was too lazy to go out of it, but I digress. What I got out of this show is that no genre of anime is restricting, after all, I assumed this would be a RAH RAH show with pointless fight scenes. Boy, was I wrong! This show easily took a spot on my favorites list and I assure you that it will for you as well.\\n\\n\r\nOverall: (10/10)\\n\r\nI feel that I made my thoughts clear enough above but if I didn't, feel free to leave a comment on my profile or message me for clarification. \\n\\n\r\nPS: while MSG: IBO is a part of the Mobile Suit Gundam franchise, it is not a part of any previously existing Gundam Universe, so you do not need to have watched any of the previous shows to watch MSG: IBO. I know because that's what I did.",
            "date": "2017-05-23T13:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 248371,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6003298.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GuyWRunningShirt",
                "username": "GuyWRunningShirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=248371"
        },
        {
            "content": "Welcome to my first Shitty Review\r\n.\r\nThis anime has me a bit disappointed, I was in for something amazing given how massive the \"Mobile Suit Gundam\" industry is. (Maybe shouldn't have started with this one, that one's on me).\r\nHonestly I found this anime's plot be to very weak , it doesn't draw you in at all or keep you grasping for more. It can be very predictable and cliche at times especially when it comes to the theme on 'family'.\r\nThe aesthetic is alright but the music during fight scenes lacks punch. I feel like this story has alot of potential. All in all the anime is\" O K\" I guess but its not the re-watching type for sure.",
            "date": "2017-05-15T16:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 247760,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5931010.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/crossfirekate",
                "username": "crossfirekate"
            },
            "url": "https://myanimelist.net/reviews.php?id=247760"
        },
        {
            "content": "I haven't watched a Gundam show in a while. And by \"a while\" I mean at least 10 years. I got tired of the repetitive action scenes, cookie-cutter characters, and plots that were just an excuse for conflict. I dismissed new titles with fancy words like \"Unicorn\" and \"F91\" attached to them as essentially Barbie getting a new hat. But, there was something about \"Iron Blooded Orphans\" that just was very compelling. I gave it a watch and I am so glad I did as this is one of the better Anime shows I have watched recently, Gundam or not. \r\nStory-wise it's pretty simple, childslaves on Mars in the distant future rise up and take over the business they were once beholden to as property. \"Human Debris\" is the term they use here. These children have been modified with technology so that education and training is not necessary, just plug them in and they know what to do. This instantly makes the cast of young protagonists easy to get behind. How can you not root for enslaved children to win? The plot is a bit weighed down by politics, sub plots, and many factions in what feels like a jigsaw puzzle of a story at times. I actually went out of my way to learn many names of governments and factions that ended up playing little to no role in the plot itself. Don't trouble yourself too hard with these details. The meat of the plot is the kids and their fight to survive the war they have set themselves up for by standing up. This is not war in the sense of excuses to have battles, comment on how awful it is, then experience no loss as many of these shows often do, this treats battle for what it is- hell. Casualties are suffered and comrades are mourned on both sides with a gritty emphasis placed on the youth of the fallen. I finished a few episodes with a depressed feeling. The Gundam itself is almost an afterthought!  \\n\\n\r\nThe plot is helped along with a colorful cast of characters. There is no main character to be sure, but a central core four. Starting with the pilot of the primary mech, Mikazuki. In past shows, this kid would be the focus of the show 90% of the time. But, he is so subdued that it would be hard to just concentrate on him. He seems almost boring at first, but you learn very quickly that it's just one layer to what may be the most complex character in franchise history. A devoted, loyal, and courageous fighter but also a stone cold killer. Capable of compassion and tenderness, but also a lust for blood. Mikazuki follows the orders of Orga, the leader of the kids, Orga serves as military commander, business manager, big brother, and in many ways father to children he leads, putting a lot of weight on his shoulders while still managing to keep an ever present spike on the tip of his hair. That thing could put someone's eye out! Hair do aside, Orga generates a lot of sympathy from the responsibility he holds. He must give orders that may result in the deaths of those who are- not just employees and soldiers- but family members. A position he struggles with at times, but succeeds in ultimately. Then there is Kudelia, the leading lady, I think she is where the show fails the most in characters. Serving as the \"only hope\" character, she is generic in that she wants equality for an oppressed people, while detesting violence. She hires the band of child soldiers to escort her to Earth to meet with \"X\" government to discuss \"Y\" trade laws, but also hates all the bloodshed she causes by embarking on this journey. Thankfully she accepts it as a necessary evil to accomplish a greater good, but otherwise serves only as a stereotypical princess and love interest for Mikazuki. Finally there is McGillis, the resident Char Aznable type, who serves as antagonist and anti-hero. I won't give too much away, but he is a man with plans of his own while serving Gjallahorn, the main bad guys in pretentiously over-the-top uniforms to match their snobby personalities, making them as easy to hate as the kids are easy to root for. The rest make up a strong supporting cast, including a guy who dresses like a pimp and has a bad-ass ship crewed by his harem of hot wives earning him the award of \"Luckiest Man In Space\".\\n\\n\r\nThe cast of mechs in this is a good one, too. The primary Gundam \"Barbatos\" is interesting in that it has very little in terms of fire power, but makes up it melee. Most of the mechs in this show rely on some form of hand-to-hand combat weapon as their primary piece, making it short on sweet, sweet, 'spolsion porn yet gnarly in the way they show the carnage and brutality of each impact, fluids (blood and oil) spew frequently, with a lot agonizing scenes of machines being torn apart methodically along with their helpless pilots. This was the first show I have seen that took the glamour away from being a Gundam pilot and equates it more like being a medieval era knight. The battle scenes are some of the finest I have seen in almost any Anime, and the art and effects showcased in the them is the best I have seen in a Gundam series. Speaking of art, the character designs themselves are very bright and colorful, contrasting the dark atmosphere they live in, and hearken back to the days of the original series. They even have one of the male characters pilot a bright pink mobile suit. Real men wear pink. Just ask Vegeta. I found the music be to only above average with some good opening and closing themes to start with, \"Raise Your Flag\" by Man With A Mission served as a good tune to get the blood pumping for an episode and \"Orphans no Namida\" by Misia as a more bluesy and sullen closing theme that is catchy and fits the often sad endings to many episodes. The Sub vs. Dub battle here is no contest in my opinion, the Japanese cast destroys the English one in terms of quality of performance and fit. There is also a slight emphasis on the fact they speak Japanese, so accuracy plays a part as well. Go Sub or go home.\\n\\n\r\nThis is a gritty experience from start to finish, yes the cast is primarily young children, but they are not innocent. They are products of the environment they were raised in. Each day is a fight to survive, not just for their own future, but for the ones who died fighting for that future. The show succeeds brilliantly in it's mix of emotional moments and awesome fight scenes so that it feels like a complete experience. The season ends well with a sense of closure, but still leaves plenty open for Season 2 which I eagerly look forward to. I would dare call this show a masterpiece if it were not for some episodes that dragged too long with politics and a few side characters that were introduced suddenly and forced to develop too quickly (looking at you, Carta Issue). I enjoyed this show immensely and recommend it to Anime fans in general as a great intro to the Gundam franchise and a very good series regardless. 9/10. Check it out. Cheers!",
            "date": "2017-05-06T18:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 247097,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5233934.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GarlandReese",
                "username": "GarlandReese"
            },
            "url": "https://myanimelist.net/reviews.php?id=247097"
        },
        {
            "content": "This gundam series has a great amount of drama and action. Like past titles and many mechas, a standard is to have dramatic moments and tragedy, and this anime encompasses all of that. There are plenty of meaningful, deep stories within the show. \r\nFor those who dislike gundam/mech, this would be a good one to start off at because  the story shows the struggles these child soldiers/slaves have. There aren't too many \"real\" gundams.  This is also a \"standalone\", you don't need prior gundam knowledge, really. \r\nThe first episode really pulls you in, it is full of action and sadness. It also doesa really great job at keeping you engaged and there are moments you just have to re-watch because they were so greatly displayed. \\n\\n\r\nThe main cast are the underdogs, child slaves and soldiers, most sold through human trafficking or orphans. Their struggle through life and the ways they try to strive are very fitting. Family, tragedy and loss are major themes, especially since it is somewhat of a civil war. Many of them are memorable, but don't be too attached to them...as this has many tragedies. \\n\\n\r\nThere are cliches of family and that \"extra\" push in the heat of battle, many of the battles are struggles from both sides that usually end up with wanting revenge, which is a part I did dislike. Everyone is just so vengeful, so it is a never ending battle between both sides trying to honor their deceased comrades.  \\n\\n\r\nSTORY: 8.5, the main plot with Kudelia is difficult to understand until you get to like past maybe the 15th? episode.\\n\\n\r\nART: 9, great art, nice animations, they don't skimp out on showing the damage done to the machines or even the dirtiness of their clothes. \\n\\n\r\nSOUND: 10, I really loved the OST and both openings and endings (esp the 1st half)\\n\\n\r\nCHARACTER: 9.5, All of them are so precious and memorable\\n\\n\r\nENJOYMENT: 10, I have had this on my waitlist forever, and I finished it in less than a week, I got really sucked in. \\n\\n\r\nOVERALL: 10, amazing, I would give it more if I could.",
            "date": "2018-01-28T15:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 269947,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zucchinichop",
                "username": "zucchinichop"
            },
            "url": "https://myanimelist.net/reviews.php?id=269947"
        },
        {
            "content": "This is by no means a great review as i mean to do this as a quick review more than anything so the scores may not be perfectly accurate and rather than a long review of all the wrongs and great parts I rather just quickly state what takeaways I received from this anime.\r\nThe overall themes are interesting, truly are and reasons a viewer would keep engaged. They do a great job of sucking you into the experience although most of us (the latter 90%) have never been in a war and have lived in times of peace (90s and later for the most part).The main character I had doubts about since the beginning and how they would handle him but nevertheless I loved him since episode 1 the second I saw him. He and the other \"MC\" were well fit for the sort of anime this was, more specifically the lack of plot armor. Which brings me to another point, the lack of plot armor was great and created many heartfelt movements specifically in the second season and near the end. They tried to establish what kind of world those kids lived from the very first episode which was a great and somewhat poor idea. Spoiler i guess, a character (Whos name i will never remember) died episode 1. It was great because it showed you the reality the show was trying to establish but somewhat poor because although they made it seem extremely sad it wasn't to the viewers, it was so unimpactful that although he was the first to die I can't for the life of me remember his name and barely his face nor personality. He was used as an example and a sacrifice as the later deaths (another spoiler i guess) were much more heartfelt and impactful but I'd say some way more than others. It was also funny how some deaths were not even mentioned because there were nonimportant illustrated in the first episode alone, where although many died only 1 person's death was truly emphasized and i went over that situation already.\\n\\n\r\nTo Warp it up although I can say so much more about the greats (and a few fails), I encourage you to watch this anime as it is without a doubt a top 3 Gundam anime (I'd say second behind 00, however, I'm starting to think it might just be the best Gundam anime I have seen and at least definitely the one I enjoyed the most) and being at the top of Gundam means being at the top of mecha animes right at the side of NGE and Code geass two jems of the anime world. Its that good, story, characters, protagonist, OST (although could be better), enjoyment, development, world building and battles (Again I think they could have done a bit better in the first few but when I look back at it, they were more than fine and the series would later pick up the fight a bit more as well)",
            "date": "2017-12-25T11:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 266360,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GawdFMAB",
                "username": "GawdFMAB"
            },
            "url": "https://myanimelist.net/reviews.php?id=266360"
        },
        {
            "content": "Mobile Suit Gundam: Iron Blooded Orphans was the first of the Mobile Suit Gundam Series that I have ever watched. I don't know if the other series have the same plot as this one but this Gundam series has more of drama than the Mecha genre. The main character has a unique personality and so do the rest of the supporting characters. Though there were some particular twists and turns that turn the Drama into more of a Tragedy, I enjoyed the story very much and I recommend it if you want to start getting in on the Gundam series.",
            "date": "2017-09-09T22:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 257219,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=257219"
        },
        {
            "content": "Iron-Blooded Orphans is a quality show, and a great Gundam show. The Gundam franchise has been filled with attempts to retread their past accomplishments, but these attempts never seem so successful. G-Tekketsu borrows very little from other Gundam shows and improves on most of what it borrows. \r\nThe most noticeable thing G-Tekketsu does better than most Gundam shows is the characters, or more so the character relationships. From episode 1 several character relationships are introduced. Every character has a different relationship, and the main characters have several different types of relationships with one another. Now in other Gundam shows each character would have a setrelationship with another character and maybe sometimes it would develop or change, but they would always be incredibly simple or shallow. The relationships in G-Tekketsu feels very human and natural and are nurtured by the setting and events of the world.  The characters grow, learn, and fall then get back up again throughout the story. The characters accomplish great things against all odds but they also make mistakes and do not always have the correct answers for everything. These are great features to have in a show about adolescents growing up on the backdrop of violence. \\n\r\nAnother thing G-Tekketsu does better than almost any Gundam shows is its’ directing. Tatsuyuki Nagai is a great director who takes priority on telling a story as clear as possible. Which is something this franchise needed since G-Reco’s directing and editing was a complete pile of ass. Creative choices like starting episode one on a sunset to signify the ending of the character’s innocents to then having the episode end on a sun-rise to represent a beginning of a journey was great way to express the narrative visually.  The action directing did not try to recreate the action of the past Gundam shows either. The action was a new take on how mobile suits can fight. With the focus on melee weapons the show’s cinematography had to follow suit. \\n\r\nhttps://sakuga.yshi.org/post?tags=mobile_suit_gundam%3A_iron-blooded_orphans \\n\r\nThe link above will show you that the animation is pretty amazing as well. \\n\r\n\tThe music of the series is nothing less than amazing. Yokoyama, Masaru is absolutely marvelous. Just like his previous works; he goes a step beyond just making cool sounding music. All of the music in this show builds the atmosphere and works thematically as well. Making this soundtrack one of the best of the year. Furthermore it’s just well written music. \\n\r\nMari Okada gets a lot of flak. For what reason? I don’t know, but for this series she does bring some pretty interesting ideas. Such as when Char Clone dawning his mask and reveals his new identity to the viewer on the episode in which all the characters come to realize that they don’t truly know who each other really is. Another is example is how she mirrors the first two episodes with the last two. \\n\r\nMany call this show blatant. But in reality it just really clear. However it has many deeper intricacies if the viewer is willing to put in the effort to actually look deeper. Significant things always are happing and the story and characters go a long way. Kudelia is leagues better than Lacus Cline and Helena Peacecraft. Mikazuki is leagues better than Heero or than any of the characters from Wing. All of them are more complex than the cast from dense piece of shit that was G-reco. This show stacks up. To me my new favorite AU Gundam show at the moment. That is If Turn A doesn’t count as an AU, which I don’t think it does.    \\n",
            "date": "2016-04-06T12:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 215683,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4610543.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SakugaSmear",
                "username": "SakugaSmear"
            },
            "url": "https://myanimelist.net/reviews.php?id=215683"
        },
        {
            "content": "I'll start by the following statement : \" It's not really that good but i surprised myself to like it more than I should have\" (nb:this review might contain typos and grammar mistakes, you've been warned, I've a really bad time to better my written English)\r\nThat said, pretty much everything is said. I'm writting this after a couple of months since I finished the anime, and so what is memorable in it ? Not very much to be fair:\r\n     The story: Really badly explained (I might be dumb as heck though, never knows) I never fully understood the motivations of Kudelia.Yes she wants Mars to be free but only the main line is clear, all the sub plot in her quest is quite uninteresting and I didn't care a f*cknugget about what she did in season 2, however I had a real sympathy for Tekkadan's will to just exist and I will talk more about it later. Politics inside Gjallarhorn is not really interesting and I also find death in general to be quite insipid with some exceptions.\\n\\n\r\n     The soundtrack: Quite good but really discrete, I can't remember a track except for the openings. Nothing more to say here.\\n\\n\r\n     The art: The animation is good, I found the fights to be fluid and interesting and the general design is good as well but not really that original, neither for the characters nor the mechas. I really liked the pastel colors btw.\\n\\n\r\n     The characters : Huh, pretty difficult to resume what I tought about them,  3/4 of the cast is forgetable but the other 1/4 is quite special, not in a way where they're really well written but at the end of the show what the characters made me feel is injustice. \\n\\n\r\nI won't explain why really because it revolves around the end and particular events, but I didn't realized i got so attached to them.I think it's because dialogues between the main characters are really (and when I say really I mean really)  common, you have heard them before and you will hear them again, but it fits well the characters, children  who never had a place in the world and accordingly simple. Simplicity and sobriety are really what I remember the most about the characters, they're often one faced, like Mikazuki who only live to fight and has no real other purpose, but that's what he is and it din't bother me that much because it is fully accepted by the show. \\n\\n\\n\r\n     The enjoyment: I first watched it because it was a Gundam show, and I finished it watching something else and peculiar in the way that, if it was not great, I really found the whole to be appealing.\\n\\n\r\nIn conclusion, don't expect to watch a 10/10, it is not. But if you take it for what it is, you will enjoy it, and if the story and the narrating is not always on point, watching till the end is for me really a must.",
            "date": "2017-06-24T15:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 250904,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577432.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MasterUnicorn",
                "username": "MasterUnicorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=250904"
        },
        {
            "content": "Let me say right from the get go, that if you like emo teens piloting the gundam, this isn’t the series for you. If you abhor on screen death, then this isn’t the series for you. If you want a gundam series that encapsulates everything we loved about Universal Century gundam then this IS the series for you. If you're looking for an intro into this thing called gundam but don’t know where to begin, this is the series for you. IBO has everything that we love about universal century gundam without the emo teens and child friendliness of the newer, alternate universe gundam series.The key here is the fact that IBO has no ties to any other gundam series so they were free to explore a world and mythos all their own. This is gonna be a turnoff to those who hold one specific gundam series above all others. But it’s still great, even for those who feel it doesn’t “measure up” to series in the past. The action is stunning and fluid, at times a little too chaotic to actually see what is going on exactly. Some characters develop, some don’t. One doesn’t watch gundam for the emotional content, but it has enough to make the characters matter to the viewer. I don’t know what else to say. If you love gundam, you’ll love IBO! Unless on screen death is a strict no-no with you; then you may want to avoid this one.\\n",
            "date": "2017-05-01T09:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 246734,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=246734"
        },
        {
            "content": "Story-The story is pretty good, you like some arcs you dislike others.7/10\r\nArt-The art in itself is beautiful in its category. This is a rags to somewhat riches story and the art is very good at showing that. 8.5/10\r\nSound- The sound is fine the only downside is that they use the same repetitive \"o its bad but lets get this victory\" song constantly and personally I got tired of it besides that they use some pretty good original and beautiful songs. 6/10\r\nCharacter-Most of the characters in this really start to develop based on the fact that we start of we a very developed main pilot, Mika.Through him and his influence on Orga(the boss) everyone in the story develops very well.9/10\\n\\n\r\nEnjoyment-Entertainment wise this is not a series to necessarily laugh at much. I only laughed generally at the end of the story when some foreshadowing was taking place and it was getting \"spicy\".7/10\\n\\n\r\nOverall- Overall in the end I was a little dissatisfied. Although, from watching many other anime I have realized that an end does not make the series totally. It can contribute a lot based on how good or bad it is(1 or 2 points). Either way besides that this story is a beautiful one thinking in a positive manner(thinking negatively and eh) and in the end all we see if every one having TRIUMPH! \\n\r\nPositive-9/10\\n\r\nNegative-7/10\\n\\n\r\nTLDR SOMEWHAT SPOILER-This is a story about a group of disowned people who create a family. They reach a good point and like a parabola they go down. In the end this story is beautiful because even in the end they still protect each other and triumph in their own ways.",
            "date": "2017-04-04T21:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 244651,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097203.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Blank123HD",
                "username": "Blank123HD"
            },
            "url": "https://myanimelist.net/reviews.php?id=244651"
        },
        {
            "content": "It's been awhile since I enjoyed a mecha series that is Gundam. I would definitely consider up to par with \"08th MS TEAM\" and adjacent to \"Thunderbolt\".  \r\nA bunch of space rats. Living in slums, and nothing to risk but their lives Mikazuki and Orga receive the Alaya Vijnana to go work as lackeys for privatized security. Used as cannon fodder, Orga orchestrates a coup d'etat with Mikazuki as his ace and best friend\r\nThe art has the right dark and gritty tone it's setting. And the anatomy of the machines are amazing. The first gundam I’ve seen to cannibalize parts and bastardize them ontoa Gundam. With a demonized crest, and the the naked look of the machine is a great contrast to the anatomy that is gundam. The weapon design is quite blunt simple and to the point.\\n\\n\r\n\"Hoping For You\" is an amazing song and perfectly sync up with the amazing feats of Tekkadan that certainly brings that lightness in our hearts called hope. While \"Orphans No Namida\" was only in the first season, it certainly brought that melancholy eighty's feel of no where to go [exactly like an orphan]. \\n\\n\r\nThe characters fall under the Gundam trope format as to be expected that is Gundam. Orga the brains, the morals, and the leader of Tekkadan, not very fond of the character design at first. Mikazuki the ace of Tekkadan, is quite jaded but ever so loyal to Orga, is very reflective to Hero Yui. While Kudelia plays the peaceful and political spectrum of the series is quite useless.\\n\\n\r\nThis is an amazing Mecha series after bending head over heels for the Evangelion series, Gundam Seed Destiny, and Gunpla builders. Iron Blooded Orphans will definitely give you some recovery.",
            "date": "2017-01-24T08:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 239017,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2254849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NemoBarbatos",
                "username": "NemoBarbatos"
            },
            "url": "https://myanimelist.net/reviews.php?id=239017"
        },
        {
            "content": "I really really resonated with this anime for some odd reason. Though Some interactions between secondary characters are bland this is a very small area. Mikazuki, Orga, Atra, and Kudelia Are very strong characters and any time they are on screen you know you are going to get something Good.\r\nStory 10/10\r\nStory is an amazing look at child soldiers and wealth inequality, no only does it show the story of the protagonist effectively but it also shows the main antagonist Gjallarhorn side very well.\r\nFrom the bonds of the Warriors too the outsiders view on how these kids are acting in these situations everything is written andtold very smoothly and well. I also found the fights to be very well done in terms of story based fighting (Not too flashy and prolonged but just the right amount of time).\\n\\n\r\nArt and Sound 7/10\\n\\n\r\nMixing these together solely because there was nothing special about them, they were on average for what was put out its season with smooth animation but alas it was still normal.\\n\\n\r\nCharacters 10/10\\n\\n\r\nI have never seen a show in which i was enticed by more than two characters stories. Around eight of the characters had exceptional dialogue, background stories, and interactions in the show, with many more being above average.\\n\\n\r\nMikazuki Is without a doubt one of the best characters I have seen in a anime. The balance between the Cold blooded killer to Bratty Brother to Protector is outstanding. He has very powerful emotional scenes which he most of the time he aimlessly falls into. At the base he is a typical shonen protagonist with his accomplished fighting and idiotic characteristics, but once serious stuff starts happening you start too see that he is soo much more than that.\\n\\n\r\nOrga is forever battling with himself as the Leader of Tekkadan, and the promise he made to Mikazuki and the rest of his comrades. Even though he is written as a typical Empathetic  Military Leader who knows he has to order people to their deaths, He is still a Teenager and has to battle back his Ambitions for the better of Tekkadan.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nThis is a fun show i mean its Mecha, its witty, it has a plethora of funny kids, it has Great battles, and in its dark moments the thrill is in full effect.\\n\\n\r\nOverall 10/10\\n\\n\r\nCannot wait to get some more of this anime",
            "date": "2016-04-04T14:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 215504,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Evil_Ood",
                "username": "Evil_Ood"
            },
            "url": "https://myanimelist.net/reviews.php?id=215504"
        },
        {
            "content": "Story: In the distant future, where humankind has expanded past the confines of Earth, a group of orphans living on Mars fight for a new hope: the hope of independence from an oppressive Earthen government, freedom from servanthood, and simply a better life making an honest living. With the odds against them, the desperate orphans must utilize every possible tool at their disposal to make this hope a reality, giving purpose to an ancient mechanical behemoth from a turbulent era in the distant past.\r\nReview: After twenty-five episodes of various plots, character developments, and heated action, Mobile Suit Gundam: Iron Blooded Orphans finally comes to aconclusion. Having had extensive experience with the Gundam franchise, I entered the viewing contest with expectations low. Despite being a self-professed longtime fan, the majority of Gundam series tend to be heavy on the robotic battles and light on story and character development, two attributes I heavily pay attention to. I attribute my fandom to being introduced to the series at an impressionable age, where the cooler, flashier, and more destructive the series, the better it is. Take Mobile Report: Gundam Wing for example, one of my favorite animated series growing up. In retrospect, while the mecha were interesting in design, the characters were one-dimensional, their development poor, and the plot non-sensical at times. Even the animation was at times not up to par with its predecessors. Yet because of the nostalgia behind it, it’s still one of my favorite Gundam series. Gundam SEED and 00 were more of the same in the all of the same departments. Flashy battles, but little more beneath the surface. \\n\r\n     As my palate for viewing pleasure has matured, I yearned for more than mecha battles for appeal. Unfortunately, the nicely done Gundam series were few and far between. The few exceptional Gundam series that did exist were comparatively light on the action and heavy on the drama: Turn A Gundam and Mobile Suit Gundam: War in the Pocket for instance. You could really empathize and care for the characters. The Gundams were merely “worn” by the characters, rather than the characters being “worn” by the Gundams, if you catch my drift. As such, in regard to how well done a Gundam series is, I will forever use these two as a reference. So again, while skeptical of Iron Blooded Orphans due to the aforementioned reasons, it did not disappoint.\\n\r\n     I was initially turned off due to the peculiar design of the titular suit. It seemed more feral and basic, not very heavily armed compared to previous models from other series. As the series progressed, I came to appreciate the realism behind the Gundam frame. The frame was the core of the mecha, and it could be modified and customized with different armor and weapons, depending on the need. Practically speaking, this was the most real a Gundam series could get. When you have a machine with a high output of power, it should not necessarily excel in every particular field of combat. This Gundam, the Gundam Barbatos, was powerful, yet vulnerable. It could be damaged, even severely if not used properly or appropriately. Another aspect of the series I take my hat off to is the perceived lack of cannon-fodder mecha. The GMs, GINNS, Zaku IIs, and Enacts of the past (all mass production models that were commonly destroyed after a single shot from a Gundam) did not seem to bear any descendants in Iron Blooded Orphans. Even the common and mass produced mecha were not easily defeated. They all had tough armor, and a lack of beam weaponry in the series allowed the mecha battles to have a much more visceral and gritty feel to them. Simply put, combat in this series was brutal. Pilots could die from blunt force trauma they received from being inside a mecha that is being hammered, just as a person inside of a car can die from a motor vehicle accident. Such brutality was rarely viewed in Gundam series past. Past Gundam series had characters surviving the self destruction of their machine with them in or on it (Heero Yuy from Gundam Wing and Kira Yamato from Gundam SEED). The reality is, these mechs are made of sterner stuff than flesh and bone, and should be able to withstand more punishment than its pilot. Pilots, protagonist or not, are not guaranteed safety as they enter these potential metal sarcophaguses. Yeah, in this series, seeing a character get inside a mobile suit can be a scary thing. The realism, brutality, and morbidity the battles in Iron Blooded Orphans will at times make you want to stop looking. And for a Gundam series, that is incredible.\\n\r\n     The character designs were not met with much enthusiasm. But I grew to understand that looks aren’t everything, and beauty is only skin deep. Characters such as Biscuit (weird name, but great guy), Akihiro, Eugene, Mikazuki, and Orga seemed either generic or unattractive. Boy was there so much more beneath the surface. Forced into hard labor, no family of their own, and viewed as expendable child soldiers by their superiors with a short and brutal life to look forward to, they have to develop a hope to keep on living. They come to the conclusion that that hope, for a better life, is something they have to do more than merely hope for. They have to fight for it. Each of these characters ended up getting a satisfying amount of development, and the relationships they have with each other a pleasure to watch. If there was any theme to attribute to these relationships, it would fraternity. These characters, most of which were unrelated by blood, being orphans and outcasts, created a family together. And not just an ideal family with a happy life and ending, but a family with arguments, hardships, and sacrifices. They live life not only trying to survive, but to them (and more importantly), helping each other survive. Even at the cost of themselves. It’s both beautiful and horrifying to watch.\\n\r\n     In regards to the storyline, it’s good. And by good, I mean believable. Whereas past Gundam series tend to downplay the importance of its adult characters and magnify their incompetence, the adults in the series are for the most part crafty manipulators. The selfish nature of the adult world is laid bare, but not in a condemning manner. It’s presented matter of factly: this is simply the way the world works. You either adapt, or get used by others with no upside for you. Nobody is altruistic, and everything comes at a price. These young orphans, innocent in many ways, must climb a steep learning curve, fight hard and put on a tough exterior in order for them not to be taken advantaged of. No single faction is as well put together as it appears, and the appearance of power is heavily emphasized to gain leverage. Every action from a character in power is calculated, and allies are allies so long as it is convenient for them to be, even the ones you’d like to root for. Morality, amongst our antagonists and even protagonists can be a murky subject. You see characters of admirable qualities on both sides, and with flaws that have the potential to break them. The commendable Gundam series of old, from the classic Mobile Suit Gundam to the Turn A Gundam are rife with this element of sympathetic antagonists. Their plight when faced against the desperate wrath of the youngsters might even bring a tear to your eye. Without a doubt in my mind, this Gundam series has the most believable presentation of the modern world, despite taking place centuries in the future. You even get glimpses of cities and their landmarks today, such as Edmonton, Canada!\\n\r\n     With a believable story, excellent characters, solid pacing, and gritty mech battles, this is an easy recommendation for any Gundam fan. And to go a step farther, this is an easy recommendation to anime fans in general. Perhaps even beyond. The shows certainly possesses the appeal of good television. My only complaints are purely personal taste in the amount of screen time certain sympathetic antagonists received. While their motivations are believable, I would have appreciated further explanations into their backstory. There is room for this to be possible, as a second season well on its way this October. With an English adaptation coming out soon this year (Summer 2016, I believe), Mobile Suit Gundam: Iron Blooded Orphans will be more easily accessible to western audiences, perhaps even gaining a few fans along the way. Watch a few episodes, and I’m confident you’ll be drawn into the plight of the Iron Blooded Orphans. It is that good.\\n\\n\r\nOverall Rating: 9/10",
            "date": "2016-04-05T16:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 215606,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/golytely",
                "username": "golytely"
            },
            "url": "https://myanimelist.net/reviews.php?id=215606"
        }
    ]
]