[
    [
        {
            "content": "I saw One Punch Man trice and bought the bluray. I saw Mob Psycho 100, not 100 times, but twice. While I love both of these shows, I love Saiki more. When I heard it would be getting season 02 before either of these two shows (which are -according to sales and popularity rankings- 5 to 20 times more successful than Saiki), I naturally started pinching myself to wake up from this beautiful, yet unreal dream. When this didn't happen, I had to assume they have started to celebrate April's Fools twice a year. I headed to my closest Reddit where people have the habitof repeating everything they hear and read as facts, but didn't see anyone mention April's Fools. This gave me no other option but to believe there lives a \"Saiki\" inside our very own universe, something has gone terribly wrong with him and now the whole structure of the very reality is shaking. After recovering from the panic, I realized only two things can happen a) the world will end b) season 02 will really air. As we can conclude, there was no cons in this situation.\\n\\n\r\nThe adventures of Saiki continue with an epic start where he watched the anime \"Gintama\" from tv and wonders what type of shitty excuse for a comedy that series is. My man. In all honesty, the beginning of this season was not the greatest thing. The series felt more or less like S01 with the same content, but now missing the fresh and new feel the series had. This got quickly fixed (in episode 6) by the author who started introducing new characters (such as the officially best girl) but also started strengthening the already existing cast members. Instead of expanding our series with side tracking plots and new comedy elements, mr. author keeps giving us details and adding substance to his characters, not only developing their humor but also creating depth to the comedy. And this way, mr. author gave us a sequel which was better than its prequel. If decisions as good as this were always made, I would never have to write negative reviews.\\n\\n\r\nMy favorite part of this series is how brotherly and manly Saiki is from its humor to its characters. Aibro (Riki) is the perfect comedic delinquent and a total badass. I am not even sure what makes his character so great. Is it how many fucks he gives (forgetting how to get to school every day despite living right next to it) or how awe-inspiring and cool he is in any and every situation. Shining Kokomi, on the other hand, corners Saiki the hardest. Scenes where she gets like 500 people (including the FBI) search for Saiki are both written and executed with such brilliance that you won't never find this sort of unique comedy anywhere else. Overall the cast is just incredibly strong and unique. There are in total of 10 characters (other than Saiki) who have their important role in the series when it comes to Saiki's life and the comedy. Everyone of them is memorable and adds to the series. Not a single one of them is annoying. Rather, I personally welcome comedy moments surrounding any of them -- which is beyond rare for myself.\\n\\n\r\nLike all comedies, Saiki is exactly as fun as the viewer who is watching it. The comedy is very direct and executed in 3 different ways: character-centric personality tweaks which deliver the more you are into the characters (the amount of detail and characteristics that add to the comedy is insane), visual in forms of silly animation (such as simplistic character introduction scene where one bro starts rolling in the scene like he is just drawn on a piece of paper - which he obviously was), and most of all in the forms of sitcom where the series corners itself with some sort of problems that are presented as a situation comedy. The comedy is original, but also parodying great many things from other anime series to common cliches. The best part of the comedy is how random it often starts and how unpredictable it ends up being, but at the same time uses the same elements that are already familiar to all its viewers and unique to Saiki the anime. Still, remaining subtle and never, not even once pushed in your face. This is the type of comedy that constantly rewards its viewers and respects the audience. For example, during one TV channel surfing scene, Saiki himself comes across people who we see in his daily life all the time. His parents are giving an interview, some dude stuck in other channel's background image, and Aibro taking part to the Japanese version of the TV show, Who Wants to Be a Millionaire (without even knowing what the show is about because he just doesn't give a fuck, just like he never does). Every single thing from the 3 different TV programs to Saiki's live reaction to it all, are pure brilliance. \\n\\n\r\nOverall. Saiki relies on badass comedy and bro situations which automatically mean that the series is highly appealing to myself. On top of that, Saiki's cast is among the most strong and memorable I have seen in any comedy anime. The only comedy series which I can say has achieved more in terms of characters is 'Cromartie', but it was also too short to be perfect. The author of Saiki is incredibly self-aware and has a clear vision of what this series should be about. As a conclusion: This season will not please all viewers, but it has done perfect job being exactly as good as it could realistically ever be. Season 03 when.",
            "date": "2018-06-26T10:14:00+00:00",
            "helpful_count": 101,
            "mal_id": 282282,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282282"
        },
        {
            "content": "Saiki's adventures continue for 24 more episodes, and they are somehow even better than before. I will keep this review short since I already have one posted here for the first season discussing the strengths of the series, which definitely stay relevant in this sequel.\r\nThis second season adds more spice to the comedy with the introduction of new characters, that as expected from the series are really fun to watch, likeable, and lead to new character interactions that never fail to make the viewer laugh, this can easily be seen in shorts where Saiki is mostly just hiding around and one still loses it byseeing the others be the way they are.\\n\\n\r\nThe art took an upgrade that makes the series better looking, and it's used nicely with some priceless reaction faces from the characters and is overall more visually pleasing. The music is pretty much the same, but the new set of openings and endings from the series are fantastic, especially during the second cour where sometimes I spent more time looping them than watching the episode itself.\\n\\n\r\nSaiki Kusuo no Ψ-nan is no longer just a hidden gem, to me this season confirmed it as a must watch anime for any fan of the comedy genre and a fantastic option for anyone who isn't to find a series that might change their mind. I really can't recommend it enough.\\n",
            "date": "2018-07-01T10:58:00+00:00",
            "helpful_count": 46,
            "mal_id": 282705,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759794.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetaThPr4h",
                "username": "MetaThPr4h"
            },
            "url": "https://myanimelist.net/reviews.php?id=282705"
        },
        {
            "content": "TBH I have been really waiting in eager  for this anime to come out exactly one year. Why?\r\nBecause the 1st season of Saiki Kusuo no Psi Nan is really funny as hell, kinda the same as nichijou or gintama level comedy.\r\nThis is the series that i still like and read in shounen jump, after i drop almost all shounen series as i feel they are too childish now. Too bad the Saiki Kusuo manga ends this March 2017 though, but anyway I have read so far in the saiki kusuo manga that i can guarantee you the story in Saiki Kusuo season 2 isstill as funny and as good as season 1. \\n\\n\r\nWell, let's stop the rant and start the review:\\n\\n\r\nSTORY:\\n\r\nThe story continues the 1st season, so i really recommend and urge anyone who want to watch this show to finish the 1st season first in order to reconize the characters . Anyway, the story is still about Saiki Kusuo, an OP psychic that just want to have a peace common life, but always get disturbed somehow, either because of his family or his school friends.\\n\\n\r\nThe promise is really simple. But what makes this anime shine is because of the comedy from the situation occured and how the characters handle it.\\n\\n\r\nOh, and in season 1 the show is actually 5 minutes long per episode, but in this season 2 the show is 24 minutes long, consist of 4 separates stories that sometimes connected.\\n\\n\r\nCHARACTERS:\\n\r\nWell, here are what makes this anime so great. Because it has so many peculiar/interesting characters. Aside from the unique characters from 1st season, such as Nendou the aho, Kaido the chuuni, and Teruhashi the perfect bishoujo, in this season 2 it will introduce several new characters: \\n\\n\r\nAiura Mikoto (a real fortune teller, that become Teruhashi real rival to get saiki's love), Rifuta Imu (just another Teruhashi rival who wants to be the most popular), Satou Hiroshi (a perfect normal guy that saiki idolized and obsessed with), and Akechi Touma (Saiki's childhood friend who wants to prove that saiki is a real psychic).\\n\\n\r\nWell, some people and even i might complain that it was a bit forced to introduce a new characters to the show, maybe because of the auhor lacks the inspiration to make a funny plot based on existing characters. But, i just put it aside, as long as the show still funny and the characters will stay in the show and not just somehow disappear, I won't give any complain.\\n\\n\r\nFor the characters, based on manga that i have read, Aiura Mikoto will be one of my favorite characters in this season 2. At first, I have a bit negative thinking about her, as i kinda dislike Gyaru type girl, but after more story revealed, i won't spoil it for you, but she actually deserve to be Teruhashi real rival to get saiki's love.\\n\\n\\n\r\nSOUND and ANIMATION: well, i never decide to like or give score to an anime based on these, as i watch fo the story and characters.\\n\r\nBut for sound, I actually kinda hate the OP song as there is characters dialogue inside it that made it really weird and can't be enjoyed, the ED song is okay though. \\n\r\nFor the animation, i dont think this anime is any special but I dont have any complain with the story animation, instead i have complain about the title sequence background as it made me cringe so bad with the bishounen theme, especially the bishounen nendou.\\n\\n\\n\r\nENJOYMENT: well, i come to watch the anime for pure enjoyment and finish satisfied. Based on 1st season, this show really nailed in the comedy aspect. I always laugh in each episodes. I always finish the anime smiling, and cannot wait to see the next episode.\\n\\n\r\nOVERALL: This is one of the best anime in comedy genre. And for me it is even better than gintama in some aspects.\\n\\n\r\nOther than this show isnt too vulgar as gintama, what makes this anime better than gintama is how Saiki Kusuo ends the plot story without always become a boring action and tearjerker. In gintama formula always start the plot with so much comedy, but it usually always ends it with something sad/bad happen and end with gintoki saves the day with his cringy shounen plot armored action, which usually i always just skipped over, as i come to watch the anime for the laugh and not the melancholy. And this anime is so much better than gintama in this aspect.\\n\\n\r\nAnyway, thanks for reading my review. Leave the comment in my profile, or maybe send a friend request if you agree with my review.",
            "date": "2018-02-26T12:00:00+00:00",
            "helpful_count": 25,
            "mal_id": 272507,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4580589.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lswarmruler",
                "username": "lswarmruler"
            },
            "url": "https://myanimelist.net/reviews.php?id=272507"
        },
        {
            "content": "*Minimum Spoiler Ψ-nan Review*\r\nIf you did not watch S1 then go watch it ASAP or don't. \r\nTL;DR: Having psychic power was never easy but laughing at the misfortune of Saiki is definitely GGEZ.\r\nBigger cast, more budget, same humour but now more fan service... For guys & girls. Don't think just watch.\r\n[Story: 7/10 , Characters: 9/10, Art: 6/10, Sound: 7/10, Enjoyment: 9/10]\r\n\"It's true there are no anger or sadness, but that also means no joy or fun. That's my life.\" - Saiki Kusuo\r\nWhat do you get if you throw in the humour style of OPM, MP 100 and Sakamoto Desu Ka in a pot then simmerit with the same recipe Gintama used to gain popularity in the comedy genre arena of anime? You get Saiki Kusuo no Ψ-nan Part 2 of course. There was no doubt this anime short was a success in their inaugural first season but to live up to the expectation in their second season was hard but they made it look super easy. How? They just didn't stray from their recipe that made them successful. By having  good clean albeit raunchy slap stick quid pro quo comedy, often times with relevant memes to crush other wannabe anime shorts' dreams, helped solidify their standing as the best comedy anime short this year.     \\n\\n\r\nThe story picks up from where it left off last season but realistically this anime doesn't really have a linear story to follow. Each episode is composed of 4 mini shorts of 5 minutes that follows a linear story line. Sometimes they are related, often times they are not. But who cares. You are here to hear comedy not pull your hair chasing hares in story inconsistency. So just shut up, grab your buddies and engage in a good laugh. Heck you could even watch it alone and you would still be rolling on the floor laughing while doing the helicopter. Needless to say, the story always moves forward and that's all you need to know. Some of the shorts were a bit weak & forced but given the material at hand, you can only do so much. Be happy that this will be a complete manga adaptation as the manga also ended. \\n\\n\r\n\"My grades, appearance... Everything about me is average. I was born average and I will die average. That's my life\" - Sawakita\\n\\n\r\nThe best part about Ψ-nan, aside from their comedy, is the gregarious melting pot of their giant cast. Aside from the main 4, Saiki, Kaidou, Nendou & Teruhashi, this season we were introduced to an even greater range of cast. Luckily, each of these characters managed to stand out from one another with their unique character design and outlandish personality. Heck even the most average character in this anime managed to be above average in their character development. This is what makes this show so great to watch. Their character development for supporting cast does so much in 5 minutes that other shows can't even do in 4 bloody long hours. It was always fun seeing them return in various shorts and you started to develop attachment to these characters. The dialogues as well as the seiyuus that voiced these characters went above and beyond in each episode to really drive home their greatness. Who knew the voice of shitty Shinji would actually be this awesome. Great job all around. \\n\\n\r\n\"Life is in very easy mode. This is all because I am gorgeous. \" - Teruhashi Kokomi\\n\\n\r\nAside from their dynamic linear plot and outlandish characters, this show puts in their due diligence when it comes to animation. It's a comedy anime short, not some Ufotable level Battle Royale. At least no pans and zooms and the panels are hand drawn for better animation quality. The studio put in effort and they were rewarded with a huge fandom. Plenty of fanservice was weaved into each episode but it didn't derail the anime from it's roots, it only propelled it. Beside their animation quality, the background score went really well with the anime. A good comedy show really needs to get their music timing on point and this show did just that. Although the OP and ED songs weren't as appealing to me personally but others might think otherwise. I preferred the season 1 OP and ED songs more than this season's.  \\n\\n\r\n\"Fortune telling is just an illusion created by a bunch of people who pretend to be prophets\" - Kaidou Shun \\n\\n\r\nOverall, Saiki Kusuo no Ψ-nan 2 is a satirical school comedy anime short that parodies the known anime tropes that's overused in our anime industry atm. Their main purpose is to provide comedy and with great effort from their staff, they are able to establish just that with their outlandish cast of misfit characters. If you are in need of a laugh, I would recommend starting from first season. If you are lazy and want to watch this season, you can do that. If you are still in doubt, just pick a random episode out of the hat and watch one. What do you have to lose but your funny bone, am I right? I would not recommend the Live TV adaptation because some things are just better in their animated format. Also, this is the last season. Very rarely do we get full manga adaptation and it is truly a gift to cherish. I know I will miss watching this anime. Hopefully some OVAs come out for the chapters that didn't get animated. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Ciao.\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!",
            "date": "2018-07-01T11:44:00+00:00",
            "helpful_count": 17,
            "mal_id": 282710,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=282710"
        },
        {
            "content": "Just another average day for Kusuo Saiki...\r\nOk, so the second season of Saiki Kusuo no Ψ-nan 2 and this second season was kept to the 24 minute structure and clumping the skits together, which was how LA didn't watch it from the first season's 3 minute 120 episode structure but nonetheless LA adapted to it and well, let's just say the experience in watching the 24 minute structure was like a verbal speeding train of quick witted dialogue, comedic timing and unpredictability just like the first season...so another words same old Saiki Kusuo no Ψ-nan but in chunks of funny.\r\nLA have soo much to unpackSaiki Kusuo no Ψ-nan 2 so let's start off with the new characters, for starters how about Mikoto Aiura voiced by Eri Kitamura, a fortune teller that figures out Siaki's secret of being a psychic and becomes something of a love rival not-so to Kokomi but for the most part she's in friendly terms with Saiki or when Saiki needs her help, LA really liked her inclusion and made the interactions with both Saiki and non-direct interactions concerning Kokomi all the more interesting..at least it was a bit better that Chiyo..but her a bit later. Next would be Imu Rifuta voiced by M.A.O who like Mikoto becomes a rival towards Kokomi however unlike Mikoto, she becomes OBSESSED with Kokomi and even becomes her winggirl, once again becomes of her satellite character status to Kokomi she does make good quips at times but still she was a fine addition. Metori Saiko voiced by Masaya Matsukaze is the typical narcissistic rich boy with little common sense about the real world and how it works besides him trying to throw money at it, he does get an arc involving an isolated island and LA was meh in his inclusion. Lastly would be Touma Akechi voiced by Yuki Kaji, an utter blabbermouth and talkative as all hell character that is always suspicious of Saiki if he's a psychic or not and considering his \"trait\", you kinda see why Saiki wants to not allow him know about him being a psychic which oddly enough Touma as much of an annoyance of a character he is, his development into the cast was rocky and interesting to say the least. There were tons of other minor characters in the bunch so let's continue with the old character development...\\n\\n\r\nNendou is same as ever...\\n\\n\r\nShun Kaidou had a romance subplot with Chiyo and LA didn't like...as in Chiyo's development and screentime wasn't as good as LA thought...which is why LA kinda shifted to Kokomi through this season...\\n\\n\r\nAren and Kineshi is the same as ever...\\n\\n\r\nChisato Mera voiced by Maaya Uchida showed her true self though she was the typical poor character and got development this season about her father and how she got poor in the first place, but throughout this season if a character was flanderized like hell it was Chisato and she easily become unlikable as to how greedy she is both in food and basic needs and showing her self-centered personality...\\n\\n\r\nKuusuke Saiki is the same trolling brother to Saki as ever...\\n\\n\r\nReita Toritsuka voiced by Natsuki Hanae is the same as ever...though now he hangs around Mikoto because of their retroactive knowledge about Saiki...\\n\\n\r\nWell lots of old character stuff happened...\\n\\n\r\nand lots of plot stuff happened...\\n\\n\r\nIn the sense we get to know more of Saiki's powers and his odd time loop and time travel tidbits about him and on speaking of Saiki's powers, Saiki Kusuo no Ψ-nan 2 shows once again that Saiki does once again care for his friends and family just in subtle ways and that his powers doesn't always solve everything.\\n\\n\r\nSaiki Kusuo no Ψ-nan 2's comedic timing and comedy is general is the same as ever...like the quick witted nature of Saiki Kusuo no Ψ-nan in general which LA already explained from LA's first season review and even in a 24 minute structure still keeps the skit's momentum going which again feels like a verbal speeding train because of the structure and LA is fine with it...even if the comedic skits hits LA like a truck and is funny at the same time. In summation,  Saiki Kusuo no Ψ-nan 2's keeps up it's comedic nature from the first season right down to the breaking fourth wall and character jabbing and comedic timing in general.\\n\\n\r\nAnimation once again done by JC Staff and Egg Firm is the same as always thus not much to talk about but the craziness that Saiki Kusuo no Ψ-nan 2 is with decent character designs, background work and breaking the fourth wall jokes. JC Staff and Egg Firm did it again!\\n\\n\r\nVoice acting, well the entire cast did great but LA will now probably give props to Ai Kayano as Kokomi as well as regular fast talker Hiroshi Kamiya but to Eri Kitamura as Mikoto as well. With how the anime's fast nature is like, it's expected the entire voice cast to have sped up dialogue and that once again, LA needs to say that the entire cast kept to this (well cept Nendou's voice actor Daisuke Ono though not all the time). Just huge props to the voice cast nonetheless.\\n\\n\r\nSaiki Kusuo no Ψ-nan 2 is just like the first season just with newer characters and older character developing for the best...or worse and both the old and new character mingling together was great in terms of character interactions and in turn it's comedic pay off. LA really doesn't need to say that Saiki Kusuo no Ψ-nan 2 might as well took LA's favourite comedy anime for Winter 2018  as it took a the first season and only improved with it even with the addition of new characters and  subtly developing Saiki along the way and by all means Saiki Kusuo no Ψ-nan doesn't feel like it's losing steam any time soon considering what the final episode is to hinted at. \\n\\n\r\nSaiki Kusuo no Ψ-nan 2 is like a verbal speeding train of comedy and it just comes at ya...ohh and if you haven't noticed but...\\n\\n\r\nLA is sorry but Chiyo is annoying and stale now, LA is going to the goddess that is Kokomi as favourite character in Saiki Kusuo no Ψ-nan 2.\\n\\n\r\nOh!",
            "date": "2018-07-01T16:11:00+00:00",
            "helpful_count": 16,
            "mal_id": 282737,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282737"
        },
        {
            "content": "There is a video on Youtube of Digibro talking about the raving popularity of anime in the 90s, and how Americans would smuggle VHS into the country and secretly distribute them because the quality is so great. He talks about how we have lowered standards for rehashed trash, how we ignore terrible CG crowds and exposition dumps, that anime is going downhill, except in one section:\r\nComedy.\r\nThis show is the embodiment of the essence of doing anime right. The first season was low budget, but the spirit and comedic power was driving this show to greater heights.\r\nIn this season, they upped the budget seemingly significantly, andyet retained the full essence that made the first season so great. Now we have full, completely unnecessary sakuga intros, highly animated faces, ultra quality sound production, all with the same greatness as before.\\n\\n\r\nThe story gets better and better, and while I can't say I've read the source material, I love the character arcs and the overall world arcs; the characters are being developed excellently, and the characters being introduced are becoming mainstays in the cast that feel completely irreplaceable. \\n\\n\r\nComedy, like Saiki, is the primary element that quality anime is continually being produced, and I am glad to say that Saiki Kusuo is among the greats.",
            "date": "2018-04-23T11:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 278808,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1968888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Crimefridge",
                "username": "Crimefridge"
            },
            "url": "https://myanimelist.net/reviews.php?id=278808"
        },
        {
            "content": "It is rare that I find a show that I love so dearly. It is even more rare that a sequel of it comes out. Saiki Kusuo no Ψ-nan 2 is that sequel. This show is about a psychic high school age boy named Saiki Kusuo. Saiki has various powers, including teleportation, telepathy, telekinesis, pyrokinesis, x-ray vision, and a plethora more without even scratching the surface of his powers. Even with having all these powers, Saiki only wants a normal life. But, the various characters around him lets him find himself in situations where his normal life would be in jeopardy.\r\n\tThis is easily one ofthe most underrated anime in the west. Imagine Mob Psycho 100, but all of the drama and story has been cut, and it's a gag anime. Saiki K is a slice of life, shounen anime, with the manga being published in Shonen jump. It’s been 2 years since the first season came out, which I severely underrated myself. But after an amount of time, once the second season aired, I realized what I had missed all that time.\\n\r\n\tIn the first season, I took the wonderful characters for granted. I was so glad when they came back. I missed them, in a sense. The jokes come fast and quick. After one joke you laugh, and once the next joke rolls around you’re still recovering from the last one. It's a hilarious and character driven ride that you won’t regret watching. The animation is nothing to look at, but its not necessary to make this a good experience. The art is also nothing special, but the character designs are top tier and recognizable. Both the OP’s for this season are fun and ridiculously catchy.\\n\r\n\tI recommend this show for everyone and anyone with access to this show. I give this show a 10 out of 10. This has been PixEFit’s spoiler free, but not really review on Saiki Kusuo no Ψ-nan 2.\\n",
            "date": "2018-07-01T22:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 282748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=282748"
        },
        {
            "content": "First of all, in my opinion this anime generally is not for people who just recently started watching anime (as a whole), because it has some parodies to other anime and it requires fast reading the sub (or pausing it for lots of time to read the subtitle). So if you're ok with that, give it a go! This is also a gag anime so it shouldn't be taken seriously. And it loves breaking the 4th wall just like Gintama (but i think Gintama does it more frequently)\r\nBtw, this is my first ever review in MAL and I'm not that good of making reviews. Basically,this is a sequal to the first season of Saiki Kusuo, but with added characters and more character developement (as what I see). So if you want a full review of this anime, check out the first seasons' reviews.\\n\\n\r\nIf you like something like sakamoto desu ga? (which I also love) then you'll basically would love this anime coz both of the MCs are OP in there perspective series in a humourous way. I personally love Saiki Kusuo a lot, coz how he has psychic powers that makes him look OP, but in the same time he loses the will to be a normal person (stated in the first season), i feel that reason makes this anime a unique one that differs to a lot of comedy animes as a whole. This is one of the few comedy/school/slice of life anime that made me laugh so hard.\\n\\n\r\nLong story short: this is an upgrade of the first season. If you love the first season, you'll definitely love the second one for sure\\n\\n\r\nP/S: Nendou needs more love. I slightly love the first season more coz it has more Nendou screen time\\n\\n\r\nThis is my favorite comedy anime along with Gintama and Sakamoto Desu Ga?\\n\\n\r\nStory: 8/10, Art: 8/10, Characters: 9/10, Enjoyment 9/10\\n\\n\r\nUsually I rate the comedy animes by how hard I laugh and lovable characters",
            "date": "2018-07-01T16:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 282735,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6055324.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Amin-kun",
                "username": "Amin-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=282735"
        },
        {
            "content": "This is largely the same deal as the first season. Meaning gag comedy, with multiple short episodes crammed into one anime episodes. \r\nSummary:\r\nStory 6/10\r\nArt: 5/10\r\nSound: 6/10\r\nCharacter: 6/10\r\nEnjoyment: 6/10\r\nOverall: 6/10.\r\nCompared to first episode one thing that I noticed is that intro and outro music became better, however, I felt like the show become slightly weaker compared to the 1st season, and I felt like animation quality dropped slightly.\r\nMeaning 6/10 instad 7/10 total this time aropund. One of the reasons for that is probably the fact that they introduced huge number of characters, and because now there are \"multi-episode\" mini arcs. Those lack the pace of shortstories of the first season and as a result felt less entertaining to me.\\n\\n\r\nIn general:\\n\r\nThe story is a gag comedy, and is generlaly well done/interesing to watch.\\n\\n\r\nThe art is clean and basic, in few places near the end the quality gets reduced, but it does its job. If i were to compare it with anything, I\"d compare it with \"Ane Log\". \\n\\n\r\nVoice actors really breathe life into the series, and make characters more entertaining. I checked out the manga after the anime, and manga had less impact for me.\\n\\n\r\nSpeaking of which, the adaptation is very faithful to the original and barely misses an episode.\\n\\n\r\nOverall it is an enjoyable show that is worth checking out, if you got the time. I do feel that the first season had slightly more punch in it, though.",
            "date": "2018-12-26T09:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 296932,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=296932"
        },
        {
            "content": "When I saw the cover photo of Saik K on Netflix, I thought “what the hell is this…” \r\nThere was some ridiculous pink-haired boy with freaky horn-like antennas sticking of his head. So naturally, I overlooked it, and ended up watching something else at the time. A few months later, a friend recommended “Sakamoto” as something light-hearted and funny to watch. I loved it - it was a show that didn’t take itself too seriously, but still clearly put some thought into its comedy sketches. Then, when that same friend recommended Saik K, I had to take his advice and watch an episode. I washooked immediately. \\n\\n\r\nThe premise of show lend it the ability to be a most masterful comedy. Saiki Kusou has ridiculous physic capabilities (telepathy, teleportation, insane strength, …. the list is practically never-ending). Yet, he is just enrolled in a regular Japanese high school, and he spends his days trying to hide his powers. He navigates through his array of friends, family, and new acquaintances - all with ridiculously personalities. There’s never a dull moment, each episode is packed and entertaining. \\n\\n\r\nMost importantly, you follows his raw thoughts as opposed to pedestrian, scripted anime conversation. You never actually get to hear him speak, and that for me was perhaps the best part of the show. When you watch any other anime, you deduce the personality of the various characters through your interpretation of conversation. But with Saik K, you deduce each situation through the medium of Saiki's thoughts. Since he’s incredibly smart (and even lazy!), there is a fun, unique spin on the slice of life genre giving it hints of self-deprecation, intellectualism, and raw comedic relief. \\n\\n\r\nHis relentless pursuit of a quiet and average lifestyle is a relatively novel concept, and I’m definitely gonna rewatch the whole thing before Season 3 airs.",
            "date": "2018-12-24T18:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 296748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6096051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KingBaloo",
                "username": "KingBaloo"
            },
            "url": "https://myanimelist.net/reviews.php?id=296748"
        },
        {
            "content": "Oh how I love how this anime is getting attention.\r\nI have watched season 1 over and over again because of how much I loved this anime. The moment I knew there was going to be a season 2 made me the happiest person in the world.\r\nThere's not much story which isn't a bad thing because it's mainly for comedy and it does a very great job at it. There is some character development like how Saiki becomes a bit more open to his friends compared to the 1st season.\r\nI can't write reviews well (it is my first) but all I can say is I highlyrecommend you to watch this. It may be very fast paced and hard to understand what's going on but it's funny that way.\\n\r\n(Season 1 wasn't this fast and rushed)",
            "date": "2018-04-22T06:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 278703,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7192828.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rynoceraus",
                "username": "Rynoceraus"
            },
            "url": "https://myanimelist.net/reviews.php?id=278703"
        },
        {
            "content": "This is a short review of the whole series and my first ever review at the same time.\r\n2018 really graced us with so many good comedies! Humor is very subjective but as far as the gag comedy anime series go this one is one of the best. What I love the most about this show are its characters. First season had a great cast and some new characters are added in the second season. Every one of them is unique and funny in their own weird way. (My favorites are Saiki himself and Teruhashi). The show is also full of great recurring characters, well executedgags and constant 4th wall breaking. \\n\r\nThe show's weak spot, as with many comedy anime, is it's story. It is kinda episodic, with some overarching plots, but the show is just so full of heart that even the slower parts are just as enjoyable as the best parts of the show.\\n\r\nThe whole anime is available on Netflix and I wholeheartedly recommend the English dub (Only the 1st season is dubbed though) because it is just so well done and it is easier to follow some of the fast-paced jokes. \\n\r\nGo watch this anime, as it will surely make your day better!",
            "date": "2019-02-22T08:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 302196,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4980716.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/riyuurin",
                "username": "riyuurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=302196"
        },
        {
            "content": "If you enjoyed the last season, you'll love this one as well. If you're new to the series, definitely start with season one. c:\r\nEpisode setup:\r\nEach episode consists of approximately 3-5 *disjoint* short skits. This is a comedy anime, so there is less of a focus on the story, art, and sound, while the jokes can be like gold. With how short and disjoint the skits are, it's honestly impressive that there is even a story. lol\r\nEnjoyment: 10\r\nHumor can be pretty subjective - I personally find the humor in this show beautiful. For reference, other comedies I like include Cromartie High School, Sket Dance, Tanaka-kun waItsumo Kedaruge, and Gekkan Shoujo Nozaki-kun. **Of these, I find Cromartie High School the most similar in humor.\\n\\n\r\nOpening & Ending Songs / Sound: 7\\n\r\nAll of the songs in this anime are jokes really so it's hard to rate on how \"good\" they are. Amusing at the very least.\\n\\n\r\nStory: 9\\n\r\nSomehow there is a plot...and it keeps advancing...again somehow? lol. But yes! The romance continues as more complications ensue. Who will become a couple in the end? Unsure if anyone else is as invested in this aspect as I am. The show can be enjoyed even while ignoring this after all...\\n\\n\r\nAnd ignoring romance for a minute, I think what makes this show work is that while Saiki, the main character repeatedly states that he just wants to be alone, he spends an awful lot of time looking out for his friends, subtly helping them with his super powers to achieve their daily goals and dreams. Perhaps Saiki is a bit of a tsundere in this regard. Anyways, the concept is interesting and the end results are usually satisfying. There are a lot of clever ploys with the setting, so gave a 9 for the story.\\n\\n\r\nArt: 6\\n\r\nThe art is kind of bland. At least I'm not a fan, but it's not to the point where it ruins the show for me. I will mention that between skits there is usually an awesome drawing that beautifies each of the characters. It makes one think, is this even the same character?! Yes, the drawings between the skits are that good in comparison.\\n\\n\r\nCharacters: 8\\n\r\nEach character has one or two distinctive characteristics that actually grow stronger and stronger throughout the series. Mainly since they are the most well-used tools in the author's toolbox for setting up great situations and jokes. Really, the worse the writer makes Teruhashi's personality look, the more I like her lmao.\\n\\n\r\nOverall: 10\\n\r\nFrankly, between the art, sound, and characters, this show is pretty average. But honestly, it does not matter much, since the humor and jokes are what the anime is all about. This show is especially great for when wanting a quick bite of humor without having to sit through a whole 30-minute episode of an anime. Definitely highly recommended! :)",
            "date": "2018-07-04T10:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 282971,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2066291.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/taptothebeat",
                "username": "taptothebeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=282971"
        },
        {
            "content": "Story 8/10 \r\nThere isn't a real long story arc in Saiki, but that doesn't mean that every 4 minute skit is in its own bubble. Previous episodes are often mentioned, and we even have some series of linked skits. The fourth wall is often broken, and Saiki himself or other characters comment on the flaws of the show. I gave the story an 8 because there might not be a mindblowing storyline, but it is not needed in this type of anime. The skits are witty and funny, and the enjoyment is at its best. \r\nArt style 7/10 \r\nThe art style is good, especially inthis season, compared to the first one, but it still lacks in special effects. Honestly though, this art style is perfect for the type of anime Saiki is. \\n\\n\r\nCharacter: 10/10 \\n\\n\r\nThe characters are the best part of the show in my opinion. The characters Make the show. They are stereotyped but they are never boring, and learning each character's personality is a treat. You learn to love almost all of them, episode by episode, the characters they get more and more interesting and entartaining to watch. The relationships between the characters are the core of the show, how Saiki pretends to be bored and annoyed by them and yet hangs out with them and they are all great friends. Whenever a new transfer student comes in, the dynamic is shaken, and things get even more interesting. \\n\\n\r\nEnjoyment: 10/10 \\n\\n\r\nI can freely say I can laugh, wholeheartedly, at every skit. Saiki, as well as his peculiar group of friends, never cease to amuse me. \\n\\n\r\nOverall 9/10 \\n\\n\r\nThis a plea because Saiki is so unpopular but also genuine advice: WATCH SAIKI NOW. START BY SEASON 1 AND THE REWARD WILL BE AMAZING.",
            "date": "2018-05-26T05:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 281406,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6145130.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/clarimasu",
                "username": "clarimasu"
            },
            "url": "https://myanimelist.net/reviews.php?id=281406"
        },
        {
            "content": "The beginning is favorable and the episodes so far are also great but it could get boring if the creators won't find a new and enjoyable theme for an episode. \r\nThe characters aren't too annoying and they all have funny moments that are memorable in their own way.\r\nAnd the episodes are played  in a fast pace which i like because you can fit more story/jokes in to one episode. Unlike some anime that are slow paced and have a slow story.\r\nOverall the series is great and i'm looking forward for new episodes and what the new themes will be.",
            "date": "2018-04-13T05:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 277946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6481376.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Neduxas",
                "username": "Neduxas"
            },
            "url": "https://myanimelist.net/reviews.php?id=277946"
        }
    ],
    [
        {
            "content": "I saw One Punch Man trice and bought the bluray. I saw Mob Psycho 100, not 100 times, but twice. While I love both of these shows, I love Saiki more. When I heard it would be getting season 02 before either of these two shows (which are -according to sales and popularity rankings- 5 to 20 times more successful than Saiki), I naturally started pinching myself to wake up from this beautiful, yet unreal dream. When this didn't happen, I had to assume they have started to celebrate April's Fools twice a year. I headed to my closest Reddit where people have the habitof repeating everything they hear and read as facts, but didn't see anyone mention April's Fools. This gave me no other option but to believe there lives a \"Saiki\" inside our very own universe, something has gone terribly wrong with him and now the whole structure of the very reality is shaking. After recovering from the panic, I realized only two things can happen a) the world will end b) season 02 will really air. As we can conclude, there was no cons in this situation.\\n\\n\r\nThe adventures of Saiki continue with an epic start where he watched the anime \"Gintama\" from tv and wonders what type of shitty excuse for a comedy that series is. My man. In all honesty, the beginning of this season was not the greatest thing. The series felt more or less like S01 with the same content, but now missing the fresh and new feel the series had. This got quickly fixed (in episode 6) by the author who started introducing new characters (such as the officially best girl) but also started strengthening the already existing cast members. Instead of expanding our series with side tracking plots and new comedy elements, mr. author keeps giving us details and adding substance to his characters, not only developing their humor but also creating depth to the comedy. And this way, mr. author gave us a sequel which was better than its prequel. If decisions as good as this were always made, I would never have to write negative reviews.\\n\\n\r\nMy favorite part of this series is how brotherly and manly Saiki is from its humor to its characters. Aibro (Riki) is the perfect comedic delinquent and a total badass. I am not even sure what makes his character so great. Is it how many fucks he gives (forgetting how to get to school every day despite living right next to it) or how awe-inspiring and cool he is in any and every situation. Shining Kokomi, on the other hand, corners Saiki the hardest. Scenes where she gets like 500 people (including the FBI) search for Saiki are both written and executed with such brilliance that you won't never find this sort of unique comedy anywhere else. Overall the cast is just incredibly strong and unique. There are in total of 10 characters (other than Saiki) who have their important role in the series when it comes to Saiki's life and the comedy. Everyone of them is memorable and adds to the series. Not a single one of them is annoying. Rather, I personally welcome comedy moments surrounding any of them -- which is beyond rare for myself.\\n\\n\r\nLike all comedies, Saiki is exactly as fun as the viewer who is watching it. The comedy is very direct and executed in 3 different ways: character-centric personality tweaks which deliver the more you are into the characters (the amount of detail and characteristics that add to the comedy is insane), visual in forms of silly animation (such as simplistic character introduction scene where one bro starts rolling in the scene like he is just drawn on a piece of paper - which he obviously was), and most of all in the forms of sitcom where the series corners itself with some sort of problems that are presented as a situation comedy. The comedy is original, but also parodying great many things from other anime series to common cliches. The best part of the comedy is how random it often starts and how unpredictable it ends up being, but at the same time uses the same elements that are already familiar to all its viewers and unique to Saiki the anime. Still, remaining subtle and never, not even once pushed in your face. This is the type of comedy that constantly rewards its viewers and respects the audience. For example, during one TV channel surfing scene, Saiki himself comes across people who we see in his daily life all the time. His parents are giving an interview, some dude stuck in other channel's background image, and Aibro taking part to the Japanese version of the TV show, Who Wants to Be a Millionaire (without even knowing what the show is about because he just doesn't give a fuck, just like he never does). Every single thing from the 3 different TV programs to Saiki's live reaction to it all, are pure brilliance. \\n\\n\r\nOverall. Saiki relies on badass comedy and bro situations which automatically mean that the series is highly appealing to myself. On top of that, Saiki's cast is among the most strong and memorable I have seen in any comedy anime. The only comedy series which I can say has achieved more in terms of characters is 'Cromartie', but it was also too short to be perfect. The author of Saiki is incredibly self-aware and has a clear vision of what this series should be about. As a conclusion: This season will not please all viewers, but it has done perfect job being exactly as good as it could realistically ever be. Season 03 when.",
            "date": "2018-06-26T10:14:00+00:00",
            "helpful_count": 101,
            "mal_id": 282282,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282282"
        },
        {
            "content": "Saiki's adventures continue for 24 more episodes, and they are somehow even better than before. I will keep this review short since I already have one posted here for the first season discussing the strengths of the series, which definitely stay relevant in this sequel.\r\nThis second season adds more spice to the comedy with the introduction of new characters, that as expected from the series are really fun to watch, likeable, and lead to new character interactions that never fail to make the viewer laugh, this can easily be seen in shorts where Saiki is mostly just hiding around and one still loses it byseeing the others be the way they are.\\n\\n\r\nThe art took an upgrade that makes the series better looking, and it's used nicely with some priceless reaction faces from the characters and is overall more visually pleasing. The music is pretty much the same, but the new set of openings and endings from the series are fantastic, especially during the second cour where sometimes I spent more time looping them than watching the episode itself.\\n\\n\r\nSaiki Kusuo no Ψ-nan is no longer just a hidden gem, to me this season confirmed it as a must watch anime for any fan of the comedy genre and a fantastic option for anyone who isn't to find a series that might change their mind. I really can't recommend it enough.\\n",
            "date": "2018-07-01T10:58:00+00:00",
            "helpful_count": 46,
            "mal_id": 282705,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759794.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetaThPr4h",
                "username": "MetaThPr4h"
            },
            "url": "https://myanimelist.net/reviews.php?id=282705"
        },
        {
            "content": "TBH I have been really waiting in eager  for this anime to come out exactly one year. Why?\r\nBecause the 1st season of Saiki Kusuo no Psi Nan is really funny as hell, kinda the same as nichijou or gintama level comedy.\r\nThis is the series that i still like and read in shounen jump, after i drop almost all shounen series as i feel they are too childish now. Too bad the Saiki Kusuo manga ends this March 2017 though, but anyway I have read so far in the saiki kusuo manga that i can guarantee you the story in Saiki Kusuo season 2 isstill as funny and as good as season 1. \\n\\n\r\nWell, let's stop the rant and start the review:\\n\\n\r\nSTORY:\\n\r\nThe story continues the 1st season, so i really recommend and urge anyone who want to watch this show to finish the 1st season first in order to reconize the characters . Anyway, the story is still about Saiki Kusuo, an OP psychic that just want to have a peace common life, but always get disturbed somehow, either because of his family or his school friends.\\n\\n\r\nThe promise is really simple. But what makes this anime shine is because of the comedy from the situation occured and how the characters handle it.\\n\\n\r\nOh, and in season 1 the show is actually 5 minutes long per episode, but in this season 2 the show is 24 minutes long, consist of 4 separates stories that sometimes connected.\\n\\n\r\nCHARACTERS:\\n\r\nWell, here are what makes this anime so great. Because it has so many peculiar/interesting characters. Aside from the unique characters from 1st season, such as Nendou the aho, Kaido the chuuni, and Teruhashi the perfect bishoujo, in this season 2 it will introduce several new characters: \\n\\n\r\nAiura Mikoto (a real fortune teller, that become Teruhashi real rival to get saiki's love), Rifuta Imu (just another Teruhashi rival who wants to be the most popular), Satou Hiroshi (a perfect normal guy that saiki idolized and obsessed with), and Akechi Touma (Saiki's childhood friend who wants to prove that saiki is a real psychic).\\n\\n\r\nWell, some people and even i might complain that it was a bit forced to introduce a new characters to the show, maybe because of the auhor lacks the inspiration to make a funny plot based on existing characters. But, i just put it aside, as long as the show still funny and the characters will stay in the show and not just somehow disappear, I won't give any complain.\\n\\n\r\nFor the characters, based on manga that i have read, Aiura Mikoto will be one of my favorite characters in this season 2. At first, I have a bit negative thinking about her, as i kinda dislike Gyaru type girl, but after more story revealed, i won't spoil it for you, but she actually deserve to be Teruhashi real rival to get saiki's love.\\n\\n\\n\r\nSOUND and ANIMATION: well, i never decide to like or give score to an anime based on these, as i watch fo the story and characters.\\n\r\nBut for sound, I actually kinda hate the OP song as there is characters dialogue inside it that made it really weird and can't be enjoyed, the ED song is okay though. \\n\r\nFor the animation, i dont think this anime is any special but I dont have any complain with the story animation, instead i have complain about the title sequence background as it made me cringe so bad with the bishounen theme, especially the bishounen nendou.\\n\\n\\n\r\nENJOYMENT: well, i come to watch the anime for pure enjoyment and finish satisfied. Based on 1st season, this show really nailed in the comedy aspect. I always laugh in each episodes. I always finish the anime smiling, and cannot wait to see the next episode.\\n\\n\r\nOVERALL: This is one of the best anime in comedy genre. And for me it is even better than gintama in some aspects.\\n\\n\r\nOther than this show isnt too vulgar as gintama, what makes this anime better than gintama is how Saiki Kusuo ends the plot story without always become a boring action and tearjerker. In gintama formula always start the plot with so much comedy, but it usually always ends it with something sad/bad happen and end with gintoki saves the day with his cringy shounen plot armored action, which usually i always just skipped over, as i come to watch the anime for the laugh and not the melancholy. And this anime is so much better than gintama in this aspect.\\n\\n\r\nAnyway, thanks for reading my review. Leave the comment in my profile, or maybe send a friend request if you agree with my review.",
            "date": "2018-02-26T12:00:00+00:00",
            "helpful_count": 25,
            "mal_id": 272507,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4580589.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lswarmruler",
                "username": "lswarmruler"
            },
            "url": "https://myanimelist.net/reviews.php?id=272507"
        },
        {
            "content": "*Minimum Spoiler Ψ-nan Review*\r\nIf you did not watch S1 then go watch it ASAP or don't. \r\nTL;DR: Having psychic power was never easy but laughing at the misfortune of Saiki is definitely GGEZ.\r\nBigger cast, more budget, same humour but now more fan service... For guys & girls. Don't think just watch.\r\n[Story: 7/10 , Characters: 9/10, Art: 6/10, Sound: 7/10, Enjoyment: 9/10]\r\n\"It's true there are no anger or sadness, but that also means no joy or fun. That's my life.\" - Saiki Kusuo\r\nWhat do you get if you throw in the humour style of OPM, MP 100 and Sakamoto Desu Ka in a pot then simmerit with the same recipe Gintama used to gain popularity in the comedy genre arena of anime? You get Saiki Kusuo no Ψ-nan Part 2 of course. There was no doubt this anime short was a success in their inaugural first season but to live up to the expectation in their second season was hard but they made it look super easy. How? They just didn't stray from their recipe that made them successful. By having  good clean albeit raunchy slap stick quid pro quo comedy, often times with relevant memes to crush other wannabe anime shorts' dreams, helped solidify their standing as the best comedy anime short this year.     \\n\\n\r\nThe story picks up from where it left off last season but realistically this anime doesn't really have a linear story to follow. Each episode is composed of 4 mini shorts of 5 minutes that follows a linear story line. Sometimes they are related, often times they are not. But who cares. You are here to hear comedy not pull your hair chasing hares in story inconsistency. So just shut up, grab your buddies and engage in a good laugh. Heck you could even watch it alone and you would still be rolling on the floor laughing while doing the helicopter. Needless to say, the story always moves forward and that's all you need to know. Some of the shorts were a bit weak & forced but given the material at hand, you can only do so much. Be happy that this will be a complete manga adaptation as the manga also ended. \\n\\n\r\n\"My grades, appearance... Everything about me is average. I was born average and I will die average. That's my life\" - Sawakita\\n\\n\r\nThe best part about Ψ-nan, aside from their comedy, is the gregarious melting pot of their giant cast. Aside from the main 4, Saiki, Kaidou, Nendou & Teruhashi, this season we were introduced to an even greater range of cast. Luckily, each of these characters managed to stand out from one another with their unique character design and outlandish personality. Heck even the most average character in this anime managed to be above average in their character development. This is what makes this show so great to watch. Their character development for supporting cast does so much in 5 minutes that other shows can't even do in 4 bloody long hours. It was always fun seeing them return in various shorts and you started to develop attachment to these characters. The dialogues as well as the seiyuus that voiced these characters went above and beyond in each episode to really drive home their greatness. Who knew the voice of shitty Shinji would actually be this awesome. Great job all around. \\n\\n\r\n\"Life is in very easy mode. This is all because I am gorgeous. \" - Teruhashi Kokomi\\n\\n\r\nAside from their dynamic linear plot and outlandish characters, this show puts in their due diligence when it comes to animation. It's a comedy anime short, not some Ufotable level Battle Royale. At least no pans and zooms and the panels are hand drawn for better animation quality. The studio put in effort and they were rewarded with a huge fandom. Plenty of fanservice was weaved into each episode but it didn't derail the anime from it's roots, it only propelled it. Beside their animation quality, the background score went really well with the anime. A good comedy show really needs to get their music timing on point and this show did just that. Although the OP and ED songs weren't as appealing to me personally but others might think otherwise. I preferred the season 1 OP and ED songs more than this season's.  \\n\\n\r\n\"Fortune telling is just an illusion created by a bunch of people who pretend to be prophets\" - Kaidou Shun \\n\\n\r\nOverall, Saiki Kusuo no Ψ-nan 2 is a satirical school comedy anime short that parodies the known anime tropes that's overused in our anime industry atm. Their main purpose is to provide comedy and with great effort from their staff, they are able to establish just that with their outlandish cast of misfit characters. If you are in need of a laugh, I would recommend starting from first season. If you are lazy and want to watch this season, you can do that. If you are still in doubt, just pick a random episode out of the hat and watch one. What do you have to lose but your funny bone, am I right? I would not recommend the Live TV adaptation because some things are just better in their animated format. Also, this is the last season. Very rarely do we get full manga adaptation and it is truly a gift to cherish. I know I will miss watching this anime. Hopefully some OVAs come out for the chapters that didn't get animated. Anyways, check it out & let me know later how you like it as well as share with me your favourite quote from the anime! Ciao.\\n\\n\r\nP.S. Thank you for reading. I hope you found this short and supaishi review helpful!",
            "date": "2018-07-01T11:44:00+00:00",
            "helpful_count": 17,
            "mal_id": 282710,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3743707.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarthInvader",
                "username": "DarthInvader"
            },
            "url": "https://myanimelist.net/reviews.php?id=282710"
        },
        {
            "content": "Just another average day for Kusuo Saiki...\r\nOk, so the second season of Saiki Kusuo no Ψ-nan 2 and this second season was kept to the 24 minute structure and clumping the skits together, which was how LA didn't watch it from the first season's 3 minute 120 episode structure but nonetheless LA adapted to it and well, let's just say the experience in watching the 24 minute structure was like a verbal speeding train of quick witted dialogue, comedic timing and unpredictability just like the first season...so another words same old Saiki Kusuo no Ψ-nan but in chunks of funny.\r\nLA have soo much to unpackSaiki Kusuo no Ψ-nan 2 so let's start off with the new characters, for starters how about Mikoto Aiura voiced by Eri Kitamura, a fortune teller that figures out Siaki's secret of being a psychic and becomes something of a love rival not-so to Kokomi but for the most part she's in friendly terms with Saiki or when Saiki needs her help, LA really liked her inclusion and made the interactions with both Saiki and non-direct interactions concerning Kokomi all the more interesting..at least it was a bit better that Chiyo..but her a bit later. Next would be Imu Rifuta voiced by M.A.O who like Mikoto becomes a rival towards Kokomi however unlike Mikoto, she becomes OBSESSED with Kokomi and even becomes her winggirl, once again becomes of her satellite character status to Kokomi she does make good quips at times but still she was a fine addition. Metori Saiko voiced by Masaya Matsukaze is the typical narcissistic rich boy with little common sense about the real world and how it works besides him trying to throw money at it, he does get an arc involving an isolated island and LA was meh in his inclusion. Lastly would be Touma Akechi voiced by Yuki Kaji, an utter blabbermouth and talkative as all hell character that is always suspicious of Saiki if he's a psychic or not and considering his \"trait\", you kinda see why Saiki wants to not allow him know about him being a psychic which oddly enough Touma as much of an annoyance of a character he is, his development into the cast was rocky and interesting to say the least. There were tons of other minor characters in the bunch so let's continue with the old character development...\\n\\n\r\nNendou is same as ever...\\n\\n\r\nShun Kaidou had a romance subplot with Chiyo and LA didn't like...as in Chiyo's development and screentime wasn't as good as LA thought...which is why LA kinda shifted to Kokomi through this season...\\n\\n\r\nAren and Kineshi is the same as ever...\\n\\n\r\nChisato Mera voiced by Maaya Uchida showed her true self though she was the typical poor character and got development this season about her father and how she got poor in the first place, but throughout this season if a character was flanderized like hell it was Chisato and she easily become unlikable as to how greedy she is both in food and basic needs and showing her self-centered personality...\\n\\n\r\nKuusuke Saiki is the same trolling brother to Saki as ever...\\n\\n\r\nReita Toritsuka voiced by Natsuki Hanae is the same as ever...though now he hangs around Mikoto because of their retroactive knowledge about Saiki...\\n\\n\r\nWell lots of old character stuff happened...\\n\\n\r\nand lots of plot stuff happened...\\n\\n\r\nIn the sense we get to know more of Saiki's powers and his odd time loop and time travel tidbits about him and on speaking of Saiki's powers, Saiki Kusuo no Ψ-nan 2 shows once again that Saiki does once again care for his friends and family just in subtle ways and that his powers doesn't always solve everything.\\n\\n\r\nSaiki Kusuo no Ψ-nan 2's comedic timing and comedy is general is the same as ever...like the quick witted nature of Saiki Kusuo no Ψ-nan in general which LA already explained from LA's first season review and even in a 24 minute structure still keeps the skit's momentum going which again feels like a verbal speeding train because of the structure and LA is fine with it...even if the comedic skits hits LA like a truck and is funny at the same time. In summation,  Saiki Kusuo no Ψ-nan 2's keeps up it's comedic nature from the first season right down to the breaking fourth wall and character jabbing and comedic timing in general.\\n\\n\r\nAnimation once again done by JC Staff and Egg Firm is the same as always thus not much to talk about but the craziness that Saiki Kusuo no Ψ-nan 2 is with decent character designs, background work and breaking the fourth wall jokes. JC Staff and Egg Firm did it again!\\n\\n\r\nVoice acting, well the entire cast did great but LA will now probably give props to Ai Kayano as Kokomi as well as regular fast talker Hiroshi Kamiya but to Eri Kitamura as Mikoto as well. With how the anime's fast nature is like, it's expected the entire voice cast to have sped up dialogue and that once again, LA needs to say that the entire cast kept to this (well cept Nendou's voice actor Daisuke Ono though not all the time). Just huge props to the voice cast nonetheless.\\n\\n\r\nSaiki Kusuo no Ψ-nan 2 is just like the first season just with newer characters and older character developing for the best...or worse and both the old and new character mingling together was great in terms of character interactions and in turn it's comedic pay off. LA really doesn't need to say that Saiki Kusuo no Ψ-nan 2 might as well took LA's favourite comedy anime for Winter 2018  as it took a the first season and only improved with it even with the addition of new characters and  subtly developing Saiki along the way and by all means Saiki Kusuo no Ψ-nan doesn't feel like it's losing steam any time soon considering what the final episode is to hinted at. \\n\\n\r\nSaiki Kusuo no Ψ-nan 2 is like a verbal speeding train of comedy and it just comes at ya...ohh and if you haven't noticed but...\\n\\n\r\nLA is sorry but Chiyo is annoying and stale now, LA is going to the goddess that is Kokomi as favourite character in Saiki Kusuo no Ψ-nan 2.\\n\\n\r\nOh!",
            "date": "2018-07-01T16:11:00+00:00",
            "helpful_count": 16,
            "mal_id": 282737,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=282737"
        },
        {
            "content": "There is a video on Youtube of Digibro talking about the raving popularity of anime in the 90s, and how Americans would smuggle VHS into the country and secretly distribute them because the quality is so great. He talks about how we have lowered standards for rehashed trash, how we ignore terrible CG crowds and exposition dumps, that anime is going downhill, except in one section:\r\nComedy.\r\nThis show is the embodiment of the essence of doing anime right. The first season was low budget, but the spirit and comedic power was driving this show to greater heights.\r\nIn this season, they upped the budget seemingly significantly, andyet retained the full essence that made the first season so great. Now we have full, completely unnecessary sakuga intros, highly animated faces, ultra quality sound production, all with the same greatness as before.\\n\\n\r\nThe story gets better and better, and while I can't say I've read the source material, I love the character arcs and the overall world arcs; the characters are being developed excellently, and the characters being introduced are becoming mainstays in the cast that feel completely irreplaceable. \\n\\n\r\nComedy, like Saiki, is the primary element that quality anime is continually being produced, and I am glad to say that Saiki Kusuo is among the greats.",
            "date": "2018-04-23T11:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 278808,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1968888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Crimefridge",
                "username": "Crimefridge"
            },
            "url": "https://myanimelist.net/reviews.php?id=278808"
        },
        {
            "content": "It is rare that I find a show that I love so dearly. It is even more rare that a sequel of it comes out. Saiki Kusuo no Ψ-nan 2 is that sequel. This show is about a psychic high school age boy named Saiki Kusuo. Saiki has various powers, including teleportation, telepathy, telekinesis, pyrokinesis, x-ray vision, and a plethora more without even scratching the surface of his powers. Even with having all these powers, Saiki only wants a normal life. But, the various characters around him lets him find himself in situations where his normal life would be in jeopardy.\r\n\tThis is easily one ofthe most underrated anime in the west. Imagine Mob Psycho 100, but all of the drama and story has been cut, and it's a gag anime. Saiki K is a slice of life, shounen anime, with the manga being published in Shonen jump. It’s been 2 years since the first season came out, which I severely underrated myself. But after an amount of time, once the second season aired, I realized what I had missed all that time.\\n\r\n\tIn the first season, I took the wonderful characters for granted. I was so glad when they came back. I missed them, in a sense. The jokes come fast and quick. After one joke you laugh, and once the next joke rolls around you’re still recovering from the last one. It's a hilarious and character driven ride that you won’t regret watching. The animation is nothing to look at, but its not necessary to make this a good experience. The art is also nothing special, but the character designs are top tier and recognizable. Both the OP’s for this season are fun and ridiculously catchy.\\n\r\n\tI recommend this show for everyone and anyone with access to this show. I give this show a 10 out of 10. This has been PixEFit’s spoiler free, but not really review on Saiki Kusuo no Ψ-nan 2.\\n",
            "date": "2018-07-01T22:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 282748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=282748"
        },
        {
            "content": "First of all, in my opinion this anime generally is not for people who just recently started watching anime (as a whole), because it has some parodies to other anime and it requires fast reading the sub (or pausing it for lots of time to read the subtitle). So if you're ok with that, give it a go! This is also a gag anime so it shouldn't be taken seriously. And it loves breaking the 4th wall just like Gintama (but i think Gintama does it more frequently)\r\nBtw, this is my first ever review in MAL and I'm not that good of making reviews. Basically,this is a sequal to the first season of Saiki Kusuo, but with added characters and more character developement (as what I see). So if you want a full review of this anime, check out the first seasons' reviews.\\n\\n\r\nIf you like something like sakamoto desu ga? (which I also love) then you'll basically would love this anime coz both of the MCs are OP in there perspective series in a humourous way. I personally love Saiki Kusuo a lot, coz how he has psychic powers that makes him look OP, but in the same time he loses the will to be a normal person (stated in the first season), i feel that reason makes this anime a unique one that differs to a lot of comedy animes as a whole. This is one of the few comedy/school/slice of life anime that made me laugh so hard.\\n\\n\r\nLong story short: this is an upgrade of the first season. If you love the first season, you'll definitely love the second one for sure\\n\\n\r\nP/S: Nendou needs more love. I slightly love the first season more coz it has more Nendou screen time\\n\\n\r\nThis is my favorite comedy anime along with Gintama and Sakamoto Desu Ga?\\n\\n\r\nStory: 8/10, Art: 8/10, Characters: 9/10, Enjoyment 9/10\\n\\n\r\nUsually I rate the comedy animes by how hard I laugh and lovable characters",
            "date": "2018-07-01T16:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 282735,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6055324.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Amin-kun",
                "username": "Amin-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=282735"
        },
        {
            "content": "This is largely the same deal as the first season. Meaning gag comedy, with multiple short episodes crammed into one anime episodes. \r\nSummary:\r\nStory 6/10\r\nArt: 5/10\r\nSound: 6/10\r\nCharacter: 6/10\r\nEnjoyment: 6/10\r\nOverall: 6/10.\r\nCompared to first episode one thing that I noticed is that intro and outro music became better, however, I felt like the show become slightly weaker compared to the 1st season, and I felt like animation quality dropped slightly.\r\nMeaning 6/10 instad 7/10 total this time aropund. One of the reasons for that is probably the fact that they introduced huge number of characters, and because now there are \"multi-episode\" mini arcs. Those lack the pace of shortstories of the first season and as a result felt less entertaining to me.\\n\\n\r\nIn general:\\n\r\nThe story is a gag comedy, and is generlaly well done/interesing to watch.\\n\\n\r\nThe art is clean and basic, in few places near the end the quality gets reduced, but it does its job. If i were to compare it with anything, I\"d compare it with \"Ane Log\". \\n\\n\r\nVoice actors really breathe life into the series, and make characters more entertaining. I checked out the manga after the anime, and manga had less impact for me.\\n\\n\r\nSpeaking of which, the adaptation is very faithful to the original and barely misses an episode.\\n\\n\r\nOverall it is an enjoyable show that is worth checking out, if you got the time. I do feel that the first season had slightly more punch in it, though.",
            "date": "2018-12-26T09:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 296932,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=296932"
        },
        {
            "content": "When I saw the cover photo of Saik K on Netflix, I thought “what the hell is this…” \r\nThere was some ridiculous pink-haired boy with freaky horn-like antennas sticking of his head. So naturally, I overlooked it, and ended up watching something else at the time. A few months later, a friend recommended “Sakamoto” as something light-hearted and funny to watch. I loved it - it was a show that didn’t take itself too seriously, but still clearly put some thought into its comedy sketches. Then, when that same friend recommended Saik K, I had to take his advice and watch an episode. I washooked immediately. \\n\\n\r\nThe premise of show lend it the ability to be a most masterful comedy. Saiki Kusou has ridiculous physic capabilities (telepathy, teleportation, insane strength, …. the list is practically never-ending). Yet, he is just enrolled in a regular Japanese high school, and he spends his days trying to hide his powers. He navigates through his array of friends, family, and new acquaintances - all with ridiculously personalities. There’s never a dull moment, each episode is packed and entertaining. \\n\\n\r\nMost importantly, you follows his raw thoughts as opposed to pedestrian, scripted anime conversation. You never actually get to hear him speak, and that for me was perhaps the best part of the show. When you watch any other anime, you deduce the personality of the various characters through your interpretation of conversation. But with Saik K, you deduce each situation through the medium of Saiki's thoughts. Since he’s incredibly smart (and even lazy!), there is a fun, unique spin on the slice of life genre giving it hints of self-deprecation, intellectualism, and raw comedic relief. \\n\\n\r\nHis relentless pursuit of a quiet and average lifestyle is a relatively novel concept, and I’m definitely gonna rewatch the whole thing before Season 3 airs.",
            "date": "2018-12-24T18:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 296748,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6096051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KingBaloo",
                "username": "KingBaloo"
            },
            "url": "https://myanimelist.net/reviews.php?id=296748"
        },
        {
            "content": "Oh how I love how this anime is getting attention.\r\nI have watched season 1 over and over again because of how much I loved this anime. The moment I knew there was going to be a season 2 made me the happiest person in the world.\r\nThere's not much story which isn't a bad thing because it's mainly for comedy and it does a very great job at it. There is some character development like how Saiki becomes a bit more open to his friends compared to the 1st season.\r\nI can't write reviews well (it is my first) but all I can say is I highlyrecommend you to watch this. It may be very fast paced and hard to understand what's going on but it's funny that way.\\n\r\n(Season 1 wasn't this fast and rushed)",
            "date": "2018-04-22T06:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 278703,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7192828.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rynoceraus",
                "username": "Rynoceraus"
            },
            "url": "https://myanimelist.net/reviews.php?id=278703"
        },
        {
            "content": "This is a short review of the whole series and my first ever review at the same time.\r\n2018 really graced us with so many good comedies! Humor is very subjective but as far as the gag comedy anime series go this one is one of the best. What I love the most about this show are its characters. First season had a great cast and some new characters are added in the second season. Every one of them is unique and funny in their own weird way. (My favorites are Saiki himself and Teruhashi). The show is also full of great recurring characters, well executedgags and constant 4th wall breaking. \\n\r\nThe show's weak spot, as with many comedy anime, is it's story. It is kinda episodic, with some overarching plots, but the show is just so full of heart that even the slower parts are just as enjoyable as the best parts of the show.\\n\r\nThe whole anime is available on Netflix and I wholeheartedly recommend the English dub (Only the 1st season is dubbed though) because it is just so well done and it is easier to follow some of the fast-paced jokes. \\n\r\nGo watch this anime, as it will surely make your day better!",
            "date": "2019-02-22T08:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 302196,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4980716.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/riyuurin",
                "username": "riyuurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=302196"
        },
        {
            "content": "If you enjoyed the last season, you'll love this one as well. If you're new to the series, definitely start with season one. c:\r\nEpisode setup:\r\nEach episode consists of approximately 3-5 *disjoint* short skits. This is a comedy anime, so there is less of a focus on the story, art, and sound, while the jokes can be like gold. With how short and disjoint the skits are, it's honestly impressive that there is even a story. lol\r\nEnjoyment: 10\r\nHumor can be pretty subjective - I personally find the humor in this show beautiful. For reference, other comedies I like include Cromartie High School, Sket Dance, Tanaka-kun waItsumo Kedaruge, and Gekkan Shoujo Nozaki-kun. **Of these, I find Cromartie High School the most similar in humor.\\n\\n\r\nOpening & Ending Songs / Sound: 7\\n\r\nAll of the songs in this anime are jokes really so it's hard to rate on how \"good\" they are. Amusing at the very least.\\n\\n\r\nStory: 9\\n\r\nSomehow there is a plot...and it keeps advancing...again somehow? lol. But yes! The romance continues as more complications ensue. Who will become a couple in the end? Unsure if anyone else is as invested in this aspect as I am. The show can be enjoyed even while ignoring this after all...\\n\\n\r\nAnd ignoring romance for a minute, I think what makes this show work is that while Saiki, the main character repeatedly states that he just wants to be alone, he spends an awful lot of time looking out for his friends, subtly helping them with his super powers to achieve their daily goals and dreams. Perhaps Saiki is a bit of a tsundere in this regard. Anyways, the concept is interesting and the end results are usually satisfying. There are a lot of clever ploys with the setting, so gave a 9 for the story.\\n\\n\r\nArt: 6\\n\r\nThe art is kind of bland. At least I'm not a fan, but it's not to the point where it ruins the show for me. I will mention that between skits there is usually an awesome drawing that beautifies each of the characters. It makes one think, is this even the same character?! Yes, the drawings between the skits are that good in comparison.\\n\\n\r\nCharacters: 8\\n\r\nEach character has one or two distinctive characteristics that actually grow stronger and stronger throughout the series. Mainly since they are the most well-used tools in the author's toolbox for setting up great situations and jokes. Really, the worse the writer makes Teruhashi's personality look, the more I like her lmao.\\n\\n\r\nOverall: 10\\n\r\nFrankly, between the art, sound, and characters, this show is pretty average. But honestly, it does not matter much, since the humor and jokes are what the anime is all about. This show is especially great for when wanting a quick bite of humor without having to sit through a whole 30-minute episode of an anime. Definitely highly recommended! :)",
            "date": "2018-07-04T10:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 282971,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2066291.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/taptothebeat",
                "username": "taptothebeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=282971"
        },
        {
            "content": "Story 8/10 \r\nThere isn't a real long story arc in Saiki, but that doesn't mean that every 4 minute skit is in its own bubble. Previous episodes are often mentioned, and we even have some series of linked skits. The fourth wall is often broken, and Saiki himself or other characters comment on the flaws of the show. I gave the story an 8 because there might not be a mindblowing storyline, but it is not needed in this type of anime. The skits are witty and funny, and the enjoyment is at its best. \r\nArt style 7/10 \r\nThe art style is good, especially inthis season, compared to the first one, but it still lacks in special effects. Honestly though, this art style is perfect for the type of anime Saiki is. \\n\\n\r\nCharacter: 10/10 \\n\\n\r\nThe characters are the best part of the show in my opinion. The characters Make the show. They are stereotyped but they are never boring, and learning each character's personality is a treat. You learn to love almost all of them, episode by episode, the characters they get more and more interesting and entartaining to watch. The relationships between the characters are the core of the show, how Saiki pretends to be bored and annoyed by them and yet hangs out with them and they are all great friends. Whenever a new transfer student comes in, the dynamic is shaken, and things get even more interesting. \\n\\n\r\nEnjoyment: 10/10 \\n\\n\r\nI can freely say I can laugh, wholeheartedly, at every skit. Saiki, as well as his peculiar group of friends, never cease to amuse me. \\n\\n\r\nOverall 9/10 \\n\\n\r\nThis a plea because Saiki is so unpopular but also genuine advice: WATCH SAIKI NOW. START BY SEASON 1 AND THE REWARD WILL BE AMAZING.",
            "date": "2018-05-26T05:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 281406,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6145130.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/clarimasu",
                "username": "clarimasu"
            },
            "url": "https://myanimelist.net/reviews.php?id=281406"
        },
        {
            "content": "The beginning is favorable and the episodes so far are also great but it could get boring if the creators won't find a new and enjoyable theme for an episode. \r\nThe characters aren't too annoying and they all have funny moments that are memorable in their own way.\r\nAnd the episodes are played  in a fast pace which i like because you can fit more story/jokes in to one episode. Unlike some anime that are slow paced and have a slow story.\r\nOverall the series is great and i'm looking forward for new episodes and what the new themes will be.",
            "date": "2018-04-13T05:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 277946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6481376.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Neduxas",
                "username": "Neduxas"
            },
            "url": "https://myanimelist.net/reviews.php?id=277946"
        }
    ]
]