[
    [
        {
            "content": "Popular media tends to reflect the urban and suburban lifestyle. The life of the farmer has been nearly forgotten, and with the rise of technology, agriculture is often treated as a thing of the past. While we do not normally think about the meat and vegetables sitting in our fridge, the life we know might cease to exist if these everyday products were suddenly taken away from us. \r\nSilver Spoon (known in rōmaji as \"Gin no Saji\") may serve as a reminder of what is taken for granted, but it also happens to be a highly enjoyable experience in its own right. It shows whya simple, tangible story is often more effective than one involving superpowers and end-of-the-world scenarios. There is little here that we couldn't find in our own lives, and that's precisely why it works. Silver Spoon shows there is beauty in an unremarkable life.\\n\\n\r\n\"Beauty\", perhaps, is not something that would normally be attributed to the handling of manure and the slaughtering of livestock. But Silver Spoon shows these issues under a different perspective. The farmers who let their livestock visit the slaughterhouse are not necessarily the heartless creatures the PETA tends to colour them as. More often, the farmers care for their animals; when they are given no choice but to send one of their pigs or horses to the slaughterhouse, the farmer feels regret. But they understand. They know that not every creature can be blessed with a long and happy life. There is a sort of bittersweet irony to human nature, and the protagonist, Hachiken, eventually grows to understand by the end of the story: things are not always black-or-white. A grey or a silver is maybe the most common. \\n\\n\r\nSilver Spoon is not preachy with its themes. It does not proselytise or portray farmers as saints. There is a strong sense of maturity and realism to the story, and often these themes are presented with light-hearted humour rather than excessive drama. The audience is never forced to feel a certain way; they don't even need to think about the themes if they would rather not. There is certainly a deeper meaning within Silver Spoon, but as simple entertainment it succeeds just as well. \\n\\n\r\nThe protagonist, Hachiken, is where the story shines the brightest. He is rebellious, depressed, the epitome of the angst-filled teenager. Hachiken looks down on the activities of his peers; he finds the work tiresome and disgusting. The notion of cleaning a pig's cage or cutting apart an animal for food feels degrading and inhumane. But he matures. He does not learn to enjoy these activities, but he gains the ability to respect others' lifestyles. His internal world becomes less about himself and more about the people surrounding him. He understands that he felt alienated in the past as a result of focusing only on himself. Humans are a social creature that require cooperation to find peace... usually. \\n\\n\r\nHachiken does not mature from melodrama or heavy-handed 'lessons'. He matures simply by living. The episodes of the show rarely contain any significant drama, and controversial topics (such as the slaughtering of livestock for food) are treated in a very down-to-earth, realistic manner. Silver Spoon could have easily become a sort of pro-slaughter propaganda, but it is not. Not in the slightest. It portrays both the good and the bad in equal measure. The only real issue with Hachiken's characterisation is that his stubbornness can get irritating, but even that seems a part of the point. The characters are not portrayed as inherently 'kind-hearted' or 'bad' people. They are human beings with their own traits and flaws. It's also nice to see an anime that actually focuses on the adult characters, too, instead of conveniently erasing them through the 'overseas trip' cliché. I've had quite enough of that. \\n\\n\r\nSilver Spoon is a joy to watch even if you have no interest in the agricultural lifestyle. The activities that the characters participate in is very insightful, and there's a good chance you will learn a few things about farming along the way (I certainly did). The only problem is that the comedy is very hit-or-miss. It is completely and utterly Japanese... filled with exaggerated reactions, slapstick, and other things that western audiences are unlikely to find amusing. It feels repetitive and uninspired, almost like the mangaka threw these jokes in simply to /have/ jokes. \\n\\n\r\nThat said, the art is of a consistently high quality throughout. Even during the last third of the season when animators tend to make the most mistakes, Silver Spoon still manages to look just as clean as it did at the beginning. There is a sort of 'chiselled' look to the characters' faces which also gives the show a distinct visual style. Being the second major project from Hiromu Arakawa (of Fullmetal Alchemist fame), you will undoubtedly see some similarities between the two. Silver Spoon's anime adaptation may not have nearly the budget of Brotherhood, but it looks just fine on its own terms. There's hardly a reason to complain. \\n\\n\r\nThe music verges from great to completely out-of-place. There are some beautiful tracks but they are hampered by poor usage. The last few episodes of the second season, for example, contain several scenes with sombre classical music playing while two major characters argue with each other. The piece itself is nice... but did it really have to be used in this particular scene? The more quiet tracks, the ones that are less noticeable are what carry the majority of the emotion. It truly feels like a slice-of-life. \\n\\n\r\nI can't imagine there would be a reason for any fan of anime to skip a series like Silver Spoon. If you are looking for teenagers screaming at Titans, I suppose, Silver Spoon might bore you with its lack of action scenes. But this lack of action is the series' greatest strength. It is introspective rather than epic, mature without ever forcing itself. The subtle drama feels meaningful; it works because it focuses on ordinary people rather than superheroes. You do not need a vested interest in the slice-of-life genre to appreciate Silver Spoon. It is a brilliant, heart-warming story that nearly anyone can enjoy. \\n\\n\r\nSilver Spoon may be the antithesis of what Fullmetal Alchemist represents, but Arakawa shows that an emotional story can also be told through the simplicity of everyday life. We don't always need superpowers and villains to be excited. A simple tale can be more than enough.",
            "date": "2014-04-12T13:40:00+00:00",
            "helpful_count": 244,
            "mal_id": 139683,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=139683"
        },
        {
            "content": "By expressionism and symbol, a silver spoon is symbolic for wealth. The phrase of “been born with a silver spoon in his mouth” is synonymous relating to an individual born from the rich family. But the series, Silver Spoon/Gin no Saji, stands on the opposite side of that symbol. Most of the characters aren’t rich and neither are any of them born from a wealthy family. However, what they do have is the talent and ambition that drives them to fulfill a dream. Making a dream into a reality is tough. Competitions and life itself becomes an obstacle. Gin no Saji/Silver Spoon delivers that veryidea of following a dream by heart. A journey into Gin no Saji is more than about following that dream. It’s about learning, discovery, and finding out the essence of themselves.\\n\\n\r\nWritten by Hiromu Arakawa, best known for her work with Full Metal Alchemist, Gin no Saji depicts the life of a young boy named Yugo Hachiken. Season 2 sets off after the conclusion of the first arc. Needless to say, it’s imperative for one to complete the first season to fully appreciate season 2. The foundation of the first season revolved around farm aesthetics and just what’s like to be involved in the field of agriculture. It’s almost like opening the doors to a brand new world and realizing just how difficult it is to survive. In this season, more dynamics are explored beyond the farm jokes. What we learn about the characters impacts their future as they follow a dream, a road of inspiration to become someone they always wanted to be. \\n\\n\r\nTo appreciate this series, one must first embrace the style of its portrayal relating to the agricultural field. The setting takes place at a farm, a place free of crime, discrimination, or corruption. It’s simple and realistic with the atmosphere along with the farm animals. Just picture yourself there on the field working with cows, chickens, and horses. For Hachiken, he truly learns what hardship is like as a farmer. But more importantly for him is about discovery, to venture out of the life he once was so used to. And honestly, that’s an important concept in life itself. When something changes in our life, we try to adjust, adapt, and eventually become part of the norm. Hachiken gets used to working on the field with others and make discoveries of what hardship is really all about. The anime that is adapted from the manga of the same name is written by the author based on her own experiences when she grew up in Hokkaido. In essence, it brings out what her childhood was like and is a strong influence with the themes in this series. \\n\\n\r\nBut capturing those moments is difficult with a small cast of characters. Luckily, Hiromu’s writing cleverly brings out her characters to life with idiosyncratic attributes. She accomplishes that through a unique craftsmanship of these attributes to tie in with the story. Most of the characters follows their dreams and this becomes prominent later on as a major theme. In the early stages of the season, we already see the passion that they have for their dreams. Examples such as Mikage’s dream to care for horses as a profession, Ichiro’s inspiration to become a professional baseball player, or Hachiken’s older brother Shingo to become a chef. But life offers challenges. For Mikage, this comes as a burden for both her and the family. What we must understand is that there’s a difference between choosing one’s dreams and deciding who make those decisions for you. Obstacles limits these choices yet there is a profound way of how this show demonstrates ways to overcome them. With support and spirit, an inspiration is bought about that spreads influence.\\n\\n\r\nHachiken on the other hand still wonders about what road he needs to take for his future. But from season 2, we find out quickly about his present position as the new vice president of the Equestrian Club. There’s an emphasis of responsibility to be placed on him as the future of the club lies with his hands. It’s acceptable for this season to put Hachiken in such a position to test him his skills as a person. Because being a leader, one must also demonstrate responsibility, the passion to hold a group together, and prove their self-worth. All this ties in together with building a future and following dreams by such emphasis. At the same time, we get to see relationships Hachiken builds with other characters. In particular, his relationship with Mikage is explored by friendship, respect, support, and potential romance. The way the two interact has a sense of unique dynamics as they talk about their family and struggles. In fact, the two are actually similar in many ways with their relationships with their families. Both families wants the best for their children yet they also have high hopes for them, placed at almost a burden expense. And while Mikage is an only child, Hachiken is often compared with his older brother Shingo that causes him to feel self-doubt. Nonetheless, the duo’s conversations throughout the season brings together both realism and is relatable. Ask yourself this: do you sometimes find yourself living in someone’s shadow when you’re compared to that person? \\n\\n\r\nFocusing on the main story is quite a driving factor but at the same time, this season also brings comedy and fun. The thought of working with animals firsthand to gain experience may seem like a daunting task at first. Yet, we see how much fun some of the characters have as they embrace the way of the farm life. Even Hachiken becomes accustomed to it. The comedy comes from the way Hachiken experiences how to deal with animals and the mistakes he makes. Yet, he learns from these mistakes (most of the time anyways). The result of some of these mistakes often brings embarrassing attention and humorous events. At the same time, there’s silliness with the way animals behave around the characters. In particular, Aki’s horse Maron plays a comical relief as a character that displays human traits such its egoistic behavior and even tsundere like tendencies. And on the human side, we have a new character named Ayame with a stylish fashion of her drill-like hair but colored by an aristocratic way of speaking. Looking carefully, the rivalry she has with Mikage can almost be interrupted as a joke by the results of their so-called “contests”. Rather, she does stand out more with the way ‘silver spoon’ is depicted as a wealthier individual; a contrast to where Mikage is coming from as in a normal family. \\n\\n\r\nWith 11 episodes, there are some parts that are seemingly omitted or otherwise, left unresolved. In particular, the relationship between Mikage and Hachiken is explored but doesn’t seem to progress too far. There’s an obvious attraction with the two that are seemingly drawn by their similarities. Yet, the show chooses to ambiguously present this in a more platonic way. At the same time, more emphasis is still focused on aspects of the farm such as taking care of animals. It has been dealt with so many times before in the previous season that it feels repetitive by this point. Also, a lesser focus is on Hachiken’s character himself. Most of the other cast members gets emphasis on their future while he is still on the farm asking himself what he should do when he grows up. As a main character by this point, I find this slightly unattractive by such generalization and its setup. And speaking of unattractive, some of the jokes become stale to a point of being on a detached direction of diminishing effect.\\n\\n\r\nArtwork still retains the style of the first season. We get the natural feeling of how the agricultural field is depicted by its backgrounds. The animals are crafted with delicacy and with the intent to demonstrate realism. Characters are decorated with simplicity. Female characters aren’t designed with heavy makeup but rather to themselves. No stereotypes. No sexism. No stupidity. The show’s character cast feels real with a bond to the farm. As you watch this season, there’s a sense of attachment you may develop with the characters as well just by their outlooks.\\n\\n\r\nAs far as soundtrack goes, the show is consistent although it’s nothing masterpiece worthy. The OST is smooth with a calm music tone. The OP and ED songs demonstrates degree of a countryside feeling. Most of the characters’ voices are presented well. In particular, Hachiken’s expressions of his voice mannerisms are demonstrated with realistic responsiveness. Whether this can be anger, fear, or anxiety, there’s credibility that makes Hachiken’s voice something to remember.    \\n\\n\r\nWe all have dreams. Whether you realize it or not, every single day that draws by takes you closer or further away from it. But for our characters in this show, they try to become closer to making their dreams into a reality every single day of their lives. Gin no Saji responds to the way of following dreams explicitly through demonstrative episodes with characterization. Dynamics are explored with a decent balance of humor and realism. It can also be relatable by the setting and just in general, real life itself. After all, life is a challenge because there’s no such thing as free lunch.\\n",
            "date": "2014-03-28T01:04:00+00:00",
            "helpful_count": 77,
            "mal_id": 137429,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137429"
        },
        {
            "content": "The Silver Spoon is real, and even now yours for the taking.\r\nIf there's something to be said about Gin no Saji (trans. Silver Spoon), we can probably boil it down to three core ingredients: Food, Agriculture, and Life. Those are no small matters, but Arakawa Hiromu has masterfully blended these hefty issues into an easily digestible, comforting, and befittingy resonant, intimate work.\r\nA coming-of-age slice-of-life school drama taking place in the remoteness of Hokkaido, Japan, this anime harvests its bounty from the wealth of its source material, but in the move from manga to anime, it augments and adapts it perfectly, adding garnish and spice tothe completed dish.\\n\\n\r\nAs a second season, expectations and method have already been pre-set, familiar to the returnee viewer, but in this second series Gin no Saji (GnS) advances beyond those previously well-laid foundations. Once again, viewers are treated to those necessary daily hardships and mundane chores of farming life, but also its joys, pleasures, and novelties (oh food, so sacred!). Through that familiar trial of school-life, the varied cast of boarders share with us a glimpse of the agricultural world: the nuanced considerations of livestock-raising, the delicate handling of the horse by its rider, and that telling contradiction of love and necessity with which all live-stock animals are treated within the industry. The farming life and related rural community is lovingly portrayed, yet also, as one of Gin no Saji's good virtues, it is very much grounded in reality, and when events turn against our protagonists, there too, is meaningful realism.\\n\\n\r\nOur hero, Hachiken is a wonderful expy for the viewer. Now familiar (as we are) with the farming hours and various chores, he continues to learn through experience, mistake, and labour, of this huge-world, an industry and life so pertinent to the world-at-large, yet so taken for granted, its hardships forgotten. In his studies and adventure, Hachiken grows so very much, and this is the key to the genuinity and excellence of GnS: the fantastically crafted characters. \\n\r\nEach character brings a necessary layer to the show, and while not all are developed as fully as our main characters, they each have something to add with their unique designs and endearingly comedic traits.\\n\r\nBut, ultimately, this is a show centred on Hachiken and his youthful negotiation through hardship, friendship, and expectation; it is here that we get Arakawa's sincere portrayal of the complexities of education, family, economic reality, and all the never-ending steps we take towards our future. Most gratifyingly, Hachiken is a character who battles his insecurities, and bull-headedly rises to those challenges.\\n\\n\r\nVisually, Gin no Saji requires fairly little portrayal of movement, but the animation team has done a great job in adapting the manga stills while maintaining the perception of action and dynamic change. This is most obviously combined with the quick-transfers and exaggerated character 'reactions', delivering both effective gag-comedy, and visual interest.\\n\\n\r\nVoice actor Kimura Ryouhei has done a suiting job as the worry-wart, yet hardy Hachiken, and his acting elevates the show, aided by the superb supporting cast. The soundtrack is fitting, if not too stand-out as expected of an easygoing drama, and the Opening/Ending themes are also properly welcoming and warm.\\n\\n\r\nIn conclusion, Gin no Saji is a pertinent story, reminding us of the choices, indecision, and complexities of youth. The agricultural aspect gives a much-needed flavour, educating (never preachily), adorable, and scrumptious. There's drama, but never needlessly heavy, but fittingly serious and real. There are no cure-all solutions, there's nothing here outside the common experience, only a lifestyle unfamiliar to us. This is no stellar visual artwork, as its device is to adapt a brilliant story from paper to screen, and it does so flawlessly.\\n\r\nThe Silver Spoon that we all possess, that inheritance, that overlooked richness, or even literal wealth. It takes on countless meanings, and yet reminds us of our worth, our past, and what we are, that is, a coming future. All this contrast can be found in Arakawa's clever title and furthermore in this exellent adaptation.\\n\\n\r\nIn watching this anime, you will find laughs, youth, the simple adversities, and also worldy realities. Like the myriad of animals in this world: companion, livestock, worker; this show will be a worthy support as you discover a new and different, yet charmingly familiar world.",
            "date": "2014-03-28T07:12:00+00:00",
            "helpful_count": 72,
            "mal_id": 137473,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42128.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ckan",
                "username": "Ckan"
            },
            "url": "https://myanimelist.net/reviews.php?id=137473"
        },
        {
            "content": "I really enjoyed the first season of Gin no Saji. It goes w/out saying that I had really high expectations for the second season. And for the most part it didn't disappoint.\r\nStory/Characters:\r\nThe story picks up where the last season left off where Hachiken is slowly getting used to the life at Yezo high. He's made friends and is now relatively enjoying his school life. But his character will develop by leaps and bounds by the end of this season w/c was why I liked it as much as I did.\r\nThe character development... This aspect was really prominent this season and I enjoyed it a lot.Hachiken, Mikage and Komaba all have their moments and all of them felt really genuine and real. The drama also escalated quite a bit and if someone told me I'd cry because of dairy cows before watching this series I'd have thought them to be crazy. The story really upped the ante this season and it was great.\\n\\n\r\nArt/Sound:\\n\\n\r\nI personally thought the new OP/ED weren't as catchy as last seasons but that's just me. A-1 remains consistent animation wise and still manages to give us really great backdrops.\\n\\n\r\nOverall:\\n\\n\r\nAs much as I liked the last season I think season 2 trumped it by a fair margin. The story is moving along in really surprising ways and the roller coaster of emotions it takes you to is really enjoyable. Especially the last few eps. Hachiken and the gang are growing steadily and you feel all warm (but a little melancholic) inside seeing them go through all the things life throws at them. I'm pretty much up for a third season if ever. Another great SoL series to remember.",
            "date": "2014-03-27T19:32:00+00:00",
            "helpful_count": 48,
            "mal_id": 137341,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1396801.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/swordstriker21",
                "username": "swordstriker21"
            },
            "url": "https://myanimelist.net/reviews.php?id=137341"
        },
        {
            "content": "The Silver Spoon was real after all…\r\nStory/Plot: we have the story of Hachiken, a young high school boy who enrolled an agriculture school/college in order to escape his past and to find new opportunities along the career he is pursuing to.  This follows up season 1 right off which is something I like about this series. Along his journey, Hachiken gets to meet many friends, many experiences, and the harshness he goes through facing reality which is something we all experience at some point in our lives. What I like about this, as the story goes on, is the viewer learns about agriculture environmentsuch as working in the field, how to make cheese, how to make bacon, dealing with the livestock, among others important things. The lessons this anime is bringing upon us is truly meaningful. (9.5)\\n\\n\r\nCharacters: If there’s something I like the most in this is the dialogue and the character development.  Every character has his/her own goal and each one of them got his/her own problem to take care of. We get to see how they grow up and learn according to the different tasks they get involved as well. The comedy approach always comes in the right moment and somehow that’s something I find important in a slice of life. (10)\\n\\n\r\nAnimation: A-1 pictures delivers a great animation and quality for this series.  The backgrounds, the animals and the characters seem to be in the right picture. Props to them. (9)\\n\\n\r\nSound: Beautiful melodies and sound effects for the drama moments and all the characters. The Opening song was good and the ending song was lovely from my perspective. (9)\\n\\n\r\nFinal thoughts:\\n\r\nGin no Saji is one of those series that should be on the top list. It’s a shame is considered an underrated anime having such a great story. Hopefully we’ll get to see a Third season…we need more anime like this. (9.5/ 10)\\n",
            "date": "2014-03-30T00:32:00+00:00",
            "helpful_count": 12,
            "mal_id": 137843,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188478.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sCr4G",
                "username": "sCr4G"
            },
            "url": "https://myanimelist.net/reviews.php?id=137843"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nEverything you do takes some amount of effort. Some things take a small amount, such as getting out of the bed in the morning or putting on your shoes. Other things take a considerable amount, such as studying for an exam or learning a profession. Above all, pursuing your dreams takes the most effort of all. In Gin no Saji Season Two, this effort and everything that it entails is explored, and when you finish the series you are left feeling that you can take on the world.\r\nSTORY\r\nGnS2 begins where GnS1 had ended; Hachiken and friends are currentlygoing through their agricultural high school and attempting to live their everyday lives.\\n\\n\r\nWhile watching Season Two, it becomes apparent pretty quickly that the focus shifts away from farming and towards the characters' personal dilemmas. The transition is handled pretty nicely. Being slice of life, the show can take such a leap. While the undertone for the episodes involves things related to animals, such as Ban'ei racing or cheese making, the purpose of what they are doing isn't in the activity itself. Rather, it is a vessel to drive the characters' thoughts and ideas into the forefront. In other words, GnS2's focus is its characters rather than its world.\\n\\n\r\nSo what does the show focus on this time? Previously, it was farming, agriculture, and morality. This time, its about hard work, dreams, and learning how to get back up when you get knocked down. The show is pretty much split into these three \"arcs.\" When watching this season, they made it extremely easy to relate to the characters because they do the same things that you, me, and everyone else does. Starting with hard work, the show takes a look at all sides. For some, hard work doesn't mean much.\\n\r\nThat is to say, they can get by with little effort. For others, they have to put in tremendous amounts of time in order to get the results they want, and even then the outcome is nothing short of disastrous. Hachiken, Mikage, and even the side cast experience these effects, and the show captures their situations in a believable manner.\\n\\n\r\nThe second idea GsN2 focuses heavily on is dreams. Now, these are not just the dreams of the characters, but also of those around them. Many people have expectations placed on them. Sometimes, these expectations weigh people down so much so that they cave under the pressure. One's dreams are interesting because not only are they something that are not physically tangible but at the same time, they are one of the only things you can truly call your own. Once again, Hachiken and the rest of the cast help to demonstrate these dreams, what it means to achieve them, go for them, and ultimately lose them. It can't be stressed that the show does a great job of making these situations believable, that what they are doing could easily be seen the following day.\\n\\n\r\nThe final portion of Gsn2 is about bouncing back from failure. As the show states, everyone fails; it's just human nature to make mistakes. No one is perfect, as much as they may seem or want to be. And that's a solid message. For example, looking at my reviews, while I always try my best to make my writing as coherent and well-worded as possible, sometimes I just don't type the correct thing. This can be applied to anything. Failing isn't something you should be afraid to do. It's difficult to accept, but failing should be looked at as a learning experience. Accept what happens, understand what you did wrong, and better yourself for the future. I keep reiterating myself, but the characters prove this mentality once again. The show does a fantastic job of letting us see how real life really is when it comes to these situations.\\n\\n\r\nANIMATION\\n\\n\r\nAs with Season One, GsN2 does a nice job both in its art style and animation. The animation specifically seemed to pick up a bit during certain emotional moments (more character movement and facial expressions) this time around.\\n\\n\r\nThe animals once again are drawn quite nicely, especially the horses. The large Ban'ei horse specifically always looked extremely intimidating. The cows, pigs, and chickens aren't shown as much this season, but they too were nicely detailed.\\n\\n\r\nThe characters maintain the same designs from season one. Again, nothing too stand out, but Hachiken wearing glasses is something I can relate to!\\n\\n\r\nCHARACTERS\\n\\n\r\nGsN1 had placed Hachiken in the lead but pretty evenly spread out the on-screen time for the whole cast. This time, the show pretty much only focuses on Hachiken and Mikage.\\n\\n\r\nI actually liked this approach. With this move, even though the show is slice of life, it allows for great characterization and depth for the main stars.\\n\r\nAs such, Mikage's character is developed way past just liking horses. She learns to start relying on others, using the confidence she had hidden deep inside, and chasing after her dreams. It doesn't happen right away. Instead, she requires a little pushing from a bookworm in glasses.\\n\\n\r\nThis bookworm is none other than Hachiken. GsN2 throws a lot more drama his way than the previous season. Being a \"guy who never says no\" is no easy task. And he learns the hard way that being such a guy has both its upsides and downsides. For most of the series, he expresses his inability to have a clear goal or dream in mind, unlike the rest of his friends. But he realizes that his situation is almost as good; stealing a phrase from my own review, the world is his oyster. So while he doesn't necessarily have a future dream to latch onto, he instead spends his time focusing on helping those around him, especially Mikage.\\n\\n\r\nAnd with this greater focus on Hachiken and Mikage comes a greater focus on their relationship. I'll say it until the day I die, but I love romance, and therefore the pretty large increase of it (comparatively) in GsN2 was greatly appreciated. The feelings are present, and while not deeply explored, it is nice knowing that they appear to be more than just good friends.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is fine, giving you a nice sense of looking towards the future, which its visuals look to drive home as well. The ED is fine as well, being more uplifting and happy, fitting nicely with the overall pleasantness for a slice of life type show.\\n\\n\r\nAs with GsN1, the only really stand out piece from the soundtrack is the \"stair step\" orchestral piece. It has some small variations here and there throughout the season, and I always liked hearing it.\\n\\n\r\nVoice acting has no amazing performances, but I liked Ryouhei Kimura's rendition once again of Hachiken.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhile GsN2 does take a more serious and dramatic turn, it is probably even funnier than the first season. The jokes once again are not from the writing but rather from what happens in the situations that are presented. The President is always hilarious to see, Hachiken's reactions to the events in front of him are always funny, and the character interactions are top notch.\\n\\n\r\nThe romance elements present are also very enticing to me, and always left me wanting to see where our couple were heading next. While Hachiken and Mikage have their own problems to deal with, being able to support one another was very nice to see, not only to my eyes but also to my heart.\\n\\n\r\nTo be honest, I watched all the episodes in one day. I don't normally do this with a show, but GsN2 always kept leaving me with wanting to see what was going to happen next. And after finishing the series, I am eagerly awaiting the time I get to return to Ezonoo to see Hachiken, Mikage, and the rest of the cast eagerly pursuing their dreams.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, fantastic slice of life that incorporates real life lessons\\n\\n\r\nAnimation: Good, fine art style with nice animation\\n\\n\r\nCharacters: Good, Hachiken and Mikage are are very relatable\\n\\n\r\nSound: Fine, okay OP, ED, and soundtrack\\n\\n\r\nEnjoyment: Great, extremely easy to lose yourself in\\n\\n\r\nFinal Score: 8/10",
            "date": "2014-09-24T19:51:00+00:00",
            "helpful_count": 9,
            "mal_id": 161985,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161985"
        },
        {
            "content": "Story : 9\r\nThe story for the second season follows very closely the first there is no time gap but things change greatly from one season to the other. The first season was funnier and more focused into exploring the funny aspects of the characters and school but the second focuses more on the struggle of the characters both personal and academic. It focuses more on how the characters overcome their issues and struggles especially in regards to family matters, dreams and aspirations as well as deep psychological issues brought by a sense of destiny and obligation. Keep in mind that this does not mean thatthe series is no longer funny and enjoyable but that it just focuses more on 'actual' issues.\\n\\n\r\nArt: 8\\n\\n\r\nThe art is pretty much what you have come to expect from the first season. There are no visible differences. It is still pretty good. Perhaps the most notable change are facial expressions due to the larger variety of emotions felt by the main and supporting characters.\\n\\n\r\nSound: 6\\n\\n\r\nExactly like the first season the music seems to be irrelevant. Once again the ost does not complement the actual story despite the story line being more profound in the second season.\\n\\n\r\nCharacter: 8\\n\\n\r\nThe characters continue their journey through life and in several cases they become more relatable. The character development has indeed escalated but due to this the series lost some of its funnier aspects. This is by no mean a bad thing.\\n\\n\r\nEnjoyment : 8\\n\\n\r\nDespite the changes this season is very enjoyable mainly because it shows us different aspects of the characters. Yes it may not be as funny as the first but the fact is that the creators dared to show us a more realistic perspective of the characters lives, something that I personally found quite enjoyable.\\n\\n\r\nOverall : 8\\n\\n\r\nOverall the series is very good and it is my belief that the change of pace and direction in season 2 complements season 1 greatly. I would prefer if there was a season 3 in order to see how the story unfolded after the end of season 2 but in order to explain it better I would have to add spoilers which is never a good thing.\\n\\n\r\nIn conclusion I highly recommend it.",
            "date": "2015-02-26T04:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 181239,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=181239"
        },
        {
            "content": "SILVER SPOON tackles some very different and serious themes in its second season, while still retaining that effervescent charm that made me fall in love with it immediately. Hachiken's growth continues to be compelling and relatable, regardless of what my own school or family experience has been like.\r\nBut the real standout of this season is Komaba. His arc reaches a level of pathos and maturity that most shows wish they could achieve, and it's all steeped in a realism that hits too close to home. I love and respect how the writers went all in on this storyline, without taking any easy outs. It's roughto watch, but so much more rewarding because of it.\\n\\n\r\nTruly, truly unfortunate that this appears to be the end of the road for this wonderful anime. I suppose we should be thankful we got a second season at all.",
            "date": "2018-01-25T11:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 269609,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6890812.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JediNut",
                "username": "JediNut"
            },
            "url": "https://myanimelist.net/reviews.php?id=269609"
        },
        {
            "content": "Gin no Saji is one of the few feel good anime that just makes you feel refreshed and motivated if you are feeling down or just in the spiral of depression. The story starts off with Hachiken, a normal school student who runs off to an Agricultural school to get a break from all the pressure he's in and the breakdown from not being able to clear his entrance exam.\r\nWhat makes him relatable is that if you are a person struggling in your school or college then you have obviously faced the pressure that comes with it about what you want to do with yourlife. Hachiken is just like that and in every episode you can relate more and more with the people he befriends, their stories and their dreams and the challenges they have to face.\\n\\n\r\nThe soundtracks are good although the opening isn't really that great, voice acting is great too. The art is enjoyable and funny at times, it is an anime that gives you both a message as well as a good laugh.\\n\\n\r\nThis is a story about dealing with life, understanding the importance of friends in life and also how you should name the livestock you are going to eat.",
            "date": "2017-03-29T06:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 243901,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5204076.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HaiseK",
                "username": "HaiseK"
            },
            "url": "https://myanimelist.net/reviews.php?id=243901"
        },
        {
            "content": "Note: this was written a long time ago as a review of both seasons, but I’m submitting it to season 2 because reasons.\r\nThe best slice-of-life anime are able to take a hobby you have no interest in and make it interesting.  Before watching Silver Spoon I would have never thought an anime about a city kid going to an agricultural school would keep me entertained over 22 episodes, and yet here I stand corrected.\r\nYugo Hachiken is a high schooler who's extremely intelligent, but becomes fraught with the weighty expectations of his father.  Unlike most of his peers, Hachiken hasn't given much thought tohis future - this fact creates tension between him and his father, and the stress of the situation forces him to get as far away from his family as possible.  To that end, Hachiken enrolls in Oezo, an agricultural school located in rural Japan.  \\n\\n\r\nOnce enrolled, Hachiken expectedly excels in the academic portion of school, although nothing he experienced in the city has prepared him for the laborious-but-rewarding work that makes up the other half of his curriculum.  After a rough start, Hachiken starts to respect the demanding schedule that comes with being a farmer.  That respect goes a long way towards proving to his father and himself that he can be productive despite being directionless.\\n\\n\r\nThe heart of Silver Spoon's story has to deal with the maturation of Hachiken.  He comes into Oezo as an outsider with only book smarts at his disposal.  He makes various friends along the way, and genuinely starts to enjoy the physical practicums that accompany his studies.  He wakes up at 5 in the morning to tend to the farm animals, and his duties include baling hay, grooming horses, raising piglets, and collecting chicken eggs just to a name few.  Our journey as viewers -- assuming none of us are farm hands -- mimics Hachiken's as a student.  A lot of what he experienced is educational and brutally realistic.  \\n\\n\r\nThe way Silver Spoon shows the life of farming is extremely graphic in some situations, and probably isn't for the faint of heart.   Exploring the process of collecting eggs and raising pigs only to be slaughtered is sobering, but if you're meat-eater, like Hachiken, you're likely to go from being distressed to reverential of the finished product.  What Hachiken learns at Oezo he applies to his own life, which makes him less apprehensive as a person.  He drops his guard, and really starts to connect with his fellow classmates, even when they politely ask he basically mind his own business.\\n\\n\r\nOther than the lifelike depiction of farm life, Silver Spoon also explores the business side of agriculture.  Unless you're a huge farm, you're more than likely operating in the red.  Farms incur huge debts, and if their harvest goes bad, or their animals aren't producing like they should, they can go under real quick.  It's even worse when you consider that if someone from another farm consigns a loan; their livelihood is threatened if the other farm defaults on it.  Some of Hachiken's friends are in that exact predicament, and it forces them to make some tough sacrifices.\\n\\n\r\nA prevalent theme in Silver Spoon is personal dreams vs. familial responsibility.  Two characters are put to the test in this regard: Mikage and Ichiro.  Mikage is the obligatory love interest.  Hachiken falls for her almost immediately, while she tries to herd him into the friendship stable.  As the series progresses, it becomes obvious that they both really like each other, but their relationship doesn’t payoff romantically.  However, he does help her to become more assertive with her family.  She loves horses and wants a career working with them.  The only problem is there’s no one to entrust her family’s farm to but her.  Likewise, Ichiro dreams of being a professional baseball player, except he is the lone man in a household full of women.  With two younger sisters and an exhausted mom, he must decide what's really important to him.\\n\\n\r\nSeeing Mikage and Ichiro go through their respective trials assists Hachiken in finding his own calling: helping others.  He might be aimless, but he takes on a lot of responsibilities while at Oezo, and he's a better person for it.  He ultimately realizes no matter the size of the contribution, it could have a substantial effect on someone's life, as illustrated by a short, touching note he read from a person whose spirit was lifted simply by seeing horses jump over hurdles.  \\n\\n\r\nDespite Hachiken's growth, most of the supporting characters are underdeveloped.  They either exist to give Hachiken sage advice or to instill humor with their strange character quirks.  Even Mikage is kind of bland until the second half of the second season.  Also, a girl named Tamako, who fluctuates between obese and skinny, is scarcely used.  Aside from the obvious visual gag, her physical changes convey just how secure she is with herself.  She can astonish the entire school with her beauty, but she’d rather be overweight because it makes her feel more comfortable.  It would have been nice to have a single arc focused on her.\\n\\n\r\nWhile Tamako’s varying weight is played for laughs, the overall character designs of Silver Spoon is serviceable.  There are some of characters with exaggerate features that make them visually clash with everyone else, but you eventually get used to them.   As I mentioned previously, there are some very graphic scenes dealing with the life cycle of farm animals, and the artists pull no punches.   The cow birthing scene is slimy and blood gushes when chickens are beheaded.  The detailed scenes of nature are countered with gorgeously produced food.  There’s one time when Hachiken makes pizza for the entire school, and the pizza he cooks looks mouth-watering, almost like you can reach into the screen and grab it.\\n\\n\r\nSilver Spoon does exactly what any good slice-of-life anime should do: It shows passion for a niche interest through the eyes of a character who gradually changes over the course of the series.  \\n",
            "date": "2016-07-06T15:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 223318,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4156853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Psycho_Pass",
                "username": "Psycho_Pass"
            },
            "url": "https://myanimelist.net/reviews.php?id=223318"
        },
        {
            "content": "This anime is surprisingly enjoyable. I really didn't expect to like it as much as I did. I mean, it's an agricultural anime. You wouldn't think that'd appeal to a majority of people, but it's honestly an anime that anyone would love. It's very charming.\r\nMy only issue with the first season of this anime was that we didn't get a backstory on the main character's reason for being at this agricultural school. The struggles he was going through didn't hold as much weight as they could've had we known the environment he came from. This season fixed that a little. You don't really get acquaintedwith how his life was before the school, which is a little bit disappointing, but you do get a sense for why he chose to leave. That bit of context really helped me to enjoy the current storyline a lot more.\\n\\n\r\nA couple of the other main characters got some development as well, which was nice considering the fact that we didn't get a lot of resolution to their conflicts in the first season. The story the anime tells about family and finding your dream is really lovely, and I think using agriculture and farming as the medium for those ideals is very unique. \\n\\n\r\nIt isn't the most dramatic anime in the world, but I think it leaves you with a sense of hope for the future that's really beautiful. I'd definitely recommend this anime to everyone, even if you don't think it's your kind of thing. This is a comforting anime to watch, and I'm glad I took the time to experience it.",
            "date": "2019-01-25T16:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 299997,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=299997"
        },
        {
            "content": "Minor spoilers ahead. Proceed with caution.\r\nHow do you survive as a food producer in a market as fiercely competitive as Japan?\r\nHachiken sure doesn't know, but he'll probably die trying if you let him.\r\nSeason 2 carries on from where season 1 left off, and soon we start to see some real drama. Sure, the difficulties of a school where you get up at 4 AM and are forced to participate in all the tasks of animal husbandry is hard enough, but what happens when one of your friends' farms can't pay the bills? Season 2 is a testament to a great anime because the manga it'sbased upon is so good, and yet the production staff are doing more than giving color, motion, and sound to the manga.\\n\\n\r\nCharacter development is the name of the game here. After grappling a couple of his own challenges, Hachiken takes on serious issues with two close friends, again, like a 100-pound linebacker with a chip on his shoulder. But in doing so, and despite him not finding a solution, he gains their gratitude and deepens their relationships. One recurring theme is that Hachiken's efforts are rewarded in unexpected ways, even if the one he's trying to make proud is never satisfied.\\n\\n\r\nSpeaking of which, Kenyuu Horiuchi voices Hachiken's father; the other show I remember him in is Gundam X, where he plays a stern but deeply principled ship commander. I thought this was a bit of a miscast, because while Horiuchi plays the character as coldly as possible, the warmth of his voice neutralizes the character's personality. I thought someone like Ryotaro Okiayu (the voice of Byakuya in Bleach) or Toshiyuki Morikawa (who played one of the main villains in Gundam X and the first Aquarion) would've been a better fit in terms of voice timbre-- properly written and directed, those two actors can chill you to the bone. Still, Horiuchi is an excellent actor, so this isn't a showstopper by any means.\\n\\n\r\nThis is the series that introduced me to the band Goose House, and the ending theme makes them sound like they're having the time of their lives while singing.\\n\\n\r\nFinally, there's a scene midway in the series that pays tribute to the victims of the 2011 earthquake and tsunami; the manga chapter with that scene was probably published not long after the disaster. In many ways, you can see how much care was put into the manga and animation.",
            "date": "2018-04-25T21:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 279029,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2367307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/earl_of_sandvich",
                "username": "earl_of_sandvich"
            },
            "url": "https://myanimelist.net/reviews.php?id=279029"
        },
        {
            "content": "The second season of Silver Spoon is just as good as the first, if not better. It continues and develops the story that in the first series was presented so well. There is now a greater focus on the characters and their development, and not only Hachiken as was the case in the first season: now Mikage is a main character as well.\r\nIt's still set in Oezo agricultural highschool, but there is less attention on the setting and the topics connected to it, which was what initially captured your attention in the first series it being so unusual. This series dwells less on the implicationsof attending an agricultural highschool as it isn't a novelty anymore for Hachiken. It develops instead the characters and the themes related to the issues those characters are struggling with: Hachiken's relationship with his parents, his father in particular; Mikage's decision to not carry on the family farm and how she gets the courage to break the news to her parents; Komaba's failure to become a professional baseball player and the implications that has on his future. And of course the relationship between Hachiken and Mikage is more developed as well. There are still lots of good comedic moments, but it's in the character development section that this anime shines.\\n\\n\r\nTo make it brief, if you liked the first season you'll have no complaints about this second season. There's more character development and less philosophical considerations. At the end of the series you don't really know what happens to our main characters: you don't know what path Hachiken decides to take, or if Mikage manages to get into college, or what happens to Komaba, or even if Hachiken and Mikage actually manage to get togther. But that's ok. It's ok if there is a third series, which I would definetely watch. But it's also ok if there isn't a continuation and it ends here. It manages to pull this off, I mean the fact that you don't feel cheated by the lack of a \"proper\" ending, because it isn't a plot-driven anime. It's character-driven and the characters are developed very well. You could go on writing about a person's life until the day they die, there are always new challenges to face and there are never any definete achievements, but if you're telling a story you have to stop somewhere. Anyway, as stated before, the second series does not disappoint but lives up to the expectations set by the first season.\\n\\n\r\nCollapse\\n\r\n7.5/10\\n\r\nstory\\n\r\n 6/10\\n\r\nanimation\\n\r\n 7/10\\n\r\nsound\\n\r\n 7.5/10\\n\r\ncharacters\\n\r\n 7.5/10\\n\r\noverall",
            "date": "2016-07-15T11:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 224102,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5537832.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JasonKKAA",
                "username": "JasonKKAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=224102"
        },
        {
            "content": "Gin no Saji 2nd Season is undoubtedly a masterpiece in the slice of life genre - for myself especially.\r\nThe story and character progression is a lot stronger in this season and you get a better understanding of the characters and their motivations and ambitions.\r\nThis anime has plenty of heart and angst and instils a sense of responsibility and duty to whoever watches it. \r\nThe art style is typical of modern animes however, Gin no Saji truly shines in the faithful rendering of animals and food.\r\nThe soundtrack is actually noticeably good, the orchestral pieces occasionally heard are truly outstanding. The OST is also fun and setsthe tone well.\\n\\n\r\nThe character dynamics and relationships truly take centre-stage in this season and it was really absorbing to watch.\\n\\n\r\nGin no Saji - especially this season - is truly a great slice of life anime and one that I will treasure for a long time for the valuable life lessons it teaches.",
            "date": "2016-05-17T16:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 218792,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4811114.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UndutifulOne",
                "username": "UndutifulOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=218792"
        }
    ],
    [
        {
            "content": "Popular media tends to reflect the urban and suburban lifestyle. The life of the farmer has been nearly forgotten, and with the rise of technology, agriculture is often treated as a thing of the past. While we do not normally think about the meat and vegetables sitting in our fridge, the life we know might cease to exist if these everyday products were suddenly taken away from us. \r\nSilver Spoon (known in rōmaji as \"Gin no Saji\") may serve as a reminder of what is taken for granted, but it also happens to be a highly enjoyable experience in its own right. It shows whya simple, tangible story is often more effective than one involving superpowers and end-of-the-world scenarios. There is little here that we couldn't find in our own lives, and that's precisely why it works. Silver Spoon shows there is beauty in an unremarkable life.\\n\\n\r\n\"Beauty\", perhaps, is not something that would normally be attributed to the handling of manure and the slaughtering of livestock. But Silver Spoon shows these issues under a different perspective. The farmers who let their livestock visit the slaughterhouse are not necessarily the heartless creatures the PETA tends to colour them as. More often, the farmers care for their animals; when they are given no choice but to send one of their pigs or horses to the slaughterhouse, the farmer feels regret. But they understand. They know that not every creature can be blessed with a long and happy life. There is a sort of bittersweet irony to human nature, and the protagonist, Hachiken, eventually grows to understand by the end of the story: things are not always black-or-white. A grey or a silver is maybe the most common. \\n\\n\r\nSilver Spoon is not preachy with its themes. It does not proselytise or portray farmers as saints. There is a strong sense of maturity and realism to the story, and often these themes are presented with light-hearted humour rather than excessive drama. The audience is never forced to feel a certain way; they don't even need to think about the themes if they would rather not. There is certainly a deeper meaning within Silver Spoon, but as simple entertainment it succeeds just as well. \\n\\n\r\nThe protagonist, Hachiken, is where the story shines the brightest. He is rebellious, depressed, the epitome of the angst-filled teenager. Hachiken looks down on the activities of his peers; he finds the work tiresome and disgusting. The notion of cleaning a pig's cage or cutting apart an animal for food feels degrading and inhumane. But he matures. He does not learn to enjoy these activities, but he gains the ability to respect others' lifestyles. His internal world becomes less about himself and more about the people surrounding him. He understands that he felt alienated in the past as a result of focusing only on himself. Humans are a social creature that require cooperation to find peace... usually. \\n\\n\r\nHachiken does not mature from melodrama or heavy-handed 'lessons'. He matures simply by living. The episodes of the show rarely contain any significant drama, and controversial topics (such as the slaughtering of livestock for food) are treated in a very down-to-earth, realistic manner. Silver Spoon could have easily become a sort of pro-slaughter propaganda, but it is not. Not in the slightest. It portrays both the good and the bad in equal measure. The only real issue with Hachiken's characterisation is that his stubbornness can get irritating, but even that seems a part of the point. The characters are not portrayed as inherently 'kind-hearted' or 'bad' people. They are human beings with their own traits and flaws. It's also nice to see an anime that actually focuses on the adult characters, too, instead of conveniently erasing them through the 'overseas trip' cliché. I've had quite enough of that. \\n\\n\r\nSilver Spoon is a joy to watch even if you have no interest in the agricultural lifestyle. The activities that the characters participate in is very insightful, and there's a good chance you will learn a few things about farming along the way (I certainly did). The only problem is that the comedy is very hit-or-miss. It is completely and utterly Japanese... filled with exaggerated reactions, slapstick, and other things that western audiences are unlikely to find amusing. It feels repetitive and uninspired, almost like the mangaka threw these jokes in simply to /have/ jokes. \\n\\n\r\nThat said, the art is of a consistently high quality throughout. Even during the last third of the season when animators tend to make the most mistakes, Silver Spoon still manages to look just as clean as it did at the beginning. There is a sort of 'chiselled' look to the characters' faces which also gives the show a distinct visual style. Being the second major project from Hiromu Arakawa (of Fullmetal Alchemist fame), you will undoubtedly see some similarities between the two. Silver Spoon's anime adaptation may not have nearly the budget of Brotherhood, but it looks just fine on its own terms. There's hardly a reason to complain. \\n\\n\r\nThe music verges from great to completely out-of-place. There are some beautiful tracks but they are hampered by poor usage. The last few episodes of the second season, for example, contain several scenes with sombre classical music playing while two major characters argue with each other. The piece itself is nice... but did it really have to be used in this particular scene? The more quiet tracks, the ones that are less noticeable are what carry the majority of the emotion. It truly feels like a slice-of-life. \\n\\n\r\nI can't imagine there would be a reason for any fan of anime to skip a series like Silver Spoon. If you are looking for teenagers screaming at Titans, I suppose, Silver Spoon might bore you with its lack of action scenes. But this lack of action is the series' greatest strength. It is introspective rather than epic, mature without ever forcing itself. The subtle drama feels meaningful; it works because it focuses on ordinary people rather than superheroes. You do not need a vested interest in the slice-of-life genre to appreciate Silver Spoon. It is a brilliant, heart-warming story that nearly anyone can enjoy. \\n\\n\r\nSilver Spoon may be the antithesis of what Fullmetal Alchemist represents, but Arakawa shows that an emotional story can also be told through the simplicity of everyday life. We don't always need superpowers and villains to be excited. A simple tale can be more than enough.",
            "date": "2014-04-12T13:40:00+00:00",
            "helpful_count": 244,
            "mal_id": 139683,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=139683"
        },
        {
            "content": "By expressionism and symbol, a silver spoon is symbolic for wealth. The phrase of “been born with a silver spoon in his mouth” is synonymous relating to an individual born from the rich family. But the series, Silver Spoon/Gin no Saji, stands on the opposite side of that symbol. Most of the characters aren’t rich and neither are any of them born from a wealthy family. However, what they do have is the talent and ambition that drives them to fulfill a dream. Making a dream into a reality is tough. Competitions and life itself becomes an obstacle. Gin no Saji/Silver Spoon delivers that veryidea of following a dream by heart. A journey into Gin no Saji is more than about following that dream. It’s about learning, discovery, and finding out the essence of themselves.\\n\\n\r\nWritten by Hiromu Arakawa, best known for her work with Full Metal Alchemist, Gin no Saji depicts the life of a young boy named Yugo Hachiken. Season 2 sets off after the conclusion of the first arc. Needless to say, it’s imperative for one to complete the first season to fully appreciate season 2. The foundation of the first season revolved around farm aesthetics and just what’s like to be involved in the field of agriculture. It’s almost like opening the doors to a brand new world and realizing just how difficult it is to survive. In this season, more dynamics are explored beyond the farm jokes. What we learn about the characters impacts their future as they follow a dream, a road of inspiration to become someone they always wanted to be. \\n\\n\r\nTo appreciate this series, one must first embrace the style of its portrayal relating to the agricultural field. The setting takes place at a farm, a place free of crime, discrimination, or corruption. It’s simple and realistic with the atmosphere along with the farm animals. Just picture yourself there on the field working with cows, chickens, and horses. For Hachiken, he truly learns what hardship is like as a farmer. But more importantly for him is about discovery, to venture out of the life he once was so used to. And honestly, that’s an important concept in life itself. When something changes in our life, we try to adjust, adapt, and eventually become part of the norm. Hachiken gets used to working on the field with others and make discoveries of what hardship is really all about. The anime that is adapted from the manga of the same name is written by the author based on her own experiences when she grew up in Hokkaido. In essence, it brings out what her childhood was like and is a strong influence with the themes in this series. \\n\\n\r\nBut capturing those moments is difficult with a small cast of characters. Luckily, Hiromu’s writing cleverly brings out her characters to life with idiosyncratic attributes. She accomplishes that through a unique craftsmanship of these attributes to tie in with the story. Most of the characters follows their dreams and this becomes prominent later on as a major theme. In the early stages of the season, we already see the passion that they have for their dreams. Examples such as Mikage’s dream to care for horses as a profession, Ichiro’s inspiration to become a professional baseball player, or Hachiken’s older brother Shingo to become a chef. But life offers challenges. For Mikage, this comes as a burden for both her and the family. What we must understand is that there’s a difference between choosing one’s dreams and deciding who make those decisions for you. Obstacles limits these choices yet there is a profound way of how this show demonstrates ways to overcome them. With support and spirit, an inspiration is bought about that spreads influence.\\n\\n\r\nHachiken on the other hand still wonders about what road he needs to take for his future. But from season 2, we find out quickly about his present position as the new vice president of the Equestrian Club. There’s an emphasis of responsibility to be placed on him as the future of the club lies with his hands. It’s acceptable for this season to put Hachiken in such a position to test him his skills as a person. Because being a leader, one must also demonstrate responsibility, the passion to hold a group together, and prove their self-worth. All this ties in together with building a future and following dreams by such emphasis. At the same time, we get to see relationships Hachiken builds with other characters. In particular, his relationship with Mikage is explored by friendship, respect, support, and potential romance. The way the two interact has a sense of unique dynamics as they talk about their family and struggles. In fact, the two are actually similar in many ways with their relationships with their families. Both families wants the best for their children yet they also have high hopes for them, placed at almost a burden expense. And while Mikage is an only child, Hachiken is often compared with his older brother Shingo that causes him to feel self-doubt. Nonetheless, the duo’s conversations throughout the season brings together both realism and is relatable. Ask yourself this: do you sometimes find yourself living in someone’s shadow when you’re compared to that person? \\n\\n\r\nFocusing on the main story is quite a driving factor but at the same time, this season also brings comedy and fun. The thought of working with animals firsthand to gain experience may seem like a daunting task at first. Yet, we see how much fun some of the characters have as they embrace the way of the farm life. Even Hachiken becomes accustomed to it. The comedy comes from the way Hachiken experiences how to deal with animals and the mistakes he makes. Yet, he learns from these mistakes (most of the time anyways). The result of some of these mistakes often brings embarrassing attention and humorous events. At the same time, there’s silliness with the way animals behave around the characters. In particular, Aki’s horse Maron plays a comical relief as a character that displays human traits such its egoistic behavior and even tsundere like tendencies. And on the human side, we have a new character named Ayame with a stylish fashion of her drill-like hair but colored by an aristocratic way of speaking. Looking carefully, the rivalry she has with Mikage can almost be interrupted as a joke by the results of their so-called “contests”. Rather, she does stand out more with the way ‘silver spoon’ is depicted as a wealthier individual; a contrast to where Mikage is coming from as in a normal family. \\n\\n\r\nWith 11 episodes, there are some parts that are seemingly omitted or otherwise, left unresolved. In particular, the relationship between Mikage and Hachiken is explored but doesn’t seem to progress too far. There’s an obvious attraction with the two that are seemingly drawn by their similarities. Yet, the show chooses to ambiguously present this in a more platonic way. At the same time, more emphasis is still focused on aspects of the farm such as taking care of animals. It has been dealt with so many times before in the previous season that it feels repetitive by this point. Also, a lesser focus is on Hachiken’s character himself. Most of the other cast members gets emphasis on their future while he is still on the farm asking himself what he should do when he grows up. As a main character by this point, I find this slightly unattractive by such generalization and its setup. And speaking of unattractive, some of the jokes become stale to a point of being on a detached direction of diminishing effect.\\n\\n\r\nArtwork still retains the style of the first season. We get the natural feeling of how the agricultural field is depicted by its backgrounds. The animals are crafted with delicacy and with the intent to demonstrate realism. Characters are decorated with simplicity. Female characters aren’t designed with heavy makeup but rather to themselves. No stereotypes. No sexism. No stupidity. The show’s character cast feels real with a bond to the farm. As you watch this season, there’s a sense of attachment you may develop with the characters as well just by their outlooks.\\n\\n\r\nAs far as soundtrack goes, the show is consistent although it’s nothing masterpiece worthy. The OST is smooth with a calm music tone. The OP and ED songs demonstrates degree of a countryside feeling. Most of the characters’ voices are presented well. In particular, Hachiken’s expressions of his voice mannerisms are demonstrated with realistic responsiveness. Whether this can be anger, fear, or anxiety, there’s credibility that makes Hachiken’s voice something to remember.    \\n\\n\r\nWe all have dreams. Whether you realize it or not, every single day that draws by takes you closer or further away from it. But for our characters in this show, they try to become closer to making their dreams into a reality every single day of their lives. Gin no Saji responds to the way of following dreams explicitly through demonstrative episodes with characterization. Dynamics are explored with a decent balance of humor and realism. It can also be relatable by the setting and just in general, real life itself. After all, life is a challenge because there’s no such thing as free lunch.\\n",
            "date": "2014-03-28T01:04:00+00:00",
            "helpful_count": 77,
            "mal_id": 137429,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137429"
        },
        {
            "content": "The Silver Spoon is real, and even now yours for the taking.\r\nIf there's something to be said about Gin no Saji (trans. Silver Spoon), we can probably boil it down to three core ingredients: Food, Agriculture, and Life. Those are no small matters, but Arakawa Hiromu has masterfully blended these hefty issues into an easily digestible, comforting, and befittingy resonant, intimate work.\r\nA coming-of-age slice-of-life school drama taking place in the remoteness of Hokkaido, Japan, this anime harvests its bounty from the wealth of its source material, but in the move from manga to anime, it augments and adapts it perfectly, adding garnish and spice tothe completed dish.\\n\\n\r\nAs a second season, expectations and method have already been pre-set, familiar to the returnee viewer, but in this second series Gin no Saji (GnS) advances beyond those previously well-laid foundations. Once again, viewers are treated to those necessary daily hardships and mundane chores of farming life, but also its joys, pleasures, and novelties (oh food, so sacred!). Through that familiar trial of school-life, the varied cast of boarders share with us a glimpse of the agricultural world: the nuanced considerations of livestock-raising, the delicate handling of the horse by its rider, and that telling contradiction of love and necessity with which all live-stock animals are treated within the industry. The farming life and related rural community is lovingly portrayed, yet also, as one of Gin no Saji's good virtues, it is very much grounded in reality, and when events turn against our protagonists, there too, is meaningful realism.\\n\\n\r\nOur hero, Hachiken is a wonderful expy for the viewer. Now familiar (as we are) with the farming hours and various chores, he continues to learn through experience, mistake, and labour, of this huge-world, an industry and life so pertinent to the world-at-large, yet so taken for granted, its hardships forgotten. In his studies and adventure, Hachiken grows so very much, and this is the key to the genuinity and excellence of GnS: the fantastically crafted characters. \\n\r\nEach character brings a necessary layer to the show, and while not all are developed as fully as our main characters, they each have something to add with their unique designs and endearingly comedic traits.\\n\r\nBut, ultimately, this is a show centred on Hachiken and his youthful negotiation through hardship, friendship, and expectation; it is here that we get Arakawa's sincere portrayal of the complexities of education, family, economic reality, and all the never-ending steps we take towards our future. Most gratifyingly, Hachiken is a character who battles his insecurities, and bull-headedly rises to those challenges.\\n\\n\r\nVisually, Gin no Saji requires fairly little portrayal of movement, but the animation team has done a great job in adapting the manga stills while maintaining the perception of action and dynamic change. This is most obviously combined with the quick-transfers and exaggerated character 'reactions', delivering both effective gag-comedy, and visual interest.\\n\\n\r\nVoice actor Kimura Ryouhei has done a suiting job as the worry-wart, yet hardy Hachiken, and his acting elevates the show, aided by the superb supporting cast. The soundtrack is fitting, if not too stand-out as expected of an easygoing drama, and the Opening/Ending themes are also properly welcoming and warm.\\n\\n\r\nIn conclusion, Gin no Saji is a pertinent story, reminding us of the choices, indecision, and complexities of youth. The agricultural aspect gives a much-needed flavour, educating (never preachily), adorable, and scrumptious. There's drama, but never needlessly heavy, but fittingly serious and real. There are no cure-all solutions, there's nothing here outside the common experience, only a lifestyle unfamiliar to us. This is no stellar visual artwork, as its device is to adapt a brilliant story from paper to screen, and it does so flawlessly.\\n\r\nThe Silver Spoon that we all possess, that inheritance, that overlooked richness, or even literal wealth. It takes on countless meanings, and yet reminds us of our worth, our past, and what we are, that is, a coming future. All this contrast can be found in Arakawa's clever title and furthermore in this exellent adaptation.\\n\\n\r\nIn watching this anime, you will find laughs, youth, the simple adversities, and also worldy realities. Like the myriad of animals in this world: companion, livestock, worker; this show will be a worthy support as you discover a new and different, yet charmingly familiar world.",
            "date": "2014-03-28T07:12:00+00:00",
            "helpful_count": 72,
            "mal_id": 137473,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42128.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ckan",
                "username": "Ckan"
            },
            "url": "https://myanimelist.net/reviews.php?id=137473"
        },
        {
            "content": "I really enjoyed the first season of Gin no Saji. It goes w/out saying that I had really high expectations for the second season. And for the most part it didn't disappoint.\r\nStory/Characters:\r\nThe story picks up where the last season left off where Hachiken is slowly getting used to the life at Yezo high. He's made friends and is now relatively enjoying his school life. But his character will develop by leaps and bounds by the end of this season w/c was why I liked it as much as I did.\r\nThe character development... This aspect was really prominent this season and I enjoyed it a lot.Hachiken, Mikage and Komaba all have their moments and all of them felt really genuine and real. The drama also escalated quite a bit and if someone told me I'd cry because of dairy cows before watching this series I'd have thought them to be crazy. The story really upped the ante this season and it was great.\\n\\n\r\nArt/Sound:\\n\\n\r\nI personally thought the new OP/ED weren't as catchy as last seasons but that's just me. A-1 remains consistent animation wise and still manages to give us really great backdrops.\\n\\n\r\nOverall:\\n\\n\r\nAs much as I liked the last season I think season 2 trumped it by a fair margin. The story is moving along in really surprising ways and the roller coaster of emotions it takes you to is really enjoyable. Especially the last few eps. Hachiken and the gang are growing steadily and you feel all warm (but a little melancholic) inside seeing them go through all the things life throws at them. I'm pretty much up for a third season if ever. Another great SoL series to remember.",
            "date": "2014-03-27T19:32:00+00:00",
            "helpful_count": 48,
            "mal_id": 137341,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1396801.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/swordstriker21",
                "username": "swordstriker21"
            },
            "url": "https://myanimelist.net/reviews.php?id=137341"
        },
        {
            "content": "The Silver Spoon was real after all…\r\nStory/Plot: we have the story of Hachiken, a young high school boy who enrolled an agriculture school/college in order to escape his past and to find new opportunities along the career he is pursuing to.  This follows up season 1 right off which is something I like about this series. Along his journey, Hachiken gets to meet many friends, many experiences, and the harshness he goes through facing reality which is something we all experience at some point in our lives. What I like about this, as the story goes on, is the viewer learns about agriculture environmentsuch as working in the field, how to make cheese, how to make bacon, dealing with the livestock, among others important things. The lessons this anime is bringing upon us is truly meaningful. (9.5)\\n\\n\r\nCharacters: If there’s something I like the most in this is the dialogue and the character development.  Every character has his/her own goal and each one of them got his/her own problem to take care of. We get to see how they grow up and learn according to the different tasks they get involved as well. The comedy approach always comes in the right moment and somehow that’s something I find important in a slice of life. (10)\\n\\n\r\nAnimation: A-1 pictures delivers a great animation and quality for this series.  The backgrounds, the animals and the characters seem to be in the right picture. Props to them. (9)\\n\\n\r\nSound: Beautiful melodies and sound effects for the drama moments and all the characters. The Opening song was good and the ending song was lovely from my perspective. (9)\\n\\n\r\nFinal thoughts:\\n\r\nGin no Saji is one of those series that should be on the top list. It’s a shame is considered an underrated anime having such a great story. Hopefully we’ll get to see a Third season…we need more anime like this. (9.5/ 10)\\n",
            "date": "2014-03-30T00:32:00+00:00",
            "helpful_count": 12,
            "mal_id": 137843,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188478.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sCr4G",
                "username": "sCr4G"
            },
            "url": "https://myanimelist.net/reviews.php?id=137843"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nEverything you do takes some amount of effort. Some things take a small amount, such as getting out of the bed in the morning or putting on your shoes. Other things take a considerable amount, such as studying for an exam or learning a profession. Above all, pursuing your dreams takes the most effort of all. In Gin no Saji Season Two, this effort and everything that it entails is explored, and when you finish the series you are left feeling that you can take on the world.\r\nSTORY\r\nGnS2 begins where GnS1 had ended; Hachiken and friends are currentlygoing through their agricultural high school and attempting to live their everyday lives.\\n\\n\r\nWhile watching Season Two, it becomes apparent pretty quickly that the focus shifts away from farming and towards the characters' personal dilemmas. The transition is handled pretty nicely. Being slice of life, the show can take such a leap. While the undertone for the episodes involves things related to animals, such as Ban'ei racing or cheese making, the purpose of what they are doing isn't in the activity itself. Rather, it is a vessel to drive the characters' thoughts and ideas into the forefront. In other words, GnS2's focus is its characters rather than its world.\\n\\n\r\nSo what does the show focus on this time? Previously, it was farming, agriculture, and morality. This time, its about hard work, dreams, and learning how to get back up when you get knocked down. The show is pretty much split into these three \"arcs.\" When watching this season, they made it extremely easy to relate to the characters because they do the same things that you, me, and everyone else does. Starting with hard work, the show takes a look at all sides. For some, hard work doesn't mean much.\\n\r\nThat is to say, they can get by with little effort. For others, they have to put in tremendous amounts of time in order to get the results they want, and even then the outcome is nothing short of disastrous. Hachiken, Mikage, and even the side cast experience these effects, and the show captures their situations in a believable manner.\\n\\n\r\nThe second idea GsN2 focuses heavily on is dreams. Now, these are not just the dreams of the characters, but also of those around them. Many people have expectations placed on them. Sometimes, these expectations weigh people down so much so that they cave under the pressure. One's dreams are interesting because not only are they something that are not physically tangible but at the same time, they are one of the only things you can truly call your own. Once again, Hachiken and the rest of the cast help to demonstrate these dreams, what it means to achieve them, go for them, and ultimately lose them. It can't be stressed that the show does a great job of making these situations believable, that what they are doing could easily be seen the following day.\\n\\n\r\nThe final portion of Gsn2 is about bouncing back from failure. As the show states, everyone fails; it's just human nature to make mistakes. No one is perfect, as much as they may seem or want to be. And that's a solid message. For example, looking at my reviews, while I always try my best to make my writing as coherent and well-worded as possible, sometimes I just don't type the correct thing. This can be applied to anything. Failing isn't something you should be afraid to do. It's difficult to accept, but failing should be looked at as a learning experience. Accept what happens, understand what you did wrong, and better yourself for the future. I keep reiterating myself, but the characters prove this mentality once again. The show does a fantastic job of letting us see how real life really is when it comes to these situations.\\n\\n\r\nANIMATION\\n\\n\r\nAs with Season One, GsN2 does a nice job both in its art style and animation. The animation specifically seemed to pick up a bit during certain emotional moments (more character movement and facial expressions) this time around.\\n\\n\r\nThe animals once again are drawn quite nicely, especially the horses. The large Ban'ei horse specifically always looked extremely intimidating. The cows, pigs, and chickens aren't shown as much this season, but they too were nicely detailed.\\n\\n\r\nThe characters maintain the same designs from season one. Again, nothing too stand out, but Hachiken wearing glasses is something I can relate to!\\n\\n\r\nCHARACTERS\\n\\n\r\nGsN1 had placed Hachiken in the lead but pretty evenly spread out the on-screen time for the whole cast. This time, the show pretty much only focuses on Hachiken and Mikage.\\n\\n\r\nI actually liked this approach. With this move, even though the show is slice of life, it allows for great characterization and depth for the main stars.\\n\r\nAs such, Mikage's character is developed way past just liking horses. She learns to start relying on others, using the confidence she had hidden deep inside, and chasing after her dreams. It doesn't happen right away. Instead, she requires a little pushing from a bookworm in glasses.\\n\\n\r\nThis bookworm is none other than Hachiken. GsN2 throws a lot more drama his way than the previous season. Being a \"guy who never says no\" is no easy task. And he learns the hard way that being such a guy has both its upsides and downsides. For most of the series, he expresses his inability to have a clear goal or dream in mind, unlike the rest of his friends. But he realizes that his situation is almost as good; stealing a phrase from my own review, the world is his oyster. So while he doesn't necessarily have a future dream to latch onto, he instead spends his time focusing on helping those around him, especially Mikage.\\n\\n\r\nAnd with this greater focus on Hachiken and Mikage comes a greater focus on their relationship. I'll say it until the day I die, but I love romance, and therefore the pretty large increase of it (comparatively) in GsN2 was greatly appreciated. The feelings are present, and while not deeply explored, it is nice knowing that they appear to be more than just good friends.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is fine, giving you a nice sense of looking towards the future, which its visuals look to drive home as well. The ED is fine as well, being more uplifting and happy, fitting nicely with the overall pleasantness for a slice of life type show.\\n\\n\r\nAs with GsN1, the only really stand out piece from the soundtrack is the \"stair step\" orchestral piece. It has some small variations here and there throughout the season, and I always liked hearing it.\\n\\n\r\nVoice acting has no amazing performances, but I liked Ryouhei Kimura's rendition once again of Hachiken.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhile GsN2 does take a more serious and dramatic turn, it is probably even funnier than the first season. The jokes once again are not from the writing but rather from what happens in the situations that are presented. The President is always hilarious to see, Hachiken's reactions to the events in front of him are always funny, and the character interactions are top notch.\\n\\n\r\nThe romance elements present are also very enticing to me, and always left me wanting to see where our couple were heading next. While Hachiken and Mikage have their own problems to deal with, being able to support one another was very nice to see, not only to my eyes but also to my heart.\\n\\n\r\nTo be honest, I watched all the episodes in one day. I don't normally do this with a show, but GsN2 always kept leaving me with wanting to see what was going to happen next. And after finishing the series, I am eagerly awaiting the time I get to return to Ezonoo to see Hachiken, Mikage, and the rest of the cast eagerly pursuing their dreams.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, fantastic slice of life that incorporates real life lessons\\n\\n\r\nAnimation: Good, fine art style with nice animation\\n\\n\r\nCharacters: Good, Hachiken and Mikage are are very relatable\\n\\n\r\nSound: Fine, okay OP, ED, and soundtrack\\n\\n\r\nEnjoyment: Great, extremely easy to lose yourself in\\n\\n\r\nFinal Score: 8/10",
            "date": "2014-09-24T19:51:00+00:00",
            "helpful_count": 9,
            "mal_id": 161985,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161985"
        },
        {
            "content": "Story : 9\r\nThe story for the second season follows very closely the first there is no time gap but things change greatly from one season to the other. The first season was funnier and more focused into exploring the funny aspects of the characters and school but the second focuses more on the struggle of the characters both personal and academic. It focuses more on how the characters overcome their issues and struggles especially in regards to family matters, dreams and aspirations as well as deep psychological issues brought by a sense of destiny and obligation. Keep in mind that this does not mean thatthe series is no longer funny and enjoyable but that it just focuses more on 'actual' issues.\\n\\n\r\nArt: 8\\n\\n\r\nThe art is pretty much what you have come to expect from the first season. There are no visible differences. It is still pretty good. Perhaps the most notable change are facial expressions due to the larger variety of emotions felt by the main and supporting characters.\\n\\n\r\nSound: 6\\n\\n\r\nExactly like the first season the music seems to be irrelevant. Once again the ost does not complement the actual story despite the story line being more profound in the second season.\\n\\n\r\nCharacter: 8\\n\\n\r\nThe characters continue their journey through life and in several cases they become more relatable. The character development has indeed escalated but due to this the series lost some of its funnier aspects. This is by no mean a bad thing.\\n\\n\r\nEnjoyment : 8\\n\\n\r\nDespite the changes this season is very enjoyable mainly because it shows us different aspects of the characters. Yes it may not be as funny as the first but the fact is that the creators dared to show us a more realistic perspective of the characters lives, something that I personally found quite enjoyable.\\n\\n\r\nOverall : 8\\n\\n\r\nOverall the series is very good and it is my belief that the change of pace and direction in season 2 complements season 1 greatly. I would prefer if there was a season 3 in order to see how the story unfolded after the end of season 2 but in order to explain it better I would have to add spoilers which is never a good thing.\\n\\n\r\nIn conclusion I highly recommend it.",
            "date": "2015-02-26T04:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 181239,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=181239"
        },
        {
            "content": "SILVER SPOON tackles some very different and serious themes in its second season, while still retaining that effervescent charm that made me fall in love with it immediately. Hachiken's growth continues to be compelling and relatable, regardless of what my own school or family experience has been like.\r\nBut the real standout of this season is Komaba. His arc reaches a level of pathos and maturity that most shows wish they could achieve, and it's all steeped in a realism that hits too close to home. I love and respect how the writers went all in on this storyline, without taking any easy outs. It's roughto watch, but so much more rewarding because of it.\\n\\n\r\nTruly, truly unfortunate that this appears to be the end of the road for this wonderful anime. I suppose we should be thankful we got a second season at all.",
            "date": "2018-01-25T11:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 269609,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6890812.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JediNut",
                "username": "JediNut"
            },
            "url": "https://myanimelist.net/reviews.php?id=269609"
        },
        {
            "content": "Gin no Saji is one of the few feel good anime that just makes you feel refreshed and motivated if you are feeling down or just in the spiral of depression. The story starts off with Hachiken, a normal school student who runs off to an Agricultural school to get a break from all the pressure he's in and the breakdown from not being able to clear his entrance exam.\r\nWhat makes him relatable is that if you are a person struggling in your school or college then you have obviously faced the pressure that comes with it about what you want to do with yourlife. Hachiken is just like that and in every episode you can relate more and more with the people he befriends, their stories and their dreams and the challenges they have to face.\\n\\n\r\nThe soundtracks are good although the opening isn't really that great, voice acting is great too. The art is enjoyable and funny at times, it is an anime that gives you both a message as well as a good laugh.\\n\\n\r\nThis is a story about dealing with life, understanding the importance of friends in life and also how you should name the livestock you are going to eat.",
            "date": "2017-03-29T06:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 243901,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5204076.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HaiseK",
                "username": "HaiseK"
            },
            "url": "https://myanimelist.net/reviews.php?id=243901"
        },
        {
            "content": "Note: this was written a long time ago as a review of both seasons, but I’m submitting it to season 2 because reasons.\r\nThe best slice-of-life anime are able to take a hobby you have no interest in and make it interesting.  Before watching Silver Spoon I would have never thought an anime about a city kid going to an agricultural school would keep me entertained over 22 episodes, and yet here I stand corrected.\r\nYugo Hachiken is a high schooler who's extremely intelligent, but becomes fraught with the weighty expectations of his father.  Unlike most of his peers, Hachiken hasn't given much thought tohis future - this fact creates tension between him and his father, and the stress of the situation forces him to get as far away from his family as possible.  To that end, Hachiken enrolls in Oezo, an agricultural school located in rural Japan.  \\n\\n\r\nOnce enrolled, Hachiken expectedly excels in the academic portion of school, although nothing he experienced in the city has prepared him for the laborious-but-rewarding work that makes up the other half of his curriculum.  After a rough start, Hachiken starts to respect the demanding schedule that comes with being a farmer.  That respect goes a long way towards proving to his father and himself that he can be productive despite being directionless.\\n\\n\r\nThe heart of Silver Spoon's story has to deal with the maturation of Hachiken.  He comes into Oezo as an outsider with only book smarts at his disposal.  He makes various friends along the way, and genuinely starts to enjoy the physical practicums that accompany his studies.  He wakes up at 5 in the morning to tend to the farm animals, and his duties include baling hay, grooming horses, raising piglets, and collecting chicken eggs just to a name few.  Our journey as viewers -- assuming none of us are farm hands -- mimics Hachiken's as a student.  A lot of what he experienced is educational and brutally realistic.  \\n\\n\r\nThe way Silver Spoon shows the life of farming is extremely graphic in some situations, and probably isn't for the faint of heart.   Exploring the process of collecting eggs and raising pigs only to be slaughtered is sobering, but if you're meat-eater, like Hachiken, you're likely to go from being distressed to reverential of the finished product.  What Hachiken learns at Oezo he applies to his own life, which makes him less apprehensive as a person.  He drops his guard, and really starts to connect with his fellow classmates, even when they politely ask he basically mind his own business.\\n\\n\r\nOther than the lifelike depiction of farm life, Silver Spoon also explores the business side of agriculture.  Unless you're a huge farm, you're more than likely operating in the red.  Farms incur huge debts, and if their harvest goes bad, or their animals aren't producing like they should, they can go under real quick.  It's even worse when you consider that if someone from another farm consigns a loan; their livelihood is threatened if the other farm defaults on it.  Some of Hachiken's friends are in that exact predicament, and it forces them to make some tough sacrifices.\\n\\n\r\nA prevalent theme in Silver Spoon is personal dreams vs. familial responsibility.  Two characters are put to the test in this regard: Mikage and Ichiro.  Mikage is the obligatory love interest.  Hachiken falls for her almost immediately, while she tries to herd him into the friendship stable.  As the series progresses, it becomes obvious that they both really like each other, but their relationship doesn’t payoff romantically.  However, he does help her to become more assertive with her family.  She loves horses and wants a career working with them.  The only problem is there’s no one to entrust her family’s farm to but her.  Likewise, Ichiro dreams of being a professional baseball player, except he is the lone man in a household full of women.  With two younger sisters and an exhausted mom, he must decide what's really important to him.\\n\\n\r\nSeeing Mikage and Ichiro go through their respective trials assists Hachiken in finding his own calling: helping others.  He might be aimless, but he takes on a lot of responsibilities while at Oezo, and he's a better person for it.  He ultimately realizes no matter the size of the contribution, it could have a substantial effect on someone's life, as illustrated by a short, touching note he read from a person whose spirit was lifted simply by seeing horses jump over hurdles.  \\n\\n\r\nDespite Hachiken's growth, most of the supporting characters are underdeveloped.  They either exist to give Hachiken sage advice or to instill humor with their strange character quirks.  Even Mikage is kind of bland until the second half of the second season.  Also, a girl named Tamako, who fluctuates between obese and skinny, is scarcely used.  Aside from the obvious visual gag, her physical changes convey just how secure she is with herself.  She can astonish the entire school with her beauty, but she’d rather be overweight because it makes her feel more comfortable.  It would have been nice to have a single arc focused on her.\\n\\n\r\nWhile Tamako’s varying weight is played for laughs, the overall character designs of Silver Spoon is serviceable.  There are some of characters with exaggerate features that make them visually clash with everyone else, but you eventually get used to them.   As I mentioned previously, there are some very graphic scenes dealing with the life cycle of farm animals, and the artists pull no punches.   The cow birthing scene is slimy and blood gushes when chickens are beheaded.  The detailed scenes of nature are countered with gorgeously produced food.  There’s one time when Hachiken makes pizza for the entire school, and the pizza he cooks looks mouth-watering, almost like you can reach into the screen and grab it.\\n\\n\r\nSilver Spoon does exactly what any good slice-of-life anime should do: It shows passion for a niche interest through the eyes of a character who gradually changes over the course of the series.  \\n",
            "date": "2016-07-06T15:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 223318,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4156853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Psycho_Pass",
                "username": "Psycho_Pass"
            },
            "url": "https://myanimelist.net/reviews.php?id=223318"
        },
        {
            "content": "This anime is surprisingly enjoyable. I really didn't expect to like it as much as I did. I mean, it's an agricultural anime. You wouldn't think that'd appeal to a majority of people, but it's honestly an anime that anyone would love. It's very charming.\r\nMy only issue with the first season of this anime was that we didn't get a backstory on the main character's reason for being at this agricultural school. The struggles he was going through didn't hold as much weight as they could've had we known the environment he came from. This season fixed that a little. You don't really get acquaintedwith how his life was before the school, which is a little bit disappointing, but you do get a sense for why he chose to leave. That bit of context really helped me to enjoy the current storyline a lot more.\\n\\n\r\nA couple of the other main characters got some development as well, which was nice considering the fact that we didn't get a lot of resolution to their conflicts in the first season. The story the anime tells about family and finding your dream is really lovely, and I think using agriculture and farming as the medium for those ideals is very unique. \\n\\n\r\nIt isn't the most dramatic anime in the world, but I think it leaves you with a sense of hope for the future that's really beautiful. I'd definitely recommend this anime to everyone, even if you don't think it's your kind of thing. This is a comforting anime to watch, and I'm glad I took the time to experience it.",
            "date": "2019-01-25T16:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 299997,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=299997"
        },
        {
            "content": "Minor spoilers ahead. Proceed with caution.\r\nHow do you survive as a food producer in a market as fiercely competitive as Japan?\r\nHachiken sure doesn't know, but he'll probably die trying if you let him.\r\nSeason 2 carries on from where season 1 left off, and soon we start to see some real drama. Sure, the difficulties of a school where you get up at 4 AM and are forced to participate in all the tasks of animal husbandry is hard enough, but what happens when one of your friends' farms can't pay the bills? Season 2 is a testament to a great anime because the manga it'sbased upon is so good, and yet the production staff are doing more than giving color, motion, and sound to the manga.\\n\\n\r\nCharacter development is the name of the game here. After grappling a couple of his own challenges, Hachiken takes on serious issues with two close friends, again, like a 100-pound linebacker with a chip on his shoulder. But in doing so, and despite him not finding a solution, he gains their gratitude and deepens their relationships. One recurring theme is that Hachiken's efforts are rewarded in unexpected ways, even if the one he's trying to make proud is never satisfied.\\n\\n\r\nSpeaking of which, Kenyuu Horiuchi voices Hachiken's father; the other show I remember him in is Gundam X, where he plays a stern but deeply principled ship commander. I thought this was a bit of a miscast, because while Horiuchi plays the character as coldly as possible, the warmth of his voice neutralizes the character's personality. I thought someone like Ryotaro Okiayu (the voice of Byakuya in Bleach) or Toshiyuki Morikawa (who played one of the main villains in Gundam X and the first Aquarion) would've been a better fit in terms of voice timbre-- properly written and directed, those two actors can chill you to the bone. Still, Horiuchi is an excellent actor, so this isn't a showstopper by any means.\\n\\n\r\nThis is the series that introduced me to the band Goose House, and the ending theme makes them sound like they're having the time of their lives while singing.\\n\\n\r\nFinally, there's a scene midway in the series that pays tribute to the victims of the 2011 earthquake and tsunami; the manga chapter with that scene was probably published not long after the disaster. In many ways, you can see how much care was put into the manga and animation.",
            "date": "2018-04-25T21:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 279029,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2367307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/earl_of_sandvich",
                "username": "earl_of_sandvich"
            },
            "url": "https://myanimelist.net/reviews.php?id=279029"
        },
        {
            "content": "The second season of Silver Spoon is just as good as the first, if not better. It continues and develops the story that in the first series was presented so well. There is now a greater focus on the characters and their development, and not only Hachiken as was the case in the first season: now Mikage is a main character as well.\r\nIt's still set in Oezo agricultural highschool, but there is less attention on the setting and the topics connected to it, which was what initially captured your attention in the first series it being so unusual. This series dwells less on the implicationsof attending an agricultural highschool as it isn't a novelty anymore for Hachiken. It develops instead the characters and the themes related to the issues those characters are struggling with: Hachiken's relationship with his parents, his father in particular; Mikage's decision to not carry on the family farm and how she gets the courage to break the news to her parents; Komaba's failure to become a professional baseball player and the implications that has on his future. And of course the relationship between Hachiken and Mikage is more developed as well. There are still lots of good comedic moments, but it's in the character development section that this anime shines.\\n\\n\r\nTo make it brief, if you liked the first season you'll have no complaints about this second season. There's more character development and less philosophical considerations. At the end of the series you don't really know what happens to our main characters: you don't know what path Hachiken decides to take, or if Mikage manages to get into college, or what happens to Komaba, or even if Hachiken and Mikage actually manage to get togther. But that's ok. It's ok if there is a third series, which I would definetely watch. But it's also ok if there isn't a continuation and it ends here. It manages to pull this off, I mean the fact that you don't feel cheated by the lack of a \"proper\" ending, because it isn't a plot-driven anime. It's character-driven and the characters are developed very well. You could go on writing about a person's life until the day they die, there are always new challenges to face and there are never any definete achievements, but if you're telling a story you have to stop somewhere. Anyway, as stated before, the second series does not disappoint but lives up to the expectations set by the first season.\\n\\n\r\nCollapse\\n\r\n7.5/10\\n\r\nstory\\n\r\n 6/10\\n\r\nanimation\\n\r\n 7/10\\n\r\nsound\\n\r\n 7.5/10\\n\r\ncharacters\\n\r\n 7.5/10\\n\r\noverall",
            "date": "2016-07-15T11:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 224102,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5537832.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JasonKKAA",
                "username": "JasonKKAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=224102"
        },
        {
            "content": "Gin no Saji 2nd Season is undoubtedly a masterpiece in the slice of life genre - for myself especially.\r\nThe story and character progression is a lot stronger in this season and you get a better understanding of the characters and their motivations and ambitions.\r\nThis anime has plenty of heart and angst and instils a sense of responsibility and duty to whoever watches it. \r\nThe art style is typical of modern animes however, Gin no Saji truly shines in the faithful rendering of animals and food.\r\nThe soundtrack is actually noticeably good, the orchestral pieces occasionally heard are truly outstanding. The OST is also fun and setsthe tone well.\\n\\n\r\nThe character dynamics and relationships truly take centre-stage in this season and it was really absorbing to watch.\\n\\n\r\nGin no Saji - especially this season - is truly a great slice of life anime and one that I will treasure for a long time for the valuable life lessons it teaches.",
            "date": "2016-05-17T16:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 218792,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4811114.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UndutifulOne",
                "username": "UndutifulOne"
            },
            "url": "https://myanimelist.net/reviews.php?id=218792"
        }
    ]
]