[
    [
        {
            "content": "It ended. I really ended. After forcing me to laugh so hard every episode, it disappeared just like that. Well, I'm not going to talk about the emptiness in my life or how desperate and lonely i'am after watching the last episode, but instead, I'm going to give you all some insights on the anime by writing this review.\r\nI'm going to start by the story first. To be honest, it's kinda' hard writing about the main idea of the story. Why? BECAUSE IT DIDN'T HAVE MUCH OF A STORY. Okay here it goes.\r\nHigh school country delinquent, Kazama Kenji thinks that he got what it takesto be the strongest and the sole ruler of Fujou High. Kenji, despite of having no special traits whatsoever and frequently considered to be a norm, is the leader of the infamous “Kazama Gang”. Together with his two long-time friends who are also in the gang, it seems that nothing could possibly go wrong. That is until one day, the gang bumps into a Game Development Club consisting of four ‘unique’, or to be frank, strange -elemental freak- girls with their overly brute and outrageous behaviors. Kenji could probably be able to say goodbye to his hopes and dreams by the moment he was forced (I really mean by force) to joined the club.\\n\\n\r\nDespite of what i wrote above, this anime isn’t about any of those ‘ruling the school’ thing. This is the story of a boy who believes that he, himself is an ‘infamous’ delinquent at Fujou High. Instead of acting like one, he spends his days of high school slacking off and playing meaningless games in the club that he was forced to joined. Sometimes he also acts like a good guy and the others will say \"aren't you supposed to be a delinquent?\".\\n\r\nReluctant at first, he soon finds the club and it’s member to be exciting and interesting and also often defends it from the others who tries to destroy(disband) it. Well maybe not, but one thing for sure is that Kenji isn’t living a normal high school life. \\n\\n\r\nD-Frag is an example of an anime that actually has no meaningful plot at all. It mainly (almost every time) revolves around Kenji, playing board games and throwing limitless funny punch lines at everyone around him until sometimes he literally ran out of breath. Yeah, i think that’s all i can say about the story, nothing more. But that’s not the point. What makes this anime to be considered a very entertaining one is that such plot contains such humorous jokes that surely hit the mark every time and aren't predictable. Behaviours that you don’t see every day will make you burst into tears of happiness.\\n\\n\r\nThe artwork in this anime is not what you can say as a masterpiece, not even close. It’s plain, simple, but still very comfortable to see. It seems that Animes such as these aren't in a need of great and extraordinary art. Character’s design are very enjoyable and hilarious to see. Ranging from cute to roguish, bald to long-haired... i don’t really know how to describe in words coz' i find that some are ‘indescribable’, well maybe because they're just a bunch of random people.\\n\\n\r\nVoice actors did a great job in their voice acting. They make a great impression on how the characters are. What really caught my attention is definitely Kenji’s punchlines, so random yet so funny to hear. Not only the voice acting, the soundtracks fits the anime perfectly too. The Opening is very joyful, cheerful, energetic, and funny. It really makes the mood before watching the anime. The ED is sang by the seiyuus and that makes it even more interesting to hear.\\n\\n\r\nCharacters is what to be called ‘unique’ or maybe simply random. None of the characters have a normal personality as that of a high schoolers and it effectively supports the comedy which is the main focus of the anime. If you’re hoping for character’s developement, you're looking in the wrong place, my friend. Character development in this anime is so small that it could be considered as none..... But you wouldn't even mind anyway :D.\\n\\n\r\nScore\\n\r\nStory : 8\\n\r\nArt : 7\\n\r\nSound : 8\\n\r\nCharacters : 8\\n\r\nEnjoyment : 10\\n\r\nOverall : 9\\n\\n\r\nD-Fragments or D-Frag! or ディーふらぐ! is a very funny and enjoyable comedy-anime. It is indeed the best example of a comedy anime which can be considered as a 'good'. Personally it's my favorite in this winter season. If you think you have a reasonable sense of humor and is looking for an anime that could make you laugh until you lose your common sense, without no doubt i recommend you this anime!\\n\\n\r\n-Want to give a feedback? Comment in my profile and i'll be sure check on it and use it for further use-\\n",
            "date": "2014-04-04T23:09:00+00:00",
            "helpful_count": 251,
            "mal_id": 138721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3457557.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BadabumBadabicch",
                "username": "BadabumBadabicch"
            },
            "url": "https://myanimelist.net/reviews.php?id=138721"
        },
        {
            "content": "\"So, I think we're going to start the king's game now.\r\nthis game has a number of sticks in which one is inscribed the king. The rest are commoners. The commoners should follow the king's command at all cost. But since there are only two players this time, we are going to go with a simple game where the one who draws the king will win.\r\n...So why the hell are these two ready to kill each other?!?!?\"\r\n-From D-Frag\r\nFirst of all, let me put the summary of this whole anime in one sentence.\r\nWHY DID YOU HAVE TO EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEND!\r\n...Then, before I actually begin, let me explain that becausethis is a comedy like nichijou where nothing makes sense but everything is funny, I'll grade this differently.\\n\\n\r\nPS. Absolutely no spoilers, but some words may suggest indirect minor plot points.\\n\\n\r\nStory: 10\\n\\n\r\nI'm wrong? There isn't much of a story?\\n\\n\r\nNo, this is not that simple.\\n\\n\r\nCreating a comedy requires more skills than one might think. Especially for a theme like D-frag, one needs to be very thoughtful. This is not just senseless laughter found in nichijou, or a laughter at the dumbness of baka to test. This gets a game as casual and simple as king's game or the war of thumbs and create something funny and interesting. Nobody wants to watch two men playing the game of thumbs, but in this, yes you do. The ability to make something boring funny is a grandiose skill that requires much attention and imagination.\\n\\n\r\nAnother criterion that I absolutely loved was the continual unfolding of funny behind stories and mysteries that just cracked me up. I cannot explain this without spoiling, so I will go on.\\n\\n\r\nStory was a work of art. Many will disagree and say there was no much of anything for story, but this, like I said, need to be given a whole new method of grading.\\n\\n\r\nArt: 9\\n\\n\r\nSure, the animation is not the best in the world, and we can't help but notice the rainbow colors of the hairs.\\n\\n\r\nHowever, these are not necessary factors when making a comedy.\\n\\n\r\nWhat D-frag wanted and needed was an animation where one could easily crack up, or be caught in adorableness, and this type of animation was its soul mate. Instead of hiring IG entertainment or Ufotable, the simple and \"chibi\" animation was what it really needed.\\n\\n\r\nBut this alone wouldn't get the anime 10, so I gave art a nine. A fluent movement in unnecessary scenes are also a factor to crack people up, but unfortunately D-frag didn't contain this element. For that I gave art a 9.\\n\\n\r\nSound: 8\\n\\n\r\nStarting from the seiyuus this time, in contrast to how I usually grade the sound. The sound is in three parts: BGM, OP/ED and voice over.\\n\\n\r\nThe voice actors are some of the greatest in the world. For Shibasaki Roka, who needed both the yandere-type voice and cute-type voice, there were not too many in the anime history who could do both but the jack-of-all-trades voice actor hanazawa kana. Roka's voice requirements overlapped well with Sengoku Nadeko of monogatari series, and there was no better candidate than Kana in this voice over. Then, as for our main-character delinquent, we have katsuyuki konishi, the prime voice actor of delinquents. In addition, for the voice actor of sakuragaoka, a girl-like boy who had to sound both like a boy and a girl, we had the voice actor of hayate, shiraishi ryoko. We have the woman who changed Japan towards cuteness, aki toyosaki, for the best girl, along with takao in the story, funabori. Not to mention of course, they all did their jobs admirably. Even the extras' voice acting was admirable. However, there were times when the voicing was a little awkward--especially when kazama played the straight-man role. To begin with kazama's voice actor is not aced in straight-man role. Also, the times when the voice actor shouted \"ba-ka!\" weirded me out a little bit. Still, kazama's voice actor did his job splendidly and the ba-ka was understandable for the genre of the anime, so I gave voice acting a 9.\\n\\n\r\nAs for the opening, I at least hated the song. However, as we learned from a certain song called \"Platinum Disco\" and the opening of \"Haiyore Nyaruko-san\", there are songs which deserves A+++ for the music quality and other songs which deserves A+++ for catchiness, and this opening is the latter. Still, the song could annoy some people off, so I gave this an 8.\\n\\n\r\nThe ending, on the other hand, was in between quality and catchiness. It was both easily remembered in the ear and sang well. Still, the song was not good enough to be given a 10, so I gave the ending a 9.\\n\\n\r\nLastly, the BGM's were done splendidly. They weren't cliche or repeated over and over. They were used thoroughly and well. Some songs inspired urgency and even awe and a BGM that does the right job deserves a 10.\\n\\n\r\nSo all in all, I gave the sound a high 8.\\n\\n\r\nCharacter: 8\\n\\n\r\nDon't you just love all characters?\\n\\n\r\nWe have all characters with their own appeals, especially Takao and Funabori, who are not in the main 5 characters but are more famous than the main 5's. I cut it off also because of that--the main characters are not given enough attention, especially Sakura. She, although being a part of the club, shows little significance in the whole anime. I also cut off points for the teacher characters that appeared at the last second.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nBUT WHO THE HELL CARES ABOUT ALL THESE?\\n\\n\r\nD-Frag certainly cannot be a masterpiece, considering each categories carefully.However, they can make people laugh like no other, and they don't need any of these categories to do so. The story? WHO CARES! The art? WHO CARES! The sound? WHO THE HELL CARES!!! The characters? WHO IN THE HELL CARES!!!!! D-Frag is simply fun. It does not bring up the nonsensical exaggerated comedy in Nichijou, or the eternal dumbness in baka to test. They are fun because they are. Even if the story is nonexistent, even if the art is premature, even if the sound is annoying, even if the characters aren't fully developed, D-Frag can turn the tables and create enjoyment out of it.\\n\\n\r\nOverall: 9\\n\\n\r\nD-Frag is certainly, without doubt, the best anime of the spring/winter of 2014. There might not be stories to be awed at, or arts to be awed at, or sounds or awesome character developments to be awed at, but this definitely is an anime that you can be awed at.\\n\\n\r\nIt most definitely needs more attention. If you haven't watched it, you should immediately start watching.\\n\\n\r\nThen, happy anime-ing and may the anime be with you.",
            "date": "2014-03-24T16:44:00+00:00",
            "helpful_count": 133,
            "mal_id": 136817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2639689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MotherOfUltra",
                "username": "MotherOfUltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=136817"
        },
        {
            "content": "\"Just Finish Watching D-Frag\"\r\nLooking at the poster thinking that maybe this is just your another typical Comedy anime but No\r\nafter watching all 12 episode, I was stunned how Marvelous it is.....\r\nThis anime has no doll moments at all...Every episode is worth dying to see 'cause how great and enjoyable it is.\r\nThe only downfall is that there's only 12 episode they should do more maybe a hundred lol. \r\nI don't know why they stop....maybe the budget or the ratings but who cares they should do more and can't w8 for\r\nthe next season...  \r\nD-frag has no main story at all... It's all about the characters goofingoff..If you want to watch a feel good anime \\n\r\n try this one it won't let you down. D-frag will you make you laugh and it will make you feel that your in your teens again having a crush on someone it will make you feel in love lol... and after you finish all the episode you want to beg for more episode.... I do.\\n\\n\r\n'Cause now a days it's so rare to find a good harem,comedy with a little bit of romance and school club.\\n\\n\\n\r\nThe Characters are great,always having a good time, They always making fun of the main protagonist and also the characters are very wacky & crazy but likeable....\\n\\n\r\nThe Bottomline is this D-frag is a pure comedy as it's finest and don't take it too seriously,just have fun while watching it. \\n\\n\\n\r\nPS: I Recommend this anime only if your a fan of Romance,School Club,Harem & Pure Comedy (Kenji X Takao)",
            "date": "2014-05-25T17:35:00+00:00",
            "helpful_count": 121,
            "mal_id": 144537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2425719.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bloody_Venus55",
                "username": "bloody_Venus55"
            },
            "url": "https://myanimelist.net/reviews.php?id=144537"
        },
        {
            "content": "While searching for a comedy based anime, I stumbled across one with a strange title: D-frag. The premise seemed unappealing and boring, with a generic setting that didn't promise anything spectacular. Nevertheless, intrigued by the title of it, I began watching it, and I can say I was pleasantly surprised. D-frag is comedy/harem anime, though it is not your typical ecchi/comedy anime out there. So what makes it hilarious? I will try to explain it below.\r\n~Story~\r\nFirst of all the comedy is based on the manzai, where a \"Tsukommi\" (straight man) retorts the actions of the \"Boke\" (funny man) who creates a funny situation. This isquite frequent in japanese comedy shows, and being a personal fan of this type of comedy, naturally appealed to me. However, if this type of comedy doesn't appeal to you, then this may be not suitable for you.\\n\\n\r\nD-frag focuses on the delinquent Kazama Kenji, who with the help of his gang, the \"Kazama\" gang, intends to take over his school. This doesn't go as intended and in the process he is forced to join the game creator club (temp), composed of the most strange girls. From here on audiences observe how Kazama deals with the bizarre club members, leading to absurd and hilarious situations. These range from typical everyday life situations, to the same events a lot school comedies have to offer, such as territorial fights or festival games, naturally taken to the extreme absurdness.\\n\\n\r\nD-frag has little story to offer, besides the actions of the game creator club (temp). The story is split in mini arcs, each with enough comedy to make you laugh, making it perfect for this type of anime. It also tagged with the romance and harem category, though the harem aspect is not the main focus of this show, neither is the romance. Moreover, it is used to enhance the comedy. \\n\\n\r\n~Characters~\\n\\n\r\nBeing a comedy based anime, D-frag has a lot of characters to offer, each with its own charm. As it is a harem too, there are a lot of female characters but these are not detrimental to the anime; which is to say, it doesn't exhibit an excessive focus on the females. Personally speaking, the protagonist Kazama was of the most interesting character as it was not your typical main protagonist. He doesn't take romantic interest in the female lead characters, neither does he always accomplish his goals, in fact he is often helped by someone, which is bonus.\\n\\n\r\nOther character that stood out, and is my personal favourite, was the teacher Sean Conne Conne, who clearly represents the actor Sean Connery. His character, moral values and actions are very refreshing to the anime, besides enhancing significantly the awe factor of this character. Naturally, character development is nihil in this anime, in addition to the fleshing out of the characters.\\n\\n\r\nThe secondary characters also play an import role D-frag: these have all certain personalities that makes it easy to distinguish from the others. While the protagonists create absurd and hilarious situations, these are often enhanced and supported by the actions and comments/retorts of the secondary characters, and vice versa. There are also different factions present, each with their characteristic attribute, for example, the baldies or music bands. The good thing is that these are all simple and not such impressive characters, they're in fact simple people even though the anime portrays them as \"badass\" characters.\\n\\n\r\n~Animation and sound~\\n\\n\r\nThe animation quality of D-Frag is nothing outstanding, though well executed, what is to be expected from a modern show. The art style of D-frag was toned down a bit from the manga, which was at first rather lackluster, and is a welcoming change. Character designs are varied, yet are nothing remarkable. The facial expressions were well done, which was of importance for the comedy gags, as without them it would have been worse.\\n\\n\r\nThe soundtrack used in D-Frag was nothing outstanding and it could get repetitive at times, yet there were some compositions that fared well with the different sketches and situations it was trying to portray to the audience. The voice actors performed their roles well, fitting with their character's personalities, as in addition enhancing the comedic element of the anime.\\n\\n\r\n~Enjoyment~\\n\\n\r\nI personally enjoyed D-frag a lot; It made me laugh throughout the whole duration with hilarious and absurd situations, as well as the wide assortment of characters. There were naturally some gags that got old or were predictable, besides of having no story direction whatsoever: this was nevertheless a small drawback. So if you are interested in watching a comedy anime with an enjoyable harem, or just are searching for something to watch, D-frag may be something for you. Just don't expect any deep characters or story.\\n\\n\r\nThank you for reading.",
            "date": "2015-11-25T09:05:00+00:00",
            "helpful_count": 42,
            "mal_id": 204161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=204161"
        },
        {
            "content": "Am I the only one who thought this anime was going to have explosions and have a war-like theme? Yeah? Oops. With the title D-Frag!, I thought this would have something to do with a hand grenade. Nope. It's one of those one-guy-bunch-o-girls-in-club anime and I was putting it off until one of my friends suggested it, claiming it was hilarious.\r\nStory: 8/10 \r\nSigh. Not again... The plot definitely did not interest me at all. I've watched plenty of shows where a guy goes into a club with a bunch of girls in it, yadeeyada. Despite the synopsis being so bland, I found that the actualplot was progressing at a nice rate. The setting actually moved outside of the club room (phew) and there were a variety of conflicts that the protagonist faced.\\n\\n\r\nArt: 8/10\\n\r\nThe art is definitely very average. Typical school uniform, typical characters all with different hair color, and typical school setting. The art also tends to focus a lot of attention on the head of the characters. I don't particularly like how the hair is colored - it uses gradient, you'll see what I mean if you plan to watch this. Nothing particularly stands out... until those fantastically inputted little, special scenes. The art will suddenly catch your attention and I guess it is because of this contrast that I paid closer attention to the show. \\n\\n\r\nSound: 8/10\\n\r\nThe background music does not stand out too much, which isn't a bad thing. This show is very light-hearted and most of the time, if not all, it fits with the scene. The little sound effects are nice. Voice acting is also great, but personally, the male protagonist screaming all the time gets to me. \\n\\n\r\nCharacter: 10/10\\n\r\nWOAH THERE. Yeah, this anime gets a perfect score for character. Each character is unique, all weirdos. Maybe there's one character here and there who have the generic behavior of all school-related anime but the variety of personalities is extraordinary. This anime somehow makes even the minor characters of the show stand out. It's quite genius, actually. This anime may not stand out much in terms of the other criteria, but I fell in love with all the characters - even those who only appear for a max of two episodes.\\n\\n\r\nEnjoyment: 9/10\\n\r\nEach episode did not fail to elicit laughter from me. The oddity of all the characters along with the random plot and plot twists combine to create an anime that does not fail to please. For a school anime, this one does not fail to deliver entertainment. \\n\\n\r\nOverall: 9/10\\n\r\nDo give this a try and if you want to test this anime's waters, try two episodes, not one. I felt the first episode does not truly represent the rest of the show. I would definitely recommend this to anyone who enjoys a little chuckle and fall in love with the characters. However, if you cannot handle the male protagonist screaming for half the episode every episode, this may not be for you (take into consideration that some people enjoy this screaming!).",
            "date": "2014-10-06T20:25:00+00:00",
            "helpful_count": 25,
            "mal_id": 163913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3811315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lagcrazy",
                "username": "lagcrazy"
            },
            "url": "https://myanimelist.net/reviews.php?id=163913"
        },
        {
            "content": "One of the most underrated animes ever. This anime will make you laugh so hard that the twelve episodes zoom by way too fast. I definitely recommend this anime to those that enjoy a protagonist who tries to act badass when he really isnt and really weird characters.\r\nStory - In terms of the story, it is very weak as expected of a comedy.\r\nIt's focus is on the Game Creation Club and doesn't seem to progress anything further than that. There is some romance to it, but overall it is just comedy. Even though it sounds so bland and boring, you tolerate it because the rideitself is really fun. \\n\\n\r\nCharacters - The characters are all so lovable and funny. They each have their own way of telling jokes. The main protagonist is angry at everything because everyone acts so foolishly that it's cute. The members of the club have their own \"types\" (Fire type, darkness type, lightning type) and they take this sort of stuff so seriously that when someone as sane as the main protagonist approaches the scene, you can't help but agree with him. The fact that you can relate so well with the main character, who is in a situation in which every character he meets, including his best friends, is out of control makes it a soothing experience.\\n\\n\r\nArt/Sound - I love the opening theme. It matches the humor of the whole anime. It's all about having fun. They also match the amount of energy that is  put into this anime.\\n\r\n\"We're a group of geeks with ambition, despair, and angler fish... just kidding\"\\n\r\nIt's really quirky too. \\n\r\nThe art style is also really comedic. Characters make the weirdest facial expressions and in general it makes everything funny/cute.\\n\\n\r\nEnjoyment - If you enjoy a good laugh, definitely watch this anime. You won't even worry about the plot, you just want something else to happen so they can just act themselves. \\n\\n\r\nOverall - Story is obviously bad, but the whole comedy portion has been nailed. Definitely watch this for the sole reason of comedy.",
            "date": "2014-08-02T13:31:00+00:00",
            "helpful_count": 18,
            "mal_id": 154911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3981069.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yourchinguxd",
                "username": "Yourchinguxd"
            },
            "url": "https://myanimelist.net/reviews.php?id=154911"
        },
        {
            "content": "\"Love to fight! Love to fight! I love to FIGHT!\"\r\nThis is actually from the opening of this anime. The name is \"Stalemate\" by IOSYS jk Girls. D-Frag or D-Fragments is one of the anime that I enjoyed watching in the winter season anime as stated in my previous Noragami review. However, I didn't enjoy this anime fully as I did with most anime that I have watched.\r\nD-Frag was directed by Seiki Sugawara and was produced by Brains Base who did some wonderful anime like \"My Teen Romantic Comedy SNAFU\" which is a high school slice-of-life comedy just like the anime I am reviewing now.\r\nSTORY (5):\r\nThestory takes place in a high school setting. A student Kazama Kenji was forced to join the Games Creation Club by its members. So what you are going to expect from this anime is how Kazama Kenji gets to bond with the members in the Games Creation Club who are all girls. \\n\\n\r\nOf course, there are some funny moments. Those moments to me are fun to watch but it didn't make me laugh out loud. The best moment is in episode 6 when Hachi Shio makes a love triangle with Roka & Kazama. I really watched it and never get bored. \\n\\n\r\nThis anime builds up tension in the later episodes which I see in most anime I watched. Like when the later episodes, they show a rival group and the battle begins. If an anime is awesome, then the anime must surprise me from the start to the end. However, this anime failed to do that.\\n\\n\r\nART (7):\\n\\n\r\nThe animation is refreshing to look at especially when it comes to the character designs. For example, Roka Shibasaki's design is very cute but sometimes can be normal in some situations.\\n\\n\r\nSOUND (7):\\n\\n\r\nBoth the opening and ending songs were very addictive.\\n\\n\r\nI don't have to mention the opening song because I have said it in the introduction.\\n\\n\r\nThe ending song was addictive. The song starts with Batsu Game. Batsu game means punishment game. The ending song is \"Minna no Namae wo Irete Kudasai\".\\n\\n\r\nCHARACTER (6):\\n\\n\r\nEvery character has their unique personalities. I am fine with all the characters. At least the characters never show me any annoying traits (ie. crybaby, arrogant, whiny). However, the characters didn't stand out well enough for me to love them.\\n\\n\r\nThere was one character who looked a lot like Harima Tenma from School Rumble and that character I am referring to is Hiroshi Nagayama. He wears dark glasses like Harima Tenma but his hair style looks different from Harima.\\n\\n\r\nAtaru Kawahara wears glasses but he is interesting as a masochist who can tolerate pain. Next time, I would host a show with him (if he is real) to be an assistant in \"Rate the Pain\". Nah, just joking.\\n\\n\r\nRoka is very cunning and she always tricks Kazama into doing things for her. Like for example, she can manipulate people by showing her cuteness and her creepiness. This is very similar to Yuragi Hakoniwa from Noucome. She is cute but can sometimes be very intimidating.\\n\\n\r\nChitose Karasuyama reminds me of Yozora from Haganai with her sadistic attitude.\\n\\n\r\nI seriously find that most of the characters resemble like some of the characters I knew from previous anime.\\n\\n\r\nCONCLUSION (6):\\n\\n\r\nAlthough this anime has its fun moments. They weren't enough to surprise me in one single bit. The comedy wasn't strong. I wasn't laughing out loud throughout the anime but the animation was interesting to look at.\\n\\n\r\nThe story didn't take me by surprise. A comedy has to make a person laugh out loud. If a comedy has failed to make a person laugh out loud, then the comedy is dull. Just like french fries, when you order a french fries and you take a bite and found that there is no salt in the french fries which makes them dull french fries. \\n\\n\r\nHowever, if you found the comedy very funny and entertaining, that's good. If you can relate with the characters better that's also good. In fact, I did appreciate the effort that Seiki did in making this anime a good comedy. But sadly, this anime didn't stand out among other anime that I have watched.\\n\\n\r\nSo, for what it's worth, I give it a 6 out of 10.",
            "date": "2014-03-24T09:04:00+00:00",
            "helpful_count": 18,
            "mal_id": 136725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=136725"
        },
        {
            "content": "Feeling a little tired of late? Having trouble keeping thoughts organized? Well perhaps you need to D-Frag, or so the title seems to suggest. This show is a Haganai/Seitokai no Ichizon type clone with overly vivid personalities and a rather unique combination of attempted coolness and comedic cuteness. Basically, a supposed wannabe delinquent, with Sonic the Hedgehog sharp hair, named Kenji is coerced into joining a game development club. Except that they don't really develop games. Rather, they just lounge around and occasionally play some games, and occasionally get into trouble with other groups.\r\nIf you're looking for a very lighthearted slice of life with somenot-so-realistic personalities, this may be a good choice. I say maybe because you'll either love or hate the overall feeling of the show. Personally for me, the attempted coolness came across as immature and rather dull. Others have shown a very different opinion though so you might want to give the first episode a shot and see if you enjoy it.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair overall with a vivid color scheme and a lot of over-dramatization. Backgrounds are fairly average and likewise for shading. The characters are pretty unique in styling though I felt that facial animations were a bit lackluster as characters didn't seem to respond much to external stimuli.\\n\\n\r\nI guess there is a bit of action though most of it is extremely light and more of the comical nature. Fighting by splashing water or dirt on each other? Kind of cheesy if you ask me. There is a slight amount of ecchi though more like suggestive references, they probably tried to incorporate something like Seitokai Yakuindomo but didn't really succeed very well. Otherwise you just have bouncy from Buchou and a bit of cross-dressing.\\n\\n\r\nSound:\\n\r\nThe Engrish OP is pretty representative of the show, taking a very shonen-based cool and combining it with cute-ish female voices. The song is pretty discordant with little melodic value. The ED is a bit more melodic but still has the overly-playful vibe that just feels much more fitting for an elementary school. The BGM is pretty light but serves its purpose. There are a lot of effects, due to the comic nature of a lot of events.\\n\\n\r\nThere are a lot of veteran VAs here but I feel like they over-cast for a lot of the roles. Shizuka Itou is the standout as Buchou but most of the other roles just didn't have enough characterization to merit the strong VAs. Especially painful were Kana Hanazawa and Kana Ueda's roles; what's the point if their character can't act cute and tsundere, respectively?\\n\\n\r\nStory:\\n\r\nThis is frankly a glorified slice of life show that is based heavily on character-interactions, so I wouldn't expect much in terms of a central plot. If there is anything holding the story together, it would be the repeating pattern of someone or some group trying to get the fake gaming club closed. The oddball group works together to somehow try and overcome impossible odds. I guess it helps that the student council chair, who you never see actually doing student council chair-like stuff, is in the club. Some episodes are episodic while others clump up to form mini-arcs. There is a bit of a climax near the end but nothing mind-blowing.\\n\\n\r\nThe more important thing to note here is the over-the-top nature of the characters and antics in this show. If you're just watching for the comedic aspect, then this is all fine. However, if you apply an ounce of thought into it, be prepared for very little to make sense. Besides the numerous plot and character holes, the school apparently has multiple infamous gangs and groups running around and causing messes, with relatively little discipline being dished out. A lot of behaviors and events are just so out of the ordinary that the merest thought of plausibility is cast aside.\\n\\n\r\nCharacter:\\n\r\nGranted that this show isn't going for realism, I still find it annoying that the characters were so two-dimensional. Yes, the characters have interesting traits, but these feel unshakable in an unnatural way. A good example is Roka, a seemingly quiet and chibi figure who apparently possesses the comic ability to \"conquer\" others by putting bags over people's heads. Yes, she's interesting in a curious way but you never get the sense that she's remotely relatable. The sadistic student council chair, Chitose, acts cool all the time but just once you'd like to see her out of that annoying facade- don't bother waiting. The only characters that really have any merit in my mind are Buchou, who harbors some feelings for Kenji, and Kenji himself. Everyone else, and mind you this includes a huge amount of secondary characters, are just fluff. While it's true that the character interactions had a lot of character (no pun intended), it was painfully lacking in depth.\\n\\n\r\nValue:\\n\r\nIt's probably pretty clear by now that I didn't have a very pleasant experience with this show. Maybe I've outgrown this genre, but I still feel there are much better works out there that provide much more entertainment value without having to resort to meaningless gimmicks and outlandish, unrealistic personality traits. While the show has some comedic value and a drop of relationship value, it is spread out too thinly to make much of a positive impact. If you agree in opinion with my other reviews in the genre, I'd pass on this one.",
            "date": "2015-11-04T23:12:00+00:00",
            "helpful_count": 15,
            "mal_id": 202699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202699"
        },
        {
            "content": "\"D-Frag!\" An anime that I was very skeptical about at first, even after watching the first two episodes I was trying to understand. I had no idea what was going on, but for some odd reason I still continued to watch, and I enjoyed every moment of this anime. It's not too often that I find and anime where I am laughing through every single episode.\r\nScore\r\nStory: 10\r\nArt:8\r\nSound:8\r\nCharacter:10\r\nEnjoyment:10\r\nOverall:10\r\nNow first off we have the story, some people might not believe this has a solid storyline or any sort of plot so to speak, but after watching an Anime such as this you can just tell how muchthought and work was put into it. Even the boring things in life that were done in this anime are a must see. It made everything more enjoyable and easy to watch. It was fun to watch!\\n\\n\r\nThe art itself wasn't anything to crazy but it was more of a comfortable and relaxed environment if that makes sense. From the start it was just a feeling of \"Yes, this is good\". Whether it was the chibi or the basic art, it all just felt right.\\n\\n\r\nThe soundtrack for this anime wasn't the most amazing in all of anime history, but it was a perfect fit none the less. The voice actors for this anime were very good as well, you could feel every expression and feeling through their words, the reason I gave it only an 8 was one of the characters, they just sounded too much like a different anime character for me.\\n\\n\r\nWhat really makes this anime what it is, is this group of insane and outrageous characters. If anything, saying they are insane and outrageous is an understatement, right off the start of the anime you get a hit to the face with crazy. These characters being so overbearing at times or mentally unstable even, is the glue for this outstanding anime.\\n\\n\r\nI enjoyed this anime thoroughly and couldn't stop laughing the whole way through. I would recommend this to anyone who enjoys anime and would like something to cheer them up or make them laugh a lot. \\n",
            "date": "2015-05-05T04:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 187155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4062721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JamalWelfare",
                "username": "JamalWelfare"
            },
            "url": "https://myanimelist.net/reviews.php?id=187155"
        },
        {
            "content": "The things than make D-Frag an amazing anime is the comedy elements that it has. The story is very good but nothing surprising, what shines the most in this anime is randomness of comedic timing it has. I never stop laughing in any of the episode because it's that good. The art in this anime is very well done with colorful atmosphere and very well Japanese voice acted. The characters in this anime is very well developed and I love all the characters even the side characters that only appear for 3 or 4 seconds. I had a blast with this anime so I caneasily say that i would recommend this anime to anyone that like comedy genre anime. 10/10 (Maybe I'm a bit over exaggerating but this anime is really that good)",
            "date": "2017-12-20T08:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 265721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6797895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bahram_Raftari",
                "username": "Bahram_Raftari"
            },
            "url": "https://myanimelist.net/reviews.php?id=265721"
        },
        {
            "content": "D-Frag is an ongoing comedic manga by Haruno Tomoya. In 2014, Brain's Base (yes the studio behind Baccano, Ixion Saga DT & OreGairu) aired a twelve episode adaptation. I'll be covering both that and the one episode OVA that was bundled with a special edition for the manga.\r\nStory:\r\nOur protagonist, Kazama, is a delinquent. One day he and his fellow skivers find themselves running afoul of the Game Creation club. To their surprise, they're handily beaten by the girls in the club. This swiftly results in Kazama being recruited to join the club. This, naturally, leads to shenanigans.\r\nThe humour in this is pretty hit and miss.It has some very funny moments. The types of weird games the club comes up with can be really funny. A lot of the gags referencing games are also quite well done. The series is also good at coming up with crazy scenarios that have a lot of comedic potential. The OVA is a great example. The characters get involved in a race for special limited edition water and there are a lot of comedic possibilities with that as your premise. It wouldn't work as a long, full length anime but for one episode it's a perfect concept.\\n\\n\r\nOn the other side of things, you have the jokes about masochism which just get really repetitive and predictable very quickly, thereby losing most of their impact. The series manages a few scenes that work with it but for every time it works there are three where it doesn't. It doesn't help that the series gives us two characters who have masochism as their main spiel. The same major issue holds true for the bulk of the love triangle japes. Kazama finds himself of interest to two different girls in a way that's so obvious even I wouldn't be oblivious to it if I were in that situation. And I once thought a young woman wrote her phone number on something she handed me by accident. And this dude seems completely oblivious. But that's not the issue with these jokes. The problem is that they're basically the same thing every time. The buxom girl gets embarrassed and acts cringey, while Roka is just completely forthright and Kazama plays the oblivious straight man. They can be funny sometimes but they're usually just cringe-worthy.\\n\\n\r\nI will give the series credit, though. Its comedy does work well more often than it falls flat, by a pretty strong margin.\\n\\n\r\nCharacters:\\n\\n\r\nAll in all, the cast works fine in a comedic context. If this were a serious series, they wouldn't. But as is, the only real complaint I have is that Kazama is kind of dull. His one job is to react to all the crazy shit everyone else does, and get dragged into it. Some might argue that you need the more “serious” character to help emphasise the craziness and respond to it but Galaxy Angel has an entire cast of bizarre, quirky characters and it is a superior comedy to this. Same with Muteki Kanban Musume.\\n\\n\r\nI'm not saying that no comedies should ever have that type of reaction character, but they aren't exactly interesting &, honestly, they shouldn't be put in the lead role. The mostly uninspired and uninteresting love triangle interactions don't help make a case for him either.\\n\\n\r\nArt:\\n\\n\r\nThe animation is decent enough. Kind of standard but the designs work, the movements are smooth and the series does use comedic stylistic shifts and expressions pretty effectively.\\n\\n\\n\r\nSound:\\n\\n\r\nHanazawa Kana, Takahashi Mikako, Saito Chiwa & Ueda Kana make for a thoroughly solid cast. About the worst I can say is that the series may be excessive with its use of exaggerated reactions and it results in a lot of yelling that can get quite trite. I bet Konishi Katsuyuki really shredded his voice doing that since he gets the worst of it. Chamomile tea is good for that, Mate. The music... I wasn't fond of the theme tunes in this one. It goes for that super hyperactive, noticeably auto-tuned aesthetic you get with some comedies. The incidental music was perfectly fine. Not the best I've heard from Matsuda Akito, but decent enough.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's a bit. One of the masochist characters seems to want some polyamory involving Kazama. The OVA gets some homo-erotic moments between Sakura and Noe.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nD-Frag has a good amount of funny moments and some characters with strong quirks to carry it. I would go so far as to say that it is a good comedy. But it also suffers from putting a rather standard, dull character in the lead role and from some comedic bits that just get played out way before they stop using them. So, I can't call it great. Final rating, a solid 7/10. Next week, The Choujo.",
            "date": "2018-07-04T14:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 282990,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=282990"
        },
        {
            "content": "Probably my favorite comedy anime of all time. I laughed throughout the entire anime. I enjoyed the entire anime as well. I have already watched multiple times and will not hesitate to do another re watch when i finish my current anime's. \r\nWhen it ended i felt really empty. It was one of those anime that you really enjoy and get really into but then suddenly ends. Therefore leaving you with an empty void that can only be filled with watching as many anime as possible or reading the manga.\r\nThe characters were amazing and unique and all worked together very well to create a laugh.This anime is also a harem with the typical dense protagonist, but that doesn't really turn me off it at-all and it shouldn't turn you off either. The man character generally acts as a straight man making funny remarks when the characters do something he doesn't approve. The main character Kazama is also a delinquent, but is probably one of the nicest characters in the entire series. His little sister being added into the mix later on also makes the comedy reach an entire new level.\\n\\n\r\nI would totally recommend this anime, I'm even planning on buying the physical copies of the manga as well, this is one of the only anime's that's actually made me want to do this.\\n\\n\r\nFinally Takao is best girl. :-)",
            "date": "2018-06-26T10:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 282283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5777104.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xhaia",
                "username": "xhaia"
            },
            "url": "https://myanimelist.net/reviews.php?id=282283"
        },
        {
            "content": "Short and simple: this anime is a MUST.\r\nTremendly hilarious situations in every episode and great and outstanding characters. Honestly I was not expecting too much from an anime about games, but the way they take them to completely unexpected levels is really funny.\r\nThe first episode might be misleading as it seems to focus in the quarrelsomeness of the main character and looks like just another school anime, but from that point on, it shakes you from one extreme to the other until you are completely amazed.\r\nNot recommended to: People looking for deep and psicological dramas\r\nRecommended to: Anyone who wants to have at least 20 minof surprising and funny moments",
            "date": "2018-05-01T06:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 279474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7035670.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NullFreaks",
                "username": "NullFreaks"
            },
            "url": "https://myanimelist.net/reviews.php?id=279474"
        },
        {
            "content": "Hello Everyone, I'm PyraXadon, a blue fire type.  Today on MAL reviews, I will be talking about, probably one of the most interesting and random, but enjoyable animes out there.  Everyone, this is D-fragments!\r\nStory (7.76/10): The story of D-fragments, or D-frag in its shorter name, is about a second year by the name of Kazama Kenji, who aspires to be a delinquent at his school with his friends Nagayama and Yokoshima, as the Kazama Clan, or whatever they're called.  They're not really well known.  It is then that Kenji meets a little girl by the name of Roka, who offers himto be part of her club, which after some insanity of the over 9000 kind and some running around the school, that Kenji agrees to be part of the club, and the story continues on from there.  \\n\\n\r\nWhen you're looking at an anime that's based on a club, you normally get the same formula of the characters of the show going to the clubroom and doing whatever, (which is usually nothing), making a couple jokes that are \"funny\" to us, the audience, then ending the episode off in a sort of episodic form.  Now take that, and reverse it.  That is what D-frag is.\\n\\n\r\nThe story of this series revolves around the antics of the game creation club (provisional), as they go through life at school basically breaking all of the school rules, breaking property, running around and attacking each other with RPG game style attacks, and overall just being as insane as possible.  And that's only the first episode.  Beyond that, the series doesn't really go beyond that sort of mindset.  The whole series is essentially the game creation club's antics, explained in a great multitude of hilarious and VERY entertaining ways in an arcic setup, that actually works.\\n\\n\r\nThe series itself doesn't try very hard to be entertaining, and it doesn't need to, because its idea is just so damn absurd, that it is extremely entertaining and very fun to watch.  The series was made to be very funny, and it succeeded in doing so in the end.  Also, the end.  This series has one of the most bullshit and random endings ever, that I laughed out loud because of just how absurd and hilarious it was when I saw it.  \\n\\n\r\nOverview\\n\r\n+  Absurd and entertaining plot\\n\r\n+  Many wonderful, memorable moments\\n\r\n-   Somewhat arc heavy\\n\\n\r\nCharacters (8.78/10):  Now, the characters.  When you look at D-fragments' picture, the first thing that comes to mind is, harem.  That is not actually the case.  (The manga does have that tag for some reason.)  This series does have a multitude of female characters, but it is in no way, a true harem.  Because, these girls are much more interesting than most harem females you will ever see.\\n\\n\r\nKazama Kenji, as the main protagonist is the aforementioned delinquent of this series.  With his spiky hair and rough way of talking, he is undoubtably someone who aspires to be one, which ultimately fails in the end.  Kazama is an interesting male protagonist, in the sense that he really doesn't care much for what is going on, since he's just as lost as the audience is in any given situation, but when it comes down to it, he does care for the people and what he does, as he is shown to be helping out a lot in the game creation club's \"quarrels\".  However, in terms of personality and favor from the audience, he is tiny in comparison to the greater majority of characters in this series.  Mostly, he fills up the main role as the main guy, but other than that, I wouldn't say too much else.  He mostly takes a backseat when it comes to things.  \\n\\n\r\nNext is the fire/dark aligned underground boss of the school, (I have literally no idea what all of that entails, Roka Shibasaki.  Roka is definitely the main focal point of the show.  From start to finish, she plays a pivotal role in the plot, and is seen to be around Kazama for the majority of the series.  Personally, I have never really seen a character quite like her, due to the fact that she has this fire aligned moe thing, and this scary dark aligned personality that I would like to avoid if all possible.  She likes bagging people, (putting bags over people's heads), and all sorts of weird things.  I can't really explain her because she's just that kind of character that you can't really explain due to how interestingly weird she is.  \\n\\n\r\nChitose Karasuyama is the earth aligned character in the series, as well as the school president.  Personally, I don't get how she's the school president due to tyrannical and sadistic she is.  Chitose is one of those characters that will do whatever it takes to complete a goal, while at the expense of someone else's pain and misery.  What I think makes her a good character and a good fit for this show, is the fact that she has this authority, and thus the means to make the absurd things in this series make sense in terms of how they came to be.  \\n\\n\r\nNext, my personal favorite, Sakura Mizukami, or, the water type.  (I'm not kidding.  These characters all have some sort of element alignment like freaking pokemon.)  Sakura is the youngest character out of the whole main cast, being only a first year, with an exceptional addiction, to water.  She is always seen carrying a bottle, and even drowns her opponents with bottled water.  She has this sort of child-like demeanor, being very respectful to her her elders, and even calling Kazama her Onii-san.  (She just does it cause she can.)  \\n\\n\r\nAnd finally, Takao.  (There's no last name for this one.)  Takao being the only character not in the game creation club (provisional), is a rather interesting addition to the main cast.  For starters, she is the only character that has her measurements posted on this site, so that sort of gives you an idea of what we're dealing with here.  Takao is sort of that bystander person that sort of just stands there and watches everything happen.  She doesn't really add too much to the series as it goes on, but she still plays a good part nonetheless.  \\n\\n\r\nThe side characters of this series outnumber the main cast 1:10.  What adds to this series's absurdity, is the fact that the series will add a few characters every few episodes or so, followed by a nametag on one of the screen corners, giving you a sort of idea of who this new person is.  While most of the supporting cast get about 10 minutes of screen time each, the supporting cast that actually matter, such as the double masochist duo of Ataru and Hachi, the electric aligned game creation club's supervisor, the legendary pigtailed 3rd year Tama-chan, Kazama's sister Noe, and my personal favorite Funabori.  \\n\\n\r\nPersonally, I think that the supporting cast is too big.  (Even Angel Beats had a smaller cast than this series.)  The fact that they add in characters left and right is a bit too absurd even for me, and their use and imprint on the series is as valuable as a dot you draw on your friend's paper in the upper right hand corner of their paper.  Also, they didn't explore some of the more important and better known side characters as much as they could've, which I think really would've added more, since the supporting cast is just as interesting and weird as the main cast.  \\n\\n\r\nAll in all, the cast itself was very well done for the idea they were going for, and I commend the people who made it, to make a series with a mostly female cast, not a bunch of girls who needed a guy to help them with everything.  Cause these girls kick ass.  \\n\\n\r\nOverview\\n\r\n+  Very well thought out female cast\\n\r\n+  Somewhat original and thought out character personalities\\n\r\n+  Above average male lead\\n\r\n-   WAY too big of a supporting cast\\n\r\n-   Adding characters left and right that didn't even matter in the end\\n\\n\r\nArt and Sound (8.31/10 and 8.95/10):  The art is definitely a good highlight of this show, mainly because the art is so bright and vivid, that it looks like it was colored in a highlighter.  The show has two main ways of presenting the characters.  One in a normal format of presenting the characters, and the ever so common chibi format that we see today.\\n\\n\r\nFor the normal artwork, the series has a very detailed look to it, as well as a very nice and light color palette, that works very well to represent how light-hearted and fun this show is.  \\n\\n\r\nThe chibi artwork on the other hand has this more comical sense to it.  The actual color palette is still the same, but the way the characters are drawn is different, representing the characters in a smaller, shorter, and more cute form.  (Mainly, they use this way of making the characters look chibi on Roka.)  At times, the series intertwines these two art styles, that as mentioned before, works very well for what the series is trying to do.  \\n\\n\r\nThe sound I feel is one of the more addicting things of this series.  While the background music for the actual series is mostly average tracks that are mood fillers, the soundtrack for the series really shines in its OST, and ED.  First, the OST.  I cannot explain it.  The OST has some of the most random lyrics, and an ever-changing tune that I can only explain as a song that is worthy of being this anime's OST track.  The thing is, it's so random, that it's so enjoyable.  Hands down, this OST is one of my favorite opening tracks for an anime period, because it's just so fun to watch and listen to.\\n\\n\r\nThe ED on the other hand is a very happy song that involves singing about a penalty game.  It's a nice little finisher to the anime, as it still contains that vibrant energy that this series is overfilling with.  \\n\\n\r\nOverview\\n\r\n+  Aesthetically pleasing look\\n\r\n+  Good integration of both styles of art work\\n\r\n+  Addicting soundtrack\\n\r\n-   There are none.  =w=\\n\\n\r\nPersonal Enjoyment (9.56/10):  When I first discovered D-fragments, I only chose to start with the manga because the manga was already present and ongoing.  I had held off on the anime series because I wanted to get far in reading the series, just so I don't spoil anything for myself.  That plan didn't work, cause I finished the anime before finishing the manga.\\n\\n\r\nWhat I love about D-fragments is the sheer randomness that works just so well for this series.  The series itself goes over the top and does not care if you go along for the ride or not.  It goes, and continues, making you hope that you can keep up.  As I was watching this series, the most memorable parts about it for me was how much I enjoyed the slapstick comedy that worked extremely well for this series.  For a series that wanted to be random, it succeeded.  D-fragments is one of those series that anyone can enjoy without thinking too hard.  \\n\\n\r\nPersonally, I love this series because of how entertaining and enjoyable it was.  It provided me some great laughs and no facepalmy plot points that I hate with all my heart.  In the end, I would recommend this show to anyone who would like a good laugh, or even to just not think, because in the end, thinking while watching this, will get you nowhere.  It's not the best thing to watch in the world, but for a comedy/school series, it's definitely top notch.\\n\\n\r\nOverall Score: (9.15/10)  Remember.  I'm a blue fire type!",
            "date": "2014-03-24T17:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 136825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136825"
        },
        {
            "content": "i really enjoyed D-Frag! i thought at first it was weird but as the situations progressed to be more and more ridiculous i found my self hooked on to this anime \r\n=============================================\r\nthe story is about kazama kenji a boy in high school who likes to think of himself as a \"delinquent\" he decides to visit a game club to see if he can \"borrow\" some manga and games but little did he know he just walked into the \"Game Development Club(temp)\" a club full of weird girls who think they have different elemental affinities they coerce him into joining their club where many strange happeningsgo on.\\n\\n\r\noverall this anime is hysterical with funny gags and good art this is personally one of my favourite animes and i believe most people would enjoy watching it.",
            "date": "2014-12-08T05:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 171415,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169061.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cenzora",
                "username": "Cenzora"
            },
            "url": "https://myanimelist.net/reviews.php?id=171415"
        },
        {
            "content": "Okay, it's finished. I can't stand that D-Frag! is finished but the fact is yes, it's finished. After making me laughed so hard that my mom come to my room to say \"Hey, son. Do you go insane now?\" once a week, now is the time it's finished. So before starting the review, let me tell you how I feel before deciding to watch D-Frag! as my winter's anime.\r\nI always look at the genre of an anime before watching it, I started to watch D-Frag! cause some of the genres are School and Comedy. Yeah, I'm a lonely guy without girlfriend or else so atleast I have to taste some comedy so that I'm not feel lonely anymore yay (?). Well, while looking for some info for D-Frag! on this site, I found out that the cover of D-Frag! is 5 girls and a guy that I think it would become a harem. But then, I was wrong, cause D-Frag! has a F-ing fabulous comedy so that harem stuffs were pulled out from my mind.\\n\\n\r\nOkay, let's head straight to the review.\\n\\n\r\nStory 8\\n\r\nD-Frag!, a story(story?) that involves a leader of a famous delinquent gang named \"The Kazama Gang\", but somehow nobody even knows him. Though he is a delinquent douche, he still helping someone to extinguish fire. And at the end, he forced to join a weird club named \"Game Production Club\" and he found the four not-so-normal girls.\\n\r\nFrom the manga (chap special 14,5) at the end of the chapter, Tomoya-sensei wrote \"This extra doesn't relmaate to the main story (Is there something called 'story' in this manga?)\" and yet i agree with him.\\n\r\nFor the plot itself, I think it's not a strange plot for me, it's just mainstream. I mean, A punk forced to join a club? But yet i realized, my inner self was just like \"Hey dude, this is a comedy you know, why you should be concerned about the plot, huh?\". Yes, later on episodes 6++ I watched some arcs and I didn't expect that a comedy like this has it's own arcs. It's so amazing.\\n\\n\r\nArt 8\\n\r\nNowadays, the're many animes with great art, and D-Frag! isn't one of it. To be honest, the art of D-Frag! is just an average for me. But, for a comedy anime, it just really suit with the gag. In D-Frag!, there're so many characters that given their chibi style. I love it, very very love it. Especially when the chibi character is doing his/her gag while the others stay at the original body style. The sense of humour just spreaded out more.\\n\\n\r\nSound 9\\n\r\nThe seiyuus do their role so good. For example Roka (HanaKana), she's good at voicing all types of expression such as cute, straight, and that \"yandere\" style. For Kenji (Konishi Katsuyuki), he's so good voicing his punchlines. For Sakura (Takahashi Mikako) her voice is suitable for her expression, the smiling-all-time-water-element-Sakura lel. And for the first time of my life, I just heard the tsundere version of Itou Shizuka wow (because Akeno, Wilhelmina, and Hildegard all have an adult voice :v), and she's really cute at it. And at the end, Ataru (Fukuyama Jun) the M type, he's so funny acting as an M while voicing like that. It's like I imagining that Dark Flame Master is tortured by Rikka :)).\\n\r\nFor the OST, the OP is good, energetic, and makes you feel to watch the episode ASAP (not because the OP is boring but it's because it gives you full energy so you'll ready to laugh all the time), and the ED that performed by Itou Shizuka, Toyosaki Aki, and HanaKana is great too.\\n\\n\r\nCharacter 9\\n\r\nAll of the characters has their unique personality theirselves. A tsundere, a masochist, an \"open hearted\" delinquent, even elemental lords! (water, earth, lightning, and \"darkness\" fire). It just....wow...And that evil head of student council character, it just rare to see the \"real\" leader of the school is the head of the student council. Recently, there're so many characters that joined to the story and they have their own unique personality that different with anyone.\\n\\n\r\nEnjoyment 10\\n\r\nIt's the second anime that can make me laugh soooo hard in every episodes (the first one is SKET Dance). So, there's no lack for the enjoyment. Perfect score for it.\\n\\n\r\nOverall 9\\n\r\nWell what can I say? It's so good for the enjoyment, even the other aspects were not too perfect. But it's still good, right? eh, no, it's better than good is it?\\n\\n\r\nIf you feel you want to watch series and looking for a grooveless anime so that you are not forcing your brain to think \"How will it end?\" \"What will happen to him/her after that?\" or else and you want to laugh because your life's suck, I recommend D-Frag! for you.",
            "date": "2014-04-05T12:00:00+00:00",
            "helpful_count": 10,
            "mal_id": 138799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3015589.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hublaa",
                "username": "hublaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=138799"
        },
        {
            "content": "Love to fight, love to fight, I love to fight..........\r\nDoes anybody think that there are certain anime that would be better off as mangas, well, this is one of them, what it is basically something whose plot were pretty random and it only rides on one particular character, in fact this anime is depended on that particular character as he goes around being a typical victim of his club's antics, so no more fucking around and I'm gonna be presenting my ratings for each of this anime's category:\r\nPoor 3:\r\nStory:.........Simply, there isn't any and it would be better to forget what this anime's genre is.\r\nSound: Though,I like the opening theme, the voices of the character's were seemly too mature for their roles, like Kazama, his seiyu  Konishi, Katsuyuki no longer has that youthful intonation, Chitose's seiyu Saito Chiwa, should have used the same tone that she did in Bakemonogatari that is if she would have did the voice of Tama, Roka's voice should have been done by Takahashi, Mikako instead of  Hanazawa, Kana, in fact Hanazawa, Kana's voice over would have been a better fit on Chitose. About, Sakura, her voice over should have been done by Toyosaki, Aki since she does have cutie girl tone that she once did with Soga Keena from  Ichiban Ushiro no Daimaou, only the voice of Minami was a match for her. The rest, well, there probably need for me to concern about it since they're more like support character and it doesn't matter who did who.\\n\\n\\n\r\nFair 6.\\n\\n\r\nArt: Nothing much for me to say about it, except that the way  those male support characters were illustrated makes them too matured to be in high school, as if they have been there for quite a long time.\\n\\n\\n\r\nCharacter: \\n\\n\r\nKazama Kenji- well, I did mentioned that this anime rides on one particular character and it so happens that it is him, at one point I may have find it funny to see him going through all the antics that his club get into, but in another point I get annoyed by his tantrums and his rants when it would have been much easier if he just quit the club. Also, his tough guy looks makes him look like a dog whose bark was worse than his bite, despite of the fact that he can handle his own when dealing with delinquents, which it doesn't always end in success and he has to be saved by his club members, you might say that the rating for this category was for him.\\n\\n\r\n Roka Shibasaki - I may have find her cute for being a small but terrible character, but overall I see her as nuts who should be seeing a shrink.\\n\\n\r\nChitose  Karasuyama- she is basically the only character that I like to hate.\\n\\n\r\nSakura Mizukami- I may also like her, but then again her character was simply an over hyped one.\\n\\n\r\nMinami  Oosawa - For me, she was the kind of character that one would describes her as a question than a statement, where one would ask \"Who the fuck is she?!\"\\n\\n\r\nTakao- the only character that I like, she is another reason why I give this category a 6.\\n\\n\r\nAtaru and Shio- it it weren't for them as well, I would have given this part a 4, since they're the ones who serves as the comedy part of this anime. \\n\\n\\n\r\nGood 7.\\n\\n\r\nEnjoyment: thought it lacks a plot, it was still enjoyable enough to be watch when it was Kazama who is in such predicament.\\n\\n\r\nOverall: Good as it is, funny as it is, so does this anime deserve another season????????I won't recommend it, like I've said this anime should bet better off as a manga than an anime.\\n\\n",
            "date": "2014-03-31T03:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 138029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=138029"
        },
        {
            "content": "D-Frag tells the story of Kazama Kenji, a juvenile delinquent trying to make a name for himself at his school. He is confronted by Roka Shibasaki, president of the Game Development Club, but refuses her offer. As the club was one member short of disbandment, Roka, and other members of the club chased down Kazama, who eventually joins. The story sets itself here, where Kazama plays games that the GDC has created, and partakes in banter between the club. The show expands out, with inclusions from people like the Game Development Club (Provisional), and some of Kazama's friends, old and new.\r\nOne of my personal favouritethings about D-Frag is the main character, Kazama. He isn't anything special, certainly, but he's definitely a cut above the standard brown/black-haired, brown-eyed anime protagonist who just meekly goes along with whatever the rest of the characters do. He isn't afraid to speak his mind, and he will act however he sees fit, and I think that his voice actor did a very good job of capturing his character.\\n\\n\r\nThe happenings of D-Frag are very enjoyable. The premises, character interactions are all very well-done, with lots of comedy put in. There was no 'bad episode', nor any episode that felt too much like a previous one. Additionally, the different characters and how they all acted mixed very well together. The art and soundtrack are great, and everything feels very upbeat and lively, which makes for an enjoyable theme and makes for a nice change of pace from most anime of this nature where everything just sort of happens, and there isn't much kick to anything. The cost-cutting you usually see in anime wasn't prevalent, but it was still there to an extent.\\n\\n\r\nUltimately, D-Frag makes for a good show. It's not going to challenge your views on cinema or your view of life as a whole, but the 12 episodes are going to be a good ride, and you'll be glad you went on it.",
            "date": "2018-02-04T09:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 270644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6943364.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SCLFI",
                "username": "SCLFI"
            },
            "url": "https://myanimelist.net/reviews.php?id=270644"
        },
        {
            "content": "I choose this show because was potentially more common and easier to write a review. However, I found a show different from expectation.\r\nStory:\r\nSubstantially, a guy is forced to join in a club ready to be closed for insufficient elements. And you said: \"where i have hear this?\" Probably in almost every school club show. The list is really long. Other elements are girls who spend the time playing. Just the name of the club and the game they produce worth watching the whole series. Im not interested to spoiler the show, but the story follows the club's elements and a a few other throughschool life.\\n\\n\r\nWhat makes the show worth watching? The story starts pretty common, but i found in the direction something really awesome. Because, some lines are maybe better for a parody instead than a romcom. Im not joking, when i watched it i thought: im laughing like with noucome and korezom (2 parodies). And i dont remember a comedy so funny. However, everyone has a different sense of humour and i understand that is pretty personal.\\n\\n\r\nSecond, the characters. Im not saying that they are so unique, but the director use them in a great way. There isnt a char that eclipse all other, but everyone has his space to make the show funnier. \\n\\n\r\nAnimation: Decent\\n\\n\r\nSound: Nothing to write\\n\\n\r\nCharacters:\\n\\n\r\nIts hard write in this section. Because by one side, they are common. On the other, they works together in a wonderful way. And its nice when episode after episode, the bond within them grow.\\n\\n\r\nThe only i will write two words about is kenji kazama. I usually expect something from the male MC. He isnt empty, he isnt a weak person,he has some character. I cutted other show's rating when the male MC was pretty useless.\\n\\n\r\nOverall:\\n\\n\r\nI could reccomend this show if you like school comedy show. And even if you like this genre of show, you could not like the humour and (unfortunately) watch a mediocre show. The only thing i can say is: give it a try.",
            "date": "2017-12-25T20:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 266398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5627587.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/abhiss",
                "username": "abhiss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266398"
        },
        {
            "content": "\"We're a group of geeks with ambition, despair, and angler fish... Just Kidding\" D-frag OP\r\nAfter watching 12 episodes, this by far is one a hell roller-coaster ride. \r\nEven though this show doesn't have any plots or arcs, this show is towards more on Comedy, just like Nichijou and Daily Lives of High school boys. The gags, reactions really made me lol, Fanservice? There is one massive oppai, one flat oppai and the rest are normal. Sadly this series has no beach scene. Well, doesn't matter anyway, this series is enjoyable. Otherwise, directing and script is well prepared.8/10\r\nThe art is not really interesting, but for astudio that i never heard before, the animations are fluid and smooth, no loopholes or weird animations, They did a good job. Character designs is also nice, the chibi version also. 8/10 \\n\\n\r\nThe OPs and the EDs are enjoyable, listened repeatedly for the OPs full version. The seiyuus that were chosen to voice acting the characters are decent and noticably Hanazawa Kana (Kuroneko from Oreimo) voice acting Roka, which i recognized earlier after the story of the series begin.  Kazama's seiyuu voice acting is also great, never listen to his other voice acting, but for this i really like it especially on the reaction parts. 8/10\\n\\n\r\nI like Kazama's reactions, it's totally funny and i wouldn't say it's priceless. He seems to be oblivious to Takao's feelings. Takao on other hand, can be a tsundere sometimes and i love her reaction when she cries, (so cute). Overall, the characters in this series can be sometimes weird and sometimes fun. 8/10\\n\\n\r\nI really enjoyed watching this series, this made me laughed so hard that i almost woke everyone up (in my family) because it's a comedy series. But overall, it's a good show to watch, release my stress after doing school works. Hopefully this show can get a season 2 because....\\n\\n\r\nTHE HUMOR IS DAMN STRONG, I WANT TO LAUGH MORE.\\n\\n\r\nOverall: 8/10",
            "date": "2015-08-07T09:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 195423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=195423"
        }
    ],
    [
        {
            "content": "It ended. I really ended. After forcing me to laugh so hard every episode, it disappeared just like that. Well, I'm not going to talk about the emptiness in my life or how desperate and lonely i'am after watching the last episode, but instead, I'm going to give you all some insights on the anime by writing this review.\r\nI'm going to start by the story first. To be honest, it's kinda' hard writing about the main idea of the story. Why? BECAUSE IT DIDN'T HAVE MUCH OF A STORY. Okay here it goes.\r\nHigh school country delinquent, Kazama Kenji thinks that he got what it takesto be the strongest and the sole ruler of Fujou High. Kenji, despite of having no special traits whatsoever and frequently considered to be a norm, is the leader of the infamous “Kazama Gang”. Together with his two long-time friends who are also in the gang, it seems that nothing could possibly go wrong. That is until one day, the gang bumps into a Game Development Club consisting of four ‘unique’, or to be frank, strange -elemental freak- girls with their overly brute and outrageous behaviors. Kenji could probably be able to say goodbye to his hopes and dreams by the moment he was forced (I really mean by force) to joined the club.\\n\\n\r\nDespite of what i wrote above, this anime isn’t about any of those ‘ruling the school’ thing. This is the story of a boy who believes that he, himself is an ‘infamous’ delinquent at Fujou High. Instead of acting like one, he spends his days of high school slacking off and playing meaningless games in the club that he was forced to joined. Sometimes he also acts like a good guy and the others will say \"aren't you supposed to be a delinquent?\".\\n\r\nReluctant at first, he soon finds the club and it’s member to be exciting and interesting and also often defends it from the others who tries to destroy(disband) it. Well maybe not, but one thing for sure is that Kenji isn’t living a normal high school life. \\n\\n\r\nD-Frag is an example of an anime that actually has no meaningful plot at all. It mainly (almost every time) revolves around Kenji, playing board games and throwing limitless funny punch lines at everyone around him until sometimes he literally ran out of breath. Yeah, i think that’s all i can say about the story, nothing more. But that’s not the point. What makes this anime to be considered a very entertaining one is that such plot contains such humorous jokes that surely hit the mark every time and aren't predictable. Behaviours that you don’t see every day will make you burst into tears of happiness.\\n\\n\r\nThe artwork in this anime is not what you can say as a masterpiece, not even close. It’s plain, simple, but still very comfortable to see. It seems that Animes such as these aren't in a need of great and extraordinary art. Character’s design are very enjoyable and hilarious to see. Ranging from cute to roguish, bald to long-haired... i don’t really know how to describe in words coz' i find that some are ‘indescribable’, well maybe because they're just a bunch of random people.\\n\\n\r\nVoice actors did a great job in their voice acting. They make a great impression on how the characters are. What really caught my attention is definitely Kenji’s punchlines, so random yet so funny to hear. Not only the voice acting, the soundtracks fits the anime perfectly too. The Opening is very joyful, cheerful, energetic, and funny. It really makes the mood before watching the anime. The ED is sang by the seiyuus and that makes it even more interesting to hear.\\n\\n\r\nCharacters is what to be called ‘unique’ or maybe simply random. None of the characters have a normal personality as that of a high schoolers and it effectively supports the comedy which is the main focus of the anime. If you’re hoping for character’s developement, you're looking in the wrong place, my friend. Character development in this anime is so small that it could be considered as none..... But you wouldn't even mind anyway :D.\\n\\n\r\nScore\\n\r\nStory : 8\\n\r\nArt : 7\\n\r\nSound : 8\\n\r\nCharacters : 8\\n\r\nEnjoyment : 10\\n\r\nOverall : 9\\n\\n\r\nD-Fragments or D-Frag! or ディーふらぐ! is a very funny and enjoyable comedy-anime. It is indeed the best example of a comedy anime which can be considered as a 'good'. Personally it's my favorite in this winter season. If you think you have a reasonable sense of humor and is looking for an anime that could make you laugh until you lose your common sense, without no doubt i recommend you this anime!\\n\\n\r\n-Want to give a feedback? Comment in my profile and i'll be sure check on it and use it for further use-\\n",
            "date": "2014-04-04T23:09:00+00:00",
            "helpful_count": 251,
            "mal_id": 138721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3457557.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BadabumBadabicch",
                "username": "BadabumBadabicch"
            },
            "url": "https://myanimelist.net/reviews.php?id=138721"
        },
        {
            "content": "\"So, I think we're going to start the king's game now.\r\nthis game has a number of sticks in which one is inscribed the king. The rest are commoners. The commoners should follow the king's command at all cost. But since there are only two players this time, we are going to go with a simple game where the one who draws the king will win.\r\n...So why the hell are these two ready to kill each other?!?!?\"\r\n-From D-Frag\r\nFirst of all, let me put the summary of this whole anime in one sentence.\r\nWHY DID YOU HAVE TO EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEND!\r\n...Then, before I actually begin, let me explain that becausethis is a comedy like nichijou where nothing makes sense but everything is funny, I'll grade this differently.\\n\\n\r\nPS. Absolutely no spoilers, but some words may suggest indirect minor plot points.\\n\\n\r\nStory: 10\\n\\n\r\nI'm wrong? There isn't much of a story?\\n\\n\r\nNo, this is not that simple.\\n\\n\r\nCreating a comedy requires more skills than one might think. Especially for a theme like D-frag, one needs to be very thoughtful. This is not just senseless laughter found in nichijou, or a laughter at the dumbness of baka to test. This gets a game as casual and simple as king's game or the war of thumbs and create something funny and interesting. Nobody wants to watch two men playing the game of thumbs, but in this, yes you do. The ability to make something boring funny is a grandiose skill that requires much attention and imagination.\\n\\n\r\nAnother criterion that I absolutely loved was the continual unfolding of funny behind stories and mysteries that just cracked me up. I cannot explain this without spoiling, so I will go on.\\n\\n\r\nStory was a work of art. Many will disagree and say there was no much of anything for story, but this, like I said, need to be given a whole new method of grading.\\n\\n\r\nArt: 9\\n\\n\r\nSure, the animation is not the best in the world, and we can't help but notice the rainbow colors of the hairs.\\n\\n\r\nHowever, these are not necessary factors when making a comedy.\\n\\n\r\nWhat D-frag wanted and needed was an animation where one could easily crack up, or be caught in adorableness, and this type of animation was its soul mate. Instead of hiring IG entertainment or Ufotable, the simple and \"chibi\" animation was what it really needed.\\n\\n\r\nBut this alone wouldn't get the anime 10, so I gave art a nine. A fluent movement in unnecessary scenes are also a factor to crack people up, but unfortunately D-frag didn't contain this element. For that I gave art a 9.\\n\\n\r\nSound: 8\\n\\n\r\nStarting from the seiyuus this time, in contrast to how I usually grade the sound. The sound is in three parts: BGM, OP/ED and voice over.\\n\\n\r\nThe voice actors are some of the greatest in the world. For Shibasaki Roka, who needed both the yandere-type voice and cute-type voice, there were not too many in the anime history who could do both but the jack-of-all-trades voice actor hanazawa kana. Roka's voice requirements overlapped well with Sengoku Nadeko of monogatari series, and there was no better candidate than Kana in this voice over. Then, as for our main-character delinquent, we have katsuyuki konishi, the prime voice actor of delinquents. In addition, for the voice actor of sakuragaoka, a girl-like boy who had to sound both like a boy and a girl, we had the voice actor of hayate, shiraishi ryoko. We have the woman who changed Japan towards cuteness, aki toyosaki, for the best girl, along with takao in the story, funabori. Not to mention of course, they all did their jobs admirably. Even the extras' voice acting was admirable. However, there were times when the voicing was a little awkward--especially when kazama played the straight-man role. To begin with kazama's voice actor is not aced in straight-man role. Also, the times when the voice actor shouted \"ba-ka!\" weirded me out a little bit. Still, kazama's voice actor did his job splendidly and the ba-ka was understandable for the genre of the anime, so I gave voice acting a 9.\\n\\n\r\nAs for the opening, I at least hated the song. However, as we learned from a certain song called \"Platinum Disco\" and the opening of \"Haiyore Nyaruko-san\", there are songs which deserves A+++ for the music quality and other songs which deserves A+++ for catchiness, and this opening is the latter. Still, the song could annoy some people off, so I gave this an 8.\\n\\n\r\nThe ending, on the other hand, was in between quality and catchiness. It was both easily remembered in the ear and sang well. Still, the song was not good enough to be given a 10, so I gave the ending a 9.\\n\\n\r\nLastly, the BGM's were done splendidly. They weren't cliche or repeated over and over. They were used thoroughly and well. Some songs inspired urgency and even awe and a BGM that does the right job deserves a 10.\\n\\n\r\nSo all in all, I gave the sound a high 8.\\n\\n\r\nCharacter: 8\\n\\n\r\nDon't you just love all characters?\\n\\n\r\nWe have all characters with their own appeals, especially Takao and Funabori, who are not in the main 5 characters but are more famous than the main 5's. I cut it off also because of that--the main characters are not given enough attention, especially Sakura. She, although being a part of the club, shows little significance in the whole anime. I also cut off points for the teacher characters that appeared at the last second.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nBUT WHO THE HELL CARES ABOUT ALL THESE?\\n\\n\r\nD-Frag certainly cannot be a masterpiece, considering each categories carefully.However, they can make people laugh like no other, and they don't need any of these categories to do so. The story? WHO CARES! The art? WHO CARES! The sound? WHO THE HELL CARES!!! The characters? WHO IN THE HELL CARES!!!!! D-Frag is simply fun. It does not bring up the nonsensical exaggerated comedy in Nichijou, or the eternal dumbness in baka to test. They are fun because they are. Even if the story is nonexistent, even if the art is premature, even if the sound is annoying, even if the characters aren't fully developed, D-Frag can turn the tables and create enjoyment out of it.\\n\\n\r\nOverall: 9\\n\\n\r\nD-Frag is certainly, without doubt, the best anime of the spring/winter of 2014. There might not be stories to be awed at, or arts to be awed at, or sounds or awesome character developments to be awed at, but this definitely is an anime that you can be awed at.\\n\\n\r\nIt most definitely needs more attention. If you haven't watched it, you should immediately start watching.\\n\\n\r\nThen, happy anime-ing and may the anime be with you.",
            "date": "2014-03-24T16:44:00+00:00",
            "helpful_count": 133,
            "mal_id": 136817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2639689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MotherOfUltra",
                "username": "MotherOfUltra"
            },
            "url": "https://myanimelist.net/reviews.php?id=136817"
        },
        {
            "content": "\"Just Finish Watching D-Frag\"\r\nLooking at the poster thinking that maybe this is just your another typical Comedy anime but No\r\nafter watching all 12 episode, I was stunned how Marvelous it is.....\r\nThis anime has no doll moments at all...Every episode is worth dying to see 'cause how great and enjoyable it is.\r\nThe only downfall is that there's only 12 episode they should do more maybe a hundred lol. \r\nI don't know why they stop....maybe the budget or the ratings but who cares they should do more and can't w8 for\r\nthe next season...  \r\nD-frag has no main story at all... It's all about the characters goofingoff..If you want to watch a feel good anime \\n\r\n try this one it won't let you down. D-frag will you make you laugh and it will make you feel that your in your teens again having a crush on someone it will make you feel in love lol... and after you finish all the episode you want to beg for more episode.... I do.\\n\\n\r\n'Cause now a days it's so rare to find a good harem,comedy with a little bit of romance and school club.\\n\\n\\n\r\nThe Characters are great,always having a good time, They always making fun of the main protagonist and also the characters are very wacky & crazy but likeable....\\n\\n\r\nThe Bottomline is this D-frag is a pure comedy as it's finest and don't take it too seriously,just have fun while watching it. \\n\\n\\n\r\nPS: I Recommend this anime only if your a fan of Romance,School Club,Harem & Pure Comedy (Kenji X Takao)",
            "date": "2014-05-25T17:35:00+00:00",
            "helpful_count": 121,
            "mal_id": 144537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2425719.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bloody_Venus55",
                "username": "bloody_Venus55"
            },
            "url": "https://myanimelist.net/reviews.php?id=144537"
        },
        {
            "content": "While searching for a comedy based anime, I stumbled across one with a strange title: D-frag. The premise seemed unappealing and boring, with a generic setting that didn't promise anything spectacular. Nevertheless, intrigued by the title of it, I began watching it, and I can say I was pleasantly surprised. D-frag is comedy/harem anime, though it is not your typical ecchi/comedy anime out there. So what makes it hilarious? I will try to explain it below.\r\n~Story~\r\nFirst of all the comedy is based on the manzai, where a \"Tsukommi\" (straight man) retorts the actions of the \"Boke\" (funny man) who creates a funny situation. This isquite frequent in japanese comedy shows, and being a personal fan of this type of comedy, naturally appealed to me. However, if this type of comedy doesn't appeal to you, then this may be not suitable for you.\\n\\n\r\nD-frag focuses on the delinquent Kazama Kenji, who with the help of his gang, the \"Kazama\" gang, intends to take over his school. This doesn't go as intended and in the process he is forced to join the game creator club (temp), composed of the most strange girls. From here on audiences observe how Kazama deals with the bizarre club members, leading to absurd and hilarious situations. These range from typical everyday life situations, to the same events a lot school comedies have to offer, such as territorial fights or festival games, naturally taken to the extreme absurdness.\\n\\n\r\nD-frag has little story to offer, besides the actions of the game creator club (temp). The story is split in mini arcs, each with enough comedy to make you laugh, making it perfect for this type of anime. It also tagged with the romance and harem category, though the harem aspect is not the main focus of this show, neither is the romance. Moreover, it is used to enhance the comedy. \\n\\n\r\n~Characters~\\n\\n\r\nBeing a comedy based anime, D-frag has a lot of characters to offer, each with its own charm. As it is a harem too, there are a lot of female characters but these are not detrimental to the anime; which is to say, it doesn't exhibit an excessive focus on the females. Personally speaking, the protagonist Kazama was of the most interesting character as it was not your typical main protagonist. He doesn't take romantic interest in the female lead characters, neither does he always accomplish his goals, in fact he is often helped by someone, which is bonus.\\n\\n\r\nOther character that stood out, and is my personal favourite, was the teacher Sean Conne Conne, who clearly represents the actor Sean Connery. His character, moral values and actions are very refreshing to the anime, besides enhancing significantly the awe factor of this character. Naturally, character development is nihil in this anime, in addition to the fleshing out of the characters.\\n\\n\r\nThe secondary characters also play an import role D-frag: these have all certain personalities that makes it easy to distinguish from the others. While the protagonists create absurd and hilarious situations, these are often enhanced and supported by the actions and comments/retorts of the secondary characters, and vice versa. There are also different factions present, each with their characteristic attribute, for example, the baldies or music bands. The good thing is that these are all simple and not such impressive characters, they're in fact simple people even though the anime portrays them as \"badass\" characters.\\n\\n\r\n~Animation and sound~\\n\\n\r\nThe animation quality of D-Frag is nothing outstanding, though well executed, what is to be expected from a modern show. The art style of D-frag was toned down a bit from the manga, which was at first rather lackluster, and is a welcoming change. Character designs are varied, yet are nothing remarkable. The facial expressions were well done, which was of importance for the comedy gags, as without them it would have been worse.\\n\\n\r\nThe soundtrack used in D-Frag was nothing outstanding and it could get repetitive at times, yet there were some compositions that fared well with the different sketches and situations it was trying to portray to the audience. The voice actors performed their roles well, fitting with their character's personalities, as in addition enhancing the comedic element of the anime.\\n\\n\r\n~Enjoyment~\\n\\n\r\nI personally enjoyed D-frag a lot; It made me laugh throughout the whole duration with hilarious and absurd situations, as well as the wide assortment of characters. There were naturally some gags that got old or were predictable, besides of having no story direction whatsoever: this was nevertheless a small drawback. So if you are interested in watching a comedy anime with an enjoyable harem, or just are searching for something to watch, D-frag may be something for you. Just don't expect any deep characters or story.\\n\\n\r\nThank you for reading.",
            "date": "2015-11-25T09:05:00+00:00",
            "helpful_count": 42,
            "mal_id": 204161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=204161"
        },
        {
            "content": "Am I the only one who thought this anime was going to have explosions and have a war-like theme? Yeah? Oops. With the title D-Frag!, I thought this would have something to do with a hand grenade. Nope. It's one of those one-guy-bunch-o-girls-in-club anime and I was putting it off until one of my friends suggested it, claiming it was hilarious.\r\nStory: 8/10 \r\nSigh. Not again... The plot definitely did not interest me at all. I've watched plenty of shows where a guy goes into a club with a bunch of girls in it, yadeeyada. Despite the synopsis being so bland, I found that the actualplot was progressing at a nice rate. The setting actually moved outside of the club room (phew) and there were a variety of conflicts that the protagonist faced.\\n\\n\r\nArt: 8/10\\n\r\nThe art is definitely very average. Typical school uniform, typical characters all with different hair color, and typical school setting. The art also tends to focus a lot of attention on the head of the characters. I don't particularly like how the hair is colored - it uses gradient, you'll see what I mean if you plan to watch this. Nothing particularly stands out... until those fantastically inputted little, special scenes. The art will suddenly catch your attention and I guess it is because of this contrast that I paid closer attention to the show. \\n\\n\r\nSound: 8/10\\n\r\nThe background music does not stand out too much, which isn't a bad thing. This show is very light-hearted and most of the time, if not all, it fits with the scene. The little sound effects are nice. Voice acting is also great, but personally, the male protagonist screaming all the time gets to me. \\n\\n\r\nCharacter: 10/10\\n\r\nWOAH THERE. Yeah, this anime gets a perfect score for character. Each character is unique, all weirdos. Maybe there's one character here and there who have the generic behavior of all school-related anime but the variety of personalities is extraordinary. This anime somehow makes even the minor characters of the show stand out. It's quite genius, actually. This anime may not stand out much in terms of the other criteria, but I fell in love with all the characters - even those who only appear for a max of two episodes.\\n\\n\r\nEnjoyment: 9/10\\n\r\nEach episode did not fail to elicit laughter from me. The oddity of all the characters along with the random plot and plot twists combine to create an anime that does not fail to please. For a school anime, this one does not fail to deliver entertainment. \\n\\n\r\nOverall: 9/10\\n\r\nDo give this a try and if you want to test this anime's waters, try two episodes, not one. I felt the first episode does not truly represent the rest of the show. I would definitely recommend this to anyone who enjoys a little chuckle and fall in love with the characters. However, if you cannot handle the male protagonist screaming for half the episode every episode, this may not be for you (take into consideration that some people enjoy this screaming!).",
            "date": "2014-10-06T20:25:00+00:00",
            "helpful_count": 25,
            "mal_id": 163913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3811315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lagcrazy",
                "username": "lagcrazy"
            },
            "url": "https://myanimelist.net/reviews.php?id=163913"
        },
        {
            "content": "One of the most underrated animes ever. This anime will make you laugh so hard that the twelve episodes zoom by way too fast. I definitely recommend this anime to those that enjoy a protagonist who tries to act badass when he really isnt and really weird characters.\r\nStory - In terms of the story, it is very weak as expected of a comedy.\r\nIt's focus is on the Game Creation Club and doesn't seem to progress anything further than that. There is some romance to it, but overall it is just comedy. Even though it sounds so bland and boring, you tolerate it because the rideitself is really fun. \\n\\n\r\nCharacters - The characters are all so lovable and funny. They each have their own way of telling jokes. The main protagonist is angry at everything because everyone acts so foolishly that it's cute. The members of the club have their own \"types\" (Fire type, darkness type, lightning type) and they take this sort of stuff so seriously that when someone as sane as the main protagonist approaches the scene, you can't help but agree with him. The fact that you can relate so well with the main character, who is in a situation in which every character he meets, including his best friends, is out of control makes it a soothing experience.\\n\\n\r\nArt/Sound - I love the opening theme. It matches the humor of the whole anime. It's all about having fun. They also match the amount of energy that is  put into this anime.\\n\r\n\"We're a group of geeks with ambition, despair, and angler fish... just kidding\"\\n\r\nIt's really quirky too. \\n\r\nThe art style is also really comedic. Characters make the weirdest facial expressions and in general it makes everything funny/cute.\\n\\n\r\nEnjoyment - If you enjoy a good laugh, definitely watch this anime. You won't even worry about the plot, you just want something else to happen so they can just act themselves. \\n\\n\r\nOverall - Story is obviously bad, but the whole comedy portion has been nailed. Definitely watch this for the sole reason of comedy.",
            "date": "2014-08-02T13:31:00+00:00",
            "helpful_count": 18,
            "mal_id": 154911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3981069.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yourchinguxd",
                "username": "Yourchinguxd"
            },
            "url": "https://myanimelist.net/reviews.php?id=154911"
        },
        {
            "content": "\"Love to fight! Love to fight! I love to FIGHT!\"\r\nThis is actually from the opening of this anime. The name is \"Stalemate\" by IOSYS jk Girls. D-Frag or D-Fragments is one of the anime that I enjoyed watching in the winter season anime as stated in my previous Noragami review. However, I didn't enjoy this anime fully as I did with most anime that I have watched.\r\nD-Frag was directed by Seiki Sugawara and was produced by Brains Base who did some wonderful anime like \"My Teen Romantic Comedy SNAFU\" which is a high school slice-of-life comedy just like the anime I am reviewing now.\r\nSTORY (5):\r\nThestory takes place in a high school setting. A student Kazama Kenji was forced to join the Games Creation Club by its members. So what you are going to expect from this anime is how Kazama Kenji gets to bond with the members in the Games Creation Club who are all girls. \\n\\n\r\nOf course, there are some funny moments. Those moments to me are fun to watch but it didn't make me laugh out loud. The best moment is in episode 6 when Hachi Shio makes a love triangle with Roka & Kazama. I really watched it and never get bored. \\n\\n\r\nThis anime builds up tension in the later episodes which I see in most anime I watched. Like when the later episodes, they show a rival group and the battle begins. If an anime is awesome, then the anime must surprise me from the start to the end. However, this anime failed to do that.\\n\\n\r\nART (7):\\n\\n\r\nThe animation is refreshing to look at especially when it comes to the character designs. For example, Roka Shibasaki's design is very cute but sometimes can be normal in some situations.\\n\\n\r\nSOUND (7):\\n\\n\r\nBoth the opening and ending songs were very addictive.\\n\\n\r\nI don't have to mention the opening song because I have said it in the introduction.\\n\\n\r\nThe ending song was addictive. The song starts with Batsu Game. Batsu game means punishment game. The ending song is \"Minna no Namae wo Irete Kudasai\".\\n\\n\r\nCHARACTER (6):\\n\\n\r\nEvery character has their unique personalities. I am fine with all the characters. At least the characters never show me any annoying traits (ie. crybaby, arrogant, whiny). However, the characters didn't stand out well enough for me to love them.\\n\\n\r\nThere was one character who looked a lot like Harima Tenma from School Rumble and that character I am referring to is Hiroshi Nagayama. He wears dark glasses like Harima Tenma but his hair style looks different from Harima.\\n\\n\r\nAtaru Kawahara wears glasses but he is interesting as a masochist who can tolerate pain. Next time, I would host a show with him (if he is real) to be an assistant in \"Rate the Pain\". Nah, just joking.\\n\\n\r\nRoka is very cunning and she always tricks Kazama into doing things for her. Like for example, she can manipulate people by showing her cuteness and her creepiness. This is very similar to Yuragi Hakoniwa from Noucome. She is cute but can sometimes be very intimidating.\\n\\n\r\nChitose Karasuyama reminds me of Yozora from Haganai with her sadistic attitude.\\n\\n\r\nI seriously find that most of the characters resemble like some of the characters I knew from previous anime.\\n\\n\r\nCONCLUSION (6):\\n\\n\r\nAlthough this anime has its fun moments. They weren't enough to surprise me in one single bit. The comedy wasn't strong. I wasn't laughing out loud throughout the anime but the animation was interesting to look at.\\n\\n\r\nThe story didn't take me by surprise. A comedy has to make a person laugh out loud. If a comedy has failed to make a person laugh out loud, then the comedy is dull. Just like french fries, when you order a french fries and you take a bite and found that there is no salt in the french fries which makes them dull french fries. \\n\\n\r\nHowever, if you found the comedy very funny and entertaining, that's good. If you can relate with the characters better that's also good. In fact, I did appreciate the effort that Seiki did in making this anime a good comedy. But sadly, this anime didn't stand out among other anime that I have watched.\\n\\n\r\nSo, for what it's worth, I give it a 6 out of 10.",
            "date": "2014-03-24T09:04:00+00:00",
            "helpful_count": 18,
            "mal_id": 136725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=136725"
        },
        {
            "content": "Feeling a little tired of late? Having trouble keeping thoughts organized? Well perhaps you need to D-Frag, or so the title seems to suggest. This show is a Haganai/Seitokai no Ichizon type clone with overly vivid personalities and a rather unique combination of attempted coolness and comedic cuteness. Basically, a supposed wannabe delinquent, with Sonic the Hedgehog sharp hair, named Kenji is coerced into joining a game development club. Except that they don't really develop games. Rather, they just lounge around and occasionally play some games, and occasionally get into trouble with other groups.\r\nIf you're looking for a very lighthearted slice of life with somenot-so-realistic personalities, this may be a good choice. I say maybe because you'll either love or hate the overall feeling of the show. Personally for me, the attempted coolness came across as immature and rather dull. Others have shown a very different opinion though so you might want to give the first episode a shot and see if you enjoy it.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair overall with a vivid color scheme and a lot of over-dramatization. Backgrounds are fairly average and likewise for shading. The characters are pretty unique in styling though I felt that facial animations were a bit lackluster as characters didn't seem to respond much to external stimuli.\\n\\n\r\nI guess there is a bit of action though most of it is extremely light and more of the comical nature. Fighting by splashing water or dirt on each other? Kind of cheesy if you ask me. There is a slight amount of ecchi though more like suggestive references, they probably tried to incorporate something like Seitokai Yakuindomo but didn't really succeed very well. Otherwise you just have bouncy from Buchou and a bit of cross-dressing.\\n\\n\r\nSound:\\n\r\nThe Engrish OP is pretty representative of the show, taking a very shonen-based cool and combining it with cute-ish female voices. The song is pretty discordant with little melodic value. The ED is a bit more melodic but still has the overly-playful vibe that just feels much more fitting for an elementary school. The BGM is pretty light but serves its purpose. There are a lot of effects, due to the comic nature of a lot of events.\\n\\n\r\nThere are a lot of veteran VAs here but I feel like they over-cast for a lot of the roles. Shizuka Itou is the standout as Buchou but most of the other roles just didn't have enough characterization to merit the strong VAs. Especially painful were Kana Hanazawa and Kana Ueda's roles; what's the point if their character can't act cute and tsundere, respectively?\\n\\n\r\nStory:\\n\r\nThis is frankly a glorified slice of life show that is based heavily on character-interactions, so I wouldn't expect much in terms of a central plot. If there is anything holding the story together, it would be the repeating pattern of someone or some group trying to get the fake gaming club closed. The oddball group works together to somehow try and overcome impossible odds. I guess it helps that the student council chair, who you never see actually doing student council chair-like stuff, is in the club. Some episodes are episodic while others clump up to form mini-arcs. There is a bit of a climax near the end but nothing mind-blowing.\\n\\n\r\nThe more important thing to note here is the over-the-top nature of the characters and antics in this show. If you're just watching for the comedic aspect, then this is all fine. However, if you apply an ounce of thought into it, be prepared for very little to make sense. Besides the numerous plot and character holes, the school apparently has multiple infamous gangs and groups running around and causing messes, with relatively little discipline being dished out. A lot of behaviors and events are just so out of the ordinary that the merest thought of plausibility is cast aside.\\n\\n\r\nCharacter:\\n\r\nGranted that this show isn't going for realism, I still find it annoying that the characters were so two-dimensional. Yes, the characters have interesting traits, but these feel unshakable in an unnatural way. A good example is Roka, a seemingly quiet and chibi figure who apparently possesses the comic ability to \"conquer\" others by putting bags over people's heads. Yes, she's interesting in a curious way but you never get the sense that she's remotely relatable. The sadistic student council chair, Chitose, acts cool all the time but just once you'd like to see her out of that annoying facade- don't bother waiting. The only characters that really have any merit in my mind are Buchou, who harbors some feelings for Kenji, and Kenji himself. Everyone else, and mind you this includes a huge amount of secondary characters, are just fluff. While it's true that the character interactions had a lot of character (no pun intended), it was painfully lacking in depth.\\n\\n\r\nValue:\\n\r\nIt's probably pretty clear by now that I didn't have a very pleasant experience with this show. Maybe I've outgrown this genre, but I still feel there are much better works out there that provide much more entertainment value without having to resort to meaningless gimmicks and outlandish, unrealistic personality traits. While the show has some comedic value and a drop of relationship value, it is spread out too thinly to make much of a positive impact. If you agree in opinion with my other reviews in the genre, I'd pass on this one.",
            "date": "2015-11-04T23:12:00+00:00",
            "helpful_count": 15,
            "mal_id": 202699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202699"
        },
        {
            "content": "\"D-Frag!\" An anime that I was very skeptical about at first, even after watching the first two episodes I was trying to understand. I had no idea what was going on, but for some odd reason I still continued to watch, and I enjoyed every moment of this anime. It's not too often that I find and anime where I am laughing through every single episode.\r\nScore\r\nStory: 10\r\nArt:8\r\nSound:8\r\nCharacter:10\r\nEnjoyment:10\r\nOverall:10\r\nNow first off we have the story, some people might not believe this has a solid storyline or any sort of plot so to speak, but after watching an Anime such as this you can just tell how muchthought and work was put into it. Even the boring things in life that were done in this anime are a must see. It made everything more enjoyable and easy to watch. It was fun to watch!\\n\\n\r\nThe art itself wasn't anything to crazy but it was more of a comfortable and relaxed environment if that makes sense. From the start it was just a feeling of \"Yes, this is good\". Whether it was the chibi or the basic art, it all just felt right.\\n\\n\r\nThe soundtrack for this anime wasn't the most amazing in all of anime history, but it was a perfect fit none the less. The voice actors for this anime were very good as well, you could feel every expression and feeling through their words, the reason I gave it only an 8 was one of the characters, they just sounded too much like a different anime character for me.\\n\\n\r\nWhat really makes this anime what it is, is this group of insane and outrageous characters. If anything, saying they are insane and outrageous is an understatement, right off the start of the anime you get a hit to the face with crazy. These characters being so overbearing at times or mentally unstable even, is the glue for this outstanding anime.\\n\\n\r\nI enjoyed this anime thoroughly and couldn't stop laughing the whole way through. I would recommend this to anyone who enjoys anime and would like something to cheer them up or make them laugh a lot. \\n",
            "date": "2015-05-05T04:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 187155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4062721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JamalWelfare",
                "username": "JamalWelfare"
            },
            "url": "https://myanimelist.net/reviews.php?id=187155"
        },
        {
            "content": "The things than make D-Frag an amazing anime is the comedy elements that it has. The story is very good but nothing surprising, what shines the most in this anime is randomness of comedic timing it has. I never stop laughing in any of the episode because it's that good. The art in this anime is very well done with colorful atmosphere and very well Japanese voice acted. The characters in this anime is very well developed and I love all the characters even the side characters that only appear for 3 or 4 seconds. I had a blast with this anime so I caneasily say that i would recommend this anime to anyone that like comedy genre anime. 10/10 (Maybe I'm a bit over exaggerating but this anime is really that good)",
            "date": "2017-12-20T08:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 265721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6797895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bahram_Raftari",
                "username": "Bahram_Raftari"
            },
            "url": "https://myanimelist.net/reviews.php?id=265721"
        },
        {
            "content": "D-Frag is an ongoing comedic manga by Haruno Tomoya. In 2014, Brain's Base (yes the studio behind Baccano, Ixion Saga DT & OreGairu) aired a twelve episode adaptation. I'll be covering both that and the one episode OVA that was bundled with a special edition for the manga.\r\nStory:\r\nOur protagonist, Kazama, is a delinquent. One day he and his fellow skivers find themselves running afoul of the Game Creation club. To their surprise, they're handily beaten by the girls in the club. This swiftly results in Kazama being recruited to join the club. This, naturally, leads to shenanigans.\r\nThe humour in this is pretty hit and miss.It has some very funny moments. The types of weird games the club comes up with can be really funny. A lot of the gags referencing games are also quite well done. The series is also good at coming up with crazy scenarios that have a lot of comedic potential. The OVA is a great example. The characters get involved in a race for special limited edition water and there are a lot of comedic possibilities with that as your premise. It wouldn't work as a long, full length anime but for one episode it's a perfect concept.\\n\\n\r\nOn the other side of things, you have the jokes about masochism which just get really repetitive and predictable very quickly, thereby losing most of their impact. The series manages a few scenes that work with it but for every time it works there are three where it doesn't. It doesn't help that the series gives us two characters who have masochism as their main spiel. The same major issue holds true for the bulk of the love triangle japes. Kazama finds himself of interest to two different girls in a way that's so obvious even I wouldn't be oblivious to it if I were in that situation. And I once thought a young woman wrote her phone number on something she handed me by accident. And this dude seems completely oblivious. But that's not the issue with these jokes. The problem is that they're basically the same thing every time. The buxom girl gets embarrassed and acts cringey, while Roka is just completely forthright and Kazama plays the oblivious straight man. They can be funny sometimes but they're usually just cringe-worthy.\\n\\n\r\nI will give the series credit, though. Its comedy does work well more often than it falls flat, by a pretty strong margin.\\n\\n\r\nCharacters:\\n\\n\r\nAll in all, the cast works fine in a comedic context. If this were a serious series, they wouldn't. But as is, the only real complaint I have is that Kazama is kind of dull. His one job is to react to all the crazy shit everyone else does, and get dragged into it. Some might argue that you need the more “serious” character to help emphasise the craziness and respond to it but Galaxy Angel has an entire cast of bizarre, quirky characters and it is a superior comedy to this. Same with Muteki Kanban Musume.\\n\\n\r\nI'm not saying that no comedies should ever have that type of reaction character, but they aren't exactly interesting &, honestly, they shouldn't be put in the lead role. The mostly uninspired and uninteresting love triangle interactions don't help make a case for him either.\\n\\n\r\nArt:\\n\\n\r\nThe animation is decent enough. Kind of standard but the designs work, the movements are smooth and the series does use comedic stylistic shifts and expressions pretty effectively.\\n\\n\\n\r\nSound:\\n\\n\r\nHanazawa Kana, Takahashi Mikako, Saito Chiwa & Ueda Kana make for a thoroughly solid cast. About the worst I can say is that the series may be excessive with its use of exaggerated reactions and it results in a lot of yelling that can get quite trite. I bet Konishi Katsuyuki really shredded his voice doing that since he gets the worst of it. Chamomile tea is good for that, Mate. The music... I wasn't fond of the theme tunes in this one. It goes for that super hyperactive, noticeably auto-tuned aesthetic you get with some comedies. The incidental music was perfectly fine. Not the best I've heard from Matsuda Akito, but decent enough.\\n\\n\r\nHo-yay:\\n\\n\r\nThere's a bit. One of the masochist characters seems to want some polyamory involving Kazama. The OVA gets some homo-erotic moments between Sakura and Noe.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nD-Frag has a good amount of funny moments and some characters with strong quirks to carry it. I would go so far as to say that it is a good comedy. But it also suffers from putting a rather standard, dull character in the lead role and from some comedic bits that just get played out way before they stop using them. So, I can't call it great. Final rating, a solid 7/10. Next week, The Choujo.",
            "date": "2018-07-04T14:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 282990,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=282990"
        },
        {
            "content": "Probably my favorite comedy anime of all time. I laughed throughout the entire anime. I enjoyed the entire anime as well. I have already watched multiple times and will not hesitate to do another re watch when i finish my current anime's. \r\nWhen it ended i felt really empty. It was one of those anime that you really enjoy and get really into but then suddenly ends. Therefore leaving you with an empty void that can only be filled with watching as many anime as possible or reading the manga.\r\nThe characters were amazing and unique and all worked together very well to create a laugh.This anime is also a harem with the typical dense protagonist, but that doesn't really turn me off it at-all and it shouldn't turn you off either. The man character generally acts as a straight man making funny remarks when the characters do something he doesn't approve. The main character Kazama is also a delinquent, but is probably one of the nicest characters in the entire series. His little sister being added into the mix later on also makes the comedy reach an entire new level.\\n\\n\r\nI would totally recommend this anime, I'm even planning on buying the physical copies of the manga as well, this is one of the only anime's that's actually made me want to do this.\\n\\n\r\nFinally Takao is best girl. :-)",
            "date": "2018-06-26T10:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 282283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5777104.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xhaia",
                "username": "xhaia"
            },
            "url": "https://myanimelist.net/reviews.php?id=282283"
        },
        {
            "content": "Short and simple: this anime is a MUST.\r\nTremendly hilarious situations in every episode and great and outstanding characters. Honestly I was not expecting too much from an anime about games, but the way they take them to completely unexpected levels is really funny.\r\nThe first episode might be misleading as it seems to focus in the quarrelsomeness of the main character and looks like just another school anime, but from that point on, it shakes you from one extreme to the other until you are completely amazed.\r\nNot recommended to: People looking for deep and psicological dramas\r\nRecommended to: Anyone who wants to have at least 20 minof surprising and funny moments",
            "date": "2018-05-01T06:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 279474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7035670.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NullFreaks",
                "username": "NullFreaks"
            },
            "url": "https://myanimelist.net/reviews.php?id=279474"
        },
        {
            "content": "Hello Everyone, I'm PyraXadon, a blue fire type.  Today on MAL reviews, I will be talking about, probably one of the most interesting and random, but enjoyable animes out there.  Everyone, this is D-fragments!\r\nStory (7.76/10): The story of D-fragments, or D-frag in its shorter name, is about a second year by the name of Kazama Kenji, who aspires to be a delinquent at his school with his friends Nagayama and Yokoshima, as the Kazama Clan, or whatever they're called.  They're not really well known.  It is then that Kenji meets a little girl by the name of Roka, who offers himto be part of her club, which after some insanity of the over 9000 kind and some running around the school, that Kenji agrees to be part of the club, and the story continues on from there.  \\n\\n\r\nWhen you're looking at an anime that's based on a club, you normally get the same formula of the characters of the show going to the clubroom and doing whatever, (which is usually nothing), making a couple jokes that are \"funny\" to us, the audience, then ending the episode off in a sort of episodic form.  Now take that, and reverse it.  That is what D-frag is.\\n\\n\r\nThe story of this series revolves around the antics of the game creation club (provisional), as they go through life at school basically breaking all of the school rules, breaking property, running around and attacking each other with RPG game style attacks, and overall just being as insane as possible.  And that's only the first episode.  Beyond that, the series doesn't really go beyond that sort of mindset.  The whole series is essentially the game creation club's antics, explained in a great multitude of hilarious and VERY entertaining ways in an arcic setup, that actually works.\\n\\n\r\nThe series itself doesn't try very hard to be entertaining, and it doesn't need to, because its idea is just so damn absurd, that it is extremely entertaining and very fun to watch.  The series was made to be very funny, and it succeeded in doing so in the end.  Also, the end.  This series has one of the most bullshit and random endings ever, that I laughed out loud because of just how absurd and hilarious it was when I saw it.  \\n\\n\r\nOverview\\n\r\n+  Absurd and entertaining plot\\n\r\n+  Many wonderful, memorable moments\\n\r\n-   Somewhat arc heavy\\n\\n\r\nCharacters (8.78/10):  Now, the characters.  When you look at D-fragments' picture, the first thing that comes to mind is, harem.  That is not actually the case.  (The manga does have that tag for some reason.)  This series does have a multitude of female characters, but it is in no way, a true harem.  Because, these girls are much more interesting than most harem females you will ever see.\\n\\n\r\nKazama Kenji, as the main protagonist is the aforementioned delinquent of this series.  With his spiky hair and rough way of talking, he is undoubtably someone who aspires to be one, which ultimately fails in the end.  Kazama is an interesting male protagonist, in the sense that he really doesn't care much for what is going on, since he's just as lost as the audience is in any given situation, but when it comes down to it, he does care for the people and what he does, as he is shown to be helping out a lot in the game creation club's \"quarrels\".  However, in terms of personality and favor from the audience, he is tiny in comparison to the greater majority of characters in this series.  Mostly, he fills up the main role as the main guy, but other than that, I wouldn't say too much else.  He mostly takes a backseat when it comes to things.  \\n\\n\r\nNext is the fire/dark aligned underground boss of the school, (I have literally no idea what all of that entails, Roka Shibasaki.  Roka is definitely the main focal point of the show.  From start to finish, she plays a pivotal role in the plot, and is seen to be around Kazama for the majority of the series.  Personally, I have never really seen a character quite like her, due to the fact that she has this fire aligned moe thing, and this scary dark aligned personality that I would like to avoid if all possible.  She likes bagging people, (putting bags over people's heads), and all sorts of weird things.  I can't really explain her because she's just that kind of character that you can't really explain due to how interestingly weird she is.  \\n\\n\r\nChitose Karasuyama is the earth aligned character in the series, as well as the school president.  Personally, I don't get how she's the school president due to tyrannical and sadistic she is.  Chitose is one of those characters that will do whatever it takes to complete a goal, while at the expense of someone else's pain and misery.  What I think makes her a good character and a good fit for this show, is the fact that she has this authority, and thus the means to make the absurd things in this series make sense in terms of how they came to be.  \\n\\n\r\nNext, my personal favorite, Sakura Mizukami, or, the water type.  (I'm not kidding.  These characters all have some sort of element alignment like freaking pokemon.)  Sakura is the youngest character out of the whole main cast, being only a first year, with an exceptional addiction, to water.  She is always seen carrying a bottle, and even drowns her opponents with bottled water.  She has this sort of child-like demeanor, being very respectful to her her elders, and even calling Kazama her Onii-san.  (She just does it cause she can.)  \\n\\n\r\nAnd finally, Takao.  (There's no last name for this one.)  Takao being the only character not in the game creation club (provisional), is a rather interesting addition to the main cast.  For starters, she is the only character that has her measurements posted on this site, so that sort of gives you an idea of what we're dealing with here.  Takao is sort of that bystander person that sort of just stands there and watches everything happen.  She doesn't really add too much to the series as it goes on, but she still plays a good part nonetheless.  \\n\\n\r\nThe side characters of this series outnumber the main cast 1:10.  What adds to this series's absurdity, is the fact that the series will add a few characters every few episodes or so, followed by a nametag on one of the screen corners, giving you a sort of idea of who this new person is.  While most of the supporting cast get about 10 minutes of screen time each, the supporting cast that actually matter, such as the double masochist duo of Ataru and Hachi, the electric aligned game creation club's supervisor, the legendary pigtailed 3rd year Tama-chan, Kazama's sister Noe, and my personal favorite Funabori.  \\n\\n\r\nPersonally, I think that the supporting cast is too big.  (Even Angel Beats had a smaller cast than this series.)  The fact that they add in characters left and right is a bit too absurd even for me, and their use and imprint on the series is as valuable as a dot you draw on your friend's paper in the upper right hand corner of their paper.  Also, they didn't explore some of the more important and better known side characters as much as they could've, which I think really would've added more, since the supporting cast is just as interesting and weird as the main cast.  \\n\\n\r\nAll in all, the cast itself was very well done for the idea they were going for, and I commend the people who made it, to make a series with a mostly female cast, not a bunch of girls who needed a guy to help them with everything.  Cause these girls kick ass.  \\n\\n\r\nOverview\\n\r\n+  Very well thought out female cast\\n\r\n+  Somewhat original and thought out character personalities\\n\r\n+  Above average male lead\\n\r\n-   WAY too big of a supporting cast\\n\r\n-   Adding characters left and right that didn't even matter in the end\\n\\n\r\nArt and Sound (8.31/10 and 8.95/10):  The art is definitely a good highlight of this show, mainly because the art is so bright and vivid, that it looks like it was colored in a highlighter.  The show has two main ways of presenting the characters.  One in a normal format of presenting the characters, and the ever so common chibi format that we see today.\\n\\n\r\nFor the normal artwork, the series has a very detailed look to it, as well as a very nice and light color palette, that works very well to represent how light-hearted and fun this show is.  \\n\\n\r\nThe chibi artwork on the other hand has this more comical sense to it.  The actual color palette is still the same, but the way the characters are drawn is different, representing the characters in a smaller, shorter, and more cute form.  (Mainly, they use this way of making the characters look chibi on Roka.)  At times, the series intertwines these two art styles, that as mentioned before, works very well for what the series is trying to do.  \\n\\n\r\nThe sound I feel is one of the more addicting things of this series.  While the background music for the actual series is mostly average tracks that are mood fillers, the soundtrack for the series really shines in its OST, and ED.  First, the OST.  I cannot explain it.  The OST has some of the most random lyrics, and an ever-changing tune that I can only explain as a song that is worthy of being this anime's OST track.  The thing is, it's so random, that it's so enjoyable.  Hands down, this OST is one of my favorite opening tracks for an anime period, because it's just so fun to watch and listen to.\\n\\n\r\nThe ED on the other hand is a very happy song that involves singing about a penalty game.  It's a nice little finisher to the anime, as it still contains that vibrant energy that this series is overfilling with.  \\n\\n\r\nOverview\\n\r\n+  Aesthetically pleasing look\\n\r\n+  Good integration of both styles of art work\\n\r\n+  Addicting soundtrack\\n\r\n-   There are none.  =w=\\n\\n\r\nPersonal Enjoyment (9.56/10):  When I first discovered D-fragments, I only chose to start with the manga because the manga was already present and ongoing.  I had held off on the anime series because I wanted to get far in reading the series, just so I don't spoil anything for myself.  That plan didn't work, cause I finished the anime before finishing the manga.\\n\\n\r\nWhat I love about D-fragments is the sheer randomness that works just so well for this series.  The series itself goes over the top and does not care if you go along for the ride or not.  It goes, and continues, making you hope that you can keep up.  As I was watching this series, the most memorable parts about it for me was how much I enjoyed the slapstick comedy that worked extremely well for this series.  For a series that wanted to be random, it succeeded.  D-fragments is one of those series that anyone can enjoy without thinking too hard.  \\n\\n\r\nPersonally, I love this series because of how entertaining and enjoyable it was.  It provided me some great laughs and no facepalmy plot points that I hate with all my heart.  In the end, I would recommend this show to anyone who would like a good laugh, or even to just not think, because in the end, thinking while watching this, will get you nowhere.  It's not the best thing to watch in the world, but for a comedy/school series, it's definitely top notch.\\n\\n\r\nOverall Score: (9.15/10)  Remember.  I'm a blue fire type!",
            "date": "2014-03-24T17:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 136825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136825"
        },
        {
            "content": "i really enjoyed D-Frag! i thought at first it was weird but as the situations progressed to be more and more ridiculous i found my self hooked on to this anime \r\n=============================================\r\nthe story is about kazama kenji a boy in high school who likes to think of himself as a \"delinquent\" he decides to visit a game club to see if he can \"borrow\" some manga and games but little did he know he just walked into the \"Game Development Club(temp)\" a club full of weird girls who think they have different elemental affinities they coerce him into joining their club where many strange happeningsgo on.\\n\\n\r\noverall this anime is hysterical with funny gags and good art this is personally one of my favourite animes and i believe most people would enjoy watching it.",
            "date": "2014-12-08T05:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 171415,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4169061.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cenzora",
                "username": "Cenzora"
            },
            "url": "https://myanimelist.net/reviews.php?id=171415"
        },
        {
            "content": "Okay, it's finished. I can't stand that D-Frag! is finished but the fact is yes, it's finished. After making me laughed so hard that my mom come to my room to say \"Hey, son. Do you go insane now?\" once a week, now is the time it's finished. So before starting the review, let me tell you how I feel before deciding to watch D-Frag! as my winter's anime.\r\nI always look at the genre of an anime before watching it, I started to watch D-Frag! cause some of the genres are School and Comedy. Yeah, I'm a lonely guy without girlfriend or else so atleast I have to taste some comedy so that I'm not feel lonely anymore yay (?). Well, while looking for some info for D-Frag! on this site, I found out that the cover of D-Frag! is 5 girls and a guy that I think it would become a harem. But then, I was wrong, cause D-Frag! has a F-ing fabulous comedy so that harem stuffs were pulled out from my mind.\\n\\n\r\nOkay, let's head straight to the review.\\n\\n\r\nStory 8\\n\r\nD-Frag!, a story(story?) that involves a leader of a famous delinquent gang named \"The Kazama Gang\", but somehow nobody even knows him. Though he is a delinquent douche, he still helping someone to extinguish fire. And at the end, he forced to join a weird club named \"Game Production Club\" and he found the four not-so-normal girls.\\n\r\nFrom the manga (chap special 14,5) at the end of the chapter, Tomoya-sensei wrote \"This extra doesn't relmaate to the main story (Is there something called 'story' in this manga?)\" and yet i agree with him.\\n\r\nFor the plot itself, I think it's not a strange plot for me, it's just mainstream. I mean, A punk forced to join a club? But yet i realized, my inner self was just like \"Hey dude, this is a comedy you know, why you should be concerned about the plot, huh?\". Yes, later on episodes 6++ I watched some arcs and I didn't expect that a comedy like this has it's own arcs. It's so amazing.\\n\\n\r\nArt 8\\n\r\nNowadays, the're many animes with great art, and D-Frag! isn't one of it. To be honest, the art of D-Frag! is just an average for me. But, for a comedy anime, it just really suit with the gag. In D-Frag!, there're so many characters that given their chibi style. I love it, very very love it. Especially when the chibi character is doing his/her gag while the others stay at the original body style. The sense of humour just spreaded out more.\\n\\n\r\nSound 9\\n\r\nThe seiyuus do their role so good. For example Roka (HanaKana), she's good at voicing all types of expression such as cute, straight, and that \"yandere\" style. For Kenji (Konishi Katsuyuki), he's so good voicing his punchlines. For Sakura (Takahashi Mikako) her voice is suitable for her expression, the smiling-all-time-water-element-Sakura lel. And for the first time of my life, I just heard the tsundere version of Itou Shizuka wow (because Akeno, Wilhelmina, and Hildegard all have an adult voice :v), and she's really cute at it. And at the end, Ataru (Fukuyama Jun) the M type, he's so funny acting as an M while voicing like that. It's like I imagining that Dark Flame Master is tortured by Rikka :)).\\n\r\nFor the OST, the OP is good, energetic, and makes you feel to watch the episode ASAP (not because the OP is boring but it's because it gives you full energy so you'll ready to laugh all the time), and the ED that performed by Itou Shizuka, Toyosaki Aki, and HanaKana is great too.\\n\\n\r\nCharacter 9\\n\r\nAll of the characters has their unique personality theirselves. A tsundere, a masochist, an \"open hearted\" delinquent, even elemental lords! (water, earth, lightning, and \"darkness\" fire). It just....wow...And that evil head of student council character, it just rare to see the \"real\" leader of the school is the head of the student council. Recently, there're so many characters that joined to the story and they have their own unique personality that different with anyone.\\n\\n\r\nEnjoyment 10\\n\r\nIt's the second anime that can make me laugh soooo hard in every episodes (the first one is SKET Dance). So, there's no lack for the enjoyment. Perfect score for it.\\n\\n\r\nOverall 9\\n\r\nWell what can I say? It's so good for the enjoyment, even the other aspects were not too perfect. But it's still good, right? eh, no, it's better than good is it?\\n\\n\r\nIf you feel you want to watch series and looking for a grooveless anime so that you are not forcing your brain to think \"How will it end?\" \"What will happen to him/her after that?\" or else and you want to laugh because your life's suck, I recommend D-Frag! for you.",
            "date": "2014-04-05T12:00:00+00:00",
            "helpful_count": 10,
            "mal_id": 138799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3015589.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hublaa",
                "username": "hublaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=138799"
        },
        {
            "content": "Love to fight, love to fight, I love to fight..........\r\nDoes anybody think that there are certain anime that would be better off as mangas, well, this is one of them, what it is basically something whose plot were pretty random and it only rides on one particular character, in fact this anime is depended on that particular character as he goes around being a typical victim of his club's antics, so no more fucking around and I'm gonna be presenting my ratings for each of this anime's category:\r\nPoor 3:\r\nStory:.........Simply, there isn't any and it would be better to forget what this anime's genre is.\r\nSound: Though,I like the opening theme, the voices of the character's were seemly too mature for their roles, like Kazama, his seiyu  Konishi, Katsuyuki no longer has that youthful intonation, Chitose's seiyu Saito Chiwa, should have used the same tone that she did in Bakemonogatari that is if she would have did the voice of Tama, Roka's voice should have been done by Takahashi, Mikako instead of  Hanazawa, Kana, in fact Hanazawa, Kana's voice over would have been a better fit on Chitose. About, Sakura, her voice over should have been done by Toyosaki, Aki since she does have cutie girl tone that she once did with Soga Keena from  Ichiban Ushiro no Daimaou, only the voice of Minami was a match for her. The rest, well, there probably need for me to concern about it since they're more like support character and it doesn't matter who did who.\\n\\n\\n\r\nFair 6.\\n\\n\r\nArt: Nothing much for me to say about it, except that the way  those male support characters were illustrated makes them too matured to be in high school, as if they have been there for quite a long time.\\n\\n\\n\r\nCharacter: \\n\\n\r\nKazama Kenji- well, I did mentioned that this anime rides on one particular character and it so happens that it is him, at one point I may have find it funny to see him going through all the antics that his club get into, but in another point I get annoyed by his tantrums and his rants when it would have been much easier if he just quit the club. Also, his tough guy looks makes him look like a dog whose bark was worse than his bite, despite of the fact that he can handle his own when dealing with delinquents, which it doesn't always end in success and he has to be saved by his club members, you might say that the rating for this category was for him.\\n\\n\r\n Roka Shibasaki - I may have find her cute for being a small but terrible character, but overall I see her as nuts who should be seeing a shrink.\\n\\n\r\nChitose  Karasuyama- she is basically the only character that I like to hate.\\n\\n\r\nSakura Mizukami- I may also like her, but then again her character was simply an over hyped one.\\n\\n\r\nMinami  Oosawa - For me, she was the kind of character that one would describes her as a question than a statement, where one would ask \"Who the fuck is she?!\"\\n\\n\r\nTakao- the only character that I like, she is another reason why I give this category a 6.\\n\\n\r\nAtaru and Shio- it it weren't for them as well, I would have given this part a 4, since they're the ones who serves as the comedy part of this anime. \\n\\n\\n\r\nGood 7.\\n\\n\r\nEnjoyment: thought it lacks a plot, it was still enjoyable enough to be watch when it was Kazama who is in such predicament.\\n\\n\r\nOverall: Good as it is, funny as it is, so does this anime deserve another season????????I won't recommend it, like I've said this anime should bet better off as a manga than an anime.\\n\\n",
            "date": "2014-03-31T03:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 138029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=138029"
        },
        {
            "content": "D-Frag tells the story of Kazama Kenji, a juvenile delinquent trying to make a name for himself at his school. He is confronted by Roka Shibasaki, president of the Game Development Club, but refuses her offer. As the club was one member short of disbandment, Roka, and other members of the club chased down Kazama, who eventually joins. The story sets itself here, where Kazama plays games that the GDC has created, and partakes in banter between the club. The show expands out, with inclusions from people like the Game Development Club (Provisional), and some of Kazama's friends, old and new.\r\nOne of my personal favouritethings about D-Frag is the main character, Kazama. He isn't anything special, certainly, but he's definitely a cut above the standard brown/black-haired, brown-eyed anime protagonist who just meekly goes along with whatever the rest of the characters do. He isn't afraid to speak his mind, and he will act however he sees fit, and I think that his voice actor did a very good job of capturing his character.\\n\\n\r\nThe happenings of D-Frag are very enjoyable. The premises, character interactions are all very well-done, with lots of comedy put in. There was no 'bad episode', nor any episode that felt too much like a previous one. Additionally, the different characters and how they all acted mixed very well together. The art and soundtrack are great, and everything feels very upbeat and lively, which makes for an enjoyable theme and makes for a nice change of pace from most anime of this nature where everything just sort of happens, and there isn't much kick to anything. The cost-cutting you usually see in anime wasn't prevalent, but it was still there to an extent.\\n\\n\r\nUltimately, D-Frag makes for a good show. It's not going to challenge your views on cinema or your view of life as a whole, but the 12 episodes are going to be a good ride, and you'll be glad you went on it.",
            "date": "2018-02-04T09:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 270644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6943364.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SCLFI",
                "username": "SCLFI"
            },
            "url": "https://myanimelist.net/reviews.php?id=270644"
        },
        {
            "content": "I choose this show because was potentially more common and easier to write a review. However, I found a show different from expectation.\r\nStory:\r\nSubstantially, a guy is forced to join in a club ready to be closed for insufficient elements. And you said: \"where i have hear this?\" Probably in almost every school club show. The list is really long. Other elements are girls who spend the time playing. Just the name of the club and the game they produce worth watching the whole series. Im not interested to spoiler the show, but the story follows the club's elements and a a few other throughschool life.\\n\\n\r\nWhat makes the show worth watching? The story starts pretty common, but i found in the direction something really awesome. Because, some lines are maybe better for a parody instead than a romcom. Im not joking, when i watched it i thought: im laughing like with noucome and korezom (2 parodies). And i dont remember a comedy so funny. However, everyone has a different sense of humour and i understand that is pretty personal.\\n\\n\r\nSecond, the characters. Im not saying that they are so unique, but the director use them in a great way. There isnt a char that eclipse all other, but everyone has his space to make the show funnier. \\n\\n\r\nAnimation: Decent\\n\\n\r\nSound: Nothing to write\\n\\n\r\nCharacters:\\n\\n\r\nIts hard write in this section. Because by one side, they are common. On the other, they works together in a wonderful way. And its nice when episode after episode, the bond within them grow.\\n\\n\r\nThe only i will write two words about is kenji kazama. I usually expect something from the male MC. He isnt empty, he isnt a weak person,he has some character. I cutted other show's rating when the male MC was pretty useless.\\n\\n\r\nOverall:\\n\\n\r\nI could reccomend this show if you like school comedy show. And even if you like this genre of show, you could not like the humour and (unfortunately) watch a mediocre show. The only thing i can say is: give it a try.",
            "date": "2017-12-25T20:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 266398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5627587.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/abhiss",
                "username": "abhiss"
            },
            "url": "https://myanimelist.net/reviews.php?id=266398"
        },
        {
            "content": "\"We're a group of geeks with ambition, despair, and angler fish... Just Kidding\" D-frag OP\r\nAfter watching 12 episodes, this by far is one a hell roller-coaster ride. \r\nEven though this show doesn't have any plots or arcs, this show is towards more on Comedy, just like Nichijou and Daily Lives of High school boys. The gags, reactions really made me lol, Fanservice? There is one massive oppai, one flat oppai and the rest are normal. Sadly this series has no beach scene. Well, doesn't matter anyway, this series is enjoyable. Otherwise, directing and script is well prepared.8/10\r\nThe art is not really interesting, but for astudio that i never heard before, the animations are fluid and smooth, no loopholes or weird animations, They did a good job. Character designs is also nice, the chibi version also. 8/10 \\n\\n\r\nThe OPs and the EDs are enjoyable, listened repeatedly for the OPs full version. The seiyuus that were chosen to voice acting the characters are decent and noticably Hanazawa Kana (Kuroneko from Oreimo) voice acting Roka, which i recognized earlier after the story of the series begin.  Kazama's seiyuu voice acting is also great, never listen to his other voice acting, but for this i really like it especially on the reaction parts. 8/10\\n\\n\r\nI like Kazama's reactions, it's totally funny and i wouldn't say it's priceless. He seems to be oblivious to Takao's feelings. Takao on other hand, can be a tsundere sometimes and i love her reaction when she cries, (so cute). Overall, the characters in this series can be sometimes weird and sometimes fun. 8/10\\n\\n\r\nI really enjoyed watching this series, this made me laughed so hard that i almost woke everyone up (in my family) because it's a comedy series. But overall, it's a good show to watch, release my stress after doing school works. Hopefully this show can get a season 2 because....\\n\\n\r\nTHE HUMOR IS DAMN STRONG, I WANT TO LAUGH MORE.\\n\\n\r\nOverall: 8/10",
            "date": "2015-08-07T09:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 195423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=195423"
        }
    ],
    [
        {
            "content": "Loud, funny, predictable at times, but still adorable and satisfying. Despite the close relationship that anime fans have to gaming, it's rare to see an anime dedicated purely to the subject. However, D-Frag is a show where games and the world of gaming is the basis for a funny and refreshing spin on the school club anime scene.\r\nThe story starts with Kenji, a so-called delinquent, who has recently moved to the city with his friends. They aren’t really bad people; they merely want the mystique that is attached to those sorts of people. Kenji and companys' appearance breathes hope into their club, but however, theirrecruitment drive is…less than orthodox. It borders on the manic and farcical. The first several minutes give you no preparation for this, and at first, the audience left in stunned silence, but the tension slowly dissipates and you realize that the club is a rag-tag team of eccentrics, obsessives and power-mad horrors. However, there’s a twist in the tale, entailing the prior existence of a Game Dev Club, led by a busty girl named Takao. This extra addition gives a sense of competition and dynamism to the story. It could’ve been completed in the first episode, but the element of peril would’ve been extinguished. Fortunately it lingers on and adds an extra dimension to proceedings.\\n\\n\r\nYes, some of the characters can be included into a cookie-cutter-like feeling, incorporating  archetypes such as the dominatrix, the peppy go-getter, the lazy placater, yet each of them possess an extra dimension which saves them from being purely plot vehicles\\n\\n\r\nAs for the rest of it, it sort of falls down. The art work can be good at times and when the comedy is heightened to insane levels, it comes into its stride and it works. Unfortunately, during the bits in between it feels a little flat and dull – like watching a rushed product, or a part where the animators were anxious to get to the more comedic, and interesting parts. It lacks consistency and originality in its artwork, but nevertheless, a good watch. \\n\\n\r\nI certainly like this show and find it to be very funny. Gaming is something that most anime fans can understand and relate to, so I’m surprised it has not been explored more often. It's a refreshing addition to the school club genre and I certainly recommend this show for people seeking a wacky comedy with a lot of slapstick and shouting. \\n",
            "date": "2014-07-06T11:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 150699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/omgdidyouhear",
                "username": "omgdidyouhear"
            },
            "url": "https://myanimelist.net/reviews.php?id=150699"
        },
        {
            "content": "Overall, I have to give this anime a seven, although at times i wanted to give it a 6 and other times a 8.\r\nComedy wise, this is is pure gold!!!! I laughed quite a few times during every episode!!! Kenji really keeps it real and I love how he shouts at almost everything XD Without kenji, this anime would suck ass. imagine putting like densuke from eiken or any weakling anime main character and it would be a total embarrassment. The supporting characters are hit or miss, and I really blame this for only being 12 episodes! It felt a little compressed, and thus somecharacters got forgotten or didn't really have their stories/personalities explored that well.  The jokes are pretty original, even when it comes to the ecchi stuff with takao's oppai;however, I kinda hated takao after awhile, she's just an excuse to put big boobs in anime. she would be a horrible character if she didn't have boobs, that's how sadly the writers made her lol. they basically made her a running boob joke. that can tick people off, and even though im a boob lover, they went a little too much with that joke. Thankfully, Roka is there to save the day :P such a cutie pie! Such a stranger character, but rightfully done! I don't feel like discussing every character, becuz they're hit or miss, but almost all deliver laughs, and that was the goal.\\n\\n\r\nPlot: well there's minimal plot because that's the point lol! that what makes it funny, so don't go expecting a deep work of art.\\n\\n\r\nSound: there's not much to say about this, just avg.\\n\\n\r\nArt: again, pretty typical anime\\n\\n\r\nI finished this anime in one day, man it gave me a great happiness and i wish they went for like 22-24 episodes total. Plus, it won't have a long-term effect on ya, you'll forget about this anime as it has really no plot and is just there to make you laugh. still happy that i watched it though. \\n\\n\r\nP.S. SANKAKU SANKAKU",
            "date": "2014-12-18T22:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 172981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4330517.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DaJetBoy",
                "username": "DaJetBoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=172981"
        },
        {
            "content": "Recently I've been trying to shave off some anime from the PTW list that look like garbage or just anime that I know I won't like. Looking at D-Frag's image alone and the for some reason the name just put a bad taste in my mouth. Surprisingly when I checked that this had a decent score of 7.70 I decided to give it a chance and it's good that I did. \r\nStory: 7\r\nD-Frag's story is very simple and that's surprisingly a good thing. Normally I get irritated at some harem anime for taking themselves way too seriously or some other animes that don't have anystory and are episodic. All you need to know about D-Frag's story is that a high school delinquent (although its kind of hard to tell most of the time) joins an after school game creation club. After that the next episodes are meant for introducing more characters and just having the main characters goof off and do stupid things. It has a sort of slice of life feeling to it, and in a good way. D-Frag doesn't really need a story. It has two \"arcs\" if you even want to call them that since they're only 2 episodes long each and don't do a whole lot with the story. The only sort of progression you'll be getting is that of character development which isn't great, but not bad. I would've loved to see more of it, especially from Takao. The only downside I have would be that it just sorts of ends. I know this is only the first (and sadly only) season, but its finale is kind of weak.\\n\r\nArt: 8\\n\r\nD-Frag doesn't look amazing, but it is appealing to the eyes. I like the character designs and the colors really pop. It's a good looking anime overall, but the creative ways in which they use the animation is where it's strong point is. It may just be me, but t's just really funny seeing a chibi form of a character doing the same action in only a couple frames or just seeing them in chibi form in general. The animation really helps some of the jokes work and that's very important for a series like D-Frag\\n\r\nSound: 7\\n\r\nI would say D-Frag's soundtrack is easily it's weakest point. It's definitely not bad, it's just that some of it's songs feel really generic and could easily fit in with any other high school anime. Some of it's other tracks, most notably the calmer/sadder ones like That does not change, and Warmth, are actually quite good. The soundtrack is kind of a mixed bag, the OP is kind of generic but the ED is fairly good. As for sound design, it does a good job at helping out some of the jokes work. Another very important detail is the voice acting. I am not a fan of subs in general and didn't like the voices that much when I watched the OVA since there isn't a dub of it. However I did really enjoy Funimation's English dub. I normally enjoy dubs since thats how I watch anime, but this is easily an above average dub so I highly recommend watching it or at least giving it a chance.\\n\r\nCharacters: 8\\n\r\nD-Frag's characters are what makes the show so enjoyable. All the main characters are unique and have their own personalities. I don't think there's a single unlikable character in the series. Kenji is an enjoyable main character but is a bit on the average side. He isn't the star of the show, and is MILES better than your typical main male harem lead. Roka and Takao are great and are the show's strongest characters (although Takao is best girl). Normally I'd hate someone like Chitose but she turns out to be a likable character, but still my least favorite among the mains. Sakura is a weird case. She seems great, but gets very little screen time compared to the others which makes it hard to love her as much. All the other side characters are good especially Tama, even if she's only in the last 2 episodes. Another point I'd like to talk about is how D-Frag seems like your typical high school anime and the way they introduce some of it's characters. Takao is seen at the beginning of episode 2 and seems like an annoying character, yet she turns out be the best. Same goes for the Band of 14 Devils. At first glance they seem like your average tough group of bullies, but turn out to be funny and enjoyable. \\n\r\nEnjoyment: 8\\n\r\nD-Frag is hilarious at times, and all around very funny. I wouldn't say it's there with the likes of Chuunibyou or Baka to Test but there are moments that come close. It's comedy is it's strong point and always seems to be fresh and unique. I could easily watch half of the series if (but most likely when) I rewatch the series. It's just really enjoyable and entertaining. \\n\r\nOverall: 8\\n\r\nD-Frag is definitely an underrated anime that I haven't heard many people talk about. I don't want to say it's a hidden gem since it's only 12 episodes but maybe if it were twice as long and was just as good then maybe. D-Frag is a well above average anime that will keep you interested in its comedy and enjoyable cast of characters. Just a heads up 1. Don't expect an ending 2. Try out the dub first and 3. enjoy it while it lasts\\n\r\nHopefully in the future we'll get a second season but it's been 4 years now so I highly doubt that'll happen. Unfortunately the anime industry considers the likes of Fairy Tail and Black Clover better and more important.",
            "date": "2018-10-07T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 291201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4883000.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Astraea_",
                "username": "Astraea_"
            },
            "url": "https://myanimelist.net/reviews.php?id=291201"
        },
        {
            "content": "D-Frag is a thoroughly enjoyable comedy anime relying on randomness and the subversion of typical anime tropes to deliver some serious laughs. These contrasting elements work really, really, really  with each other; although there often isn't much in the way of plot within a single episode, let alone across episodes, I don't find myself missing it. \r\nNormally I'd give a series like this a 9/10, but D-Frag falls a short on animation (it gets pretty lazy at times), and a couple characters (Sakura comes to mind) are introduced, scarcely used again, and kinda just seem like they're being obligatorily propped up for the restof the series.\\n\\n\r\nStill, it's absolutely worth the watch if you're interested in a comedy anime that doesn't take itself seriously at all. My sole regret in watching it is that there's only 12 episodes and no second season :(",
            "date": "2017-10-03T16:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 259616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6036100.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/elledriverxc",
                "username": "elledriverxc"
            },
            "url": "https://myanimelist.net/reviews.php?id=259616"
        },
        {
            "content": "This anime conveys jokes that we may never thought before. The punch lines that the main character spouts makes this anime kinda \"distinguished\". The characters are overall fine in terms of graphic and sound (Kenji's and Roka's voices kinda ring in my ears right now!) . Character development is kind of lacking, though, as not everyone's character is intricately shown. This anime also promotes friendship as life is gonna be fun when everybody is around you. Definitely gonna wait for the second season!!",
            "date": "2014-04-17T22:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 140365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3710535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YellOwWira",
                "username": "YellOwWira"
            },
            "url": "https://myanimelist.net/reviews.php?id=140365"
        },
        {
            "content": "D-Frag, the most unexpected anime of the season. Turns out it was a masterpiece.\r\nThis has a very simple story, a comedy about a wannabe delinquent who joins a club of the craziest women ever. But, the comedy is just golden. Truth be told, I started watching it because I felt that Seitokai S2 was pretty lackluster, and this anime didn't let me down, not one week. Although it's weakest episodes are probably the first two, which may not be the best to promote the series.\r\nEach and every one of the character probably made you laugh AT LEAST once, they were all fantastic and so random,yeah, that's the word I'm looking for: Random.\\n\\n\r\nI mean, we have a teacher called Shaun Konekone with a crystal skull. We have a son and a father that appear for no reason at all and they are great too, we have the cutest character Funnabori, the best tsundere Takao, the mysteriously hilarious and cute Roka (voiced by HanaKana), the student council president  who looks like Hitagi and is voiced by the same person who voiced her in Monogatari. We have a masochist voiced by FukuJun (Lelouch and Yuuta).\\n\\n\r\nI SEROIUSLY recommend this to anyone, a masterpiece hands down. The reason why it's so good is probably because it has progress, both with the characters and the story. Something Seitokai lacks, unfortunately. Off course, if you don't find the \"random wtf\" jokes funny, this isn't for you. But you'll most likely still enjoy it, you may not laugh as much, but it's still an enjoyable ride",
            "date": "2014-03-25T10:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 136931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3375925.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/daysun22",
                "username": "daysun22"
            },
            "url": "https://myanimelist.net/reviews.php?id=136931"
        },
        {
            "content": "D-frag. An anime which most people would just over look, it has that stereotypical plot set up. Guy lives his life - guy does something and ends up being forced to join a club full of women - guy hates club but continues to stay in it and get up to shenanigans in everyday life. This premises would put most of the anime community off it, \"Just another boring harem anime nothing new\". Well im gonna tell you differently.\r\nStory - 10\r\nNow most people wouldnt think theirs much of a story in a slice of life-ish anime but youd be horrible mistaken. The story, although coherent,has a new story at the end of one or two episodes. But it all serves a purpose, its not just mindless filler but instead develops the characters and makes the interactions between them seen more real and emotional. Another thing this story does amazingly is comedy. This is one of the few anime ive ever laughed out loud - the others being gintama and angel beats!. The comedy takes ordinarily boring settings and turns them into intelligently crafted and thought provoking comedy, something other anime tend to fail at.\\n\\n\r\nArt - 8\\n\r\nThe art is well done and looks crisp, animation is good but it isnt the level of attack on titan, still very good and well done. The overall colour scheme is extremely bright and cheerful giving the feel of light-heartedness and fun making it enjoyable and easy on the eyes\\n\\n\r\nSound - 7\\n\r\nThe sound is over all very good - the background music can be emotional, fast paced or quirky and overall sets the feeling of the scene. The issue i have is the opening and ending songs. The are very well sung and really well animated but its not really something you can listen to on its own and enjoy - its on the style off Bokura wa Minna Kawaisou ending; quirky and sung by the voice actors. still the sound is very well done.\\n\\n\r\nCharacters - 9\\n\r\nCharacters are one od D-frags biggest stand points. Theirs really not much to say other than the characters well built, unique and interesting - hilarious as well.\\n\\n\r\nEnjoyment - 10\\n\\n\r\nThis anime is amazing if you couldnt already tell, its really disappointing it was over looked and deserves a higher score. I actually finished this anime in a night and it left me feeling empty. Really should have been a 24 episode series and im hoping for a new season",
            "date": "2015-01-04T14:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 176207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2771563.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kadan",
                "username": "Kadan"
            },
            "url": "https://myanimelist.net/reviews.php?id=176207"
        },
        {
            "content": "When you have the carefree life of a so-called deliquent you may never know what you end up doing or what you get caught in. Such is the story of our protagonist Kazama Kenji.\r\nWhat starts of as a wish to become the \"rulers\" of the school by making their way to the top eliminating opposition turns out into a very amusing game where someone would make a mess out of the situation and he is forced to clean it up.\r\nArtwork is focused mostly on lighting and colors since we are talking about a comedy series. Character designs are made to point out flaws or aspectsthat normally are unseen just to amplify the amusement of a situation and provide more ideas for jokes.\\n\\n\r\nCharacters have their own personalities and act according to them throughout the series without any notable changes. A pleasant aspect is that they are made so that the protagonist complements them by cracking every joke they make by revealing the points where it would make no sense or it would be wrong.\\n\\n\r\nThis is a series I really enjoyed because of the hilarious situations and the narrative line which is short yet it evolves slowly creative a somewhat different environment with every episode.\\n\r\nThe reason I gave it a 10 is solely because of the fact that I was never bored during any of the episodes, since it is one of my favorite types of comedy.\\n\\n\r\nThank you for the time taken to read this review.",
            "date": "2014-03-31T05:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 138045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=138045"
        },
        {
            "content": "This has been among the best comedy anime i have ever watched. It is very fast paced and the story would switch no something nonsensical midway, or even before that. Sometimes the beginning of the episode has nothing to do with the ending at all, though coherence is maintained well. \r\nThe best thing about this show is it is so so so ridiculously funny. It is pure nonsense.\r\nThe worst thing is it ended.\r\nI had friends who do not enjoy this show though and I was intrigue why. Seems that they are pretty much logistical minded and appreciate comedy that doesn't need imagination. So meticulously technicalpeople may not see the point why this silly show is so funny.",
            "date": "2017-06-29T01:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 251392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5759358.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tramontina",
                "username": "tramontina"
            },
            "url": "https://myanimelist.net/reviews.php?id=251392"
        },
        {
            "content": "So I started watching D-Frag! simply looking at my recommendations because the premise seemed interesting.  I was looking for something a bit slice of life and absurd, and having been disappointed by some other recent shows in the genre, wasn't really expecting all that much.\r\nI was pleasantly surprised by how much I enjoyed D-Frag!  This was a series that I found myself sitting down to watch an episode and I would end up watching 3 or 4 at a time because I was just enjoying myself too much.\r\nWhat ends up making the show is the visuals and the characters.  The sheer absurdityof the scenes and the protagonist's consistently over the top response to the lunacy going on around him just has a way of working.  The show does a good job of mixing art styles together in ways that make for hilarious tone shifts and reactions that a consistent presentation style wouldn't allow for.  \\n\\n\r\nWhat you end up with is a show that's generally very high energy and a little crazy, but never completely out of control in ways that are confusing.  Each show becomes a fun ride with a few good laughs and amusement along the way. \\n\\n\r\nI think that this show is a pretty solid example of a slice of life comedy with a twist done well.  There are quite a bit of your modern tropes thrown in, sometimes hilariously lampooned, such as video game tropes, a bit of the high school slice of life cliche shows up as well.  It never takes itself all that seriously, tongue is fully in cheek here.\\n\\n\r\nThere is some light fan service and a little bit of light romance undertones, although it never quite spills into harem which is a trap that too many of these shows find themselves in for no good reason.  None of these romance/fan service elements feels over the top, and much of it exists as part of the comedy so it actually serves a purpose in the plot.  There's room for argument here, but I'd say that this is a good example of how to do these elements in a way that doesn't pander too much.\\n\\n\r\nThis show isn't going to appeal to everyone, but if you enjoy a bit of surreal comedy in a slice of life setting, and especially if you enjoy gaming, you would probably find some enjoyment here.",
            "date": "2017-05-29T19:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 248839,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6129560.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Malthorian",
                "username": "Malthorian"
            },
            "url": "https://myanimelist.net/reviews.php?id=248839"
        },
        {
            "content": "My overall score is more based off my personal thoughts, but I choose to be objective with this one or else I may come off as hateful towards it.\r\nD-Frag follows the club room anime tropes you're used to; first and foremost of which is being a harem, as I've yet to see more than one of these have a cast of all females. Second is that the male is abused for absurd reasons. Third is that he retorts everyone around him.\r\nAlright, that's the groundwork out of the way and now onto the humor itself. The characters are alright at most, but of course you pitythe male lead by the end of it. The most normal girl in the anime is Takao, who is actually a sincere and honest female (despite how she is introduced) who respects Kenji and listens to his thoughts. But aside from her, all the other girls' shtick is that they provoke Kenji in ways where you will really get angry at them by the end of it rather than admire them, with the exception of Roka who falls somewhere between hate and love. She never calls Kenji any nicknames or picks fights with him, but can also be just as disrespectful to him at times. I consider her my favorite among the mean girls for this reason since she provokes Kenji in a respectable fashion without going overboard (most of the time) and I could find myself laughing at her humor because of it.\\n\\n\r\nAnd speaking of manipulative, this brings us to it being the kind of humor where it's torture porn, something I've mentioned many times before as a trope that more anime (usually harems) tend to follow. It used to be funny to the majority, but recently, lots of people have been against it since it's not only starting to grow old, but you consider it sad that the innocent character is mistreated so poorly. With D-Frag, you're expecting more of the same, albeit with more original writing in the humor itself which can make it feel more fresh from your typical harem.\\n\\n\r\nThere are characters introduced at the start that give off the impression D-Frag is going to be a completely different anime, but it really does jump the shark by transforming itself into a harem almost immediately and discarding the rest of Kenji's male friends, who usually begin appearing when the scene calls for them. One of them bares a striking resemblance to Harima from School Rumble, albeit more sleek. And the other is a short, pudgy midget. Very sad these guys were scrapped as main characters since they could have brought some more life into the anime.\\n\\n\r\nI suppose I should say more good things about it. I did enjoy some of the soundtrack, Takao brought some fresh life into the harem scene and Tama is unarguably my favorite female character among the whole cast and it only saddens me at how little she appears in the whole anime, coming in near the end of it. Her insane personality was a breath of fresh air and seeing her kick Chitose's ass was so gratifying. And her backstory was strangely hilarious. She made me laugh more than the entire anime did and I even had one instance where I had to catch my breath from how funny she was. I'd say she alone makes up the entire half of my overall score, though Takao could contribute a bit to that as well.\\n\\n\r\nWe need more characters like Tama in harems. Her vibes, personality and treatment of the male lead never felt too off to me and her design is such an eyecatch. She is the very first character I saw from D-Frag as well before seeing anyone else and I remember asking what anime she was from at one point, but it was surprising to see her here. I had assumed she hailed from another anime and didn't think she would be allocated to a minor character that serves to fill in the final arc, so I was admittedly a strange mix of happy and sad when I saw her in D-Frag. Perhaps, moreso happy due to her lifting my drooped spirits.\\n\\n\r\nMy writing here was stale since I wrote the review late and have since forgotten most of what the anime is, but my suggestion is to only watch D-Frag if you're used to the \"innocent character gets mistreated\" trope in anime. Or, if you just watch harems a lot in general, since you're used to that by default then. I won't say it's a bad anime since it's appealing to those crowds, but for my tastes, I disliked it a lot. Only watched it because it was brought to my attention a lot and the characters came off as likable at first glance.\\n\\n\r\nOnly pleasant surprise I got was finding out that Tama was from this anime and I genuinely believe I may have given it a lower score if she was not in it. She felt like a breakout character and only appeared in its final episodes. If D-Frag gets a second season and she's confirmed to be one of the main characters, I'd stomach through its humor again just to watch more of her.",
            "date": "2018-03-06T08:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 273187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=273187"
        },
        {
            "content": "When I was about to watch D-Frag! my first thoughts were of an interesting story about a delinquent. What I watched was one of the many \"game club\"/school comedy shows; However, that doesn't mean I did not enjoy it. \r\nArt/Animation- \r\nI found both the art and animation of this show to be beautiful. And adding to that, nearly all characters had something unique about their appearance, even if only by their hair style or color. This shows that even the slightest change of hair color to the main character can make a lot of difference. As for the OP and ED, I found the Openingto be a bit of a mess, as it showcased (I think) literally al of the l characters. and the Ending was pretty cool (animation-wise). \\n\\n\r\nSound- \\n\r\nUnfortunately, just like many other anime of this kind, there weren't many tracks I truly remember, and the music usually didn't stand out too much. The voice acting was pretty good, however. As per usual I won't judge the songs of both OP and ED, however just as I said about it's animation, I found the song for the opening to be a bit unrelated and too fast, but this may be just me. \\n\\n\r\nStory- \\n\r\nSo as I stated during the start of this review, the story, which starts off talking about a delinquent, but you almost immidietly realise the story is about a (kind of) game club. Contrary to most anime with this kind of club, the club isn't actually about video games at all, which is actually a twist I liked. You can almost say there is not much of a story as well- most episodes consist of comedy with barely any hints of an actual story, but it doesn't lead you to thinking the reasoning behind everything is important, which is very good for a comedy show. I also liked some of the small twists included in nearly every episode, even if they weren't really supposed to contribute to anything. \\n\\n\r\nCharacters- \\n\r\nI feel like because the lack of any real story, most characters were in the show just to add to the comedy. Even some of the characters listed as \"main\" didn't get much importance in it. So during the short moments of characters being serious, it felt a bit out of place. However, I did enjoy most of them and thought they were unique, perfect for a comedy show like this.\\n\\n\r\nOVA- \\n\r\nThe OVA gives more screentime to 2 characters which I liked and didn't have too much to do in the main show (one was even supposed to be a main character), so if you enjoyed the show I reccomend you watch it. \\n\\n\r\nFinal Thoughts/Personal Opinion-\\n\r\nFor those of you who like comedy anime, I reccomend you check this out. For those of you who are looking for an interesting story, there are much better shows to watch in my opinion. I enjoyed watching it but I still wish there was a bit more to the story.",
            "date": "2018-02-19T13:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 271956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6571593.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GONY100",
                "username": "GONY100"
            },
            "url": "https://myanimelist.net/reviews.php?id=271956"
        },
        {
            "content": "Welp, first review - I'll try to keep this short and straight to the point. Hopefully this will be somewhat effective. I'll try to keep this spoiler-free, so apologies if I sound rather vague.\r\nFast-paced and light-hearted, D-Frag! is a surprising comical piece that never failed to amuse. The main characters are lively, humorous, and full of fun retorts. Although it does not have a slice-of-life tag, it practically is one - after all, this anime follows the daily adventures of the members of the (Fake) Game Creation Club. And unlike other slice-of-life anime, most of the episodes are loosely stringed together (although I wouldn't goas far out to say that there is a coherent plotline).\\n\\n\r\nHowever, this anime is still far from perfect. The execution is certainly not perfect - being a fast-paced anime, the viewer is constantly being thrown from scene to scene, almost in a daze. Furthermore, many of the characters' actions are overly exaggerated. Although this is clearly done for a comedic effect, these actions are constantly overused - up to the point where it's predictable and does not substantially add any meaning to the character or the plot as a whole. Finally, the characters' relationships to each other are not clearly established or ignored for the most part (minus a few exceptions).\\n\\n\r\nAll I can say is that if you're looking to kill time, this is the anime for you.\\n\\n\r\nChecklist:\\n\r\nStory: 5\\n\r\nArt: 5\\n\r\nSound: 4\\n\r\nCharacter: 5\\n\r\nEnjoyment: 8\\n\r\nOverall: 5\\n\\n\r\ntl;dr\\n\r\nPros: \\n\r\n- Humorous characters\\n\r\n- Loosely tied together plotline\\n\r\nCons:\\n\r\n- Characters behave in an overly exaggerated manner up to the point where their behavior is predictable\\n\r\n- Mediocre execution due to its fast paced nature\\n\r\n- Relationships are not clearly established",
            "date": "2015-11-11T19:42:00+00:00",
            "helpful_count": 7,
            "mal_id": 203197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=203197"
        },
        {
            "content": "D-Frag is a show where everyone is practically insane except the Protagonist, so naturally he needs to react to all of them.\r\nWhen watching this show I'm reminded of Cromartie High School (What I consider the Citizen Kane of delinquent tropes). A lot of the tropes are similar only they are used in different ways. Nothing too new or innovative yet it still feels fresh.\r\nThe slice of life aspect of the show doesn't fall short of other SoL's. It's pretty everyday stuff (hanging out, having fun with friends) with the occasional overarching plot (all the times people try to shut them down, a few competitions).\r\nIn termsof characters D-Frag! Does something interesting. It shares the spotlight with a lot of side and minor characters and yet almost all of them either have some sort back story or some sort of depths yet all of them are insane in some way or the other. The main character is the only one sane so he pretty much shouts out punchlines and such at anything that won't make sense. My only beef in the character department is, I'd wish this show was one episode longer, so it could give me the back story of Sakura (Pink hair) who is by all accounts the most and only underdeveloped character.\\n\\n\r\nNothing stood out in the soundtrack department, for good and bad.\\n\\n\r\nTo sum it up; I enjoyed this show a lot and recommend it if you're a fan of delinquent tropes mixed with game (video and physical) tropes.",
            "date": "2014-08-13T06:01:00+00:00",
            "helpful_count": 7,
            "mal_id": 156409,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3569305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dcaspy7",
                "username": "dcaspy7"
            },
            "url": "https://myanimelist.net/reviews.php?id=156409"
        },
        {
            "content": "\"I'm a bad guy, this school is under my feet, I don't care the clubs, however for some reason I'm not known here...\"\r\nD-Frag tells us the story of Kazama Kenji a guy who thinks that is a bad guy, however inside him he's a good hearted guy, he had his normal \"delinquent\" life until he knows the Game Creator Club (Temp.), who changes his life forever.\r\nWith Roka, Chitose, Sakura, Takao and Minami (who doesn't do anything) Kazama has to live the rest of his school life with these crazy girls, giving us a fun anime.\r\nStory: 7/10\r\nAt first seen the story doesn't give us something new,we have already have stories like this, however the way that is told, is very funny.\\n\\n\r\nArt: 9/10\\n\r\nThe art is pretty good, the character design is cool and the animation is well done, I didn't notice parts with a downgrade of quality in the animation and the art in general.\\n\\n\r\nSound: 9/10\\n\r\nI loved both Opening and Ending, they have a lot of energy and tells you that this anime is to have fun and enjoy the stupid things done by the characters.\\n\\n\r\nCharacter: 9/10\\n\r\nThere are excelent characters like Kazama, Roka, Sakura, etc.\\n\r\nThere are some cliché characters, but that clicherity turns them in very funny characters, I'm sure that you're going to enjoy them.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI really had fun with this anime, I laughed a lot in some parts and loved the characters, both Opening and Ending were good enough to not skip them, however I think that it could be a little longer, I had to start to read the manga to continue with the missadventures of Kazama.\\n\\n\r\nOverall: 8.8 ----> 9\\n\\n\r\nIf you want an anime to waste your time having fun and random things, D-Frag is an excelent election for you!",
            "date": "2016-04-10T13:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 216052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5000619.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LinkcarioX",
                "username": "LinkcarioX"
            },
            "url": "https://myanimelist.net/reviews.php?id=216052"
        },
        {
            "content": "Review: D-Frag!\r\n\"7.76!? This anime is underrated! You have got to watch this anime! ASAP!\"\r\nStory (5/10): There is not a worthy framework to follow on, just the comedy. But if there a worthy plot planning of following of, it would be the the typical lives of these high schoolers, their clubs, and how they go on about it. When it comes to most comedy anime however, the plot tends to stray away and comedy is often the focal point when it comes to these kinds of series. Fortunately, the anime succeeds when it comes to it. As a result, it is ridiculously hilarious. Nevertheless, this animecould have been better off with a decent plot as their were noticeable signs of plot elements worthy when coming into the anime. The story starts off as the the 'Temporary' Game Club are in desperate attempts to find a fifth member in order for their club not to be shut down. The club president eventually finds the fifth member she was looking for. But however, she pleads for him to sign into the club despite rejecting many times signing into the club. But after many desperate attempts and through amusing tactics, she gets him to sign. With him signing into the club, one of the members of the 'Original' Game Club takes hold of the news and is furious. Simply because, they are the 'Original' Game Club and as the guy who signed it, joined into the 'Temporary' Game Club. The club president from the 'Original' Game Club tells the guy to drop off the club and get in hold of their club instead. In result, words spreads to the 'Temporary' Game Club and tension rises between the two clubs. As the cultural festival arrives, whoever makes the 'best game' will be recognized at the best game club at school. This could have been a great plot to follow for the anime in general, but however, the 'main' plot and the outcome, ended as short-lived as a result. As the series progressed however, it went to a continuous episodic plot to an episodic plot to a continuous episodic plot once again. Not only it was frustrating for these sequences to follow, it was widely inconsistent from each other. And, only to end without closure by the end of the series. What was learned however, even though each episode was in disarray and straying away from the 'main plot', all the episodes had a similarity from each other. Each episode shared the danger of the main characters losing their clubs which makes the anime worth watching for. The plot is not what should not be looked at but for the fun of it. But nevertheless without the plot, the comedy saves the anime from failing. \\n\\n\r\nArt (8/10): The art is fine as it is. Certainly, the opening theme to this anime was flashy and as a result cracked a smile every time in each and every episode. The same can be said to the ending of the anime as well. But, what is unique about the ending theme is that at  the end of each episode, the ending theme adds in a new 'female' character every time they are introduced. To mention that the characters designs are one of the highlights of the anime. Because, there were some scenarios where Roka, one of the main heroine of the series, turns herself into a 'chibi' version of herself which amusing to see. To also mention that the facial expressions that the characters make are so undeniably adorable in some scenarios, and hilarious in some. The character designs were creative and perfectly executed. Overall, Brain Base did a great art direction job nevertheless. \\n\\n\r\nSound (8/10): Let's start off that Konishi Katsuyuki's 'eccentric' voice is absolutely hilarious to hear voicing one of the main characters in the series which was Kazuma, Kenji. Every time an insult or a sarcastic comment is made by one of the characters to attack him, he counterattacks it by yelling a logical comment of his own. As a result, a well done performance by Konishi Katsuyuki. To mention that all the 'seiyuus' did a brilliant job voicing each of their individual character as well! No character felt out of place as each matched their characters personality. Lastly, most importantly and worthy of mentioning, that on top of the amusing animation, both the opening and ending tracks captured the anime's atmosphere as a whole. As a result, filled the anime's expectation as whole! The soundtracks were uplifting and joyful to hear simply because the lyrics hilariously did not make sense whatsoever. Maybe, it was trying a crack of wordplay? Oh well, it was entertaining to hear nevertheless. \\n\\n\r\nCharacter (9/10): The characters has their own little quirks that can be remembered by. To mention one character looked like Kenji straight out of School Rumble. What was interesting about this character lineup is that this is one of the most eccentric lineups yet. Not only it was eccentric, it was vast! Unfortunately with a cast so huge, it was hard to remember the names of each individual character. Fortunately, the characters and their charismatic personalities were there to distinguish their amongst their names. Importantly, the character lineup essentially brought this anime to life. Without this unique set of characters, this could have been a boring slice-of-life anime without a doubt. The characters brighten up the atmosphere of the anime and as a result, a success and a joy to watch. The characters succeeded in hooking the entirety of the anime as a whole. To mention, many of these characters however did fit into different categories of cliché anime tropes. Fortunately, many of these characters did not abuse the 'stereotype' which did not make it a nuisance. Lastly and the character worth of mentioning of is Shibaskaki Roka, the main heroine of the series. Throughout the entire series, the 'eccentricity' of her character shined above the rest. She was definitely an oddball and and at the same time, adorably cute! Overall, loved the characters!\\n\\n\r\nEnjoyment (10/10): Cried tears of joy through in and each episode. Stomach hurt due to laughing to much. Have not enjoyed an anime this widely entertaining in a long time. Enjoyed from beginning to end!\\n\\n\r\nOverall (9/10): Overall, this anime is a perfect example of 'entertainment'. The characters and how they deal with each scenario is ridiculously entertaining. The idea may sound bland of characters playing rock, paper, scissors may sound boring but the way the author wrote the interactions between the characters is simply brilliant! The concept of a plot may be a non-existent, but the entirety of the anime as a whole is worth the watch! The framework just follows simply of high-schoolers, their game creation club and their how they go on about their everyday lives is just what makes it entertaining. Definitely recommend this anime! Do not forget to watch the OVA as well! \\n\\n\r\nPersonal Rant: \\n\\n\r\nTo be honest, this anime could have ended up as a harem anime, as there was a convincible amount of girls in the anime. To mention, many of the girls shared many of the cliche anime tropes used in a harem anime. This is just an observation however. But the idea of this anime being a harem anime could have ruined this anime reputation's for the worse. But, fortunately this series didn't portray any elements of harem that can be classified of the genre. The same genre applies to ecchi as well.\\n\\n\r\nRAW SCORE: 8/10\\n\\n\r\nOVERALL SCORE: 9/10 (Generous Score)\\n",
            "date": "2016-09-06T19:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 228473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006714.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_LorDNiCo_",
                "username": "_LorDNiCo_"
            },
            "url": "https://myanimelist.net/reviews.php?id=228473"
        },
        {
            "content": "Warning possible Spoilers\r\nD-Frag is one of the rare anime's I've seen where we see a male protagonist surrounded by female characters and yet it isn't a Harem or a Romance well maybe a little, instead it concentrates on comedy and because of that it turned to be one hilarious anime.\r\nThe story begins with kenji Kazama who is your usual delinquent student yet somehow his gang encounters a group of unusual girls who end up forcing Kenji to join their club and from then on Kenji's life would become absolute hell.\r\nThe story is relatively simple really as it shows a male student struggling to get alongwith a bunch of weird girls who all imagine they have elemental powers and it was really funny and entertaining seeing Kenji going through a lot of trouble over simple matters with the girls and for a group of likeable female characters the girls in the Game Creation Club (Provisional) are somehow people you don't want to stick up for which was funny because when other people who came along to try and destroy the club you actually wanted the enemy team to win because the girls in the GCC (P) are an evil bunch trust me don't let they're good looks fool you as they will use whatever's necessary to beat their opponents.\\n\r\nWhat I also liked from the story is how it went about because usually these kind of shows have a beach, pool, spa or some kind of cliched fanservice episode and surprisingly enough there wasn't one here which I have to give credit for, so instead the story consists of multiple competitions, some fighting with gangs and other clubs and a whole lot of arguing, but the arguments were absolutely funny especially with the jokes that came out of the arguments.\\n\r\nI also liked how it had these little sections at the end of most episodes that show what other characters are doing during the show and added more to the hilarious factor, but also added a little bit of backstory or exposition and the way the anime ended literally begs for a season 2 to happen I mean after everything that has happened I would definitely be down for a second season.\\n\\n\r\nNow the characters are a really entertaining bunch and are always having arguments over some petty subject.\\n\r\nKenji Kazama is the male MC and he is part of the Kazama gang, he is a very short-tempered person which makes sense since he has to put up with the girls antics almost everyday, but he is a thoughtful person at times often making sure that people don't get hurt however he is also very competitive and will make sure that nobody will stop him from achieving his goal. \\n\r\nThe girls of the GCC (P) consist of Roka Shibasaki, Chitose Karasuyama and Sakura Mizukami, each of these girls imagine they have an elemental power and do go a little far with actually using the elemental power like for real Chitose will throw dirt in people's face's, Sakura will splash you with her water and Roka will control you with her dark power which is basically putting a bag over you're head, but their personalities do differ as Roka does have a very cute persona, but if you disagree with her she'll go almost to the point of Yandere or major Tsundere, Chitose is pretty much a Tsundere often picking on Kenji and giving him nicknames that annoy him, but she does care for her other club members and is willing to fight till the end for them and Sakura is the most positive and energetic of the group, she can be pretty sly too often out manoeuvring or out thinking people when they say or do something to her, for a group of likeable characters though I never really supported them in their endeavours because they felt like people who would be your friends, but would never respect or treat you right.\\n\r\nTakao is another MC and she is the club leader of the original Games Creation Club so she has a petty rivalry with Roka, but her reasons for trying to shut down Roka's club isn't out of hatred and more out of sadness that she lost a friend though after their competition against each other they do get along more, Takao is probably the most normal girl in the series considering the other characters and she may whine from time to time, but she has a good heart and has a strong passion for gaming.\\n\r\nMinami Oosawa is the GCC (P) advisor and she really doesn't do a whole lot since when she gets there she immediately falls asleep hence why her tone of voice is very mellow, she also considers herself a lighting elemental in the club which consists of her carrying a stun gun for protection.\\n\r\nTama Sakai is the ex-student council president and another person who tries to destroy the GCC (P) which is also mainly due to her history with Roka and Chitose since they have been battling each other since they were little kids, despite probably being as evil as Roka and Chitose she is actually very laid back and likes to make jokes which is why I thought she was actually a more likeable character than those two which was pretty funny.\\n\\n\r\nThe artstyle was nothing special, but I really liked a lot of the reactions the characters made and their expressions were just great too which worked really well for the comedic moments and it did use the chibi format a lot often switching from normal and Chibi especially for Roka who was probably in Chibi form more than her normal form well it definitely made the characters more adorable.\\n\\n\r\nThe comedy was absolutely brilliant I was laughing my ass off almost every episode and a lot of the jokes were just gold especially since they were mainly aimed towards either Kenji or Takao, but the arguments that the characters had with each other were really funny to watch too usually these kind of things annoy me, but in this anime these moments were so good especially during one episode where half of an episode was just dedicated to Kenji and Takao trying to not play the girls game.\\n\\n\r\nLooking at the game aspect of the show it was actually fun seeing what kind of ridiculous games the club could come up with and the fact that they made a big tournament just so that they can win one of Roka's bag's was just stupid, but really funny along with the other competitions that involved the club fighting for survival on multiple occasions and because of these instances especially the final one you'd think where the hell the teachers are.\\n\\n\r\nThere are also some romantic elements here and there especially between Kenji, Takao and Roka though Kenji and Roka's relationship is more of a friendly rivalry really whereas with Kenji and Takao there is some proper scenes that show the connection between and that they are more similar than they think which for me and anyone else who likes this ship does produce some nice moments between them.\\n\\n\r\nOverall this was a very fun and enjoyable anime even if it doesn't have a strong story because what really matters here is the characters and the chemistry between so I'd definitely recommend this if anyone is looking for a good anime to laugh at.",
            "date": "2017-08-23T10:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 256102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=256102"
        },
        {
            "content": "First off, no I am not a slice of life fan.\r\nI went into this show with some typical worries.. \"IS IT GOING TO BE A BAD SHOW\"? Short answer: No, it wasn't.\r\nThe story... we don't talk about the story. Not because it was bad but because it just didn't exist. Typical SOL.\r\nHowever I still got really drawn into what was going on most episodes. This is mostly because everything that happens in this show is just so fricking absurd, it's not even funny.. But that's just the thing, IT IS HILARIOUS. Sort of. I noticed other people praising this show with it's uncanny comedy butI still just can't fully agree with that statement. Not because it is unfunny but because I didn't find all of the 9000 jokes / second they were throwing at us \"that\" funny. Please don't confuse this with me saying it is unenjoyable because it is in fact very enjoyable. Why? Because, in my own words, all of these jokes set the mood of the show. You aren't supposed to take this show seriously which I like. \\n\\n\r\nArt:\\n\\n\r\nWasn't bad, however I found it rather inconsistent (not talking about the chibi's, the chibis are great and you DON'T joke the chibi's). I felt the way the characters were drawn poorly in some instances (not all) and some of the camera angles were poorly drawn. The artstyle on the whole is pretty acceptable by my standards and animation is good enough for just a SOL anime.\\n\\n\r\nSound:\\n\\n\r\nNot a musicoholic but yeah, had a good OP, good voice work, and I didn't really notice the BGM (but honestly who really cares in a SOL anime where the mood is set not by music but by the number of jokes you can break in a second, right DF?). Also, hi.\\n\\n\r\nCharacters:\\n\\n\r\nPretty likeable characters, however a few of the sub-main characters are JUST there (like the pink haired bitch) and barely had any affect with the main character. I guess this is a small mole hill in an otherwise mildly enjoyable show.\\n\\n\r\nAlso, Takao Best Girl. Also she is voiced by the girl who voices Chris(also best girl) from Magikoi and not the anime (Worst adaptation ever), the VN. \\n\\n\r\nEnjoyment:\\n\\n\r\nProbably the thing I enjoyed most about this show was the atmosphere it gave off. Silly does work sometimes (it usually doesn't for me) and for the record I did not laugh at every joke this show threw at me just because of the sheer number of jokes. It's physically impossible. If you claim to have laughed at absolutely every single joke then you most likely evaporated out of your human shell. Art wasn't too great (or too bad) for me but it didn't get in the way of enjoyment.\\n\\n\r\nOverall:\\n\\n\r\nAs an anime made up of 80% jokes, it was really enjoyable, no doubts here. A very addictive and bipolar environment that you just can't resist... Go watch it.\\n\\n\r\nI ultimately gave it a 7/10 because it left me wanting for more so let's hope for that second season =)\\n\\n\r\nIf you found my review helpful then leave a like or whatever you do on this site and also leave me feedback so I can know what not to do in reviews in the future (I am not a writer for god's sake!) :)",
            "date": "2014-04-02T14:35:00+00:00",
            "helpful_count": 6,
            "mal_id": 138353,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2629033.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jaycalli50",
                "username": "Jaycalli50"
            },
            "url": "https://myanimelist.net/reviews.php?id=138353"
        },
        {
            "content": "This is a great \"episode a night\" anime! But that quickly turns to two or three or more a night... This is an anime that makes the time absolutely zip by, it's crazy. I could've sworn this was a 5-12 min per episode show, but sure enough it's 20+. Sit down at 10:30 or 11 and next thing I know I'm wanting more and it's after 1:00am!\r\nThe story is neat, if not a bit confusing at first, but you quickly become accustomed to it. It's hard to get incredibly attached to anyone character *cough*Takao*cough*, since their depth is a little underwhelming, especially for smaller characters.That said, I can't wait for season 2!\\n\\n\r\nIf you don't mind some boobage (it's mostly pretty modest), and like a show that will keep you hooked from one episode to the next, pick this up. I feel the dub was pretty good, notably Takao and Roka - while the rest felt a little wooden or dry. Shiou was a great dub too, but my god do you still want to punch him in the throat (which I guess is what they were going for lol).\\n\\n\r\nI'll be sitting here patiently waiting for season 2 I suppose, and will definitely rewatch it in the mean-time!",
            "date": "2015-07-15T23:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 193531,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683102.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Xhynk",
                "username": "Xhynk"
            },
            "url": "https://myanimelist.net/reviews.php?id=193531"
        },
        {
            "content": "This Anime surprised me positively, as a fan of comedic anime series in general, i have to say that this one made the most out of it's potential.\r\nThis Show could have easily become just another generic cliché comedy with a little bit of romance and many jokes, where most of them aren't even that funny. But instead we've got great characters, smart written jokes/dialogues and some serious moments for a good amount of character development and story progression. The story also knows how to put in little romantic scenes, so they doesn't seem that cheesy and it feels like the relationships between the characters arereally making progress throughout the show, unlike many other anime series i know.\\n\\n\r\nAnd that makes this Anime a nice big package full of entertainment, even though it might seem like an overused scenario at first. Just continue watching it and i will guarantee you, you will get your enjoyment out of it!^^",
            "date": "2015-08-11T06:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 195826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4645917.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SparksterDX",
                "username": "SparksterDX"
            },
            "url": "https://myanimelist.net/reviews.php?id=195826"
        }
    ],
    [
        {
            "content": "Does it matter if it's soy or love?\r\nOr something along those lines.\r\nIf I sounded a bit crazy, then would you believe me that was from the OP?\r\nStory: 5/10\r\nThere's no story for me to review, so I gave it a 5. Don't worry, it's not a bad thing for this anime. I would like to mainly comment on the comedy and the one-sided romance in this anime. The comedy is mainly from random scenes or punchlines by Kazama. It can be pretty random, I bet you. The romance is very slight and one-sided. Some of the girls, you would have to check the wiki if theyhave feelings for him and for the others, you could instantly notice. It's one-sided, though. But I doubt that this anime was aiming for a mostly rom/com type anime.\\n\\n\r\nArt: 8/10\\n\\n\r\nFor me, the art fit the theme of the anime. The art is very simple, the animation was smooth and the colours were nice.\\n\\n\r\nSound: 9/10\\n\\n\r\nThe OST somehow fit each scene, whether it is a really stupid one or a serious scene. Though, I will be mostly talking about the random OP and ED. The OP would have sentences along the lines of '....do you understand? I love tungsten'. The ED is less random than the OP, but they're both pretty catch though.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nTo me, each character stood out whether they are a main or a side. They were all very unique in their own ways.\\n\\n\r\nKazama Kenji, the protagonist and the so-called delinquent. Most of the screen-time he gets is throwing punchlines to each random scene/sentence from each character. For a delinquent, he's very kind. But, he's pretty oblivious to the girls that like him.\\n\\n\r\nRoka Shibasaki, a very random girl. My favourite things about her is when she's in her chibi form either staring at someone or doing something stupid. Would you also believe me if I said she's the 'underground boss'?\\n\\n\r\nChitose Karasuyama, the weird student council. Even though she picks on Kazama, calling him Mr. Foot Fetish, she can be kind sometimes. She's quiet sometimes, and can be slightly perverted.\\n\\n\r\nMizukami Sakura, a water obsessed character. Though she is cute, she can be super random sometimes like asking a person if he/she likes water. Very cheerful but probably gets the least screen-time as a main character.\\n\\n\r\nTakao (no last name listed) is a tsundere and a girl who has unusually massive boobs that could break a tracksuit's zipper. She likes Kazama a lot and tries to impress him and hearing on what he likes, so she can cook something that he likes. She's a nice person too. A pretty girl who likes to play video games, now that's rare.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI enjoyed this anime quite a lot. I waited for half a week to watch this because I had really bad internet for about a week. As soon as our internet came back, I was really excited to watch this. I was not disappointed at all.\\n\\n\r\nOverall: 9/10\\n\\n\r\nIf you're looking for a funny anime to kill time or to make yourself happy, then this anime might do the trick. Would I re-watch this anime? Definitely, for the laughs. Also, did I mention random?\\n\\n\\n",
            "date": "2015-02-23T04:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 181032,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=181032"
        },
        {
            "content": "Have you ever imagined an work so randomly amazing, that could even be saw as the best anime from an entire season? Well, D-Frag! surely wasn't a \"number one\", but its revolucionary comical style put a tough challenge for the other adaptations aired during 2014's first quarter.\r\n{STORY - 8/10}\r\nCentered on the Game Creation Club (Provisory), focus is basically upon... Playing games... D-Frag! is an unique breathtaking comedy that stands upon a simple thematic like having nonsense fun during afternoons? No! Most situations are not even based on this and constant disturbed interations between Kenji and every other character from D-Frag! is what draws attention andgives you a reason to watch it till' the end!\\n\\n\r\nJoining against his own will, Kenji is now obligated to always attend reunions, which focus on eating snacks, reading manga, sleeping or playing games whose ideas are credited for the club. Keeping it alive is the main objective and many challenges to that are presented throughout episodes.\\n\\n\r\n{ART - 7/10}\\n\\n\r\nDespite relatively simple, characters are very well designed and most of them feature either distinct visual or appearance. Animations are consistant and fluid. Main scenario is the academy where the club is hosted, so it's deadly repetitive during most scenes, as every episode begins on a classroom...\\n\\n\r\n{SOUND - 9/10}\\n\\n\r\nImpossible not praising legendary Katsuyuki for his incredible voice acting under Kenji Kazama's role. Always screaming without losing breath is the main characteristic from the supposed delinquent and Konishi represented that with perfection.\\n\\n\r\nFor the girls, undeniable presence from Kana, voicing over Roka's cute, \"yanderish-like\" personality, means another strong point for D-Frag!'s dubbing cast. Chiwa Saitou, Aki Tokisaki and many other well-know names are also part of this project.\\n\\n\r\n\"Stalemate!\", sang by the main girls, runs on a accelerated rhythm, featuring strong guitar and bass solos during all performance, while ED piece \"Minna no Namae wo Irete Kudasai\" is sang by Roka, Takao and Funabori's actresses, being more eletronic than instrumental, despite having almost the same rhythmical style and being as cheering as the intro one.\\n\\n\r\n{CHARACTERS - 10/10}\\n\\n\r\nNow into the best aspect from D-Frag!. Every episode featured the brief entrance of one or many new characters, that could have a lot or almost no screen time. Common people, gang members, nerds, ace students, heirs, among some other types, were added in the cast constantly, besides the main ones, members from both original and provisory Game Creation clubs.\\n\\n\r\nMost of the secondary characters have their appearance limited only to the episode were they first star. Some can randomly appear during following episodes, but those are few and presence is always short.\\n\\n\r\nAll characters are exclusively unique, at least, on personality matters. They range from various kinds, like moe, misterious, bully, calm, perverted, masochist, sweet, tsundere, sleepy, unresponsible...  Using so many types on a 12-episode anime is not easy. It isn't impossible as well...\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nEach episode steals more and more laughs. With all those stupid and awkward situations, it's impossible not liking D-Frag!. Even scenes that are supposed to be serious are literally spoiled by funny actions... Cheering excess, watch out, you may lose your breath.\\n\\n\r\n{OVERALL - 9/10}\\n\\n\r\nIf you're looking for a very distinctive comedy, occasionally centered on romance, but focusing on unique kinds of gaming and also showing some really embarrassing situations, D-Frag! is just the most suited to fulfill all these requirements. Despite not being dramatic or having an intense, twisty plot, it impresses by constantly bringing something new. Gaming taken seriously (or maybe not...), that's how they play!",
            "date": "2014-06-04T16:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 145827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=145827"
        },
        {
            "content": "I'll start off this review by simply stating that D-Frag is probably the funniest anime I've seen in quite a while. In many ways, the sole enjoyment and charm of this series is derived from its comedic antics, hilarious character portrayals and situations. I'd most liken it to Baka and Test's younger sibling because of it's smaller scope and greater focus on running jokes and mindless entertainment. \r\nSo with some brief inklings as to what type of experience you're in for as a viewer to this series, what's it actually about? \r\nKenji Kazama is a young delinquent at his high school and has a knownreputation for being tough, calloused and intimidating, whether in fights, or everyday conversations. Most people would sooner stay away from him than try to be his friend. The comedy and insanity insinuates when a group of girls with some VERY interesting and colorful personalities forcibly recruits him to the school's lackluster and widely disregarded \"Game Creation Club.\" The namesake tenant of the club however is fairly disregarded, and more often than not, the group isn't making games! The various personalities and social differences within all these different characters make for a truly fantastic social experiment, but also some GOLDEN humor! Whether it be the shy, eccentric and slightly dis-associative club president Roka Shibasaki, or the dense, proud and borderline Tsundere personality of Takao (her nickname being \"boobs\" due to her large bust size! :P). There is a character for everyone in this series!  \\n\\n\r\nWhile the characters all have their varying personalities, conflicts and insecurities within the context of their daily lives and in the Game Creation Club, they retain their likability. This is a HUGE praise I have for this series. While the show doesn't go into too much detail as far as character development is concerned, it is clear that real, genuine friendships develop between the characters, and they work together well despite of their conflicts and differences. The most humorous interactions, and ultimately the ones that account for much of the shows plot development, are those involving our main male protagonist Kenji. Always reluctant and subject to the will of the crazy girls all around him, he's that character who'll just yell about everything and make things tons of fun for us audience members! Being recognized for more than his typical delinquent identity however, he grows to truly love being in the club despite the nature of his antics throughout the show. ;) \\n\\n\r\nIn a lot of ways, as far as plot and character development is concerned, this series is most nearly episodic in its presentation. Smaller plots can underlie certain small groups of episodes without bludgeoning us with overwhelming twists and tensions. D-Frag is a FUN watch with an ending that best suits it in terms of its simplicity and scope. \\n\\n\r\nIn conclusion, D-Frag is without a doubt one of the funniest anime I've ever seen, (top 5). And it's an essential watch for fans of great comedy! \\n\\n\r\nOverall-9 \\n\\n",
            "date": "2016-08-21T20:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 227301,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5158768.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PianimeMan",
                "username": "PianimeMan"
            },
            "url": "https://myanimelist.net/reviews.php?id=227301"
        },
        {
            "content": "This is one anime that I can describe like \"It's funny\".\r\nIt's really funny.\r\nLooks like just another generical comedy anime about a college club, but the comedy and how the anime follows works very good.\r\nDon't have a great history, I don't like when he tries to be serious, because the best thing here is the comedy. I know, I constaintly talking about the comedy, but is the only thing that caught on the anime.\r\nHave a lot of good and insane characters, ends very well they sequences and the great point: the direction, because the director have a good time for jokes (what a surprise), have somany scenes that can make you laugh high and this is the shine of this anime.\\n\r\nIt's a anime above average and works good what tries to make.\\n\r\nIf you want a good comedy, watch it.\\n\r\nMy note is 7 (almost a 8).",
            "date": "2017-02-13T15:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 240538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4889385.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SweetPumpkin",
                "username": "SweetPumpkin"
            },
            "url": "https://myanimelist.net/reviews.php?id=240538"
        },
        {
            "content": "Hello everyone, please keep in mind this is my first review. I will do my best to express my tought on the animes i will be completing from now on.\r\n-Story- 8/10\r\nThe story is mostly irrelevant  in this kind of anime. The most important thing is ''Is it funny and how so?'' I can say without a doubt that this serie is absolutlely hilarious, it manage to take the most trivials and boring things and makes them funny. What i personally like is that there is little to no puns. (I'm not too fond of puns!)\r\n-Art- 8/10\r\nThe art in this one is quite simple andcolorfull, perfect for this kind of anime. The backgrounds are also well made with some references to games and mangas here and there. I also liked the design of the various characters theyr expressions are funny and they look adorable when they turn into chibis!\\n\\n\\n\r\n-Sound- 7/10\\n\r\nThe music is okay but nothing really catched my attention, exept the opening which i really like. The voices of the characters perfectly fit them, Roka's voice is just the best. Only thing i didn't really like is that the main character (Kazama) is constantly yelling everytime something happens, i don't mind it that much since its part of the humour but it can get irritating.\\n\\n\\n\r\n-Character- 9/10\\n\r\nThis is the strongest point of this anime, the characters are all awesome. Every characters have some sort of strange fetish or obscessions (putting bags over people heads, throwing dirt at people, being a masochist, crossdressing etc etc..) You never know what to expect from them and it always lead to completely ridiculous and hilarious situations.\\n\\n\\n\r\n-Enjoyment- 8/10\\n\r\nI really enjoyed this anime, it's rare to see a well made School comedy anime that does not fall into the usuall cliché of puns and echhi nonsense. Every episodes managed to make me laught hard and that's a sucess in my books.\\n\\n\\n\r\n-Overall- 8/10\\n\r\nBefore watching this i tought this was going to be just another basic School Comedy but i was proven wrong on the first episode, this one is quite a suprise.\\n\r\nIf you like animes like Nichijou, MM!, Haganai or Chuunibyou i would absolutlely recommend you watch this one, it's well made and worth watching.\\n\\n\r\nThank you for reading, if you have any feedback let me know!",
            "date": "2014-03-27T11:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 137253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/377141.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Insomnium101",
                "username": "Insomnium101"
            },
            "url": "https://myanimelist.net/reviews.php?id=137253"
        },
        {
            "content": "This is my first review so take it with a grain of salt. \r\nLet me start by saying I wasn't expecting much from this series. However, I ended up loving it. Simple reason is the characters are, for the most part, really likable. Throw that in with this style of comedy and \"storytelling,\" and you have a great show. I realize that when you look at my animelist, I'm very lenient in scoring, so again, take it how you will. \r\nStory: 7\r\nThe story is told in a basic, linear fashion. The main casts gets a problem and they resolve it. Nothing groundbreaking. However, the mainappeal of this show isn't how great the conflict is. It's how silly they fix they fix their problems. And the comedy/silliness is definitely up to par with the heavy hitters of the comedy genre.\\n\\n\r\nArt: 6\\n\\n\r\nNothing special. Run of the mill artworks and visuals. The characters are pretty typical. But like I said earlier, the appeal is in the humor.\\n\\n\r\nCharacters: 8\\n\\n\r\nI loved the characters. The cast of ridiculous support characters give the straight man all the material needed for the classic joke setup. That being said the characters are pretty static meaning they don't really go through huge changes in their thought or actions, but again, not that kind of show. Also they are pretty typical as far as comedy anime characters go. \\n\\n\r\nSound: 10\\n\\n\r\nThe soundtrack is just average even considering it's a comedy. The high rating comes almost entirely from the voice actors/actresses. They really did a good job showing the emotions and portraying their characters to their personalities. \\n\\n\r\nEnjoyment: 10\\n\\n\r\nThis is where the high rating comes from. From start to finish, I was laughing my head off. That's exactly how this type of show is supposed to be. It's not something you try to find reason for the dumb things they do. If you try that, you'll ruin every anime ever. \\n\\n\r\nOverall: 9\\n\\n\r\nAll in all, this was a 9/10. Yes 9. A solid 9 at that. Why? Because it's just so fun to watch. It says 9 means \"Great,\" one step down from \"Masterpiece.\" Is it comparable to the true masterpieces? Not even close. It's at least up there? Nope. It's not even in my own top 10. But to me, a good show is one that I enjoy. I certainly enjoyed this one. \\n\\n",
            "date": "2015-12-24T08:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 206663,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3154071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TokyoPimps",
                "username": "TokyoPimps"
            },
            "url": "https://myanimelist.net/reviews.php?id=206663"
        },
        {
            "content": "OMG I just finished it! Ahhh i didn't want it to end! This anime really cracked me up! I laughed so hard while i watched it and now I'm gonna miss it T.T The characters and their personalities and lines are just perfect! Gotta say i really do want a season 2! I'm glad there's at least OVI to watch now. I definitely recommend this anime :) \r\nAbout some of the characters:\r\nKazama Kenji is such a cutie! He's all tough delinquent and in the next moment he's princess Pinch :D :D i love that guy! Especially when he tries desperately to pull some logic andRoku or Chitose cut him off with something really wierd/scary/pervy.\\n\r\nRoku is a like an anime version of a friend of mine. Sometimes it was really hard not imagining my friend doing all these thing in real life and laugh hard. She's so small and kawai when she pulls the big shocked eyes especially when it's about Takao's boobs. And btw i feel like there can be a whole anime series just about Takao's boobs :D Now back to Roku - when she's really into something and does that shadow evil thing and makes some creepy line i just drop xD she's sooo goooood!\\n\r\nKarasuyama's eyes - magicaaal! Her fights with Tama and especially the sand castle story is awesome. \\n\r\nI just love the memory lane walks in general in D frag!",
            "date": "2017-01-27T17:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 239269,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5999847.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Poppy123",
                "username": "Poppy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=239269"
        },
        {
            "content": "At this point club based anime's are a dime a dozen. An overused template in which the same tired jokes are made with the same cut and paste character personalities with varying levels of executional success. Maybe i'm late to the party and the show had more relevance 2 years ago in winter of 2014, but a lot of the shows I intend to use for context still predate D-Frag by a couple years.\r\nSome classics which actually involve some story include shows like Yahari Ore no Seishun Love Comedy wa Machigatteiru from Spring 2013 and then there's the less narrative driven Sket Dance from Autumn2012 which focuses, much like this show does, on slapstick humour to pull its audience. Though there is some continuity to SD still as there are some minor character developments. These two shows focused on \"self-help\" related club groups whilst other popular gimmicks include paranormal and occult based research clubs which mix in a little \"magic\" to power the inevitable troubling situations. Or anime/manga clubs which often deal with career building and legitimising art as a valid career option.\\n\\n\r\nSo from the very beginning the show is nothing unique, original or special. But that's not to say a show that isn't any of these things cannot be enjoyed. But without tension or pacing or any semblance of a narrative that one can follow it's literally just the bare bones slapstick you can find anywhere else.\\n\\n\r\nA barely average animation quality also doesn't help the show, unfortunately  aesthetics are just as important in pulling and hooking an audience, a decent animation is just generally a pleasure to watch for its own sake. This show's animation is OK. Neither bad nor note worthy.\\n\\n\r\nJust like the jokes, the characters are mostly cut and paste personality types. The over bearing god like female president type, the lazy enabling blase sensei, the moe, the sporty girl (who for some reason is always a red head), the female obsessed with gays or cross dressers (the female pervert), the massive guy who's passive, the walking contradiction of a MC who's simultaneously strong willed but also submissive, i could go on. Basically you've seen it all before.\\n\\n\r\nThe show itself is fine and if you're looking to waste an evening I would say you could do better. But if you genuinely can't think of anything else then i guess, sure, i wont tell you not to watch this.",
            "date": "2017-01-17T13:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 238520,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=238520"
        },
        {
            "content": "Okey-Doky Lion Tamers, let's do this thing\r\nAnother review from a genuine \"Mean Ole' Man\"\r\nD-Frag! ........Where do I begin?\r\nI've been trying to watch this show, in an effort to enjoy it. But I must confess that I'm wearying of it.\r\nNormally I write a lot in my reviews, but there isn't anything to write about. The plot is so contrived, that the actions of a single character done differently would topple the whole show. That action is, if Kazama Kenji fails to be drawn into the lunacy of the four female protagonists; their fun ends, and the story comes to a screeching halt. All he has todo is walk and keep going, and if they won't let him; he can actually prove to the World how much of a delinquent he says he is, and punch any one of the girls so hard her nose breaks.\\n\\n\r\nThe only decently funny bit in the whole show is when the Student Body President, Karasuyama Chitose, drops a hall locker on one of the characters. The behavior, lead up, and execution is priceless.\\n\\n\r\nBut it's not enough to save a fatally flawed show; full of sight-gags, false leads, innuendoes with illogical/irrational consequences, intentional dead-ends, timing mistakes, inopportune dialog, and senseless breaches of etiquette with nothing to show for it but hurt feelings for everybody the viewer does NOT care about.\\n\\n\r\nAnd then the writers have the effrontery to believe that the principles of \"write bad jokes, rinse, repeat\" is the proper way to do inane humor. As if inane humor was ever worthwhile.\\n\\n\r\nIn other words, it's a training course for teenagers that wish to become so enraptured by irrational thinking that they find themselves in a mental ward as a consequence of believing the World is a purple marble with a pretty green sky. And let's not get me involved with that obvious tagging mistake with Jay Ward; who was another crazy genius, but his humor was actually funny.\\n\\n\r\nOn the other hand, some people want to be institutionalized, as a means of finding three-squares and a warm-sack without working for it. I for one, wish the creators of D-Frag! would change the volume on their IV-drip, and change the channel of video running around in their head. We might get some improvement.\\n\\n\r\nAnd all this in D-Frag!, to sell a picture card game, something that is quite popular in Japan. We know that because the editorial content in the credits tell the viewer to keep an eye on the special scene to get points for the next round of his card game.\\n\\n\\n\r\nThe artwork is quite good, but not over the top. The sound is good, and the voice actors do a passible good job. I gave this a 6.\\n\\n\r\nI think my job here is overdone, dry and tasteless. Sorry about this readers, but I can't help myself; this thing is that bad.\\n",
            "date": "2014-04-05T23:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 138887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KD7BWB",
                "username": "KD7BWB"
            },
            "url": "https://myanimelist.net/reviews.php?id=138887"
        },
        {
            "content": "It's a pretty weird anime.  To start with, the actual animation isn't particularly good, with the exception of the title sequence - the rest is generally pretty basic and at times weird.\r\nThe story itself is only interesting for the first and last two episodes - everything else in between is pretty standard, bland and not terribly exciting.  Whilst everything happens quickly, and there is a lot of scene jumping you don't really get a feel for really interesting happening.\r\nThe comedy is okay - it won't make your sides ache, but you may smile a little bit per episode.\r\nThe main characters themselves are prettystandard although nicely drawn.  Side characters are pretty poor.\\n\\n\r\nOverall, I think this would have worked much better if it had been a lot more serious, a continuous arc and with higher stakes for the ending.\\n\\n\r\nOverall, it's worth watching once, but it's a bit \"meh\".",
            "date": "2018-03-05T13:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 273103,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962652.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sku_Te",
                "username": "Sku_Te"
            },
            "url": "https://myanimelist.net/reviews.php?id=273103"
        },
        {
            "content": "Somehow it being in the comedy genre just fails to make me laugh. There are a few things that stops me from enjoying this anime. First off, sure there are some funny moments but if you notice, every student looks like their in their late 30s and above. Secondly, Kenji screaming at every supposedly \"funny\" is kind of pissing me off as it is too overused and kinda boring. Lastly, there is no character development at all in this series in my opinion.\r\nI only recommend you to watch this if you really have nothing else to watch at the moment for some laughs.",
            "date": "2016-07-21T02:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 224560,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5030544.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kurumi_senpaii",
                "username": "kurumi_senpaii"
            },
            "url": "https://myanimelist.net/reviews.php?id=224560"
        },
        {
            "content": "It's not often I stumble across a synopsis for a show that flatout LIES about what it is. Not that I expected D-Frag! to actually be about game development in any shape or form (which an anime about that sounds about as entertaining as watching an apple brown), but D-Frag! seemed so uninterested in its own premise, it barely does anything unique with its loosely established concept and settle on being a rather generic run-of-the-mill shonen comedy that's way too loud while also bringing anything remotely new or charming to the table to muster more than a small handful of laughs over 12 episodes.\\n\\n\r\n STORY: So stop me if you've heard this before in a situational comedy; a self-proclaimed high school delinquent befriends weirdos and develops a begrudging bond with them, and together they must work to keep their school club from being shut down. I'd say D-Frag's premise could be written on a Culver's napkin, but that would imply someone took the effort of writing it down. The \"writing\" \"staff\" (I'm putting staff in quotes, because that would imply a team with moderately qualifying credentials sat around and brainstormed, of which I'm skeptical) merely copy/pasted a formula that's been beaten to death since 2003. This was about as written as finding someone's crumpled up notes from your social studies class in the garbage. If school club related premises are the backbone of modern anime and manga comedies, then this genre's spine is riddled with an untreatable case of osteoporosis. And the \"game development\" aspect of D-Frag! is virtually unexplored. With the exception of some meager retro interactive electronic and table top game references littered about, it bypasses addressing it. Given the universal resurgence of table top gaming in the last 8 years (maybe it's different in Japan), this was a missed opportunity. The Game Development Provisional Club could've implemented more emphasis on poking jokes at deck builders, or multiplayer co-op board games, using those as a metaphor or morality lesson at the end of episodes, or even a chance for slapstick. But it foregoes these in favor of placing emphasis on Takao's ridiculously gigantic breasts and misinterpreting characters yelling at each other as jokes. SCORE 4.7\\n\\n\r\n ART: D-Frag is colorful, but nothing that makes it stand out in any particular fashion. Even the animation does little to accentuate whatever physical or visual humor they're attempting to get over. I've seen it all before. Blank white eyes, Beam of Enlightenment, Blank Face of Shame, Cross-popping veins, nose bleeds, cross-dressing trap characters...every single anime trope is in D-Frag. I can't laugh at things I've seen for 17 years. It isn't that tropes are bad, but how and why you utilize them are more important than just simply doing it.\\n\r\n The character designs are alright, you can guess their personalities upon just LOOKING at them. For a comedy show, that isn't a bad thing. Kenji Kazama looks like every other turf-headed, orange, gruff protagonist. If you threw a black cloak on him, he'd be Ichigo Kurosaki. Goofy large breasts aside, Takao is my vote for the best design. She has a more unique hairstyle (accentuated by the red ribbon, which helps her stand out) and a cuter face than any other female in the cast. The rest of the characters are a marginal amalgamation of seemingly rejected School Rumble designs. \\n\r\n The backgrounds, like most modern anime, use a pointless amount of distractingly average computer animation, like more than one occasion there's just an establishing shot of things like a CGI hallway or playing cards. Again, just because you CAN do it doesn't mean you should. SCORE 7.3\\n\\n\r\n SOUND & VOICE: I'm reviewing Funimation's English dub. All things considered, it's not a BAD dub, but as mentioned before, all the characters are screaming at the top of their lungs seemingly all the time and it gets rather taxing and repetitive to listen to. The Japanese dub is actually slightly more grating, so I just switched it back over. Some of the funnier lines are actually the low key moments from Austin Tindle's Kazama rather than his yelling. If you like English dubs (all 38.5 people on the planet), you may get some laughs out of the delivery of some lines, and Patrick Seitz is fairly entertaining as jock Odawara. I thought the funniest line was the very last one before the credits when their supervisor/teacher Oosawa told them they were all suspended for their gambling phone contest stunt. That was brilliant. SCORE 5.8\\n\\n\r\n CHARACTERS: Maybe it's because I'm a very cynical and nihilistic person regarding modern anime (I try to look at the glass as half full), but I feel like I'm missing something here. In a show as rambunctious and off the wall it pretends to be, D-Frag! has a surprisingly forgettable cast of characters. With the exception of Takao and Tama, the latter who shows up for the final arc, the motley crew is a mish-mash of templates and archetypes that try in exaggerated methods to seem dynamic, only come off looking rather generic. Kazama has two childhood friends who are featured fairly regularly, but I forget their existence. Sometimes it's a meta callback when Odawara returns and he's not remembered, but the aforementioned teacher Oosawa, whose gimmick is she sleeps and carries a taser (lightning type) is virtually useless after the first episode. Takao and Roka have this Ryoko/Ayeka-like rivalry for Kazama's attention, which is the only takeaway from D-Frag! I'd say is genuinely amusing. Other than that, the setup for this series' ONE joke is the same; someone speaks nonsense, Kazama gets annoyed and yells at someone. SCORE 6.2\\n\\n\r\n OVERALL: D-Frag! wouldn't suddenly become better or worse if it dropped its gaming premise. Like Dagashi Kashi (another \"why bother\" comedy) I think you need a little more defined reason for existing, other than weirdness for weirdness' sake. I reviewed Tonari no Seki-kun and those 4 minute shorts manage to properly convey its humor in greater success than all of the rambling these girls do in D-Frag! throughout its 22 minutes. I've said it many times, these hack anime and manga writers need to watch/read older titles like Tenchi Universe, Here Is Greenwood, Slayers, and Dragon Half and take some inspiration on how to effectively set up gags. Even if they are repetitious, change the delivery. Because offerings like D-Frag! is just the mediocre sludge that's a big part of the problem. \\n\\n\r\n FINAL SCORE: 6.1/10 \\n\\n\r\nPROS: Decent art. Serviceable English dub. \\n\\n\r\nCONS: Way too generic, despite potential in premise. Obnoxiously loud, one-dimensional humor. Bland characters.",
            "date": "2017-12-10T13:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 264925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/210239.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Colonelfancy",
                "username": "Colonelfancy"
            },
            "url": "https://myanimelist.net/reviews.php?id=264925"
        },
        {
            "content": "D-frag is a school comedy that does what every other school comedy does and doesn't shine much in any way. However it's still mostly entertaining.\r\nVisually the show looks quite dated and bland. There's very little effort put into it both in terms of artwork as well as animation, but nonetheless it's passable. \r\nThere is no real story, it's just 2-3 episode arcs in which the main characters face off others or each other for whatever reason in various games that they invent on the spot. \r\nThe comedy is as generic as it gets, using the same old ways most of the manga and anime haveset up: using characters with ridiculous stereotypes and then making fun of them. Of course this can only work once or twice, so in order to not be repetitive anime like this one need to constantly add more characters and more stereotypes in the mix, which is what it does. However, every now and then the jokes do get actually good, as in they make sense without having to rely on ridiculous traits.\\n\\n\r\nThere's many episodes in which the show makes fun of one of the character's breast size. I found that really immature and the fact that the joke is repeated many times makes that even worse.\\n\\n\r\nOf course there's some better parts and some worse parts to this anime but no matter what it's still enjoyable and that makes this one at least worth to check out, it may suit your taste.\\n\\n\r\n5/10",
            "date": "2016-05-02T15:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 217732,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1672039.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PuruRuru",
                "username": "PuruRuru"
            },
            "url": "https://myanimelist.net/reviews.php?id=217732"
        },
        {
            "content": "For a time in media when action and drama and violence tend to stand out amongst other genres, a show focused specifically on the aspect of comedy is very much appreciated. And, oh boy, does D-Frag! do comedy well. With the concept of a school \"game creation club\", it really does allow the show to be, well, creative. A lot of the things that go on are ridiculous antics that one wishes could be a part of their high school experience.\r\nFollowing the mis-adventures of a high school \"delinquent\", D-Frag! mixes a huge variety of characters, including the aforementioned \"delinquent\" who is much kinder than heis made out to be, the outrageous club leader with her trademark 'Bag of Darkness', the rival club leader and her...ahem...\"melons\", and very many other characters that bring a great feeling to the show and a lot of diversity. \\n\\n\r\nOftentimes in a show, you will see something that doesn't add up or it makes you think that \"hey, why does nobody realize this?\" or \"why does nobody point that out?\" However, in D-Frag!, those moments are nearly non-existent with many comedic moments coming from characters simply pointing out how bizarre a situation is.\\n\\n\r\nThe art of D-Frag! is very well crafted and uses many bright, vivid colors to portray this atmosphere of light-heartedness and humor. Similarly, the show's soundtrack leans more toward happy, upbeat tunes that really convey this atmosphere equally as well as the art. This show was produced by Brain's Base, a company that has had more famous works such as Baccano! and Durarara!!. D-Frag! is just another show that belongs on their repertoire of great anime, even if this show is much less dramatic and more colorful than some of their past works\\n\\n\r\nD-Frag! is an episodic show, with each new episode having a new conflict and moments of hilarity. On occasion there are times when there will be small arc that span 2 or 3 episodes, but for the most part the viewer can expect some series of new, crazy antics each episode.\\n\\n\r\nD-Frag! is a comedy through and through, and a well done one at that. If you are looking for a show that will make you feel emotional or be very drawn in by the story, look elsewhere, for D-Frag! is simple fun to be enjoyed at your leisure. It's no masterpiece, but it's a ridiculously good show that will have you cracking up.\\n\\n\r\nPositives:\\n\r\n+\"Stalemate\" is a fun, upbeat opening tune that, while it may not be the best piece of music, gets stuck in your head very easily\\n\r\n+The comedy in this show is some of the best I've seen in any TV show\\n\r\n+Characters are all unique and have very different personalities that give the show lots of diversity\\n\r\n+Art and sound are very bright and well made\\n\r\n+Very fun concept with hilarious antics along the way\\n\\n\r\nNegatives:\\n\r\n-Only a mere 12 episodes and and OVA (WE NEED MORE)\\n\r\n-Some characters are tossed aside and others sort of appear out of nowhere\\n\\n\r\nThere really isn't much wrong with this show. However, it's distinct lack of content (being only 12 episodes) prevent me from giving this show a perfect score. D-Frag! still remains a near perfect comedy that anyone can enjoy and will keep you entertained as many ties as you wish to rewatch it (the rewatch value is pretty high)\\n\r\nAnd that is why D-Frag! gets a 9/10",
            "date": "2015-07-27T11:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 194467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4769556.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dalek_of_Skaro",
                "username": "Dalek_of_Skaro"
            },
            "url": "https://myanimelist.net/reviews.php?id=194467"
        },
        {
            "content": "So... I got into D-Frag without reading the manga with basically no expectations. It started off slowly and after 3/12 episodes you wouldn't know what it was about.\r\nIt's pretty much unpredictable at times and sort of predictable at others. Quite some jokes are actually funny. The bad ones don't stick around. I was actually surprised how they \"use\" characters. It feels like the characters are just a tool to make the jokes work. Atleast this goes for the supporting ones.\r\nThis becomes apperent because the anime only has 12 episodes. Not all characters can develop in this amount of time. It feels like I'm watching \"thebest of\" D-Frag manga (I could be wrong since I haven't actually read it).\\n\\n\r\nAlthough the start was messy and there was no real connections between the episodes at the start it got better after a couple of episodes, story and enjoymentwise (although it doesn't have a story so I guess connectivity/appealingwise). Due to this I changed the score from an initial 6 to a 7 while the series probably has a higher potential.\\n\\n\r\nIn short, if you're looking for a story this isn't something you'd watch. If you're looking for comedy, this might be worth it if it is to your taste. If you can get through the first episodes it'll likely just get better for you.",
            "date": "2014-08-27T02:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 158067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3319957.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/doom19876",
                "username": "doom19876"
            },
            "url": "https://myanimelist.net/reviews.php?id=158067"
        },
        {
            "content": "D-Frag is a great example of an easy-watching anime comedy.\nA harem at heart, this show, without ever really doing anything exceptional, ticks so many boxes. The poster character of the series, the diminutive Shibasaki Roka, is a delightful character, while the other characters all fill out clear roles in a cast sheet that would definitely score full-house on a ‘stereotypical high-school comedy characters’ bingo sheet.\nThe comedy is good, but this is mostly down to the sheer amount of jokes per episode. I believe D-Frag has a mantra that reads ‘If we put one-hundred small jokes in a 24-minute period, then logic dictates that some ofthem have to stick.’ Most of the jokes involve lead character Kazuma shouting at the girls, which gets annoying after a while, but there's not really a single episode that isn't funny.\\n\\n\nWhile appearing like 'just another comedy', D-Frag manages to play on stereotypes while also establishing its own brand of wacky high-schoolers. Very funny, very colourful, D-Frag is a solid high-school comedy that will fill that hole in your watchlist!",
            "date": "2018-01-31T07:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 270208,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6829196.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TAYLORtCC",
                "username": "TAYLORtCC"
            },
            "url": "https://myanimelist.net/reviews.php?id=270208"
        },
        {
            "content": "I LOVE D-FRAG! and I only gave it a 5 on Story because it literally doesn't have one but to me this is a PERFECT comedy series, This anime is one of my favorites not only in comedy but  anime overall. It did it's job which is make me laugh and feel good. If your a fan of comedy anime, then I highly recommend this show. The only disappointment I had was the fact that  it didn't have a second season.  And another plus is that this is one pf the few anime series that has a well done english dub. I'vewatched this series MULTIPLE times and after that I bought the Blu Ray so I can re-watch it whenever I want.",
            "date": "2017-04-15T11:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 245555,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5999032.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/dannywiseau",
                "username": "dannywiseau"
            },
            "url": "https://myanimelist.net/reviews.php?id=245555"
        }
    ]
]