[
    [
        {
            "content": "Upon finishing this series, I just had to make a review of it :D\r\n* Story *\r\nI must say, even for a shoujo title, this story has a lot of originality as well as taking advantage of the same old clich&eacute;s but with a twist. With Nabeshin as director, I couldn't expect any less, as he makes every episode hilarious! And it's nice to see the series has its serious and dramatic moments, and when you see them, you'll crave for more, seriously.\r\nSunako-chan is quite a character, and you'll love her from the getgo. She is a very special girl, and she suffered quite a lotfrom a mid-school drama. Be sure to pay attention to the series as this is revealed in the first episode and repeated a couple of times more, and it's the reason she locks herself to the world and considers everyone else a &quot;dazzling creature&quot;, even though she's really beautiful behind that odd and scary exterior.\\n\r\nShe doesn't have any confidence, and she constantly is having nosebleeds upon seeing beautiful people, so living in a house with 4 bishounen is not easy for her! Deep inside, she is very careful and fond of the people around her.\\n\r\nKyouhei is a very rude boy and food is what drives his mind, and you'll find him very obnoxious, until you begin to see his true self, and he doesn't show it clear, so you'll have to keep an eye to find out! He'll begin to care for Sunako-chan as he sees her true self.\\n\r\nThis is a comedy series, but it has its romantic touchs here and there, and of course some drama, but remember that comedy is what drives this series! So it's not your conventional shoujo.\\n\\n\r\n* Animation *\\n\\n\r\nMost likely a low budget was responsible of this: the animation was fair and dit the job, but could've been a lot better. The first opening video was made of recycled scenes from the first episode, and until eps. 14 we see a new opening video with original animation.\\n\r\nThe series over emphasizes the use of chibi-formed characters, specially with Sunako. Even though chibi = funny and it's always appreciated, I think they overdid it with Sunako-chan, as we get to see her true form a limited amount of times.\\n\\n\r\n* Sound *\\n\\n\r\nThe soundtrack was decent, and played along the theme of the series. The opening song was good, the first ending was passable, but the second ending theme (by BON-BON BLANCO) was very good.\\n\r\nThe seiyuus for the series were excellent and they did a wonderful job with their roles.\\n\\n\r\n* Enjoyment *\\n\\n\r\nA 10 withouth a doubt, you'll laugh a lot, and even shed a few tears from time to time!\\n\\n\r\n* Overall *\\n\\n\r\nYamato Nadeshiko Shichi Henge was a pleasant adventure from the start, and it's loaded with entertainment and fun, with hints of romance and even some drama. And if you happen to be a fan of Nabeshin (Shinichi Watanabe) then you're in for a treat.\\n\r\nI'd like to see a second season of the series, though, as the story continues. With the manga still running, it's a possibility we'll get to see more of Sunako-chan and the boys sometime!\\n\\n\r\n8/10 -- Very Good!",
            "date": "2008-01-01T18:17:00+00:00",
            "helpful_count": 167,
            "mal_id": 1793,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21318.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shido_Tatsuhiko",
                "username": "Shido_Tatsuhiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=1793"
        },
        {
            "content": "Ater taking nearly 4 months to complete, this show finally got the last episode subtitled. So, what were my thoughts?\r\nStory\r\nThe story started off great. Four guys need money to pay rent, so their landlord asks them to \"turn this crazy girl into an actual lady\". Eh, not an amazing story, but sounds funny. I'd probably have given it more than a 6 if it actually went anywhere. But, it didn't really progress, nor did we get to see much happen from the start until the end.\r\nArt\r\nPrepare to be swamped by constant chibi characters. Odd models and bland scenes..the art is something to be desired.\r\nSound\r\nNothing special.The opening and ending didn't stand out to me, nor did any background music. Could have been a lot better.\\n\\n\r\nCharacter\\n\r\nThe saving grace for this show. Without the male lead and the female lead, this anime would have sucked. I enjoyed learning a little bit about each character's past. I wouldn't say any character really evolves though, as they're pretty much static throughout. I guess the female lead changes a bit (doesn't she have to?).\\n\\n\r\nEnjoyment\\n\r\nFunny, happy, I had a good time watching this. There are tons of \"worthless\" episodes that don't progress the flow of the story at all, but whatever.\\n\\n\r\nOverall\\n\r\nIf you're looking for a brainless anime that will make you chuckle every so often, check this out. There's better out there though.",
            "date": "2007-07-27T14:08:00+00:00",
            "helpful_count": 121,
            "mal_id": 612,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=612"
        },
        {
            "content": "I thought that the story was actually quite original. At first I thought that it would be your usual story. They try to change her and then they fall in love and then love rivals appear and some comedy  is thrown in but that didn't happen in the slightest, which I thought was quite refreshing. I do wish that focused a little bit more on the relationships with each other, especially Sunako (Main Character).\r\nSome people may not like the artwork but I thought that it went quite well with all of the characters  personalities and I also really liked the way that theychanged their style of artwork depending what was happening (or going to happen), and it makes it alot more funny and entertaining.\\n\\n\r\nThe sound was good, in the beginning I didn't like the opening song but it grew on me during the series and it fitted to the anime perfectly. I didn't like the first ending song but I liked the second song because it was a contrast to the opening.\\n\\n\r\nI liked the characters because usually when you have bishounen and bishoujo in an anime they usually are totally oblivious to it or they use it to their advantage. None of that happened here (except for one character). I must say some characters were a bit annoying and you may want to slap some of them. This anime is partly interesting because it shows that all of them are actually suffering from being so good looking, which is very different. It shows a different point of view of being a good looking person.\\n\\n\r\nI thought that it was really funny and that was a surprise to me because I thought it would not be a very normal emotional story but it was nothing like that. I thoroughly enjoyed each episode because something outrageous alwayse happened in each one.\\n\\n\r\nOverall I give it a 7/10 because it was really entertaining and a good watch although I wished a bit more happened between the characters and I was personally disappointed with the ending episode. I hope there is a second season!",
            "date": "2007-08-27T06:26:00+00:00",
            "helpful_count": 87,
            "mal_id": 768,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5767.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sarcastic",
                "username": "Sarcastic"
            },
            "url": "https://myanimelist.net/reviews.php?id=768"
        },
        {
            "content": "Watching Yamato is like dating a someone (guy or girl) who looks like Borat in a mini-skirt. Prolonged exposure could leave you with a desire to gouge your eyes out, though on the plus side, you'll enjoy Yamato's hidden charm a lot more once yours eyes are bloody pulps on the floor.\r\nNormally, art is a minor detail for me, but the atrocious art in Yamato cannot be ignored. While there is a lot to blame, the bland backgrounds, the sub-par animation, the dreary colors, and the overly constant use of chibi characters, one particular feature completely stands out.\r\nThe four main male leads are supposeto be some of the hottest men on the planet, and yet half of them make Golum look like a stunner. While I understand the typical trend of attending feminine characteristics to male leads in shoujo shows, and many shows like Host Club does it well, Yamato has taken the trend to its utterly grotesque extreme. \\n\\n\r\nToyama and Ranmaru come across as grotesque drag-queens who've spent the last 48 hours covering their eyes with dark eye-liner.It is hard to imagine how anyone could find such characters attractive. Every girl who showed Toyama to so far has shook her head in disdain, and every guy had a pulsing sensation hurl my notebook off the 5th floor balcony.\\n\\n\r\nThis is  a real pity, given that animation aside, Yamato has potential. While there was little plot development, each character has some depth, and there are some scenes that can draw genuine laughs. The story itself also holds unique premise, telling the tale of a girl who dresses and behaves hideously, and four guys who try to make her realize her own hidden beauty and become a lady. It's just too bad that you don't tend to laugh very much when you feel like someone's sticking hot pokers in your eyes. \\n\\n\r\nIn the end, Yamato is an above average shoujo comedy, save for its abysmal visual design. Perhaps the creators were trying to make a deep metaphor between the anime and the main female lead. Alas, they would probably be better off redoing the anime in Flash with each male character replaced by a color coded stick figure. At least that way the comedy would come through, without the visual torture.\\n\\n\\n\\n\\n\\n",
            "date": "2008-12-31T07:53:00+00:00",
            "helpful_count": 39,
            "mal_id": 10855,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 2,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=10855"
        },
        {
            "content": "This anime's selling point is comedy, comedy, and comedy. At first glance, the male characters aren't as appealing to look at, unlike say, ouran host club. They all seem to be wearing too much eyelashes and lipstick. Kyohei is the best looking of the four, I daresay. As for the story, its a typical laugh-in-you-face theme, with hilarious situations like nose bleeds and excessive addiction to anything horror and blood related stuffs. Sunako's protrayal of a reclusive, horror-blood-splatter-loving female who gets nosebleeds whenever she sees anyone beautiful is hilarious, as well as the  silly romantic escapades of her aunt in the series. There isan underlying depth to this series, especially with issues on accepting oneself and seeing past another's physical appearance. The ending's a bit lacking, since after being glued to sunako's and kyouhei's budding closeness one kinda hopes to see them become a couple. All in all, if you're looking for a good pick-me-up anime this one is definitely a must-see.",
            "date": "2008-01-24T01:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 2134,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33038.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zeru02",
                "username": "zeru02"
            },
            "url": "https://myanimelist.net/reviews.php?id=2134"
        },
        {
            "content": "I think it's always good to read a poor review for any anime. It doesn't reflect the opinions of everyone, but it's good to add a little perspective to the rest.\r\nStory: 8/10\r\nI actually watched this as a live action before I watched the anime and the premise is wonderful. Screw cliches --the heroine is to shoujo as a carrot is to bicycle. Ie. She defies almost every shoujo cliche and I love it!\r\nArt: 3/10\r\nI'm sorry. I love the story, but the art really put me off. I just don't like men with full lips and girly eyes. Nope. Can't help it. I like them tolook at least a little bit like men. When they look as pretty as a girl, I just throw up a little.But the colouring and the heroine's appearance is fantastic --hence the 3, not a 0.\\n\\n\r\nSound: 5/10\\n\r\nNormal, nothing spectacular.\\n\\n\r\nCharacter: 6/10\\n\r\nSave for the male lead and the heroine, not much can be said really.\\n\\n\r\nEnjoyment: 3/10\\n\r\nI couldn't get past the women --ie. the men.\\n\\n\r\nOverall: 4/10\\n\\n\r\nI didn't like it. It wasn't my cup of tea. BUT, it might be yours. \\n\\n",
            "date": "2011-02-23T04:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 34675,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheSakurax",
                "username": "TheSakurax"
            },
            "url": "https://myanimelist.net/reviews.php?id=34675"
        },
        {
            "content": "Having read the manga first, I can't help but compare the two. And, boy, does the anime score low. It's a classic case of good idea badly executed.\r\nFirst thing I noticed is the sloppy art. In the manga the boys are beautifully drawn; in the anime, the artists seem to run out of steam by the time they finish drawing Kyohei and Takenaga - Ranmaru often ends up looking like a drag queen and Yuki grotesquely cute. The backgrounds are so simplified they are almost nonexistent and the constant use of chibis is distracting and annoying after a while. The characters we get to knowfully are only Kyohei and Sunako, we get flashbacks of their earlier years and how they became who they are. \\n\\n\r\nThe story does not follow the manga copiously, which in itself takes away nothing from the anime, if anything, it makes it new and surprising for the manga fan like me.  However, I was almost taken aback by the &quot;perverse&quot; scenes - this is, after all, a story about boys so beautiful that no girl can help but throw herself at them - but while they were more suggestive and just hinted at in the manga, here, they are on vulgar display. One scene comes to mind, where 3 girls rub themselves on a mannequin thinking that it belongs to Kyohei. Although scenes like this one aren't many, it still left me with bad taste in my mouth. \\n\\n\r\nDespite its shortcomings, I did enjoy this series somewhat (maybe through sheer will power?). I suspect that if I hadn't been exposed to the manga first, my final score would have been higher. As it stands, I can only give it a 6.",
            "date": "2007-09-27T04:57:00+00:00",
            "helpful_count": 13,
            "mal_id": 932,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6636.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dollie_mixtures",
                "username": "dollie_mixtures"
            },
            "url": "https://myanimelist.net/reviews.php?id=932"
        },
        {
            "content": "I cant even begin to describe how awesome this series is. I just started the first episode just to fill in sometime, and the next thing you know if finished the series before dinner...on the same day.\r\nStory: Not new, similar to Nobuta wo Produce and lots of other shoujo animes some what. But what makes this unique is the humour. I mean GOD its so hilarious it's nearly unrivaled. Definately very unique.\r\nArt: I'm not really into this style art yet I lived through it. If your turning your back on this anime just because of the then DON'T. You will definately forget. The art issomewhat similar to Paradise Kiss, especially Sunako.\\n\\n\r\nSound: Not so into it, but reasonable. The voices are all fines exept for maybe Sunako when she at the otome mushrooms but fine by me. Not so into the opening either, but I can think of a million other songs I hate more.\\n\\n\r\nCharacter: Definatlely one of the most outstanding points of this anime. They are all so unique, from a guy who can only think about food, a dinosaur fossil loving guy who is always thinking about his girlfriend, and a horror movie, skull loving, nose-bleeding wierdo.\\n\\n\r\nEnjoyment? Let the marks speak for itself.\\n\\n\r\nOverall? JUST WATCH IT!!!\\n\\n\r\nThough, one thing I never did get is why Sunako is ugly, I mean, she has a pretty face and all (for this style of anime) yet she's still always called ugly. Oh well, there are many things in this world I don't get. (And no, it's not because I'm stupid)",
            "date": "2009-04-12T22:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 14096,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116275.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Japachinglish",
                "username": "Japachinglish"
            },
            "url": "https://myanimelist.net/reviews.php?id=14096"
        },
        {
            "content": "Warning: the review may contain spoilers\r\nStory\r\nThe storyline itself isn't very unique and original. In fact, it greatly reminds me of Kimi ni Todoke, but we are talking about Yamato Nadeshiko Shichihenge here. This anime is a story of a transformation, friendship and being true to oneself. There are many repetitive elements in each and every episode (eg. nosebleeds, Goth~ Goth~ Loli~ Loli~ etc.) and sometimes you want to punch Sunako or the Goth Loli Sisters in the face. Anyway, it's still enjoyable to watch the guys trying to convert hard-core goth into a lady.\r\nArt\r\nOnly five words: it is not a masterpiece. You can watch it,but sometimes characters are missing its perfection, because you can see how they (especially boys) are getting more and more so-so. Awry eyes, plain hair and other details that make you crazy. Poor color palette makes this anime dim like Sunako. But from time to time one or two impressive effects occur. \\n\\n\r\nSound\\n\r\n10 for the soundtrack. Opening and ending songs are wonderful. Remaining music is also very assorted. The only disappointing thing is a voice acting. Kyohei is a beautiful man but sometimes his voice is hard to listen. It's the only thing I can't be objective about. However, Sunako voice actor is versatile so you can hear many different voices for many different Sunako personality features. \"Average\" is for the rest of the characters.\\n\\n\r\nCharacter\\n\r\nThere are a few characters to choose your favorite from. Sunako is certainly the most interesting girl in the series. Boys are the same and different at the same time. They all have a particular back stories but share together a few things: beauty, humour and ladies. They are enjoyable to watch but not at the \"falling in love\" level.\\n\\n\r\nEnjoyment\\n\r\nThe series is one of those that you start to watch and want to finish, but not in one sitting. It's suitable for a rainy days and peaceful evenings at home. Sometimes it makes you laugh and sometimes not. \\n\\n\r\nOverall\\n\r\nIt's a great series for a romance lovers (though the story ends before things between Sunako and Kyohei start to heat up) and a terrible choice for a psychological genre fans. Some things you may find lovely and other not so much. But there are things to chose from.",
            "date": "2015-02-24T12:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 181134,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3841187.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeLiu",
                "username": "AnimeLiu"
            },
            "url": "https://myanimelist.net/reviews.php?id=181134"
        },
        {
            "content": "At first I wasn't too fond of the animation style but it has grown on me to an extent where now I can enjoy the show with no problem. Now I believe that the art is quite memorable.\r\nI liked the pacing of the anime and it never fails to amuse me. Kyohei is definitely my favourite character with Sunako a close second. I like how normal he is especially compared to the other boys. He hates the attention he receives because of his good looks and this really appealed to me as I felt the other three 'hotties' were somewhat egotistical although overall good people.\\n\r\nI like the opening theme \"Slow\", I feel that it really suits the show. \\n\r\nI like how Sunako is portrayed as beautiful although she doesn't realise it. I do feel like she reacts in a realistic manner because she was hurt before. I am not too fond of the loli goths who keep making appearances. \\n\r\nOverall, I do enjoy this anime and I would recommend it anyone whom loves reverse harem!",
            "date": "2014-05-19T15:00:00+00:00",
            "helpful_count": 9,
            "mal_id": 143831,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669187.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/quirkista",
                "username": "quirkista"
            },
            "url": "https://myanimelist.net/reviews.php?id=143831"
        },
        {
            "content": "What do you get when you have a romantic comedy with a girl that is gothic? Well, you may get a lot of things but you might not get something as wonderful as this. The show has a lot of things that make it fun and memorable. I was surprised that Watanabe (The one that made Excel Saga) actually had a hand in this one. \r\nWe get to the characters and I think in all fairness, we just have to start with Sanako. Sanako is a sad girl but it wasn’t her fault really. I know a couple people that sank like this when someonethey liked said they did not like them, maybe not as bad but still. I feel close to her because I have almost the same problem sometimes in where my confidence goes out the window and I feel like locking myself in my room. You can sometimes even feel her pain when you have been threw the same thing she does.\\n\\n\r\nNoi is almost the exact opposite of Sanako. She’s always caring about her looks to hopefully have Takenaga love her even more. The anime doesn’t show that they are going out but it does show that they are close. \\n\\n\r\nThe boys are all archie types of the type of guys girls like in anime. Takenaga is the traditional Japanese man who is quiet and gentle. He is smart and pretty much considered more ‘normal’ then the others. He’s very calm and never was bothered by Sanako’s crazy stuff. He grew up in a rather respected high class rich family but it doesn’t seem to affect him much.\\n\\n\r\nRanmaru is another rich boy but on the other side of the spectrum of Takenaga. He’s a ladies man and loves older women. He’s not tied down to one women and doesn’t want to be told what to do really. The thought of someone like Sanako made his skin crawl but after seeing how she looks dressed up, he thought twice.\\n\\n\r\nNot much is talked about for Yuki. In the anime sadly, he doesn’t have much story line except for knowing that he comes from a normal family that isn’t rich. He’s the cutesy girlish face and most of the time, he is dressed up in girl clothing even though he just wants to be like the other boys. Unfortunately, he acts like a child most of the time and whines a lot making me unable to like his voice sometimes.\\n\\n\r\nLastly is Kyohei. He is the relative bad boy, always getting into fights and trouble. He can never keep a job because his bosses weather male or female sexually harass him leaving him with a short-temper. He is a real pretty boy even if he doesn’t try to take care of himself and his hair is always messy. Out of all the men in this show, I think he is the best to be with Sanako because he has gone threw the opposite of her and that they both work so well together. \\n\\n\r\nThe style of art looks much like a version of gothic Bishonen or beautiful men design. The eyes are highly eye-lashed and makes them look almost more like girls. The style is really clean and crisp and they don’t normally cut the design budget without adding a little bit to the show. Most of the time, it’s just to add more to a joke that is happening though they have a strange style for getting out of drawing millions of people in a mob scene. \\n\\n\r\nThe Vocals are elegant mostly, both Japanese and English have the right idea’s in how the voices should sound to me though I believe the English voice of Takenaga tried a little to hard to make his voice a few too many octaves higher then it should when his character got to emotional. It’s sort of funny because this is the voice of Tamaki from Ouran High and Edward Elric from Fullmetal Alchemist. Yes, I’m talking Vic Mignogna and sadly, this was not one of his best performances. Some of the jokes didn’t translate right when they did the dub and so they tried to force the English words to work and it seemed out of it.",
            "date": "2012-06-20T09:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 63917,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=63917"
        },
        {
            "content": "By far one of my favorite series.  It's a shame it's been since 2007 and they haven't continued the series, maybe if more of the manga is developed?\r\nThis is an oddly hilarious yet sweet drama.  There was even a live action series made of it.  Sunako is just impossible not to fall in love with, while most men paw towards the men she live with, she wants nothing more than to have them cast in the dark or even dead.  The man who is slowly falling in love with her Kyohei.  You can even see the changing developments with Ranmaru,Takenaga (as conservative as he is) and the wonderful Yuki!!!!\\n\\n\r\nIt's gothically/delightfully hilarious!!!  The opening and ending music too is pure bliss (The artist is even based off of a certain character hehe).",
            "date": "2010-04-06T18:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 24764,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313263.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokyoKisses",
                "username": "TokyoKisses"
            },
            "url": "https://myanimelist.net/reviews.php?id=24764"
        },
        {
            "content": "This show had a great story line and plot, actually i don't even know if there was a story line.\r\nI only saw about 5 episodes including the first episode, some middle eps and the last episode.\r\nThat's all i really needed to see. There was no character development throughout.\r\nThis show would have been fantastic IF Sunako, the lead girl, wasn't so unbearably annoying. Sure the nosebleeds were funny in the first couple of episodes, but it just got tiring. \r\nIn the first episode, they drew Sunako as a normal character, but every episode after that, Sunako was depicted as a Chibi character which made it feelas if she was a little girl. I get they want her to seem \"ugly\", but the chibi take on it was not the right approach.\\n\r\nSunako has an \"ugly\" interest, which is dark depressing things. It was great that she was different, but the writers took this a little too far. They made her obsessively creepy, which made it hard to relate to her. In the end she was just plain annoying.\\n\\n\r\nThe other characters were great and fun to watch. \\n\\n\r\nOverall, this anime was a good idea, but i feel the writers did not do their best.\\n\\n\r\nI tried to watch the English dub, Wallflower, at first. I had to switch over to the English sub though, because it seemed like all the characters were yelling in the English dub.\\n\\n\r\nI fell in love with the four main male characters and Noi, but simply ended up not liking the show itself because of Sunako.",
            "date": "2011-06-19T21:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 38057,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/500967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miseriway",
                "username": "miseriway"
            },
            "url": "https://myanimelist.net/reviews.php?id=38057"
        },
        {
            "content": "I liked the principal of this story line because it is such a simple idea and yet it is portrayed well. I thought that this anime was really enjoyable and it worked well considering that there is no real depth to the storyline. \r\nThe art was variable - at times it was irritating to see sunako in chibi form when in actual fact she was beautiful. However, i think that this was sometimes beneficial to the plot  - we saw the beautiful sunako when she was defending her friends which was the pretty side of her. \r\nI didn't really like the music that accompaniedthis anime and nothing really stood out - in other words the songs have not been added to my itunes. \\n\\n\r\nI thought the characters were interesting, but not enough happen between kyohei and sunako for me to be satisfied with the show - i thought they could have done a bit more considering that the show finished airing\\n\\n\r\nFinally, i found that this is thouroughly enjoyable and i would recommend it - it is a funny show that shouldn't be taken seriously and i found it fun to watch. =]",
            "date": "2008-09-07T13:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 7767,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92752.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TLM91",
                "username": "TLM91"
            },
            "url": "https://myanimelist.net/reviews.php?id=7767"
        },
        {
            "content": "Dear fellow Anime lovers,\r\nI really enjoyed this anime, it was so refreshingly funny! I do not think I have seen an anime as funny since Great Teacher Onizuka. I thought the story was OK but its the type of anime you need to watch when things in life are a little depressing or bleak, or in an economic downturn, with political revolutions, earthquakes in Japan etc - this is the perfect thing to watch to put a SMILE to your face. Every episode leaves you laughing and smiling to yourself. Its really upbeat and the jokes and animation together make the experience all the morericher.\\n\\n\r\nI would like to add that I really enjoyed the music, I am a BIG anime soundtrack collector, and I loved the music for this anime! Unfortunately I cannot find it anywhere on the internet. (Aside from the opening and ending theme tunes)\\n\\n\r\nIf you would like to know what music I am referring to - one track in particular, it features quite a lot during the anime, but if you go to episode 25 (the final ep) and from 6.51 to 7.27 there is a song in the background, and from 7.19 the violins are really amazing...! I love the music and am really hunting for the full track. \\n\\n\r\nIf any of you have any idea where I might find this music I would greatly appreciate your thoughts! :)\\n\\n\r\nThis was a refreshingly HILARIOUS anime overall, am glad I watched it! \\n\\n\r\nIf you like this you will also like Kimi No Todoke - incidentally also has very good soundtrack behind it.\\n\\n\r\nGod bless.\\n\\n\r\nNightray.",
            "date": "2011-03-23T17:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 35301,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nightray8",
                "username": "Nightray8"
            },
            "url": "https://myanimelist.net/reviews.php?id=35301"
        },
        {
            "content": "A story of a very weird girl named Sunako Nakahara. Not you're ordinary 15 year old girl who loves to look at themselves at the mirror, concious of becoming fat, pimples..etc.. Instead, she has anatomical manequins fetish (they actually have names), her room was filled with preserved organs, disected frogs, skulls, a horror movie addict (she can eat in front of very gross movie), her curtains were black.. She can't stand the bright lights. Now, how can she ever survive in the presence of four \"radiant beings\"? She really has a low self-steem after a boy from their middle school told her she was ugly.And now her auntie bound her to live with 4 very handsome men which she can't stand to look at (she nosebleed when she's looking at beautiful things or person). Her auntie also asked the 4 guys to make her a lady and their rent will be FREE! But if NOT, it will be tripled. Will they make it or will they surrender? It was a very HILARIOUS anime, everyone will enjoy this!",
            "date": "2008-09-10T07:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 7834,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91674.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/red_888",
                "username": "red_888"
            },
            "url": "https://myanimelist.net/reviews.php?id=7834"
        },
        {
            "content": "I Actually quite liked it , One of the only animes i've seen with such dark sense of humor  ,  And since i feel slightly connected to the main charecter , i found it funny on the way she reacts on some parts of the animes .\r\nOne thing that quite disturbed me is the guy's , sometimes they overdid the ''female type guys'' .\r\nAnimation in this anime wasnt a big thing , but no one need a good animation in comedy anime .\r\nThe faced they did was perfect in so many Comedy Moments , specially the Main charecter and when she went ''Chibimode'' and acted like a child to avoid stuff .\\n\\n\\n\r\nIn general , i recommend this anime for people that want to laugh from dark sense of humor and for people who wants to take a break from heavy type animes and just relax .\\n\\n\r\nAllthough, by the end of the anime the jokes got kinda old ..but it's still great",
            "date": "2008-05-29T02:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 5088,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12449.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NerZul",
                "username": "NerZul"
            },
            "url": "https://myanimelist.net/reviews.php?id=5088"
        },
        {
            "content": "Best anime ever! Sunako-chan is so cute (however she thinks she is so much ugly). She have to live with amazing nice looking guys which have to help her to become beautiful lady. However Sunako-chan likes dark and scary sceneries (she lives with skeleton which has his own name). Sunako-chan cannot hate beauty of her amazing looking new friends and whenever she looks up at these young guys, she loose her blood from nose ^^ This anime is really funny, and characters are really amazing!\r\nPS: at the end of each episode is a lot interesting tips :D",
            "date": "2015-04-26T13:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 186521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575341.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shiruuia",
                "username": "shiruuia"
            },
            "url": "https://myanimelist.net/reviews.php?id=186521"
        },
        {
            "content": "This is going to be quite a short review since there are a lot of others who describe the story characters ect. I just wanted to share my view on this series. \r\nI love comedy and I saw someone recommend this one on some site. So i decide to put in in my list. It took me quite a while before I actually started to watch it. Mainly because I thought is was pretty old. But last month I decide to give it a shot. First impression. How the hell am I going to get used to the artwork? Because yeah its pretty bad. Thecharacters look like a bunch of girls drawn in a weird way. It almost made me drop the series instantly, but like every series I decide to give it a shot of at least one episode. Well, it was fun. Not hilarious but enough for me to want to see the next episode. So also with the second.. the 3rd... It took me a couple of episodes to get used to the artwork, but im so glad I stuck with it. This is a great great series. Even though the first couple of episodes were kind of overshadowed by the weird artwork making them less funny than they actually were meant to be. But every episode made me still curious for the next one. And after getting used to the way the characters are drawn lets say I found it hilarious! I laughed to much that even my bf was wondering what I was watching. He joined me one episode, of course first thing he said was \" they guys look like a bunch of girls!\" yeah yeah I know. Just try to look past that. Well he also loved it. \\n\\n\r\nI can understand that people have problems with the artwork, but trust me if you give yourself the chance to get used to it, you end up watching a very funny series with great characters because I think the characters are awesome! I loved them all, but most of all Sunako and Kyohei.  Their interaction is hilarious!\\n\\n\r\nWell as you can hear, I love this series and Im very glad I gave it a chance. \\n\\n",
            "date": "2018-10-23T01:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 292377,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4096351.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caranda",
                "username": "Caranda"
            },
            "url": "https://myanimelist.net/reviews.php?id=292377"
        },
        {
            "content": "\"The Wallflower\"\r\nI think this anime is best described as 'a hidden gem'.\r\nThere really isn't anything too spectacular about this anime. I still think it is worth watching.\r\nThe story line is kind of plain. Yet humor is still prominent in it. \r\nThe art is obviously an older style but modern for the time it was made. \r\nThe sound is fine.\r\nCharacters are 'unique'. \r\nI enjoyed this anime a lot and feel like the message portrayed is to not pretend to be something you are not. You can be beautiful in your own way as long as you stay true to you. Sometimes you need to be remindedof that so I appreciate the bigger message for such an obscure anime.",
            "date": "2018-09-22T12:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 289692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6390396.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aubreyaylaine",
                "username": "aubreyaylaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=289692"
        }
    ],
    [
        {
            "content": "Upon finishing this series, I just had to make a review of it :D\r\n* Story *\r\nI must say, even for a shoujo title, this story has a lot of originality as well as taking advantage of the same old clich&eacute;s but with a twist. With Nabeshin as director, I couldn't expect any less, as he makes every episode hilarious! And it's nice to see the series has its serious and dramatic moments, and when you see them, you'll crave for more, seriously.\r\nSunako-chan is quite a character, and you'll love her from the getgo. She is a very special girl, and she suffered quite a lotfrom a mid-school drama. Be sure to pay attention to the series as this is revealed in the first episode and repeated a couple of times more, and it's the reason she locks herself to the world and considers everyone else a &quot;dazzling creature&quot;, even though she's really beautiful behind that odd and scary exterior.\\n\r\nShe doesn't have any confidence, and she constantly is having nosebleeds upon seeing beautiful people, so living in a house with 4 bishounen is not easy for her! Deep inside, she is very careful and fond of the people around her.\\n\r\nKyouhei is a very rude boy and food is what drives his mind, and you'll find him very obnoxious, until you begin to see his true self, and he doesn't show it clear, so you'll have to keep an eye to find out! He'll begin to care for Sunako-chan as he sees her true self.\\n\r\nThis is a comedy series, but it has its romantic touchs here and there, and of course some drama, but remember that comedy is what drives this series! So it's not your conventional shoujo.\\n\\n\r\n* Animation *\\n\\n\r\nMost likely a low budget was responsible of this: the animation was fair and dit the job, but could've been a lot better. The first opening video was made of recycled scenes from the first episode, and until eps. 14 we see a new opening video with original animation.\\n\r\nThe series over emphasizes the use of chibi-formed characters, specially with Sunako. Even though chibi = funny and it's always appreciated, I think they overdid it with Sunako-chan, as we get to see her true form a limited amount of times.\\n\\n\r\n* Sound *\\n\\n\r\nThe soundtrack was decent, and played along the theme of the series. The opening song was good, the first ending was passable, but the second ending theme (by BON-BON BLANCO) was very good.\\n\r\nThe seiyuus for the series were excellent and they did a wonderful job with their roles.\\n\\n\r\n* Enjoyment *\\n\\n\r\nA 10 withouth a doubt, you'll laugh a lot, and even shed a few tears from time to time!\\n\\n\r\n* Overall *\\n\\n\r\nYamato Nadeshiko Shichi Henge was a pleasant adventure from the start, and it's loaded with entertainment and fun, with hints of romance and even some drama. And if you happen to be a fan of Nabeshin (Shinichi Watanabe) then you're in for a treat.\\n\r\nI'd like to see a second season of the series, though, as the story continues. With the manga still running, it's a possibility we'll get to see more of Sunako-chan and the boys sometime!\\n\\n\r\n8/10 -- Very Good!",
            "date": "2008-01-01T18:17:00+00:00",
            "helpful_count": 167,
            "mal_id": 1793,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21318.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shido_Tatsuhiko",
                "username": "Shido_Tatsuhiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=1793"
        },
        {
            "content": "Ater taking nearly 4 months to complete, this show finally got the last episode subtitled. So, what were my thoughts?\r\nStory\r\nThe story started off great. Four guys need money to pay rent, so their landlord asks them to \"turn this crazy girl into an actual lady\". Eh, not an amazing story, but sounds funny. I'd probably have given it more than a 6 if it actually went anywhere. But, it didn't really progress, nor did we get to see much happen from the start until the end.\r\nArt\r\nPrepare to be swamped by constant chibi characters. Odd models and bland scenes..the art is something to be desired.\r\nSound\r\nNothing special.The opening and ending didn't stand out to me, nor did any background music. Could have been a lot better.\\n\\n\r\nCharacter\\n\r\nThe saving grace for this show. Without the male lead and the female lead, this anime would have sucked. I enjoyed learning a little bit about each character's past. I wouldn't say any character really evolves though, as they're pretty much static throughout. I guess the female lead changes a bit (doesn't she have to?).\\n\\n\r\nEnjoyment\\n\r\nFunny, happy, I had a good time watching this. There are tons of \"worthless\" episodes that don't progress the flow of the story at all, but whatever.\\n\\n\r\nOverall\\n\r\nIf you're looking for a brainless anime that will make you chuckle every so often, check this out. There's better out there though.",
            "date": "2007-07-27T14:08:00+00:00",
            "helpful_count": 121,
            "mal_id": 612,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=612"
        },
        {
            "content": "I thought that the story was actually quite original. At first I thought that it would be your usual story. They try to change her and then they fall in love and then love rivals appear and some comedy  is thrown in but that didn't happen in the slightest, which I thought was quite refreshing. I do wish that focused a little bit more on the relationships with each other, especially Sunako (Main Character).\r\nSome people may not like the artwork but I thought that it went quite well with all of the characters  personalities and I also really liked the way that theychanged their style of artwork depending what was happening (or going to happen), and it makes it alot more funny and entertaining.\\n\\n\r\nThe sound was good, in the beginning I didn't like the opening song but it grew on me during the series and it fitted to the anime perfectly. I didn't like the first ending song but I liked the second song because it was a contrast to the opening.\\n\\n\r\nI liked the characters because usually when you have bishounen and bishoujo in an anime they usually are totally oblivious to it or they use it to their advantage. None of that happened here (except for one character). I must say some characters were a bit annoying and you may want to slap some of them. This anime is partly interesting because it shows that all of them are actually suffering from being so good looking, which is very different. It shows a different point of view of being a good looking person.\\n\\n\r\nI thought that it was really funny and that was a surprise to me because I thought it would not be a very normal emotional story but it was nothing like that. I thoroughly enjoyed each episode because something outrageous alwayse happened in each one.\\n\\n\r\nOverall I give it a 7/10 because it was really entertaining and a good watch although I wished a bit more happened between the characters and I was personally disappointed with the ending episode. I hope there is a second season!",
            "date": "2007-08-27T06:26:00+00:00",
            "helpful_count": 87,
            "mal_id": 768,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5767.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sarcastic",
                "username": "Sarcastic"
            },
            "url": "https://myanimelist.net/reviews.php?id=768"
        },
        {
            "content": "Watching Yamato is like dating a someone (guy or girl) who looks like Borat in a mini-skirt. Prolonged exposure could leave you with a desire to gouge your eyes out, though on the plus side, you'll enjoy Yamato's hidden charm a lot more once yours eyes are bloody pulps on the floor.\r\nNormally, art is a minor detail for me, but the atrocious art in Yamato cannot be ignored. While there is a lot to blame, the bland backgrounds, the sub-par animation, the dreary colors, and the overly constant use of chibi characters, one particular feature completely stands out.\r\nThe four main male leads are supposeto be some of the hottest men on the planet, and yet half of them make Golum look like a stunner. While I understand the typical trend of attending feminine characteristics to male leads in shoujo shows, and many shows like Host Club does it well, Yamato has taken the trend to its utterly grotesque extreme. \\n\\n\r\nToyama and Ranmaru come across as grotesque drag-queens who've spent the last 48 hours covering their eyes with dark eye-liner.It is hard to imagine how anyone could find such characters attractive. Every girl who showed Toyama to so far has shook her head in disdain, and every guy had a pulsing sensation hurl my notebook off the 5th floor balcony.\\n\\n\r\nThis is  a real pity, given that animation aside, Yamato has potential. While there was little plot development, each character has some depth, and there are some scenes that can draw genuine laughs. The story itself also holds unique premise, telling the tale of a girl who dresses and behaves hideously, and four guys who try to make her realize her own hidden beauty and become a lady. It's just too bad that you don't tend to laugh very much when you feel like someone's sticking hot pokers in your eyes. \\n\\n\r\nIn the end, Yamato is an above average shoujo comedy, save for its abysmal visual design. Perhaps the creators were trying to make a deep metaphor between the anime and the main female lead. Alas, they would probably be better off redoing the anime in Flash with each male character replaced by a color coded stick figure. At least that way the comedy would come through, without the visual torture.\\n\\n\\n\\n\\n\\n",
            "date": "2008-12-31T07:53:00+00:00",
            "helpful_count": 39,
            "mal_id": 10855,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 2,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=10855"
        },
        {
            "content": "This anime's selling point is comedy, comedy, and comedy. At first glance, the male characters aren't as appealing to look at, unlike say, ouran host club. They all seem to be wearing too much eyelashes and lipstick. Kyohei is the best looking of the four, I daresay. As for the story, its a typical laugh-in-you-face theme, with hilarious situations like nose bleeds and excessive addiction to anything horror and blood related stuffs. Sunako's protrayal of a reclusive, horror-blood-splatter-loving female who gets nosebleeds whenever she sees anyone beautiful is hilarious, as well as the  silly romantic escapades of her aunt in the series. There isan underlying depth to this series, especially with issues on accepting oneself and seeing past another's physical appearance. The ending's a bit lacking, since after being glued to sunako's and kyouhei's budding closeness one kinda hopes to see them become a couple. All in all, if you're looking for a good pick-me-up anime this one is definitely a must-see.",
            "date": "2008-01-24T01:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 2134,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33038.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zeru02",
                "username": "zeru02"
            },
            "url": "https://myanimelist.net/reviews.php?id=2134"
        },
        {
            "content": "I think it's always good to read a poor review for any anime. It doesn't reflect the opinions of everyone, but it's good to add a little perspective to the rest.\r\nStory: 8/10\r\nI actually watched this as a live action before I watched the anime and the premise is wonderful. Screw cliches --the heroine is to shoujo as a carrot is to bicycle. Ie. She defies almost every shoujo cliche and I love it!\r\nArt: 3/10\r\nI'm sorry. I love the story, but the art really put me off. I just don't like men with full lips and girly eyes. Nope. Can't help it. I like them tolook at least a little bit like men. When they look as pretty as a girl, I just throw up a little.But the colouring and the heroine's appearance is fantastic --hence the 3, not a 0.\\n\\n\r\nSound: 5/10\\n\r\nNormal, nothing spectacular.\\n\\n\r\nCharacter: 6/10\\n\r\nSave for the male lead and the heroine, not much can be said really.\\n\\n\r\nEnjoyment: 3/10\\n\r\nI couldn't get past the women --ie. the men.\\n\\n\r\nOverall: 4/10\\n\\n\r\nI didn't like it. It wasn't my cup of tea. BUT, it might be yours. \\n\\n",
            "date": "2011-02-23T04:45:00+00:00",
            "helpful_count": 21,
            "mal_id": 34675,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheSakurax",
                "username": "TheSakurax"
            },
            "url": "https://myanimelist.net/reviews.php?id=34675"
        },
        {
            "content": "Having read the manga first, I can't help but compare the two. And, boy, does the anime score low. It's a classic case of good idea badly executed.\r\nFirst thing I noticed is the sloppy art. In the manga the boys are beautifully drawn; in the anime, the artists seem to run out of steam by the time they finish drawing Kyohei and Takenaga - Ranmaru often ends up looking like a drag queen and Yuki grotesquely cute. The backgrounds are so simplified they are almost nonexistent and the constant use of chibis is distracting and annoying after a while. The characters we get to knowfully are only Kyohei and Sunako, we get flashbacks of their earlier years and how they became who they are. \\n\\n\r\nThe story does not follow the manga copiously, which in itself takes away nothing from the anime, if anything, it makes it new and surprising for the manga fan like me.  However, I was almost taken aback by the &quot;perverse&quot; scenes - this is, after all, a story about boys so beautiful that no girl can help but throw herself at them - but while they were more suggestive and just hinted at in the manga, here, they are on vulgar display. One scene comes to mind, where 3 girls rub themselves on a mannequin thinking that it belongs to Kyohei. Although scenes like this one aren't many, it still left me with bad taste in my mouth. \\n\\n\r\nDespite its shortcomings, I did enjoy this series somewhat (maybe through sheer will power?). I suspect that if I hadn't been exposed to the manga first, my final score would have been higher. As it stands, I can only give it a 6.",
            "date": "2007-09-27T04:57:00+00:00",
            "helpful_count": 13,
            "mal_id": 932,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6636.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dollie_mixtures",
                "username": "dollie_mixtures"
            },
            "url": "https://myanimelist.net/reviews.php?id=932"
        },
        {
            "content": "I cant even begin to describe how awesome this series is. I just started the first episode just to fill in sometime, and the next thing you know if finished the series before dinner...on the same day.\r\nStory: Not new, similar to Nobuta wo Produce and lots of other shoujo animes some what. But what makes this unique is the humour. I mean GOD its so hilarious it's nearly unrivaled. Definately very unique.\r\nArt: I'm not really into this style art yet I lived through it. If your turning your back on this anime just because of the then DON'T. You will definately forget. The art issomewhat similar to Paradise Kiss, especially Sunako.\\n\\n\r\nSound: Not so into it, but reasonable. The voices are all fines exept for maybe Sunako when she at the otome mushrooms but fine by me. Not so into the opening either, but I can think of a million other songs I hate more.\\n\\n\r\nCharacter: Definatlely one of the most outstanding points of this anime. They are all so unique, from a guy who can only think about food, a dinosaur fossil loving guy who is always thinking about his girlfriend, and a horror movie, skull loving, nose-bleeding wierdo.\\n\\n\r\nEnjoyment? Let the marks speak for itself.\\n\\n\r\nOverall? JUST WATCH IT!!!\\n\\n\r\nThough, one thing I never did get is why Sunako is ugly, I mean, she has a pretty face and all (for this style of anime) yet she's still always called ugly. Oh well, there are many things in this world I don't get. (And no, it's not because I'm stupid)",
            "date": "2009-04-12T22:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 14096,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116275.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Japachinglish",
                "username": "Japachinglish"
            },
            "url": "https://myanimelist.net/reviews.php?id=14096"
        },
        {
            "content": "Warning: the review may contain spoilers\r\nStory\r\nThe storyline itself isn't very unique and original. In fact, it greatly reminds me of Kimi ni Todoke, but we are talking about Yamato Nadeshiko Shichihenge here. This anime is a story of a transformation, friendship and being true to oneself. There are many repetitive elements in each and every episode (eg. nosebleeds, Goth~ Goth~ Loli~ Loli~ etc.) and sometimes you want to punch Sunako or the Goth Loli Sisters in the face. Anyway, it's still enjoyable to watch the guys trying to convert hard-core goth into a lady.\r\nArt\r\nOnly five words: it is not a masterpiece. You can watch it,but sometimes characters are missing its perfection, because you can see how they (especially boys) are getting more and more so-so. Awry eyes, plain hair and other details that make you crazy. Poor color palette makes this anime dim like Sunako. But from time to time one or two impressive effects occur. \\n\\n\r\nSound\\n\r\n10 for the soundtrack. Opening and ending songs are wonderful. Remaining music is also very assorted. The only disappointing thing is a voice acting. Kyohei is a beautiful man but sometimes his voice is hard to listen. It's the only thing I can't be objective about. However, Sunako voice actor is versatile so you can hear many different voices for many different Sunako personality features. \"Average\" is for the rest of the characters.\\n\\n\r\nCharacter\\n\r\nThere are a few characters to choose your favorite from. Sunako is certainly the most interesting girl in the series. Boys are the same and different at the same time. They all have a particular back stories but share together a few things: beauty, humour and ladies. They are enjoyable to watch but not at the \"falling in love\" level.\\n\\n\r\nEnjoyment\\n\r\nThe series is one of those that you start to watch and want to finish, but not in one sitting. It's suitable for a rainy days and peaceful evenings at home. Sometimes it makes you laugh and sometimes not. \\n\\n\r\nOverall\\n\r\nIt's a great series for a romance lovers (though the story ends before things between Sunako and Kyohei start to heat up) and a terrible choice for a psychological genre fans. Some things you may find lovely and other not so much. But there are things to chose from.",
            "date": "2015-02-24T12:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 181134,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3841187.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeLiu",
                "username": "AnimeLiu"
            },
            "url": "https://myanimelist.net/reviews.php?id=181134"
        },
        {
            "content": "At first I wasn't too fond of the animation style but it has grown on me to an extent where now I can enjoy the show with no problem. Now I believe that the art is quite memorable.\r\nI liked the pacing of the anime and it never fails to amuse me. Kyohei is definitely my favourite character with Sunako a close second. I like how normal he is especially compared to the other boys. He hates the attention he receives because of his good looks and this really appealed to me as I felt the other three 'hotties' were somewhat egotistical although overall good people.\\n\r\nI like the opening theme \"Slow\", I feel that it really suits the show. \\n\r\nI like how Sunako is portrayed as beautiful although she doesn't realise it. I do feel like she reacts in a realistic manner because she was hurt before. I am not too fond of the loli goths who keep making appearances. \\n\r\nOverall, I do enjoy this anime and I would recommend it anyone whom loves reverse harem!",
            "date": "2014-05-19T15:00:00+00:00",
            "helpful_count": 9,
            "mal_id": 143831,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669187.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/quirkista",
                "username": "quirkista"
            },
            "url": "https://myanimelist.net/reviews.php?id=143831"
        },
        {
            "content": "What do you get when you have a romantic comedy with a girl that is gothic? Well, you may get a lot of things but you might not get something as wonderful as this. The show has a lot of things that make it fun and memorable. I was surprised that Watanabe (The one that made Excel Saga) actually had a hand in this one. \r\nWe get to the characters and I think in all fairness, we just have to start with Sanako. Sanako is a sad girl but it wasn’t her fault really. I know a couple people that sank like this when someonethey liked said they did not like them, maybe not as bad but still. I feel close to her because I have almost the same problem sometimes in where my confidence goes out the window and I feel like locking myself in my room. You can sometimes even feel her pain when you have been threw the same thing she does.\\n\\n\r\nNoi is almost the exact opposite of Sanako. She’s always caring about her looks to hopefully have Takenaga love her even more. The anime doesn’t show that they are going out but it does show that they are close. \\n\\n\r\nThe boys are all archie types of the type of guys girls like in anime. Takenaga is the traditional Japanese man who is quiet and gentle. He is smart and pretty much considered more ‘normal’ then the others. He’s very calm and never was bothered by Sanako’s crazy stuff. He grew up in a rather respected high class rich family but it doesn’t seem to affect him much.\\n\\n\r\nRanmaru is another rich boy but on the other side of the spectrum of Takenaga. He’s a ladies man and loves older women. He’s not tied down to one women and doesn’t want to be told what to do really. The thought of someone like Sanako made his skin crawl but after seeing how she looks dressed up, he thought twice.\\n\\n\r\nNot much is talked about for Yuki. In the anime sadly, he doesn’t have much story line except for knowing that he comes from a normal family that isn’t rich. He’s the cutesy girlish face and most of the time, he is dressed up in girl clothing even though he just wants to be like the other boys. Unfortunately, he acts like a child most of the time and whines a lot making me unable to like his voice sometimes.\\n\\n\r\nLastly is Kyohei. He is the relative bad boy, always getting into fights and trouble. He can never keep a job because his bosses weather male or female sexually harass him leaving him with a short-temper. He is a real pretty boy even if he doesn’t try to take care of himself and his hair is always messy. Out of all the men in this show, I think he is the best to be with Sanako because he has gone threw the opposite of her and that they both work so well together. \\n\\n\r\nThe style of art looks much like a version of gothic Bishonen or beautiful men design. The eyes are highly eye-lashed and makes them look almost more like girls. The style is really clean and crisp and they don’t normally cut the design budget without adding a little bit to the show. Most of the time, it’s just to add more to a joke that is happening though they have a strange style for getting out of drawing millions of people in a mob scene. \\n\\n\r\nThe Vocals are elegant mostly, both Japanese and English have the right idea’s in how the voices should sound to me though I believe the English voice of Takenaga tried a little to hard to make his voice a few too many octaves higher then it should when his character got to emotional. It’s sort of funny because this is the voice of Tamaki from Ouran High and Edward Elric from Fullmetal Alchemist. Yes, I’m talking Vic Mignogna and sadly, this was not one of his best performances. Some of the jokes didn’t translate right when they did the dub and so they tried to force the English words to work and it seemed out of it.",
            "date": "2012-06-20T09:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 63917,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=63917"
        },
        {
            "content": "By far one of my favorite series.  It's a shame it's been since 2007 and they haven't continued the series, maybe if more of the manga is developed?\r\nThis is an oddly hilarious yet sweet drama.  There was even a live action series made of it.  Sunako is just impossible not to fall in love with, while most men paw towards the men she live with, she wants nothing more than to have them cast in the dark or even dead.  The man who is slowly falling in love with her Kyohei.  You can even see the changing developments with Ranmaru,Takenaga (as conservative as he is) and the wonderful Yuki!!!!\\n\\n\r\nIt's gothically/delightfully hilarious!!!  The opening and ending music too is pure bliss (The artist is even based off of a certain character hehe).",
            "date": "2010-04-06T18:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 24764,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313263.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TokyoKisses",
                "username": "TokyoKisses"
            },
            "url": "https://myanimelist.net/reviews.php?id=24764"
        },
        {
            "content": "This show had a great story line and plot, actually i don't even know if there was a story line.\r\nI only saw about 5 episodes including the first episode, some middle eps and the last episode.\r\nThat's all i really needed to see. There was no character development throughout.\r\nThis show would have been fantastic IF Sunako, the lead girl, wasn't so unbearably annoying. Sure the nosebleeds were funny in the first couple of episodes, but it just got tiring. \r\nIn the first episode, they drew Sunako as a normal character, but every episode after that, Sunako was depicted as a Chibi character which made it feelas if she was a little girl. I get they want her to seem \"ugly\", but the chibi take on it was not the right approach.\\n\r\nSunako has an \"ugly\" interest, which is dark depressing things. It was great that she was different, but the writers took this a little too far. They made her obsessively creepy, which made it hard to relate to her. In the end she was just plain annoying.\\n\\n\r\nThe other characters were great and fun to watch. \\n\\n\r\nOverall, this anime was a good idea, but i feel the writers did not do their best.\\n\\n\r\nI tried to watch the English dub, Wallflower, at first. I had to switch over to the English sub though, because it seemed like all the characters were yelling in the English dub.\\n\\n\r\nI fell in love with the four main male characters and Noi, but simply ended up not liking the show itself because of Sunako.",
            "date": "2011-06-19T21:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 38057,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/500967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miseriway",
                "username": "miseriway"
            },
            "url": "https://myanimelist.net/reviews.php?id=38057"
        },
        {
            "content": "I liked the principal of this story line because it is such a simple idea and yet it is portrayed well. I thought that this anime was really enjoyable and it worked well considering that there is no real depth to the storyline. \r\nThe art was variable - at times it was irritating to see sunako in chibi form when in actual fact she was beautiful. However, i think that this was sometimes beneficial to the plot  - we saw the beautiful sunako when she was defending her friends which was the pretty side of her. \r\nI didn't really like the music that accompaniedthis anime and nothing really stood out - in other words the songs have not been added to my itunes. \\n\\n\r\nI thought the characters were interesting, but not enough happen between kyohei and sunako for me to be satisfied with the show - i thought they could have done a bit more considering that the show finished airing\\n\\n\r\nFinally, i found that this is thouroughly enjoyable and i would recommend it - it is a funny show that shouldn't be taken seriously and i found it fun to watch. =]",
            "date": "2008-09-07T13:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 7767,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92752.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TLM91",
                "username": "TLM91"
            },
            "url": "https://myanimelist.net/reviews.php?id=7767"
        },
        {
            "content": "Dear fellow Anime lovers,\r\nI really enjoyed this anime, it was so refreshingly funny! I do not think I have seen an anime as funny since Great Teacher Onizuka. I thought the story was OK but its the type of anime you need to watch when things in life are a little depressing or bleak, or in an economic downturn, with political revolutions, earthquakes in Japan etc - this is the perfect thing to watch to put a SMILE to your face. Every episode leaves you laughing and smiling to yourself. Its really upbeat and the jokes and animation together make the experience all the morericher.\\n\\n\r\nI would like to add that I really enjoyed the music, I am a BIG anime soundtrack collector, and I loved the music for this anime! Unfortunately I cannot find it anywhere on the internet. (Aside from the opening and ending theme tunes)\\n\\n\r\nIf you would like to know what music I am referring to - one track in particular, it features quite a lot during the anime, but if you go to episode 25 (the final ep) and from 6.51 to 7.27 there is a song in the background, and from 7.19 the violins are really amazing...! I love the music and am really hunting for the full track. \\n\\n\r\nIf any of you have any idea where I might find this music I would greatly appreciate your thoughts! :)\\n\\n\r\nThis was a refreshingly HILARIOUS anime overall, am glad I watched it! \\n\\n\r\nIf you like this you will also like Kimi No Todoke - incidentally also has very good soundtrack behind it.\\n\\n\r\nGod bless.\\n\\n\r\nNightray.",
            "date": "2011-03-23T17:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 35301,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nightray8",
                "username": "Nightray8"
            },
            "url": "https://myanimelist.net/reviews.php?id=35301"
        },
        {
            "content": "A story of a very weird girl named Sunako Nakahara. Not you're ordinary 15 year old girl who loves to look at themselves at the mirror, concious of becoming fat, pimples..etc.. Instead, she has anatomical manequins fetish (they actually have names), her room was filled with preserved organs, disected frogs, skulls, a horror movie addict (she can eat in front of very gross movie), her curtains were black.. She can't stand the bright lights. Now, how can she ever survive in the presence of four \"radiant beings\"? She really has a low self-steem after a boy from their middle school told her she was ugly.And now her auntie bound her to live with 4 very handsome men which she can't stand to look at (she nosebleed when she's looking at beautiful things or person). Her auntie also asked the 4 guys to make her a lady and their rent will be FREE! But if NOT, it will be tripled. Will they make it or will they surrender? It was a very HILARIOUS anime, everyone will enjoy this!",
            "date": "2008-09-10T07:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 7834,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91674.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/red_888",
                "username": "red_888"
            },
            "url": "https://myanimelist.net/reviews.php?id=7834"
        },
        {
            "content": "I Actually quite liked it , One of the only animes i've seen with such dark sense of humor  ,  And since i feel slightly connected to the main charecter , i found it funny on the way she reacts on some parts of the animes .\r\nOne thing that quite disturbed me is the guy's , sometimes they overdid the ''female type guys'' .\r\nAnimation in this anime wasnt a big thing , but no one need a good animation in comedy anime .\r\nThe faced they did was perfect in so many Comedy Moments , specially the Main charecter and when she went ''Chibimode'' and acted like a child to avoid stuff .\\n\\n\\n\r\nIn general , i recommend this anime for people that want to laugh from dark sense of humor and for people who wants to take a break from heavy type animes and just relax .\\n\\n\r\nAllthough, by the end of the anime the jokes got kinda old ..but it's still great",
            "date": "2008-05-29T02:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 5088,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12449.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NerZul",
                "username": "NerZul"
            },
            "url": "https://myanimelist.net/reviews.php?id=5088"
        },
        {
            "content": "Best anime ever! Sunako-chan is so cute (however she thinks she is so much ugly). She have to live with amazing nice looking guys which have to help her to become beautiful lady. However Sunako-chan likes dark and scary sceneries (she lives with skeleton which has his own name). Sunako-chan cannot hate beauty of her amazing looking new friends and whenever she looks up at these young guys, she loose her blood from nose ^^ This anime is really funny, and characters are really amazing!\r\nPS: at the end of each episode is a lot interesting tips :D",
            "date": "2015-04-26T13:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 186521,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575341.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shiruuia",
                "username": "shiruuia"
            },
            "url": "https://myanimelist.net/reviews.php?id=186521"
        },
        {
            "content": "This is going to be quite a short review since there are a lot of others who describe the story characters ect. I just wanted to share my view on this series. \r\nI love comedy and I saw someone recommend this one on some site. So i decide to put in in my list. It took me quite a while before I actually started to watch it. Mainly because I thought is was pretty old. But last month I decide to give it a shot. First impression. How the hell am I going to get used to the artwork? Because yeah its pretty bad. Thecharacters look like a bunch of girls drawn in a weird way. It almost made me drop the series instantly, but like every series I decide to give it a shot of at least one episode. Well, it was fun. Not hilarious but enough for me to want to see the next episode. So also with the second.. the 3rd... It took me a couple of episodes to get used to the artwork, but im so glad I stuck with it. This is a great great series. Even though the first couple of episodes were kind of overshadowed by the weird artwork making them less funny than they actually were meant to be. But every episode made me still curious for the next one. And after getting used to the way the characters are drawn lets say I found it hilarious! I laughed to much that even my bf was wondering what I was watching. He joined me one episode, of course first thing he said was \" they guys look like a bunch of girls!\" yeah yeah I know. Just try to look past that. Well he also loved it. \\n\\n\r\nI can understand that people have problems with the artwork, but trust me if you give yourself the chance to get used to it, you end up watching a very funny series with great characters because I think the characters are awesome! I loved them all, but most of all Sunako and Kyohei.  Their interaction is hilarious!\\n\\n\r\nWell as you can hear, I love this series and Im very glad I gave it a chance. \\n\\n",
            "date": "2018-10-23T01:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 292377,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4096351.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caranda",
                "username": "Caranda"
            },
            "url": "https://myanimelist.net/reviews.php?id=292377"
        },
        {
            "content": "\"The Wallflower\"\r\nI think this anime is best described as 'a hidden gem'.\r\nThere really isn't anything too spectacular about this anime. I still think it is worth watching.\r\nThe story line is kind of plain. Yet humor is still prominent in it. \r\nThe art is obviously an older style but modern for the time it was made. \r\nThe sound is fine.\r\nCharacters are 'unique'. \r\nI enjoyed this anime a lot and feel like the message portrayed is to not pretend to be something you are not. You can be beautiful in your own way as long as you stay true to you. Sometimes you need to be remindedof that so I appreciate the bigger message for such an obscure anime.",
            "date": "2018-09-22T12:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 289692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6390396.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aubreyaylaine",
                "username": "aubreyaylaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=289692"
        }
    ],
    [
        {
            "content": "The first time I watched this series I had watched the drama, which hadn't really caught my attention. I'd ventured on to find the anime, and sadly I learned my lesson when it comes to \"don't judge a book by its cover\". (Seriously, follow that quote). When it comes down to it this is a very uplifting anime and one that I ended up loving a lot (i'm looking forward to watching the drama now!). \r\nArt wise this anime was weird. I'm not sure how old it is (and I'm too lazy to check) but I was kind of turned off by the character artat first, which was why I had not even bothered to watch the anime. However, after watching it I began to enjoy the anime. The art style kind of grows on you. It's an acquired taste, like anchovies. \\n\r\nI don't really remembered sound...and I don't know how I would classify sound. I guess it was good? The voices felt right with the characters (subbed) and they supported their image. \\n\r\nNow the characters are like the real meat of this story. Yamato Nadeshiko is about Sunako Nakahara, whose aunt bribes four young men into turning her into a lady. In return they won't have to pay rent in the glorious mansion they reside in. Easy, right? The problem is Sunako has given up taking care of her image because she thinks she's ugly. All of this is explained, and in the end they even explain why her aunt wants her to become a lady (It felt kind of fudged though, like a last minute sort of explanation). Sunako loves gory stuff, horror movies, and things of those natures. She's terrified of 'bright people' (her catch phrase is \"Bright!\" I believe. She calls people who are too beautiful in her opinion that).   All in all I loved her the best, and I think she's one of my favorite characters. She retains her problems for a long time, and the main story line follows the four guys trying to attempt to make her into a lady. There are changes but they're subtle, more natural, which is what I liked. Kyouhei is one of the guys who wants to turn her into a lady (I would love to go on and on about the characters but I won't, sorry) because he doesn't wish to pay rent. This changes as you can see throughout the anime that he begins to slowly fall for her. It's not obvious at all, and at the end they never get together, but you can tell that he cares about her. I really wish they got together!!!\\n\r\nEnjoyment: I REALLY LOVED IT. :D\\n\r\nOverall: This was a great anime to watch despite the weird art style, when you get past that I feel like it's a nice one to watch if you want something not too long, and that's funny. I was laughing in a lot of episodes, my mom kept asking if I was okay.",
            "date": "2011-03-05T21:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 34920,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292056.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MuffinsAreLove",
                "username": "MuffinsAreLove"
            },
            "url": "https://myanimelist.net/reviews.php?id=34920"
        },
        {
            "content": "I don't see why people had reviewed this anime in a rather negative light and that just gave me an insight on how people fail to appreciate this wonderful anime.\r\nSure the anime art leaves little to be desired and let face it, art is an important aspect to any anime. The reason I have loved this anime is that it defies people's art conceptions with the story and humour quickly making up for it. The typical shoujo harem had characters completely in harmonising together regardless of their differences. \r\nI especially loved the character Sunako because she is not your typical weak and submissive heroine; sheactually have spunk and is very wise. Her character compliments Kyouhei's arrogance which I have really liked and it is Something that is lacking in recent shoujo heroines lately.\\n\\n\\n\r\nThe story itself is something girls like me can relate to, and it is something that had me sympathising with Sunako and understands her distrust around her new housemates or the fact that I have felt about Kyouhei's troubles regarding his own beauty. This anime also teaches how beauty is so valued that it sometimes overlooks what is really on the inside that it mattered.\\n\\n\r\nI love this anime and would brighten up your day if you gIve it a chance :)",
            "date": "2013-12-08T06:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 123015,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3391539.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Cherieciel",
                "username": "Cherieciel"
            },
            "url": "https://myanimelist.net/reviews.php?id=123015"
        },
        {
            "content": "I began watching this and the first thing that came to my mind was WHAT THE HECK AM I WATCHING?!?!?!? But I was proved wrong. It just goes to show that you shouldn't judge anything based on apperances and that in the end of it all is what this story is \"originally\" based off of. Plot twists and humor around every corner, at some points I was rewinding and re-watching parts because they were so hilarious. The characters are sterotypical but at the same time they hold individuality. I loved this anime simply for the pure genuis that is The Wallflower. If your looking forsomething new to try or just want to watch a good anime this is definatly one that you shouldn't miss.",
            "date": "2010-06-27T05:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 27658,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/333377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FangirlsAttack00",
                "username": "FangirlsAttack00"
            },
            "url": "https://myanimelist.net/reviews.php?id=27658"
        },
        {
            "content": "~D O N ' T J U D G E A B O O K B Y I T ' S C O V E R ~\r\nBefore you start thinking to yourself, \"I.. um.. don't really enjoy goth-like anime. I should not watch it.\" DON'T! I swear, it's soo good, it'll will make you wanna watch it over and over. Well I honestly liked it but even so, you might watch it and say it's trash.\r\nWhere do I start? well, first of all, THERE ARE NO SPOILERS! I wish I could but it's better when there's mystery for you :3 (muaahaha)\r\nThe whole theme of thisanime might seem Gothic and all dead related (which it kind of is, you'll notice how \"kind of\" after the first episodes) and maybe you are of those who like it, but I never liked that kind of stuff. So I didn't want to watch it at first. How did I ended up watching it? I GOT BORED. Yes. That's how I watched half of my anime list .__________. I do know I always end up judging a book by it's cover and damn it, I could've watch it earlier but didn't.\\n\\n\r\nThe story is honestly entertaining and different! I'll make this review shorter because I don't have to give too much detail. ITS DIFFERENT! not the same story where there's a girl and all the guys like her randomly because she's pretty and girly. No, not giving spoilers here! You'll see how this turns around but it's soooo funny and it has a goo develop throughout the anime. Characters have different personalities and well of course they might seem like other anime guys' ones but there aren't many left to create anyways. \\n\\n\r\nIt's not just a love/love story. It does have romance but how can I say it, it's like umm etoo.. not the kind you get jaded of. \\n\r\nIt's funny, and it doesn't go into too much in detail about everyone's past life but there isn't much to go into anyways. As long as you understand how they became like that. \\n\\n\r\nI enjoyed it a lot and I hope you do too. Watch it! I got hooked up after first episode xD love the heroine n__n\\n\\n\r\nIt's not every girl's story. For the weird (in a good way) kind!",
            "date": "2015-09-03T19:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 197765,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3839287.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/florizeta",
                "username": "florizeta"
            },
            "url": "https://myanimelist.net/reviews.php?id=197765"
        },
        {
            "content": "The story is fantastic! The premise is pretty standard but it delivers it in a new and fresh way. The whole set up is great and comedic gold. It is not very romantic but it is still very enjoyable to comedy fans. It had me laugh from the first episode to the end. I recommend clearing your schedule because if you enjoyed it you will binge watch it. The most enjoyable thing about this anime is the character interaction. All of the characters work together very well and often play off one another. If I had a complaint it would be the Art style. Thestyle is very distracting and takes away from the viewing experience. I am used to styles like Fairy Tail, OHSHC, and Full Metal Alchemist. None the less if you can get past the style like I eventually did you can have an enjoyable experience. Also for this one I recommend the English SUB because the dialogue seemed funnier then the DUB. Happy Watching!",
            "date": "2015-04-09T00:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 185195,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4542996.jpg",
                "scores": {
                    "animation": 4,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MoonPrincessPCMD",
                "username": "MoonPrincessPCMD"
            },
            "url": "https://myanimelist.net/reviews.php?id=185195"
        },
        {
            "content": "STOP!! If you have already watched the anime, go back and check out the manga; if you haven't watched this anime yet, then be sure to check out the manga first (it's awesome!).\r\n I must admit, when I had first watched this anime, the artwork was a bit of a turnoff (for some odd reason?), but then again \"don't judge a book by it's cover\". Not even halfway through the first episode, I found myself in tears because I was laughing so much. The story is unique and the characters are even more interesting. Each character has a special personality that you just can't helpbut to fall in love with. Yes, the story might seem odd at first but it's the oddness of it all that makes it so ridiculously funny. \\n\\n\r\nIf you're looking for something new to watch (or read) and want to have a (really) good laugh, then I highly suggest checking out this anime. =^_^=",
            "date": "2011-11-28T09:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 48225,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Emillia901",
                "username": "Emillia901"
            },
            "url": "https://myanimelist.net/reviews.php?id=48225"
        },
        {
            "content": "So I finished this series a few months ago but when I went to find it the name I knew it by (wallflower) was not on here so I had to leave it be. now that I have found it again I have to say that the English dub did have some alright voice actors but then also some of the characters were very pitchy. also the art style is very bland and dark but in all the anime is definitely something worth watching when you want a good laugh. (the screen keeps telling me to write a longer review help I cant submit thisand its already all I can say without spoilers)",
            "date": "2017-03-15T15:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 242661,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5380536.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DeadSam",
                "username": "DeadSam"
            },
            "url": "https://myanimelist.net/reviews.php?id=242661"
        },
        {
            "content": "I found this anime as something to watch on a rainy day. It was quite outstanding! \r\nThe Story?\r\n   Four \"dazzeling\" boys have to change a rather strange girl into a magnificent lady. The story line was predictable for the most parts but once you start you cant stop.\r\nThe Art?\r\n   Not the best but once you get used to it, it's just fine. It resembles Peach Girls style of art.\r\nThe Sound?\r\n   I give it a six.\r\nSubbed: Akira's voice is annoying and makes your ears bleed. The solution? Ignore it. It's the only terrible voice in there. Sunako's voice is alittle bothersome but you get used to it.\\n\r\nDubbed: Just don't watch it at all...o_O\\n\\n\r\nThe Character?\\n\r\n   The characters all played an important part in this anime. I rate it a seven. The reason behind this? The goth-loli sisters. They make no sense to me at all. Other than them, every character was needed to carry on the plot. Even with the amount of characters the act of heroism still remains.\\n\\n\r\nEnjoyment?\\n\r\n   The fact that this is a comedy should prove the enjoyment level of most. I give this a perefect 10. No more. No less. Episode after episode, you'll be-literally- rolling on the floor laughing!\\n\\n\r\nOverall?\\n\r\n I rate this anime a nine. If it wasn't for a terrible ending, it may have been a 10. If you get past the voice flaws and the ending this anime is quite good.",
            "date": "2009-08-10T08:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 17637,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/136691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dancer2713",
                "username": "dancer2713"
            },
            "url": "https://myanimelist.net/reviews.php?id=17637"
        },
        {
            "content": "I saw this anime about the time when it was being released and when I first got into anime. It frustrated me because I really got addicted to this series. It may be called  shoujo but it follows a different path. There is  no love triangle as there usually is in most shoujo (dont get me wrong I'm a shoujo fan as well) \r\nSunako is ridiculous, cool, and just overall way too funny. Kyouhei what can I say about him? I love him! He is a gluttony pretty... well beautiful boy who wants to play and eat. He gets harassed. Ranmaru helps toteasing him, Morinaga is quite but has his moments, and Yuki gets picked on most of the time but in a cute way.",
            "date": "2012-04-11T13:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 58563,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/327534.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SayaRose",
                "username": "SayaRose"
            },
            "url": "https://myanimelist.net/reviews.php?id=58563"
        },
        {
            "content": "What I like most in this Anime is how each character's personalities stand out. \r\nThey are 5 very different individuals living under the same roof, 4 gorgeous guys and a gorgeous girl(Sunako) who hides her prettiness in the dark. despite these differences; they're still able  get along with one another only  because of certain conditions, such as turning Sunako into an elegant lady.\r\n~A mission that seems impossible to carry out. Will they be able to turn this cocoon into a beautiful butterfly in time?\r\nThe background music is great, I find the beat catchy and it stays on my head for hours (\"Slow\" byKyoharu).\\n\r\nI also love the drawing, the body build of the characters are great and the way the artists drew their faces... just gorgeous!\\n\r\nI advise any one who craves for real comedy to watch Yamato Nadeshiko ^_^",
            "date": "2008-10-20T10:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 8819,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58236.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UnosukeMitsui",
                "username": "UnosukeMitsui"
            },
            "url": "https://myanimelist.net/reviews.php?id=8819"
        },
        {
            "content": "I was actually disappointed by this anime. I think they could have done so much more with with this story.\r\nThe male characters are fine and very good looking, lots of eye-candy here, but the girl they are suposed to turn into a lady is not credible. She's simply a very sick and selfcentered person. She's been through a trauma but her reaccion is exaggerated. It also bothers me that you hardly ever get to see her true form wich is actually very pretty. \r\nHaving read other reviews I kept watching thinking it would get better but it doesn't.\r\nIt might be worth seeing just becuase ofthe pretty boys though. There's lots of bare chests, glowing faces and sparkling eyes. : )",
            "date": "2010-03-24T13:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 24281,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/296099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dinkyhund",
                "username": "Dinkyhund"
            },
            "url": "https://myanimelist.net/reviews.php?id=24281"
        },
        {
            "content": "Anime: Yamato Nadeshiko Shichi Henge, also called The Wallflower.\r\n Through my understanding of this anime, The Wallflower is about four guys are trying to make their land lady's niece, Sunako Nakahara, into a fine young lady.\r\nThis is difficult for them because Sunako is not lady-like at all. She loves horror movies, internal organs, and anything that involves something dark and gloomy.\r\n The four guys, that need to accomplish this impossible tasks, are very beautiful and bright, they are also called \"The Creatures of Light.\" Sunako, who hates beautiful creatures, likes to stay away from them or else she will get nose bleeds because of howbeautiful they are.\\n\\n\r\nPros: \\n\r\n- Every anime is better with hot guys and weird girls.\\n\r\n- It was good how most of the guys didn't like the attention and try to be normal. (but they are just too beautiful) \\n\\n\r\nCons: \\n\r\n- The main picture for this anime, makes it look like it is a gothic host club or something. (which it is not)\\n\r\n- The guys looked like they weren't even trying to make Sunako into a lady.\\n\\n\r\nOverall-\\n\r\nIt was a strange anime and I didn't not like it.\\n\\n\r\nI would recommend this anime to people who like funny and chibi characters or characters that are beautiful, like guys for example. I would also recommend this to people who can relate to this anime.",
            "date": "2014-07-15T19:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 152221,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=152221"
        },
        {
            "content": "Story:  I thought it was a pretty interesting story, but most of the series isn't really focused on what the story is supposed to be about if that makes sense.  A lot of it was her developing her friendship and stuff, but not about turning into a lady as much, imo.\r\nArt:  Aghhhhh.  This was the worst part!  Sunako is in chibi form almost the whole show.  I kept looking forward to seeing her as an actual person, but it was quite rare.  They also did that to all the other characters, but not as much.  When thecharacters are shown as they really are, the art is pretty and different.  I just wish it was used more.  \\n\\n\r\nSound:  Sunako's voice didn't fit that well, and I felt like her voice changed from deep to high alotttt.  \\n\\n\r\nChracter:  The side characters were well developed and the main ones, too.  \\n\\n\r\nEnjoyment:  It was fun to watch!  It is totally hilarious.  I think the comedy factor is the best part of the show.  The ending is very unsatisfying, fyi, but i would still watch it.\\n\\n\r\nOverall:  I kept watching for the humor, but it was hard to watch with chibis the whole time.\\n\\n",
            "date": "2014-12-21T00:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 173397,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3923663.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/helloisabelle",
                "username": "helloisabelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=173397"
        },
        {
            "content": "I'm quite surprised that the anime has received quite a lot of negative reviews. The artwork did put me off initially but as episodes passed by, I began to love the anime and enjoyed it enormously. \r\nThe storyline and the characters were the greatest assets to the success of the anime; which improved with each episode. I also deeply appreciate the subliminal message of the show that many failed to see: the psychological effect of bullying (leading to Sunako's social anxiety disorder) and media's perception of what beauty is which is quite subjective. While Kyouhei, Takenaga, Ranmaru and Yuki did want to turn Sunako intoa \"beautiful\" lady, they came to realize that instead of forcing society's perception of beauty upon her, they accepted her for who she truly was and became Sunako's strongest support group. In the end, we were left with a bigger message: a woman's beauty is her self-confidence and acceptance of herself. I hope that everyone would give the anime a chance and take home the bigger message.",
            "date": "2015-05-23T21:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 188666,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4125167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/marmaladethot",
                "username": "marmaladethot"
            },
            "url": "https://myanimelist.net/reviews.php?id=188666"
        },
        {
            "content": "*It has no spoilers, but it does contain details that are mentioned in the summary*\r\nWhat do you get when you place a girl in a house with four bishies and the mission to turn the girl into a lady? If you said a reverse harem, with romantic moments you are completely wrong!\r\nWhen I first decided to watch this anime, I expected to see romantic moments, a girl trying to become a lady and four guys falling slowly for her. Well, this was definitely not the case! The girl doesn't want to become a lady, the boys are slowly trying to run away from their dutyand the romance is not spread out everywhere!   \\n\\n\r\nStory 8/10\\n\\n\r\nThe story is unique. There is a main girl that avoids mirrors and doesn't seem willing to change that, and a bunch of bishies running after her to get free rent! The lines are not following the usual shoujo cliche and the setting is something between -a maybe dark- comedy and parody. I would have given a higher rating if it was labeled as a parody, since sometimes it's difficult to take this anime as serious as a comedy should be taken. On the other hand, most comedy shoujo go a little over the top anyways...\\n\\n\r\nAnimation 6,5/10\\n\\n\r\nMost people were annoyed by the art (animation).\\n\r\nOne reason was the chibi moments. Sunako is a girl with little confidence and that reflects on her looks, appearing as a chibi. But when she gains confidence, her true form is shown. I personally really liked this metaphor and found it funnily realistic. \\n\r\nThe second main reason would be the guys looking like girls. This is something that made me think twice before starting the anime, although from a point on I stopped noticing it. But I understand how it could bother other people, hence my lower rating. The manga has a kind of pretty art too, so the anime falls flat on this.\\n\\n\r\nSound 7,5/10\\n\\n\r\nNot much to say! The sounds are ok, matching the plot and scenes, whenever I hear any of those tunes I instantly remember this anime. So even though it's nothing special, it managed to represent the anime's personality fine.  \\n\\n\r\nCharacter 9/10\\n\\n\r\nOne of the reasons I loved this anime is how good the characters felt to me. They are all weird! Starting with the main girl, a girl that feels ugly and is fine with it! She is a gothic lolita, without being attractive! If only they made her a little less psychotic with her obsessions!\\n\r\nAs for the other characters, they are pretty much all attractive people with flaws that make them look ridiculous at the end of the day! And I love how they spoil their images! None of the characters is perfect, but in this story they fit perfectly the way they are. Not to mention they make a cool group!\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nSubjectively, I enjoyed this much more than I expected! The perverted humor at times, the dark elements, the nosebleeds and the romantic moments that turned out ridiculous, they all made me laugh and enjoy this a lot!\\n\\n\r\nOverall 9/10\\n\\n\r\nI have to point out, this is subjective, since I really liked this anime. But I would place it among my top shoujo without a second thought! If I wanted to be more objective, maybe I would have given it an 8/10, especially due to the art.\\n\\n\r\nI tried to be objective about this, but who knows, maybe other people can enjoy it as much as I did!",
            "date": "2015-08-29T12:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 197415,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1753551.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlackYume",
                "username": "BlackYume"
            },
            "url": "https://myanimelist.net/reviews.php?id=197415"
        },
        {
            "content": "Just FYI, this is my first review :P\r\nOVERALL RATING: 8/10\r\nKyohei, Yukinojo, Takenaga, and Ranmaru are town celebrities purely because they are stunningly gorgeous. They live in a mansion with their beautiful landlady. But then, she makes a deal with the four boys: if they can turn her neice, Sunako, into a beautiful lady in 3 years, she will let them live in the mansion for free! But if not they're rent will tripple. How hard could it be? Nearly impossible seeing that Sunako is a scary, pale skinned \"creature of the darkness\" who giggles at horror movies and has nosebleeds whenever she sees someone beautiful!Can the four beautiful boys turn Sunako into a lady, or will they be sucked into the darkness?\\n\\n\r\nSTORY: 8/10\\n\\n\r\nThe story was very intriguing and was a great idea for an anime. It didn't really have a specific timeline, but it really didn't matter and was good in some ways. There is a lot of symbolism behind the events in this story, and although you may not be stunningly gorgeous or incredibly unattractive, I feel everyone can relate to this story.\\n\\n\r\nART: 8/10\\n\\n\r\nThe art was...average. It wasn't incredibly good, but not horrible either. It was as good as you would expect from a comedy series.\\n\\n\r\nSOUND: 6/10\\n\\n\r\nThe sounds in this anime were lacking. They didn't do a very good job matching the music with the scenes. The music they used for their dramatic scenes usually ruined the mood.\\n\\n\r\nCHARACTER: 9/10\\n\\n\r\nAmazing, likeable characters. I don't think there's one character in this anime that the audience couldn't like.\\n\\n\r\nSunako: Sunako was a very loveable character. Not only is she laugh out loud hilarious, but I think every girl in the world can relate to her in some way. We’ve all classified ourselves as “ugly girls” at one point, and we’ve all tried to avoid having to compare ourselves to other girls.\\n\\n\r\nKyohei: Kyohei was a bit hard to get along with in the beginning due to his aggressive, seemingly heartless nature, but as you get to know him, you begin to warm up to him. He did constantly make us laugh, however, and his relationship with Sunako is definitely cute.\\n\\n\r\nRanmaru: Ranmaru was a lot of fun. Many of the viewers may find his comments “sexist,” but that’s the way he is and adds to the humorous aspects of his character. His obsession with girls and his dramatic nature made him a very funny and lovable character in this series.\\n\\n\r\nYukinojo: Everyone loves Yuki. He’s the “cute one,” which is usually essential for a comedy anime. I love that he was always ending up in drag. It just made you love him that much more. He made me laugh my ass off. \\n\\n\r\nTakenaga: Takenaga was a bit…dull. He doesn’t stand out too well. But he did have some good moments. And his relationship with Noi was definitely cute.\\n\\n\r\nLandlady: The landlady’s flamboyant nature made me laugh my head off. She doesn’t get too much screen time, but when she was on the screen she was a very enjoyable character.\\n\\n\r\nNoi: Her obsession with Takenaga, her beauty, and her positive, cute attitude made Noi a very fun character. \\n\\n\r\nGoth Loli Sisters: I know they’re not even close to being main characters, but I’ve got to give them props. Whenever the Goth Lolis show up, you have to smile knowing they’re gonna do something totally random and funny. They kept me laughing through the entire series.\\n\\n\r\nENJOYMENT: 7/10\\n\\n\r\nI had to give it a 7 because it ended very abruptly, as if in the middle of the series.\\n\\n\r\nI definately reccomend this anime to any girl who's ever thought of themself as \"ugly.\" This is a very heartwarming, laugh out loud hillarious, and fun anime for pretty much anyone. Check it out!",
            "date": "2010-02-09T08:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 23084,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229998.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/manami-chan669",
                "username": "manami-chan669"
            },
            "url": "https://myanimelist.net/reviews.php?id=23084"
        },
        {
            "content": "What can I say about The Wallflower?\r\nThis is one of the craziest, silliest, funniest anime I have had the pleasure of watching. I love how the creators have managed to pack so much into 26 episodes. This show has got something for everyone and more.\r\nOne thing that stands out the most in the characters. The four boys are great but Sunako is almost as crazy as Haruko from FLCL. And if you know FLCL you know that's really crazy. Even the side character in this show stand out and help make the show great.",
            "date": "2011-04-12T07:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 35966,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Enju_Uoya",
                "username": "Enju_Uoya"
            },
            "url": "https://myanimelist.net/reviews.php?id=35966"
        },
        {
            "content": "Okay, I love the comedy in this anime but if art styles get you annoyed then I don't think you'll like this anime.\r\nStory: 7/10 Is about a girl named Sunako who's aunt asks these four guys to make \"Lady Like\" because she is amazingly creepy, weird, and considered ugly. Now if they accepted they'd pay less for the house but if they failed It would get higher I think. They accepted but little did they know about Sunako she was impossible to make a lady.\r\nArt: 3/10 Okay I almost dropped this anime because of the art It was just so ANNOYING it was like Ican't even explain how annoying it was. (But it's my opinion I just know a lot of people who also hate the art.)\\n\\n\r\nSound: 6/10 I used a website that has poor sound so I don't know.\\n\\n\r\nCharacter: 8/10 The personality of Sunako (The main female character) is absolutely hilarious I just love her. The reason I continued to watch this anime was because of the comedy.\\n\\n\r\nEnjoyment: 7/10 I enjoyed the comedy, I hated the art.\\n\\n\r\nOVERALL this anime is  a 7/10 I had to get rid of 1 point because i didn't like the art.",
            "date": "2015-10-03T07:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 200426,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RomanceZero",
                "username": "RomanceZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=200426"
        },
        {
            "content": "Gaaaaaaaah where to begin!? Why did I waste my time on this anime? WHY!?\r\nOk...I will say that this anime actually has a very good idea/premise...but that is ALL this anime has (And the ONLY reason I gave it a 3). Its annoying. The animation is god awful. Theres no progression in the story line. And its highly disappointing because it had promise to be something good!\r\nThe animation/art of this is so atrocious The men look like women, or ugly trannys to be more exact and yet the entire time you are being CONSTANTLY reminded of how beautiful these guys are supposed to be. REALLY? Someof them don't even have eyebrows! And they have disgustingly small lips! Theres nothing charming about the way they look at all, or act for that matter.\\n\\n\r\nAnd then the Gothic Lolli girls...omg...every time they were on the screen I wanted to shoot my computer. They weren't funny, they were freaking obnoxious! All of the protagonist girls were! Super ugly, super loud, and able to get under your skin in under 2 seconds flat!\\n\\n\r\nEven the main character is annoying! So much screaming/screeching over trivial things. Almost every episode you have to listen to her screech...and its a sound that makes dog howl (mine started howling when I had the volume up too high the first time). She doesn't seem to really make any progress in the entire 25 episodes and it ends pretty much the same way it started. With them being charged to make her not only into a lady (Which they failed) but into a super lady! Oh God....and the sexism of this show....the main character basically becomes a house wife/mother to the guys....hdafgukzfhak but I'm not going there, I'm done, I've ranted enough. \\n\\n\r\n*Sigh* Thats about all I'm going to say about this series. Huge disappointment. It could have been done in a decent way similar to Ouran High School. It actually could have been a great series if they changed pretty much everything, but kept the premise.",
            "date": "2013-09-01T12:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 111855,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3110399.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/steffen24",
                "username": "steffen24"
            },
            "url": "https://myanimelist.net/reviews.php?id=111855"
        },
        {
            "content": "This is a Reverse Harem, and it is a well done one.\r\nYou have your dose of comedy and gore and drama, all knitted perfectly. \r\nThe characters are colorful and you get your bit of social critic too, if you are paying enough attention. \r\nThe only thing that I wouldn't like about this are actually two things, and are the most common flaws of anime: the filling scenes that add nothing to the story nor the characters or even the comedy or enjoyment of the show AND how the 'ending' was done. \r\nAt this rate I am very well aware of which kind of matches Iam playing with, so I already know that finding a satisfying ending in anime is like finding the frigging holy grail. Some said that somebody has found it, but nobody no longer knows where it is hidden.",
            "date": "2018-05-17T01:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 280766,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7260990.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Nimurai",
                "username": "Nimurai"
            },
            "url": "https://myanimelist.net/reviews.php?id=280766"
        }
    ],
    [
        {
            "content": "Alright so the story is somewhat original but the main focus are the characters. Sunako (main character) is probably one of the most unique female characters of all time. She makes the story absolutely hilarious and I kept craving for more.  The characters each have very distinct personas, that I believe many have grown attached to. This anime presents itself with cliche situations turned into modern, more realistic endings. It may even teach a lesson here and there which we can appreciate.Most people will give this anime a poor rating solely due to the artwork and that's upsetting. Sure the male cast has some feminine characteristics but once you get over that the anime is very enjoyable. I definitely recommend.\\n\\n",
            "date": "2016-08-15T22:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 226828,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5606239.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AkariUchiha",
                "username": "AkariUchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=226828"
        },
        {
            "content": "Yamato Nadeshiko Shichi Henge is an intresting anime. I think that this anime is full of funny and unexpected moments that could make you smile an laugh throughout the series.But it also contains equal moments that can be sad, strange, and some moments where you will probably sit there and wonder, and i think that they all give the viewer a better understanding of the story. \r\nI enjoyed This anime, it was very good. A Hilarious and Fun comedy :)\r\nI recomend it to anyone who would likes to have a good laugh :))",
            "date": "2009-11-05T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 20277,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229023.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Captian_Yoodol",
                "username": "Captian_Yoodol"
            },
            "url": "https://myanimelist.net/reviews.php?id=20277"
        },
        {
            "content": "Kyouhei, Ranmaru, Takenaga, and Yukinojo are four gorgeous guys who make girls swoon without even trying.  Alas, they are not immune from financial woes and are in danger of being kicked out of their benefactress's mansion unless they do her one favor: teach her niece, Sunako, to be a lady.  This isn't as easy as it sounds, because Sunako is a slovenly shut-in with macabre interests and no desire to change.  Her best friend is an anatomical model named Hiroshi, and she can't get close to a good-looking boy without getting nosebleeds and fainting.  The boys aren't sure how to cohabitatewith her, much less give her a makeover.  Directed by \"Excel Saga's\" Nabeshin, the bulk of the show is pure situation comedy, charting the uneasy friendship that develops between Sunako and the boys, particularly their prickly leader Kyouhei.  And it also makes a few well-intentioned, but toothless attempts at commenting on the nature and perceptions of feminine beauty.\\n\\n\r\nThe show's visuals are very strange.  The boys are supposed to be super-attractive, but are drawn in a garish style that makes them look anything but.  For the purposes of the comedy and easier animation, the action will often switch to super-deformed character designs, so simplified they're practically stick figures.  Fortunately, the cheap visuals don't impact the shows strange but undeniable charms, and the series is at its best when it's at its most surreal.  The characters turn out to be genuinely likable and the show's message is a good one: beauty is all about self-confidence and self-esteem, so you can't change for anyone but yourself.",
            "date": "2009-11-08T02:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 20353,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/87795.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vienna",
                "username": "Vienna"
            },
            "url": "https://myanimelist.net/reviews.php?id=20353"
        },
        {
            "content": "Because this was one of the first anime I ever watched it will always have a very special place in my heart. But that doesn't mean that its bad.\r\n( also please remember this is my first review)\r\nStory:\r\nAs far as story goes theres nothing that is as awesome as a scary girl you only see in horror movies fall in love with the kind of guy you drool over and have dreams about.\r\nArt:\r\nWith the art there are time you can see the buget for the anime. For instance the main caracter is in chibi form over half the time, and the rest of the time shesa moster looking thing or incredebly beutiful. And as for the boys are white stick figures, but if your lucky you get tosee them all glitery ( or like ten times every episode ). But the way they have the art it makes all the characters more loveable.\\n\\n\r\nSound: \\n\r\nNow I have a bone to pick with the dubbers, I mean I love the actors but the scripters could have done just a tad better. but still i loved it. And I loved how they cussed some of the time, because if you know me personally you would know that I cuss alot.\\n\\n\r\nCharacter:\\n\r\nLOVED THEM! thats it i have nothing more to say.\\n\\n\r\nEnjoyment:\\n\r\nI FREAKING LOVE THIS ANIME! I have watched it about ten thousand times and still it never gets old.\\n\r\n in the end all I can say is that this is a awsome anime and I recomend it for wnyone and everyone ( I mean my sister loved it and shes my complete oppisite) anyways please please tell me how I did on this review because to be honest I think I talked a little too much about myself. thanks!\\n\\n\r\n                                            END!",
            "date": "2010-08-31T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 30133,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/355043.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/evil_princess14",
                "username": "evil_princess14"
            },
            "url": "https://myanimelist.net/reviews.php?id=30133"
        },
        {
            "content": "My love for this anime knows no bounds. After watching Ouran High School Host Club, I worried that I would never find another anime as attractive, sweet, and downright hilarious with such a special protagonist again. Well, I found it. Although I'm a sucker for the reverse-harem situation, what really makes this anime are the characters, especially Sunako Nakahara and Kyouhei Takano.\r\nAlthough the four boys here are very good-looking, this anime makes that into a plot device, showing that being attractive can be as much of a curse as a blessing. Kyouhei's constantly being kidnapped, stalked, mobbed, and sexually harassed, to the point where heneeds a police escort and dreads Valentine's Day.\\n\\n\r\nBut the best part is that this anime is that it's utterly hysterical, and if you can finish it without having \"Goth Goth! Loli Loli!\" stuck in your head, you're not enjoying yourself enough.\\n\\n\r\nNow, do beware that it's very strangely racist and...kind of ambiguous about being sexist or not. On one hand, the message is great, but on the other hand, girls do all the cooking and housework, and seem to enjoy it, because boys are hopeless at it. So I wasn't sure how to feel about that, though it only hindered my enjoyment a bit. To be fair, what anime isn't sexist or racist? Definitely check it out, especially if you're as enamored of Ouran as I was.\\n",
            "date": "2010-10-03T16:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 31040,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=31040"
        },
        {
            "content": "Yamato Nadeshiko Shichi Henge is one of my favorites, and I'm sure if you watch it it will be one of yours too.\r\nStory 9/10.\r\nLiving together with 4 beautiful boys in a big mansion? What could make a better story line, add the anti-social gloom and doom loving girl. Plus the goal to make her into a perfect lady when she obviously is hardheaded about staying in the darkness. And it gives you a perfect comedy.   \r\nBut what makes this story line unique is not that there are 4 pretty boys trying to make this girl beautiful, but the fact that it's notthe kind of thing where the girl realizes she's in love with the boy and they end up together all lovey dovey. Even though I wish there were more romantic parts I'm glad they didn't put to much into it. (If you are looking for it the manga has alot of perfect scenes that got cut out) The romance in this comedy is more subtle, but still heart warming in a funny way.\\n\\n\r\nI have to knock off one point, because there were the Goth Loli sisters and I think they gave them more time then needed.\\n\\n\r\nBut basically, I'm saying that the story is halarious and one of a kind.\\n\\n\r\nArt 9/10\\n\\n\r\nOkay, I don't really know why people say that they aren't to fond of the art. Personally, I think it's refreshing and some how diffrent. But I have to knock off to points because of Sunako. She is basically in chibi form through the whole season. It really kind of ruined it, because the other characters would bend down to talk to her which made it hard to see her as a full grown character and not a kid. So, they could have drawn her in normal form more. But other than that I really did like the art.\\n\\n\r\nI also loved the beginging, the art with the music made one of the best openings I've seen.\\n\\n\r\nSound. 8/10.\\n\\n\r\nIf you asked me before reading the manga I would have gave it a 9. But after reading the manga. The voices sounded really, annoying? Sanako sounded creepy, but that's supposed to be her personality. She just over emphasised the voice though. And Kyohei sounded a bit off after the manga. Haroshi bothered me the most... But I loved Yuki's voice. ^.^\\n\\n\r\nI'm giving it an 8 instead of a 6 because of the music. I loved the beginging song and other songs used. \\n\\n\r\nCharacters 10/10\\n\\n\r\nEach character contributed to the halarity of the show. The badass, the sexy smart guy, the cutie, and the womenizer. With sunako all under one roof was a perfect blend for comedy. \\n\\n\r\nEnjoyment. 10/10\\n\\n\r\nIt had me laughing most of the time and I couldn't stop watching it.\\n\\n\r\nOverall 9/10\\n\\n\r\nI'd love to give it 10/10. But even if it was my favorite I have to give it a 9 because of the little things that bothered me. I suggest you watch this, and if you like it. I do sugguest the manga, which has it's faults but its so much fun to read.",
            "date": "2013-06-01T10:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 99301,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650533.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SecretAnimeLover",
                "username": "SecretAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=99301"
        },
        {
            "content": "To be quite honest, when I first came across Yamato Nadeshiko Shichi Henge (YNSH in following text), I never had a slightest intention of viewing it. It may be that I don't have a thing for reverse harem stories, but, nevertheless, I didn't really think about it.\r\nStill, while reading some recommendations, people said they had a blast of laughter throughout with a dash of romance so I decided to pick it up. I kind of regret it, but, at the same time, I kind of am not. \r\nTo be honest, story is tragically bad, at least in my opinion. It never actually moves anywhere untilthe last 2 minutes of last episode, so it's kind of an annoying segment of anime. It's basically about four beautiful (...) guys trying to convert an ugly girl into a lady. The story does seem kind of ... stupid, but it had potential. The first couple of episodes were actually quite good, possibly leading to something great, but, in the end, it never really gotten anywhere. If you want to go into this anime for its amazing storytelling, don't. We do get bits and pieces of the background story from two characters, but overall, not much.\\n\\n\r\nAside from the story, YNSH has a lot of humor. For the first half of anime, I was laughing my ass off; still, in its latter half, the jokes became old and repetitive. Constant nosebleeds, kidnappings and dazzling quickly grew old and plain and it barely got me to finish the series, hoping for a satisfying ending (nothing there though).\\n\\n\r\nArt ... art is annoying, to be honest. Even after watching all 25 episodes, I still couldn't bring myself to accept those freekin' lips on the guys. They just seem out of place (REALLY OUT OF PLACE) and quite ... freaky to be frank. Also, the fact that Sunako spends 80% of the anime in her chibi form doesn't really bode well with me. Still, her scary faces and whatnot were quite well done - I was actually impressed. However, most of the time, backgrounds are plain and uninteresting with little to no imagination put into them. As I said, I couldn't get used to the art even after finishing anime. Sure, there are some pretty girls here and there, but since the main focus are guys, it's quite unbearable to stare at them for longer than 2 seconds because you want to puke. \\n\\n\r\nWhile we are at the character department, I also have some complaints. The characters lack ... any kind of development - I mean ANY KIND. The way you see the characters in episode one is the exact one you'll see in episode 25 - even our beloved Sunako, to whom this \"transformation\" is directed. We have bookworm, playboy, \"cutie\" boy, loud and annoying mouth-worm, annoying but lady-like aunt, goth-loli (don't ask), cute but love-struck girl, scary, ugly and overall plain girl and ... oh, it's enough. First of, if you're looking for the characters you can relate to, move on. It's impossible. Either they're super-uber-dazzling or they're just plain ugly. Of course, this servers quite well for some comedic moments, but ... it gets annoying after awhile. Even Takano, the only character that gets more than two lines of his past, is impossible to relate to since his \"sad past\" is derivative of utterly impossible circumstances. \\n\\n\r\nIf I say that I enjoyed this anime throughout, I'd be lying. Sure, I had my share of laughs of course, but a lot of times I was just withering in agony, waiting for SOMETHING to happen. If you're into massive, impossible and CONSTANT nosebleeds, sparkling men and ugly goth-loli girls, you will have a kick out of this series. I swear, it's impossible to count the number of nosebleeds in this anime. And they're not the simple ones; just the ones that can manifest the pool of blood. \\n\\n\r\nYamato Nadeshiko Shichi Henge is not a bad anime, don't get me wrong. However, the bits and pieces that are fun, original and hilarious are often overshadowed by its ridiculous setting, situations out of this world which are impossible to relate to, characters that are definitely not human and non-existent story. Still, it's worth the watch if you have nothing else major to complete.",
            "date": "2013-09-03T08:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 112043,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=112043"
        },
        {
            "content": "I liked this series very much. Main character reminds me of myself!\r\nSometimes animation is bad (i personally prefer when main character is drawn in normal anime style, not in chibi) but it isn't so bad neither.\r\nMusic is really great! I love japanese rock x]\r\nCharacters are very original.\r\nAbout the storyline: every character is unique. With time we get known each personality. Nothing is as it seems!\r\n'And also the ending... I loved it!\r\nBut sometimes this anime made me cry.",
            "date": "2008-02-13T03:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 2466,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/37179.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/animizu",
                "username": "animizu"
            },
            "url": "https://myanimelist.net/reviews.php?id=2466"
        },
        {
            "content": "After reading the synopsis, you're most likely to think that this will be another cliche riddled, bishounen filled, Ouran wannabe. But it's so much more. \r\nI'm not going to lie and make this seem like it's the most original anime out there but there truly is something about this anime that makes you go back for a re-watch. The sexual innuendos mixed with the comedic scenarios and well balanced characters makes this anime extremely enjoyable.",
            "date": "2015-03-16T13:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 182486,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4256271.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/masumi_amari",
                "username": "masumi_amari"
            },
            "url": "https://myanimelist.net/reviews.php?id=182486"
        },
        {
            "content": "Yamato nadeshiko shichihenge is a really good anime, I recommend it.\r\nIn my opinion, it's really good since the characters are realistic and they have distinct personalities. Their voice actors suit them. The story plot is amazing too, to get a girl change using the guys that live there free rent. Plus, THE FEEEELSSS, I understand exactly how the main protagonist feels her feelings are so realistic that I feel sorry for her even though shes a fictional character. The anime is really funny, I suggest you read the manga as well.\r\nI don't think that I have any negatives for this anime, but I really wishSunako has more chemistry with the characters and I wish it had alot of romance in it (because i'm so into romcom anime XD). I also wish for a season 2, ik it's too late for one, but I still need one ukjefnihwkejbfnekj!",
            "date": "2015-10-10T21:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 200952,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4928065.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ushi_Chan",
                "username": "Ushi_Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=200952"
        },
        {
            "content": "What can one say about this anime?\r\nWell i can say that i really like the main goal of the serie.That a group of 4 \"handsome\" guys are given the task to turn a hidden unkept woman into a real lady.\r\nBut the story drops that really fast as the guys seem to give up trying after a couple eps and usually just accept her odd behavior. Its heartwarming that they do but the main goal was to turn her into a lady.\r\nThe anime starts to overuse chibis after a few episodes and thats a bloody shame cause they girl in question is very pretty and itwould be more fun to see her panic in normal human form.\\n\r\nInstead we get to see her mostly as a chibi beeing treated like a 5 year old buy the guys.\\n\r\nThe guys are drawn very feminine and it can be offputting to many, including me.\\n\r\nAlso overuse of nosebleed..cmon, after a week or two she would start getting used to them.\\n\r\nBut the humor and my wanting to see Sunako and Kyouhei get togheter held me watching.\\n\\n\r\nIn the end i will give the anime a 6 cause while the style and chibis was offputting i enjoyed the characters, the humor and kept wishing for the two to get togheter.\\n\\n\r\nAll i can say is: Be patient with the anime and you will start to enjoy it.\\n\\n",
            "date": "2013-08-15T04:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 109747,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lij",
                "username": "Lij"
            },
            "url": "https://myanimelist.net/reviews.php?id=109747"
        },
        {
            "content": "Okay,  I though that I would try this anime because Vic is one of my favourite voice actors, but I started it, I have nothing against the plot line or the characters, I just can't stand the drawing of the characters, I might try to pick it back up and look past the bad drawing. I am not trying at all the bash the makers of this anime, it could be one of the best animes ever, but I don't think I can get past the drawing. I feel like I would get hate for this, but I am very picky about what animesI watch, and if they don't have at least drawing that is sort of good, I probably won't watch it.\\n\\n\r\nI dont know very much of anything about the anime itself, if other people like it thats fine, I won't hate on you for liking it, I don't really care but if you are picky about the drawing in animes like I am, you might be able to tolerate the animation in this, but I can't. Like I said, I might actually pick this anime back up, although I can't be sure.",
            "date": "2014-05-19T20:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 143881,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Otaku080499",
                "username": "Otaku080499"
            },
            "url": "https://myanimelist.net/reviews.php?id=143881"
        },
        {
            "content": "An excellent reverse-harem comedy series with a nice gothic twist.\r\nPLOT: Rarely does a show make such a strong impression with its 1st few episodes than Yamato Nadeshiko Shichi Henge does. I laughed till I cried during the 1st episode – think I watched it a few times and then made my sister watch it too.  The show has very strong beginning and end, but the middle is a bit flabby – these are mostly anime original episodes, but even the middle episodes are still entertaining. The humour is OTT with lots of slapstick and visual gags, which get recycled quite a bit but stillremain funny. There is also a fair bit of character development for the main characters, particularly Sunako & Kyohei throughout the series, but mainly it’s about the lulz.\\n\\n\r\nANIMATION: The art style takes a while to get used to – the character designs are not standard bishie fare, they look slightly odd and effeminate with their massive pouty lips, but once you get past that its fine – after all its really the reactions of the other characters to the bishies ‘dazzling good looks’ that makes the comedy work.  Sunako herself is very pretty when she’s in lady/kickass mode, but for the majority of the time she’s drawn as a chibi. All the characters are prone to revert to chibi form at the drop of a hat – it is a bit overused, but normally only heightens the impact of the humour.  Spontaneous showers of rose petals, sparkles & nosebleeds are also normal in Yamato Nadeshiko Shichi Henge to the extent that it’s a parody of overused shoujo conventions.\\n\\n\r\nMUSIC & VOICE ACTING: I remember that the soundtrack was very rock orientated with great OP & EDs and I also loved the voice cast to bits.  Sunako stands out for me as well due to her dramatic mood swings.\\n\\n\r\nOverall a fun comedy series – recommended if you just want to have a good laugh.",
            "date": "2013-04-19T01:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 94197,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194488.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Caraniel",
                "username": "Caraniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=94197"
        },
        {
            "content": "When I first found this show, I thought to myself: \"It sounds just like Ouran!\" And proceeded to watch about 10 episodes that day.  Now, however, I'm finding it difficult to finish it and here's why:\r\nStory: 7/10\r\nIt's similar to shoujo anime's like Ourah High School Host Club in that there's one girl surrounded by gorgeous men and doesn't seem to appreciate it.  This story is a bit different in the fact that the men have to change her from a horror movie loving loner to a lady or they are forced to pay the rent.  It definitely has humor and romance, whichis what most people look for in shoujo's to begin with.  The reason it's only good is because I think that the story never went any further than that.  They keep trying to turn her into a proper lady and each episode (so far) is completely stand alone.  (Keep in mind that I'm still trying to finish it and therefore this review could change if I find out that the story ever developed into something more interesting.  In fact, one of the reasons I'm struggling is because the story is so stale right now.)\\n\\n\r\nArt: 3/10\\n\r\nWhere do I begin?  As everyone has mentioned in all the reviews of this anime that I've read: the art sucks.  It's not just that the guys look like girls; it's that all the main characters look the same.  If you were to have all the \"dazzling creatures\" in this series and take away their hair and draw them in black and white; they would be the same character!  There is no telling the difference at all!  You can draw beautiful characters and still be able to tell who they are and what gender they are without their hair; Vampire Knight (my favorite art-not story- as far as anime and manga go) is proof of that.  Another complaint I have about the art is that the characters all are drawn poorly.  I don't mean the chibi characters, or the Goth Loli sisters (though those are also awful) I mean the eyes of the characters.  They are too wide and too large on the face.  Basically it would be as if I were to draw a face shape and fill it with only large eyes and large lips.  I know it sounds harsh, but that's what I think.  Why didn't I give the art a lower score then?  Because the frustrating thing is that there are good moments in it!  When Sunako is drawn at her full height and given the same art as those around her, the style of everyone improves.  The eyes become slightly smaller and the lips a little less full.  There are also more details in those small moments.  But I think you get the idea; I'll stop ranting now.\\n\\n\r\nSound: 8/10\\n\r\nThe music was the sole saver of this show; the only reason I still want to finish the anime at all.  No, I am not talking about the opening and closing songs; I disliked those as well.  I'm talking about the soundtrack itself.  It was written by the same composers behind Jigoku Shoujo (Hellgirl), Yasuharu Takanashi and Hiromi Mizutani, and those two work amazingly well together.  Sadly I can't find some of the themes from this anime that I enjoyed, since the J-drama's soundtrack seems to have all the attention.\\n\\n\r\nCharacter: 6/10\\n\r\nWell, back to the bad I suppose.   The male characters all had interesting back stories, in a way.  The same could not be said of the females, especially Sunako.  The fact that she became a depressed antisocial lunatic because one guy called her ugly is stupid.  Yes, words can hurt and guys are stupid, but after a few weeks you get over it and move on.  Every other girl, however, seemed to have no deeper motive than having one of the beautiful men fall in love with her, no matter what.  Characters like that embarrass all females.  But both the male and female characters, whether they had interesting back stories or not, did not develop in the 15 episodes that I've made it through so far.  Not a single step forward has been made by anyone aside from Kyohei, who is simply developing a crush on Sunako, for more than half of the show.  In other words, unless the show makes a drastic change in the last 10 episodes, the characters will have been bland, flat, and similar to each other all the way to the end.\\n\\n\r\nEnjoyment: 4/10\\n\r\nSorry, but this anime isn't that enjoyable, aside from the music and the humor.\\n\\n\r\nOverall: 5/10\\n\r\nI would recommend this to anyone who is looking for something that requires minimum thought to watch.\\n\\n\r\nIn closing, this review may seem mean, but frankly, this anime isn't worth it aside from the music.  From what I've read in reviews, the J-drama is much better, so if it's the story that interests you; I would check that out instead.",
            "date": "2012-12-19T23:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 80646,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1052411.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CatHime1",
                "username": "CatHime1"
            },
            "url": "https://myanimelist.net/reviews.php?id=80646"
        },
        {
            "content": "This was an interesting show, to say the least. Upon watching even the first few episodes I was making connections between it and other shojo that I'd seen before. However \"Yamato Nadeshiko Shichi Henge\" or \"The Wallflower\" as I will call it in this review, strikes me as completely satirical. It takes the elements of a traditional shojo and then just goes insane with it, over exaggerating the usual arch types and making them so loud and in your face that its hard not to feel a little dizzy just watching them. Its a fantastic sort of journey, which tries to take you outside thebounds of the general stereotypes, which is ultimately both refreshing and eyebrow-raising. \\n\\n\r\nHere's the plot. To summarize, there are four so called 'extremely attractive' young males living together in a giant mansion for some non apparent reason. When you first see this, the more well versed anime viewer might sigh and shake their head. But most of us already have some idea what we're in for. This isn't exactly the show you come to watch for some kind of deep philosophical thought here. \\n\r\nAnyway, these guys have to pay rent to their eccentric land lady, and its quite the chore for them to do so. She offers them a deal. They have to turn her niece, Sunako, into a real lady. If they do so, their rent will be free. If they fail, she'll triple it. Or something like that. Naturally, they think they can handle it. But then they all do, don't they? \\n\r\nEnter Sunako Nakahara. This chick is one seriously messed up kid, but that's what we like about her. Shes our emotionally damaged, twisted \"The Grudge\" inspired heroine. Partial to fawning over medical dummies, skeletons, slasher movies and the various other things infesting our nightmares, she is the one these four glamorous guys have to turn into a lady. Just how, HOW will they do it?\\n\\n\r\nThe plot isn't exactly what I would call a masterpiece but it is intriguing. You stumble into this mishmash of dazzling boys and roses and mansions and sparkles, and counter it with the dark and grotesque. Am I really watching a shojo? Well its more of a comedy. The presentation is a bit muddled. There's a lot of screaming, flailing and running around aimlessly. This aspect of The Wallflower gets a little more tolerable later, but I can't tell if that's really the show or if I just got used to it. Most of it seems to consist of filler, but I'm also pretty sure that's just the way it was written. It has a lot of \"wtf\" moments which range from both humorous to just stupid. There are also a number of characters with absolutely no point than to play on stereotypes and be annoying. And speaking of annoying, the way the anime dances on particular gender rolls can almost verge on insulting for both the male and female characters. Its not like they're meant to be taken seriously, but its noteworthy. \\n\r\nThe character Kyohei, for instance, who plays as the prominent love interest, all his problems stem from the fact that he is simply too beautiful for existence. Swarms, and I mean literal hordes of females, each with the same face and different hair, (As per usual animation laziness) rush to him at almost every waking moment. This happens with the other main guy characters, but its mostly Kyohei who receives the attention. In fact, every one of his problems in his life revolve around the fact hes so bloody pretty.\\n\r\nWhich leads me to the point that the show primarily revolves around appearances. The morals that it tries to teach us aren't exactly deep but they're still good values that really come through toward the end of the series. The Wallflower questions what it really means to be a lady, and to define what is attractive, something that's refreshing in an anime, I think.\\n\\n\r\nWhile I'm on that note, the overall visuals of the show can be hard to get used to. The main male characters look interesting, although their feminine lips and eyelashes were a bit disturbing at first. The female characters have little range in style and are all pretty much the same in character design aside from hair and eye color. The animation itself was nothing special and there was plenty of lazy stick figure drawings and chibi's to take up space in the hopes that they'd act to convey the humorous situations better. There was really nothing at all to say wow about, but there was nothing incredibly wrong with it either. It was effective but lackluster at best. \\n\\n\r\nThere's little to say about the music, as they only had one opening theme and two ending themes, all of which were nothing special. Though the second ending theme was catchy, I'll admit. Sound effects were standard. I had to watch the dub, as I wasn't able to find a Japanese version which I would have preferred to watch, but the English voice acting grows on you after you listen for awhile. At first it bothered me in such a way that it wasn't so much bad as there was one or two elements of the voice casting which were glaringly out of place.It kind of wears on you, giving you a feeling like you have a headache but you don't at the same time. After 25 episodes you kind of get used to it.\\n\\n\r\nIn any case, The Wallflower is an anime which is entertaining, and will appeal to shojo fans who like to laugh. It has most of the classic shojo episodes, including the mandatory trip to a hot spring and a school festival thing, each of which carrying a small twist that we usually don't expect. The characters aren't deep, but each carry one exaggerated element that doesn't make them unique but at least makes them funny. If you like the art style then there are plenty of bishounen/beshojo moments to swoon over, as well. I could go on, but I don't want to spoil it. For fans of Ouran High School Host Club, this is probably your kind of show, and even for you more curious folk who've simply wandered over to The Wallflower, reading this with vague interest, I'd recommend giving it a try.",
            "date": "2011-11-06T20:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 46985,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/795819.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tendrillar",
                "username": "tendrillar"
            },
            "url": "https://myanimelist.net/reviews.php?id=46985"
        },
        {
            "content": "At first I never really thought I was going to like it. I thought that the cover looked absolutely stupid, until the other night I was on Hulu... and I read the plot. It seemed really INTERESTING for me especially where it was giving me the all boys and 1 girl anime thing I love! Reverse Harem. I did watch the english dubbed. I know many people think the voice cast is horrible, but they did good in my opinion. I actually cried watching the final episodes.\r\nStory: 9/10\r\nI give the story a 9/10 because it was a great story. I just actually wished in thestory we saw Yuki's family and Takenaga's family. Overall it had the perfect story line that actually helped me. The Road To Womanhood thing is actually inspiring me, I know it seems weird or strange but Noi's character had encouraged for you to exercise, eat a well-balanced amount of healthy good, and drink lots of water and I have issues with that and it personally gave me more confidence in wanting to do it.\\n\\n\r\nArt: 9/10\\n\\n\r\nI give the art a 9/10. The art is absolutely amazing in my opinion and how the lips on the character's were. \\n\\n\r\nSound: 10/10\\n\\n\r\nI give the sound a 10/10. I loved the opening song, 'Slow' it just got me hyped for the episode and opening 1... MAKE SURE YOU DON'T HAVE IT IN FRONT OF YOUR MOM OR DAD..\\n\\n\r\nCharacter: 10/10\\n\\n\r\nThe character's had interesting personalities, such as Yuki's he had a cute;fearful personality which I found so cute. I loved him and I loved how he reacted to Sunako. Sunako and I related in personality because I have locked myself in a room many times and when it came to going out somewhere it wasn't completely easy. Kyohei's personality actually sorta reminded me of Kyoya from Ouran with a mixture of Gray from Fairy Tail, with a mixture of Yuri from Yuri On Ice but having similar looks to Usui from the maidsama series. Takenaga's personality was actually similar to mine as well. I loved his character and the voice actor who played him in English is my literally my spirit animal and inspiration, Vic Mignogna. Ranmaru's character was perverty somewhat and apparently loved Sl*tty girls... and that always killed me when he said that (I would laugh because I had a cousin who had them exact words on his bio for xbox)\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nIt was a somewhat-romance/a little reverse harem and Comedy anime series. I enjoyed it very much and it did very much remind me of Ouran\\n\\n\r\nOverall I give it a 10/10, because it was actually AMAZING! I recommend it to you",
            "date": "2017-07-10T23:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 252528,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201705.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KamisamaFairy624",
                "username": "KamisamaFairy624"
            },
            "url": "https://myanimelist.net/reviews.php?id=252528"
        },
        {
            "content": "The story is actually interesting and has a unique feel to it. I absolutely love the varying degrees of humor that it displays. It has everything from lighthearted to a bit of self-depreciating humor, which keeps the plot moving and allows episodes to be exciting. Some of the episode plots can seem to be sort of an old hat to people who have watched similar series, but it didn't stop my enjoyment of the anime in the least. In fact, it kind of made the series even more exciting because I got to see the characters try to get out of the situation in anew and interesting ways. The voice acting was superb, whether you watched it in the English sub or dub. I actually enjoyed it so much that I had to watch it in both. There was only one thing that I disliked in the anime and it was the characters: sometimes the characters fell into distinct troupes, which would detract from the anime's appeal. However, this was toward the beginning of the anime and actually became less frequent as the series progressed. The anime also didn't have a lot of romance to it. However, it is so entertaining that I really didn't notice it until I sat down to write this review (It was that enjoyable).  Definitely, recommend it, if you want a funny anime that has a bit of a slice of life feel to it.",
            "date": "2017-05-25T00:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 248479,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4187715.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OriginalPudding",
                "username": "OriginalPudding"
            },
            "url": "https://myanimelist.net/reviews.php?id=248479"
        },
        {
            "content": "I really loved this anime for it's characters and overall story line. I was let down a little with the lack of any romantic development but it did not ruin the enjoyment of the show. The art style is one that I tend to like but I know that some people don't prefer it. It wasn't really a reverse harem even tho it was listed as one.  \r\nThe main character is very interesting but i found that by the end I was getting a bit tired of the lack of development from her. Yes there was slight changes but nothing to be excited about.\r\nTheromantic story line was perfectly set up but then fell extremely flat. They could have made this into a very amazing love story if they had put the effort in. I know it was more of a comedy but it really left me wanting more out of it.\\n\\n\r\nThe secondary characters are simply amazing. They honestly make the show as good as it is. The comedy is silly and fun which helps take the edge off the lack of romance.",
            "date": "2016-12-01T20:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 234724,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4934829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kerikismet",
                "username": "Kerikismet"
            },
            "url": "https://myanimelist.net/reviews.php?id=234724"
        },
        {
            "content": "Call me superficial, but I could not stand the art. It's probably one of the ugliest (if not the ugliest) anime I've ever seen. At times, it was comical and at others it wasn't. Also, I didn't see the story going anywhere, really. I was expecting it to be something I could get into, considering that it was recommended for most of the shows I watched and loved, by this website and others. I couldn't find really any reasons  to enjoy this show, no matter how I looked at it. \r\nI realize that these may just be me, but I really wouldn't recommend thisshow to anyone. I don't know how it's constantly grouped with shows like LoveCom.",
            "date": "2016-08-08T18:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 226269,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 7,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Too_enthused55",
                "username": "Too_enthused55"
            },
            "url": "https://myanimelist.net/reviews.php?id=226269"
        },
        {
            "content": "I really like this anime. I've watched it three times I also read the manga because of my desperation on the ending. The story is outrageous. Imagine the heroine is living with four handsome guys because the guys badly want free rent in return they need to turn the heroine into a fine lady. I like how the story shows that you need to be yourself. I really, really like the opening theme song which is the Slow by Kiyoharu. I like how the seiyuu of Sunako voice the scariness when she become a serious, even when she shifts into Chibi the say is funnylike a small fairy. I also enjoy watching this because of how Takano Kyohei and Nakahara Sunako compete with each other. The down side of this anime is the art, although I still find the four protagonists as handsome. Fans of romance and comedy should try to watch it.",
            "date": "2016-07-26T00:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 225019,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5578695.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/atKatlin",
                "username": "atKatlin"
            },
            "url": "https://myanimelist.net/reviews.php?id=225019"
        }
    ],
    [
        {
            "content": "The series has got an interesting plot with cute and individual (and in Sunako's case weird) characters and is full of humorous and awkward scenes ... and a lot of romance (to Sunako's dislike)...  \r\nI am a real big fan of the manga, it's one of my favorites... but sadly... the anime cannot compare to the manga. One reason why I love manga are the awesome drawings... but the art in the anime isn't half as good. So the boys lose a lot of their cuteness... \r\nbut I really love Sunako's voice! It's so sweet! \r\nIf I had a choice, I'd choose the manga,but you should also watch the naime, if you're a real fan...",
            "date": "2008-02-20T08:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 2621,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38525.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Gewaltgoere",
                "username": "Gewaltgoere"
            },
            "url": "https://myanimelist.net/reviews.php?id=2621"
        },
        {
            "content": "Love this animel Ive rewatched it multiple times now and I can honestly say that it's one of my favorites.\r\nThe anime starts out very quickly and then the story moves a little slowly for my taste, particularly considering that its 25 episodes!! That said, Its an exciting transformation story that nevers fails to be interesting to follow.  I will say however that theres a lot of random crap that happens that is not vital to the story and doesnt even make very much sense. \r\nThe art would get a lot higher of a rating if the main characters, who are boys, didnt look likelesbian women.\\n\r\nThe sound is so-so, but the music is pretty without being sappy.\\n\r\nThe characters are fantastic, despite not nessasarily being developed thoroughly.  I think that the main chracters being sort of typical is making fun of the stereotypes we see in anime guys, and they are vital to the story.\\n\r\nOverall, this is definitley an interesting anime, and its full of surprises.",
            "date": "2012-07-03T12:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 65217,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/603053.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Brinkley",
                "username": "Brinkley"
            },
            "url": "https://myanimelist.net/reviews.php?id=65217"
        },
        {
            "content": "I love funny anime.  YNSH is a very light anime that has a plot which is not at all complicated.  It's good if you want something pretty cheesy and mindless to watch after a long day. Unfortunately, it wasn't as funny as I hoped, and the humor that was there was not at all witty and in fact pretty lame sometimes.\r\nStory: very simple plot, only a microscopic bit of romance.  The premise makes you expect that at every given chance, the four boys will be trying to force Sunako to become a lady, but they don't really try that much.  Ina way this was good because the subliminal message is accepting people for who they are and liking people because of how they treat you, even if some of their hobbies are \"scary\" or \"weird\" or even if they are supernaturally good-looking.\\n\\n\r\nArt: All the characters spend a good amount of time as featureless chibis.  When the characters were in non-chibi form, I thought the art was pretty bland, and I didn't like the male character designs.  They were all angles, plump lips, girly faces, and not at all manly.  Some anime characters can legit make me swoon. These men looked too girly 99% of the time, and I was totally turned off to them 5 minutes into the first episode.\\n\\n\r\nSound: I liked the opening and closing songs (the 2nd closing song better than the first).  I actually really like the BGM. There are little themes in the BGM that play during certain moods or types of scenes and I thought it gave the series some continuity.  It's also kind of fun sometimes when you hear a certain little jingle and you can think \"Oh, Sunako is going to go crazy in a second\" or \"yup, the boys are going to start dazzling any moment\", and then you are right. \\n\\n\r\nCharacter: The development is a bit more subtle than in some animes, which I didn't mind.  Sunako definitely grows more than any of the other characters.  The male characters are typical male anime tropes: \"cute and girly\" pretty boy, tall-dark-and-stoic, player/lover-boy, and hunky bad-boy.  It was interesting to see how they all felt differently about their looks.  In some reverse-harem animes, the bishies all know it and they love it, so it was refreshing to see that sometimes their good looks even caused some problems!  It was also nice to see how very different personalities got along, and neat to see how they had to learn to respect each other's feelings and boundaries.\\n\\n\r\nEnjoyment: after a long day of college classes and work, when I'm feeling pretty brain-dead and blah, this was ok to relax with and got me laughing a few times.",
            "date": "2013-08-28T20:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 111493,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208099.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xMiki-chan",
                "username": "xMiki-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=111493"
        },
        {
            "content": "I don't usually write reviews for animes but I just really have to write one for this. \r\nI have already watched this when I was in middle school. I was 9 or 10 back then, and every time I look back to the memory of watching this anime, I really smile because the memory I have about this series is so good. I remember going straight home after school just to watch every episode of this anime. Yamato Nadeshiko Sichi Henge never failed to make my cousins and I laugh every time we watched it. I still remember that I was the one who enjoyedit so much because my personality and attitude is much closer to Sunako than my other cousins, but although they didn't find themselves in the character of Sunako, they enjoyed the series just as much! \\n\\n\r\n2013, when I began watching anime series again, I thought of rewatching Yamato Nadeshiko because it brings so much good memories, but then I thought that my standard in anime especially the way it is drawn and animated has increased. I thought that maybe my taste in anime has changed since most of the animes I watched were all modern, and the appearance of the characters has changed. I thought I would not enjoy it as much as I did before, and forcing myself to watch it while momentarily comparing it to the modern animes would ruin my memory of it. But I was wrong. It all changed when I began rewatching it.\\n\\n\r\n2016, my classmate gave me a copy of the whole episodes of Yamato Nadeshiko, and she told me she has re watched it and enjoyed it so much. After watching Ao Haru Ride,, I decided to finally rewatch Yamato Nadeshiko. AND LORD ALMIGHTY, I REALIZED THAT NO MATTER HOW \"OLD\" YOU MAY THINK IT IS, IT IS STILL FAR BETTER THAN THE MODERN ANIMES. LIKE GOD, I WAS SO WRONG WHEN I SAID THAT COMPARING IT TO MODERN ANIMES WOULD RUIN MY MEMORY OF IT. IT DID NOT! In fact, I began loving Yamato Nadeshiko even more! Most of the modern animes I've watched are stark, and have many \"silences\". Silence is what I call those scenes and parts that are quite awkward and are kind of boring/uninteresting/unnecessary/irrelevant. But in Yamato Nadeshiko, there are no silences! The way it is dubbed in Japanese is soooo freaking amazing! I like the way the characters yell HAHA I always wonder how they recorded that. EVERY EPISODE IS HILARIOUS! Although it is a Shōjo anime, everyone would really enjoy it! Adult or not, it would really make you laugh! The music that they used in the scenes are also appropriate and I could tell that they were deliberately selected haha Also paired with the scenes in the anime, they are really funny! The way it was animated and drawn is also amazing! I always think if the animator/artist ever got tired of drawing/animating them! This is really a UNIQUE, FUNNY, and AMAZING anime! \\n\\n\r\nI remember my teacher telling me that what makes a great film is the things that it leaves its viewers. And I tell you what, when I rewatched this, I frequently smile because even though it has been around 8-9 years ago, I still remember most of the episodes, as well as the values it taught me. :)",
            "date": "2016-03-25T01:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 213991,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sunako_N",
                "username": "Sunako_N"
            },
            "url": "https://myanimelist.net/reviews.php?id=213991"
        },
        {
            "content": "Im going to start off with the flaws in this anime. First off im definitely with everyone one else in saying that the art is terrible! I have seen worse, for example shin chan....but obviously they did it to be funny. To me the artist made me feel that maybe they thought beauty for them was in the lips and eyes. Doing so made the men look girly and throwing the main characters into chibi form all the time upset me and makes me think it wasn't out of comedy, but purely laziness! The way they have drawn the characters gives a lower rating tothe show, or in cases like me shut the show off all together. \\n\r\nIn the good side of this anime I did find myself laughing alot and fell in love with the main characters, not only did I find the main female lead intriguing but she was perfect and the complete oposite of what you would figure her to be. They did use alot of the same plot I saw in ouran host club but for me thats what made it work. My person opinion is that they could have used more romance for the two to keep veiwers on edge and satisfied in the end. \\n\\n\r\nOut of all the animes ive seen, I have got to say this one is a bit odd for a comedy, but in a good way and im glad i did not shut it off. I would recomend this anime to every one needing a good laugh ^_^",
            "date": "2011-05-25T21:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 37319,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/454026.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lovelessxd",
                "username": "lovelessxd"
            },
            "url": "https://myanimelist.net/reviews.php?id=37319"
        },
        {
            "content": "story-7\r\nit was a good story line and i couldnt wait to watch t after i read the plot, but honestly i was a lil disapointed.\r\nart-7\r\ni have seen worse art... but i have also seen better. not the best in my oppinion.\r\nsound-7\r\nfairly good\r\ncharacter-7\r\ni found a few things with each character that bugged me and i didnt like. but they were pretty good i guess.\r\nenjoyment-7\r\nas i said i was a little bit disapointed. i thought this anime sounded a bit better then it was.\r\noverall-7\r\nit was ok",
            "date": "2013-02-04T15:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 85865,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1964064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/katlee8225",
                "username": "katlee8225"
            },
            "url": "https://myanimelist.net/reviews.php?id=85865"
        },
        {
            "content": "I must say; this was conglomeration of happy for the retina! I started this anime because of the reverse-harem male character art  - and to my utmost pleasure; it did satiate my expections. \r\nMoving along. The story epitomised great art; great character development; great story and not-so-great sound - to be honest; i dont even rememember the theme song. Not to worry though; even with this missing element every other aspect made up for it. \r\nStory\r\nPATH TO ENLIGHTENMENT - you will know what i speak of when you watch it, as you will do after feasting your eyes on my boredom- inspired review writing.The story line was very original - 1 girl (however creepy she may be) and 4 supposedly good-looking males who attempt to turn her into a lady - their fruitless attempts fused with the absurd situations which unravel are the comedic aspects of this anime. I was amused if anything. \\n\\n\r\nArt\\n\\n\r\nIt took some time adjusting to this art with its obsession with bi-shounen features - however after the first episode or so I began to really enjoy watching the character art. \\n\\n\r\nSound\\n\\n\r\nUM. what sound? I forget. Lets skip these inconsequential details.\\n\\n\r\nCharacter\\n\\n\r\nSunako - the main shoujo! LOL. epitomised. Her persona was indicative of the oppressed and repressed. Her love for all things dark and creepy resulted from a harsh rejection as a yougen; rendering her unable to witness all things bright and beautiful - THAT IS - the 4 hotties in the series. Nose-bleed aftermaths were a common occurrence.\\n\\n\r\nEnjoyment.\\n\\n\r\nLike copious chocolate consumption - it was a thoroughly enjoyable. I suggest you watch it. \\n\\n\r\nLaters.",
            "date": "2009-12-18T03:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 21474,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/pseudonym",
                "username": "pseudonym"
            },
            "url": "https://myanimelist.net/reviews.php?id=21474"
        },
        {
            "content": "Story:10 The plot of the story is great,you have a girl who isn't  particular a beauty,who lacks social skills and is obsessed with horror movies and things a normal girl would try to avoid at any cost,4 really handsome boys,one big mansion which rent is really high and a energetic aunt who only desires 1 thing and that is to turn her niece in a proper lady which is basically the most impossible thing on the earth!What do you get if you add them all together!Yes,you've guessed right!You get one heck of a story called YAMATO NADESHIKO SHICHI HENGE!!!!!\r\nArt:9 I've noticed that most ofthe people who have watched this anime said that the art was bad and could have been better,but I personally loved the art and wouldn't want it to be any different.But this is only my opinion!!\\n\\n\r\nSound:9 The sound was great especially the background sound,it matched the anime perfectly!The images of the OP song were not that original which I think was an issue due the popularity of the series!but from ep 14 and on it got original images.I personally loved the 2nd ED song.It got a great beat and is so funny .\\n\\n\r\nCharacter:10 The characters in this series are some of my favorite anime characters.There isn't one character that you won't love.How can you especially not LOVE Sunako and Kyouhei.They're so damn funny!!\\n\\n\r\nEnjoyment:10 I've never enjoyed a shoujo anime as much as I did this anime.This anime kept me entertaining from the beginning till the end.There wasn't an episode where I didn't laugh till my belly hurt.I was really sad when I finished watching this anime,but  as the manga goes on I really hope from the bottom of my heart that we will get another ass kicking season!!\\n\\n\r\nOverall:10 I think that everyone should give this anime a shot.I think that everyone can enjoy it.If you love a good comedy,you  should definitely  watch this anime.\\n\r\nSo give this anime a try and you certainly won't be disappointed that you've watched it,I know I wasn't!!!!:)",
            "date": "2010-06-12T09:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 27073,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/339284.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Geet",
                "username": "Geet"
            },
            "url": "https://myanimelist.net/reviews.php?id=27073"
        },
        {
            "content": "This is like one of those 1980s sitcoms, but in a good way! First, the writer establishes a cheesy but lovable premise. In this case, there are four gorgeous guys (who should all be supermodels) staying in a lavish mansion. Their landlady tells them she's leaving them in charge, and that they can have free rent if they agree to take her niece under their wings and teach this girl how to be \"a real lady.\" Now for the sitcom kicker: The niece (Sakura) is a horror maniac and a shut-in who hates people (especially beautiful people!) and looks a lot like the ghost fromThe Ring. \\n\\n\r\nThe cartoon graphics are chaotic and all over the place, switching from fancy bishoujo images to chibi and even to stick figures in some instances! The best part of the sound, in my opinion, is the ending sequence song \"Carnation\" by Kiyoharu; coupled with a cute animation of Hishori/A-tai (the lead character's medical mannequin) dancing to the music. \\n\\n\r\nI absolutely loved Sakura's character and that, even though she was picked on for what she liked, she never changed to fit other people's expectations of her. There is even a little love interest between her and the strongest male in the group, Kyouhei, although their relationship never gets very far.",
            "date": "2013-07-17T15:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 105777,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2704609.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MDDuggan",
                "username": "MDDuggan"
            },
            "url": "https://myanimelist.net/reviews.php?id=105777"
        },
        {
            "content": "Yamato Nadeshiko Shichi Henge was actually better than I thought it would be. If you liked Ouran highschool host club then you will probably really enjoy this anime. \r\n       It relates to girls who have been bullied for their appearance and the affects it can have on someone. It's amazing how one name can change a girl forever. okay okay, this anime isn't all blah blah blah lovely lovey girly issues. It's actually much more than that. more comedy than anything. ( the manga has more, but overall I was rather pleased with this anime)I know the art is a little frustrating, but If you're willing to look past the strange art than you're in for a great anime. I think the anime is drawn like this to capture sunako's true beauty.",
            "date": "2013-02-25T15:39:00+00:00",
            "helpful_count": 0,
            "mal_id": 87875,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2061299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lilotaku927",
                "username": "lilotaku927"
            },
            "url": "https://myanimelist.net/reviews.php?id=87875"
        },
        {
            "content": "If you’re looking for an anime which is purely comedy, this could be the one for you. Perfect Girl Evolution is about a girl who enjoys the darkness and is psychologically allergic to beautiful people. Unfortunately for her, she is to stay in a mansion with four bishounen. \r\nThe core idea of the story lies in turning Sunako-chan into a perfect lady and (perhaps, through) developing love between her and one of the guys. But the anime, being heavily comedic, digressed much from the main idea. \r\nNonetheless, it is highly enjoyable for those who simply fancy comedy despite its ridiculousness. A light anime with highrewatch value as it is hilarious. There’s not much to be appreciated about the art, though, seeing that it is rather rigid and the supposedly good-looking guys really look like girls.",
            "date": "2009-12-14T17:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 21391,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ilyssacrescent",
                "username": "ilyssacrescent"
            },
            "url": "https://myanimelist.net/reviews.php?id=21391"
        }
    ]
]